{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28577", "minValue": "21853", "unitText": "YEAR", "value": "£13.00 to £17.00 per hour DOE"}}, "datePosted": "2019-10-17T11:01:31+0100", "description": "&lt;p&gt;&lt;em&gt;It is really important that our team feel safe when coming to work. We are taking extra precautions in all of our homes, including having freely available PPE, enhanced cleaning, strict hand hygiene, daily temperature checks for all team members and access to the latest information and training. As well as this, we always ensure that we are working in line with the latest Public Health England guidelines. More information on COVID-19 and our commitment to our staff and residents can be found on our website.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Come and join our family!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Westgate Healthcare is an award winning family run company with over 20 years of experience in providing high quality care.Established in 1993 with the acquisition of a small residential care home, Westgate Healthcare Group, has grown steadily into a company that comprises of care homes in the Hertfordshire, Buckinghamshire and Essex regions, delivering a wide range of services including residential care, nursing care, intermediate care, palliative care and dementia care.&lt;/p&gt;\n&lt;p&gt;We are looking for Band 5 or Band 6 Occupational Therapists to work in our rehabilitation unit within our care centre based in Ware, Hertfordshire. You will provide Occupational Therapy assessment, advice and rehabilitation to clients discharged from hospital for further rehabilitation. You will be an experienced Occupational Therapist with good clinical knowledge within the elderly care sector and within a rehabilitation unit. This role does involve working in an environment with elderly clientele therefore a kind, respectful and caring attitude must be upheld at all times.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Call our recruitment team to enquire: 0800 024 8756&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;…or pop in and visit our home any time for a chat over tea and cake!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THE ROLE:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To undertake OT assessments and provide rehabilitation to residents discharged from hospital for further rehabilitation&lt;/li&gt;\n&lt;li&gt;To provide OT advice to service users, carers, family and multidisciplinary team members&lt;/li&gt;\n&lt;li&gt;To provide assessment for and provision of equipment through Medical Equipment Loans Service&lt;/li&gt;\n&lt;li&gt;To conduct access visits as necessary to identify equipment requirements and ensure safe discharge&lt;/li&gt;\n&lt;li&gt;To attend Multidisciplinary Team meeting to review service user needs and plan discharge&lt;/li&gt;\n&lt;li&gt;To accurately maintain records and document in a timely manner&lt;/li&gt;\n&lt;li&gt;To attend and participate in team meetings and in-service training&lt;/li&gt;\n&lt;li&gt;Providing training to care staff on assembly of equipment for residents&lt;/li&gt;\n&lt;li&gt;As part of a team within a Nursing Home, take interest in Service Users throughout the Home as well as with the Intermediate Care Clients and assist in activities for Service Users providing exercise where appropriate&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Health and Safety:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensure Health &amp; Safety standards are monitored and any shortfalls identified and reported to the Manager&lt;/li&gt;\n&lt;li&gt;Have full knowledge of the Fire Procedures, fire escapes and a working knowledge of the firefighting equipment&lt;/li&gt;\n&lt;li&gt;Have full knowledge of and take responsibility to ensure adherence to infection control policies and procedures of the Department of Health and the Company at all times Other Responsibilities&lt;/li&gt;\n&lt;li&gt;Be fully conversant with the Health Professions Council / Chartered Society of Physiotherapy codes of practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT YOU:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Right to live and work in the UK&lt;/li&gt;\n&lt;li&gt;Hold a degree or equivalent in Occupational Therapy&lt;/li&gt;\n&lt;li&gt;State registered with Health Professions Council&lt;/li&gt;\n&lt;li&gt;Maintain own clinical professional development (CPD) by keeping up to date with new trends and developments in area of work&lt;/li&gt;\n&lt;li&gt;Ensure evidence based practice is used to inform own clinical practice&lt;/li&gt;\n&lt;li&gt;To have an understanding of the occupational clinical practices and procedures within a multi-disciplinary team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT’S ON OFFER:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary (depending on band and experience)&lt;/li&gt;\n&lt;li&gt;Work in a friendly team with experienced staff&lt;/li&gt;\n&lt;li&gt;Opportunities for career progression&lt;/li&gt;\n&lt;li&gt;Free uniform and DBS cost refunded when you pass probation&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;‘Refer a Friend’scheme with financial rewards&lt;/li&gt;\n&lt;li&gt;We pay you to attend induction, training&lt;/li&gt;\n&lt;li&gt;Great benefits package including cycle to work scheme, long service awards and access to a wide range of amazing offers and retail discounts from hundreds of nationwide high street and online stores&lt;/li&gt;\n&lt;li&gt;A positive and enjoyable work environment where we listen to your ideasand celebrate your achievements&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Come and make a difference with the team at Westgate Healthcare! #&lt;/strong&gt;&lt;strong&gt;CareWithUsAtWestgate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For more information on adult social care jobs with Westgate Healthcare visit our website or speak to a member of our recruitment team on 07508 907 679.&lt;/p&gt;\n&lt;p&gt;Due to a high volume of applications, if you do not hear from us within 5 working days, please assume that your application has been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“We are an equal opportunities employer and welcome applications from all suitably qualified persons regardless of their race, sex, disability, religion/belief, sexual orientation or age.&quot;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Westgate Healthcare Group Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135377"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ware, Hertfordshire", "postalCode": "SG12 7LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8164", "longitude": "-.023452"}}, "title": "Occupational Therapist (Bank Staff)", "url": "https://www.jobs.nhs.uk/xi/vacancy/915799169", "validThrough": "2020-12-28T23:59:59+0000"}