{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34510", "minValue": "27373", "unitText": "YEAR", "value": "£27,373.50 to £34,510 DOE (Preceptors £22,465)"}}, "datePosted": "2019-08-09T13:00:25+0100", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Lakeside View is a 32 bedded hospital in Willenhall that cares for patients who are 18 years and over in an acute setting.&lt;/p&gt;\n&lt;p&gt;Finch Ward - 12 bedded male acute ward&lt;/p&gt;\n&lt;p&gt;Robin Ward - 8 bedded male acute ward&lt;/p&gt;\n&lt;p&gt;Swan Ward - 8 bedded female acute ward&lt;/p&gt;\n&lt;p&gt;The aim at Lakeside View is to provide a person centred approach and therapeutic environment, which promotes collaborative care planning to optimise treatment goals. Right from the point of admission to our acute services, our aim is to support patients to be discharged safely back into the community where they can continue to progress towards recovery in a less restrictive environment.&lt;/p&gt;\n&lt;p&gt;This will be achieved by:&lt;/p&gt;\n&lt;p&gt;• Thorough assessment of individuals needs throughout admission&lt;/p&gt;\n&lt;p&gt;• Person centred collaborative treatment plans&lt;/p&gt;\n&lt;p&gt;• A range of interventions available from a diverse MDT&lt;/p&gt;\n&lt;p&gt;• Being cared for in the least restrictive environment&lt;/p&gt;\n&lt;p&gt;The acute wards on site provides patients with excellent space and facilities, including en-suite bedrooms and large living spaces furnished with activity equipment such as games consoles.&lt;/p&gt;\n&lt;p&gt;Outside of the wards, a purpose built therapy suite contains a rehabilitation kitchen for patient cooking sessions, and a sessional therapy room. The hospital is set in the centre of an extensive nature reserve, which contains an abundance of flora &amp; fauna. The site also has areas for outside sports activity.&lt;/p&gt;\n&lt;p&gt;The clinical team at Lakeside View encourage full involvement of the service user, their family and external professionals throughout their stay. They are invited to attend Ward Reviews and CPA meetings to ensure clear communication throughout the care pathway in order to promote individuals&#39; recovery and facilitate discharge.&lt;/p&gt;\n&lt;p&gt;In order to maximise recovery, interventions offered include a wide range of therapeutic approaches, combining psychiatric and cognitive behavioural perspectives with occupational therapy, psychology, leisure and recreational activity.&lt;/p&gt;\n&lt;p&gt;Providing leadership and support for support staff and act as a champion for patients safety and dignity.&lt;/p&gt;\n&lt;p&gt;Maintaining skills and knowledge and ensure that care is delivered according to latest guidelines and best practice evidence available.&lt;/p&gt;\n&lt;p&gt;Ensuring the ongoing safety of service users, residents, staff and visitors through systematic assessment, monitoring and reviewing processes.&lt;/p&gt;\n&lt;p&gt;Ensuring that clear and accurate records and communication systems relating to clinical and care delivery are maintained and effectively used.&lt;/p&gt;\n&lt;p&gt;Acting as a role model for good clinical and care governance practice.&lt;/p&gt;\n&lt;p&gt;Taking charge of the unit regularly and, in the absence of the management team, accepting responsibility for the smooth and effective running of the unit.&lt;/p&gt;\n&lt;p&gt;Helping to maintain the security of the building and its environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We want to invest in you and your future! Find out about our career pathways.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Willenhall, West Midlands", "postalCode": "WV13 3AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5927", "longitude": "-2.06873"}}, "title": "RMN  £3,000 Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/915703330", "validThrough": "2020-11-27T23:59:59+0000"}