{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28577", "minValue": "21853", "unitText": "YEAR", "value": "£13.00 to £17.00 per hour"}}, "datePosted": "2019-10-04T10:22:38+0100", "description": "&lt;p&gt;&lt;em&gt;It is really important that our team feel safe when coming to work. We are taking extra precautions in all of our homes, including having freely available PPE, enhanced cleaning, strict hand hygiene, daily temperature checks for all team members and access to the latest information and training. As well as this, we always ensure that we are working in line with the latest Public Health England guidelines. More information on COVID-19 and our commitment to our staff and residents can be found on our website.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job type&lt;/strong&gt;: Casual / Bank (to cover staff absence)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary&lt;/strong&gt;: £13.00 to £17.00 per hour&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours&lt;/strong&gt;: Casual&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: Westgate House Care Centre, Tower Road, Ware, Hertfordshire, SG12 7LP&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for a dream job in elderly care where you can really make a difference? If so, come and join our family!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Westgate House Care Centre in Ware, Hertfordshireis part of a family run, award winning care home group. We care for elderly residents with a variety of nursing needs. Though our home is 109 beds, we have a 20 bedded Intermediate Care Unit complete with a private rehabilitation gym facility. We are looking for Physiotherapiststo join our fantastic multidisciplinary team on a casual basis to cover staff absence. You will work closely with other Westgate team members to support ourelderly residents, usually discharged from hospital, to rehabilitate and return home with the right care package.&lt;/p&gt;\n&lt;p&gt;In the role you will manage your own group of residents and will be expected to use specialist Physiotherapy techniques to facilitate rehabilitation. As part of the team you will also provide leadershipto the junior therapy assistants and will contribute to developing, supervising and appraising them. You will work collaboratively with internal and external professionals, including Occupational Therapists, Doctors, Social Workers and so on, meeting when required and sharing information to help our residents achieve their goals.&lt;/p&gt;\n&lt;p&gt;Westgate House is located inclose proximity to the town of Ware, offering numerous local shops and amenities and easy access to Ware railway station. We have a friendly team and we believe in kindness, compassion and innovation. We will listen to your ideas and work with you to help you be the best that you can be! We also offer agreat benefits package,training and development opportunities and a positive working environment.&lt;/p&gt;\n&lt;p&gt;We are looking for passionate Physiotherapists who will be involved in:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Effectively managing a caseload of Service Users requiring rehabilitation from their initial assessment on arrival to creating individual care plans and delivering an individualised treatment programme for each resident&lt;/li&gt;\n&lt;li&gt;Agreeing goals with Service Users and care team appropriately and planning timely, safe discharge including measures to enable ongoing management/care&lt;/li&gt;\n&lt;li&gt;Liaising with health and social care colleagues and attending multi-disciplinary meetings and case reviews&lt;/li&gt;\n&lt;li&gt;Using reflective practice as a tool for continuing professional development&lt;/li&gt;\n&lt;li&gt;Maintaining effective communication by providing and receiving clear and accurate information, orally, in writing and electronically&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT YOU:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Right to live and work in the UK&lt;/li&gt;\n&lt;li&gt;Degree in Physiotherapy and registration with the Health and Care Professions Council (HCPC)&lt;/li&gt;\n&lt;li&gt;Good knowledge of Health and Care Professions Council (HCPC) / Chartered Society of Physiotherapy codes of practice&lt;/li&gt;\n&lt;li&gt;Good communication skills&lt;/li&gt;\n&lt;li&gt;Ability to work as part of a team&lt;/li&gt;\n&lt;li&gt;Previous experience in a care home environment or in working with the elderly is desirable but not essential&lt;/li&gt;\n&lt;li&gt;Applicants must have a desire to care for others and be compassionate and flexible&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that this advert is for BANK staff only. Please apply if are happy to work as and when required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Come and make a difference with the team at Westgate Healthcare! #&lt;/strong&gt;&lt;strong&gt;CareWithUsAtWestgate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For more information on adult social care jobs with Westgate Healthcare visit our website or speak to a member of our recruitment team on 07508 907 679.&lt;/p&gt;\n&lt;p&gt;Due to a high volume of applications, if you do not hear from us within 5 working days, please assume that your application has been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“We are an equal opportunities employer and welcome applications from all suitably qualified persons regardless of their race, sex, disability, religion/belief, sexual orientation or age.&quot;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Westgate Healthcare Group Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135377"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ware, Hertfordshire", "postalCode": "SG12 7LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8164", "longitude": "-.023452"}}, "title": "Physiotherapist (Bank)", "url": "https://www.jobs.nhs.uk/xi/vacancy/915780352", "validThrough": "2020-12-28T23:59:59+0000"}