{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34169", "minValue": "34169", "unitText": "YEAR", "value": "£34,169"}}, "datePosted": "2019-08-09T15:53:44+0100", "description": "&lt;p&gt;Stockton Hall is a highly specialist hospital where patients requiring a medium secure care setting can maximise value from therapeutic interventions. Our services have produced excellent recovery results for patients and they are able to progress to low secure or locked rehabilitation if possible.&lt;/p&gt;\n&lt;p&gt;The facility is split across seven wards as follows:&lt;/p&gt;\n&lt;p&gt;16 bedded female ward - Mental Health and Personality Disorder&lt;br /&gt; 16 bedded male ward - Personality Disorder&lt;br /&gt; 8 bedded elderly male ward - for those with a settled in presentation in need of rehabilitation for mental illness and/or personality disorders&lt;br /&gt; Two 24 bedded male wards for mental health focus&lt;/p&gt;\n&lt;p&gt;The role:&lt;/p&gt;\n&lt;p&gt;Here at Stockton Hall Hospital in York, we have a vacancy for Staff Nurse – Grade 4.&lt;/p&gt;\n&lt;p&gt;Job Purpose:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide high profile leadership on a shift basis&lt;/li&gt;\n&lt;li&gt;To promote and safeguard the wellbeing and interests of all patients, employees and visitors&lt;/li&gt;\n&lt;li&gt;To ensure that all standards of patient care are maintained at all times within the parameters of operational policies and governing legislation&lt;/li&gt;\n&lt;li&gt;To promote a supportive culture based on open and honest communication and reflective practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Main duties of the role include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To accept primary nurse responsibility for an allocated caseload of patients&lt;/li&gt;\n&lt;li&gt;To accept CPA responsibility for an allocated caseload of patients&lt;/li&gt;\n&lt;li&gt;To plan and implement nursing care of individual patients paying particular attention to areas of nursing risk management&lt;/li&gt;\n&lt;li&gt;To act as identified leader of the nursing shift, accepting responsibility for all nursing operations whilst on duty&lt;/li&gt;\n&lt;li&gt;To ensure nursing practice remains within the parameters of the clinical strategy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To be successful as Staff Nurse 4, you’ll need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Nurse Qualification (RMN or RNLD) with a Valid NMC PIN&lt;/li&gt;\n&lt;li&gt;ENB 998 or Mentorship in Practice or equivalent.&lt;/li&gt;\n&lt;li&gt;To be a team player&lt;/li&gt;\n&lt;li&gt;To be self-aware, seeking support and advice when required&lt;/li&gt;\n&lt;li&gt;Good listening and rapport building ability&lt;/li&gt;\n&lt;li&gt;To be able to organize and prioritise your time&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/li&gt;\n&lt;li&gt;Extra Service Annual leave awards&lt;/li&gt;\n&lt;li&gt;Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/li&gt;\n&lt;li&gt;An employee assistance programme&lt;/li&gt;\n&lt;li&gt;Free meals/refreshments when on duty&lt;/li&gt;\n&lt;li&gt;Free car parking&lt;/li&gt;\n&lt;li&gt;Flexible Benefits Packages&lt;/li&gt;\n&lt;li&gt;NMC Payment in full&lt;/li&gt;\n&lt;li&gt;Sign on bonus&lt;/li&gt;\n&lt;li&gt;£1,500 e-voucher code for The Priory Benefits portal to be redeemed on various items including discounted shopping, red letter days, gym membership etc&lt;/li&gt;\n&lt;li&gt;Relocation support (including payment for accommodation or moving costs), paid as a lump sum\n&lt;ul&gt;\n&lt;li&gt;Moving less than 100 miles up to £2,000&lt;/li&gt;\n&lt;li&gt;If more than 100 miles up to £4,000&lt;/li&gt;\n&lt;li&gt;To be repaid if individual does not complete probation &amp; leaves&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;Payment into the pension scheme&lt;/li&gt;\n&lt;li&gt;CPD top up&lt;/li&gt;\n&lt;li&gt;Donation to a charity of their choice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Division DBS info&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockton on the Forest, York", "postalCode": "YO32 9UN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9954", "longitude": "-1.00281"}}, "title": "Senior Staff Nurse £3000 Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/915703981", "validThrough": "2020-11-27T23:59:59+0000"}