{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2019-10-09T13:34:51+0100", "description": "&lt;p&gt;&lt;strong&gt;Be part of something good&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting time to be joining the Humber Teaching NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We have an excellent opportunity within the Trust for a Consultant based within the General Adult Service. We have a superb range of packages to offer the successful candidate.&lt;/p&gt;\n&lt;p&gt;The post holder will principally provide leadership and senior medical input to the Avondale Unit. As the Consultant Psychiatrist at Avondale you will work as part of a confident and developed clinical MDT in our Mental Health Decisions Unit working with people during the first seven days of admission. The Decisions Unit at Avondale has 14 beds providing acute mental health care for men and women as an integral part of our Urgent Care Pathway including Mental Health Response (Crisis) and Home Based Treatment you will be working as part of a wider team helping people return home as soon as possible or for those who require longer stays in hospital to transfer to one of our 3 treatment units.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust is a healthcare provider of community, mental health, primary care and specialist healthcare services to approximately 600,000 residents across the East Riding of Yorkshire, Kingston upon Hull and beyond. The Trust is one of the largest employers in the region and employs 3,100 staff across 80 sites with an annual income of £135 million. The Trust was awarded Foundation Trust status in 2010.&lt;/p&gt;\n&lt;p&gt;We are a multi-specialty healthcare &amp; teaching provider committed to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Caring for people and placing them at the centre&lt;/li&gt;\n&lt;li&gt;Continually learning and developing, using evidence based teaching methods to deliver safe, effective integrated care.&lt;/li&gt;\n&lt;li&gt;Growing our reputation, services and profile as the best Provider and a great place to work.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a Teaching Trust we provide excellent opportunities for professional development and we are a leading Trust in research in mental health. We work closely with our teaching partners of Hull York Medical School and Health Education England to offer an excellent training package that saw us rated in the Top 5 of the GMC’s national training survey 2016. The post includes 2.5 Supported Programmed Activities ensuring real opportunity to pursue areas of interest in the role.&lt;/p&gt;\n&lt;p&gt;To find out more about living and working here, please read the e-magazine attached or via the Trust website - humber.nhs.uk/hello.htm&lt;/p&gt;\n&lt;p&gt;For informal enquires or to arrange a visit, please contact Dr Fofie, Consultant Psychiatrist on telephone number 01482 301701 / 336638. &lt;strong&gt;&lt;em&gt;Please do not ring this number for application packages. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The ability to commute within the Trusts geographical area with access to the appropriate means of transport is essential.&lt;/p&gt;\n&lt;p&gt;You will also be asked to prove your Right to Work in the UK and complete identification checks.&lt;/p&gt;\n&lt;p&gt;Please note, you will be charged for a Disclosure &amp; Barring check if appropriate to the role.&lt;/p&gt;\n&lt;p&gt;“Humber Teaching NHS Foundation Trust is positive about receiving applications from people with personal experience of mental illness and has mechanisms in place to support and guide potential job applicants”. Please see ‘Positive Assets’ link below for more information. Humber Teaching NHS Foundation Trust are committed to equal opportunities and welcome applications from all sections of the community, the Trust seeks to establish a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust operates a strict process regarding the advertising of vacancies, details of which may only be reproduced with the written permission of the person authorised by the Trust to place the advert. Any orders obtained via unsolicited routes (including individuals not so authorised) will not be paid and the circumstances will be reported to the Trust’s Local Counter Fraud Specialist.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull", "postalCode": "HU3 2RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7444", "longitude": "-.362207"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/915787193", "validThrough": "2020-11-30T23:59:59+0000"}