{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35077", "minValue": "23247", "unitText": "YEAR", "value": "£23,247.92 - £ 35,077.19 + £3000 Welcome Bonus"}}, "datePosted": "2019-08-09T14:55:05+0100", "description": "&lt;p&gt;&lt;em&gt;Ready for the recognition&lt;em&gt;and rewards you deserve?&lt;/em&gt;&lt;/em&gt;We don’t just talk about putting employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort. So we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Priory Hospital Lincolnshire is a low secure unit for men with mental illness and personality disorder, Located in Gainsborough in Lincolnshire, Priory Hospital Lincolnshire has 28 beds to support those who are detained under the Mental Health Act.&lt;/p&gt;\n&lt;p&gt;Our service consists of two wards:&lt;/p&gt;\n&lt;p&gt;Cedar - 14 bedded ward for men who require stabilisation and support to decrease their levels of challenging behaviour&lt;/p&gt;\n&lt;p&gt;Ash - 14 bedded ward providing continuing care with a focus on rehabilitation and community reintegration and preparing the person to move further along the care pathway or to community living&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Staff Nurse you will be central to providing high quality care within a secure forensic setting working alongside patients whom have a diagnosis of Personality Disorder, Mental Illness and/or Learning Disability. Within your role you will assist and support staff in the management of the ward to ensure safe and effective management of patients and staff.&lt;/p&gt;\n&lt;p&gt;To be successful as an RMN / RNLD, you’ll need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A relevant Nursing Qualification (RMN/RNLD) and Valid NMC registration&lt;/li&gt;\n&lt;li&gt;Excellent team working skills, a high level of self-motivation and a flexible approach - our units operate 24 hours 7 days a week, and our nursing staff work shift patterns including weekends, bank holidays and nights.&lt;/li&gt;\n&lt;li&gt;A commitment to patient-centred care and to values-based and evidence-based practice&lt;/li&gt;\n&lt;li&gt;The drive to continually push your own personal learning and development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/li&gt;\n&lt;li&gt;Extra Service Annual leave awards&lt;/li&gt;\n&lt;li&gt;Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/li&gt;\n&lt;li&gt;An employee assistance programme&lt;/li&gt;\n&lt;li&gt;Subsidised meals/refreshments when on duty&lt;/li&gt;\n&lt;li&gt;Free car parking&lt;/li&gt;\n&lt;li&gt;Flexible Benefits Packages&lt;/li&gt;\n&lt;li&gt;Sign on bonus - £3000 Welcome to Priory – either a sign on bonus or an e-voucher code for the Priory Benefits portal to be redeemed on various items including discounted shopping, red letter days, gym membership etc&lt;/li&gt;\n&lt;li&gt;Relocation support (including payment for accommodation or moving costs), paid as a lump sum\n&lt;ul&gt;\n&lt;li&gt;Moving less than 100 miles up to £2,000&lt;/li&gt;\n&lt;li&gt;If more than 100 miles up to £4,000&lt;/li&gt;\n&lt;li&gt;To be repaid if individual does not complete probation &amp; leaves&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;Payment into the pension scheme&lt;/li&gt;\n&lt;li&gt;CPD top up&lt;/li&gt;\n&lt;li&gt;Donation to a charity of their choice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;No agencies please&lt;/p&gt;\n&lt;p&gt;If you forward any CV’s to the Priory Group and you are not on the Priory Group PSL and have not been asked to work on the above role we will accept theCVas a gift.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gainsborough, Lincolnshire", "postalCode": "DN21 5UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3895", "longitude": "-.560565"}}, "title": "Registered Nurse (RMN/RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/915703755", "validThrough": "2020-11-27T23:59:59+0000"}