{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28333", "minValue": "28333", "unitText": "YEAR", "value": "£28,333.20 per annum"}}, "datePosted": "2019-08-08T11:13:33+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;em&gt;&lt;strong&gt;Are you looking for an exciting new challenge and want to join a service where you really can make a difference in people’s lives every single day? If so, we have the perfect role for you!&lt;/strong&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Priory Hospital Preston is a 38-bedded independent mental health hospital, specialising in the management and treatment of acute. Opened in 1998, the hospital has established an excellent reputation for providing the highest standards of care together with an extensive range of services delivered across three units:&lt;/p&gt;\n&lt;p&gt;Bartle Ward – 10-bedded eating disorders&lt;br /&gt;Cottam Ward – 12-bedded acute mental health&lt;br /&gt;Rosemary Ward – 16-bedded acute mental health&lt;/p&gt;\n&lt;p&gt;Our services work in partnership with the NHS to provide the best quality outcomes for all the patients in our care.&lt;/p&gt;\n&lt;p&gt;Knowing that you are making a difference to people’s lives is rewarding in itself. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt;We are looking for Staff Nurses to work on our wards for mental ill health and eating disorders&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;em&gt;&lt;strong&gt;Main Responsibilities&lt;/strong&gt;&lt;/em&gt;&lt;/span&gt;:&lt;/p&gt;\n&lt;p&gt;Provide a high standard of care to people with mental illness&lt;/p&gt;\n&lt;p&gt;Develop therapeutic relationships to optimise patient engagement&lt;/p&gt;\n&lt;p&gt;Contribute to patient assessments, compiling a plan of care alongside the individual, and monitoring patient progress&lt;/p&gt;\n&lt;p&gt;Follow all codes of conduct, standards and legislation, respecting the rights of others and promoting ethical practice&lt;/p&gt;\n&lt;p&gt;To be successful as an RMN, you’ll need:&lt;/p&gt;\n&lt;p&gt;A relevant nursing qualification and registration&lt;/p&gt;\n&lt;p&gt;Excellent team working skills, a high level of self-motivation and a flexible approach - our units operate 24 hours 7 days a week where flexible working patterns would be considered&lt;/p&gt;\n&lt;p&gt;A commitment to patient-centred care and to values-based and evidence-based practice&lt;/p&gt;\n&lt;p&gt;The drive to continually push your own personal learning and development&lt;/p&gt;\n&lt;p&gt;About our benefits&lt;br /&gt;&lt;br /&gt;In return for your expertise and hard work you can move onto a career pathway to suit your ambitions and further your career at Priory.&lt;/p&gt;\n&lt;p&gt;Sign on bonus - £1500 Welcome to Priory – either a sign on bonus or an e-voucher code for the Priory Benefits portal to be redeemed on various items including discounted shopping, red letter days, gym membership etc&lt;/p&gt;\n&lt;p&gt;Back pay any increase in salary whilst employees are awaiting their PIN registration&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bartle, Preston", "postalCode": "PR4 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8011", "longitude": "-2.78397"}}, "title": "Registered Mental Nurse (RMN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/915700878", "validThrough": "2020-11-27T23:59:59+0000"}