{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30278", "minValue": "25737", "unitText": "YEAR", "value": "£25,737.07- £30,278.00"}}, "datePosted": "2019-12-23T11:11:51+0000", "description": "&lt;p&gt;We have an exciting opportunity in our Colchester unit for a staff nurse who wants to make a difference in our patients lives.&lt;br /&gt;&lt;br /&gt;The Dialysis Clinic operates as a partnership agreement with Colchester University Hospital NHS Foundation Trust. &lt;br /&gt;&lt;br /&gt;The facility itself in Colchester is part of the Primary Care Centre, all on one level and in walking distance from Colchester University Hospital. The part of the building used for dialysis was modified and fitted to facilitate chronic dialysis treatment. This is a 20 station unit with a capacity to dialyze 120 patients. The unit operates Monday to Saturday, opening hours 06.30am-23.30pm. Access to the facility is by established routes, with a bus stop at the entrance to the PCC area and Colchester train station nearby. Staff are expected to cover shifts at Colchester Hospital, Renal Unit as part of the rota.&lt;br /&gt;&lt;br /&gt;You will provide patient care according to Diaverum procedures, in order to increase the quality of life for our patients. A comprehensive professional training programme will be provided to you, including on-the-job training, e-learning and access to our in-house education programme ‘d Academy’.&lt;br /&gt;&lt;br /&gt;RESPONISIBILITIES: &lt;br /&gt;• Take ownership of care programmes for renal patients including the initiation and termination of dialysis, whilst providing stable clinical care, emotional support and independence for patients• Follow the tailored care plans to administer medications, fluid therapy or other appropriate treatments as per Consultant instructions and ensuring clinical activity is appropriately documented in the patient medical record&lt;br /&gt;• Perform patient assessment including but not limited to vital signs and all other parameters of the ESRD patients, review dialysis orders, determine general physical and mental condition of patient through observations and interview, and assist in determining compliance to dietary or medication regimen.&lt;br /&gt;• Act as a named staff nurse for a group of assigned patients ensuring ‘great care‘ is provided at all times&lt;br /&gt;• Analyse patient data; assess and monitor status of vascular accesses, review laboratory results, patient assessments and escalate any relevant changes or abnormalities to the Consultant.&lt;br /&gt;• Undertake the role of Nurse in Charge as and when required and/or deputise for the Clinic Manager&lt;br /&gt;• Prepare and monitor dialysis machines and systems inline with Diaverum processes&lt;br /&gt;• Monitor dialysis water treatment system for use according to the established procedures&lt;br /&gt;• Provide a mentorship approach to the team, empowering patients, qualified nurses, ancillary staff to share knowledge and skills&lt;br /&gt;• Proactively participate in quality and service improvement programmes&lt;br /&gt;&lt;br /&gt;REQUIREMENTS:&lt;br /&gt;• NMC Registered General Nurse&lt;br /&gt;• Awareness and Understanding of NMC code of professional conduct&lt;br /&gt;• In possession of/or working towards a post registration clinical course in Renal Nursing (ENB 136 or equivalent)&lt;br /&gt;• Strong experience in a renal dialysis setting (2 years+)&lt;br /&gt;• Ideally have a Mentorship/Teaching Qualification&lt;br /&gt;• Have a positive and dynamic approach to providing safe and effective delivery of care&lt;br /&gt;• Excellent communication skills&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Diaverum UK Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester", "postalCode": "CO4 5JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9069", "longitude": ".903042"}}, "title": "Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/915892459", "validThrough": "2020-11-28T23:59:59+0000"}