{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "NHS scale"}}, "datePosted": "2019-12-09T12:11:01+0000", "description": "&lt;p&gt;&lt;strong&gt;PLEASE NOTE THIS POSITION IS FOR ELLENOR - YOU WILL NOT BE EMPLOYED BY THE NHS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Flexibank/Contracted Specialty Doctor in Palliative Care&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS Specialty Doctor Scale (depending on experience), plus on call and weekend payments&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time/Part-time hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ellenor&lt;/strong&gt; is the provider of all-encompassing hospice care for both adults and children living in North West Kent and children in Bexley and South West Kent. Our services include adult Inpatient and Day Therapy and Wellbeing Services, a Care Home Support Team and Hospice at Home for all ages. Our strategic aims recognise our role in leading the development of services to the wider community at the end of life, and we see an increasing role in education and training and as a coordinator for providing the best possible palliative care to more people and families.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity for experienced and motivated doctors to join our Consultant led multidisciplinary team. We are looking for experienced doctors capable of delivering high quality patient care with full GMC registration, 4 years full time postgraduate training including at least 2 years in a relevant speciality. You will need to be enthusiastic about delivering the highest quality palliative care, possess excellent communication and interpersonal skills and have a flexible adaptable approach. Involvement in teaching and audit / research is required, along with participation in the on-call and weekend rota.&lt;/p&gt;\n&lt;p&gt;Support with professional development will be provided as appropriate, as well as regular clinical supervision.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;NHS Pension scheme members can transfer in their pension. An enhanced DBS will be required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact Linda Coffey, Director of Patient Care on 01474 320007.&lt;/p&gt;\n&lt;p&gt;Please contact hr@ellenor.org or phone 01474 320007 ext 1135 should you require further information.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 28th February 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We will contact you after the closing date if you have been successful in&lt;/p&gt;\n&lt;p&gt;being selected for interview. Unfortunately we are unable to contact&lt;/p&gt;\n&lt;p&gt;candidates if they are not selected for interview.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ellenor&lt;/strong&gt; is an equal opportunities employer and is committed to providing a fair and equitable workplace, where everyone is treated equally without discrimination.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ellenor&lt;/strong&gt;is a charity registered in England and Wales (1121561), and a company limited by guarantee (6302132). Registered office at Coldharbour Road, Gravesend, Kent. DA11 7HQ&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gravesend", "postalCode": "DA11 7HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4212", "longitude": ".355335"}}, "title": "Flexibank/Contracted Specialty Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/915873464", "validThrough": "2021-02-28T23:59:59+0000"}