{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27373", "minValue": "27373", "unitText": "YEAR", "value": "Starting at £27,373.50"}}, "datePosted": "2019-12-30T16:07:06+0000", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Beverley House is a 24-bedded rehabilitation hospital for women over the age of 18, situated in the heart of the community in Birmingham.&lt;/p&gt;\n&lt;p&gt;Patients admitted to Beverley House may be informal or detained under the Mental Health Act with a primary diagnosis of mental illness with complex needs&lt;/p&gt;\n&lt;p&gt;The role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing leadership and support for support staff and act as a champion for residents’ safety and dignity. Maintaining skills and knowledge and ensure that care is delivered according to latest guidelines and best practice evidence available.&lt;/li&gt;\n&lt;li&gt;Ensuring the ongoing safety of service users, residents, staff and visitors through systematic assessment, monitoring and reviewing processes. Ensuring that clear and accurate records and communication systems relating to clinical and care delivery are maintained and effectively used and acting as a role model for good clinical and care governance practice.&lt;/li&gt;\n&lt;li&gt;Taking charge of the unit regularly and in the absence of the management team, accepting responsibility for the smooth and effective running of the unit&lt;/li&gt;\n&lt;li&gt;Helping to maintain the security of the building and its environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Role requirements:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Valid registration with the Nursing &amp; Midwifery Council (NMC)&lt;/li&gt;\n&lt;li&gt;Good communication skills&lt;/li&gt;\n&lt;li&gt;Good leadership skills&lt;/li&gt;\n&lt;li&gt;Good team worker&lt;/li&gt;\n&lt;li&gt;Able to work without supervision&lt;/li&gt;\n&lt;li&gt;Mentorship experience and supervise junior staff&lt;/li&gt;\n&lt;li&gt;Good inter-personal skills&lt;/li&gt;\n&lt;li&gt;Awareness of current professional nursing issues&lt;/li&gt;\n&lt;li&gt;Maintain patient confidentiality at all times.&lt;/li&gt;\n&lt;li&gt;Promote good relationships with patient, relatives, public, other care organisations and all members of the multidisciplinary care team.&lt;/li&gt;\n&lt;li&gt;Promote good communication skills written and verbally&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/li&gt;\n&lt;li&gt;Extra Service Annual leave awards&lt;/li&gt;\n&lt;li&gt;Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/li&gt;\n&lt;li&gt;A contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Personal health insurance&lt;/li&gt;\n&lt;li&gt;An employee assistance programme&lt;/li&gt;\n&lt;li&gt;Free meals/refreshments when on duty&lt;/li&gt;\n&lt;li&gt;Free car parking&lt;/li&gt;\n&lt;li&gt;Private Dental Cover&lt;/li&gt;\n&lt;li&gt;Flexible Benefits Packages&lt;/li&gt;\n&lt;li&gt;£250 Contribution towards CPD&lt;/li&gt;\n&lt;li&gt;NMC Payment in full&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Edgbaston, Birmingham", "postalCode": "B17 8LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4753", "longitude": "-1.96082"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/915897507", "validThrough": "2020-11-27T23:59:59+0000"}