{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2019-12-31T09:52:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Forensic Psychiatrist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Based in the Humber Centre for Forensic Psychiatry.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust is looking for a forward thinking Consultant Forensic Psychiatrist to join the team of existing Consultants as a Responsible Clinician. This will include the provision of clinical leadership and delivery of expert and specialist care and treatment. The post holder will provide leadership and support to junior medical staff and the wider clinical team and contribute to the strategic development of the service. This is an exciting time to join the Forensic services in Humber as we enter a period of transformation and service redesign to support the delivery of new models of care and pathways across the STP footprint, to support the national review of secure mental health services.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work alongside a friendly supportive multidisciplinary team with a strong supportive ethos across the service.&lt;/p&gt;\n&lt;p&gt;Consultant Forensic Psychiatrist - Programmed Activities 10 plus allowances.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a range of health services including - Mental Health; Learning Disability; Community Services and Children’s Services to the population of Hull &amp; East Riding of Yorkshire.&lt;/p&gt;\n&lt;p&gt;The Post holder will provide Consultant leadership to a dedicated multi – disciplinary team. The Consultant will participate in the Forensic on-call rota for psychiatry in the Trust (1-5).&lt;/p&gt;\n&lt;p&gt;Applicants should have Full Registration with the GMC &amp; the MRCPsych UK or equivalent post – graduate qualification. They should be on the specialist Register for Forensic Psychiatry or be within 6 months of completing CCT in Forensic Psychiatry. Applicants should be able to evidence high quality clinical care and expertise in forensic mental health services and have a positive attitude towards recovery focussed practice in secure mental health services.&lt;/p&gt;\n&lt;p&gt;For further information please contact Dr John Byrne, Medical Director on telephone number 01482 389113.&lt;/p&gt;\n&lt;p&gt;The ability to commute within and outside of the Trusts geographical area with access to the appropriate means of transport is essential.&lt;/p&gt;\n&lt;p&gt;Candidates will also be asked to prove their Right to Work in the UK and complete Identification checks.&lt;/p&gt;\n&lt;p&gt;We will apply for a DBS check from the Disclosure and Barring Service for the successful candidates.&lt;/p&gt;\n&lt;p&gt;Tier 2 candidates will only be appointed once the United Kingdom Border Agency’s resident labour market test has been met.&lt;/p&gt;\n&lt;p&gt;From the 1st July 2019 parking charges will apply for visitors attending the Humber Teaching NHS Foundation Trust site at Willerby.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust is positive about receiving applications from people with personal experience of mental illness and has mechanisms in place to support and guide potential job applicants”. Please see ‘Positive Assets’ link below for more information. Humber Teaching NHS Foundation Trust are committed to equal opportunities and welcome applications from all sections of the community, the Trust seeks to establish a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust operates a strict process regarding the advertising of vacancies, details of which may only be reproduced with the written permission of the person authorised by the Trust to place the advert. Any orders obtained via unsolicited routes (including individuals not so authorised) will not be paid and the circumstances will be reported to the Trust’s Local Counter Fraud Specialist.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please Note:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- If you are successfully shortlisted we will contact you via the email address that you have applied from. Please ensure you check your emails regularly.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull", "postalCode": "HU10 6ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7726", "longitude": "-.448921"}}, "title": "Consultant Forensic Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/915897886", "validThrough": "2020-11-30T23:59:59+0000"}