{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "NHS Consultant Scale"}}, "datePosted": "2019-11-04T14:54:36+0000", "description": "&lt;p&gt;PLEASE NOTE THAT THIS POSITION IS FOR ELLENOR. YOU WILL NOT BE EMPLOYED BY THE NHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Consultant in Palliative Care (Adults)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS Consultant Scale (depending on experience), &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;plus on call payments)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time – 40 hours per week &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(Part time will be considered)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ellenor&lt;/strong&gt; Hospice is the provider of all-encompassing hospice care for both adults and children living in North West Kent and children in Bexley and South West Kent. Our services include adult Inpatient services, Day Therapy and Wellbeing Services, a Care Home Support Team and Hospice at Home for all ages. Our strategic aims recognise our role in leading the development of services to the wider community at the end of life, as well as an increasing role in education and training and as a coordinator for providing the best possible palliative care to more people and families.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced and motivated Consultant to lead our adult palliative care services. We are looking for an exceptional doctor capable of delivering high quality patient care with full registration with the GMC, Licence to practice and qualifications of MRCP or MRCGP or other recognised post graduate qualification for specialist training in Palliative Medicine. The post holder will be expected to have the UK CCT in Palliative Medicine or be within the next 6 months of completion of Specialist training.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic Consultant who will play a key role in the multi-professional palliative care team at &lt;strong&gt;ellenor&lt;/strong&gt;, leading the clinical care to inpatients and outpatients at the Hospice and patients in the community (including Care Homes).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will need to possess excellent communication and interpersonal skills and have a flexible adaptable approach. Teaching and audit / research is expected within this role, along with participation in the 2nd on-call rota.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Support with professional development will be provided as appropriate, as well as regular clinical supervision. NHS Pension scheme members can transfer in their pension. An enhanced DBS will be required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact Dr Moeen Ul-Haq Locum Consultant or Linda Cofffey Interim Director of Care at ellenor on 01474 320007. For any general queries please contact the HR Team at ellenor on 01474 320007 ext 1135.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for applications: 28th February 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;ellenor &lt;/em&gt;&lt;/strong&gt;&lt;em&gt;Hospices provides specialist hospice care for children, adults and families on their own homes, in hospital or in our hospice. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;ellenor&lt;/em&gt;&lt;/strong&gt;&lt;em&gt; is an equal opportunities employer and is committed to providing a fair and equitable workplace where everyone is treated equally without discrimination&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gravesend", "postalCode": "DA11 7HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4212", "longitude": ".355335"}}, "title": "Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/915824324", "validThrough": "2021-02-28T23:59:59+0000"}