{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28462", "minValue": "24192", "unitText": "YEAR", "value": "£24,192.84- £28,462.00 plus allowances"}}, "datePosted": "2019-10-28T09:35:00+0000", "description": "&lt;p&gt;We have an exciting opportunity in our Sidcup dialysis clinic for a registered nurse who wants to make a difference in our patients’ lives. Sidcup is located in Kent, 20 minutes from central London by train. The Sidcup clinic is in a new purpose built kidney treatment centre that opened in April 2017 within Queen Mary’s Hospital and has good public transport links.&lt;/p&gt;\n&lt;p&gt;Diaverum are working in partnership with Guy’s and St Thomas’ NHS Foundation Trust to deliver dialysis services to NHS patients. You will work closely with the NHS multidisciplinary team and have the support of the Dialysis Matron and access to Guy’s and St Thomas’ training and development.&lt;/p&gt;\n&lt;p&gt;We are looking for a staff nurse who wants to make a difference in our patients lives. A comprehensive professional training programme will be provided to you, including on-the-job training, e-learning and access to our in-house education programme ‘d Academy’.&lt;/p&gt;\n&lt;p&gt;RESPONISIBILITIES: &lt;br /&gt;• Take ownership of care programmes for renal patients including the initiation and termination of dialysis, whilst providing stable clinical care, emotional support and independence for patients&lt;br /&gt;• Follow the tailored care plans to administer medications, fluid therapy or other appropriate treatments as per Consultant instructions and ensuring clinical activity is appropriately documented in the patient medical record&lt;br /&gt;• Perform patient assessment including but not limited to vital signs and all other parameters of the ESRD patients, review dialysis orders, determine general physical and mental condition of patient through observations and interview, and assist in determining compliance to dietary or medication regimen.&lt;br /&gt;• Act as a named staff nurse for a group of assigned patients ensuring ‘great care‘ is provided at all times &lt;br /&gt;• Analyse patient data; assess and monitor status of vascular accesses, review laboratory results, patient assessments and escalate any relevant changes or abnormalities to the Consultant.&lt;br /&gt;• Undertake the role of Nurse in Charge as and when required and/or deputise for the Clinic Manager &lt;br /&gt;• Prepare and monitor dialysis machines and systems in line with Diaverum processes&lt;br /&gt;• Monitor dialysis water treatment system for use according to the established procedures&lt;br /&gt;• Provide a mentorship approach to the team, empowering patients, qualified nurses, ancillary staff to share knowledge and skills&lt;/p&gt;\n&lt;p&gt;REQUIREMENTS: &lt;br /&gt;• NMC Registered General Nurse &lt;br /&gt;• Awareness and Understanding of NMC code of professional conduct&lt;br /&gt;• In possession of/or working towards a post registration clinical course in Renal Nursing (ENB 136 or equivalent)&lt;br /&gt;• Strong experience in a renal dialysis setting (2 years+)&lt;br /&gt;• Ideally have a Mentorship/Teaching Qualification&lt;br /&gt;• Have a positive and dynamic approach to providing safe and effective delivery of care&lt;br /&gt;• Excellent communication skills&lt;/p&gt;\n&lt;p&gt;COME GROW WITH US!&lt;br /&gt;• Full Time - 37.5 hours per week&lt;br /&gt;• Monday to Saturday, Shifts hours from 06.00 to 23.30 (No Nights* or Sunday working)&lt;br /&gt;• Pay listed above includes a competitive salary and unsocial payments*, Location Allowance*&lt;br /&gt;• 27 days annual leave (plus Bank Holidays) increasing with service&lt;br /&gt;• Life Assurance, Discounted Fitness Membership, Stakeholder Company Pension &lt;br /&gt;• Post subject to References, Identification, DBS and OH checks &lt;br /&gt;• Relocation allowance *&lt;/p&gt;\n&lt;p&gt;* where applicable/dependent on clinic&lt;/p&gt;\n&lt;p&gt;Please note that we reserve the right to close vacancies prior to the advertised closing date when we are in receipt of sufficient applications&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Diaverum UK Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sidcup", "postalCode": "DA14 6LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4186", "longitude": ".103279"}}, "title": "Senior Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/915813077", "validThrough": "2020-11-28T23:59:59+0000"}