{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25551", "minValue": "25551", "unitText": "YEAR", "value": "£15.20 p/h"}}, "datePosted": "2019-12-30T14:02:28+0000", "description": "&lt;p&gt;&lt;em&gt;Ready for the recognition &lt;em&gt;and rewards you deserve?&lt;/em&gt;&lt;/em&gt;We don’t just talk about putting employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort. So we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt;Job Advert Location Description&lt;/p&gt;\n&lt;p&gt;Set within a safe and therapeutic environment, the Priory Hospital Dewsbury offers a locked rehabilitation service for 32 males. The service has two wards, each comprising of a ten bed unit and six bed self contained apartment.&lt;/p&gt;\n&lt;p&gt;Hartley Ward provides active rehabilitation for males with mental health issues, whilst Jubilee Ward is a slow stream rehabilitation service for males with learning disabilities and complex needs.&lt;/p&gt;\n&lt;p&gt;Personalised treatment programmes are offered alongside the use of a range of therapies. Our services are committed to a whole person approach. Service users are supported by our effective multidisciplinary team, experienced in rehabilitation, recovery and caring for those with complex needs.&lt;/p&gt;\n&lt;p&gt;Job Advert Role Description&lt;/p&gt;\n&lt;p&gt;The role: Providing quality, inspiring innovation and delivering value is what we set out to achieve at Priory Healthcare. Enabling our patients with dementia to receive a truly integrated and holistic approach to their treatment and care, regardless of complexity or severity, thanks to the knowledge and expertise of our multidisciplinary clinical teams.&lt;/p&gt;\n&lt;p&gt;Priory Hospital Dewsbury is part of the Priory Group, Europe’s leading provider of specialist treatment in mental illness. We deliver highest standards of care together with an extensive range of clinical services.&lt;/p&gt;\n&lt;p&gt;The above role will be primarily focused around the effective delivery of clinical care and working towards improving standards within the clinical areas of the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to have excellent interpersonal skills when liaising with members of the multi-disciplinary team, external agencies and organisations, patients and relatives. The post holder should also have a good working knowledge of the mental health and mental capacity acts&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Candidates will be expected to demonstrate genuine commitment and enthusiasm for working with this client group.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There&#39;s also free car parking and subsidised meals while you&#39;re on duty. Located just off J28 of the M62 and J40 of the M1 and is easily reached from the major West Yorkshire conurbations of Bradford, Halifax, Huddersfield, Leeds. Sheffield and surrounding areas.&lt;/p&gt;\n&lt;p&gt;Division DBS info&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dewsbury, West Yorkshire", "postalCode": "WF12 7LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6937", "longitude": "-1.61427"}}, "title": "RGN (Bank)", "url": "https://www.jobs.nhs.uk/xi/vacancy/915897080", "validThrough": "2020-11-27T23:59:59+0000"}