{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31700", "minValue": "27500", "unitText": "YEAR", "value": "£27,500-£31,700 + £3000 Welcome Bonus"}}, "datePosted": "2019-12-30T14:03:38+0000", "description": "&lt;p&gt;&lt;em&gt;Ready for the recognition &lt;em&gt;and rewards you deserve?&lt;/em&gt;&lt;/em&gt;We don’t just talk about putting employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort. So we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt;Job Advert Location Description&lt;/p&gt;\n&lt;p&gt;Set within a safe and therapeutic environment, the Priory Hospital Dewsbury is a 32 bedded locked service, supporting two different service user groups:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hartley Ward focuses upon the active rehabilitation of men with mental health issues. The emphasis is upon stabilising mental health, reducing risks and enhancing independent living skills, with a view to reintegration into the community. This is a 22 bed ward.&lt;/li&gt;\n&lt;li&gt;Jubilee Ward supports men with dementia, and behaviours that challenge. This is a 10 bed ward.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Job Advert Role Description&lt;/p&gt;\n&lt;p&gt;What we’d like to offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent salary&lt;/li&gt;\n&lt;li&gt;Many benefits in line with the NHS&lt;/li&gt;\n&lt;li&gt;Working with a dedicated multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Free on-site parking&lt;/li&gt;\n&lt;li&gt;Enhanced maternity pay&lt;/li&gt;\n&lt;li&gt;Flexible benefits including reduced rates and access to new schemes including gym membership, IT technology (laptops / tablets / smartphones) and private healthcare&lt;/li&gt;\n&lt;li&gt;Access to development opportunities including:&lt;/li&gt;\n&lt;li&gt;Sponsorship of professional qualifications through our Individual Professional Development (IPD) panel&lt;/li&gt;\n&lt;li&gt;Leadership &amp; management development&lt;/li&gt;\n&lt;li&gt;Support with your Revalidation&lt;/li&gt;\n&lt;li&gt;NMC Payment in full&lt;/li&gt;\n&lt;li&gt;Long service award&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Find out more about a career with Priory and hear from some of our nurses at our website. No agencies please&lt;/p&gt;\n&lt;p&gt;If you forward any CV’s to the Priory Group and you are not on the Priory Group PSL and have not been asked to work on the above role we will accept the CV as a gift.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Earlsheaton, Dewsbury", "postalCode": "WF12 7LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6937", "longitude": "-1.61427"}}, "title": "Registered Mental Nurse (RMN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/915897083", "validThrough": "2020-11-27T23:59:59+0000"}