{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28812", "minValue": "25063", "unitText": "YEAR", "value": "£14.91 per hour, £17.14 for limited period of time"}}, "datePosted": "2019-12-11T08:36:14+0000", "description": "&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;£14.91 per hour including WTD – excludes enhancements&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;For a limited period of time, the hourly rate is increased to £&lt;strong&gt;17.14&lt;/strong&gt; (a 15% uplift) including WTD – excludes enhancements&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Free car parking&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;When you became a Registered Nurse - what did you want to achieve for your patients?&lt;/p&gt;\n&lt;p&gt;Did you want to make a positive difference to their life?&lt;/p&gt;\n&lt;p&gt;Did you want to feel a sense of accomplishment?&lt;/p&gt;\n&lt;p&gt;Ward 9 Nursing Team are caring for patients aged 16 and above during their neurological rehabilitation journey; we work as part of a specialist MDT to help achieve patient goals. As the ward does not have a fast turnover of patients, the Nursing Team take pride in getting to know their patients on a longer term basis, providing high standards of individualised care and allowing staff to see patients progress from admission to discharge.&lt;/p&gt;\n&lt;p&gt;As a nurse on our unit you are guaranteed an RCN approved nurse to patient ratio, enabling you to provide a high standard of hands on care.&lt;/p&gt;\n&lt;p&gt;You will you have the support of the Bank service who can offer you supernumerary shifts to ensure you feel confident to work with our specialised patient group. Ward 9 will also offer you the support you need to give you the opportunity to work under supervision to achieve advanced nurse competencies such as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Tracheostomy care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;PEG care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Continence care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Neuropathic pain management&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are also happy to support you through the nurse revalidation process.&lt;/p&gt;\n&lt;p&gt;The 15% uplift on the hourly rate is for a limited period&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The main delay in a recruitment process is often confirmation of Employment History or References. We would like to make you aware that if you are successful, the Trust requires contact details for referees who can confirm your employment and/or education for the last 3 years.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires completion of a Disclosure and Barring Service (DBS) form. Due to recent changes in law, the DBS operate a system of ‘Single Certification’ whereby only a copy of the certificate / disclosure is issued to candidates and not to Birmingham Community Healthcare NHS Foundation Trust as the employer. You are therefore advised that upon receipt of the DBS certificate/disclosure, you are required to provide the original copy to a member of the Centralised recruitment Team at Priestley Wharf. Please note that failure to do so will result in the Trust being unable to process your application and your conditional offer may be withdrawn.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam email&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust is committed to providing a safe working environment for all staff.&lt;/p&gt;\n&lt;p&gt;As part of the Trust’s on-going response to the management of COVID-19 secure workplaces, strict health and safety measures and infection prevention and control has been put into place. As with any healthcare setting that cares for patients, we are and remain committed to ensure that we adhere to nationally mandated infection prevention and control policies and practices, alongside the appropriate training to ensure we protect all our staff, visitors and patients and minimise/eliminate risk in line with NHS Health Governance standards. The Recruitment programmes we are undertaking are in accordance with these measures to ensure the safety of all candidates. We are committed to protecting our staff and services users from infection and encourage our staff to uptake their annual flu vaccination.&lt;/p&gt;\n&lt;p&gt;As a Trust, we offer and encourage staff to complete either a Black and Minority Ethnic (BME) risk assessments, regular COVID-19 risk assessments and/or working at home risk assessments to identify additional support measures or reasonable adjustments that may be required as appropriate. We encourage all staff to ensure they benefit from the various support measures which have been put into place which help us to support and protect our staff, visitors and patients to provide the Best Care in Healthy Communities.&lt;/p&gt;\n&lt;p&gt;These measures are within the provisions of Health and Safety and are in line with the Trust’s expectation that all staff will comply with the measures put in place and to ensure social distancing is adhered to&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "B7 4BN, Birmingham", "postalCode": "B7 4BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4873", "longitude": "-1.88581"}}, "title": "Bank Level 5 Registered Nurse - Rehabilitation", "url": "https://www.jobs.nhs.uk/xi/vacancy/915876704", "validThrough": "2021-09-20T23:59:59+0100"}