{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "55187", "minValue": "31266", "unitText": "YEAR", "value": "£18.60- £32.83"}}, "datePosted": "2020-01-13T19:51:06+0000", "description": "&lt;p&gt;Are you an ITU nurse looking for an exciting opportunity to join one of the largest and most successful Foundation Trusts in the UK?&lt;/p&gt;\n&lt;p&gt;UCLH Bank are looking for skilled ITU nurses to register with the bank to take on shifts with UCLH NHS Foundation Trust. This is a fantastic opportunity for anyone looking to develop their ITU skills with a trust who have a reputation for developing and nurturing talent. This role is a typical ITU nursing role and will require you to work with senior nursing staff to provide excellent care to critically ill patients, requiring you to remain alert and focussed at all times.&lt;/p&gt;\n&lt;p&gt;In order to join the bank as an ITU nurse, you will need to be a fully registered nurse, and have at least six months experience within an clinical setting, preferably within the NHS. This role will require you to be active work efficiently and can be a high pressure environment. You will therefore need to keep a cool head and remain focused while on duty.&lt;/p&gt;\n&lt;p&gt;Joining the UCLH Bank will give you a number of opportunities and benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive pay as you will be on specialist pay rates.&lt;/li&gt;\n&lt;li&gt;The opportunity to gain NHS experience in one of the most forward thinking and prestigious NHS Trusts.&lt;/li&gt;\n&lt;li&gt;Complete control over you shift patter, allowing you control of your work life balance.&lt;/li&gt;\n&lt;li&gt;Access to &quot;Lines of Work&quot; (guaranteed short, medium, or long term shifts).&lt;/li&gt;\n&lt;li&gt;First refusal on available shifts, and priority placement over any agency worker.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Don&#39;t miss out working with one of the best NHS hospitals and apply below.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank ITU Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/915916280", "validThrough": "2020-12-31T23:59:59+0000"}