{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24357", "minValue": "24357", "unitText": "YEAR", "value": "£14.49 p/h"}}, "datePosted": "2020-01-03T11:29:41+0000", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt;The Priory Hospital Market Weighton is a registered male independant hospital, supporting individuals with learning disabilities, behaviours and challenge and mental health issues. Situated in the attractive town of Market Weighton the service is ideally located for safe, structured and gradual reintergration into the local community.&lt;/p&gt;\n&lt;p&gt;The purpose built hospital is an open service with the ability to lock the doors to maintaintain service user safety.&lt;/p&gt;\n&lt;p&gt;It can accommodation up to 19 individuals in four distinct areas providing a tiered care pathway to support them in their recovery and rehabilitation. All bedrooms have en suite facilities.&lt;/p&gt;\n&lt;p&gt;Providing quality, inspiring innovation and delivering value is what we set out to achieve at Priory Healthcare. Enabling our patients with mental health illness to receive a truly integrated and holistic approach to their treatment, regardless of complexity or severity, thanks to the knowledge and expertise of our multidisciplinary clinical teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our multidisciplinary team work collaboratively with service users and commissioners to deliver a comprehensive assessment and treatment programme and adaptable care pathways, empowering service users to progress towards the least restrictive setting and towards independence.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful candidates will be motivated to work in a service that offers involvement and empowerment for patients, who may have a personality disorder and/or mental illness, encouraging patients to have a real voice in how services develop and in their individualised care pathways. You will be flexible and supportive, enabling patients to build on their existing strengths and feel positive about their lives.&lt;/p&gt;\n&lt;p&gt;What we’d like from you:&lt;/p&gt;\n&lt;p&gt;• RNLD/RMN Qualified&lt;/p&gt;\n&lt;p&gt;• NMC (Nursing &amp; Midwifery Council Registered)&lt;/p&gt;\n&lt;p&gt;• Knowledge of the Mental Health Act&lt;/p&gt;\n&lt;p&gt;• Patient centric &amp; commitment to delivering high quality care&lt;/p&gt;\n&lt;p&gt;• Fine tuned decision making skills&lt;/p&gt;\n&lt;p&gt;• Excellent organisational capability&lt;/p&gt;\n&lt;p&gt;• Effective communication skills&lt;/p&gt;\n&lt;p&gt;• Flexibility and a strong “can do” attitude&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "MARKET WEIGHTON", "postalCode": "YO43 3EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8643", "longitude": "-.670693"}}, "title": "Bank Nurse (RNLD/RMM)", "url": "https://www.jobs.nhs.uk/xi/vacancy/915901559", "validThrough": "2020-11-27T23:59:59+0000"}