{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-01-13T19:44:03+0000", "description": "&lt;p&gt;University College London Hospital are looking for an enthusiastic, compassionate, dedicated and highly motivated Band 5 Staff Nurse to join the Gynaecology team on T6 Ward University college London Hospital to work 37.5 hours per week with a mixture of long days and nights 7 days per week.&lt;/p&gt;\n&lt;p&gt;You should have excellent communication and interpersonal skills, and a genuine enthusiasm in caring for Women undergoing all aspects of gynaecological care. This post would include supervision of junior members of the team, coordinating the ward on shift, and providing support to enable junior members of the team to develop.&lt;/p&gt;\n&lt;p&gt;T6 Gynaecology is an acute 15 bed ward. We deal with all aspects of Gynaecology and work closely with Emergency Gynaecology Assessment Service. As a band 5 staff nurse, you would be working alongside a supportive and committed multi-disciplinary team. There will be opportunities for you to develop and expand within your role. We deliver high quality individualistic patient care and would be supported in patient’s management to ensure we deliver high quality holistic care.&lt;br /&gt;&lt;br /&gt; Excellent communication skills, a friendly approachable nature and an ability to manage your own workload are required. Gynaecology experience is desirable but not essential, as training and support will be provided.&lt;/p&gt;\n&lt;p&gt;Our Bank Nurses are invaluable to us and in return for their dedication and commitment, we offer the following benefits:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The opportunity to work across all UCLH departments gaining invaluable skills&lt;/li&gt;\n&lt;li&gt;Access to “Lines of Work” (guaranteed short, medium or long term shifts)&lt;/li&gt;\n&lt;li&gt;Specialist pay rates&lt;/li&gt;\n&lt;li&gt;Self service electronic timesheet submission, with weekly pay&lt;/li&gt;\n&lt;li&gt;A designated onsite co-ordinator to offer support and introduce you to various departments within UCLH&lt;/li&gt;\n&lt;li&gt;A dedicated recruitment team to ensure you can work as quickly as possible&lt;/li&gt;\n&lt;li&gt;A bookings team to ensure you work when and wherever you want to&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are looking to further your career in a hospital that has cutting edge technology, please apply online.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospital", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank Band 5 Nurse- Gynaecology", "url": "https://www.jobs.nhs.uk/xi/vacancy/915916274", "validThrough": "2020-12-31T23:59:59+0000"}