{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competative"}}, "datePosted": "2020-03-02T09:21:46+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;GP Opportunity – 6 sessions, Buttercross Health Centre&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a GP to join Buttercross Health Centre in Somerton, Somerset where you will have the opportunity to work with a dynamic, patient focused and enthusiastic team helping to further develop the best enhanced primary care and patient service in the country.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Buttercross Health Centre is part of Symphony Healthcare Services Ltd (&quot;SHS&quot;), a primary care organisation established as part of the award winning Symphony Programme Vanguard developing new models of care. With a growing network of 14 practices and 40 employed GPs in Somerset, we are now recruiting for up to 6 GP sessions at Buttercross working across 3 days, ideally Tuesday, Thursday and Friday.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Buttercross, is located in Somerton in the heart of the community, providing healthcare services for the town and the surrounding villages. The practice offers a wide range of healthcare services to patients and is successfully operating the new models of care developed under the Symphony Programme, where Health Coaches positively support both patients and GPs to provide additional guidance, information and coordination of care services. The multidisciplinary team also includes ECPs (Enhanced Care Practitioners) and a medicines management hub led by a trained pharmacy team who are able to review regular medications for long-term health conditions, provide patient advice in any medication and review health records.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In July 2018,Ilchester Surgery became a branch surgery ofButtercross Health Centre, with both practice teams joining together to become one larger team, to provide healthcare services across both locations. All registered patients are now part of one patient list and are able to use healthcare services at either location&lt;span&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Buttercross Health Centre is an innovative practice:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Implementing enhanced primary care models of service delivery&lt;/li&gt;\n&lt;li&gt;Team includes health coaches and medicines management&lt;/li&gt;\n&lt;li&gt;Acute team of Nurse Practitioners and Paramedic Practitioners who manage all on-the-day demand, acute home visiting and the minor injury service for the locality&lt;/li&gt;\n&lt;li&gt;Circa 7000 patients&lt;/li&gt;\n&lt;li&gt;purpose built premises&lt;/li&gt;\n&lt;li&gt;Provide minor surgery and family planning services&lt;/li&gt;\n&lt;li&gt;EMIS Web practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;CQC inspection 2019 rated the practice as &quot;Good&quot; in all areas.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;We offer our GPs a range of flexible working options together with a competitive remuneration package based on the BMA GP contract with additional incentive payments and further allowances for GPs with specialist skills and experience. Tier 2 Visa sponsorship available.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more information or to arrange an informal visit, please contact Julie Salter (Practice Manager) on &lt;/span&gt;&lt;span&gt;Julie.salter@nhs.net&lt;/span&gt;&lt;span&gt;&lt;span&gt; or &lt;/span&gt;01458 272473&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132135.JPG", "name": "Symphony ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132135"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Somerton", "postalCode": "TA11 7PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0558", "longitude": "-2.7307"}}, "title": "Employed GP Buttercross Health Centre and Ilchester Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/915986054", "validThrough": "2020-11-30T23:59:59+0000"}