{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39436", "minValue": "25954", "unitText": "YEAR", "value": "£15.44- £23.46 per hour"}}, "datePosted": "2020-01-13T19:51:46+0000", "description": "&lt;p&gt;At UCLH (University College London Hospitals NHS Foundation Trust) our success starts with you.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join one of the largest and most successful Foundation Trusts in the UK with an international reputation and a tradition of innovation.&lt;/p&gt;\n&lt;p&gt;Based in the busy West End of London, we have a lively and vibrant working atmosphere, with quick and easy transport links to all our sites. Our size and resources enable us to offer a range of attractive benefits as well as unparalleled education and development opportunities for staff at all levels. This includes an extensive portfolio of academic and clinical courses and programmes ranging from ongoing personal development through to clinical excellence and leadership skills. UCLH prides itself on its investment in staff both in terms of developing career skills but also its commitment to staff health and wellbeing.&lt;/p&gt;\n&lt;p&gt;Bank Partners are looking for Band 5 General nurses to work in the Urogynaecology Department with surgical experience.&lt;/p&gt;\n&lt;p&gt;As a UCLH Bank Nurse you will require 6 months NHS experience at Band 5 Level. You will be a highly motivated individual with a strong commitment to the delivery of high quality safe patient care and a determination to improve clinical outcomes and the experience of our patients.&lt;/p&gt;\n&lt;p&gt;You will need to show a strong commitment to personal and professional development, as well as a desire to teach and mentor junior staff and students. You will also need to be able to think on your feet, working well both autonomously and as part of a team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are especially looking for band 5 General Nurses to commit to a regular line of work in the department. Shift patterns will be Monday to Friday 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;What we can offer you&lt;/p&gt;\n&lt;p&gt;ou will also have opportunities to shadow our specialist nurses which will contribute to a wealth of experience you can gain from working with us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We will offer you a wide range of skills to learn within our specialist care setting – with patients from emergency /surgical admissions. We have a dedicated Clinical Practice Facilitator who will help oversee your professional development.&lt;/p&gt;\n&lt;p&gt;Required Skills and Experience;&lt;/p&gt;\n&lt;p&gt;Band 5 Registered General Nurse with surgical experience.&lt;/p&gt;\n&lt;p&gt;6 Months Proven experience working within an acute clinical environment within the NHS&lt;/p&gt;\n&lt;p&gt;NMC registration&lt;/p&gt;\n&lt;p&gt;Excellent communication skills, both written and verbal&lt;/p&gt;\n&lt;p&gt;Our Bank Nurses are invaluable to us and in return for their dedication and commitment, we offer the following benefits:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Access to “Lines of Work” (guaranteed short, medium or long term shifts)&lt;/li&gt;\n&lt;li&gt;Priority of shifts over an agency worker, accommodating your availability&lt;/li&gt;\n&lt;li&gt;An online self booking system that also allows you to submit timesheets electronically&lt;/li&gt;\n&lt;li&gt;Designated onsite Business Partners to offer support and introduce you to various departments within University College London Hospital&lt;/li&gt;\n&lt;li&gt;A dedicated recruitment team to ensure you can work as quickly as possible&lt;/li&gt;\n&lt;li&gt;A dedicated compliance team that ensures you remain compliant to work&lt;/li&gt;\n&lt;li&gt;Free annual Mandatory Training&lt;/li&gt;\n&lt;li&gt;A bookings team to ensure you work when and wherever you want to&lt;/li&gt;\n&lt;li&gt;Supporting our Nurses through Revalidation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Informal visits are encouraged for Bank Staff or apply for the role by attaching a CV.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Band 5 Registered General Nurse -Urogynaecology Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/915916281", "validThrough": "2020-12-31T23:59:59+0000"}