{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 4"}}, "datePosted": "2020-01-20T16:06:08+0000", "description": "&lt;p&gt;Moorfields NHS Trust, the leading provider of eye health services in the UK and a world class centre of excellence for ophthalmic research and education, is looking to appoint a&lt;strong&gt;Band 4 Play Specialist&lt;/strong&gt;to their StaffBank.&lt;/p&gt;\n&lt;p&gt;It is a temporary role for 26 hours a week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main Duties:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To create a suitable environment with the co-operation of other staff in which play occurs naturally within the Day Wards, Paediatric Accident and Emergency and Paediatric Outpatient Clinics.&lt;/li&gt;\n&lt;li&gt;To devise individual play programmes and provide organised play and/or stimulation appropriate to the environment and the individual child&#39;s condition.&lt;/li&gt;\n&lt;li&gt;To participate in safeguarding children and young people within the Trust to ensure their safety and to adhere to the safeguarding policy. This includes responsibility for the selection, safety and maintenance of materials, toys and play equipment.&lt;/li&gt;\n&lt;li&gt;To liaise with multi-disciplinary team regarding appropriate play and observe and report on individual children&#39;s response to play. You may keep abreast of trends by attending study days and conferences at the discretion of the senior Play Team staff and senior Paediatric Nursing staff.&lt;/li&gt;\n&lt;li&gt;Any other duties reasonably related to the role.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The duties and responsibilities of the post will be undertaken in accordance with the policies, procedures and practice of Moorfields Eye Hospital NHS Trust and which the Trust may amend from time to time. Copies are available on each ward and in the departments; it is the post holder&#39;s responsibility to keep up-to-date with hospital policies and procedures.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Person Specification:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Holds or is working towards a Health Play Specialist qualification or equivalent&lt;/li&gt;\n&lt;li&gt;Recognised Child Care qualification&lt;/li&gt;\n&lt;li&gt;Experience of working with children and young people in a hospital setting&lt;/li&gt;\n&lt;li&gt;Awareness of current health initiatives for infants, children, young people and families&lt;/li&gt;\n&lt;li&gt;Demonstrates good communication skills – verbal and written&lt;/li&gt;\n&lt;li&gt;Ability to work with difficult situations&lt;/li&gt;\n&lt;li&gt;High level of motivation, displayed by enthusiasm, commitment, innovation&lt;/li&gt;\n&lt;li&gt;Ability to work in different locations within the children’s service&lt;/li&gt;\n&lt;li&gt;Good attendance and time keeping, a flexible approach to work&lt;/li&gt;\n&lt;li&gt;Able to work as part of a team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This roleis for an immediate start.&lt;br /&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Bank Partners is an employment agency/employment business (as defined by the Conduct of Employment Agencies and Employment Businesses Regulations 2003) and is acting on behalf of its client in relation to this vacancy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Moorfields Eye Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121181"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "EC1V 2PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5272", "longitude": "-.089862"}}, "title": "Bank Band 4 Play Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/915926571", "validThrough": "2020-12-31T23:59:59+0000"}