{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7"}}, "datePosted": "2020-02-07T16:28:23+0000", "description": "&lt;p&gt;At UCLH (University College London Hospitals NHS Foundation Trust) our success starts with you.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join one of the largest and most successful Foundation Trusts in the UK with an international reputation and a tradition of innovation.&lt;/p&gt;\n&lt;p&gt;Based in the busy West End of London, we have a lively and vibrant working atmosphere, with quick and easy transport links to all our sites. Our size and resources enable us to offer a range of attractive benefits as well as unparalleled education and development opportunities for staff at all levels. This includes an extensive portfolio of academic and clinical courses and programmes ranging from ongoing personal development through to clinical excellence and leadership skills. UCLH prides itself on its investment in staff both in terms of developing career skills but also its commitment to staff health and wellbeing.&lt;/p&gt;\n&lt;p&gt;UCLH is a dedicated colposcopy specialist service located in North London.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated and experienced Colposcopy Clinical Nurse Specialist to join our team. The successful post holder will become part of a well-established experienced colposcopy team. Appropriate teaching, training, supervision and on-going support will be provided to enable you to improve our patient’s experience throughout their pathway.&lt;/p&gt;\n&lt;p&gt;You should be able to work independently, and as part of a multidisciplinary team, have the ability to support a caseload of patients through their Colposcopy pathway of care. As an integral member of our team you will be involved in developing current nursing practice according to patient need.&lt;/p&gt;\n&lt;p&gt;This exciting opportunity will allow the post holder to develop their specialist colposcopy nursing skills within the specialist field whilst working alongside a very supportive, experienced and highly motivated team aiming to improve the patient experience and to manage own case load.&lt;/p&gt;\n&lt;p&gt;Required experience: &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Pin with BSCCP registration&lt;/li&gt;\n&lt;li&gt;At least 2 years post nursing qualification experiance &lt;/li&gt;\n&lt;li&gt;Newly qualified nurse Coloscopist are welcome to apply &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our Bank Nurses are invaluable to us and in return for their dedication and commitment, we offer the following benefits:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The opportunity to work across all UCLH departments gaining invaluable skills&lt;/li&gt;\n&lt;li&gt;Access to “Lines of Work” (guaranteed short, medium or long term shifts)&lt;/li&gt;\n&lt;li&gt;Specialist pay rates&lt;/li&gt;\n&lt;li&gt;Self service electronic timesheet submission, with weekly pay&lt;/li&gt;\n&lt;li&gt;A designated onsite co-ordinator to offer support and introduce you to various departments within UCLH&lt;/li&gt;\n&lt;li&gt;A dedicated recruitment team to ensure you can work as quickly as possible&lt;/li&gt;\n&lt;li&gt;A bookings team to ensure you work when and wherever you want to&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank Clinical Nurse Specialist Colposcopy service", "url": "https://www.jobs.nhs.uk/xi/vacancy/915955389", "validThrough": "2020-12-31T23:59:59+0000"}