{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "54363", "minValue": "32729", "unitText": "YEAR", "value": "£19.47- £32.34"}}, "datePosted": "2020-01-13T19:42:37+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a dynamic, motivated band 5/6 Scrub Practitioner to join the Operating Department at UCLH.&lt;br /&gt;&lt;br /&gt; As a Bank Scrub Practitioner, you are invaluable to us. You will be able to demonstrate a desire to work as part of a team, to develop skills in new and innovative procedures, and be competent in basic IT applications.&lt;/p&gt;\n&lt;p&gt;If you would be interested in a tour of the Theatres department including a discussion with the service manager or the senior theatre team please let us know.&lt;/p&gt;\n&lt;p&gt;What we look for in our bank nurses:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Registered to the relevant professional body&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Must have a minimum of 6 months post registration experience within an acute healthcare setting/NHS&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Proven experience working in a theatres setting&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent communication skills, both written and verbal&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our Bank Nurses are invaluable to us and in return for their dedication and commitment, we offer the following benefits:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Access to “Lines of Work” (guaranteed short, medium or long term shifts)&lt;/li&gt;\n&lt;li&gt;Priority of shifts over an agency worker, accommodating your availability&lt;/li&gt;\n&lt;li&gt;An online self booking system that also allows you to submit timesheets electronically&lt;/li&gt;\n&lt;li&gt;Designated onsite Business Partners to offer support and introduce you to various departments within University College London Hospital&lt;/li&gt;\n&lt;li&gt;A dedicated recruitment team to ensure you can work as quickly as possible&lt;/li&gt;\n&lt;li&gt;A dedicated compliance team that ensures you remain compliant to work&lt;/li&gt;\n&lt;li&gt;Free annual Mandatory Training&lt;/li&gt;\n&lt;li&gt;A bookings team to ensure you work when and wherever you want to&lt;/li&gt;\n&lt;li&gt;Supporting our Nurses through Revalidation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To apply for this role please complete the application box below. If you have any queries then please do not hesitate to contact the bank recruitment team on 0207 959 3550 (option 2).&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank Theatre Scrub Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/915916272", "validThrough": "2020-12-31T23:59:59+0000"}