{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30500", "minValue": "25000", "unitText": "YEAR", "value": "£25,000 - £30,500"}}, "datePosted": "2020-02-11T15:11:06+0000", "description": "&lt;p&gt;Delphi Medical is an innovative and specialist addiction (drug and alcohol) service working in prison settings, in patient-detox and in the community to inspire clients to progress safely and successfully from dependence to freedom. Delphi have a shared purpose as part of the Calico Group to make a real difference to people’s lives and we are looking for Nurses to work within our prison services who share our values and have real passion for helping others.&lt;/p&gt;\n&lt;p&gt;If you are registered with the Health &amp; Care Professions Council (HCPC) to practice as a paramedic… why don’t you consider a new and rewarding post in addiction recovery.&lt;/p&gt;\n&lt;p&gt;Lancaster and Manchester opportunities available now… you will have time to care… time to do your job properly… time for fun &amp; time for you.&lt;/p&gt;\n&lt;p&gt;What you’ll be doing&lt;/p&gt;\n&lt;p&gt;As a Registered Nurse within Delphi’s prison service team in Rochdale or Manchester, you will work closely with offenders offering medical interventions and clinical therapies to support their journey from dependence to freedom. Our Nurses offer professional, expert clinical support and advice which helps us to deliver exceptional service and support to our clients. You will undertake full clinical assessments, and assess, plan, implement and manage treatment care plans. You will also support with psychosocial interventions.&lt;/p&gt;\n&lt;p&gt;This is a really exciting and rewarding role where you’ll be able to apply your skills and expertise to positively impact people’s future, improving their prospects and quality of life. We are proud of the fantastic outcomes our teams achieve and we would love you to be a part of this.&lt;/p&gt;\n&lt;p&gt;As a Registered Nurse you will need to be able to work collaboratively within your Nurse team, the wider prison team and across the group with our Acorn Recovery Projects drug and alcohol service to provide outstanding and innovative services, delivering the best possible outcomes for those in your care.&lt;/p&gt;\n&lt;p&gt;You will be based at one of our prison services in either Rochdale (Buckley Hall) or Manchester (HMP Manchester). Whilst you will have a primary site, it’s important that we are always able to deliver the highest quality of service so some flexibility is required if cover is needed.&lt;/p&gt;\n&lt;p&gt;Your hours of work would be 35 hours per week and would work to a shift pattern (dependent on primary site location) including some weekend cover. We are happy to discuss flexibility with shift patterns.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What you will get in return&lt;br /&gt; •The opportunity to make a real difference to people’s lives&lt;br /&gt; •Competitive salary&lt;br /&gt; •36 days annual leave (including bank holidays)&lt;br /&gt; •Generous occupational pay schemes&lt;br /&gt; •A fabulous wellbeing programme&lt;br /&gt; •Be part of a values lead culture&lt;br /&gt; •Quality learning and development opportunities&lt;br /&gt; •Join a unique and diverse group of companies with growth ambitions&lt;/p&gt;\n&lt;p&gt;There are so many more benefits to working for Delphi and the Calico Group, too many to mention! Calico has a reputation both locally and nationally as an employer of choice, ranked 25th in the “Inclusive top 50 UK Employees list” – an achievement we are exceptionally proud of. But in case you’re still not sure, why not take a look at our company website for more information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What you’ll need to be a success&lt;br /&gt; •The ability to engage with challenging individuals and build trusting relationships – patience and resilience will be key!&lt;br /&gt; •A passion for supporting people, providing exceptional care&lt;br /&gt; •A flexible and innovative approach to service delivery&lt;br /&gt; •RMN (Mental Health Nurse) / Registered General Nurse status and relevant qualifications&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ready to apply?&lt;/p&gt;\n&lt;p&gt;If you think you have everything we’re looking for in a Registered Nurse, then we’d love to hear from you. Join us today and start making a difference to people’s lives.&lt;/p&gt;\n&lt;p&gt;If you are viewing this advert on the NHS jobs portal, please apply via the NHS application. If you are viewing this advert via any other platform, please head to Calico Careers to view the vacancy and apply.&lt;/p&gt;\n&lt;p&gt;Not the job for you? Have a look at what other exciting opportunities Delphi and the Calico Group has to offer .&lt;/p&gt;\n&lt;p&gt;Looking to attract applicants with an NHS or similar background and from areas including: Oldham, Rochdale, Bury, Stockport, Manchester, Salford and all surrounding areas.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Delphi Medical Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135494"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rochdale", "postalCode": "OL12 9DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6337", "longitude": "-2.14397"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/915959569", "validThrough": "2020-12-31T23:59:59+0000"}