{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "TBC"}}, "datePosted": "2020-01-29T16:15:05+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Salaried GP Vacancy at Central Healthcare, Scarborough&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Central Healthcare are looking for interested GPs to work with us in our Scarborough Town Centre practice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a really exciting time for Central Healthcare and this vacancy would suit a GP who is willing to embrace change and thrives on innovation &amp; challenge, including the immense potential for innovation. Having recently formed a new partnership with Haxby Group, who are rated ‘outstanding’ by the CQC; there is immense scope of progression for the right candidate. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Both Haxby Group and Central Healthcare are accredited training practices and by joining forces we are able to strengthen staff training and development opportunities for all of our staff. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We encourage efficient working practices such as telephone / video consultations, electronic prescribing, using online workflow and developing innovative care plans for health management &amp; improvement. GPs have the opportunity to provide supervision and support to the wide range of healthcare professionals and trainees working within our Practice. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Further benefits that Central Healthcare can offer are: &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working practices, including the ability to work from home when suitable&lt;/li&gt;\n&lt;li&gt;Support from a larger clinical team, including senior GPs, primary care practitioners and specialist advanced nurse practitioners.&lt;/li&gt;\n&lt;li&gt;A state-of-the-art digital patient access and consultation system and appointment booking to improve waiting times and availability of appointments.&lt;/li&gt;\n&lt;li&gt;Investment in new IT and telephone infrastructure.&lt;/li&gt;\n&lt;li&gt;Support from a large HR, Finance and Business Intelligence team&lt;/li&gt;\n&lt;li&gt;Help with patient communications and engagement&lt;/li&gt;\n&lt;li&gt;Flexibility of staffing as specialists can be available from across sites&lt;/li&gt;\n&lt;li&gt;Benefit from the experience and knowledge embedded in a practice that has achieved outstanding results in areas with a similar patient population.&lt;/li&gt;\n&lt;li&gt;Opportunities to develop special interests&lt;/li&gt;\n&lt;li&gt;Support from Haxby Group Training, which provides education to a wide range of primary care clinicians&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To arrange a visit or for an informal discussion please contact: Joanna.dodds@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scarborough", "postalCode": "YO11 1UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2773", "longitude": "-.409719"}}, "title": "Salaried GP", "url": "https://www.jobs.nhs.uk/xi/vacancy/915940733", "validThrough": "2020-12-31T23:59:59+0000"}