{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "54363", "minValue": "27131", "unitText": "YEAR", "value": "£16.14 - £32.34"}}, "datePosted": "2020-01-13T19:48:51+0000", "description": "&lt;p&gt;Band 5/6 Operating Department Practitioner ODP &lt;br /&gt; &lt;br /&gt; Are you that person? It takes a certain kind of person to be a good Operating Department Practitioner, someone who can think on their toes, work both independently and as part of a team, and plan ahead for their patients’ needs. &lt;br /&gt; We are looking for Qualified ODP to work within our friendly hospital environment, to support and assist our ENT; Rhinology, Laryngology &amp; Otology clinicians. It is essential that you are reliable, punctual and work well within a team environment, and hold the National Certificate or equivalent.&lt;/p&gt;\n&lt;p&gt;Are you an ODP looking to develop your skills in one of the largest and most successful Foundation Trusts in the UK?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;UCLH have a reputation as a centre of clinical excellence&lt;/li&gt;\n&lt;li&gt;Based in the busy West End of London, they have a lively and vibrant working atmosphere, with quick and easy transport links to all the sites&lt;/li&gt;\n&lt;li&gt;They have new facilities and state-of-the-art medical technology&lt;/li&gt;\n&lt;li&gt;Develop your skill within Anaesthetics, Scrub or Recovery gaining experience in one of the UK’s most prestigious hospitals&lt;/li&gt;\n&lt;li&gt;UCLH can offer a rare opportunity to work as a Theatres Nurse within Neurosurgery&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our Bank Nurses are invaluable to us and in return for their dedication and commitment, we offer the following benefits:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The opportunity to work across all UCLH departments gaining invaluable skills&lt;/li&gt;\n&lt;li&gt;Access to “Lines of Work” (guaranteed short, medium or long term shifts)&lt;/li&gt;\n&lt;li&gt;Specialist pay rates&lt;/li&gt;\n&lt;li&gt;Self service electronic timesheet submission, with weekly pay&lt;/li&gt;\n&lt;li&gt;A designated onsite co-ordinator to offer support and introduce you to various departments within UCLH&lt;/li&gt;\n&lt;li&gt;A dedicated recruitment team to ensure you can work as quickly as possible&lt;/li&gt;\n&lt;li&gt;A bookings team to ensure you work when and wherever you want to&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are looking to further your career in a hospital that has cutting edge technology, and you have atleast 6 months NHS experience please apply online.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank Theatre Practitioner/ODP", "url": "https://www.jobs.nhs.uk/xi/vacancy/915916277", "validThrough": "2020-12-31T23:59:59+0000"}