{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29000", "minValue": "29000", "unitText": "YEAR", "value": "to £29,000"}}, "datePosted": "2020-01-03T12:42:05+0000", "description": "&lt;p&gt;Naomi House is a Hampshire based hospice for children and young people. We’ll be clear from the start: this is a very different kind of nursing. We&#39;re about caring for children and young adults with life-threatening and life-limiting conditions, whether they are with us for a relaxing short break, emergency care or for end of life. .&lt;/p&gt;\n&lt;p&gt;So you’re here for good days, bad days and last days and which is why our nurses believe this is quite possibly the most rewarding job in the profession. It’s also a hugely diverse role. You simply don’t know what each day will bring. That’s why a genuinely flexible approach is so important, as well as a combination of excellent clinical skills and a sensitive and compassionate nature.&lt;/p&gt;\n&lt;p&gt;A background in palliative care would be welcomed, but it’s not essential. Just as long as you’ve at least 12 months post-qualification experience gained in any area – and you’ve the special qualities we’re looking for – we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;There’s plenty of training and development on offer, as well as a range of excellent benefits. So if you think you’d thrive within our close-knit multidisciplinary team as you make a positive difference to the lives of children and young people, just click on the apply button below to find out more.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be required to apply for an Enhanced Disclosure from the Disclosure and Barring Service (formerly Criminal Records Bureau).&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunities employer, welcoming applications from all sections of the community.&lt;/p&gt;\n&lt;p&gt;We offer a competitive salary, enhancements for unsocial hours, 28 days holiday, and a pension. (Continuation in the NHS pension where applicable).&lt;/p&gt;\n&lt;p&gt;Car owner preferred as we are in a remote location.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Social Enterprises", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130655"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester", "postalCode": "SO21 3JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1526", "longitude": "-1.34538"}}, "title": "(Band 5 equivalent) Paediatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/915901859", "validThrough": "2020-12-31T23:59:59+0000"}