{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-02-26T10:01:24+0000", "description": "&lt;p&gt;Thank you for your interest in the role of Consultant in Stroke in Somerset&lt;/p&gt;\n&lt;p&gt;We are seeking 2 dynamic and enthusiastic consultants with the passion to develop and deliver high-quality stroke care for our Somerset population.&lt;/p&gt;\n&lt;p&gt;In line with the implementation of a multi-county integrated stroke delivery network (ISDN) from April 2020 Somerset has been reviewing its stroke service to ensure that it can provide a consistent, sustainable service that is robust and provides an excellent service for its population as well as an enjoyable, supportive work environment for its staff.&lt;/p&gt;\n&lt;p&gt;It is anticipated that stroke incidence will increase in Somerset, with a projected 30% increase in stroke admissions over the next 10 years, increasing from 1300 in 2019 to approximately 1700 by 2030. In view of this increased local demand and regional changes the 2 acute organisations of Somerset NHS Foundation Trust and Yeovil District Hospital NHS Trust (YDH) have taken the unanimous decision, both managerially and clinically, to work together in order to unify the clinical pathway. It is expected that from 2022 there will be 1 HASU and 2 acute units serving both hospitals. Somerset’s service is primarily based at Musgrove Park Hospital (MPH).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Part of the review includes joint working with clinicians from both sites to improve pathways including increased consultant daily ward rounds, and implementing the changes required to the TIA pathway. The commitment for additional stroke consultant appointments to enable this change was unanimous by both sites and both CEOs are supportive of this proactive approach.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Currently the 2 services provide:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;8 Hyper-acute beds (4 on each site) and 31 Acute stroke inpatient beds (19 at MPH and 12 at YDH)&lt;/li&gt;\n&lt;li&gt;24/7 stroke thrombolysis supported by the AGWS stroke network. Our thrombolysis rate is consistently around 20%&lt;/li&gt;\n&lt;li&gt;Daily TIA Clinics 7 days a week with dedicated slots for MRI brain and carotid imaging&lt;/li&gt;\n&lt;li&gt;Expert stroke support in 2 stroke rehabilitation units (20 beds at a purpose built hospital South Petherton Community Hospital (SPCH) and 13 beds at Williton Community Hospital&lt;/li&gt;\n&lt;li&gt;Robust community team who provide ESD (multidisciplinary support for 6 weeks post discharge) and 6 month stroke reviews. The team includes a psychology team who in-reach into the acute service and a multi-centre award winning peer support education and exercise 12 week programme. At least 40% of our patients are supported through the ESD service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why should you choose this post?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be joining a dynamic and friendly team of 7 consultant stroke physicians (plus 1 experienced associate specialist), including Dr Rob Whiting and Dr. Khalid Rashed MBE, who have an excellent reputation with the Stroke Sentinel National Audit Programme (SSNAP) team&lt;/li&gt;\n&lt;li&gt;We are consistently amongst the top performers in the South-West region in the SSNAP clinical audit, with our overall score typically A or B. This is supported by a dedicated Stroke data analyst for SSNAP data input, stroke activity and analysis.&lt;/li&gt;\n&lt;li&gt;Both sites have an excellent relationship with our radiology colleagues with agreed protocols for timely brain imaging (including MRI), carotid imaging and CT-angiograms. We have recently developed the capability to perform CT perfusion imaging.&lt;/li&gt;\n&lt;li&gt;Strong links with our Tertiary Centre (Southmead Hospital, Bristol) with a well-established referral pathway for thrombectomy.&lt;/li&gt;\n&lt;li&gt;We have a friendly, enthusiastic and knowledgeable multidisciplinary team working across 7 days, including a nationally recognised Nurse Consultant and community based Therapy Consultant&lt;/li&gt;\n&lt;li&gt;Multi-disciplinary training programme supported by ex-patients, enables our junior staff to gain essential clinical experience in a non-threatening environment. A similar programme for paramedics has also proved very successful and soon to be expanded across the region.&lt;/li&gt;\n&lt;li&gt;Numerous opportunities for research (both sites have a broad portfolio of multicentre research studies in the areas of hyper-acute and acute care, and rehabilitation; YDH is the highest recruiting small DGH for stroke research)&lt;/li&gt;\n&lt;li&gt;There is an annual training allowance to enable attendance at regional, national and international stroke meetings / conferences to ensure the day-to-day care provided is evidence based and network opportunities are maximised.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why should you choose Somerset?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Somerset is a wonderful place to live.&lt;/strong&gt; Straddled between areas of outstanding natural beauty and the idyllic rolling hills of Exmoor, featuring national hotspots for cycling, surfing, and climbing such as Cheddar Gorge, there’s plenty to keep you occupied alongside the abundance of music festivals and local traditions.&lt;/li&gt;\n&lt;li&gt;From the beaches of North Devon and Dorset, to the cosmopolitan centres of Bristol, Bath, and Exeter, you can enjoy all the perks while still being less than two hours from London. Somerset has a diverse range of shopping and restaurants, and boasting sporting arenas such as the county cricket ground regularly hosting international fixtures.&lt;/li&gt;\n&lt;li&gt;If you’ve got family commitments, or are looking to settle down, Somerset offers some of the best schools in the country ranging from Public institutions such as Millfield, Queens College, Taunton School, Kings College, Wellington, and Blundell’s, to award winning state schools such as Richard Huish College which has been ranked in the top 10 of A-level providers nationally for the last eight years, through to secondary’s ranking in the top 5% nationally such as The Castle school in Taunton. Whilst over the border in Dorset (just 6 miles from Yeovil) Sherborne’s prestigious schools have been attended by world famous actors, authors, politicians, athletes and scientists.&lt;/li&gt;\n&lt;li&gt;With a great educational offering, and abundance of open countryside, we think there’s nowhere better.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details, / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Rob Whiting, Clinical Director for Stroke&lt;/p&gt;\n&lt;p&gt;Email: – Robert.Whiting@SomersetFT.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01823 343438 / 07896 152542&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121892.jpg", "name": "Yeovil District Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121892"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Somerset, Somerset", "postalCode": "BA21 4AT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9453", "longitude": "-2.63391"}}, "title": "Consultant Stroke Somerset", "url": "https://www.jobs.nhs.uk/xi/vacancy/915980524", "validThrough": "2020-11-17T23:59:59+0000"}