{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 to £30,112"}}, "datePosted": "2020-01-13T12:11:50+0000", "description": "&lt;p&gt;&lt;strong&gt;We have opportunities for band 5 Staff Nurses to work in our Older Adult wards at Queen Elizabeth Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for experienced nurses with excellent clinical skills and an interest in the health care of older adults to join our dynamic team.&lt;/p&gt;\n&lt;p&gt;The wards shares all the excellent benefits that the Queen Elizabeth Hospital has to offer, which including a IT system that is of excellent standard and assist the nursing team in been able to assess the patient holistically within minutes.&lt;/p&gt;\n&lt;p&gt;The trust has an excellent in house training facility to assist all staff to reach their career goals. Practice development nurses and Clinical educators are on hand to assist with any queries and assistance in building up practice with skills required. The wards takes a proactive part in helping ensure staff are able to attend training to help them develop the skills they need to ensure they provide the highest standard of care to their patients.&lt;/p&gt;\n&lt;p&gt;We are looking for dynamic and motivated nurses who are able to excel in a very busy environment, catering for a diversity of patients with acute and chronic medical and nursing needs, inclusive of patients with Dementia and Delirium.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work flexibly across days, nights and weekends.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be expected to work very closely with a multi-disciplinary team inclusive of Occupational Therapists, Physiotherapists, Doctors, Social Workers, pharmacists and Nurses.&lt;/p&gt;\n&lt;p&gt;Previous acute medical experience is an advantage but all applicants will be considered as long as they are willing to learn and all successful applicants will have a structured and supported induction period and will be able to access ongoing training and support from within our clinical training and education team.&lt;/p&gt;\n&lt;p&gt;If you want to work within a positive and supportive team and have the opportunity to develop professionally then please identify which hospital you are interested in working at and don’t hesitate to contact us for more information or to arrange an informal visit.&lt;/p&gt;\n&lt;p&gt;We will aim to contact you within a week of your application and interview you at a time to suit you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth Hospital", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/915914980", "validThrough": "2020-12-31T23:59:59+0000"}