{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-01-13T19:52:25+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;University College London Hospitals NHS Foundation Trust (UCLH) where outstanding care and clinical excellence come together every day.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note- you must be able to work day shifts between Monday - Friday for this role and have a minimum of 6 months NHS acute experience within the last 12 months to apply for this role.&lt;br /&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UCLH are looking for Nursing Assistants to join one of the largest and most successful Foundation Trusts in the UK.&lt;/p&gt;\n&lt;p&gt;Why join UCLH?&lt;/p&gt;\n&lt;p&gt;Our Bank Nursing Assistants are invaluable to us and in return for their dedication and commitment, we offer the following benefits:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The opportunity to work across all UCLH departments gaining invaluable skills&lt;/li&gt;\n&lt;li&gt;Access to “Lines of Work” (short, medium or long term shifts)&lt;/li&gt;\n&lt;li&gt;Join our Pool of Nursing Assistants who are guaranteed shifts working at UCLH or the National Hospital for Neurology &amp; Neurosurgery&lt;/li&gt;\n&lt;li&gt;Self service electronic timesheet submission, with weekly pay “No more paper timesheets”&lt;/li&gt;\n&lt;li&gt;A designated onsite co-ordinator to offer support and introduce you to various departments within UCLH&lt;/li&gt;\n&lt;li&gt;A dedicated recruitment team to ensure you can work as quickly as possible&lt;/li&gt;\n&lt;li&gt;A bookings team to ensure you work when and wherever you want to&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return, we are looking for Nursing Assistants that can offer us:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A passion for delivering excellent patient care and a minimum of 6 months recent experience in the NHS&lt;/li&gt;\n&lt;li&gt;Are able to commit to working regular Long Day shifts&lt;/li&gt;\n&lt;li&gt;A willingness to learn new skills as we can offer training in some departments&lt;/li&gt;\n&lt;li&gt;The ability to communicate effectively&lt;/li&gt;\n&lt;li&gt;Commitment to working well within a patient focused team.&lt;/li&gt;\n&lt;li&gt;A minimum of 6 Months in the NHS within the last 12 months&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you fit the above criteria, please apply today.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospital", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank Band 2 HealthCare Assistants- Day Shifts Only", "url": "https://www.jobs.nhs.uk/xi/vacancy/915916282", "validThrough": "2020-12-31T23:59:59+0000"}