{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-01-31T11:12:28+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking to appoint a Consultant Psychiatrist to join our new Inpatient team. You will be passionate about empowering young people and will work with them to co-design an inpatient service that responds to their needs and works collaboratively with their local community services.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This new service opened in December 2019 and hosts 9 General adolescent beds (including a High Dependency Area) and 4 Psychiatric intensive care beds and delivers a progressive and innovative service model from a newly built state of the art building.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A clinical model which will be centred on the delivery of; &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;A robust approach to assessment, formulation and the planning of treatment approaches which provide developmentally appropriate care attuned to the complex mental health needs of young people. The service is provided in a high quality, safe environment which can manage and support both high levels of clinical risk and high levels of vulnerability. There is a strong emphasis on evidence based treatment delivered by a comprehensive Multi-Disciplinary Team with a core team of expert psychiatry, psychology, therapists, education and nursing staff.&lt;/p&gt;\n&lt;p&gt;The unit delivers an excellent standard of inpatient care working in partnership with the local community as well as being part of a wider network of agencies supporting the mental health and emotional wellbeing needs of young people and families. The service will step away from a system defined in terms of the services the organization provides (Tiered model) towards one that sees service provision as a whole system approach with the focus being on the desire to build upon individual and community strengths wherever possible and ensures that young people and their families are active decision makers in the process of choosing the right treatment approach.&lt;/p&gt;\n&lt;p&gt;The role of the Consultant Psychiatrist is to provide dedicated, high quality medical care and treatment for young people and their families presenting with a range of mental health issues and developmental trauma. The successful applicant will part of a clinical leadership team including a Consultant Psychologist and Clinical Lead.&lt;/p&gt;\n&lt;p&gt;The post holder will be interested in developing and delivering innovative interventions and will have excellent skills in engaging with young people and will enjoy working as part of a MDT. Suitable candidates will have a high level of clinical skills in assessment and intervention, offering a needs led service, utilizing shared decision making and drawing flexibly on a range of models, theories and approaches in their work. Equally important to the role is the provision of consultancy, supervision and training to professional colleagues and participation in research, evaluation and service development as appropriate.&lt;/p&gt;\n&lt;p&gt;Applicants should have Full Registration with the GMC &amp; the MRCPsych UK or equivalent post – graduate qualification. They should be on the specialist Register for Child &amp; Adolescent Psychiatry or be within 6 months of completing CCT in Child &amp; Adolescent Psychiatry.&lt;/p&gt;\n&lt;p&gt;We see this post as absolutely key to the delivery of a new and outstanding service and therefore the salary is negotiable.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact Michele Moran CEO or Dr John Byrne Medical Director&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull", "postalCode": "HU3 2RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7384", "longitude": "-.353389"}}, "title": "CAMHS Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/915943619", "validThrough": "2020-11-30T23:59:59+0000"}