{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46815", "minValue": "22760", "unitText": "YEAR", "value": "£13.54-£27.85"}}, "datePosted": "2020-01-13T19:43:22+0000", "description": "&lt;p&gt;Are you a Registered Nurse looking to gain experience at UCLH? UCLH has an international reputation as a centre of clinical excellence and includes state of the art facilities such as the UCH Macmillan Cancer Centre.&lt;/p&gt;\n&lt;p&gt;Situated in the busy West End of London, we have a lively and vibrant working atmosphere, with quick and easy transport links to all our sites&lt;/p&gt;\n&lt;p&gt;The &lt;strong&gt;Oncology &lt;/strong&gt;inpatient wards are looking for motivated bank nurses willing to commit to a regular line of work&lt;br /&gt;&lt;br /&gt; The inpatient unit includes 2 oncology wards with a total of 42 beds, which provide a variety of treatments including:&lt;br /&gt;&lt;br /&gt;• Cytotoxic chemotherapy&lt;br /&gt;• Trial treatments&lt;br /&gt;• Biological therapies&lt;br /&gt;• Radiotherapy&lt;br /&gt;• Brachytherapy&lt;br /&gt;• Radioisotope treatments &lt;br /&gt;• Palliative care including complex symptom management end of life care&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;What we can offer you:&lt;/strong&gt;&lt;br /&gt; Regular bank workers willing to commit to a minimum of 2 shifts a week will be offered a paid place on the acute oncology study day and the 3 hour Sage &amp; Thyme communications training. This will total 10.5 hours towards your F2F CDP for NMC revalidation.&lt;/p&gt;\n&lt;p&gt;After a minimum of 8 shifts and following the successful competency assessments for ANTT, IV administration and CVCs you will be paid a B5+ for your continued commitment to the unit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For &lt;span style=&quot;text-decoration: underline;&quot;&gt;further details / informal visits contact:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If a line of work in oncology interests you please call Oncology Matron - Janet Saunders 07508 015 516, alternatively please apply directly and a member of the Bank recruitment team will contact you shortly.&lt;/p&gt;\n&lt;p&gt;Our Bank Nurses are invaluable to us and in return for their dedication and commitment, we offer the following benefits:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The opportunity to work across all UCLH departments gaining invaluable skills&lt;/li&gt;\n&lt;li&gt;Access to “Lines of Work” (guaranteed short, medium or long term shifts)&lt;/li&gt;\n&lt;li&gt;Priority of shifts over an agency worker, accommodating your availability&lt;/li&gt;\n&lt;li&gt;An online self booking system that also allows you to submit timesheets electronically - “No more paper time sheets”&lt;/li&gt;\n&lt;li&gt;A designated onsite co-ordinator to offer support and introduce you to various departments within UCLH&lt;/li&gt;\n&lt;li&gt;A dedicated recruitment team to ensure you can work as quickly as possible&lt;/li&gt;\n&lt;li&gt;A bookings team to ensure you work when and wherever you want to&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you have 6 months NHS experience and you are looking to further your career in a hospital that has cutting edge technology, please apply online today.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank Band 5/6 Nurse- Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/915916273", "validThrough": "2020-12-31T23:59:59+0000"}