{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Comparable to NHS Specialty Doctor pay scale"}}, "datePosted": "2020-04-03T08:19:15+0100", "description": "&lt;p&gt;St Michael&#39;s Hospice, located in St Leonards on Sea, East Sussex, provides excellent holistic car and support for those throughout Hastings and Rother affected by a progressive life-limiting illness or bereavement,&lt;/p&gt;\n&lt;p&gt;We are looking for a Specialty Doctor in Palliative Care whose primary focus will be to provide specialist palliative medical input to the In-Patient Unit. We have a dedicated 22 bedded in-patient unit, caring for both acute and continuing care patients. We also offer an exciting new Wellbeing Programme and a Hospice at Home Service offering 24/7 support to the community. You will be joining a team of Specialty Doctors. Senior support is provided by the Medical Director and a full-time Associate Specialist in Palliative Care.&lt;/p&gt;\n&lt;p&gt;Working as part of the multi-disciplinary team, you will deliver high quality professional care to the patients and relatives in the Hospice. You will work closely with the whole clinical team to ensure that we offer the highest standards of care, developing our services to meet the changing needs of our patients.&lt;/p&gt;\n&lt;p&gt;You will need to have MB BS or equivalent and postgraduate qualifications, either MRCP, MRCGP or equivalent, although not necessary, are desirable. Specialist Palliative Care is is not essential. You need to be fully registered with the GMC.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have excellent communication skills, compassion and an ability to work in respectful partnership with all members of the Multi-Disciplinary Team.&lt;/p&gt;\n&lt;p&gt;We offer a competitive salary and benefits include:&lt;br /&gt; • The opportunity to make a real difference to this local charity and join our organisation during an exciting time&lt;br /&gt; • A friendly, team-orientated work environment and offer a good pension scheme, (option to continue existing NHS pension scheme membership) and childcare vouchers&lt;br /&gt; • Flexible working options available&lt;/p&gt;\n&lt;p&gt;A disclosure and barring service check is required for this role&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Social Enterprises", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130655"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Leonards-on-sea", "postalCode": "TN38 0LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8548", "longitude": ".552205"}}, "title": "Specialty Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916021630", "validThrough": "2020-12-31T23:59:59+0000"}