{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30054", "minValue": "24755", "unitText": "YEAR", "value": "£24,755 - £30,054 pro-rata, per annum"}}, "datePosted": "2020-07-02T15:47:59+0100", "description": "&lt;p&gt;Registered Nurse – Wheatfields Hospice&lt;br /&gt;&lt;br /&gt;Competitive salary, enhancements, continuation of your NHS pension &amp; NHS annual leave honoured.&lt;br /&gt;&lt;br /&gt;Are you looking for a new challenge and the opportunity to make a real difference within your community?&lt;br /&gt;&lt;br /&gt;You are invited to join us at Sue Ryder Wheatfields Hospice and become part of our well-established team.&lt;br /&gt;&lt;br /&gt;We are seeking compassionate and dedicated Nurses who are looking to make a difference.&lt;br /&gt;&lt;br /&gt;We welcome applications from newly qualified Nurses.&lt;br /&gt;&lt;br /&gt;About the Role:&lt;br /&gt;&lt;br /&gt;We have full time vacancies up to 37.5 hours per week and this can be discussed at interview.&lt;br /&gt;&lt;br /&gt;We can offer you long days if requested to complement a work life balance.&lt;br /&gt;&lt;br /&gt;The successful applicants will play an active role within our team, providing excellent personalized care. It&#39;s all about giving them the best possible quality of life. The support we offer is tailored to meet individuals&#39; medical, social, spiritual and emotional needs.&lt;br /&gt;&lt;br /&gt;About you:&lt;br /&gt;&lt;br /&gt;Ideally you will be an NMC registered nurse, with post-registration experience in palliative end of life care&lt;br /&gt;&lt;br /&gt;You will need to be able to demonstrate the ability to work well within a team, use initiative and have excellent communication skills.&lt;br /&gt;&lt;br /&gt;You will also:&lt;br /&gt;&lt;br /&gt;- Assess, plan, implement and evaluate individualised care using evidence-based guidelines&lt;br /&gt;- Maintain high standards of care delivery by working collaboratively within regulatory body standards and the Sue Ryder Quality Governance Policy&lt;br /&gt;- Provide support, leadership appraisal and supervision to team members as appropriate&lt;br /&gt;- Act as an ambassador of Sue Ryder to service users and their relatives, colleagues and members of the public&lt;br /&gt;&lt;br /&gt;About Us:&lt;br /&gt;&lt;br /&gt;Wheatfields is a Sue Ryder Hospice based in Leeds .We provides expert palliative and end of life care, in a beautiful setting, for thousands of local people each year. We are part of a large charity but have a close relationship within the local community and offer a large range of specialist services to support patients, their families and friends.&lt;br /&gt;&lt;br /&gt;Competitive Benefits:&lt;br /&gt;• Up to £24,755 - £30,054 pro-rata, per annum (DOE)&lt;br /&gt;• 25 days holiday - rising to 30 with length of service plus bank holidays&lt;br /&gt;• Option to buy and sell up to five days holiday&lt;br /&gt;• Competitive enhanced pay for nights, weekends and public holidays&lt;br /&gt;• NHS holiday honoured up to a maximum of 30 days (Terms and Conditions apply)&lt;br /&gt;• Continuation of NHS pension&lt;br /&gt;• Company pension scheme&lt;br /&gt;• Enhanced maternity and paternity benefits&lt;br /&gt;• Enhanced sick pay&lt;br /&gt;• Cash referral bonus scheme&lt;br /&gt;• Carer’s leave policy&lt;br /&gt;• 24 hour employee assistance line for free advice on work, family and personal life&lt;br /&gt;• PeoplePerks - discounts with hundreds of retailers and services&lt;br /&gt;• Staff discounts of 15% at the Sue Ryder online shop&lt;br /&gt;• Cycle to work scheme&lt;br /&gt;• Staff loans and company car loans&lt;br /&gt;• Free parking, subsidised meals &amp; drinks&lt;br /&gt;• Wellbeing centre and free will writing service&lt;br /&gt;• Development opportunities for all through our structured development framework&lt;br /&gt;&lt;br /&gt;For more information and informal discussion please contact Sue Waddington on 0113 278 7249 or email sue.waddington@suerydercare.org&lt;br /&gt;&lt;br /&gt;Sue Ryder supports people through the most difficult times of their lives. Whether that’s a terminal illness, the loss of a loved one or a neurological condition – we’re there when it matters. Our doctors, nurses and carers give people the compassion and expert care they need to help them live the best life they possibly can.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Headingley/Leeds", "postalCode": "LS6 2AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8213", "longitude": "-1.57377"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916099661", "validThrough": "2020-11-30T23:59:59+0000"}