{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-04-08T11:01:53+0100", "description": "&lt;p&gt;Symphony Healthcare Services (SHS) was established in 2016 as part of the award winning NHS Symphony Programme Vanguard developing new models of care. With a growing network of 9 practices over 13 sites and 40 employed GPs, we are now recruiting to new opportunities for General Practitioners in our Crewkerne Practice.&lt;/p&gt;\n&lt;p&gt;Crewkerne Health Centre is a well-established, friendly, patient centred practice close to the Jurassic Coast and with beautiful surrounding countryside. It is a semi-rural Practice based in a Somerset market town with purpose-build premises and an in-house part-owned pharmacy.&lt;/p&gt;\n&lt;p&gt;The Practice joined the SHS team in July 2017. In July 2018 nearby West One Surgery joined SHS to become part of Crewkerne Health Centre as a second site. Our integrated team now provides a wide range of services to around 13,000 patients across the two locations.&lt;/p&gt;\n&lt;p&gt;Crewkerne Health Centre is high achieving, with a stable population and a highly effective multi-disciplinary team including Nurse Practitioners, Emergency Care Practitioners and Health Coaches. We are also currently extending the team with the development of new Pharmacy roles.&lt;/p&gt;\n&lt;p&gt;The team are committed to a high standard of general practice, working in a integrated way across primary and secondary care and working closely with community staff who are co-located in the surgery. They are also working closely with all of the other four SHS Practices as part of the development of the South Somerset West Primary Care Network.&lt;/p&gt;\n&lt;p&gt;We are now looking for an enthusiastic and committed GP to join our long established and highly motivated team at Crewkerne Health Centre. We have up to 9 sessions available and will consider part time applicants.&lt;/p&gt;\n&lt;p&gt;We offer our GPs a range of flexible working options together with a competitive remuneration package based on the BMA GP contract with additional incentive payments and further allowances for GPs with specialist skills and experience. We also offer a Mentorship Scheme for newly qualified GPs who will also be supported by our GP Trainer based at Crewkerne Health Centre.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;CVs and Questions to:&lt;/p&gt;\n&lt;p&gt;Sue Oliver, Head of HR&lt;/p&gt;\n&lt;p&gt;Sue.Oliver@YDH.NHS.UK | 01935 606159&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132135.JPG", "name": "Symphony ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132135"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewkerne", "postalCode": "TA18 8BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8806", "longitude": "-2.79818"}}, "title": "Employed GP - Crewkerne Health Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916024671", "validThrough": "2020-11-30T23:59:59+0000"}