{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30930", "minValue": "30930", "unitText": "YEAR", "value": "£18.40 / hour (inc.holiday pay) + enhancements"}}, "datePosted": "2020-06-25T11:37:02+0100", "description": "&lt;p&gt;Do you want to…..&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work as part of a dedicated team?&lt;/li&gt;\n&lt;li&gt;Join a forward thinking, innovative organisation which puts its patients first?&lt;/li&gt;\n&lt;li&gt;Contribute to the provision of high quality care?&lt;/li&gt;\n&lt;li&gt;Choose your own hours to fit in with your personal circumstances on an ad hoc basis?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;…............then working within our Trust Bank could be just what you are looking for.&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) have vacancies for motivated, resourceful and forward thinking Bank Level 6 Physiotherapists for flexible working via the Trust Bank, the organisation’s temporary staffing department.&lt;/p&gt;\n&lt;p&gt;These exciting opportunities are within our Adult Community Services Division, which provides high quality care to patients in their own homes as well as in a range of clinic settings. We are part of an integrated health and social team working together to look after the population of Birmingham.&lt;/p&gt;\n&lt;p&gt;As part of the integrated service provision within the Early Intervention Community Team (EICT) under the Supervision of the Locality Operations Manager, you will provide Physiotherapy assessments and intervention within the team&lt;/p&gt;\n&lt;p&gt;Our Physiotherapists work multi-professionally, support other team members’ roles and contribute to the future development of the Service providing professional advice and appropriate training to others in the multi-disciplinary service.&lt;/p&gt;\n&lt;p&gt;You will be part of the overarching Early Intervention Team for the Division ensuring the Team’s voice is integral to the transformation and future direction of the service.&lt;/p&gt;\n&lt;p&gt;Our aim is to ensure the delivery of high quality intervention to patients within their own homes and other community settings, preventing avoidable hospital admissions, and facilitating hospital discharge, in line with the overall objectives of the service.&lt;/p&gt;\n&lt;p&gt;You will also be required to ensure delivery of high quality patient centred intervention, measured by clinical effectiveness, patient safety and patient experience, as well as meeting the key performance measures as required by the Trust.&lt;/p&gt;\n&lt;p&gt;For informal enquiries, please contact:-&lt;/p&gt;\n&lt;p&gt;EICT Locality Manager: penny.anderson@bhamcommunity.nhs.uk or Senior Clinical Manager Trust Bank:&lt;span style=&quot;text-decoration: underline;&quot;&gt;Samantha.tullett@bhamcommunity.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;BCHC delivers a range of healthcare services across a number of sites and specialties. Our Trust Bank provides temporary cover to cover shortfalls in staffing, supporting the delivery of the service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam email&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust is committed to providing a safe working environment for all staff.&lt;/p&gt;\n&lt;p&gt;As part of the Trust’s on-going response to the management of COVID-19 secure workplaces, strict health and safety measures and infection prevention and control has been put into place. As with any healthcare setting that cares for patients, we are and remain committed to ensure that we adhere to nationally mandated infection prevention and control policies and practices, alongside the appropriate training to ensure we protect all our staff, visitors and patients and minimise/eliminate risk in line with NHS Health Governance standards. The Recruitment programmes we are undertaking are in accordance with these measures to ensure the safety of all candidates. We are committed to protecting our staff and services users from infection and encourage our staff to uptake their annual flu vaccination.&lt;/p&gt;\n&lt;p&gt;As a Trust, we offer and encourage staff to complete either a Black and Minority Ethnic (BME) risk assessments, regular COVID-19 risk assessments and/or working at home risk assessments to identify additional support measures or reasonable adjustments that may be required as appropriate. We encourage all staff to ensure they benefit from the various support measures which have been put into place which help us to support and protect our staff, visitors and patients to provide the Best Care in Healthy Communities.&lt;/p&gt;\n&lt;p&gt;These measures are within the provisions of Health and Safety and are in line with the Trust’s expectation that all staff will comply with the measures put in place and to ensure social distancing is adhered to&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B7 4BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4873", "longitude": "-1.88581"}}, "title": "Bank Level 6 Physiotherapist (Early Intervention)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916090881", "validThrough": "2021-09-20T23:59:59+0100"}