{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29252", "minValue": "29252", "unitText": "YEAR", "value": "£29252.70  + £5K Welcome Bonus"}}, "datePosted": "2020-04-01T10:40:42+0100", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Priory Hospital Arnold provides acute adult mental health services, delivered in partnership with Nottinghamshire Healthcare Trust, at our purpose built facility in Arnold. After two years of successfully providing services for women, we opened a second service in May on behalf of the Trust, for male patients andwe are about to open our brand new PICU service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our RMN role involves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing a high standard of care to people with mental illness and personality disorder&lt;/li&gt;\n&lt;li&gt;Developing therapeutic relationships to optimise patient engagement&lt;/li&gt;\n&lt;li&gt;Following all codes of conduct, standards and legislation, respecting the rights of others and promoting ethical practice&lt;/li&gt;\n&lt;li&gt;Contributing to patient assessments, compiling a plan of care alongside the individual, and monitoring patient progress&lt;/li&gt;\n&lt;li&gt;At a more senior level, you’ll also need to lead shifts as well as mentoring and supporting student nurses and other members of the team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To be successful as an RMN, you’ll need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A relevant nursing qualification and registration&lt;/li&gt;\n&lt;li&gt;Excellent team working skills, a high level of self-motivation and a flexible approach - our units operate 24 hours 7 days a week, and our nursing staff work shift patterns including weekends, bank holidays and nights.&lt;/li&gt;\n&lt;li&gt;A commitment to patient-centred care and to values-based and evidence-based practice&lt;/li&gt;\n&lt;li&gt;The drive to continually push your own personal learning and development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;About our benefits In return for your expertise and hard work, we offer a wide range of benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Sign on bonus - £5,000 Welcome to Priory – either a sign on bonus or an e-voucher code for the Priory Benefits portal to be redeemed on various items including discounted shopping, red letter days, gym membership etc&lt;/li&gt;\n&lt;li&gt;Relocation support (including payment for accommodation or moving costs), paid as a lump sum&lt;/li&gt;\n&lt;li&gt;Moving less than 100 miles up to £2,000 (To be repaid if individual does not complete probation &amp; leaves)&lt;/li&gt;\n&lt;li&gt;If more than 100 miles up to £4,000 (To be repaid if individual does not complete probation &amp; leaves)&lt;/li&gt;\n&lt;li&gt; Payment into the pension scheme&lt;/li&gt;\n&lt;li&gt; CPD top up&lt;/li&gt;\n&lt;li&gt; Donation to a charity of their choice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;No agencies please&lt;/p&gt;\n&lt;p&gt;If you forward any CV’s to the Priory Group and you are not on the Priory Group PSL and have not been asked to work on the above role we will accept theCVas a gift.&lt;/p&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;Disclosure&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arnold, Nottinghamshire", "postalCode": "NG5 8PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0314", "longitude": "-1.11149"}}, "title": "Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916019990", "validThrough": "2020-11-27T23:59:59+0000"}