{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27121", "minValue": "24755", "unitText": "YEAR", "value": "£24,755 - £27,121 pro-rata for part time"}}, "datePosted": "2020-07-01T10:38:09+0100", "description": "&lt;p&gt;Registered Nurse - IPU – Thorpe Hall Hospice&lt;br /&gt;&lt;br /&gt;Competitive salary, enhancements, continuation of your NHS pension.&lt;br /&gt;&lt;br /&gt;Are you looking for a new challenge and the opportunity to make a real difference within your community?&lt;br /&gt;&lt;br /&gt;You are invited to join us at Sue Ryder Thorpe Hall Hospice, rated as outstanding by the CQC.&lt;br /&gt;&lt;br /&gt;We are seeking compassionate and dedicated Registered Nurses who are looking to make a difference.&lt;br /&gt;&lt;br /&gt;About the Role:&lt;br /&gt;&lt;br /&gt;We have vacancies which are full &amp; part time.&lt;br /&gt;&lt;br /&gt;Variable shifts available including days, nights &amp; weekends on an internal shift/rotation basis.&lt;br /&gt;&lt;br /&gt;We are very pleased to be able to accept applications to join us at this time.&lt;br /&gt;&lt;br /&gt;The successful applicants will play an active role within our team. It&#39;s all about giving our patients the best possible quality of life. The support we offer is tailored to meet individuals&#39; medical, social, spiritual and emotional needs.&lt;br /&gt;&lt;br /&gt;About you:&lt;br /&gt;&lt;br /&gt;Ideally you will be an NMC registered nurse, with post-registration experience in palliative end of life care&lt;br /&gt;&lt;br /&gt;You will need to be able to demonstrate the ability to work well within a team, use initiative and have excellent communication skills.&lt;br /&gt;&lt;br /&gt;You will also:&lt;br /&gt;&lt;br /&gt;- Assess, plan, implement and evaluate individualised care using evidence-based guidelines&lt;br /&gt;- Maintain high standards of care delivery by working collaboratively within regulatory body standards and the Sue Ryder Quality Governance Policy&lt;br /&gt;- Provide support, leadership appraisal and supervision to team members as appropriate&lt;br /&gt;- Act as an ambassador of Sue Ryder to service users and their relatives, colleagues and members of the public&lt;br /&gt;&lt;br /&gt;About Us:&lt;br /&gt;&lt;br /&gt;Thorpe Hall is a Sue Ryder hospice, based in Peterborough. We’re here for people aged 18 and over who are living with conditions like cancer, heart failure and lung disease. We offer a range of support to patients and their families including inpatient care in our 20 bed hospice, a day service for those with long-term conditions and support in the community through our befriending, Hospice at Home and bereavement services.&lt;br /&gt;&lt;br /&gt;Competitive Benefits:&lt;br /&gt;• £24,755 - £27,121 pro-rata for part time, per annum&lt;br /&gt;• 25 days holiday - rising to 30 with length of service plus bank holidays&lt;br /&gt;• Competitive enhanced pay for nights, weekends and public holidays&lt;br /&gt;• Continuation of NHS pension&lt;br /&gt;• Company pension scheme&lt;br /&gt;• Enhanced maternity and paternity benefits&lt;br /&gt;• Enhanced sick pay&lt;br /&gt;• Referral scheme of up to £1,000&lt;br /&gt;• Carer’s leave policy&lt;br /&gt;• 24 hour employee assistance line for free advice on work, family and personal life&lt;br /&gt;• PeoplePerks - discounts with hundreds of retailers and services&lt;br /&gt;• Staff discounts of 15% at the Sue Ryder online shop&lt;br /&gt;• Cycle to work scheme&lt;br /&gt;• Staff loans and company car loans&lt;br /&gt;• Free parking, tea and coffee and subsidised meals&lt;br /&gt;• Wellbeing centre and free will writing service&lt;br /&gt;• Development opportunities for all through our structured development framework&lt;br /&gt;&lt;br /&gt;Sue Ryder supports people through the most difficult times of their lives. Whether that’s a terminal illness, the loss of a loved one or a neurological condition – we’re there when it matters. Our doctors, nurses and carers give people the compassion and expert care they need to help them live the best life they possibly can.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE3 6LW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5729", "longitude": "-.277057"}}, "title": "Registered Nurse - In-Patient Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916097085", "validThrough": "2020-11-30T23:59:59+0000"}