{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17238", "minValue": "17238", "unitText": "YEAR", "value": "£17,238 pro-rata, per annum"}}, "datePosted": "2020-07-01T13:09:43+0100", "description": "&lt;p&gt;Bank Nursing Assistant - Palliative Care Hub&lt;br /&gt;£17,238 pro-rata, per annum plus excellent enhancements&lt;br /&gt;St John’s Hospice, Moggerhanger, Bedford MK44 3RJ&lt;br /&gt;&lt;br /&gt;We have excellent opportunities for experienced carers to join our busy but very friendly community team at St John’s Hospice on a Bank basis. If you are an enthusiastic and committed carer who is interested in a rewarding career within palliative care we&#39;d like to hear from you!&lt;br /&gt;&lt;br /&gt;St John’s Palliative Care Hub provides palliative care 24 hours a day, seven days a week for individuals with a life-limiting condition who choose to receive care at home.&lt;br /&gt;&lt;br /&gt;The Palliative Care Hub works together with local care providers, GPs, district nurses, specialist nurses, the ambulance service and other health and social care professionals to coordinate and provide the best possible care.&lt;br /&gt;&lt;br /&gt;Benefits&lt;br /&gt;• **Competitive enhanced pay for nights (30%), weekends (45%) and public holidays (60%)**&lt;br /&gt;• *Continuation of NHS pension*&lt;br /&gt;• *Mileage paid*&lt;br /&gt;• Company pension scheme&lt;br /&gt;• Paid qualifications&lt;br /&gt;• Corporate discount with hundreds of retailers and services&lt;br /&gt;• Staff discount of 15% on new goods online at shop.sueryder.org&lt;br /&gt;• Cash referral bonus scheme&lt;br /&gt;• Online Wellbeing Centre&lt;br /&gt;• Free Will writing service&lt;br /&gt;• Free onsite parking&lt;br /&gt;• Free uniform&lt;br /&gt;• Carers leave policy&lt;br /&gt;• Subsidised onsite meals and drinks&lt;br /&gt;• Structured induction programme and learning and development opportunities&lt;br /&gt;&lt;br /&gt;About you:&lt;br /&gt;&lt;br /&gt;As one of our Nursing Assistants you will be part of a team offering advice, support and end of life care to patients, their families and carers, either over the phone or in their home. Your role will make a real difference in supporting patients to have choice about where they are cared for, and in providing the excellent palliative care they need.&lt;br /&gt;&lt;br /&gt;To join us as a Nursing Assistant, you’ll need:&lt;br /&gt;• Experience of providing care&lt;br /&gt;• Experience of working in a team&lt;br /&gt;• Strong IT skills, including proficiency in MS Word, the internet and email&lt;br /&gt;• A full driving licence and access to your own vehicle is essential&lt;br /&gt;• Strong communication skills and an empathetic approach&lt;br /&gt;&lt;br /&gt;It takes a special sort of person to join our team so if you could see yourself as one of our Nursing Assistants, please apply via the button shown.&lt;br /&gt;&lt;br /&gt;Sue Ryder supports people through the most difficult times of their lives. Whether that’s a terminal illness, the loss of a loved one or a neurological condition – we’re there when it matters. Our doctors, nurses and carers give people the compassion and expert care they need to help them live the best life they possibly can.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moggerhanger/Bedford", "postalCode": "MK44 3RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1281", "longitude": "-.335766"}}, "title": "Bank Nursing Assistant - Palliative Care Hub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916097527", "validThrough": "2020-11-30T23:59:59+0000"}