{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "90000", "minValue": "90000", "unitText": "YEAR", "value": "90000"}}, "datePosted": "2020-07-02T15:41:02+0100", "description": "&lt;p&gt;&lt;strong&gt;We are currently recruiting for Salaried GPs within our group.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Excellent remuneration package including Medical Defense fees &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Midlands Medical Partnership (MMP) is a Birmingham super-partnership currently caring for 64,000 Birmingham &amp; Solihull CCG patients across North and Central Birmingham operating out of 10 sites. The partnership was established in April 2009 and continues to grow as a single integrated primary care provider, alongside collaborative working with other similar organisations in our region as part of its strategic forward view.&lt;/p&gt;\n&lt;p&gt;The vision behind the creation of MMP is to improve and develop all that is excellent about traditional GP services – local GPs leading and working in local surgeries to provide long-term doctor/patient relationships based on the established values of trust and personalised care, whilst at the same time being part of a larger, more corporate business structure, allowing our practices and patients to benefit from the resources of a larger organisation, enabling us to improve the range and quality of patient services, improve access and patient responsiveness and improve learning across our organisation.&lt;/p&gt;\n&lt;p&gt;MMP’s core purpose is “to work within a culture of quality to constantly improve the care and service we give our patients.”&lt;/p&gt;\n&lt;p&gt;This dynamic partnership with a team of over 200 clinicians and staff is managed by a single executive board, with centralised organisational functions, strong leadership and clinical governance structures. The ambition and vision of the partnership is to provide large scale, integrated, multi-specialty care for its patients. Most of our sites are training practices and training in areas of special interest is greatly supported.&lt;/p&gt;\n&lt;p&gt;Candidates with specialist skills, and/ or interested in becoming GP trainers/ qualified trainers are of particular interest.&lt;/p&gt;\n&lt;p&gt;MMP supports the BSOL CCG GP Fellowship Scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion about the role please contact Sonia Rai- Human Resources Consultant on 0121 647 5835 extension 1232 or 07884 107281.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B14 7NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4263", "longitude": "-1.90827"}}, "title": "Salaried GP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916099619", "validThrough": "2020-12-31T23:59:59+0000"}