{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "101734", "minValue": "75359", "unitText": "YEAR", "value": "£44.83ph - £60.52ph"}}, "datePosted": "2020-03-20T13:10:16+0000", "description": "&lt;ol&gt;\n&lt;li&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;THE POST &lt;/strong&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Bank Doctors are required to provide patient care for many specialties in the Trust. Specialties include General and Specialty Medicine, General and Specialty Surgery, Anaesthetics, Emergency Medicine, Paediatrics and Obstetrics &amp; Gynaecology.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Bank bookings can range from one day to several weeks. Working patterns vary from booking to booking and can include weekday day duty, evening, weekend and night duty on full shift and on-call rotas.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;. &lt;span style=&quot;text-decoration: underline;&quot;&gt;IMPERIAL COLLEGE HEALTHCARE NHS TRUST&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Imperial College Healthcare NHS Trust was created on October 1, 2007 by merging St. Mary’s NHS Trust and Hammersmith Hospitals NHS Trust and integrating with the faculty of medicine of Imperial College London. One of the largest NHS trust in the country, we have come together to establish the UK’s first academic health science centre (AHSC). The Trust has an annual turnover of over £950 million, approximately 10,000 staff, and it see over 500,000 patients a year.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The creation of the AHSC, a partnership between the NHS and Imperial College London, is a major advance for patient care, clinical teaching and scientific invention and innovation. The fusion of the different strands of our work and the achievements that can now be realised will lead to significant benefits for patients and greater advances in healthcare than could be delivered apart.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Imperial College Healthcare NHS Trust already has a world-leading reputation. Hammersmith and St Mary’s hospitals have two of the highest clinical ratings in the country, rated second and third best Trusts for clinical performance, quality of care and safety.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust was awarded the status of a generic Biomedical Research Centre by the National Institute of Health Research (NIHR) in 2006 for its excellence in translational and clinical research – one of only 5 in the UK.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Imperial College London has a campus on all main sites and is increasingly integrated with all the clinical specialties. The Clinical Sciences Centre of the Medical Research Council (MRC) is also based at Hammersmith Hospital providing a strong foundation for clinical and scientific research.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Imperial College Healthcare NHS Trust is one of the largest education, training and research centres nationally; it is the clinical partner of the Imperial Academic Health Science Centre. All of our staff are actively encouraged to become involved with education and/or research, in addition to their clinical role. There is an annual review of job plans, with potential educational or research PAs available for dedicated education, training or research time. These PAs are awarded ad personam, relate to specific workload with metrics and are subject to annual performance review&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Bank Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916012379", "validThrough": "2021-03-31T23:59:59+0100"}