{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22895", "minValue": "20911", "unitText": "YEAR", "value": "£12.44 - £13.62 per hour plus enhancements"}}, "datePosted": "2020-07-01T10:42:22+0100", "description": "&lt;p&gt;Registered Nurse - Bank&lt;br /&gt;St John&#39;s Hospice&lt;br /&gt;£12.44 - £13.62per hour plus excellent enhancements&lt;/p&gt;\n&lt;p&gt;You are invited to join us at Sue Ryder St John&#39;s Hospice, rated as outstanding by the CQC.&lt;br /&gt;&lt;br /&gt;Are you an NMC registered nurse? Want to develop a rewarding career with a recognised national charity? If so, this is an amazing opportunity to develop your knowledge in palliative care and work across a range of palliative services.&lt;br /&gt;&lt;br /&gt;The great benefit about being on the talent bank is the flexibility it provides for both you and the Charity. You have control over when you want to work to fit in with your lifestyle. You must be flexible with excellent people skills and be a team player. Now, we are calling on Registered Nurses (RGN) to join our amazing hospice in-patient and community services at St John’s Hospice.&lt;br /&gt;&lt;br /&gt;About Us:&lt;br /&gt;&lt;br /&gt;St John’s is a Sue Ryder hospice, based in the village of Moggerhanger in Bedfordshire. We’re here for people aged 18 and over who are living with conditions like cancer, heart failure and lung disease. We offer a range of support to communities across Bedfordshire and Cambridgeshire, from inpatient care in our 15 bed hospice to day services which help people stay at home longer and offer respite to carers. The location is serviced by the number 73 bus, however due to shifts patterns; it is recommended you have your own transport to get to and from work.&lt;br /&gt;&lt;br /&gt;Your Benefits:&lt;br /&gt;&lt;br /&gt;- £12.44 - £13.62 per hour plus excellent enhancements&lt;br /&gt;- Continuation of NHS pension&lt;br /&gt;- Private pension scheme matched at 5%&lt;br /&gt;- Referral scheme of up to £500&lt;br /&gt;- PeoplePerks - discounts with hundreds of retailers and services&lt;br /&gt;- Free parking and subsidised meals&lt;br /&gt;- Development opportunities for all through our structured development framework&lt;br /&gt;&lt;br /&gt;In this key role, you will:&lt;br /&gt;&lt;br /&gt;• Assess, plan, implement and evaluate individualised care using evidence based guidelines&lt;br /&gt;• Liaise with the multidisciplinary team over service user care&lt;br /&gt;• Maintain all records in line with corporate policies and procedures&lt;br /&gt;• Carry out all clinical procedures in line with Sue Ryder policies&lt;br /&gt;• Ensure the care team provide all care in line with the multi professional evidence based care plan&lt;br /&gt;&lt;br /&gt;About You:&lt;br /&gt;&lt;br /&gt;To join our team, you’ll need:&lt;br /&gt;&lt;br /&gt;- To be an NMC registered nurse, ideally with post-registration experience in palliative end of life care&lt;br /&gt;- A compassionate and people-centred approach&lt;br /&gt;- Excellent communication skills&lt;br /&gt;&lt;br /&gt;Sue Ryder are equal opportunities employers, value diversity and are strongly committed to providing equal employment opportunities for all employees and all applicants for employment. Equal opportunities are the only acceptable way to conduct business and we believe that the more inclusive our environments are, the better our work will be.&lt;br /&gt;&lt;br /&gt;It takes a special sort of person to join our team so if you could see yourself as one of our Registered Nurses, please apply via the button shown.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moggerhanger/Bedford", "postalCode": "MK44 3RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1281", "longitude": "-.335766"}}, "title": "Registered Nurse - Bank", "url": "https://www.jobs.nhs.uk/xi/vacancy/916097093", "validThrough": "2020-11-30T23:59:59+0000"}