{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-05-27T12:16:21+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you a Consultant Psychiatrist who is dedicated and passionate about improving mental health services? Are you looking for your next role as a dynamic clinical leader in Learning Disabilities Psychiatry?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;AWP is transforming and this is a unique opportunity to join our Trust and help us shape the future of our organisation. We aspire to provide the best possible care in the right place, at the right time, to help our service-users recover and to live their best possible lives.&lt;/p&gt;\n&lt;p&gt;The post holder will provide psychiatric input to adults with learning disabilities resident within West Wiltshire. They will be based with another consultant psychiatrist of Wiltshire North at the Savernake Hospital, Marlborough.&lt;/p&gt;\n&lt;p&gt;This is a full time community-based post. However some flexibility of the timetable is possible to suit the work-life needs of suitable candidates, who may be looking for a particular job-plan.&lt;/p&gt;\n&lt;p&gt;The post holder will be a local champion for people with learning disabilities, and facilitate people developing skills in working with adults with learning disabilities.&lt;/p&gt;\n&lt;p&gt;They will help maximise the access of people with learning disabilities to the services and resources available from mainstream Mental Health and other Services through such devices as collaborative working.&lt;/p&gt;\n&lt;p&gt;The post already has strong links with local generic psychiatry networks. There is no expectation of joining an out of hours LD on-call rota. Please see the job description for further details.&lt;/p&gt;\n&lt;p&gt;This post is part of a directorate with nine other Learning Disability Consultant Psychiatrists. The LD consultant group has a reputation for being a close knit group who actively support each other and work constructively with their managers.&lt;/p&gt;\n&lt;p&gt;They intend to continue to deserve this reputation. They meet monthly to discuss management issues and twice a month for academic meetings with other staff.&lt;/p&gt;\n&lt;p&gt;We are committed to your development, making the very best of your talent and helping you to achieve your career aspirations. Some flexibility of the timetable is possible to suit the work-life needs of suitable candidates, who may be looking for a particular job-plan.&lt;/p&gt;\n&lt;p&gt;The service will support the development of special interests especially if provided across areas. We offer one of the most competitive and flexible benefits packages, including a relocation package of up to £8,000.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Manash Chattopadhyay, Medical Lead&lt;br /&gt;0117 9585666&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Malborough", "postalCode": "SN8 3HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4154", "longitude": "-1.70489"}}, "title": "Consultant Psychiatrist - Learning Disabilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916060091", "validThrough": "2020-11-11T23:59:59+0000"}