{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-07-01T10:31:23+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Consultant Neurophysiologist to join the Medical Neurosciences directorate. The post-holder will provide neurophysiology services for the regional neurosciences centre based at the Royal Preston Hospital. You will join a team of 3 existing consultant neurophysiologists, 10 consultant neurologists, and 2 consultants in neurorehabilitation. The Medical Neurosciences directorate works closely with the other clinical neurosciences disciplines, including Neurosurgery, Paediatric neurology and Neuropathology.&lt;/p&gt;\n&lt;p&gt;Lancashire Teaching Hospitals NHS Foundation Trust forms one of the major acute Trusts in the North West with a complement of over 1100 beds for a local population of 390,000 and a regional population of 1.6 million. We have all of the usual specialties on site as well as being a Tertiary Centre for Lancashire and South Cumbria in Neurosciences, Oncology, Plastic Surgery and Renal Medicine. There is extensive undergraduate medical student teaching, and the Trust has active research links with local universities, including Manchester, Lancaster and Central Lancashire.&lt;/p&gt;\n&lt;p&gt;Lancashire is an attractive area to live and has many facilities available locally. The cities of Manchester and Liverpool are within easy reach. Recreational facilities are many and varied, with the Lake District, Ribble Valley, Yorkshire Dales and Fylde Coast nearby.&lt;/p&gt;\n&lt;p&gt;Any person who is unable to work full-time for personal reasons will be eligible to be considered for the post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would be happy to answer any queries you may have regarding this post and any enquiries should be made to Prof. Suresh Chhetri, Clinical Director, on (01772) 523643, and/or Dr Godwin Lekwuwa, Dr Caroline Ross &amp; Dr Nicholas Combes Consultant Clinical Neurophysiologists at Royal Preston Hospital on (01772) 522559&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Informal enquiries and requests to visit the Hospitals are welcome and should be made, following shortlisting, with Dr. Geraldine Skailes, Medical Director and Karen Partington, Chief Executive (01772) 522692.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Consultant in Neurophysiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916097072", "validThrough": "2020-11-18T23:59:59+0000"}