{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22895", "minValue": "20911", "unitText": "YEAR", "value": "£12.44 - £13.62 p/h (DOE)plus enhancements"}}, "datePosted": "2020-06-15T15:45:55+0100", "description": "&lt;p&gt;Registered Nurse&lt;br /&gt;St Johns Hospice&lt;br /&gt;£12.44 - £13.62 per hour plus excellent enhancements and employee benefits&lt;br /&gt;37.5 hours per week - Days and nights available however permanent nights considered&lt;/p&gt;\n&lt;p&gt;St Johns Hospice offers Registered Nurses the opportunity to be part of exciting developments in Palliative and End of Life nursing care in our Inpatient Unit at St Johns.&lt;/p&gt;\n&lt;p&gt;The strategy for our busy 15 bed Inpatient Unit is a move towards admitting more complex patients with malignant and non malignant disease requiring specialist palliative care for pain, symptom control and End of Life Care.&lt;/p&gt;\n&lt;p&gt;This post is on the IPU led by a Ward Sister and will contribute to the clinical leadership and development of Registered Nurses and Nursing Assistants on the Inpatient Unit.&lt;/p&gt;\n&lt;p&gt;About Us:&lt;/p&gt;\n&lt;p&gt;Sue Ryder supports people through the most difficult times of their lives. Whether that’s a terminal illness, the loss of a loved one or a neurological condition – we’re there when it matters. Our doctors, nurses and carers give people the compassion and expert care they need to help them live the best life they possibly can.&lt;/p&gt;\n&lt;p&gt;St John’s is a Sue Ryder hospice, based in the village of Moggerhanger in Bedfordshire. We’re here for people aged 18 and over who are living with conditions like cancer, heart failure and lung disease. We offer a range of support to communities across Bedfordshire and Cambridgeshire, from inpatient care in our 15 bed hospice to day services which help people stay at home longer and offer respite to carers. The location is serviced by the number 73 bus, however due to shifts patterns; it is recommended you have your own transport to get to and from work.&lt;/p&gt;\n&lt;p&gt;Your Benefits:&lt;br /&gt;- Continuation of NHS pension&lt;br /&gt;- Private pension scheme matched at 5%&lt;br /&gt;- Enhanced maternity and paternity benefits&lt;br /&gt;- Referral scheme of up to £500&lt;br /&gt;- Carer’s leave policy&lt;br /&gt;- 24 hour employee assistance line for free advice on work, family and personal life&lt;br /&gt;- PeoplePerks - discounts with hundreds of retailers and services&lt;br /&gt;- Staff discounts of 15% at the Sue Ryder online shop&lt;br /&gt;- Childcare vouchers and cycle to work scheme&lt;br /&gt;- Free parking, tea and coffee and subsidised meals&lt;br /&gt;- Development opportunities for all through our structured development framework&lt;br /&gt;- 25 days’ holiday pro rata (rising to 30 with service) plus Bank Holidays&lt;/p&gt;\n&lt;p&gt;About You:&lt;/p&gt;\n&lt;p&gt;To join our team, you’ll need:&lt;/p&gt;\n&lt;p&gt;- To be an NMC registered nurse, ideally with post-registration experience in palliative end of life care&lt;br /&gt;- A compassionate and people-centred approach&lt;br /&gt;- Excellent communication skills&lt;/p&gt;\n&lt;p&gt;Sue Ryder are equal opportunities employers, value diversity and are strongly committed to providing equal employment opportunities for all employees and all applicants for employment. Equal opportunities are the only acceptable way to conduct business and we believe that the more inclusive our environments are, the better our work will be.&lt;/p&gt;\n&lt;p&gt;It takes a special sort of person to join our team so if you could see yourself as one of our Registered Nurses, please apply via the button shown.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moggerhanger", "postalCode": "MK44 3RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1281", "longitude": "-.335766"}}, "title": "Staff Nurse - Inpatient Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916079670", "validThrough": "2020-11-30T23:59:59+0000"}