{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-05-06T13:12:27+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;PROGRESS CHASER – EMERGENCY DEPARTMENT, ALEXANDRA HOSPITAL&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for a highly motivated and enthusiastic individual to support the team in delivering outstanding patient care and maintaining departmental targets, including the 4 hour standard and ambulance handover. This is achieved through ensuring effective patient flow and exceptional organisation throughout the department.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;On occasions this will be a busy and challenging job role and will involve multiple problem solving issues on a minute by minute basis. The successful candidate must be organised, forward thinking and able to communicate effectively with all levels of staff. In return, you will receive great job satisfaction and will be supported by the whole leadership team to achieve the ED patient care and service objectives.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The successful applicant will be responsible for assisting the Nurse in Charge of the Emergency Department in facilitating patient flow, liaising with speciality teams, transport services and assisting in patient care when necessary. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We would love to hear from you if:&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You are someone who enjoys working as part of a team and thrives in a high paced environment, and you like keeping systems and people in order!&lt;/li&gt;\n&lt;li&gt;You enjoy, and are confident meeting and talking to people, understanding the value of good relationships based on respect and openness.&lt;/li&gt;\n&lt;li&gt;The capability of technology excites you and you embrace digital solutions with an eagerness to learn and maximise the potential these solutions can bring.&lt;/li&gt;\n&lt;li&gt;To you, job satisfaction may be a development opportunity, to progress into management and you may want us to provide learning opportunities, or it may equally be doing a great job, going home and switching off.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;For further information or to arrange an informal visit please contact Senior Sister Jenny Wood on 01527 503030 extension 44200 or Matron Marc Tarrant via switchboard.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Alexandra Hospital, Redditch", "postalCode": "B98 7UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2798", "longitude": "-1.91212"}}, "title": "Progress Chaser", "url": "https://www.jobs.nhs.uk/xi/vacancy/916043535", "validThrough": "2020-11-18T23:59:59+0000"}