{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29967", "minValue": "21941", "unitText": "YEAR", "value": "£21,941 - £29,967"}}, "datePosted": "2020-06-12T10:32:54+0100", "description": "&lt;p&gt;Are you interested in a career in Guernsey within the Adult Disability Team providing support to our service users?&lt;/p&gt;\n&lt;p&gt;The Adult Disability Service in Guernsey support people with learning disabilities and autism in a variety of settings. These include residential homes, supported living, outreach and day services. We also have a brand new autism hub opening in the coming months. As a support worker, depending on your skills and knowledge, you may be based in any one of these teams.&lt;/p&gt;\n&lt;p&gt;Your day will involve around helping people live an ordinary life in their community, supporting personal care, promoting independent living skills and providing emotional support using an active support model.  You will be expected to work closely not only with our service users but their family and friends, other professionals with whom they may come into contact with and be a part.&lt;/p&gt;\n&lt;p&gt;No initial qualifications are needed to apply for this role. You will, however, be expected to undertake either the NVQ Level 3 or BTEC in Positive Behavioural Support upon you completing a satisfactory probation period.  Support will be provided to you during this.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135462.PNG", "name": "States of Guernsey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guernsey", "postalCode": "GY1 1FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "49.4561", "longitude": "-2.5408"}}, "title": "Adult Disability Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916077121", "validThrough": "2021-06-01T23:59:59+0100"}