{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-06-23T10:05:38+0100", "description": "&lt;p&gt;Applications are invited from Registered Adult Nurses to work within our neurological rehabilitation services.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for those with an interest in the rehabilitation of individuals following traumatic brain injury or neurological events/illness to gain experience and develop skills within a Specialist Regional Neurological Rehabilitation centre.&lt;/p&gt;\n&lt;p&gt;Walkergate Park is a new purpose built building which hosts the most comprehensive range of neurological rehabilitation services in the UK. It acts as a focus for education and training in disability issues for health care and social services, allied health professionals, individuals with disability following brain injury, carers and relatives.&lt;/p&gt;\n&lt;p&gt;We are currently transforming our services to meet the needs of our patient group and are developing more flexibility in our services which will equally provide more opportunity for staff development. Posts will be based in one area to achieve line management but will be supported to work into other areas as required. This includes rotation across neuro-rehabilitation, neurobehavioral and neuropsychiatry services to advice and support in the physical, mental and emotional health care that our patients require.&lt;/p&gt;\n&lt;p&gt;We are further developing our link and champion nurses for areas such as carers support, IPC, physical health, social and leisure activities to name just a few. We use a primary nursing model with nurses taking on the role of primary nurse for up to three patients whilst acting as associate nurse in a team caring for a maximum of nine.&lt;/p&gt;\n&lt;p&gt;We offer an induction package, clinical supervision, individualised support (based on a self-assessment tool) around the specialist skills required to meet the needs of our patients and this is provided by all members of the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Essential requirements of the post are;&lt;/p&gt;\n&lt;p&gt;First level Registered General nurse (adult nursing).&lt;/p&gt;\n&lt;p&gt;You will have problem solving ability and change management skills with the ability to fulfil the function of primary/co-primary nurse working in a 24 hour system of care. A professional manner, appearance and the ability to work as part of a team are vital.&lt;/p&gt;\n&lt;p&gt;You must also have knowledge and commitment to evidence based practice, clinical governance and a clear understanding of the safeguard and protection systems in place for vulnerable service users.&lt;/p&gt;\n&lt;p&gt;Informal enquiries/visits are welcomed. Please contact Sharon Gibson or Pamela McIntyre, Clinical Nurse Managers, Walkergate Park, Benfield Road, Newcastle upon Tyne, NE6 4QD. On tel no: 0191 2875028 or 07979 348098.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walkergate Park", "postalCode": "NE6 4QD"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.987", "longitude": "-1.5602"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916087639", "validThrough": "2020-12-31T23:59:59+0000"}