{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "30000", "unitText": "YEAR", "value": "30,000"}}, "datePosted": "2020-06-24T15:22:33+0100", "description": "&lt;p&gt;&lt;em&gt;&lt;strong&gt;Registered General Nurse&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Field-Based across Wanstead travelling throughout the region and borders&lt;br /&gt;Permanent&lt;br /&gt;37.5 hours per week working 5 shifts between the hours of 6am – 10pm&lt;br /&gt;Salary circa £30,0000&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;What kind of nurse do you really want to be? A relationship builder. A quality carer. A healthcare pioneer. A valued specialist with continuous opportunities for training and professional growth. Join LloydsPharmacy Clinical Homecare as a &lt;em&gt;Registered General Nurse &lt;/em&gt;and you can be all these things and more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Part of McKesson, a leading healthcare company, we work in close partnership with the NHS and pharmaceutical companies to provide a huge range of nursing services to more than 80,000 patients in the comfort of their own home, at their place of work or in the community. You will be working at the forefront of these services, visiting patients in a community setting to deliver medical treatments such as IV infusions, TPN treatments and both intramuscular and sub cut injections while also training patients to administer their own medication.&lt;/p&gt;\n&lt;p&gt;The focus is on clinical excellence, so we’ll give you all the support and flexibility you need to spend quality time with your patients and provide them with the best kind of 1-2-1 care. We’ll also make sure you remain at the cutting edge of your profession, gaining exposure to new technologies and therapies, and helping to develop care models that break the mould. Although you will be working independently in the community, you will remain very much part of a wider nursing team, enjoying regular contact with managers and colleagues.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You have to be well-organised to succeed in this role, as you will be responsible for managing your own workload and itinerary as well as for providing patients with the kind of day-to-day care that will help them achieve their goals and regain their independence. You’ll be travelling between patients throughout the day, so a full UK driving licence is essential. Other must-haves include a valid NMC PIN and at least 12 months’ post-registration experience, ideally within an acute setting, along with basic IT skills and a commitment to continuous professional development.&lt;/p&gt;\n&lt;p&gt;In return, we offer a highly competitive salary and benefits package, including a fully expensed company car, personal pension plan and a flexible schedule that does not involve any night work.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wanstead", "postalCode": "E11"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.569", "longitude": ".018096"}}, "title": "Clinical Homecare Nurse - Wanstead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916090137", "validThrough": "2020-12-31T23:59:59+0000"}