{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-04-23T13:57:13+0100", "description": "&lt;p&gt;&lt;strong&gt;East Hull Integrated Community Team for Older People, based at Townend Court, Hull, 10 PAs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit Consultants in Old Age Psychiatry.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addictions services for approximately 725,000 people living in Hull, the East Riding of Yorkshire and North Yorkshire. The trust also provides specialist services to children, forensic services to patients from the wider Yorkshire and Humber area, Whitby and Malton Hospitals and General Practice in Hull, Cottingham, Market Weighton and Bridlington. As a Teaching Trust, we work closely with our major academic partners, Hull York Medical School and Hull University, nurturing a workforce of tomorrow&#39;s doctors, nurses and other health professionals.&lt;/p&gt;\n&lt;p&gt;The Old Age Psychiatry services continue to develop and are progressive in their outlook. The service has recently upgraded the inpatient facilities for patients with dementia. There is a requirement that the successful candidate will also undertake on call responsibilities on the specialist Consultant on-call rota for Old Age Psychiatry and Learning Disability. Applicants should have full registration with the GMC, possess the MRCPsych UK or have an equivalent post-graduate qualification. They should be on the Specialist Register for Old Age Psychiatry, or be within 6 months of achieving CCT in Old Age Psychiatry. The ability to commute within the Trust’s geographical area, with access to an appropriate means of transport, is essential.&lt;/p&gt;\n&lt;p&gt;For informal enquires or to arrange a visit, please contact Dr Joanne Watkins, Consultant Psychiatrist on telephone number 01405 608289. &lt;strong&gt;&lt;em&gt;Please do not ring this number for application packages.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The ability to commute within the Trusts geographical area with access to the appropriate means of transport is essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will also be asked to prove your Right to Work in the UK and complete identification checks.&lt;/p&gt;\n&lt;p&gt;Please note, you will be charged for a Disclosure &amp; Barring check if appropriate to the role.&lt;/p&gt;\n&lt;p&gt;“Humber Teaching NHS Foundation Trust is positive about receiving applications from people with personal experience of mental illness and has mechanisms in place to support and guide potential job applicants”. Please see ‘Positive Assets’ link below for more information. Humber Teaching NHS Foundation Trust are committed to equal opportunities and welcome applications from all sections of the community, the Trust seeks to establish a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust operates a strict process regarding the advertising of vacancies, details of which may only be reproduced with the written permission of the person authorised by the Trust to place the advert. Any orders obtained via unsolicited routes (including individuals not so authorised) will not be paid and the circumstances will be reported to the Trust’s Local Counter Fraud Specialist.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull", "postalCode": "HU6 8QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7708", "longitude": "-.377052"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916033756", "validThrough": "2020-11-30T23:59:59+0000"}