{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36876", "minValue": "32029", "unitText": "YEAR", "value": "£32,029 - £36,876"}}, "datePosted": "2020-07-02T15:36:16+0100", "description": "&lt;p&gt;&lt;strong&gt;We’re changing, and we’re growing! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Oxfordshire County Council is committed to children’s social care so we’re transforming the way we help our frontline social workers support children and families.&lt;/p&gt;\n&lt;p&gt;At a time when many local authorities are seeing financial cuts, Oxfordshire is seeing significant investments of over £4 million into children’s social care, specifically for frontline services and the implementation of a new Family Safeguarding Plus Model (FSP). Our priority is to reduce caseloads and paperwork to allow staff to spend more time with children and families who are at the heart of everything we do.&lt;/p&gt;\n&lt;p&gt;The new structure involves placing mental health, substance misuse and domestic abuse workers in teams with children’s social workers to work with parents and support children to remain with their families. Our aim is that by introducing FSP, it will reduce caseloads and enable our teams to have a better balance of time between record keeping and working directly with families. The new teams will carry out all of the assessment and intervention previously done in two separate teams. By doing this we aim to reduce the number of times families deal with different social workers. This helps to promote stability and gives both parties a chance to develop stronger working relationships.&lt;/p&gt;\n&lt;p&gt;The success of the model is based on Social Workers having reasonable caseloads that enable them to provide rapid and intensive help. At the heart of implementing this new model is our desire to support the critical work that social workers do and minimise the bureaucracy associated with the job. &lt;/p&gt;\n&lt;p&gt;We are introducing the FSP model at the end of September 2020, and to enable us to do this, we are creating a number of new positions within our teams. Our Social Worker roles in the new teams will be a bit different - we are developing smaller teams where the team manager will know all the cases and have the time and space needed to support reflective practice. They will also be able to access help for the most common difficulties experienced by families rapidly using in-house resources. We’re also providing significant training and professional development to help Social Workers, managers and others develop good quality restorative relationships with the families they work with.&lt;/p&gt;\n&lt;p&gt;If you are excited by new approaches to delivering support to families and children, and are an experienced, motivated Social Worker interested in joining us on our journey, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you’d like to find out more, or submit your CV, please contact us by email - workforus@Oxfordshire.gov.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxfordshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129518"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxfordshire", "postalCode": "OX17 3HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0096", "longitude": "-1.32286"}}, "title": "Social Worker - Children&#39;s Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916099605", "validThrough": "2020-12-31T23:59:59+0000"}