{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29629", "minValue": "27784", "unitText": "YEAR", "value": "£27,784 - £29,629"}}, "datePosted": "2020-07-01T14:57:05+0100", "description": "&lt;p&gt;While you care for others, at Priory’s Cheadle Royal Hospital we’ll care for you and your career.&lt;/p&gt;\n&lt;p&gt;We’re currently looking for CAMHS Nurses to add to our friendly family - we are one of the Priory Groups largest hospitals and we pride ourselves on having the best teams.&lt;/p&gt;\n&lt;p&gt; Priory Hospital Cheadle Royal has 14 different wards and cares for 151 patients.  Each ward has a dedicated Multi-Disciplinary Team which includes a Consultant Psychiatrist, Speciality Doctor, Ward Manager, Psychologist, Occupational Therapist and support services including RMN and experienced Healthcare Assistants.  Our primary aim is to support and care for our patients providing a full clinical pathway for patients onsite.&lt;/p&gt;\n&lt;p&gt;As a nurse working on our CAMHS wards, you will work alongside the experienced multidisciplinary team in aspiring to provide excellent bespoke care to enable our patients to fulfil their recovery goals and work towards discharge to the life they want. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ethos of the units is to provide support in times of crisis and to offer therapeutic engagement during the inpatient stay working alongside appropriate risk management plans.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You would also be expected to:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Act as a key worker&lt;br /&gt;Observe/respond to patient behaviours on the ward which may include self harm and acts of aggression&lt;br /&gt;Formulate risk assessments and care plans to meet individual needs&lt;br /&gt;Medication management&lt;br /&gt;Act as shift co-ordinator, allocating staff and having the ability to oversee the work of junior staff and colleagues&lt;br /&gt;Maintain the safety of patients and staff&lt;br /&gt;Ensure good quality of patient documentation which meets regulatory guidance and statutory requirements&lt;br /&gt;Work within the NMC Code of Conduct and practice guidelines&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working hours are 37.5 hours per week, which conventionally works as 3 long shifts every 3 weeks and 4 long shifts in the 4th week.  &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What we are looking for in you…&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We pride ourselves on being an inclusive employer and embrace a diverse workforce.  We employ people from all walks of life because they embrace our hospitals values;&lt;/p&gt;\n&lt;p&gt;Putting people first                  We put the needs of our service users above all else.&lt;/p&gt;\n&lt;p&gt;Being supportive                      We support our employees, our service users and their families when they need us most.&lt;/p&gt;\n&lt;p&gt;Acting with integrity                 We are honest, transparent and decent. We treat each other with respect.&lt;/p&gt;\n&lt;p&gt;Being positive                          We see the best in our service users and each other and we strive to get things done. We never give up and we learn from our mistakes.&lt;/p&gt;\n&lt;p&gt;Striving for excellence             For over 140 years, we have been trusted by our service users with their care. We take this trust seriously and constantly strive to improve the services we provide.&lt;/p&gt;\n&lt;p&gt;In addition to this, you would also need to be RMN qualified with an active NMC registration with good knowledge of the Mental Health/Capacity Act and its implications for practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have a commitment to delivering high quality care and a desire to work within a CAMHS setting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A career with Priory Cheadle Royal not only enables you to manage your own career pathway whilst paying a competitive salary, we also have a range of other benefits such as&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;25 days annual leave (plus 8 Bank holidays) increasing with length of service&lt;br /&gt;Birthday leave&lt;br /&gt;Free on site parking&lt;br /&gt;Subsidised meals&lt;br /&gt;Contributory pension scheme&lt;br /&gt;Priory Perks discount portal&lt;br /&gt;Long Service recognition&lt;br /&gt;Dedicated career pathway&lt;br /&gt;NMC Registration fees paid&lt;br /&gt;Enhanced sick pay and maternity pay after 1 years service&lt;br /&gt;Wellbeing committee&lt;br /&gt;Comprehensive Induction&lt;br /&gt;CPD courses and support&lt;br /&gt;Leadership and Management opportunities&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CHEADLE", "postalCode": "SK8 3DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.375", "longitude": "-2.22149"}}, "title": "RMN - CAMHS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916097821", "validThrough": "2020-11-27T23:59:59+0000"}