{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28030", "minValue": "23912", "unitText": "YEAR", "value": "£23,912 - £28030 see main advert"}}, "datePosted": "2020-04-03T08:20:40+0100", "description": "&lt;p&gt;&lt;strong&gt;£23,912 - £29,225 (pro rata) per annum plus enhancements. Dependant on experience and qualifications.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We provide high quality, responsive palliative care and bereavement support across Hastings and Rother and work collaboratively with others to improve end of life care for all.&lt;/p&gt;\n&lt;p&gt;Applications are welcomed from Registered Nurses and newly qualified Nurses. Our patients are at the centre of everything we do and, working within our clinical team, you will have time to care whilst supporting patients and their families in living life to the full.&lt;/p&gt;\n&lt;p&gt;You will enjoy working in a challenging yet rewarding environment and have an interest in working in a palliative care setting. You will be compassionate, with a focus in holistic care and a passion for improving quality of life for those with a life-limiting illness.&lt;/p&gt;\n&lt;p&gt;As a valued member of the In-Patient Unit, you will be working within a nursing and multi-professional team to ensure a high standard of care to patients. You will actively participate in assessment of individuals’ palliative care needs and in the development, implementation and evaluation of programmes of care. You will practice holistic nursing care without direct supervision, as well as participating in the supervision and mentorship of qualified staff, student nurses, volunteers and unqualified staff.&lt;/p&gt;\n&lt;p&gt;At St Michael’s Hospice we offer a friendly, team-orientated work environment, a good pension scheme (with the option to continue any existing NHS pension scheme membership), a wellbeing and resilience programme, discounted gym membership, 27 days annual leave (plus bank holidays), subsidised employee meals, supportive supervision and a proactive Education Department to support your development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St Michael’s Hospice reserves the right to close the application early.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Social Enterprises", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130655"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Leonard&#39;s on sea", "postalCode": "TN38 0LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8548", "longitude": ".552205"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916021631", "validThrough": "2020-12-31T23:59:59+0000"}