{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44121", "minValue": "17648", "unitText": "YEAR", "value": "Up to £17,648 (£44,121FTE) DoE"}}, "datePosted": "2020-06-30T16:01:19+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Highly Specialist Speech &amp; Language Therapist (Band 7)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Up to £17,648 (£44,121FTE) DoE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Part time - 16 hours a week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Pindar House Upper Sheffield Road, Barnsley, South Yorkshire, S70 4PL&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Choose a new a role that has the opportunities you need to grow.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Cygnet Health Care you’ll be exposed to the realities of healthcare delivery at the highest level, ensuring you continue to learn and build new skills as you develop. Our reputation for quality and innovation makes us an excellent choice at this key time, and means you’ll be able to build your experience whilst making a real difference to service user outcomes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Advance your career with us in the ideal atmosphere to help you grow&lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cygnet Pindar Houseis a new 22 bed Neuropsychiatric care and treatment facility for men affected by acquired brain injuries. It is a safe and secure place to aid recovery as well as offering those diagnosed with a progressive neurological disease, like Huntington’s Disease, a caring and long term placement to support and help manage the progression of their symptoms. This service will be able to accept unplanned, often urgent admissions where a service user requires a safe place to start treatment at the earliest possible time.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Highly Specialist SLT to work 16 hours per week with a specialist caseload to provide quality assessment and interventions and be skilled in both SCLN and dysphagia. You will demonstrate an interest in upskilling the workforce as well as planning and implementing programmes of care and treatment and providing specialist advice to the MDT. Being a new unit, you will be expected to embed to the SLT pathway for neuropsychiatric services and directly report progress through monthly supervision to the Clinical Lead SLT and the unit manager. You will also be accountable for the supervision of a Band 5 SLT who works 40 hours per week in the service. You will be part of a companywide SLT service and contribute to the service development initiatives.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We&#39;re looking for people who have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A degree / postgraduate diploma (or equivalent) in Speech and Language Therapy, registration with HCPC (Health Care Professions Council) and membership of the RCSLT (Royal College of Speech and Language Therapists).&lt;/li&gt;\n&lt;li&gt;Experience of developing other SLTs.&lt;/li&gt;\n&lt;li&gt;Experience of managing complex neurological and degenerative conditions.&lt;/li&gt;\n&lt;li&gt;Qualification in Dysphagia management.&lt;/li&gt;\n&lt;li&gt;A desire to support a new service set up.&lt;/li&gt;\n&lt;li&gt;Impeccable communication and time management skills.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we’ll offer you&lt;/strong&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent Clinical Supervision, Peer Support, CPD and developmental opportunities&lt;/li&gt;\n&lt;li&gt;25 days annual leave plus bank holidays (pro rata).&lt;/li&gt;\n&lt;li&gt;16 Staff Benefits including NHS Discounts, Free Health Cash Plan, Life Insurance, Pension, Gym membership, 24/7 GP, free meals and onsite parking, long service awards, mortgage advice, referral bonuses.&lt;/li&gt;\n&lt;li&gt;Full induction training is given&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate will be required to undergo an enhanced DBS and&lt;/strong&gt; &lt;strong&gt;reference check and an offer of employment will be subject to successful clearance.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note vacancy may close prior to this date if a large number of applications are received.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Upper Sheffield Road, Barnsley, South Yorkshire", "postalCode": "S70 4PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5434", "longitude": "-1.47193"}}, "title": "Highly Specialist Speech &amp; Language Therapist (Band 7)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916096430", "validThrough": "2020-11-27T23:59:59+0000"}