{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48053", "minValue": "42285", "unitText": "YEAR", "value": "£42,285 - £48,053"}}, "datePosted": "2020-06-09T06:12:12+0100", "description": "&lt;p&gt;We have an opportunity for a Colorectal Oncology CNS to join our Cancer Services Team based at The London Clinic’s Cancer Centre in Central London, W1G (Close to Regents Park &amp; Baker Street tube stations).&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest independently owned non-profit hospital, with state-of-the-art facilities located on Harley Street. We have circa 1200 employees, a total of 8 premises, and we are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise.&lt;/p&gt;\n&lt;p&gt;Our main hospital spans 8 floors comprising of 234 beds and 10 theatres, including a Hybrid theatre and two minimally invasive and day surgery theatres. The Duchess of Devonshire Wing is our award-winning cancer centre, which includes state-of-the-art radiotherapy, chemotherapy suites and dedicated patient bedrooms&lt;/p&gt;\n&lt;p&gt;Job Description&lt;/p&gt;\n&lt;p&gt;The post holder will support the Colorectal Oncology Consultants at The London Clinic in providing specialist clinical management for oncology patients. They will provide support and advice to patients/carers/relatives and the multidisciplinary team. As a core member of the clinical team, they will be responsible for the provision, quality and development of the colorectal oncology service with The London Clinic with a focus on the Oncology pathway.&lt;/p&gt;\n&lt;p&gt;Job Type&lt;/p&gt;\n&lt;p&gt;This is a full time, permanent position working 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;Salary&lt;/p&gt;\n&lt;p&gt;The attractive salary for this role is £42,285 - £48,053 per annum (inclusive of London Weighting &amp; COLA) and will be dependent upon skills and experience.&lt;/p&gt;\n&lt;p&gt;Benefits package&lt;/p&gt;\n&lt;p&gt;We offer our permanent staff a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 25 day’s annual leave plus bank holidays, season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/p&gt;\n&lt;p&gt;Duties &amp; Responsibilities&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To develop the skills to undertake advanced patient assessment, advising on immediate care or referral for medical interventions, ensuring the prompt and effective management of patients.&lt;/li&gt;\n&lt;li&gt;To provide patient and their relatives with information and support, and where necessary facilitate communication and decision making between them and the multidisciplinary team&lt;/li&gt;\n&lt;li&gt;To carry an ongoing caseload of patients, working with the multidisciplinary team to facilitate care and refers patients to specialist professionals, as necessary.&lt;/li&gt;\n&lt;li&gt;To assist the team to develop and implement integrated care pathways for Urology patients with the multidisciplinary team, especially within the Oncology pathway. To encourage the completion of the whole pathway at The London Clinic.&lt;/li&gt;\n&lt;li&gt;To ensure that patient are added to the MDT meeting for discussion.&lt;/li&gt;\n&lt;li&gt;To develop complex reasoning, critical thinking, reflection and analysis to inform health assessments, clinical judgements and to make decisions independently regarding the care and priorities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;This job description is intended as a general guide to the post, but it may change in line with the needs of the department or at the request of the line manager.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Skills &amp; Experience&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered General Nurse&lt;/li&gt;\n&lt;li&gt;Degree in nursing or working towards.&lt;/li&gt;\n&lt;li&gt;Post registration course within the Oncology specialism or working towards.&lt;/li&gt;\n&lt;li&gt;Recognised teaching qualification.&lt;/li&gt;\n&lt;li&gt;Level 2 Psychological Care Training&lt;/li&gt;\n&lt;li&gt;Considerable post registration experience in an acute hospital setting within an oncology setting.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;The successful applicant’s offer is subject to relevant DBS, Occupational Health and Reference Checks respectively, alongside standard Right To Work Checks.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/p&gt;\n&lt;p&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "Clinical Nurse Specialist - Colorectal Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916071980", "validThrough": "2020-11-29T23:59:59+0000"}