{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29960", "minValue": "29960", "unitText": "YEAR", "value": "Up to £29,960 (pro rota) DoE"}}, "datePosted": "2020-07-01T11:27:45+0100", "description": "&lt;p&gt;&lt;strong&gt;Fixed term-contract (Maternity Leave cover) – Start date ASAP contractavailable until April 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Here are fourreasons why you should apply for this amazing opportunity:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cygnet Harrow is a welcoming hospital with a convivial and supportive inter-disciplinary team.&lt;br /&gt;The Springs Services delivers a complete pathway from low-secure, to rehab and pre-discharge; this means the SLT service offer a seamless service and continuity of care.&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;This post provides input to the Springs Wing which focuses on supporting individuals to move along their care pathway to more independent living and therefore developing life skills.&lt;/li&gt;\n&lt;li&gt;The Springs Services support high functional individuals with a diagnosis of mental health needs and autism, providing a unique opportunity to advance clinical skills in a specialist area.&lt;/li&gt;\n&lt;li&gt;The solution-focused approach of the Harrow management team provides scope for opportunity genuine creativity in service-development.&lt;/li&gt;\n&lt;li&gt;With a 45-strong nationwide SLT network, Cygnet offers immediate peer support from SLTs working across a range of clinical specialisms.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Cygnet Harrow, London Road, Harrow on the Hill, Middlesex, HA1 3JL&lt;/p&gt;\n&lt;p&gt;At Cygnet Hospital Harrow, we provide a recovery-focused service, treating a wide range of mental health problems. We also offer specialist diagnostic, assessment and inpatient services for individuals with mental health needs and a diagnosis of autism spectrum disorder. The service aims to help people stabilise with appropriate support and return to the community or the least restrictive environment as quickly as possible.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;The Opportunity…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful applicant will work with staff across the hospital to support the implementation of a therapeutic approach, demonstrating a range of skills, knowledge and abilities relating to autism spectrum disorders.&lt;/p&gt;\n&lt;p&gt;As a Speech and Language Therapist (SLT), your role will be integral to ensuring individualsmaximise their potential and enable them to enjoy the best possible quality of life through the delivery of an evidence-based SLT service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assess communication needs, implementing and developing specialist SLT programmes according to individuals’ diagnoses and identified needs.&lt;/li&gt;\n&lt;li&gt;Promote effective functional communication and social skills development by working directly with the individuals and by modelling and delivering training to staff.&lt;/li&gt;\n&lt;li&gt;Collaborate with the interdisciplinary team comprised of Occupational Therapy, Psychology and Psychiatry to deliver fully integrated interventions through joint goal-setting.&lt;/li&gt;\n&lt;li&gt;Set SMART targets and use appropriate outcome measures to evaluate the effectiveness of interventions.&lt;/li&gt;\n&lt;li&gt;Optimise the application ofa total communication approach through the development of the environment.&lt;/li&gt;\n&lt;li&gt;Take a lead in service development for SLT at Harrow, including the development of bespoke training for the Springs Services&lt;/li&gt;\n&lt;li&gt;The successful applicant will work within the Springs Wing unit and be accountable for clinical supervision and mentoring of an on-site Band 5 Speech and Language Therapist working in the Springs Unit (low secure ward) and Springs Centre (rehabilitation ward).&lt;/li&gt;\n&lt;li&gt;The Cygnet SLT service is well establish, with 45 SLTs working nationwide and as such, you will have access to an immediate peer network to support on-going CPD. There are frequent opportunities to work on service development within the SLT service; this year is focusing on marking the 75th Anniversary of RCSLT.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Expert Clinical Supervision and peer support&lt;/li&gt;\n&lt;li&gt;Regular meetings and networking with Cygnet Speech and Language Therapists&lt;/li&gt;\n&lt;li&gt;Developmental and Leadership Opportunities&lt;/li&gt;\n&lt;li&gt;Paid leave for your birthday and anniversary of joining the company&lt;/li&gt;\n&lt;li&gt;Subsidised meals and free parking&lt;/li&gt;\n&lt;li&gt;Company pension scheme and a comprehensive employee assistance programme and discount centre.&lt;/li&gt;\n&lt;li&gt;Full induction training is given and you will receive clinical supervision through the Head of SLT who will be your direct line of report along with the Hospital Manager.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Candidate Profile&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are looking for an experienced Speech and Language Therapist with:&lt;/li&gt;\n&lt;li&gt;Experience in the field of Autism Spectrum Disorders and Mental Health Conditions.&lt;/li&gt;\n&lt;li&gt;Understanding of Positive Behaviour Support with an emphasis on person-centred planning.&lt;/li&gt;\n&lt;li&gt;Knowledge of key national drivers for inpatient services such as Transforming Care, Five RCSLT Good Communication Standards.&lt;/li&gt;\n&lt;li&gt;Qualification in Dysphagia management desirable&lt;/li&gt;\n&lt;li&gt;Evidence of being a strong team player with a genuine desire to help others&lt;/li&gt;\n&lt;li&gt;Good organisational and project management skills&lt;/li&gt;\n&lt;li&gt;Ability to work flexibly in a fast paced and dynamic environment.&lt;/li&gt;\n&lt;li&gt;Enthusiasm, motivation and passion&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You must be a Health &amp; Care Professions Council (HCPC) registered SLT. Please note: successful candidates will be required to undergo an enhanced DBS check.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you ready for a new and rewarding opportunity? Please apply now. If you wish to speak with someone regarding this vacancy please call Dominique St Clair Miller (Deputy Head of SLT) on 07885 476 384 or Carla Bartlett (Director of SLT) on 07803 248 026.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews: Date to be determined upon sufficient number of applications&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London Rd, Harrow on the Hill, Harrow", "postalCode": "HA1 3JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5671", "longitude": "-.337962"}}, "title": "Band 7 Highly Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916097234", "validThrough": "2020-11-27T23:59:59+0000"}