{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-06-26T15:09:51+0100", "description": "&lt;p&gt;&lt;strong&gt;University College London Hospital are seeking Band 5 Registered Occupational Health Nurses or those with Occupational Health experience to join the UCLH Staff Bank.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a Registered Nurse with experience working in an occupational Health?  Why not join one of the largest and most successful Foundation Trusts in the UK with an international reputation and a tradition of innovation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Occupational Health &amp; Wellbeing Service  works to promote, maintain and improve the health of the employee, to safeguard employees’ health from risk arising from their work and working environment and to promote the health of the organisation.&lt;/p&gt;\n&lt;p&gt;The post holder’s key responsibilities will be;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The day to day running of the blood and vaccination clinics and undertaking vaccination related activities such as the management of blood test results, immunisation recalls, and ensuring adequate vaccine and clinical stock ordering supplies.&lt;/li&gt;\n&lt;li&gt;Participating in OH activities such as new starter clinics, management of occupational exposures to blood and body fluids and management of infection outbreaks.&lt;/li&gt;\n&lt;li&gt;Also assisting the occupational health advisors with other occupational health business as listed below;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;UCLH size and resources enables them to offer a range of attractive benefits as well as unparalleled education and development opportunities for staff at all levels. UCLH prides itself on its investment in staff both in terms of developing career skills but also its commitment to staff health and wellbeing.&lt;/p&gt;\n&lt;p&gt;Our Bank Nurses are invaluable to us and in return for their dedication and commitment, we offer the following benefits:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Access to “Lines of Work” (guaranteed short, medium or long term shifts)&lt;/li&gt;\n&lt;li&gt;Priority of shifts over an agency worker, accommodating your availability&lt;/li&gt;\n&lt;li&gt;An online self booking system that also allows you to submit timesheets electronically - “No more paper time sheets”&lt;/li&gt;\n&lt;li&gt;A dedicated recruitment team to ensure you can work as quickly as possible&lt;/li&gt;\n&lt;li&gt;A bookings team to ensure you work when and wherever you want to&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you have 6 months NHS experience in occupational health nursing and you are looking to further your career in a hospital that has cutting edge technology, please apply online today and ensure that you attach a CV.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank Band 5 Occupational Health Clinic Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916092861", "validThrough": "2021-02-24T23:59:59+0000"}