{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28462", "minValue": "24192", "unitText": "YEAR", "value": "£24,192.84- £28,462.00 plus allowances"}}, "datePosted": "2020-06-12T09:27:04+0100", "description": "&lt;p&gt;We have an exciting opportunity in ourSidcup dialysis clinic for a registered nurse who wants to make a difference in our patients’ lives. Sidcup is located in Kent, 20 minutes from central London by train. The Sidcup clinic is in a new purpose built kidney treatment centre that opened in April 2017 within Queen Mary’s Hospital and has good public transport links.&lt;/p&gt;\n&lt;p&gt;Diaverum are working in partnership with Guy’s and St Thomas’ NHS Foundation Trust to deliver dialysis services to NHS patients. You will work closely with the NHS multidisciplinary team and have the support of the Dialysis Matron and access to Guy’s and St Thomas’ training and development.&lt;/p&gt;\n&lt;p&gt;You will provide patient care according to Diaverum procedures and in order to increase the quality of life for our patients. A comprehensive professional training programme will be provided to you, including on-the-job training, e-learning and access to our in-house education programme ‘d Academy’.&lt;/p&gt;\n&lt;p&gt;RESPONISIBILITIES: &lt;br /&gt;• Take ownership of care programmes for renal patients including the initiation and termination of dialysis, whilst providing stable clinical care, emotional support and independence for patients&lt;br /&gt;• Working in partnership with the NHS team, follow the tailored care plans to administer medications, fluid therapy or other appropriate treatments as per Consultant instructions and ensuring clinical activity is appropriately documented in the patient medical record&lt;br /&gt;• Review pre and post haemodialysis care with patient&lt;br /&gt;• Discuss health concerns with patient; review any concerns with the multi-disciplinary team as necessary&lt;br /&gt;• Prepare and monitor dialysis machines and systems inline with Diaverum processes&lt;br /&gt;• Monitor dialysis water treatment system for use according to the established procedures&lt;br /&gt;• Act as a named staff nurse for a group of assigned patients ensuring ‘great care‘ is provided at all times &lt;br /&gt;• Proactively participate in quality and service improvement programmes&lt;/p&gt;\n&lt;p&gt;REQUIREMENTS: &lt;br /&gt;• NMC Registered General Nurse &lt;br /&gt;• Awareness and Understanding of NMC code of professional conduct&lt;br /&gt;• Be able to work autonomously and within a multi-disciplinary team&lt;br /&gt;• 1 year+ experience in general nursing / Applications from newly qualified Nurses are also welcomed&lt;br /&gt;(Haemodialysis would be an advantage but not essential) as full training is provided.&lt;br /&gt;• Have a positive and dynamic approach to providing safe and effective delivery of care&lt;br /&gt;• Excellent communication skills with fluency in English&lt;/p&gt;\n&lt;p&gt;COME GROW WITH US!&lt;br /&gt;• Full Time - 37.5 hours per week, Monday to Saturday, &lt;br /&gt;Shifts in Sidcup;&lt;br /&gt;Mon-Wed-Frid:&lt;br /&gt;Early: 6.30-15.00 &lt;br /&gt;Late: 14.30-23.00&lt;/p&gt;\n&lt;p&gt;Tues-Thus-Sat:&lt;br /&gt;Long day: 06.30-18.30&lt;/p&gt;\n&lt;p&gt;• We offer a Competitive Salary and please note that pay listed above includes Unsocial Payments* and a Location Allowance*&lt;br /&gt;• Relocation allowance * &lt;br /&gt;• Post subject to References, Identification, DBS and OH checks&lt;br /&gt;• 27 days annual leave (plus Bank Holidays) increasing with service&lt;br /&gt;• Life Assurance, Discounted Fitness Membership, Auto- Enrolment Company Pension &lt;br /&gt;* where applicable/dependent on clinic&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Diaverum UK Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sidcup", "postalCode": "DA14 6LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4186", "longitude": ".103279"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916076909", "validThrough": "2020-11-28T23:59:59+0000"}