{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48916", "minValue": "42492", "unitText": "YEAR", "value": "£42,492 - £48,916"}}, "datePosted": "2020-04-20T19:28:59+0100", "description": "&lt;p&gt;We have an opportunity for a Lead Apheresis Nurse to join our Cancer Services Team based at The London Clinic’s Cancer Centre in Central London, W1G (Close to Regents Park &amp; Baker Street tube stations).&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest independently owned non-profit hospital, with state-of-the-art facilities located on Harley Street. We have circa 1200 employees, a total of 8 premises, and we are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise.&lt;/p&gt;\n&lt;p&gt;Our main hospital spans 8 floors comprising of 234 beds and 10 theatres, including a Hybrid theatre and two minimally invasive and day surgery theatres. The Duchess of Devonshire Wing is our award-winning cancer centre, which includes state-of-the-art radiotherapy, chemotherapy suites and dedicated patient bedrooms&lt;/p&gt;\n&lt;p&gt;Job Description&lt;/p&gt;\n&lt;p&gt;The Lead Apheresis Nurse will work with relevant key stake holders in ensuring that the service provision is of quality and is in line with the set- standards by Clinic and the external regulatory bodies. They will ensure that the apheresis practice is based on current evidence, staff competencies and the mandatory training is up to date.&lt;/p&gt;\n&lt;p&gt;Job Type&lt;/p&gt;\n&lt;p&gt;This is a full time, permanent position working 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;Salary&lt;/p&gt;\n&lt;p&gt;The attractive salary for this role is £42,492 - £48,916 per annum (inclusive of London Weighting &amp; COLA) and will be dependent upon skills and experience.&lt;/p&gt;\n&lt;p&gt;Benefits package&lt;/p&gt;\n&lt;p&gt;We offer our permanent staff a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 25 day’s annual leave plus bank holidays, season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/p&gt;\n&lt;p&gt;Duties &amp; Responsibilities&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide specialist knowledge, expertise and care for patients and donors.&lt;/li&gt;\n&lt;li&gt;To provide specialist training within apheresis area as required.&lt;/li&gt;\n&lt;li&gt;To maintain the specialist apheresis service in accordance with service requirements, quality management, JACIE and Human Tissue Authority.&lt;/li&gt;\n&lt;li&gt;To ensure that the pre-collection donor/ patient medical assessment is complete prior to both autologous and allogenic stem cell collections.&lt;/li&gt;\n&lt;li&gt;To provide patient information for apheresis procedures and ensure that informed consent has been obtained.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;This job description is intended as a general guide to the post, but it may change in line with the needs of the department or at the request of the line manager.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Skills &amp; Experience&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Registered general nurse&lt;/li&gt;\n&lt;li&gt;5yrs post registration&lt;/li&gt;\n&lt;li&gt;Minimum of 3yrs experience in apheresis or area of relevance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;The successful applicant’s offer is subject to relevant DBS, Occupational Health and Reference Checks respectively, alongside standard Right To Work Checks.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/p&gt;\n&lt;p&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "Lead Apheresis Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916031327", "validThrough": "2020-11-29T23:59:59+0000"}