{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 pa"}}, "datePosted": "2020-06-02T11:28:05+0100", "description": "&lt;p&gt;Rotating Senior Clinical Fellow in Emergency Medicine&lt;/p&gt;\n&lt;p&gt;(Rotating to Anaesthetics, Critical Care, Acute Medicine)&lt;/p&gt;\n&lt;p&gt;Commencing from 2020 for a four year period, West Suffolk Foundation Trust has three rotational positions in Emergency Medicine to Anaesthetics, Critical Care and Acute Medicine.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This post is ideal for doctors who wish to obtain specific competencies to enable entry to formal training at ST3/4 level or by the &lt;strong&gt;CESR route, DREEM and Article 14&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;The West Suffolk Foundation Trust will provide middle grade position and experience in Emergency Medicine and junior positions in rotational specialties, each specialty component lasts 6 months.&lt;/li&gt;\n&lt;li&gt;Clinical supervision, competency assessment and education are part of the package; each doctor will have an Educational Supervisor.&lt;/li&gt;\n&lt;li&gt;The appointment is suitable for middle grade, clinical fellows and LAT doctors in Emergency Medicine.&lt;/li&gt;\n&lt;li&gt;Previous experience in Emergency Medicine is essential.&lt;/li&gt;\n&lt;li&gt;There is an intense and fully supported education and training program with generous provision for study leave with full funding.&lt;/li&gt;\n&lt;li&gt;The department is a 24/7 designated Trauma Unit dealing with the full spectrum from critical illness, the acutely ill, major trauma and care for the ambulatory stream for a population of 225,000.&lt;/li&gt;\n&lt;li&gt;The Emergency Department managed 79,953 patients in 2019.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There are Seven Consultants, one Associate Specialist, Two Specialty Registrar, nine rotating Clinical Fellows, one ACCS, two STGP2, four ST1GP, three F2 and two F1.&lt;/p&gt;\n&lt;p&gt;The Senior Clinical Fellow posts are 36 to 48 month fixed term contracts with room for flexibility.&lt;/p&gt;\n&lt;p&gt;Two of the Clinical Fellows have finished this rotation and successfully entered an ST4 position. Our Clinical Fellows have passed their MRCEM within two and a half years of starting this post.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to work in an award winning Trust and to build on an already high level of patient satisfaction, staff engagement and public confidence. A quarter of a million people are served by the West Suffolk NHS Foundation Trust. With over 3,000 staff and a vision to deliver the best quality and safest care for our community, the Trust offers a full range of district hospital services together with specialist cancer and surgical services in conjunction with the neighbouring teaching hospitals.&lt;/p&gt;\n&lt;p&gt;Our vision is to deliver the best quality and safest care for our community – which we benchmark against the best. Our values, developed with staff and patients, have been clear since 2008 - &lt;strong&gt;FIRST&lt;/strong&gt; - &lt;strong&gt;F&lt;/strong&gt;ocused on patients; &lt;strong&gt;I&lt;/strong&gt;ntegrated team working; &lt;strong&gt;R&lt;/strong&gt;espectful and courteous; &lt;strong&gt;S&lt;/strong&gt;taff focused and supportive; &lt;strong&gt;T&lt;/strong&gt;wo-way open communication. We live these values and it shows in our key achievements below.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key achievements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;In 2019 the ED rating from the Care Quality Commission (CQC) was very good.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;We are one of the top 10 sites in the country for hip, knee and joint replacement outcomes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Top performing trust in UK in terms of best practice in Hip Fracture as identified by NHFD.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Our Trust has scored top in the East of England for doctors’ overall training satisfaction in acute trusts in the GMC national training survey 2018&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;West Suffolk Hospital Foundation Trust was named as one the CHKS Top Hospitals for 2018.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;In the NHS staff survey results for 2016, we emerged as the acute trust with the best performance engagement score throughout the whole of England. 85% of staff would recommend the Trust for the treatment of a friend or relative and 75% would recommend the Trust as a place to work.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;As a global digital exemplar, we have invested in an e-Care system that will make us one of the first paperless hospitals and health systems in the NHS.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Our trust was recently awarded a contract to develop an alliance to run local community services.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;We have had the best early detection of cancer in the country for three years running.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Bury St Edmunds is a beautiful market town that is regarded as ‘the jewel in the crown’ of East Anglia. It has excellent schools, shops and restaurants.&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome. However, Non-EEA candidates who require Tier 2 sponsorship may not be shortlisted or appointed to a post if a suitably qualified, experienced and skilled EU/EEA candidate is available to take up the post, as the employing body is unlikely, in these circumstances, to satisfy the Resident Labour Market Test. The UK Border Agency requires employers to complete this test to show that no suitably qualified EEA or EU worker can fill this post. For further information please visit the UK Border should be on or eligible for inclusion onto the GMC Specialist Register for General Surgery or be within 6 months of their expected date of obtaining a CCT at the time of the interview.&lt;/p&gt;\n&lt;p&gt;If you would like further information on this post please contact Mr Ravi Ayyamuthu on 01284 713000 or call the department secretary or call on 01284 712700.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Senior Clinical Fellow (CESR Rotation)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916065284", "validThrough": "2020-12-31T23:59:59+0000"}