{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32547", "minValue": "23912", "unitText": "YEAR", "value": "£23,912-£ 32,547 (Pro Rata) per annum"}}, "datePosted": "2020-04-03T08:18:25+0100", "description": "&lt;p&gt;St Michael&#39;s Hospice, located in St Leonards on Sea, East Sussex, provides excellent holistic care and support for those throughout Hastings and Rother affected by a progressive life-limiting illness or bereavement.&lt;/p&gt;\n&lt;p&gt;We are looking for Registered Nurses to join the Hospice, working within our Hospice at Home team. The Hospice at Home service takes the specialist skills of St Michael’s Hospice into an individual’s home, enabling people to have more choice over their place of care. The team provides specialist nursing 24 hours a day, 365 days a year.&lt;/p&gt;\n&lt;p&gt;You will be responsible for providing high standards of specialist palliative care in the community setting, where patients have complex symptom control issues, and provide emotional and psychological support to patients and their families. You will deliver hands on nursing care in the short term to patients within their home, working day and night shifts. You will need to work autonomously within the limits of existing knowledge and skills, demonstrating sound judgment and be able to communicate in a sensitive manner along with an ability to work effectively within a multidisciplinary team&lt;/p&gt;\n&lt;p&gt;At St Michael’s Hospice we offer a friendly, team orientated work environment – a good pension scheme with the option to continue any existing NHS pension scheme membership, a wellbeing and resilience programme, discounted gym membership, 27 days annual leave plus bank holidays, subsidised employee meals, supportive supervision and a proactive education department to support with development.&lt;/p&gt;\n&lt;p&gt;A disclosure and barring service check is required for this role.&lt;/p&gt;\n&lt;p&gt;For further infomation Contact Jill Beckhelling on 01424 456612&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Social Enterprises", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130655"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Leonard&#39;s on Sea", "postalCode": "TN38 0LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8548", "longitude": ".552205"}}, "title": "Registered Nurse - Hospice at Home (Community)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916021629", "validThrough": "2020-12-31T23:59:59+0000"}