{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36800", "minValue": "36800", "unitText": "YEAR", "value": "£36,800"}}, "datePosted": "2020-07-01T15:28:03+0100", "description": "&lt;p&gt;Providing quality, inspiring innovation and delivering value is what we set out to achieve at Priory Healthcare. Enabling our patients with complex neurodisability to receive a truly integrated and holistic approach to their care, regardless of complexity or severity, thanks to the knowledge and expertise of our multidisciplinary clinical teams. The Priory Highbank Centre specialises in complex neuro-disability, including care of tracheostomy and mechanical ventilated patients. You would be part of our dedicated multidisciplinary team who offer evidence based, patient centred care and therapy to help patients maximise their physical, emotional and social potential. The Elton Unit is a 28 bedded purpose built Specialist Care Home for adults who have complex neurological and behavioural needs.&lt;/p&gt;\n&lt;p&gt;The Deputy Ward Manager (RGN Nurse) Responsibilities:&lt;/p&gt;\n&lt;p&gt;Supervision and management of care staff&lt;/p&gt;\n&lt;p&gt;Planning, assessing, delivering and evaluating individual care&lt;/p&gt;\n&lt;p&gt;Planning staff rotas&lt;/p&gt;\n&lt;p&gt;Establish and maintain outstanding communication with clients, relatives and colleagues&lt;/p&gt;\n&lt;p&gt;Deputise in the absence of the Ward Manager&lt;/p&gt;\n&lt;p&gt;Undertake oncall within a rota&lt;/p&gt;\n&lt;p&gt;Demonstrate consistent leadership and role modelling&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Deputy Ward Manager:&lt;/p&gt;\n&lt;p&gt;Must be RGN qualified with a valid NMC Pin Number&lt;/p&gt;\n&lt;p&gt;Must have senior nursing experience working within a care home setting&lt;/p&gt;\n&lt;p&gt;Brain Injury experience desirable but not essential as training will be provided&lt;/p&gt;\n&lt;p&gt;Must be able to work on your own initiative and as part of a team a nd have sound knowledge of regulatory requirements&lt;/p&gt;\n&lt;p&gt;Must be able to complete an enhanced DBS check&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With a kind, caring and calm approach, the successful candidate will have excellent communication and interpersonal skills, along with the ability to establish and maintain relationships with patients, relatives and colleagues. If you have the skills, attitude and experience to be successful in this role, we want to hear from you today!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return, we can offer:&lt;/p&gt;\n&lt;p&gt;Working with a committed, forward-thinking and supportive interdisciplinary team&lt;/p&gt;\n&lt;p&gt;Contributory pension scheme&lt;/p&gt;\n&lt;p&gt;Paid sick leave (after qualifying period)&lt;/p&gt;\n&lt;p&gt;Access to regular clinical supervision&lt;/p&gt;\n&lt;p&gt;Generous annual leave entitlement&lt;/p&gt;\n&lt;p&gt;Subsidised meals&lt;/p&gt;\n&lt;p&gt;Free parking&lt;/p&gt;\n&lt;p&gt;Corporate benefit package&lt;/p&gt;\n&lt;p&gt;Annual NMC fee reimbursed by Priory Group&lt;/p&gt;\n&lt;p&gt;Birthday Leave&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at the Enhanced level from the Disclosure and Barring Services (DBS). We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BURY", "postalCode": "BL9 5LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6297", "longitude": "-2.3023"}}, "title": "Deputy Ward Manager RGN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916097944", "validThrough": "2020-11-27T23:59:59+0000"}