{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 pa pro rata"}}, "datePosted": "2020-06-15T16:45:37+0100", "description": "&lt;p&gt;If you are a passionate paediatric student nurse within 18 months of qualifying, we welcome your application to join our rapidly-advancing Trust.&lt;/p&gt;\n&lt;p&gt;Having recently undertaken an ambitious £5.1m project to build our very own state-of-the-art children’s emergency and trauma department, Southampton Children’s Hospital is at the forefront of paediatric healthcare.&lt;/p&gt;\n&lt;p&gt;Our dedicated children’s hospital hosts a range of specialist paediatric services. This means that you have huge variety in the people you work with, the patients you see and the career pathways on offer to you.&lt;/p&gt;\n&lt;p&gt;At UHS, we’re guided by our values of putting patients first, always improving and working together. So if you’re dedicated to patient care, inspired to make progressive improvements, and a great collaborator; we’d love you to join us.&lt;/p&gt;\n&lt;p&gt;SUPPORT FOR YOU&lt;/p&gt;\n&lt;p&gt;To give you the strongest start in your career, we offer a comprehensive two-week induction and a unique paediatric preceptorship programme with our Wessex partners in the PIER Network. There are plenty of opportunities to grow your career and take the lead as you progress, and we’re committed to supporting all our staff in achieving their personal and professional ambitions.&lt;/p&gt;\n&lt;p&gt;We think working here is pretty great, but you don’t have to take our word for it. Here’s what one of our newly qualified nurses said about working at UHS:&lt;/p&gt;\n&lt;p&gt;“I feel incredibly proud to be part of such a forward-thinking, innovative trust, and I hope to see many more people joining to share the same positive experience that I’ve had!”&lt;/p&gt;\n&lt;p&gt;- Ellie Fowler, newly qualified nurse, child health&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;APPLICATION INFORMATION&lt;/p&gt;\n&lt;p&gt;Please provide both an academic and clinical reference.&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;HR recruitment team &lt;br /&gt;023 8120 6525 &lt;br /&gt;recruitment@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;Please note that this advert is specifically for newly qualified paediatric nurses. Adult nurses or dual field nurses will need to apply through the specific adult advert: 188-NQNAdult.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;HR recruitment team &lt;br /&gt;023 8120 6525 &lt;br /&gt;recruitment@uhs.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO16 6YD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.933", "longitude": "-1.4351"}}, "title": "Student and Newly Qualified Nurse - Child", "url": "https://www.jobs.nhs.uk/xi/vacancy/916079784", "validThrough": "2020-12-10T23:59:59+0000"}