{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50430", "minValue": "42025", "unitText": "YEAR", "value": "£25- £30 per hour"}}, "datePosted": "2020-03-17T17:03:41+0000", "description": "&lt;p&gt;Working in partnership with Portsmouth NHS Trust, Diaverum will be taking over the management of the renal clinics in Havant and Salisbury. We have an exciting opportunity in our Portsmouth clinic for a qualified registered nurse to join our Diaverum bank.Our bank have the flexibility to choose shifts and clinics they wish to work in. Here at Diaverum we have an online booking system which allows you to access available shifts in your preferred clinics and book directly through the system.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for individuals who want to make a difference in our patient’s lives. You will provide patient care according to Diaverum procedures in order to increase the quality of life for our patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;RESPONISIBILITIES:&lt;/p&gt;\n&lt;p&gt;• Follow care programmes for renalpatients including the initiation and termination of dialysis, whilst providingstable clinical care, emotional support and independence for patients&lt;/p&gt;\n&lt;p&gt;• Follow the tailored care plans to administer medications, fluid therapy or other appropriate treatments as perConsultant instructions and ensuringclinical activity is appropriately documented in the patient medical record&lt;/p&gt;\n&lt;p&gt;• Review pre and post haemodialysis care with patient&lt;/p&gt;\n&lt;p&gt;• Prepare and monitor dialysis machines and systems in line with Diaverum processes&lt;/p&gt;\n&lt;p&gt;• Providetreatment to a group of assigned patients ensuring‘great care‘ is provided at all times&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;REQUIREMENTS:&lt;/p&gt;\n&lt;p&gt;• NMC Registered Nurse&lt;/p&gt;\n&lt;p&gt;• Awareness and Understanding of NMC code of professional conduct&lt;/p&gt;\n&lt;p&gt;• Able to work autonomously and within a multi-disciplinary team&lt;/p&gt;\n&lt;p&gt;• Experience as a Haemodialysis nurse&lt;/p&gt;\n&lt;p&gt;• Have a positive and dynamic approach to providing safe and effective delivery of care&lt;/p&gt;\n&lt;p&gt;• Excellent communication skills with fluency in English&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;GROW WITH US!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;By joining the Diaverum Staff Bank you will be paid annual leave (on a PAYE basis only) and will not be charged for your pre-employment, uniform provided.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Diaverum UK Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO9 1TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8488", "longitude": "-.984672"}}, "title": "Bank Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916009147", "validThrough": "2020-11-28T23:59:59+0000"}