{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "competitive salary plus benefits"}}, "datePosted": "2020-06-04T10:41:39+0100", "description": "&lt;p&gt;BMI Healthcare is the UK’s largest provider of independent healthcare. With a network of hospitals across the country, our aim is to attract the best nursing, theatre and allied healthcare professionals in addition to employing outstanding non-clinical and support staff who underpin everything we do. Being part of the wider BMI Healthcare group also offers the prospect for great career progression with opportunities throughout the UK.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BMI Runnymede Hospital&lt;/strong&gt;is a fantastic place to work. Situated close to the M25 in Chertsey, Surrey, The Runnymede is one of BMI Healthcare’s medium sized private hospitals serving the boroughs of Surrey and Berkshire. The Runnymede is on the site of a highly rated foundation Trust – Ashford and St Peter’s. Most, but not all, of the Consultants work at ASPH as well as Runnymede. Our close clinical links allow the hospital assess, treat and care for a range of clinically complex conditions. These include orthopedic surgery, general surgery, ENT, cardiology and other specialties. We are proud to be rated “Good” by the CQC affirming our commitment to put patient care at the heart of absolutely everything we do. Surrey is a beautiful place to live with easy access to London and the south coast. Moreover, the close proximity to Heathrow and Gatwick puts Europe on your doorstep.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently recruiting for an experienced and committed Senior Theatre Practitionerto join our fantastic team of staff in our Theatre Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full timepost and there is a flexible shift pattern in place.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Applicants should meet the following criteria:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Practitioner with NMC or HCPC registration.&lt;/li&gt;\n&lt;li&gt;Post-registration qualification relevant to functional specialty i.e. Advanced Scrub Practitioner or Surgical First Assistant qualification [for scrub leads].&lt;/li&gt;\n&lt;li&gt;ENB 998 and/or mentorship course.&lt;/li&gt;\n&lt;li&gt;Must have previous experience working in Scrub and Orthopaedics.&lt;/li&gt;\n&lt;li&gt;Approved / recognised anaesthetic course.&lt;/li&gt;\n&lt;li&gt;ILS.&lt;/li&gt;\n&lt;li&gt;Mentorship qualification&lt;/li&gt;\n&lt;li&gt;ILM3&lt;/li&gt;\n&lt;li&gt;Maths, English GCSE at grades A to C or equivalent. Functional skills level 2 evidence.&lt;/li&gt;\n&lt;li&gt;Proficient in the use of a PC, including the use of software and systems.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Duties of this role include:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deliver safe quality care for patients during their peri-operative phase of care. To support, coordinate and actively assist in the management and organisation of care within the operating department. Provide quality planned care for patients during their peri-operative phase of care by ensuring all team members deliver quality patient care by providing appropriate clinical and managerial leadership.&lt;/li&gt;\n&lt;li&gt;Lead the team to deliver care that helps improve the health of the individual and wider community.&lt;/li&gt;\n&lt;li&gt;Lead the team in demonstrating compassion through effective relationships based on empathy, respect and dignity.&lt;/li&gt;\n&lt;li&gt;Develop own competence to deliver effective care and treatments through improving clinical/technical knowledge / skill, and expertise.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please see attached role profile for further detailed information on the responsibilities and accountabilities of this vacancy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Employee benefits for contracted staff also include 25 days holiday + bank holidays, Pension scheme, Private health insurance, discounted gym membership and many more exclusive discounts and incentives via our “Perks at Work” scheme – we also have free parking at most of our hospitals.&lt;/p&gt;\n&lt;p&gt;We are also committed to providing ongoing training and development to our staff via our dedicated in-house BMI Academy which offers one of the most comprehensive packages of training courses available in the private sector.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Safeguarding&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;BMI Healthcare is fully committed to safeguarding the welfare of all children and young people, and vulnerable adults by taking all reasonable steps to protect them from harm. All staff will receive appropriate training and induction so that they understand their roles and responsibilities and are confident about carrying them out.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BMI Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey", "postalCode": "KT16 0RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.378", "longitude": "-.524363"}}, "title": "Senior Theatre Practitioner - Orthopaedic Scrub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916068092", "validThrough": "2020-11-22T23:59:59+0000"}