{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-06-12T15:00:16+0100", "description": "&lt;p&gt;There has never been a more exciting time to be part of the Senior Leadership team as an Operational Manager in designing and delivering community-based services at MPFT. We have mix of Community Health, Inpatient facilities, Mental Health and Adult Social Care Services that give us an unparalleled opportunity to lead the development of truly integrated Health &amp; Social care services.&lt;/p&gt;\n&lt;p&gt;The Staffordshire &amp; Stoke-on-Trent care group are committed to providing a collective leadership approach to ensure the best services for our patients. We are looking for leaders who are enthusiastic and dedicated to upholding our trust values, supporting team work together in partnership to integrate services. The person interested should be dynamic and highly skilled Nursing or Allied Health Professional leader with the experience of operational management to take up the full time role as an Operational Manager.&lt;/p&gt;\n&lt;p&gt;The Operational Manager will have day-to-day responsibility of providing the leadership and Management for the Community nursing Team, Local Access Point team, admin staff and the ambulatory care service. They will be flexible to the service change requirements and be able to lead the projects working with the Operational Leads and Clinical/Professional leads.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Operational Manager will work in conjunction with the General Manager and Head of Operations, Clinical Leads and Professional Leads to develop and deliver safe and effective services, in accordance with key national targets, clinical standards, service priorities and key performance indicators. They will work in partnership with other professionals to provide multi-agency services that achieve the best possible outcomes for service users.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will support and oversee operational delivery of the service requirements; they will be required to work autonomously in order to address issues impacting on service delivery with overall support and strategic direction from the General Manager. The post holder will also provide the senior level leadership with the cover arrangement where required, ensure that key stakeholder relationships are managed with external partners across the Health and Care system.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;For further information on the available post please contact the named lead below.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Contact Information:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;Suresh Packiam (General Manager – Stoke): 07971920805 suresh.packiam@mpft.nhs.uk &lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke-on-Trent", "postalCode": "ST6 7AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0571", "longitude": "-2.19003"}}, "title": "Operational Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916077929", "validThrough": "2020-11-15T23:59:59+0000"}