{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112"}}, "datePosted": "2020-07-02T11:53:11+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for dedicated, passionate nurses to join our multispeciality Ambulatory Care Team based at Queen Elizabeth Hospital Birmingham. We are looking for highly motivated, committed and innovative personalities that will be able to provide high quality care to patients with complex conditions in a very fast paced but rewarding clinical area. You will be working alongside various other multidisciplinary team members.&lt;/p&gt;\n&lt;p&gt;It is a great opportunity to develop clinically and professionally. Your developmental pathway will be guided by senior nursing and clinical education teams and it includes: in house study days, competencies, university courses, link roles, leading improvement projects, linking with other acute specialities.&lt;/p&gt;\n&lt;p&gt;Previous experience in a surgery setting is not essential as a full and exciting training package will be provided. We welcome applications from those working in other acute specialities.&lt;/p&gt;\n&lt;p&gt;Do not hesitate and apply, we really want you on board!&lt;/p&gt;\n&lt;p&gt;At University Hospitals Birmingham we support flexible working and welcome applications from nurses seeking flexible working opportunities and family friendly working hours and looking to return from non-acute environments.&lt;/p&gt;\n&lt;p&gt;If you require further details or would like to visit the area, please contact:&lt;/p&gt;\n&lt;p&gt;Zuwena Spencer or Claire Mckenzie (Senior Sister Ambulatory Care) on 0121 3713120&lt;/p&gt;\n&lt;p&gt;Trudi Smith (Senior Sister Welcome Short Stay ) on 0121 3713133&lt;/p&gt;\n&lt;p&gt;Lesley Golby ( Senior Sister East Block Day Unit ) on 0121 3718890&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916098958", "validThrough": "2021-02-28T23:59:59+0000"}