{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "competitive salary plus benefits"}}, "datePosted": "2020-06-10T11:20:07+0100", "description": "&lt;p&gt;BMI Healthcare is the UK’s largest provider of independent healthcare.With a network of hospitals across the country, our aim is to attract the best nursing, theatre and allied healthcare professionals in addition to employing outstanding non-clinical and support staff who underpin everything we do.Being part of the wider BMI Healthcare group also offers the prospect for great career progression with opportunities throughout the UK.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BMI Droitwich Spa Hospital is located in the heart on Worcestershire,&lt;/strong&gt;with easily accessible transport links. The hospital is a fantastic place to work.&lt;/p&gt;\n&lt;p&gt;Excellent place to work with a well established, supportive and flexible team. We offer an opportunity for nurses to spend time with their patients , to get back to basics as well as use their clinical skills and knowledge to care for patients through their pre-operative, post operative and discharge journey. BMI offers an excellent benefits package. These include access to online discounts, gym membership discount, friends and family scheme and employee recognition where employees are given an award for every 5 years service, this can include anything from afternoon tea to spa days . We have a learning academy where staff can access development and managerial programmes which are person centred and recognises the importance of life long learning. We have a preceptorship programme for newly qualified staff with full support from the nursing team. We also have free parking for staff members.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently recruiting for an experienced and committed&lt;/strong&gt;&lt;strong&gt;Registered Nurse&lt;/strong&gt;&lt;strong&gt;to join our fantastic team of staff in our&lt;/strong&gt;&lt;strong&gt;Wards &lt;/strong&gt;&lt;strong&gt;department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We want our patients to continue to have a safe, effective and caring experience therefore the successful candidate will put patient care at the heart of everything they do.&lt;/p&gt;\n&lt;p&gt;As a qualified practitioner with NMC registration you will use your skills and knowledge to work well within a team, adopting a flexible and collaborative approach at all times.If you are an enthusiastic, highly motivated Registered Nurse with proven skills ingeneral nursing, outpatients, pre-assessment or orthopaedicsyou will find a place to thrive at BMI Healthcare.&lt;/p&gt;\n&lt;p&gt;Please see attached Job Description for further detailed responsibilities &amp; accountabilities of this role&lt;/p&gt;\n&lt;p&gt;This is apart timepost and there is a flexible shift pattern in place.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join the BMI Healthcare journey and become part of a team where people matter&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you would like any further information or an informal chat before applying then please contact&lt;strong&gt;Sarah Williams on 01905 793402.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Owing to the nature of this position, any offer of employment will be subject to a satisfactory&lt;/strong&gt;&lt;strong&gt;Enhanced Disclosure Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Safeguarding&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;BMI Healthcare is fully committed to safeguarding the welfare of all children and young people, and vulnerable adults by taking all reasonable steps to protect them from harm. All staff will receive appropriate training and induction so that they understand their roles and responsibilities and are confident about carrying them out.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BMI Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Droitwich Spa", "postalCode": "WR9 8DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2655", "longitude": "-2.15089"}}, "title": "Senior Registered Nurse - Nights", "url": "https://www.jobs.nhs.uk/xi/vacancy/916073781", "validThrough": "2020-11-29T23:59:59+0000"}