{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24929", "minValue": "24929", "unitText": "YEAR", "value": "£14.83 per hour"}}, "datePosted": "2020-05-14T15:39:39+0100", "description": "&lt;p&gt;Stockton Hall is a highly specialist hospital where patients requiring a medium secure care setting can maximise value from therapeutic interventions. Our services have produced excellent recovery results for patients and they are able to progress to low secure or locked rehabilitation if possible.&lt;/p&gt;\n&lt;p&gt;The facility is split across seven wards as follows:&lt;/p&gt;\n&lt;p&gt;16 bedded female ward - Mental Health and Personality Disorder&lt;br /&gt;16 bedded male ward - Personality Disorder&lt;br /&gt;8 bedded elderly male ward - for those with a settled in presentation in need of rehabilitation for mental illness and/or personality disorders&lt;br /&gt;Two 24 bedded male wards for mental health focus&lt;/p&gt;\n&lt;p&gt;The role:&lt;/p&gt;\n&lt;p&gt;As part of our nursing team you will assist and support the assessment, treatment and rehabilitation of patients in the unit and on community trips.&lt;/p&gt;\n&lt;p&gt;Working as part of a multidisciplinary team under the direct supervision of a qualified nurse you will be required to undertake a range of duties involving direct patient contact and interaction.&lt;/p&gt;\n&lt;p&gt;Our Bank Registered Mental Nurse role involves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing a high standard of care to people with mental illness and personality disorder and learning disability&lt;/li&gt;\n&lt;li&gt;Developing therapeutic relationships to optimise patient engagement&lt;/li&gt;\n&lt;li&gt;Following all codes of conduct, standards and legislation, respecting the rights of others and promoting ethical practice&lt;/li&gt;\n&lt;li&gt;Contributing to patient assessments, compiling a plan of care alongside the individual, and monitoring patient progress&lt;/li&gt;\n&lt;li&gt;Accept personal and shared responsibility for the maintenance of quality nursing care, for all patients as part of a multi-disciplinary team approach within a forensic setting.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Qualifications/Experience:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A relevant nursing qualification and registration – RMN / RNLD&lt;/li&gt;\n&lt;li&gt;Excellent team working skills, a high level of self-motivation and a flexible approach - our units operate 24 hours 7 days a week, and our nursing staff work shift patterns including weekends, bank holidays and nights.&lt;/li&gt;\n&lt;li&gt;A commitment to patient-centred care and to values-based and evidence-based practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;What we would like to give you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive hourly rate&lt;/li&gt;\n&lt;li&gt;Weekly pay in arrears&lt;/li&gt;\n&lt;li&gt;Enhanced disclosure cost coverage&lt;/li&gt;\n&lt;li&gt;Free meals whilst on duty&lt;/li&gt;\n&lt;li&gt;Free on site parking&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "YORK", "postalCode": "YO32 9UN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9954", "longitude": "-1.00281"}}, "title": "BANK STAFF NURSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916049970", "validThrough": "2020-11-27T23:59:59+0000"}