{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31000", "minValue": "25000", "unitText": "YEAR", "value": "£25000 -31000 + up to £2k salary enhancements pa"}}, "datePosted": "2020-06-08T12:26:35+0100", "description": "&lt;p&gt;&lt;strong&gt;Come and join us and receive a £3,000 incentive bonus &lt;/strong&gt;(subject to T&amp;C’s)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you looking for a new and exciting role within nursing, here at Circle Reading we are looking for a Registered Nurse to join our friendly and well established inpatient nursing team.&lt;/p&gt;\n&lt;p&gt;Our inpatient area is based within our purpose built hospital with our nurse to patient ratio falling below the national average giving you the ability to care for your patients and truly provide holistic care, our patients fall across a range of specialities allowing you to gain experience in areas such as orthopaedic,&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer our staff enhanced hourly rates when working during the night or at weekends, we would welcome applications from both newly qualified and experienced nurses. If your passionate about nursing care then get in contact with us and lets embark on this journey together.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We will help to support your professional journey investing you with appropriate continued professional development as we believe this not only provides helps our patients but helps to skill our staff for the journey ahead.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Person Specification:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Nurse Level 1 or 2 (General/ adult)&lt;/li&gt;\n&lt;li&gt;NMC registration&lt;/li&gt;\n&lt;li&gt;Demonstrable record of CPD&lt;/li&gt;\n&lt;li&gt;Knowledge of current issues in professional practice with particular relevance to the Unit&lt;/li&gt;\n&lt;li&gt;Knowledge of standards of professional practice in the wider healthcare context&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Parking on site&lt;/li&gt;\n&lt;li&gt;Perk box&lt;/li&gt;\n&lt;li&gt;Travel to Work Bus, and Cycle schemes&lt;/li&gt;\n&lt;li&gt;Childcare Vouchers 27 Annual Leave with additional days after qualifying period&lt;/li&gt;\n&lt;li&gt;Pension Scheme&lt;/li&gt;\n&lt;li&gt;Health and Well Being programme which includes free fruit, massages and fitness sessions&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;Discounted food from the Atrium Café&lt;/li&gt;\n&lt;li&gt;Private Medical Assurance after qualifying period&lt;/li&gt;\n&lt;li&gt;Non-contributory Life Assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Circl&lt;/strong&gt;&lt;strong&gt;e and Reading&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Reading is a vibrant multicultural city with quick and easy travel links into central London.&lt;/p&gt;\n&lt;p&gt;Circle Health is a company that runs hospitals and health services in the UK. We were founded in 2004, and we are different to most healthcare organisations we build independent hospitals which pioneered five-star hospitality in the UK, and we’re the only organisation running some innovative types of work in the NHS, like our Bedfordshire musculoskeletal contract.&lt;/p&gt;\n&lt;p&gt;Circle Reading Hospital (Private Healthcare Provider) we opened in 2012, Circle Reading has 30 inpatient beds, 20 day care beds and 15 consultation rooms for outpatient appointments. This state of the art building has 5 theatres, equipped with the latest technologies and an extensive physiotherapy department. Circle Reading developed the look and feel of care first tried in Bath and sees approximately 4,500 patients each month and around 600 of these are day case patients.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Circle Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG2 0NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4369", "longitude": "-.971772"}}, "title": "Registered Nurse InPatients", "url": "https://www.jobs.nhs.uk/xi/vacancy/916071295", "validThrough": "2020-12-11T23:59:59+0000"}