{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27144", "minValue": "27144", "unitText": "YEAR", "value": "£27,144 per annum plus excellent benefits"}}, "datePosted": "2020-07-01T10:41:00+0100", "description": "&lt;p&gt;You are invited to join us at Sue Ryder St John&#39;s Hospice, rated as outstanding by the CQC.&lt;/p&gt;\n&lt;p&gt;Are you an NMC registered nurse? Want to develop a rewarding career with a recognised national charity? If so, this is an amazing opportunity to develop your knowledge in palliative care and work across a range of palliative services.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are calling on Registered Nurses (RGN) to join our amazing Palliative Care Hub bank team at St John&#39;s Hospice, Moggerhanger, Bedford. The role involves operating the telephone advice lines and co-ordinating calls for palliative patients and various healthcare proffesionals.&lt;br /&gt;&lt;br /&gt;St John’s Palliative Care Hub provides telephone support 24 hours a day, seven days a week for individuals with a life-limiting condition who choose to receive care at home. The Palliative Care Hub works together with local care providers, GPs, district nurses, specialist nurses, the ambulance service and other health and social care professionals to coordinate and provide the best possible care.&lt;br /&gt;&lt;br /&gt;About You:&lt;br /&gt;&lt;br /&gt;To join our team, you’ll need:&lt;br /&gt;•Registered Nurse, preferably with experience in palliative care&lt;br /&gt;•Excellent communication skills&lt;br /&gt;•An ability to demonstrate a commitment to CPD&lt;br /&gt;•Awareness of current legislation within independent care sector&lt;br /&gt;•Completion of NMC recognised accredited mentor training and able to mentor students and less experienced staff&lt;br /&gt;•A knowledge of systmone would be an advantage&lt;br /&gt;&lt;br /&gt;Your Benefits:&lt;br /&gt;&lt;br /&gt;Company pension scheme&lt;br /&gt;25 days holiday - rising to 30 with length of service plus bank holidays&lt;br /&gt;Competitive enhanced pay for nights, weekends and public holidays&lt;br /&gt;**Continuation of NHS pension**&lt;br /&gt;Corporate discount with hundreds of retailers and services&lt;br /&gt;Staff discount of 15% on new goods online at shop.sueryder.org&lt;br /&gt;Online Wellbeing Centre&lt;br /&gt;Free onsite parking&lt;br /&gt;Free uniform&lt;br /&gt;Subsidised onsite meals and drinks&lt;br /&gt;Structured induction programme and learning and development opportunities&lt;br /&gt;&lt;br /&gt;There is plenty of scope to develop your skills in specialist palliative care and planned career progression through our education programme and development framework. So if you are enthusiastic, committed nurse looking to develop your knowledge in specialist palliative care with an expert national charity, then this may be the job for you.&lt;br /&gt;&lt;br /&gt;St John’s Hospice is located nearby a lovely residential area in a small village called Moggerhanger in Bedfordshire. It is serviced by the number 73 bus, however due to shifts patterns; it is recommended you have your own transport to get to and from work.&lt;br /&gt;&lt;br /&gt;If you are looking for more control over when you work or some additional hours on top of another job please come and join our amazing team of bank nurses today.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedford", "postalCode": "MK44 3RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1281", "longitude": "-.335766"}}, "title": "Bank Registered Nurse - Palliative Care Hub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916097091", "validThrough": "2020-11-30T23:59:59+0000"}