{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32000", "minValue": "32000", "unitText": "YEAR", "value": "£32,000pa"}}, "datePosted": "2020-06-30T16:05:29+0100", "description": "&lt;p&gt;&lt;strong&gt;Specialist Speech and Language Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt; up to £32000&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 40 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract:&lt;/strong&gt; Permanent&lt;/p&gt;\n&lt;p&gt;Are you a Band 6 who would like to explore a more rewarding clinical challenge in learning disabilities coupled with an exciting mental health caseload? If so, we could offer you the opportunity to further develop your clinical skills. We want to recruit an exceptional SLT to this Band 6 post and progress you to a Band 7.&lt;/p&gt;\n&lt;p&gt;Join our supportive, friendly team in the North East and make an application today. The post will support a residential caseload alongside referrals from an Acute Inpatient Mental Health Service in Hexham.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;Job Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Specialist Speech and Language Therapist, you will have a unique opportunity to lead on the development and delivery of an evidence-based SLT service to meet the needs of the complex client group within a mental health inpatient service and LD residential settings. Working as part of a multi-disciplinary team, you will use expert skills to assess, advise and intervene with the aim of promoting functional communication systems and optimal independence. You will be able to train others, promote good practice and maintain a successful total communication environment. You will be accountable to a Highly Specialist Speech and Language Therapist and an allocated Service Manager. Postgraduate qualification in the management of dysphagia is essential and you will have support from a full time Speech and Language Therapy Assistant.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;We are looking for a Speech and Language Therapist with:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong clinical and professional skills&lt;/li&gt;\n&lt;li&gt;Experience in the field of Learning Disabilities including Autism Spectrum Disorders and Mental Health Conditions.&lt;/li&gt;\n&lt;li&gt;Understanding of Positive Behaviour Support with an emphasis on person-centred planning.&lt;/li&gt;\n&lt;li&gt;Knowledge of key national drivers for inpatient services such as Transforming Care, Five RCSLT Good Communication Standards.&lt;/li&gt;\n&lt;li&gt;Qualification in Dysphagia management &lt;strong&gt;essential &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Evidence of being a strong team player with a genuine desire to help others&lt;/li&gt;\n&lt;li&gt;Ability to be proactive and work flexibly in a fast paced and dynamic environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;5 reasons why you should make an application today…&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;We care about all our service users and staff.&lt;/li&gt;\n&lt;li&gt;We will give you career progression and support your development and skills.&lt;/li&gt;\n&lt;li&gt;You will be a part of a service that supports inpatient and residential homes giving diversity to your role.&lt;/li&gt;\n&lt;li&gt;We have a national network of over 50 SLTs at Cygnet within different specialisms including Forensic Practice, LD and ASD, Acute mental health, Neuropsychiatry and inpatient CAMHS.&lt;/li&gt;\n&lt;li&gt;We work with low caseload number to support intensive SLT focused interventions and to support your Personal Development Plan.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt; In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An immediate peer network in the North East consisting of 4 SLTs.&lt;/li&gt;\n&lt;li&gt;Excellent Clinical Supervision, CPD and developmental opportunities for clinical and non-clinical duties&lt;/li&gt;\n&lt;li&gt;Full support from an onsite multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Routine service meetings with Cygnet Speech and Language Therapists.&lt;/li&gt;\n&lt;li&gt;CPD and Developmental opportunities&lt;/li&gt;\n&lt;li&gt;Meal provision on duty&lt;/li&gt;\n&lt;li&gt;A comprehensive employee assistance programme and discount centre including NHS discounts.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt; Full induction training is given and you will receive supervision from a Highly Specialist SLT working with the same caseload in the region.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; You must be a Health &amp; Care Professions Council (HCPC) registered SLT. Please note: successful candidates will be required to undergo an enhanced DBS check.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;&lt;em&gt;Are you ready for a new and rewarding opportunity? Please apply now.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington", "postalCode": "DL3 9LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5306", "longitude": "-1.5685"}}, "title": "Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916096439", "validThrough": "2020-11-27T23:59:59+0000"}