{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001"}}, "datePosted": "2020-09-20T13:50:46+0100", "description": "&lt;p&gt;UHB has achieved Global Digital Exemplar status, an accolade that recognises its digital maturity and creates a framework for the Trust to share its knowledge and innovations with other care providers.&lt;/p&gt;\n&lt;p&gt;The IT department, which is believed to be the biggest of any NHS Trust in the UK, is now looking to further expand its team of specialists and we are looking for an experienced Transformation and Integration Manager - Programmer / Analyst.&lt;/p&gt;\n&lt;p&gt;The department is expanding in order to meet the Trust’s digital demands, particularly in the ‘new Covid-19 world’. A Transformation programme of work is under way to create a truly agile and digital-first Trust, enabling colleagues at each of the Trust’s sites to provide seamless care remotely where necessary to protect both patients and staff. This includes the rollout of a number of industry-leading clinical systems across all sites, some of which have been developed in-house.&lt;/p&gt;\n&lt;p&gt;The Trust will also be moving over to N365, a version of Microsoft Office designed specifically for the NHS, and requires talented and motivated individuals to deliver this programme of work. With more than 20,000 colleagues in the Trust, this is a significant project that will help to standardise ways of working and communicating across the Trust, which has legacy disparate programmes resulting from the merger of Heart of England NHS Foundation Trust and University Hospitals Birmingham NHS Foundation Trust (2018).&lt;/p&gt;\n&lt;p&gt;Successful applicants will divide their time flexibly between working from home or at one of the Trust’s various locations in Birmingham and Solihull. Therefore, candidates will need to be able to travel to and work from Birmingham and Solihull.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be a core part of one of the most digitally mature organisations within the NHS that is committed to developing and adopting new and emerging technologies in order to continue to deliver clinical safety, quality and excellent patient care and experience.&lt;/p&gt;\n&lt;p&gt;If this sounds like something you would like to be a part of please get in touch.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Transformation and Integration Manager - Programmer / Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916192104", "validThrough": "2020-11-06T23:59:59+0000"}