{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-09-22T13:01:22+0100", "description": "&lt;p&gt;&lt;span&gt;Band 5 Community Staff Nurse – Moorlands Leek Community Nursing Team&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Do you want to be part of an emerging, unique and diverse organisation that holds Quality, People and Responsibility as its Core values and is committed to staff development and delivery of excellent patient care?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Are you looking to develop your knowledge and skills in community services, providing both routine and complex treatments to patients within their own home?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Do you see the benefits of closer integrated working between health and social care to ensure the best outcomes for patients?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Are you passionate about wanting to work with patients to help them achieve their goals? Are you caring and compassionate and committed to personalised care?&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Within the Moorlands Leek Community Nursing team based at Moorlands House, we have an opportunity for a part time Community Staff Nurse to join our locality.We are recruiting a dedicated and compassionate nurse to further enhance the high quality patient experience we offer in the community. &lt;br /&gt; The successful applicant needs to have a commitment to providing care in patients’ own homes, be able to work on their own initiative and work well within a team, demonstrating a wide-range of clinical skills. Community services are admitting patients with a more complex acuity than ever before, with increasingly specialist treatment and care being provided by highly skilled staff. For the right applicant, training and development can be provided to meet the individualised needs of patients in our community.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting time to join the team and you will be a part of excellent way of working to meet the changing demand on community nursing. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These posts are also open to newly qualified nurses and student nurses due to qualify in September 2020.&lt;br /&gt;&lt;br /&gt; For more information, please contact -&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Emily Colclough&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Operational Lead &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Emily.Colclough2@mpft.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moorlands House, Stockwell Street, Leek", "postalCode": "ST13 6HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1076", "longitude": "-2.02425"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916195053", "validThrough": "2020-11-06T23:59:59+0000"}