{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42295", "minValue": "38376", "unitText": "YEAR", "value": "£38,376 - £42,295"}}, "datePosted": "2020-09-10T09:24:00+0100", "description": "&lt;p&gt;About The Role&lt;/p&gt;\n&lt;p&gt;We are currently seeking a &lt;strong&gt;Speech and Language Therapist&lt;/strong&gt;, to join our &lt;strong&gt;Specialist Brain Injury Neurological Care &amp; Rehabilitation&lt;/strong&gt; Service at Hothfield Brain Injury Rehabilitation &amp; Neurological Care Centre, located in Hothfield just 3 miles from Ashford, Kent.  We would be delighted to speak to you If you’ve previously worked for the &lt;strong&gt;NHS.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt; Working with The Huntercombe Group is rewarding and varied. Through our “Conversation into Action” programme we actively encourage our employees to get involved and to drive organisational change for the better.&lt;br /&gt;&lt;br /&gt; The centre is a 32 bed facility providing specialist short-term and long-term person-centered rehabilitation, therapy and support for adults with either a brain injury or other complex neurological conditions.&lt;br /&gt;&lt;br /&gt; We also care for patients who are no longer able to be cared for at home but who with some specialist help can take part in everyday activities and live as independently as possible.&lt;br /&gt;&lt;br /&gt; Situated within 12 acres, our service offers intense rehabilitation for adults in the post-acute phase following a brain injury.&lt;br /&gt;&lt;br /&gt; The centre is located in the village of Hothfield, 3 miles from the busy town of Ashford.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Speech and Language Therapist Role:&lt;br /&gt;• To provide a highly specialist speech and language (SLT) assessment, advice and treatment of service.&lt;br /&gt;• To work compassionately with service users and carers to achieve identified goals and to promote independence and well-being, within a person-centred framework.&lt;br /&gt;• To manage a defined caseload of patients, responding to urgent referrals&lt;br /&gt;• To participate in the planning, development and evaluation of the SLT service within a designated team.&lt;br /&gt;• To provide expertise in a highly specialist area and to offer advice and consultation on clients care to other members of the team and external agencies&lt;br /&gt;• To work within the professional practice and Trust guidelines.&lt;br /&gt;• To work and act as a key member of the team, supporting each patient in the achievement of their planned outcomes.&lt;/p&gt;\n&lt;p&gt;Key Accountabilities&lt;/p&gt;\n&lt;p&gt;Clinical Practice&lt;br /&gt;• To assess diagnose, and manage the communication needs of patients.&lt;br /&gt;• To manage a caseload of patients with a range of (complex) conditions including assessment of eating, drinking and communication.&lt;br /&gt;• To ensure the nature of the communication/eating drinking difficulty is communicated sensitively and effectively to all involved, both verbally and in writing.&lt;br /&gt;• To evaluate the effectiveness of episodes of care and make clinical decisions to set further objectives for intervention.&lt;br /&gt;• To work within a multidisciplinary team to deliver a high level of patient care.&lt;br /&gt;• To accurately record all patient intervention and plans in the medical notes.&lt;/p&gt;\n&lt;p&gt;Communication and Relationship Skills&lt;br /&gt;• Provide a high level of Communication with internal and external stakeholders&lt;br /&gt;• Participates in staff meetings offering views, ideas and opinions.&lt;br /&gt; Research, audit and governance&lt;br /&gt; Keep up to date with new developments in the field, critically evaluating available research and developing and implementing evidence-based practices on an ongoing basis.&lt;br /&gt; Participate in research projects and clinical audits in own work area as required.&lt;br /&gt; Training and Development&lt;br /&gt; Undertake the day to day management of junior speech and language staff and students as appropriate.&lt;/p&gt;\n&lt;p&gt;Personal development&lt;br /&gt;• To attend mandatory and professional training as required.&lt;br /&gt;• To participate in clinical supervision and participate in personal development appraisal.&lt;br /&gt; Other&lt;br /&gt;• Responsibility to maintain continuous professional development in order to meet requirements of professional registration.&lt;br /&gt;• To work within the boundaries of your relevant Professional Code of Conduct.&lt;br /&gt;• Compliance with the Huntercombe Group clinical polices and those adopted.&lt;br /&gt;• Participation in the Huntercombe Group clinical governance work programmes.&lt;/p&gt;\n&lt;p&gt;About You&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please take a look at our progressive and rewarding benefits package &lt;br /&gt;&lt;/strong&gt;• Employee Assistance Programme (EAP) &lt;br /&gt;• Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;br /&gt;• 2 week’s paid paternity leave &lt;br /&gt;• Shared parental leave, matching the maternity leave benefit &lt;br /&gt;• A thorough Induction Programme tailored to the hospital where you will be working&lt;br /&gt;• Clear pay structure, with competitive rates &lt;br /&gt;• Generous annual leave allowance &lt;br /&gt;• Sick pay of 4 weeks full pay and 4 weeks half pay &lt;br /&gt;• The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions &lt;br /&gt;• Death in service benefit equivalent to 2 x salary &lt;br /&gt;• A range of staff discounts &lt;br /&gt;• Continuing Professional Development (CPD)&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnicorigin, gender, age, gender identity, sexual orientation, religion, maritalstatus, disability or social background. This is a great opportunity forsomeone to make a difference.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; For a more detailed job spec please take a look at our Website where you can also read some inspiring stories and find out why working at Huntercombe really sets us apart from the rest&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hothfield, Kent", "postalCode": "TN26 1EL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1661", "longitude": ".814648"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916179314", "validThrough": "2020-11-18T23:59:59+0000"}