{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18500", "minValue": "18500", "unitText": "YEAR", "value": "£18,500"}}, "datePosted": "2020-08-24T10:39:58+0100", "description": "&lt;p&gt;The Disabilities Trust is hiring in Horsham&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a Part-Time Speech and Language Therapist to join our friendly service, Kerwin Court. We are looking for motivated and enthusiastic individuals who will strive to deliver the best possible service for our service users.&lt;/p&gt;\n&lt;p&gt;About Us&lt;br /&gt;Located near Horsham in West Sussex, Kerwin Court is a specialist neurobehavioral rehabilitation centre for people with acquired brain injury (ABI). Opened in 2007, it offers a modern, comfortable and superbly equipped environment for rehabilitation. It forms part of the nationwide network of rehabilitation support services provided by the Brain Injury Rehabilitation Trust (BIRT).&lt;/p&gt;\n&lt;p&gt;About the role:&lt;/p&gt;\n&lt;p&gt;As a Speech and Language Therapist at Kerwin Court your main purpose will be to work as part of an interdisciplinary team providing speech and language therapy input to clients with acquired brain injury. To liaise with internal and external professionals, family members and clients.&lt;/p&gt;\n&lt;p&gt;Main duties will include:&lt;/p&gt;\n&lt;p&gt;- To work as an independent clinical professional with knowledge and skills, problem solving and clinical reasoning in a specialist area.&lt;br /&gt;- To manage, with support and supervision, and prioritise a caseload of clients with complex mental/physical health needs and/or challenging behaviour &lt;br /&gt;- To use evidence based/client centred principles and clinical reasoning to assess, plan, implement and evaluate intervention &lt;br /&gt;- To formulate treatment plans in consultation with the client&lt;br /&gt;- To carry out risk assessments relating to the client, client&#39;s contacts and the environment formulating a plan of action&lt;br /&gt;- To develop programmes of care, monitor, evaluate and modify treatment in order to measure - progress and ensure effectiveness of intervention&lt;/p&gt;\n&lt;p&gt;Education/Qualifications required:&lt;/p&gt;\n&lt;p&gt;- Recognised Speech and Language Therapy Degree Qualification or Equivalent&lt;br /&gt; - HPC and RCSLT registration&lt;br /&gt; - Health Professions Council - Licence to Practice - Good time management&lt;br /&gt;- Dysphagia Training/Qualification&lt;/p&gt;\n&lt;p&gt;Skills/Experience required:&lt;/p&gt;\n&lt;p&gt;- Knowledge of assessment tools&lt;br /&gt;- Experience of working collaboratively and co-operatively as part of a multi-disciplinary team&lt;br /&gt;- Experience of working with young people and/or adults with ABI&lt;br /&gt;- Excellent interpersonal skills&lt;br /&gt;- Good analytical and reflection skills&lt;br /&gt;- Negotiation and problem solving skills&lt;br /&gt;- Good organisational skills&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Hours&lt;/p&gt;\n&lt;p&gt;Hours available: 21 Hours a week&lt;/p&gt;\n&lt;p&gt;Benefits include:&lt;/p&gt;\n&lt;p&gt;- Salary of £18,500&lt;br /&gt; - 33 days holiday including bank holidays (pro-rata)&lt;br /&gt; - Group Life assurance&lt;br /&gt; - Employer pension contribution&lt;br /&gt; - Eye voucher scheme&lt;br /&gt; - Long service and staff awards&lt;br /&gt; - Nationwide staff benefits such as Perk Box and discounted gym membership.&lt;/p&gt;\n&lt;p&gt;This position is subject to a Disclosure (DBS) check and employment references.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Disabilities Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Horsham", "postalCode": "RH13 0TP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0637", "longitude": "-.376556"}}, "title": "Speech and Language Therapist - Horsham", "url": "https://www.jobs.nhs.uk/xi/vacancy/916159215", "validThrough": "2020-11-27T23:59:59+0000"}