{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40850", "minValue": "24510", "unitText": "YEAR", "value": "Up to £24,510 FTE £40,850"}}, "datePosted": "2020-09-15T10:04:45+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a highly motivated Clinical Psychologist to join the multidisciplinary team at our brain injury unit - Kerwin Court, in Horsham.&lt;br /&gt;&lt;br /&gt;Kerwin Court is a specialist continuing rehabilitation service that provides residential rehabilitation for up to 23 adults with non-progressive brain injuries who require further inpatient rehabilitation, support and care. The unit is purpose built and has a range of living, leisure and rehabilitation options and environments.&lt;br /&gt;&lt;br /&gt;The multidisciplinary team input includes Neuropsychology, Occupational Therapy, Physiotherapy, Speech and Language Therapy, and vocational and leisure activities. The unit is also staffed by rehabilitation support workers who maintain a therapy focussed approach to care beyond typical therapy hours.&lt;br /&gt;&lt;br /&gt;Kerwin Court has a high level of psychology input with an assistant psychologist, band 7 psychologist, band 8a psychologist and consultant neuropsychologist working at the unit in addition to the advertised post. The unit also takes Trainee Clinical Psychologists for the University of Surrey Doctoral Training Course. Supervision of qualified psychology staff is given by the Consultant Clinical Neuropsychologist who is also the Clinical Programme Lead for Kerwin Court.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;br /&gt;As a Clinical Psychologist, you will be responsible for:&lt;br /&gt;&lt;br /&gt;- Carrying out clinical and cognitive assessments&lt;br /&gt;- Formulating and implementing specialist psychological interventions&lt;br /&gt;- Supervising the work of assistant psychologists&lt;br /&gt;- Supporting and working in partnership with the wider multidisciplinary team&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;What are we looking for?&lt;/strong&gt;&lt;br /&gt;Suitable applicants will have the following skills and qualities:&lt;br /&gt;&lt;br /&gt;- Doctorate level training in Clinical Psychology&lt;br /&gt;- Current registration as a practitioner psychologist with the HCPC&lt;br /&gt;- Experience of working with adults with complex disabilities&lt;br /&gt;- Ability to present and teach others&lt;br /&gt;&lt;br /&gt;The ideal candidate will have a strong interest in working with individuals and families affected by acquired brain injuries, including strokes and traumatic brain injuries. Previous clinical experience working with patients affected by a neurological conditions is desirable. The ability to utilise psychometric cognitive tests is essential.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Benefits include:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;- 33 days annual leave (inclusive of bank holidays)&lt;br /&gt;- Excellent training and support&lt;br /&gt;- Group life assurance&lt;br /&gt;- Eye voucher scheme&lt;br /&gt;- Long service and staff awards&lt;br /&gt;- free parking&lt;br /&gt;- Nationwide employee staff discounts including discounted gym membership, eating out and shopping.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Salary/Hours:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Up to £24,510( FTE £40,850) -21 hours&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Hours:&lt;/strong&gt;&lt;br /&gt;This is a permanent position, working Monday - Friday between 9am - 5pm.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Disabilities Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Horsham", "postalCode": "RH13 0TP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0637", "longitude": "-.376556"}}, "title": "Clinical Psychologist - Horsham", "url": "https://www.jobs.nhs.uk/xi/vacancy/916184696", "validThrough": "2020-11-27T23:59:59+0000"}