{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Consultant"}}, "datePosted": "2020-09-03T13:58:41+0100", "description": "&lt;p&gt;If you are passionate about working with Children and Young Person with ASD, are keen and enthusiastic to develop state of the art new ASD Service with full support from Trust Board and Senior Management Team, then you have come to the right place.&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint a skilled, approachable and motivated Consultant to join our Children &amp; Young People’s Autism Team, which is a multi-disciplinary assessment and intervention service.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity as our Children and Young Person Autism Team has recently grown to now include Children &amp; Young People up to the age of 19 and up to 25 for those with an Education &amp; Health Care Plan. We have been growing and developing our multi-disciplinary team to cover the whole of South Staffordshire. We are also looking to move towards an integrated neuro developmental offer in the future.&lt;/p&gt;\n&lt;p&gt;We are positive about supporting staff and will ensure you receive the training you need along with providing regular clinical and management supervision. You will also have the benefit of working in a highly motivated and supportive team.&lt;/p&gt;\n&lt;p&gt;The team is multi-disciplinary consisting of Occupational Therapists, Speech &amp; Language Therapists, Nursing and Psychology. It is one of several specialist Children’s Mental Health teams covering South Staffordshire as well as a range of other Childrens services across South Staffordshire.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work closely with 6 existing CAMHS Consultants who are all substantive as well as our strong Community Paediatrics Team.&lt;/p&gt;\n&lt;p&gt;The post will be based within the South Staffordshire locality, travel will be required across the locality dependent on clinical needs, however the Trust encourages remote working using our existing Tele-Health Service with full access to your admin and clinical team.&lt;/p&gt;\n&lt;p&gt;If this excites you and you value the strengths of multi-disciplinary working whilst at the same time demonstrating your skills as Consultant Psychiatrist we would love to hear from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stafford", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Consultant in Child &amp; Adolescent Psychiatry - Autism", "url": "https://www.jobs.nhs.uk/xi/vacancy/916171322", "validThrough": "2020-11-23T23:59:59+0000"}