{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14658", "minValue": "14658", "unitText": "YEAR", "value": "£8.72 + Company pension scheme"}}, "datePosted": "2020-07-08T10:21:30+0100", "description": "&lt;h1&gt;&lt;strong&gt;Administrator - Notes Summariser&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Clinical Coding and Data Quality Team&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Priory Medical Group….&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are forward thinking, innovative and patient focussed&lt;/li&gt;\n&lt;li&gt;Recognise that the quality of our work is driven by the quality of our people&lt;/li&gt;\n&lt;li&gt;Are committed to providing an open, friendly and supportive environment where all staff are encouraged to share ideas and contribute to continuously improving the service we offer&lt;/li&gt;\n&lt;li&gt;Will provide you with all the tools, training and personal support needed to &lt;strong&gt;enjoy&lt;/strong&gt; and &lt;strong&gt;succeed &lt;/strong&gt;in this key patient service role&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What is a ‘Notes Summariser’?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Administration Team is made up of four specialties – Notes Summarising, Clinical Coding, Patient Records and Secretarial.&lt;/p&gt;\n&lt;p&gt;This role is within the Note Summarising specialty and the role typically involves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Summarising new patients records to practice deadlines, i.e team targets and individual KPI’s&lt;/li&gt;\n&lt;li&gt;Whilst following a practice protocol, to summarise patient records and accurately assign codes to produce a succinct and relevant record onto the patients’ medical history.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Being instrumental in maintaining high standards of data quality practice wide, identifying and resolving any issues&lt;/li&gt;\n&lt;li&gt;Performing searches of clinical data on a routine and ad-hoc basis&lt;/li&gt;\n&lt;li&gt;Providing an excellent customer service to your colleagues&lt;/li&gt;\n&lt;li&gt;This role and our company will continue to evolve and you will be expected to rise to the challenge&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we look for in your application:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven background with the positive attitude and outlook required to work in a dynamic, fast paced and customer centred business&lt;/li&gt;\n&lt;li&gt;Proven Team Player with pride in how you interact with colleagues and contribute to a positive working environment&lt;/li&gt;\n&lt;li&gt;Professional pride in the quality of your work and relationship with your customers&lt;/li&gt;\n&lt;li&gt;A healthy dose of common sense and proven record of working autonomously. Our environment is dynamic and varied and common sense will guide your decision making&lt;/li&gt;\n&lt;li&gt;Proven ability to adapt to change – we are constantly improving and evolving our ways of working and new technologies. You need a proven background of adapting to change&lt;/li&gt;\n&lt;li&gt;Proven track record of accurately processing and inputting large volumes of data whilst working to deadlines&lt;/li&gt;\n&lt;li&gt;Proven track record of accurately following a process or protocol provided to you whilst inputting information&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The skills you we are looking for you to bring to the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to sustain high concentration levels for prolonged periods of time&lt;/li&gt;\n&lt;li&gt;A proven dedication to maintaining high standards&lt;/li&gt;\n&lt;li&gt;You will be analytical and enjoy working with large volumes of detailed information&lt;/li&gt;\n&lt;li&gt;The ability to follow processes and procedures accurately and efficiently&lt;/li&gt;\n&lt;li&gt;Efficient and accurate keyboard skills&lt;/li&gt;\n&lt;li&gt;Competent in the use of PC based technologies including Microsoft Outlook, Word. Full training will be given for in-house systems. You will also attend several external medical terminology training courses&lt;/li&gt;\n&lt;li&gt;An understanding of the importance of confidentiality in the workplace and able to follow data protection policies and guidelines&lt;/li&gt;\n&lt;li&gt;Great communication skills, face to face, on the phone and via e-mail&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowledge of medical terminology is advantageous&lt;/li&gt;\n&lt;li&gt;A background in Notes Summarising (clinical or non-clinical)&lt;/li&gt;\n&lt;li&gt;Previous experience of SystmOne or EMISWeb clinical systemsJ&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Job title:&lt;/strong&gt;Administrator – Notes Summari&lt;strong&gt;ser&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working hours/contact times&lt;/strong&gt;&lt;strong&gt;:&lt;/strong&gt;37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Monday 8:30 am – 4:30 pm (30 mins unpaid break)&lt;/p&gt;\n&lt;p&gt;Tuesday 8:30 am – 4:30 pm (30 mins unpaid break)&lt;/p&gt;\n&lt;p&gt;Wednesday 8:30 am – 4:30 pm (30 mins unpaid break)&lt;/p&gt;\n&lt;p&gt;Thursday 8:30 am – 4:30 pm (30 mins unpaid break)&lt;/p&gt;\n&lt;p&gt;Friday 8:30 am – 4:30 pm (30 mins unpaid break)&lt;/p&gt;\n&lt;p&gt;Saturday: Non-working day&lt;/p&gt;\n&lt;p&gt;Sunday: Non-working day&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt; £8.72 per hour rising to £8.80 per hour after successful probationary period (pro-rata) + Company pension scheme (Non NHS)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Based at Priory Medical Group, Acomb, Cornlands Road.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection for Interview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Practice recognises that discrimination of any kind is both unlawful and would act as a barrier to finding the most talented individuals for our organisation. As such, our recruitment and selection procedures exist to ensure no job applicant, employee or worker is discriminated against either directly or indirectly on the grounds of age, disability, gender reassignment, marriage and civil partnership, pregnancy or maternity, race, religion or belief, sex or sexual orientation.&lt;/p&gt;\n&lt;p&gt;A great deal of careful consideration has been invested in preparing the advert for this post based on the specification for this role and the person we are looking for. &lt;strong&gt;Our selection for interview process is designed to ensure individuals are selected for interview on the merit of their application only&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;If you are applying through NHS Jobs, you will notice you are asked if you would like a guaranteed interview as part of the ‘Two Tick’ disability scheme. Whilst this is an admirable government initiative, please be aware we are not signed up to this scheme. This is a question on the NHS jobs application form which is outside of our own control. Our own process ensures we consider candidates on the merit of their application only and we do not ask any questions regarding a disability as part of our selection process. We only give candidates the opportunity to share information regarding any disability after candidates are invited to interview and only if the candidate feels they require adjustments in the interview process.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Medical Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York, Acomb", "postalCode": "YO24 3WX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9495", "longitude": "-1.12943"}}, "title": "Notes Summariser Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916105336", "validThrough": "2020-12-08T23:59:59+0000"}