{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-08-25T17:00:17+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic Specialist Occupational Therapist interested in delivering high quality and innovative services to adults within our ADHD Pathway which is part of a larger adult neurodevelopmental Team that also covers adult Autism.This is a temporary post and would make an excellent secondment opportunity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ADHD Pathway provides diagnostic assessments and specialist interventions for people in the Wakefield, Kirklees, and Barnsley localities. The Service base is in Wakefield and clinicians work agile using clinical bases and hot desk facilities across the localities of the Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will hold a relevant professional qualification and registration in the field of Occupational Therapy and will deliver specific occupational therapy assessments and high quality interventions for our service users with ADHD. In addition, the postholder will support young people in transition from children to adult services and work in collaboration with service users and families to develop individualised care plans using the ADHD Outcome Star assessment tool.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will demonstrate a willingness to undergo additional training and a genuine interest in working with adults with ADHD is required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your experience and commitment, we can offer you a friendly working environment, continuous professional development opportunities and support within an experienced specialist Multidisciplinary Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Service for adults with ADHD &amp; Autism has received the prestigious ACOMHS accreditation awarded by the Royal College of Psychiatrists. Such accreditation assures staff, service users and carers, commissioners and regulators of the quality of the Service provided. We are the first Team working with people with adult neurodevelopmental disorders ever to receive it.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Candidates should ensure they are able to demonstrate all essential requirements for the post identified in the person specification and note duties on the job description are as applicable to current requirements of the post and future development of the pathway.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The position is 37.5hrs per week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information/informal queries please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Emma Pell, Team Manager or Professor Marios Adamou, Clinical Lead on 01924 316492&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 5PN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6705", "longitude": "-1.48941"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916161994", "validThrough": "2020-11-19T23:59:59+0000"}