{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "450", "minValue": "375", "unitText": "YEAR", "value": "£375-£450 per session"}}, "datePosted": "2020-08-21T15:32:01+0100", "description": "&lt;p&gt;At Imperial College Healthcare Trust we are absolutely committed to ensuring that our patients have the best possible experience within our hospitals. We are looking for people who are committed to delivering excellent patient care, whatever their role, and who take pride in what they do. We place a high value on treating all patients, customers and colleagues with respect and dignity, and seek people who strive for excellence and innovation in all that they do.&lt;/p&gt;\n&lt;p&gt;We are look for aJAG certified Endoscopist with experience in upper and lower GI endoscopy, who is a registered Nurse on the NMC Register, a registered Allied Health Professional (HCPC), or a GMC registered Medical Practitioner.&lt;/p&gt;\n&lt;p&gt;Main duties&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To undertake diagnostic upper and lower gastrointestinal endoscopy on sedated and non-sedated patients&lt;/li&gt;\n&lt;li&gt;The delivery of highly developed, advanced specialist knowledge including assessment, clinical decision making and prescribing&lt;/li&gt;\n&lt;li&gt;Provide highly specialist advice which contributes to the diagnosis, care or education of patients.&lt;/li&gt;\n&lt;li&gt;To work with supervision from Consultant Gastroenterologists to undertake procedures in accordance with departmental policies.&lt;/li&gt;\n&lt;li&gt;To work in partnership with the multidisciplinary team to ensure that local practice is of the highest standard for current and future patients whilst achieving all national and local targets&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Medical and clinical Endoscopist- supervised", "url": "https://www.jobs.nhs.uk/xi/vacancy/916158407", "validThrough": "2021-03-31T23:59:59+0100"}