{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive hourly rate"}}, "datePosted": "2020-09-14T16:04:12+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Paediatric Nurse (RSCN/RCN) in our Oxford Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Role&lt;/p&gt;\n&lt;p&gt;At Nuffield Health, you will discover nursing as it should be – with more time to care and get to know the children who are your patients as you help them through difficult times. You will also have the flexibility to work shifts that suit your lifestyle. As a Paediatric Nurse you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Play a vital role in the child’s journey through the hospital.&lt;/li&gt;\n&lt;li&gt;Be a trusted guide and support to them as well as to their parents or guardians.&lt;/li&gt;\n&lt;li&gt;Deliver high quality, clinically effective care as an essential part of our ward team.&lt;/li&gt;\n&lt;li&gt;Work with a wide variety of cases which will broaden your skills. You will also work within different specialist areas.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Person&lt;/p&gt;\n&lt;p&gt;To succeed as a Paediatric Nurse you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be NMC qualified and have some post registration experience in a surgical ward environment.&lt;/li&gt;\n&lt;li&gt;Have various levels of post-registration experience – and ideally, ILS or ALS skills.&lt;/li&gt;\n&lt;li&gt;Be dual trained and be confident working in both paediatric and adult care environments.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Benefits&lt;/p&gt;\n&lt;p&gt;Holiday in line with the Working Time Directive.&lt;br /&gt;Access to our Pension Scheme.&lt;br /&gt;Discounted gym membership at £15.00 a month that they need to set up directly with the club. Discount does not extend to partners and family members.&lt;/p&gt;\n&lt;p&gt;Working on the bank means you are not contracted to a set number of hours per week but instead work on an ad-hoc basis to suit the needs of the business and your availability.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Competitive hourly rates&lt;/p&gt;\n&lt;p&gt;Location - Oxford&lt;/p&gt;\n&lt;p&gt;Bank Contract&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they arereceivedand interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications.Thereforeplease apply early to ensure you are considered for the post.&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3 7RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7603", "longitude": "-1.21546"}}, "title": "Paediatric Nurse (RSCN) Bank", "url": "https://www.jobs.nhs.uk/xi/vacancy/916184099", "validThrough": "2021-01-04T23:59:59+0000"}