{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36763", "minValue": "25349", "unitText": "YEAR", "value": "£15.08 PH to £21.87PH"}}, "datePosted": "2020-09-08T16:47:39+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Paediatric Band 5 Bank Nurses&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;University Hospitals Birmingham NHS Foundation Trust&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Division 6 -Women and Children Services&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Are you an experienced Paediatric nurse looking to undertake additional shifts or expand your experience within a different Paediatric unit?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Well this may be the opportunity you are looking for!&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Paediatric Services at University Hospitals Birmingham are seeking to recruit qualified nurses with at least 6 months experience to join their existing bank pool of staff. You must be a passionate, dynamic and forward thinking individual who is keen to help deliver the best in care to our patients and their relatives.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Paediatric teams are able to offer you the flexibility to choose when you work (subject to shift availability) and offer a variety of clinical areas, across different sites. There are a range of shifts available which include long days, twilights, and nights over a 7 day working week.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The children’s service provides general care to a diverse population across two hospital sites. Good Hope Hospital and Heartlands Hospital both have Paediatric Assessment Units, Inpatient beds and Paediatric Emergency Departments. We provide acute medical, surgical, orthopaedic and ENT services to name but a few. We have a designated High Dependency level 2 unit at Heartlands, 3 Outpatient departments and our own community based children’s services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have two neonatal units one which provides level 3 Intensive care unit for extreme premature and sick babies and level 1 special care unit for premature babies of 34 weeks and above. We are level 2 baby friendly accredited and lead cooling centre. We also host a 7 day service Neonatal Community outreach team which also runs an ex-preterm baby family social group and a transitional care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We strive to provide safe, high quality care to all of our children and work in close partnership with our families to achieve the most positive outcome for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If a temporary post at University Hospitals Birmingham appeals to you or to find out further information please contact&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Amee Denyer- Smith or Emma Tonks Senior Practice Educators (Paediatrics) on 0121 424 2176&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Adult nurses who do not hold a child branch qualification need not apply.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Bank Paediatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916177367", "validThrough": "2021-03-08T23:59:59+0000"}