{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24000", "minValue": "24000", "unitText": "YEAR", "value": "24000"}}, "datePosted": "2020-09-08T08:53:14+0100", "description": "&lt;p&gt;&lt;strong&gt;This is a full-time position of 37.5 hours per week Monday-Friday based in Erith (South-East London) paying £24,000&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The CHIS (Child Health Information Service) department stores health data for all children 0-19 on a specialised database to ensure children and young adults are offered vital immunisations and health screening. This information follows a child wherever they live in the UK. Our CHIS programme manages records for children as they move into or out of South-East London.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;So what will you do?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will manage a team of CHIS administrators and failsafe officers to deliver the service to the best possible standard and ensure administrators deliver an accurate and up to date set of child health records for every child in the relevant area.&lt;/p&gt;\n&lt;p&gt;The post holder will have day to day responsibility for the provision of administrative support of the Healthy Child Programme and will be able to communicate effectively with their team, their colleagues and a range of healthcare professionals.&lt;/p&gt;\n&lt;p&gt;You’ll also be required to work on their own initiative and manage their team efficiently, ensuring key targets are met and workloads effectively managed. The post-holder will support their team leader colleagues with backlogs if necessary and support the Data Quality Manager in the investigation of issues&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Duties&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To monitor workload on an ongoing basis and make decisions around prioritisation of work within available resources to meet service standards&lt;/li&gt;\n&lt;li&gt;To ensure the line management arrangements are clear and to effect change in the team to respond to the changing requirements for Child Health&lt;/li&gt;\n&lt;li&gt;Ensure staff are trained to a competent level in all aspects of the Child Health System and have appropriate training to enable them to deal with queries from key stakeholders&lt;/li&gt;\n&lt;li&gt;To manage CHIS Administrators and failsafe officers in line with Health Intelligence HR polices, ensuring that there are standards set for acceptable working practices and a customer focused service&lt;/li&gt;\n&lt;li&gt;Ensure the correct application of HR policies and procedures for staff including recruitment, induction, disciplinary and sickness absence monitoring&lt;/li&gt;\n&lt;li&gt;Ensure all staff have an annual PDR with specific objectives and effective personal development plans. Identify issues of performance and capability ensuring support mechanisms are put in place to provide assurance on the performance of staff&lt;/li&gt;\n&lt;li&gt;The post holder will ensure the Operational Deputy Head of Service is fully aware of any potential staffing issues, incidents or performance problems as soon as these become apparent&lt;/li&gt;\n&lt;li&gt;To continually review and assess operational performance and instigate measures to improve efficiency and effectiveness in order to identify areas for improvement which will provide a better quality of service, developing plans for implementation and reporting progress to the Operational Head of Service and Operational Deputy Head of Service&lt;/li&gt;\n&lt;li&gt;Work closely with the other team leaders to ensure the smooth running of the service and effective distribution of activities to optimise the efficiency of the whole service at all times&lt;/li&gt;\n&lt;li&gt;Liaise with GP practices, maternity units and other health care professionals to resolve any issues team members are unable to resolve&lt;/li&gt;\n&lt;li&gt;The post holder will liaise with the Operational Deputy Head of Service to ensure appropriate action is taken by the team to support Public Health England and NHS England in the event of a mass outbreak&lt;/li&gt;\n&lt;li&gt;Lead on the implementation of new CHIS IT system releases, carrying out a gap analysis, testing in a training environment and then ensuring all team members are aware of changes and trained accordingly&lt;/li&gt;\n&lt;li&gt;To prepare reports for contract meetings, stakeholder meetings and MDT meetings as required&lt;/li&gt;\n&lt;li&gt;To attend contract meetings, stakeholder meetings and MDT meetings as required&lt;/li&gt;\n&lt;li&gt;Lead on the completion of all audits required by the Data Quality Manager&lt;/li&gt;\n&lt;li&gt;To document all complaints and compliments received including outcomes and actions taken&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you will need to succeed in this role&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Educated to GCSE Level in Maths and English&lt;/li&gt;\n&lt;li&gt;Excellent written and verbal communication skills&lt;/li&gt;\n&lt;li&gt;Effective listener and numerate&lt;/li&gt;\n&lt;li&gt;Organisational and training skills&lt;/li&gt;\n&lt;li&gt;Able to organise self and teams and prioritisation of workloads&lt;/li&gt;\n&lt;li&gt;Previous supervisory/management experience would be beneficial&lt;/li&gt;\n&lt;li&gt;Experience of working within a regulated organisation&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Intelligence Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Erith", "postalCode": "DA1"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4469", "longitude": ".206297"}}, "title": "Child Health Information Services Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916175681", "validThrough": "2020-11-23T23:59:59+0000"}