{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-08-20T10:16:44+0100", "description": "&lt;p&gt;Applications are invited for 2 full-time (10PAs + 1 additional programmed activity) Consultant Psychiatrists to join Moss House Community Mental Health Teams for adult of working age.&lt;/p&gt;\n&lt;p&gt;If successful in your application for this replacement full time post (10 PAs), you will join a dynamic and dedicated multi-disciplinary team delivering high quality assessment and treatment of for adults with psychosis and other severe mental illnesses referred from linked general practices from the South Liverpool area, which includes some areas of the City that are affluent but other areas that include amongst its population areas of high mini scores reflecting higher levels of deprivation. The service at Moss House has however for many years successfully delivered flexible, service user focused care.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to be joining adult mental health services with the implementation of a new clinical model that is already yielding improvements in care throughout the pathway, supported by more effective team working with primary care and adult inpatient acute care colleagues.&lt;/p&gt;\n&lt;p&gt;Mersey Care is an innovative well led Trust, with an aspiration of Perfect Care for all of its service users, delivered through a supportive “Just Culture” environment for staff. For Consultant Psychiatrists it offers excellent opportunities for professional development, research and medical management roles. As a Global Digital Exemplar Mersey Care is developing digital applications to support the implementation of its &#39;Zero Suicide Policy&#39; and the use of predictive analytics in mental health which will assist clinicians with their decision making and risk prioritisation.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from applicants with a passion for supporting colleagues with their professional expertise and leadership qualities, and making contributions to service developments in the field of Adult Psychiatry.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Kauser Tabani&lt;/p&gt;\n&lt;p&gt;Kauser.Tabani@merseycare.nhs.uk&lt;/p&gt;\n&lt;p&gt;0151 330 8704&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moss House, Garston, Liverpool", "postalCode": "L19 2NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3556", "longitude": "-2.90016"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916155834", "validThrough": "2020-11-10T23:59:59+0000"}