{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "140000", "minValue": "140000", "unitText": "YEAR", "value": "140000 + Up to £18K Bonus"}}, "datePosted": "2020-09-14T12:54:26+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;Join the team at Wellesley Hospital and enjoy a caseload of up to 20 service users, where all are detained under the Mental Health Act. You will be supported by a full multidisciplinary team in a hospital that has regular visiting GPs and a primary care team. &lt;/span&gt;&lt;br /&gt;&lt;br /&gt;&lt;span&gt;The New Care Model programme delivered at Wellesley Hospital brings excellent opportunities for partnership working with peers across the region to evolve secure services in the South west and there are both internal and external CPD arrangements.&lt;/span&gt;&lt;br /&gt;&lt;br /&gt;&lt;span&gt;Wellesley Hospital is a modern, purpose-built facility providing secure services for males and females in partnership with neighbouring NHS organisations as part of the South West region New Care Models programme.&lt;/span&gt;&lt;br /&gt;&lt;br /&gt;&lt;span&gt;The hospital has expanded its secure service provision for women with a plan to move towards an innovative needs-led security approach and we seek a Consultant Forensic Psychiatrist to join our team and help shape the future of this exciting new service.&lt;/span&gt;&lt;br /&gt;&lt;br /&gt;&lt;span&gt;Wellesley Hospital is situated on the Somerset/Devon border, ideally placed for rural living with proximity to the coast and several areas of outstanding natural beauty but also close enough to the urban centres of Taunton, Exeter and Bristol which provide national rail services to London. There are several good public and independent primary and secondary schools nearby.&lt;/span&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Benefits&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;25 days annual leave plus bank holidays and your birthday off.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;£8,000 Car&lt;/span&gt;&lt;span&gt;allowance&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Highly competitive salary&lt;br /&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;A Group Personal Pension Plan (GPPP) and pension contribution&lt;br /&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Life Assurance&lt;br /&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Enhanced Maternity Package&lt;br /&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Free meals while on duty&lt;br /&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Employee Assistance Services&lt;br /&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Continuous learning and development&lt;br /&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Wellbeing support and activities&lt;br /&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Voluntary benefits&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;br /&gt;&lt;br /&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person&#39;s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/span&gt; &lt;span&gt;&lt;br /&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;br /&gt;&lt;br /&gt;Every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington, Somerset", "postalCode": "TA21 9FF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.979", "longitude": "-3.20562"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916183466", "validThrough": "2020-11-29T23:59:59+0000"}