{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 Per An"}}, "datePosted": "2020-08-24T11:49:28+0100", "description": "&lt;p&gt;Within the Directorate of Medicine Older People we have Ward C11 which is an acute fast paced 22 bedded medical ward, predominantly, but not exclusively for the elderly. The medical conditions of the patients are many and varied, and as such this would be an ideal opportunity for either a newly qualified band 5, or one looking for a change of area, to further develop knowledge and increase their skill base.&lt;/p&gt;\n&lt;p&gt;The ward team is well established and keen to support new staff; we have a proven track record in this area. The Medicine for Older People Directorate have recently appointed practice educators, who are keen to help staff develop, this would be an ideal time to join the team as support and learning opportunities are readily available.&lt;/p&gt;\n&lt;p&gt;C11 has been involved in the Nurse Associate assessment process and has just appointed a member of staff who has successfully completed the training. C11 is also one of the first wards to be involved in the CLIP student nurse training, and fully supports the trust preceptorship programme for newly qualified staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dear Potential Applicant,&lt;/p&gt;\n&lt;p&gt;It is important you are made aware of the changes which East Lancashire Hospitals NHS Trust has implemented with regard to charging for the cost of undertaking Disclosure and Barring Scheme (DBS) Checks (previously known as Criminal Records Bureau or CRB) and how this may impact upon you.&lt;/p&gt;\n&lt;p&gt;As this position is exempted from the Rehabilitation of Offenders Act 1974 and involves work that is identified as a regulated activity as defined in the Safeguarding Vulnerable Groups Act (2006), any offer of employment is provisional upon a satisfactory DBS check being obtained.&lt;/p&gt;\n&lt;p&gt;The cost of an Enhanced Disclosure will be £44.00, which includes a small handling fee.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In line with other NHS organisations in the North West Region, the Trust is now passing the charge for undertaking a DBS check on to candidates in the event they are successfully appointed into the post for which they have applied. Candidates can choose whether to pay this over 1-3 months as a deduction from the monthly salary. By applying for this vacancy you are agreeing to this undertaking in the event you are successfully appointed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please contact -Mehjabeen Bagas - Mehjabeen.Bagas@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Blackburn Hospital, Haslingden Road, Blackburn BB2 3HH, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Staff Nurse Ward C11", "url": "https://www.jobs.nhs.uk/xi/vacancy/916159474", "validThrough": "2020-11-06T23:59:59+0000"}