{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "41280", "minValue": "41280", "unitText": "YEAR", "value": "£41280.05"}}, "datePosted": "2020-09-14T09:25:21+0100", "description": "&lt;p&gt;Priory Hospital Arnold comprises 2 Acute Adult Mental Health wards and 2 PICU&#39;s which are provided in partnership with Nottinghamshire Healthcare NHS Trust. &lt;/p&gt;\n&lt;p&gt;The post holder will work with the Director of Nursing to promote a culture that fosters staff involvement and a progressive attitude to service improvement. The successful applicant will take operational and clinical day to day management responsibility of a ward, using quality monitoring and performance management systems to ensure the effective delivery of contract activity and quality to the required standards. The post holder will ensure that the care provided respects equality and diversity and is supportive of service users and their carers, - agreeing the best approach to meeting individuals’ needs.&lt;/p&gt;\n&lt;p&gt;We want:&lt;/p&gt;\n&lt;p&gt;•           Caring and creative individuals who have a positive approach to work and a strong multi-disciplinary team-working ethic.&lt;/p&gt;\n&lt;p&gt;•           Candidates who are experienced in the provision of safe and professional care; have a good awareness of risk management and an in-depth knowledge of the Mental Health Act.&lt;/p&gt;\n&lt;p&gt;•           Candidates with excellent communication skills and attention to detail in clinical documentation and all correspondence.&lt;/p&gt;\n&lt;p&gt;What we are offering:&lt;/p&gt;\n&lt;p&gt;•           A supportive working environment with plenty of opportunities to learn and grow both personally and professionally.&lt;/p&gt;\n&lt;p&gt;•           An opportunity to teach and mentor junior staff and students and to receive training and development in response to your own professional needs&lt;/p&gt;\n&lt;p&gt;•           An opportunity to influence and develop an outstanding PICU service and care pathway.&lt;/p&gt;\n&lt;p&gt;•           Registered Mental Health Nurse (RMN) with an active, NMC PIN Registration.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ARNOLD", "postalCode": "NG5 8PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0314", "longitude": "-1.11149"}}, "title": "WARD MANAGER", "url": "https://www.jobs.nhs.uk/xi/vacancy/916182782", "validThrough": "2020-11-27T23:59:59+0000"}