{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23248", "minValue": "23248", "unitText": "YEAR", "value": "£13.83 per hour"}}, "datePosted": "2020-09-21T11:31:11+0100", "description": "&lt;p&gt;&lt;span&gt;Call out to all &lt;span&gt;experienced Emergency Department nurses - come and join our Emergency Department nurse bank. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are a number of shifts for Band 5 experienced Staff Nurses within our Neonatal Intensive Care Unit. This is a fantastic opportunity if you are looking to work for an organization which values its employees. We are seeking dynamic, enthusiastic and motivated nurses to join our friendly, well established and experienced team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;he unit is comprised of 28 cots – providing intensive, high dependency and special care for babies in the Preston and South Ribble area as well as premature and sick babies from other parts of the Lancashire and South Cumbria region. The Unit offers therapies such as cooling, high frequency oscillation and nitric. In addition, we have a Neonatal Outreach team and dedicated research nurses all working collaboratively within the organisation to provide a seamless service that addresses the needs of neonates through to childhood.&lt;br /&gt;Applicants must have a commitment to delivering high quality, safe care in partnership with families. As a member of our friendly and professional team you will be reliable, flexible and motivated. You will be active in fostering a positive working environment which allows staff to show initiative and thrive.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We recognise you are invaluable to us and in return for your hard work and professionalism &lt;/span&gt; to help us deliver high levels of care we can offer you the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Weekly Pay&lt;/li&gt;\n&lt;li&gt;Self booking in place via app or pc which allows you to book shifts at your own leisure 24/7. Choose the shifts you want that fit with your work life balance.&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities which allows you to work shifts around your availability in a variety of areas to develop your knowledge and experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We recognise our staff are our biggest asset, investing in them is key to ensure LTH remains a rewarding place to work.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Do you need a better work/life balance?&lt;/li&gt;\n&lt;li&gt;Do you want to keep up your professional skills?&lt;/li&gt;\n&lt;li&gt;Would you like to gain experience in new areas?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;The Trust is committed to personal and professional development and to providing opportunities for education and training for all our staff. Our clinical divisions are regularly holding free CPD events throughout the year which would be accessible to you.&lt;br /&gt;&lt;br /&gt;We constantly strive for excellence, delivering hig&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hosptial, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Bank Staff Nurse - Neonatal", "url": "https://www.jobs.nhs.uk/xi/vacancy/916192781", "validThrough": "2020-11-30T23:59:59+0000"}