{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27000", "minValue": "25000", "unitText": "YEAR", "value": "£25,000pa -£27,000pa"}}, "datePosted": "2020-08-20T15:39:10+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you a confident Occupational Therapist who would like to explore a more rewarding managerial and clinical challenge in High Dependency Rehabilitation Mental Health Services? Are you ready to further develop your managerial and clinical skills? We want to recruit an exceptional OT to this Band 5 post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post:&lt;/strong&gt; (Band 5 Equivalent) Occupational Therapist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base:&lt;/strong&gt; Kingswood Ward (Male High Dependency Rehabilitation) 16 beds.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible for:&lt;/strong&gt; The post holder will deliver clinical care for 1 ward (with 2 part time OT assistants as support). Supervision of part time OT assistants.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible to:&lt;/strong&gt; Head OT at Cygnet Hospital Maidstone&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;40 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Cygnet Maidstone, Gidds Pond Way, off Newnham Court Way, Weavering, Maidstone, Kent ME14 5FT&lt;/p&gt;\n&lt;p&gt;Join our supportive friendly team near the county town of Maidstone and make an application today.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role please contact Neil Barker Head OT NeilBarker@cygnethealth.co.uk or our in house recruiter Hayleyvalentine@cygnethealth.co.uk&lt;/p&gt;\n&lt;p&gt;With over 150 OTs in the company, we also work together as a large team providing support to each other across the group, with various specialist interest groups to tap into, including Mental Health, Neuropsychiatry, Autism, Learning Disabilities and Sensory Integration, to name a few.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Overview of site/Ward:&lt;/strong&gt; Kingswood is Cygnet Hospital Maidstone’s High Dependency Rehabilitation service for men. Kingswood supports men with a history of Paranoid Schizophrenia, Drug-Induced Psychosis and Bi-Polar Disorder. You do not need experience in Rehabilitation services; however a willingness to learn new skills.&lt;/p&gt;\n&lt;p&gt;As an Occupational Therapist, you will provide direct clinical care which will encompass OT assessments, treatment and management of patients within the service.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; In this role you will assess, implement and develop an OT treatment programme according to service user’s diagnosis and identified needs. This will be based upon findings from assessments including associated risks, in order to develop treatment plans accordingly.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;5 reasons why you should make an application today…&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;We care about people in our services&lt;/li&gt;\n&lt;li&gt;Career pathway progression within the company to support your development and skills&lt;/li&gt;\n&lt;li&gt;You will be a part of a large service at Maidstone comprising of 4 different wards and a wide range of experience to draw from within the OT team.&lt;/li&gt;\n&lt;li&gt;National networks of over 150 OTs in the Cygnet Group within different specialisms including Forensic Practice, LD and ASD, Acute mental health, PICU, and inpatient CAMHS&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Successful Candidate should be/have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A registered Occupational Therapist with the HCPC (Health Care Professions Council)&lt;/li&gt;\n&lt;li&gt;Experience in the field of adult mental health&lt;/li&gt;\n&lt;li&gt;An understanding of Occupational Therapy process/interventions and can take a “hands on” approach&lt;/li&gt;\n&lt;li&gt;Excellent communication and time management skills&lt;/li&gt;\n&lt;li&gt;Passionate about student education&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;I&lt;/strong&gt;&lt;strong&gt;n return we will offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary £25000 – £27000, depending on experience&lt;/li&gt;\n&lt;li&gt;Opportunities for CPD and to undertake further learning and development. For example: MOHOST training, Recovery&lt;/li&gt;\n&lt;li&gt;Through Activity&lt;/li&gt;\n&lt;li&gt;Training days provided by highly experienced and renowned OT specialists&lt;/li&gt;\n&lt;li&gt;Expert on site clinical supervision and peer support&lt;/li&gt;\n&lt;li&gt;Bi-monthly OT CPD meetings focused on skill and strategic service development.&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;NHS Discount Cards &amp; Blue Light Card&lt;/li&gt;\n&lt;li&gt;Free parking &amp; meals on duty&lt;/li&gt;\n&lt;li&gt;Relocation packages offered&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;br /&gt; The successful candidate will be required to undergo an enhanced DBS and reference check and an offer of employment will be subject to successful clearance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*Please note - speculative recruitment emails are not to be sent directly to our clinical staff, these need to go via our internal recruitment team. If speculative candidates are sent directly to a member of the clinical team, we will consider these candidates as our own*&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gidds Pond Way, Weavering, Maidstone", "postalCode": "ME14"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2957", "longitude": ".562727"}}, "title": "Band 5 Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916156786", "validThrough": "2020-11-27T23:59:59+0000"}