{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-09-17T09:31:11+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;So, you’re eager to learn more about orthopaedic nursing opportunities at North Bristol NHS Trust. Here are some of the reasons we’re unique…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The Avon Orthopaedic Centre is one of the largest orthopaedic centres in the South West and has an international reputation for hip and knee surgery, carrying out 1,000 knee replacements a year. It is one of the best known foot and ankle services in Europe, giving our nurses the chance to care for patients with complex or uncommon presentations.&lt;/li&gt;\n&lt;li&gt;Our orthopaedic department also provides an extensive trauma injury service working alongside expert plastic surgical and neurosurgical units within our Trust.&lt;/li&gt;\n&lt;li&gt;We have an integrated and highly experienced team for hip fractures, including specialist services in lower limb reconstruction, spinal surgery and upper limb reconstruction.&lt;/li&gt;\n&lt;li&gt;With 745 members of staff, we provide an extensive joint replacement service for both routine and complex joint replacements, in particular revision arthroplasty hips, knees, ankles and shoulders as well as upper limb surgery.&lt;/li&gt;\n&lt;li&gt;Our nurses are supported to progress their career within the division. Within our bespoke rotations, nurses can move across the division or across the trust, and experienced nurses have the opportunity to complete University accredited specialist courses.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;But it’s not just our nursing teams which are impressive; our trust itself is pioneering in its approach to healthcare. Let us tell you a little more about it…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our health and well-being initiatives, devised by our dedicated staff wellbeing team, encompass lifestyle support, physical support and psychological support, and have been nationally recognised by REBA.&lt;/li&gt;\n&lt;li&gt;We value staff feedback; in the results of our 2019 staff survey, our response rate was &lt;strong&gt;higher than the national average &lt;/strong&gt;and highlighted we had improved in all the areas staff told us were priorities in 2018. Out of the 90 questions asked, we had made 73 improvements from the previous year and 69% of staff would recommend our organisation as a place to work (6% better than the national average).&lt;/li&gt;\n&lt;li&gt;Our staff don’t shy away from a challenge in aid of Southmead Hospital Charity. They cycle, run, row and race in aid of a fantastic cause, or sing in our staff choir and compete in ‘Southmead Does Strictly’.&lt;/li&gt;\n&lt;li&gt;We’re committed to supporting staff on their career journey with us offering personalised training packages and bespoke specialty rotations.&lt;/li&gt;\n&lt;li&gt;Staff are consulted on equity issues across the trust within their staff equality and development groups, with mentoring and support to succeed. Our trust is supporting the development of Bristol’s LGBT+ manifesto and a case study of good practice has been reported to NHS England in response to a government review of public services and Trans people.&lt;/li&gt;\n&lt;li&gt;Our clinical environment is award-winning in its approach to healthcare design; each patient room has a view, many of which are naturally ventilated and 75% of rooms in our Brunel Building are single and en-suite. With nurses in mind, our clinical spine carefully separates staff and patient areas, with a generous staff canteen extending out to a rooftop terrace.&lt;/li&gt;\n&lt;li&gt;Bristol is consistently voted the best place to live in the UK, with vibrant local music, arts and gastronomic scenes, a wide range of modern and state of the art shopping, recreation and leisure facilities, a wealth of great local family days out, fantastic transport links for local, national and internal holidays, and it has a rich history. If you prefer country, village or smaller town living, NBT is also easily commutable from a range of attractive locations in North Somerset, South Gloucestershire and South Wales (e.g. Portishead, Chepstow)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Right, that’s enough about us… let’s focus on you. Are you…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An experienced registered nurse working in the hospital setting, eager for your next career move?&lt;/li&gt;\n&lt;li&gt;An experienced registered nurse working in a non-acute setting (i.e. nursing home etc) looking for a supportive environment to make the transition into acute care?&lt;/li&gt;\n&lt;li&gt;A newly qualified nurse ready to take the leap from theory to the clinical setting, supported by a structure preceptorship and inspirational team?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;So, are we right for each other? Here are your next steps…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Submit your application via this advert&lt;/li&gt;\n&lt;li&gt;Book a place at our engagement events to tour Southmead Hospital, meet the teams you could be working with, and understand the trust’s approach to patient care.&lt;/li&gt;\n&lt;li&gt;Follow us on social media to join in the conversation and gain an insight into (search @NBTNursing on Twitter, Facebook, LinkedIn and Instagram)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Looking for Flexible Working options? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contact NurseAvailability@nbt.nhs.uk to find out about joining NBTeXtra&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email:&lt;/strong&gt; Nursing@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Number:&lt;/strong&gt; 01174 144 550&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Registered Nurse - Orthopaedics - Experienced and Newly Qualifying Nu", "url": "https://www.jobs.nhs.uk/xi/vacancy/916188519", "validThrough": "2020-11-12T23:59:59+0000"}