{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Negotiable"}}, "datePosted": "2020-09-21T14:32:34+0100", "description": "&lt;p&gt;This is an exciting opportunity for a full-time or part-time Mental Health Nurse to work within a PCN in North Norfolk. The practices in the PCN are looking for experienced, motivated and reliable Mental Health Nurses to work closely with a practice team, providing and maintaining high standards of care for patients with mental health needs.&lt;/p&gt;\n&lt;p&gt;Main duties of the job&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a Mental Health Nurse who will be an integral part of a General Practice team, working within one or split between two practices from NN2, a Primary Care Network. The post holder will also have the opportunity to work as part of a wider multidisciplinary team. As part of this multi-disciplinary team the post holder will work in a patient facing role to clinically assess and treat patients using expert knowledge of mental health, as well as providing assistance and advice to the GPs and other members of the primary healthcare team in managing the mental wellbeing of the practice population. You will need to have the ability to influence and communicate effectively with clinical colleagues, patients and support staff.&lt;/p&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;North Norfolk Primary Care (NNPC) is a Primary Care provider based in North Norfolk, owned by 19 general practices. We have a very cohesive working relationship with our 19 practices and we now have a fantastic opportunity for Mental Health Nurses to work within one of our Primary Care Networks (PCN’s), NN2.&lt;/p&gt;\n&lt;p&gt;NN2 is a PCN of five practice based in North Norfolk; Aldborough Surgery, Birchwood Surgery, Cromer Group Practice, Paston Surgery and Mundesley Medical Centre. All of these practices have diverse clinical teams and a strong motivation to provide the highest quality patient care.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Social Enterprises", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130655"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norwich", "postalCode": "NR6 6BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6675", "longitude": "1.27475"}}, "title": "PCN Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916193429", "validThrough": "2020-11-09T23:59:59+0000"}