{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6"}}, "datePosted": "2020-08-20T15:13:59+0100", "description": "&lt;p&gt;We are recruiting Bank Band 6 Speech and Language Therapists to join our innovative and well supported team working across Leicester, Leicestershire and Rutland.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The team is very supportive and inclusive. We have regular meetings and can support your CPD through a variety of activities and team days aimed at sharing best practice and learning. It’s a great environment to develop your career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The full Job and person specifications are attached to this advert, but key elements for the role include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide effective caseload management for identified caseloads&lt;/li&gt;\n&lt;li&gt;Provide assessment, diagnosis and intervention approaches for children with speech, language and communication needs.&lt;/li&gt;\n&lt;li&gt;Work in collaboration with health and education colleagues to support children’s needs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will need to demonstrate knowledge and application of evidence based practice and be able to prioritise caseloads using your acquired clinical and assessment skills.&lt;/p&gt;\n&lt;p&gt;A qualification in post-grad Paediatric Dysphagia will be looked upon favourably.&lt;/p&gt;\n&lt;p&gt;As the role requires travel to various sites, you will need to have a full driving licence and access to a vehicle.&lt;/p&gt;\n&lt;p&gt;Want to find out more? Please call Liz Jackson on 0116 295 5256&lt;/p&gt;\n&lt;p&gt;We recognise the need to develop modern working practices to enable employees to maximise their performance and productivity whilst maintaining a good work life balance. To this aim the Trust has adopted an Agile working methodology as outlined within the Trust Agile working Policy.&lt;/p&gt;\n&lt;p&gt;The post advertised falls under the Trust’s Agile working methodology, so if successful you will be appointed as an Agile Worker, and will need to work to the Trusts Agile working policy. Talk to the recruiting manager about what this means in practice for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester/Leicestershire/Rutland", "postalCode": "LE5 0TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6496", "longitude": "-1.0886"}}, "title": "Bank Band 6 Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916156699", "validThrough": "2020-12-31T23:59:59+0000"}