{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36000", "minValue": "28047", "unitText": "YEAR", "value": "Up to £36,000 inc unsocial hours (£28,047 basic)"}}, "datePosted": "2020-08-26T12:52:33+0100", "description": "&lt;p&gt;Are you looking to provide holistic, family-centred, quality care? Are you an RNC or RNA/RNLD with paediatric experience looking to work on a one to one care basis and build your experience in palliative and end of life care? We are recruiting for a Band 5 Nurse to be part of our Care team at our peaceful, woodland hospice.&lt;/p&gt;\n&lt;p&gt;This is a wonderful opportunity to deliver care to a range of children and young people with a variety of complex health conditions. As well as providing clinical care, you will also develop play and recreational activities and participate in outings to provide appropriate stimulation to the children in your care. We will support you in your learning and development and there is the potential to develop your clinical skills in areas such as tracheostomy care and long-term ventilation.&lt;/p&gt;\n&lt;p&gt;We’re looking for someone who is empathetic and resilient, can work under pressure, and can communicate sensitively with our families and colleagues. The ability to work with families from a variety of different cultural backgrounds is essential. You’ll be a good-team player and able to be flexible in your approach to work. You’ll have clinical skills in enteral feeding and seizure management and be IV competent. You’ll also be computer literate with good written English and a keen eye for detail.&lt;/p&gt;\n&lt;p&gt;Please click apply to complete the application form and to send us your supporting statement outlining why you would suit the role and would love to work with us.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130176.png", "name": "Richard House Children's Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130176"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East London", "postalCode": "E16 3RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.51", "longitude": ".042405"}}, "title": "Band 5 Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916162903", "validThrough": "2020-11-30T23:59:59+0000"}