{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive hourly rate"}}, "datePosted": "2020-08-19T09:19:48+0100", "description": "&lt;p&gt;Ipswich – Sue Ryder The Chantry&lt;br /&gt;We are calling on Registered Nurses to come and join our professional and friendly Bank team to ensure our residents meet their full potential and enjoy a high quality of life. Everyone that joins our talent bank is chosen because they’re highly professional, passionate and dedicated to providing expert and compassionate care to our residents.&lt;/p&gt;\n&lt;p&gt;About Us:&lt;/p&gt;\n&lt;p&gt;Sue Ryder supports people through the most difficult times of their lives. Whether that’s a terminal illness, the loss of a loved one or a neurological condition – we’re there when it matters. Our doctors, nurses and carers give people the compassion and expert care they need to help them live the best life they possibly can.&lt;/p&gt;\n&lt;p&gt;The Chantry is a Sue Ryder specialist neurological care centre based in Ipswich, caring for people aged 18 and over with a range of neurological conditions. At The Chantry, we provide the care people need to optimise their health and wellbeing, maximise their independence and support their emotional and social needs.&lt;/p&gt;\n&lt;p&gt;Your Benefits:&lt;/p&gt;\n&lt;p&gt;- Company pension scheme&lt;br /&gt;- Continuation of NHS pension&lt;br /&gt;- Corporate discount with hundreds of retailers and services&lt;br /&gt;- Staff discount of 15% on new goods online at shop.sueryder.org&lt;br /&gt;- Cash referral bonus scheme&lt;br /&gt;- Salary sacrifice car scheme&lt;br /&gt;- Online Wellbeing Centre&lt;br /&gt;- Free Will writing service&lt;br /&gt;- Staff finance loans&lt;br /&gt;- Free onsite parking&lt;br /&gt;- Free uniform&lt;br /&gt;- Subsidised onsite meals and drinks&lt;br /&gt;- Structured induction programme and learning and development opportunities&lt;/p&gt;\n&lt;p&gt;Your Role:&lt;/p&gt;\n&lt;p&gt;As a Registered Nurse, you will:&lt;/p&gt;\n&lt;p&gt;- Assess, plan, implement and evaluate individualised care using evidence-based guidelines &lt;br /&gt;- Maintain high standards of care delivery by working collaboratively within regulatory body standards and the Sue Ryder Quality Governance Policy &lt;br /&gt;- Provide support, leadership appraisal and supervision to team members as appropriate &lt;br /&gt;- Act as an ambassador of Sue Ryder to service users and their relatives, colleagues and members of the public&lt;/p&gt;\n&lt;p&gt;About You:&lt;/p&gt;\n&lt;p&gt;To join our team, you’ll need:&lt;/p&gt;\n&lt;p&gt;- To be an NMC registered nurse, ideally with post-registration experience in palliative end of life care &lt;br /&gt;- A compassionate and people-centred approach &lt;br /&gt;- Excellent communication skills&lt;/p&gt;\n&lt;p&gt;The Chantry is set in a beautiful grade 2 listed building in Chantry Park, Ipswich. There are several Local buses that stop within walking distance of The Chantry.&lt;/p&gt;\n&lt;p&gt;Other organisations may call this role Registered Nurse, Staff Nurse, RGN, Registered General Nurse, Nurse, Nurse Practitioner, Palliative Care Nurse or Senior Nurse.&lt;/p&gt;\n&lt;p&gt;It takes a special sort of person to join our team so if you could see yourself as one of our Registered Nurses, please apply via the button shown.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich", "postalCode": "IP2 0BP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0541", "longitude": "1.11742"}}, "title": "Registered Nurses - Bank", "url": "https://www.jobs.nhs.uk/xi/vacancy/916154071", "validThrough": "2021-01-04T23:59:59+0000"}