{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30906", "minValue": "30906", "unitText": "YEAR", "value": "£30,906"}}, "datePosted": "2020-09-14T15:22:18+0100", "description": "&lt;p&gt;Are you an experienced Nurse with experience from the NHS or private care? If so, join the team at Victoria Gardens in Huyton as a Practice Nurse and change lives for the better. &lt;/p&gt;\n&lt;p&gt;Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society. &lt;/p&gt;\n&lt;p&gt;It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Practice Nurse, you will support people with mental health conditions and/or personality disorders to build a brighter future, while also supporting your colleagues and promoting good teamwork.&lt;/p&gt;\n&lt;p&gt;Working alongside Victoria Gardens, you will support and encourage service users to maintain and develop their physical health through guidance and empowering recovery.&lt;/p&gt;\n&lt;p&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine.  &lt;/p&gt;\n&lt;p&gt;You will have access to the Elysium Wellbeing team, which is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/p&gt;\n&lt;p&gt;There are also career development opportunities, with a huge range of courses that will help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Take the lead in developing best practice and provide clinical advice to ward based staff on peoples physical health related concerns.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Establish and implement an annual physical and full medical screening for all service users&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Establish and implement a screening process, taking bloods where necessary, to meet the mandatory testing requirements for prescribed medication.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide a programme of health promotion activity&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Liaise and co-ordinate our visiting GP service.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Supervision of junior staff.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Basic risk assessment&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful as Practice Nurse, you’ll need&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;RGN experience &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Evidence of clinical practice development&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Demonstrates effective verbal/written communication skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: Victoria Road, Huyton, Liverpool, L36 5SA&lt;/p&gt;\n&lt;p&gt;You will be working at Victoria Gardens, a specialist locked rehabilitation for people with complex mental health needs and behaviours that challenge, as well as a ward for older females. You will support the service to equip service users with the skills required for community living and increased independence.&lt;/p&gt;\n&lt;p&gt;The service is a recovery-based service and incorporates elements of the Good Lives Model, supported by individualised interventions. You will work as part of the multidisciplinary team which includes Nursing, Consultant Psychiatrist, Psychologist, Occupational Therapist and Social Worker support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;• Annual salary of £30,906&lt;/p&gt;\n&lt;p&gt;• The equivalent of 33 days annual leave pro rata – plus your birthday off!&lt;br /&gt; • Free meals and parking&lt;br /&gt; • Wellbeing support and activities&lt;br /&gt; • Career development and training&lt;br /&gt; • Pension contribution&lt;br /&gt; • Life Assurance&lt;br /&gt; • Enhanced Maternity Package&lt;br /&gt; • Flexible working opportunities&lt;/p&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.  &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huyton", "postalCode": "L36 5SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4109", "longitude": "-2.83511"}}, "title": "Practice Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916183943", "validThrough": "2020-11-30T23:59:59+0000"}