{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata for part time"}}, "datePosted": "2020-09-24T12:04:29+0100", "description": "&lt;p&gt;We are seeking to recruit 1.4 Clinical Psychologists to provide a clinical psychology service to children and their families referred to the Neurodisability and Neurology teams at Ryegate Childrens Centre which is part of Sheffield Children’s Hospital. The person appointed will provide assessment and treatment to children, as well as advice and consultation to professional colleagues. &lt;strong&gt;&lt;em&gt;We welcome applications from both current trainees who are due to qualify in the next year and more experienced Band 7s who may be looking for a new challenge.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for candidates with specialist interest and experience of working with children with neurodevelopmental and/or neurological difficulties and their families. Experience of working within a specialist Neurodisability team (particularly Autism Spectrum Disorders) and/or neuropsychological service would be advantageous&lt;strong&gt;. &lt;em&gt;The duties of the post will vary according to service demand but we are interested in candidate’s individual preferences with regards to whether they would wish to work in neurodisability, neurology or both. Please state any preferences in your application form&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Work in the Neurodisability service may include contributing to the assessment of Autism Spectrum Disorders, undertaking cognitive assessments, running parent/carer workshops, and group and individual interventions with children and young people who have a range of neurodevelopmental difficulties. Neurology sees a wide variety of patients but the majority of work carried out by psychologists is the psychometric assessment of children with epilepsy and acquired brain injury.&lt;/p&gt;\n&lt;p&gt;The post holder will be encouraged to enhance skills in these areas and be given opportunities to undertake further training as required. Part-time and job share applications will be considered.&lt;/p&gt;\n&lt;p&gt;Professionally you will join a well-established Neurodisability and Neurology Clinical Psychology service which provides local, regional and national specialist services, through direct patient care, consultation and supervision. Direct supervision will be available from a senior member of this team and there are ample opportunities for peer supervision and support.&lt;/p&gt;\n&lt;p&gt;There is a large professional group of more than 60 clinical psychologists, systemic family therapists, child psychotherapists and art therapists working within the Trust.&lt;/p&gt;\n&lt;p&gt;Sheffield is an exciting city with many opportunities professionally and varied leisure opportunities including city life and culture and close proximity to the Peak District.&lt;/p&gt;\n&lt;p&gt;Informal enquiries and discussions are encouraged. Please contact Tracy Dyson or Jack Garlovsky in relation to neurology, and Susannah Lewis, Sarah Longley or Rebecca Gumpert in relation to Neurodisability. 0114 2717608.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122992.JPG", "name": "Sheffield Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S10 5DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3783", "longitude": "-1.51081"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916198511", "validThrough": "2020-12-01T23:59:59+0000"}