{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 £79,860 to £107,668 pa"}}, "datePosted": "2020-07-27T14:16:27+0100", "description": "&lt;p&gt;&lt;strong&gt;GEORGE ELIOT HOSPITAL NHS TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locum Consultant in Geriatric Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time 10 PA plus on calls&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£79,860 - £107,668 Per Annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The Role&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is looking to appoint a consultant physician who has a strong background in and a passion for Geriatric medicine. We are looking for an individual with enthusiasm for change and service development as we build the key components of an integrated system of care for frail elderly patients.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be well supported by the wider GEH Elderly Care team; comprising of two substantive consultants, registrar and middle-grade doctors, clinical nurse specialists and dedicated admin support. There is a commitment to teaching and educationally supervising medical students.&lt;/p&gt;\n&lt;p&gt;Inpatient care is provided on Bob Jakin, Felix Holt and on AMU as part of the frailty service. In addition to inpatient care, from early 2020 the team will operate from a state of the art frailty assessment unit (FAU) which allows planning to commence upon admission (if the admission can’t be avoided) to mitigate the effects of decomposition by an extended length of stay. This post will further enhance that care and provide opportunities to extend the service and remit.&lt;/p&gt;\n&lt;p&gt;This post will support the delivery of the current acute frailty service and will provide clinical leadership in the strategic development of the service which will further enhance the care and improve the care provision for frail elderly patients in North Warwickshire.&lt;/p&gt;\n&lt;p&gt;The post holder will join a substantive multi-disciplinary team and the successful candidate will be well supported working in a friendly, modern and well equipped unit and will be joining a trust with excellent professional and academic facilities. George Eliot Hospital is affiliated with the University of Warwick Medical School. In addition on the main hospital site there is also a first class modern education and conference facility in the George Eliot Training and Education Centre (GETEC), housing an excellent library and state of the art learning support facilities. Please see our job description for further details.&lt;/p&gt;\n&lt;p&gt;There is excellent accommodation nearby with ample leisure facilities and outstanding schools within the area. Birmingham International airport is close by as are the Birmingham and Coventry cities with their excellent shopping and cultural facilities.&lt;/p&gt;\n&lt;p&gt;This is a unique opportunity, and the post holder would have the opportunity to work with an innovative, dedicated and dynamic team.&lt;/p&gt;\n&lt;p&gt;We are committed to achieving Equal Opportunities and operate a No Smoking Policy&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;About us&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;George Eliot Hospital NHS Trust provides a range of hospital and community based services to more than 300,000 people across Nuneaton &amp; Bedworth, North Warwickshire, South West Leicestershire and North Coventry. The Trust has a reputation for providing high quality well-structured care in a friendly and supportive environment.&lt;/p&gt;\n&lt;p&gt;Closing date: 30 November 2020&lt;/p&gt;\n&lt;p&gt;Interview Date: TBC&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post may close early due to high numbers of applications &lt;/strong&gt;&lt;strong&gt;so you are advised to apply promptly.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All correspondence for this vacancy will be sent by email; please check your account regularly including your Junk and SPAM areas.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;A great and friendly place to work, so bring your passion, commitment and expertise &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;and enjoy the opportunities to make a difference every day. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;#JoinTeamEliot&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Should you require any further information or wish to arrange an informal visit please contact:&lt;/p&gt;\n&lt;p&gt;Dr James Egbuji (Consultant Physician) via james.egbuji@geh.nhs.uk or secretary on 02476 865628&lt;/p&gt;\n&lt;p&gt;Dr Winston Crasto (Clinical Director) winston.crasto@geh.nhs.uk or via Secretary on 024 7686 5329&lt;/p&gt;\n&lt;p&gt;Dr Martin Sandler (Deputy Medical Director) via martin.sandler@geh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "George Eliot Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120955"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Care of the Elderly, Nuneaton", "postalCode": "CV10 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.512", "longitude": "-1.47512"}}, "title": "Consultant Physician in Geriatric Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916126894", "validThrough": "2020-11-30T23:59:59+0000"}