{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33000", "minValue": "27000", "unitText": "YEAR", "value": "£27,000-£33,000"}}, "datePosted": "2020-09-17T12:07:15+0100", "description": "&lt;p&gt;255 Lichfield Road is an Independent Community Facing Rehabilitation and Recovery Unit which proivdes services for men and woman over the age of 18.  Service Users may be admitted Informally or detained under the Mental Health Act.  We aim to provide opportunities for our Service Users to practice independent living, by helping them build the skills and confidence needed to successfully live in the community.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The unit comprises of 28 beds and accommodation includes&lt;/p&gt;\n&lt;p&gt;•           Two 4-bedded enhanced recovery and rehabilitation units for people who require a structured environment with intensive support to progress through their recovery pathway&lt;/p&gt;\n&lt;p&gt;•           20 self-contained apartments that enable residents to live independently, whilst having the safety of a therapeutic structure if needed&lt;/p&gt;\n&lt;p&gt;•           Each apartment has its own front door, a lounge and kitchenette, bedroom and a bathroom&lt;/p&gt;\n&lt;p&gt;•           24-hour support as required&lt;/p&gt;\n&lt;p&gt;•           Dedicated occupational therapy facility to promote independent living skills&lt;/p&gt;\n&lt;p&gt;•           Therapy and treatment areas, safe and private grounds and a family visiting room&lt;/p&gt;\n&lt;p&gt;•           Communal bistro and kitchen&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Staff Nurse you will be working within a team that includes a range of professionals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be central to providing high quality care within a Rebailitation and Recovery setting.  The Service User group includes those with a diagnosis of severe and enduring mental illness including personality disorder.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will assist and support staff in the management of the unit and to ensure that in their absence, the effective management of the ward is maintained.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To be successful as an RMN/RNLD, you’ll need:&lt;/p&gt;\n&lt;p&gt;A relevant nursing qualification and registration&lt;/p&gt;\n&lt;p&gt;Excellent team working skills, a high level of self-motivation and a flexible approach - our units operate 24 hours 7 days a week, and our nursing staff work shift patterns including weekends, bank holidays and nights&lt;/p&gt;\n&lt;p&gt;A commitment to patient-centred care and to values-based and evidence-based practice&lt;/p&gt;\n&lt;p&gt;The drive to continually push your own personal learning and development&lt;/p&gt;\n&lt;p&gt;To be able to build effective and credible relationships both internally and externally&lt;/p&gt;\n&lt;p&gt;Work collaboratively with others sharing ideas and information at all times&lt;/p&gt;\n&lt;p&gt;Effectively build trust with a consistent approach between actions and words&lt;/p&gt;\n&lt;p&gt;Have the ability to raise standards through innovation and new ideas&lt;/p&gt;\n&lt;p&gt;Take responsibility for issues and resolve them.&lt;/p&gt;\n&lt;p&gt;To be able to cope in difficult situations with tact and diplomacy&lt;/p&gt;\n&lt;p&gt;To be able to build rapport and positively influence others&lt;/p&gt;\n&lt;p&gt;To be able to inspire professionalism&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Staff Nurse role involves:&lt;/p&gt;\n&lt;p&gt;Providing leadership and support for support staff and act as a champion for residents’ safety and dignity&lt;/p&gt;\n&lt;p&gt;Maintaining skills and knowledge and ensure that care is delivered according to latest guidelines and best practice evidence available&lt;/p&gt;\n&lt;p&gt;Ensuring the ongoing safety of service users, residents, staff and visitors through systematic assessment, monitoring and reviewing processes&lt;/p&gt;\n&lt;p&gt;Ensuring that clear and accurate records and communication systems relating to clinical and care delivery are maintained and effectively used&lt;/p&gt;\n&lt;p&gt;Acting as a role model for good clinical and care governance practice&lt;/p&gt;\n&lt;p&gt;Taking charge of the unit regularly and, in the absence of the management team, accepting responsibility for the smooth and effective running of the unit&lt;/p&gt;\n&lt;p&gt;Helping to maintain the security of the building and its environment&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Benefits&lt;/p&gt;\n&lt;p&gt;25 days annual leave plus bank holidays (at commencement of employment)&lt;/p&gt;\n&lt;p&gt;A Group Personal Pension Plan (GPPP)&lt;/p&gt;\n&lt;p&gt;Private Medical Insurance Scheme&lt;/p&gt;\n&lt;p&gt;Life Assurance&lt;/p&gt;\n&lt;p&gt;Free meals while on duty&lt;/p&gt;\n&lt;p&gt;Carefirst – Employee Assistance Services&lt;/p&gt;\n&lt;p&gt;Continuous learning and development&lt;/p&gt;\n&lt;p&gt;Childcare vouchers&lt;/p&gt;\n&lt;p&gt;Career development&lt;/p&gt;\n&lt;p&gt;Personal health insurance&lt;/p&gt;\n&lt;p&gt;An employee assistance programme&lt;/p&gt;\n&lt;p&gt;Voluntary Benefits&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant will be supported through a company and site induction which will involve working a variety of shifts to enable them to meet and work alongside the full MDT. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Newly Qualified Nurses will be required to work day and night rotations until successful completion of precetorship after which they may take up a permanent night post if preferred.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Shift Pattern:  A full time contract consists of working 32.25 hours (3 shifts) one week and 43 hours (4 shifts) the second week. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Shift Hours:&lt;/p&gt;\n&lt;p&gt;Long Day - 0730hrs to 1945hrs&lt;/p&gt;\n&lt;p&gt;Night Shift - 1930hrs to 0745hrs&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note there are no permanent day contracts available.   &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walsall", "postalCode": "WS3 3DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6258", "longitude": "-1.98626"}}, "title": "MENTAL HEALTH/LEARNING DISABILITY NURSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916189013", "validThrough": "2020-11-27T23:59:59+0000"}