{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907- £30,615 pro rata"}}, "datePosted": "2020-09-15T09:30:48+0100", "description": "&lt;p&gt;&lt;strong&gt;Theatre Practitioners, HCPC registered Operating Department Practitioners (ODP) and NMC registered Nurses/ Anaesthetics and Scrub practice&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are an innovative and expanding Theatre Service across a wide geographic area, at the forefront of patient care, with a well-established enhanced recovery programme.&lt;/p&gt;\n&lt;p&gt;UHDB theatres currently covers, an operational area of 36 Theatres across the Royal Derby Hospital site, 15 Theatres at the Queens Hospital site, 1 Theatre at Sir Robert Peel, and 2 Theatres at the Ilkeston site. We are continually growing and on the lookout for enthusiastic individuals passionate about delivering safe effective care across all sites.&lt;/p&gt;\n&lt;p&gt;We are currently expanding Theatre capacity by introducing various projects across the UHDB site. At the Queens Hospital site we have just opened 2 new state of the art Orthopaedic Theatres at the Treatment Centre. These Theatres have been designed around upper and lower limb Arthroplasty work with the capability to undertake additional Orthopaedic cases from the Royal Derby site within the winter months. In 2021 at the RDH site we will be opening a Vascular Hybrid Theatre and a Private Patients Theatre.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced practitioners with Anaesthetic or Scrub experience to work in our theatres. We are also able to offer opportunities to Newly Qualified ODPs and registered nurses who are interested in a change to Theatres.&lt;/p&gt;\n&lt;p&gt;Whatever your background, we have a team of clinical facilitators and preceptors employed to support you in practice and help design an individualised programme of experience to enable confidence and competence in practice. We support excellent rotation experiences to a wide range of specialties and provide support to allow you to expand your knowledge, experience and interest.&lt;/p&gt;\n&lt;p&gt;We offer excellent professional development courses and extended roles e.g. Mentorship and anaesthetics for nurses.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Burton site has the following Theatre units:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Main Theatres; This a busy theatre area comprising of 7 theatres including ENT, General, Urology, Gynaecology and Obstetrics, Paediatric, Orthopaedic Specialties. These areas provide an emergency 24/7 service.&lt;/li&gt;\n&lt;li&gt;Treatment Centre; This purpose built unit currently consists of 6 operating theatres and 1 treatment room together with a 5 bedded recovery. This covers a range of surgical specialties all of which are day case in nature. We have recently opened two bespoke Orthopaedic theatres and a 28 bedded ward.&lt;/li&gt;\n&lt;li&gt;Sir Robert Peel Theatre; This is one theatre department consisting of specialties such as General, Gynecology, Orthopaedic and local day case procedures.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The RDH Site has the following Theatre Units;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Orthopaedic Theatre Suite; This 8 Theatre suite undertakes complex Orthopaedic, Spinal and Trauma Surgery.&lt;/li&gt;\n&lt;li&gt;Surgical Theatres; This suite has 9 theatres which provide a service for complex ENT, MAX/FAX, Vascular, Urology, Colorectal, UGI, Emergency and Robotic specialties.&lt;/li&gt;\n&lt;li&gt;Gynaecology/Paediatric Theatres; The Gynae department consists of four elective theatres and two emergency obstetric theatres and covers Breast Surgery, elective and emergency Caesarian Sections, Gynaecology surgery, Urogynae surgery and is currently one of only 5 Certified Centres for Advanced Ovarian Surgery in the uk.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Paediatric Theatre consists of two theatres, providing ENT/MAX FAX, Orthopaedic, Opthalmic, Hand, Dental, Endoscopy, MRI and General surgery for children.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Recovery Unit; We are an extremely busy Recovery department covering General, Gynaecology, Urology and Orthopaedic Theatre suites. The department provides first stage recovery to patients from Trauma &amp; Orthopaedics, General surgery, gynaecology/obstectrics, Maxillofacial &amp; ENT, Urology, Vascular specialties&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We also have 4 day case Units within the Kings Treatment Centre;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ophthalmic Day case; This unit has 3 Theatres, recovery area and a Day Case ward which provides a service for elective and emergency eye surgery and pain blocks.&lt;/li&gt;\n&lt;li&gt;Urology Day case; This unit provides a service for day case urology surgery and we also offer nurse and doctor led flexi clinics. The unit has 2 theatres, clinic rooms, recovery area and a Day Case ward.&lt;/li&gt;\n&lt;li&gt;Hand Day case; The world renowned Pulvertaft Hand Unit comprises a reception, a ward, 3 theatres and a recovery area. We cover all aspects of Hand surgery including micro- vascular, orthopaedics, trauma and plastics.&lt;/li&gt;\n&lt;li&gt;Surgical Day case; this unit provides a service for Dental, ENT, MAX/FAX, Vascular, Colorectal, UGI, cardioversions, Plastics and Dermatology specialties. The unit has 3 Theatres, recovery room and a Day Case ward.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; Ilkeston Hospital&lt;/strong&gt; is a vibrant Community Hospital located on the Derbyshire-Nottinghamshire border. The Diagnostic and Treatment Centre comprises of two operating theatres with laminar flow, five bedded PACU, minor ops room and a sixteen- bedded second stage recovery ward. We deliver a variety of day case procedures with a multi-disciplinary team which is consultant led.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to work within a multi-professional team, liaising with and providing high quality care for patients. You will need to possess excellent communication and inter-personal skills with the ability to promote a learning environment and be flexible to change. We do encourage some rotation between the various sites and expect some cross site working.&lt;br /&gt;&lt;br /&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises. If you have Covid-19 related s&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Derby Hospital, Derby", "postalCode": "DE22 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9104", "longitude": "-1.51382"}}, "title": "Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916184568", "validThrough": "2021-03-09T23:59:59+0000"}