{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933- £39,681 inc Fringe HCAS"}}, "datePosted": "2020-08-14T10:42:25+0100", "description": "&lt;p&gt;We are looking for a highly dedicated nurse, occupational therapist or social worker to join our Liaison Psychiatry Service at the Royal Surrey County Hospital in Guildford Surrey. Our team provides a comprehensive specialist service to patients, clinicians and carers in the general hospital setting.&lt;/p&gt;\n&lt;p&gt;The team is functioning already at CORE 24, as such you will be expected to work a shift system across a 24hr period seven days a week, primarily assessing patients who are referred from our inpatient wards or those who present to the Emergency Department.&lt;/p&gt;\n&lt;p&gt;This is a challenging but rewarding role, offering an exciting opportunity to nurses, occupational therapists or Social Workers who have a strong assessment and therapeutic skills. You will need the ability to work autonomously whilst still contributing to the team as a whole. Previous experience of working in Liaison Psychiatry and across ages is desirable, although not essential. We offer excellent staff support through clinical supervision and teamwork.&lt;/p&gt;\n&lt;p&gt;You will have an excellent and positive approach to work, with an outstanding, demonstrable background of providing high quality care. You will have an insight into liaison psychiatry and the national guidelines impacting these services. You will have experience and willingness to teach and educate others within the team and the wider network as well as a commitment to service development and the best possible outcomes for people in the acute hospital setting.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Surrey Hospital, Guildford", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Psychiatric Liaison Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916149032", "validThrough": "2020-11-22T23:59:59+0000"}