{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-09-17T14:36:42+0100", "description": "&lt;p&gt;Nuffield Health, one of the UK’s leading healthcare organisations, is currently seeking to recruit a Pre Operative Assessment Staff Nurse to join the team in our Oxford, The Manor Hospital on a full-time basis.&lt;br /&gt;&lt;br /&gt;We’re looking for an exceptional Pre-Assessment Staff Nurse, with a passion for delivering excellent patient care and the ability to manage varied and interesting caseload. Previous experience within Pre-Assessment would be advantageous.&lt;br /&gt;&lt;br /&gt;Reporting to the Pre-Assessment Lead Nurse, you will be part of a close-knit multidisciplinary team, linking in with colleagues from other areas in order to provide the best care for our patients.&lt;br /&gt;&lt;br /&gt;The role involves the delivery of high-quality evidenced-based patient care, with a strong patient focus. Assessing, planning, implementing and evaluating care as part of a collaborative programme through face to face assessments with patients through point of care testing.&lt;br /&gt;&lt;br /&gt;As a Staff Nurse registered with the appropriate governing body, you’ll have the qualifications and experience relevant to your registration. You’ll also have post-registration experience. Intermediate Life Support is desirable. You’ll be an excellent communicator and team worker – flexible and motivated.&lt;br /&gt;&lt;br /&gt;You&#39;ll have access to our comprehensive wellbeing focused benefits package including free gym membership, a choice of pension contributions and private healthcare.&lt;br /&gt;&lt;br /&gt;Nuffield Health The Manor Hospital&lt;br /&gt;&lt;br /&gt;The Manor Hospital is a large modern, private hospital in the heart of Oxford and is the flagship hospital of the Nuffield Health Group. Offering six main theatres and 2 minor theatres, a six-bed level 2 PACU and a 6 bed CCU. We have over 350 clinical specialists who offer complex and diverse treatments and have a dedicated Matron-led clinical team. We offer the full range of flexible working options including part time working, term time working, compressed hours and job share. Staff needing to relocate have the option of staying in our staff accommodation for their first six months service.&lt;br /&gt;&lt;br /&gt;About Nuffield Health&lt;br /&gt;&lt;br /&gt;Nuffield Health is Britain’s largest and most pioneering healthcare charity, integrating fitness and well-being, prevention and cure. We’ve brought together our hospitals, clinics, fitness &amp; wellbeing centres as well as our diagnostic units into one holistic healthcare service provided from over 200 locations. A not-for-profit organisation, we reinvest every penny we make into helping the people of Britain to lead healthier, happier lives. In today’s healthcare market, we’re in an enviably strong position.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary: Competitive&lt;/p&gt;\n&lt;p&gt;Location: Oxford&lt;/p&gt;\n&lt;p&gt;Hours: Full time, 37.5 hours per hour&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3 7RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7603", "longitude": "-1.21546"}}, "title": "Staff Nurse - Pre-Assessment", "url": "https://www.jobs.nhs.uk/xi/vacancy/916189526", "validThrough": "2021-01-04T23:59:59+0000"}