{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35314", "minValue": "30680", "unitText": "YEAR", "value": "£30,680 to £35,314 pro rata, per annum"}}, "datePosted": "2020-09-11T14:58:56+0100", "description": "&lt;p&gt;Clinical Educator (Nurse)&lt;br /&gt;£30,680 to £35,314 pro rata, per annum&lt;br /&gt;30 hours per week, permanent&lt;br /&gt;&lt;br /&gt;We&#39;d love you to join us at our Sue Ryder Duchess of Kent, CQC Outstanding Hospice.&lt;br /&gt;&lt;br /&gt;Do you love to teach? Do you enjoy helping others reach and exceed their development goals?&lt;br /&gt;&lt;br /&gt;A fantastic opportunity for a nurse with a keen interest in teaching and educating others to join our busy 15 bed hospice and extensive Community Palliative Care Teams.&lt;br /&gt;&lt;br /&gt;Sue Ryder is a national charity that supports people with life-limiting and neurological conditions and those who have been bereaved.&lt;br /&gt;&lt;br /&gt;In West Berkshire and South Oxfordshire, Sue Ryder provides multi professional palliative care in inpatient and community settings including Hospice at Home.&lt;br /&gt;&lt;br /&gt;About the Role:&lt;br /&gt;&lt;br /&gt;You will be part of a small team supporting the professional development of the clinical teams, including mandatory training, competency development and education in specialist palliative care.&lt;br /&gt;&lt;br /&gt;There are opportunities to maintain clinical practice within the service and to increase hours to full time by doing this regularly.&lt;br /&gt;&lt;br /&gt;You must hold a full UK Driving Licence with access to a car. The role is based Reading with travel between our four sites including Thatcham, Wokingham and Crowmarsh.&lt;br /&gt;&lt;br /&gt;You will be a registered clinical professional with the NMC or HCPC &amp; educated to degree level (or working towards) with evidence of continuous professional development.&lt;br /&gt;&lt;br /&gt;For further information contact Laura Myers, Practice Educator on 07583 673552 or laura.myers@suerydercare.org&lt;br /&gt;&lt;br /&gt;About Us:&lt;br /&gt;&lt;br /&gt;Duchess of Kent is a Sue Ryder Hospice based in Reading. We provides expert palliative and end of life care, in a beautiful setting, for thousands of local people each year. We are part of a large charity but have a close relationship within the local community and offer a large range of specialist services to support patients, their families and friends.&lt;br /&gt;&lt;br /&gt;Competitive Benefits:&lt;br /&gt;• £30,680 to £35,314 pro-rata, per annum (depending upon experience).&lt;br /&gt;•Company pension scheme&lt;br /&gt;•25 days holiday - rising to 30 with length of service plus bank holidays&lt;br /&gt;•Enhanced maternity and paternity pay&lt;br /&gt;•Enhanced sick pay&lt;br /&gt;•Corporate discount with hundreds of retailers and services&lt;br /&gt;•Staff discount of 15% on new goods online at shop.sueryder.org&lt;br /&gt;•Season ticket loan&lt;br /&gt;•Cash referral bonus scheme of up to £500&lt;br /&gt;•Cycle to work scheme&lt;br /&gt;• Free parking, tea and coffee and subsidised meals&lt;br /&gt;• Wellbeing centre and free will writing service&lt;br /&gt;• Development opportunities for all through our structured development framework&lt;br /&gt;&lt;br /&gt;Sue Ryder supports people through the most difficult times of their lives. Whether that’s a terminal illness, the loss of a loved one or a neurological condition – we’re there when it matters. Our doctors, nurses and carers give people the compassion and expert care they need to help them live the best life they possibly can.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4475", "longitude": "-1.00172"}}, "title": "Clinical Educator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916182080", "validThrough": "2020-11-08T23:59:59+0000"}