{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31000", "minValue": "25000", "unitText": "YEAR", "value": "£25,000- £31,000"}}, "datePosted": "2020-07-23T16:55:19+0100", "description": "&lt;p&gt;We are currently recruiting an experienced and committed Registered Nurse to join our fantastic team in our Pre-Assessment department.&lt;/p&gt;\n&lt;p&gt;Our patients are at the heart of everything we do- we are looking for someone who shares our values and is compassionate about delivering safe, and effective care to all our patients. As a registered nurse you will use your skills and knowledge to work well within a team, adopting a flexible and collaborative approach at all times. If you are an enthusiastic and highly motivated Registered Nurse you will find a place to thrive at Circle Reading Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Summary:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working flexibly, as part of the hospital’s clinical team, you will provide the highest standards of nursing care to our patients; maintain high standards of communication throughout the hospital, and make a positive contribution towards the team’s pursuit of excellence.&lt;/p&gt;\n&lt;p&gt;The post holder will contribute to the achievement of the aims and objectives of the Out Patients &amp; Pre Assessment Department, managing the care and safety of all patients within the unit. You will ensure that the nursing teams are efficient and effective using appropriate pathways of care and communication via liaison and referral to other agencies/departments as required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications / experience required:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in a similar role&lt;/li&gt;\n&lt;li&gt;NMC registration&lt;/li&gt;\n&lt;li&gt;Demonstrable record of CPD&lt;/li&gt;\n&lt;li&gt;Knowledge of current issues in professional practice with particular relevance to the Unit&lt;/li&gt;\n&lt;li&gt;Knowledge of standards of professional practice in the wider healthcare context&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional benefits of joining Circle Health:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days’ annual leave with additional days for long-term service&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme: save money on a new bike and benefit from interest-free instalments&lt;/li&gt;\n&lt;li&gt;Private pension scheme helping your to live well in retirement&lt;/li&gt;\n&lt;li&gt;Health and wellbeing programme which includes free fruit, massages and fitness sessions&lt;/li&gt;\n&lt;li&gt;Employee assistance programme: get confidential support 24/7&lt;/li&gt;\n&lt;li&gt;Private medical insurance to help you get any treatment you need quickly&lt;/li&gt;\n&lt;li&gt;Non-contributory life assurance and income protection insurance&lt;/li&gt;\n&lt;li&gt;Perkbox for employee discounts at a range of retailers, restaurants and other services&lt;/li&gt;\n&lt;li&gt;Free Parking onsite&lt;/li&gt;\n&lt;li&gt;Free Uniform&lt;/li&gt;\n&lt;li&gt;Season ticket loan: get the benefit of an annual ticket and pay the cost over 12 months&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Circle Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG2 0NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4369", "longitude": "-.971772"}}, "title": "Registered Nurse Pre assessment 12 month FTC", "url": "https://www.jobs.nhs.uk/xi/vacancy/916124132", "validThrough": "2020-11-20T23:59:59+0000"}