{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 to £39,681 pa inc HCAS"}}, "datePosted": "2020-09-24T17:15:15+0100", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Rotational Inpatient Dietitian - Band 6 &lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Adult Dietetic Services&lt;/span&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Would you like to expand and further develop your clinical skills with the support of established and experienced senior dietetic staff?  If so, this is the job for you. &lt;/p&gt;\n&lt;p&gt;Our expanding Dietetic team are recruiting to 2 newly created Band 6 rotational posts one in Surgery, one in Medicine.  The roles will be supported by Senior Dietitians and will include developing the frailty pathway and elderly care work streams, starting the new surgical clinic, upskilling in parenteral nutrition, in addition to holding clinical caseloads in the relevant ward areas, such as colorectal and upper GI surgery.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, innovative, enterprising and flexible Dietitian, with a desire to develop and grow, both the role and your own professional skills and knowledge, and explore new ways of working within an ever changing NHS, whilst remaining committed to delivering high quality patient care and promoting the dietetic profession within the Trust.&lt;/p&gt;\n&lt;p&gt;The acute inpatient dietetic department, comprising of approximately 12 dietitians, is managed jointly with the Speech and Language Therapy Department, offering collaborative ways of working and supporting excellent MDT relationships throughout the Trust.  Furthermore, we input into a dynamic nutrition support team and have  specialist dietitians working across the hospital in other teams, including diabetes, bariatric surgery, paediatrics, stroke, gastroenterology, and community nutrition support.   &lt;/p&gt;\n&lt;p&gt;The dietetic department is a supportive environment and proactively leads on improving the nutritional care of patients.  It has been highly successful in improving the clinical assessment processes and care provided early in the admission process, leading to poster presentations by staff at international conferences.  Furthermore, with the help of an established and forward thinking Quality Improvement Team, it continually reviews best practice through the use of audit and journal clubs.&lt;/p&gt;\n&lt;p&gt;ASPH is strongly committed to clinical governance and continuing professional development with an excellent support and clinical supervision structure in place.  We are committed to training student dietitians on their A, B and C placement and have close working relationships with the University of Surrey and other training departments in the South East.&lt;/p&gt;\n&lt;p&gt;If you are interested in discussing these roles further or require more information please feel free to contact us as follows:&lt;/p&gt;\n&lt;p&gt;Caroline Goodger, Clinical Lead, Inpatient Dietetics Surgery/Critical Care on 01932 722202, carolinegoodger@nhs.net&lt;/p&gt;\n&lt;p&gt;OR&lt;/p&gt;\n&lt;p&gt;Alison Williamson: Clinical Lead, Inpatient Dietetics (Medicine) and Speech and Language Therapy on 07795611146, alison.williamson1@nhs.net&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Inpatient Rotational Dietician - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916199578", "validThrough": "2020-11-22T23:59:59+0000"}