{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14826", "minValue": "14826", "unitText": "YEAR", "value": "£8.82 per hour"}}, "datePosted": "2020-08-20T11:29:33+0100", "description": "&lt;p&gt;The Huntercombe Group is a specialist healthcare provider in the UK. We look after children and young people with mental health needs and eating disorders (CAMHS) and adults with learning disabilities, mental health needs and brain injuries.&lt;/p&gt;\n&lt;p&gt;Due to the pressures on our services caused by the Coronavirus resulting in staff illness and absence from work, we are looking to increase our team of Housekeepers to support our colleagues and patients during these uncertain times.&lt;/p&gt;\n&lt;p&gt;As a Housekeeper you will work flexibly as part of the site domestic team ensuring a high standard of upkeep is achieved and maintained. You will be expected to cover shifts and absences as required.&lt;/p&gt;\n&lt;p&gt;Key Accountabilities:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Cleaning of Unit, including patient areas and communal areas as designated&lt;/li&gt;\n&lt;li&gt;General cleaning of premises including floors, sinks, toilets, wash hand basins, baths, work showers, surfaces, cupboards etc. using designated equipment and re-stocking materials as required&lt;/li&gt;\n&lt;li&gt;Carry out periodic cleaning, such as corridor walls, windows and carpets using the appropriate machines/tools&lt;/li&gt;\n&lt;li&gt;Emptying of rubbish bins, ensuring replacement bags are the correct colour, in line with company waste policy&lt;/li&gt;\n&lt;li&gt;Work all shifts as indicated by the staff rota&lt;/li&gt;\n&lt;li&gt;Correct usage, storage and care of cleaning equipment, adhering to COSHH procedures&lt;/li&gt;\n&lt;li&gt;To ensure a smart appearance wearing the company uniform provided&lt;/li&gt;\n&lt;li&gt;Be aware of and provide high levels of Customer Care at all time&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Communication and Relationship Skills:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensure effective relationships are maintained at all times.&lt;/li&gt;\n&lt;li&gt;30 per week / 9am to 3pm (with flexibility)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;About You&lt;/p&gt;\n&lt;p&gt;Please take a look at our progressive and rewarding benefits package&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;• Employee Assistance Programme (EAP) &lt;br /&gt;• Maternity leave at 3 month’s full pay and 3 month’s half pay &lt;br /&gt;• 2 week’s paid paternity leave &lt;br /&gt;• Shared parental leave, matching the maternity leave benefit &lt;br /&gt;• A thorough Induction Programme tailored to the hospital where you will be working &lt;br /&gt;• Clear pay structure, with competitive rates &lt;br /&gt;• Generous annual leave allowance &lt;br /&gt;• Sick pay of 4 weeks full pay and 4 weeks half pay &lt;br /&gt;• The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions &lt;br /&gt;• Death in service benefit equivalent to 2 x salary &lt;br /&gt;• A range of staff discounts &lt;br /&gt;• Continuing Professional Development (CPD)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; For a more detailed job spec please take a look at our Website where you can also read some inspiring stories and find out why working at Huntercombe really sets us apart from the rest.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ashley, Market Drayton", "postalCode": "TF9 4LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9291", "longitude": "-2.35599"}}, "title": "Housekeeper", "url": "https://www.jobs.nhs.uk/xi/vacancy/916156043", "validThrough": "2020-11-15T23:59:59+0000"}