{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6"}}, "datePosted": "2020-07-24T10:29:18+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Band 6 Physiotherapist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Oxford University Hospital NHS Foundation Trust - Horton General Hospital, Oxford Road, Banbury – OX16 9AL.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt; Acute and General Medicine (AGM)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Band 6, Monday – Friday 08:30 – 16:30.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a dynamic and enthusiastic Physiotherapist to join the Acute and General Medical Therapy team at the Horton Hospital. The role offers collaborative working alongside the MDT, and opportunities to work in specialist areas such as Critical Care and Frailty, as well as acute and general medical wards. Experience working within an acute hospital setting is essential, and acute and general medical experience is highly beneficial as the patients we see have a wide range of complex conditions and co-morbidities. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is essential that the candidate has respiratory experience (adults), but note that there are no ventilated patients on site. The role is primarily Monday-Friday, however weekend working is available and can be discussed further i.e. working 5 days across a 7 day week.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Statement - &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To provide evidence based and specialist Physiotherapy interventions to a wide variety of patients with complex acute and general medical presentations throughout the Horton site, inclusive of those with acute respiratory needs. To provide support and supervision to junior staff, and participate in service development and professional development projects.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Description – &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To demonstrate ability to sensitively and effectively communicate complex and emotionally distressing information to patients, carers and other staff. Where there are barriers to communication, the post holder must be able to adapt communication style, and encourage all team members to do likewise.&lt;/li&gt;\n&lt;li&gt;To openly and professionally communicate with all disciplines involved in the patient’s care in the Hospital and in the community, ensuring a multidisciplinary approach to continuity of care.&lt;/li&gt;\n&lt;li&gt;To ensure all written documentation/reports related to patient care are completed in a timely manner and in line with CSP, HCPC and local policy standards.&lt;/li&gt;\n&lt;li&gt;To use advanced and innovative interpersonal skills of negotiation and persuasion to encourage and motivate patients to engage in Therapy intervention.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Please see full job description for further information in regards to the role.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; •&lt;strong&gt;Competitive Pay Rates&lt;/strong&gt;- work this week, get paid next week!&lt;br /&gt; •&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;br /&gt; •&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;br /&gt; •&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;br /&gt; •&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;br /&gt; •&lt;strong&gt;Build holiday allowance&lt;/strong&gt;&lt;br /&gt; •&lt;strong&gt;Support when you need it – 24/7 365 days&lt;/strong&gt;– Call us anytime on 03330 144 370&lt;br /&gt; •&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million &lt;/strong&gt;each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;br /&gt; Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford University Hospital NHS Foundation Trust - Horton General Hospital, Oxford Road, Banbury", "postalCode": "OX16 9AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0535", "longitude": "-1.33665"}}, "title": "Band 6 Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916124579", "validThrough": "2021-01-25T23:59:59+0000"}