{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 based on full time hours"}}, "datePosted": "2020-07-07T10:15:16+0100", "description": "&lt;p&gt;We are very pleased to be offering the opportunity for a Consultant Psychiatrist to join a successful and motivated team to oversee 15 beds. The post holder will work alongside four other Consultant OPMH Inpatient Psychiatrists based at the other inpatient OPMH wards within the Trust (Gosport War Memorial Hospital, The Western Community Hospital in Southampton and Parklands Hospital in Basingstoke) and provide supervision to junior doctors and other team members.&lt;/p&gt;\n&lt;p&gt;The wider team on SOU benefits from a full range of Professionals including Nurses, Occupational Therapists, Psychologist and Activity Coordinators. The unit enjoys very close working relationships with local Community Mental Health Teams.&lt;/p&gt;\n&lt;p&gt;Winchester is an ideal location for families. It is under an hour by train from Waterloo and has been rated as the ‘&lt;em&gt;Best place to live in the UK’&lt;/em&gt; in the Halifax&#39;s annual Quality of Life survey. It is a Cathedral and University City that boasts high performing state and independent schools, plenty of green spaces, stunning architecture, and close proximity to the South Coast.&lt;/p&gt;\n&lt;p&gt;Southern Health NHS Foundation Trust is a clinically led teaching Trust. We have a vibrant Divisional Academic Programme benefiting from close links to the University of Southampton Medical School. Clinical innovation is supported by effective Quality Improvement programmes and there are plenty of research opportunities encouraged and facilitated by the Research and Development department.&lt;/p&gt;\n&lt;p&gt;We look forward to welcoming an enthusiastic consultant who is committed to lead their clinical team in providing outstanding psychiatric care to the local population we serve.&lt;/p&gt;\n&lt;p&gt;Please note that GMC registration (with a licence to practice) and right to work in the UK are essential for this role. Successful applicants will already have GMC registration or will be able to demonstrate they are eligible. Applicants requiring Tier 2 sponsorship should ensure they meet the Home Office application criteria prior to submitting an application.&lt;/p&gt;\n&lt;p&gt;For more information about the post and to arrange a visit to the service, please contact Dr Jeremy Rowland, Divisional Medical Director Jeremy.rowland@southernhealth.nhs.uk.&lt;/p&gt;\n&lt;p&gt;For further information please refer to the job description and candidates are recommended to visit the service.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Consultant Psychiatrist in Older Peoples&#39; Mental Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916103725", "validThrough": "2020-11-20T23:59:59+0000"}