{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33792", "minValue": "33792", "unitText": "YEAR", "value": "£33,792.19"}}, "datePosted": "2020-09-23T10:57:47+0100", "description": "&lt;p&gt;G4S Health Services has been one of the leading providers to all justice health environments since 2005. Working across Secure, Custody and Sexual Assault Referral Centres (SARC) across the UK, we provide primary care and forensic healthcare to a wide range of patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are recruiting for a CAMHS nurse to join our well- established team!Oakhill Secure Training Centre (STC) is an 80 bedded secure establishment that holds males from 12-17 yearsold. We provide healthcare services in line with the NHS including GP, Dentist, Optician, Physiotherapy, andPodiatry. We also provide Immunisations, Sexual health clinics and Young Fatherhood programs. We provideassessments using the Comprehensive assessment tool (CHATS) that are utilized across the youth secureestate. The team is made up of RNLDs, RMNs, and RGNs RCNs.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The CAMHS nurse will be responsible for supporting the clinical psychologist in delivering and implementingclinical and therapeutic interventions to young people via the referral process. The post holder will be expected toliaise with the families of our young people and also community CAMHS and FCAMHS, ensuring appropriatesupport is arranged for the young people upon release. The post holder must work within the multi-disciplinaryteam working with children and young people with complex mental health presentations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are recruiting for a CAMHS Nurseto join our team at Oakhill STC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits as a CAMHS Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary of £33,792.19per annum&lt;/li&gt;\n&lt;li&gt;Company pension scheme with employer contributions&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Employee discount scheme&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;O2, Aviva and British Gas discounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shifts:37.5hours per week (Full Time)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Relationships:&lt;/strong&gt;Children, their families, wider healthcare team, internal teams that providesupport to our young people i.e. safeguarding and forensic psychology. Also external agenciesinvolved either historically or currently with our young people.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Purpose:&lt;/strong&gt;The CAMHS nurse will be responsible for supporting the clinical psychologist in delivering andimplementing clinical and therapeutic interventions to young people via the referral process. Thepost holder will be expected to liaise with the families of our young people and also communityCAMHS and FCAMHS, ensuring appropriate support is arranged for the young people upon release.The post holder must work within the multi-disciplinary team working with children and youngpeople with complex mental health presentations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Skills as a CAMHS Nurse:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Part 1 NMC registration RMN\\LD&lt;/li&gt;\n&lt;li&gt;A minimum of 2 years’ experience of working with children and adolescents&lt;/li&gt;\n&lt;li&gt;Able to work within challenging and complex situations&lt;/li&gt;\n&lt;li&gt;Ability to develop and maintain effective working relationships at all levels&lt;/li&gt;\n&lt;li&gt;Must be an effective team worker and be able to lead in areas of tier 1&amp; 2 CAMHs interventions.&lt;/li&gt;\n&lt;li&gt;Ability to manage and maintain own caseload and work autonomously within the specialist area.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Desirable skills:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Specialist training in a subject\\skill relevant to child and adolescent mental health (0-18)&lt;/li&gt;\n&lt;li&gt;The ability to supervise, teach and develop staff’s (clinical and non-clinical) understanding of mental health and learning difficulties&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;£1500 Golden Hellobonus (paid in 3 installments*)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;*Golden Hello&lt;/em&gt; &lt;em&gt;· £500 - first month&#39;s salary&lt;/em&gt; &lt;em&gt;·£500 - after 12 months&lt;/em&gt; &lt;em&gt;·£500 - after 24 months&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This role requires the ability to work with vulnerable people in a caring and compassionate way. A DBS check and relevant police/ prisonclearance will be required to exclude any individuals with a history of behaviour which could be considered unacceptable (by G4S or the clients). Safety is of paramount importance and the post holder must ensure that safe systems of work are followed without compromise.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131154.JPG", "name": "G4S", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Milton Keynes", "postalCode": "MK5 6AJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0159", "longitude": "-.811221"}}, "title": "CAMHS Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916196406", "validThrough": "2020-11-10T23:59:59+0000"}