{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-07-28T20:44:00+0100", "description": "&lt;p&gt;Are you passionate about healthcare? Do you want the stability of a salary and fixed hours or do you want to be able to pick and choose when you work? Do you want to be part of an enthusiastic and dynamic team? We are looking for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Varied&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: &lt;/strong&gt;Salaried &amp; Annualised Salaried &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Various - Northumberland, North Tyneside, Newcastle, Sunderland, South Tyneside&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About the role:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Vocare North is recruiting for GPs for their Urgent Care and GP OOH&#39;s services situated across the North East.&lt;/p&gt;\n&lt;p&gt;You will be a key member of the team managing an in hours and out of hours caseload, dealing with a wide range of presenting health care needs in a primary care setting. You will work with clinical and operational colleagues in ensuring the highest standards of care for all presenting patients.&lt;/p&gt;\n&lt;p&gt;If successful you will be an integral part of a dynamic work force, with a flexible persona you will meet the needs of the patients during the In and Out of Hours period. The Sessional GP will be required to work at different Urgent Care Centres or undertake a variety of different assessments (telephone advice; home visits; centre visits) during the same shift.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Duties within the role:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Manage an in hours and out of hours case load within a primary care setting.&lt;/li&gt;\n&lt;li&gt;Undertake a variety of assessments such as telephone triage, home visiting and centre visits.&lt;/li&gt;\n&lt;li&gt;Receive patients with undifferentiated and undiagnosed problems and make assessment of their health care needs.&lt;/li&gt;\n&lt;li&gt;Work in co-operation with the Operational Team to ensure a safe and effective service is being delivered.&lt;/li&gt;\n&lt;li&gt;Prescribe in accordance within organisational, national and local guidelines.&lt;/li&gt;\n&lt;li&gt;Refer patients to other health and social care providers as appropriate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What we are looking for:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Successful applicants will be a fully qualified GP with GMC registration and inclusion on the English Medical Performers List.&lt;/p&gt;\n&lt;p&gt;Applicants will also hold a current CPR certificate and have experience in chronic disease management and clinical governance. You will also hold Safeguarding of Vulnerable Adults and Children Level 3 with evidence of Resuscitation &amp; Life Saving Training alongside annual appraisal and revalidation evidence.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Vocare are operational 24 hours a day, 7 days a week, 365 days a year and the working of various shift patterns to include weekends and public holidays will be required within this role.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What we can offer you:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;I&lt;/strong&gt;n addition to competitive rates of pay, we offer a range of contracts to suit your preferences. You can opt in, or out, of the NHS superannuation scheme, or elect to be paid into a PSC. Youwill have 24/7 access to senior medical support, as well as our free medico-legal support services, if ever required&lt;/p&gt;\n&lt;p&gt;We are a clinically led organisation and we are keen to involve our workforce to continually improve the safety and effectiveness of the care we deliver.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;How to apply:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply, please click on &quot;apply for this job&quot; on the right-hand side of the screen and complete the application form. Make sure to use the attached job description to support you in writing your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We encourage you to apply as soon as possible, as once sufficient applications have been received, we may decide to close the advert early.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note the salary ranges above are based on a 37.5 hour week and detail the lowest you can earn and the highest you can earn depending on the amount of unsocial hours you actually work.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;All successful applicants will be subject to a Disclosure &amp; Barring Service check.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Vocare Group recognise the diversity of the communities in which we operate and demonstrate this through the service we provide when dealing with patients, their family and carers.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Vocare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various Locations", "postalCode": "NE46 1QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9696", "longitude": "-2.0955"}}, "title": "General Practitioners", "url": "https://www.jobs.nhs.uk/xi/vacancy/916129125", "validThrough": "2020-12-06T23:59:59+0000"}