{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive + Benefits"}}, "datePosted": "2020-09-17T14:13:11+0100", "description": "&lt;p&gt;If you care for others without a second thought and are looking for a rewarding career where you can make a difference and changes lives for the better, then the Clinical Psychologist at Brighton &amp; Hove Clinic could be the right choice for you.&lt;/p&gt;\n&lt;p&gt;You will join the service on a maternity cover basis until March 2021 with the opportunity of becoming a permanent member of the team. You will be part of an environment where there is a strong emphasis on teamwork, supervision from the Clinical Director and CPD opportunities.&lt;/p&gt;\n&lt;p&gt;You will be responsible for individual and group interventions, diagnostic and cognitive assessments, MDT working, risk assessments and facilitate staff reflective practice sessions and will be requested to design and deliver training.&lt;/p&gt;\n&lt;p&gt;As a Clinical Psychologist, you will have experience and knowledge in carrying service users caseload, including assessing service users with complex needs, and designing and delivering specialist psychological treatment within a CAMHS services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assessing and evaluating information from the child, family and significant others, multidisciplinary medical team and external agencies relating to a medical condition and developmental status and incorporate this information into a clinical formulation&lt;/li&gt;\n&lt;li&gt;Evaluating and making decisions about treatment options.&lt;/li&gt;\n&lt;li&gt;Contributing directly and indirectly to a psychologically-based framework.&lt;/li&gt;\n&lt;li&gt;Undertaking risk assessment and risk management.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you&#39;ll need&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Postgraduate doctoral-level training in clinical psychology&lt;/li&gt;\n&lt;li&gt;HPC Registered&lt;/li&gt;\n&lt;li&gt;Experience of working with the adolescent/young age range &amp; eating disorders&lt;/li&gt;\n&lt;li&gt;DBT/CBT/ Family therapy trained&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: 14-18 New Church Road, Hove, East Sussex, BN3 4FH&lt;/p&gt;\n&lt;p&gt;Working at Brighton &amp; Hove Clinic, you will join the multidisciplinary team that provides CAMHS Tier 4 service for young people aged 12 - 18 years with a prime diagnosis of eating disorders and who may have other mental health conditions.  &lt;/p&gt;\n&lt;p&gt;Combining the NICE guidelines recommended therapies, the service creates bespoke programmes that provide person-centred care to support each person’s physical, medical and mental health needs. Young people will participate in psycho-education to support their care plans and are allowed to engage in therapeutic programmes such as mindfulness, family and trauma therapy.&lt;/p&gt;\n&lt;p&gt;Working alongside the individual and their families, the MDT will collaboratively create care plans and risk assessments. You will empower individuals to manage and improve their health through their treatment within the community.&lt;/p&gt;\n&lt;p&gt;The service operates 24/7. You will work shift patterns including weekends, bank holidays and nights. Standard shifts are 12.5 hours a day, working 3 days for three weeks and 4 days for one week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary &lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton", "postalCode": "BN3"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8392", "longitude": "-.176918"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916189422", "validThrough": "2020-11-17T23:59:59+0000"}