{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-09-23T11:18:44+0100", "description": "&lt;p&gt;Applications are welcomed for a consultant post in Anaesthesia with major commitment to Intensive Care Medicine, in a trust with a wide case mix in a spectacular part of the UK. We have one on the lowest ICU lengths of stay in the UK and manage two general intensive care units. The successful applicant will join a team of dedicated intensivists working in harmony to provide excellent patient care. Areas of special interests will be welcomed, both in anaesthesia&amp; ICU.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a team of 11 with duties in both ICUs in our Trust, at Cumberland Infirmary, Carlisle and West Cumberland Hospital, Whitehaven.On call duties will be at Cumberland Infirmary.&lt;/p&gt;\n&lt;p&gt;We are a highly motivated and cohesive team dedicated to providing an excellent service for circa 1100-1200 patients admitted to our ICUs per annum. We have a well-developed outreach and critical care practitioner system. Our ICU data management is fully electronic.&lt;/p&gt;\n&lt;p&gt;Along with our anaesthetic colleagues we have been rated top 10 for training in the 2017 GMC trainees’ survey and we are the most popular unit in the deanery for ACCS trainees. We have a strong commitment to support, mentorship and development of all of our staff and have regular multidisciplinary meetings. We have friendly and patient-orientated relations with parent teams and clear patient flows through the ICU.&lt;/p&gt;\n&lt;p&gt;Due to our location we have a number of services not normally found in hospitals of our size including major trauma, vascular, renal, interventional cardiology and major head and neck surgery and this reflects in the broad spectrum of ICU admissions.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work approximately a 70:30 split of ICU and anaesthetic sessions and we would welcome specialist interests in either area. We are rated good in all CQC domains on both sites and with your help we can be outstanding!&lt;/p&gt;\n&lt;p&gt;On call duties will be 1 in 9 nights on call for ICU. Daytime weekly working consists of a mix of intensive care and anaesthetic theatre sessions. Intensivists work 24 hours when on call and participate in a 1 in 10 ‘hot week’ Monday to Friday week as daytime continuity consultant. There is the expectation of at least 20 days per annum work at the ICU in WCH and attendance at the monthly ICU meetings incorporating governance, morbidity and mortality and education.&lt;/p&gt;\n&lt;p&gt;This is a new post, forming part of the expansion of anaesthetic and intensive care.&lt;/p&gt;\n&lt;p&gt;Any enquiries should contact Dr Jon Sturman, Clinical Director ICU on 01228 523444 ext 14196&lt;/p&gt;\n&lt;p&gt;As a Consultant you will be required to participate in Consultant Appraisal and Job Plan Reviews on an annual basis and the revalidation process in line with your professional registration.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to work across the two hospital sites (Cumberland Infirmary Carlisle and the West Cumberland Hospital, Whitehaven).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Relocation assistance of up to £8,000 may be available for successful applicants moving to the region.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: 18th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlisle", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Consultant in Anaesthetics with major interest in ICU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916196511", "validThrough": "2020-11-18T23:59:59+0000"}