{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22199", "minValue": "20771", "unitText": "YEAR", "value": "£20,771 to £22,199 pa inc HCAS"}}, "datePosted": "2020-09-18T17:00:20+0100", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Senior Pathology Support Worker&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;The Virology Department at St Peter’s Hospital Chertsey, part of Berkshire Surrey Pathology Services (BSPS) is looking for Senior Medical Laboratory Assistants to perform routine laboratory duties to support the department in COVID testing. You will receive full training to use and maintain automated equipment in the department to perform COVID assays. The posts are a mixture of bank and fixed term contracts (fixed term for 6 months which may be extended by a further 6 months depending on the ongoing COVID pandemic situation and our response to the testing requirements for this).&lt;/p&gt;\n&lt;p&gt;The department is operating three shifts: Early 6.30am - 3.00pm, Late 2.30 – 11.00pm and Nights 10.30-7.30. We can support a mixture of shifts or a fixed shift e.g. nights only, or part-time workers e.g. evenings and weekends, depending on service need.&lt;/p&gt;\n&lt;p&gt;Your tasks would include routine laboratory duties to support the department including the receipt of samples from specimen reception and tracking, disposal of samples/reagents, preparation of samples for analysis by PCR and antibody assays. The senior pathology support workers answer telephone/email queries and performs maintenance of equipment. In addition you will also receive full training to use and maintain automated equipment in the department to perform COVID assays, rotating through sections of the laboratory under the supervision of biomedical scientists.&lt;/p&gt;\n&lt;p&gt;To be successful, the candidate as well as being friendly and reliable, will need a flexible attitude towards work with good organisational skills, attention to detail and communication. They must have the ability to work under pressure and work well within a team. It would be desirable for the candidate to have previous experience in the accurate and safe use of laboratory equipment and reagents.&lt;/p&gt;\n&lt;p&gt;You must be keen to embrace new ways of working and develop your knowledge and skills in order to grow in the role. You will be working with the Virology senior team to ensure a co-ordinated and effective service is provided by best use of staff and resources to continue to provide a service to UKAS ISO 15189 standards.&lt;/p&gt;\n&lt;p&gt;Our staff benefit from a strong commitment to training and development, minimum 27 days holiday pro rata, access to a career average pension scheme, flexible working, subsidised restaurant facilities and childcare facilities (onsite Nursery).&lt;/p&gt;\n&lt;p&gt;You must demonstrate motivation and interest for joining this busy expanding Virology / COVID Department. If you would like further information, please contact Alison Sergeant, COVID Lead BMS on 01932 723711 alisonsargeant@nhs.uk or Tamara Forster IT Lead BMS Virology on 01932 723877&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Interviews are on-going - you will be notified, within 2 weeks, of the outcome of your application.&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Senior Pathology Support Worker - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916191925", "validThrough": "2020-12-03T23:59:59+0000"}