{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-09-03T16:08:38+0100", "description": "&lt;p&gt;&lt;strong&gt;LOCUM CONSULTANT MICROBIOLOGIST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are sought from an enthusiastic Locum Consultant Microbiologist. The successful applicant will complement and strengthen the current Microbiology Services between Barnsley &amp; Rotherham Integrated Laboratory Service (BRILS). The Rotherham NHS Foundation Trust is the main site and there will be an expectation to undertake duties at Barnsley NHS Foundation Trust if need arises, as part of the formal partnership between the Pathology Laboratories.&lt;/p&gt;\n&lt;p&gt;The candidate will participate in a UKNEQAS interpretive comments scheme (which will be funded by the Trust). The Job Plan will cover a broad range of duties with available resources that is expected from a service covering a population of half a million between the two sites. There will be a requirement for the successful candidate to provide supervision of the Laboratories and provide clinical advice in the diagnosis, treatment and prevention of infections to both the hospital and community settings. Further details of the post are comprehensively covered in the Job Description.&lt;/p&gt;\n&lt;p&gt;The appointee will benefit from a spacious, well-appointed office and secretarial support will be provided. You will become part of a dynamic and friendly team working within a well-established department.&lt;/p&gt;\n&lt;p&gt;The department has close links with The Sheffield NHS Teaching Hospital and there are opportunities to pursue honorary academic positions within Sheffield University.&lt;/p&gt;\n&lt;p&gt;Prospective candidates are strongly encouraged to visit the department; for further information, and to arrange a visit, please contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr. M. Asensio, Associate Specialist Microbiology (01709424742) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr. M. Turzniecka, Co-Director for Laboratory Medicine (01709424412)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr. R. Ali, Co-Director for Laboratory Medicine (01709424600)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For General Enquiries please contact Medical Recruitment on 01709 426552.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Locum Consultant in Microbiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916171775", "validThrough": "2020-11-12T23:59:59+0000"}