{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-07-07T12:00:27+0100", "description": "&lt;p&gt;&lt;span&gt;Southern Health NHS Foundation Trust provides integrated Community, Mental Health, Learning Disabilities and social care employing 7000 staff over 200 locations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a Consultant Psychiatrist to join our established Acute care pathway team at Elmleigh inpatient unit. You would be joining a group of 5 (4.0 full time equivalent) substantive consultants within this pathway. This consists of 2.5 (FTE) consultants working on the inpatient unit and 1.5 (FTE) consultants in the crisis resolution and home treatment team. There are also 8 consultants working within the CMHTs in outpatient settings. The clinical service covers the East Hampshire area of Bordon, Petersfield, Havant, Hayling Island, Fareham and Gosport.which comprises and adult 18-65 population of 240,000.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have an active Research &amp; Development function and we are always looking for more involvement in our research projects; we offer an excellent new consultant induction programme to support and develop you as a new Consultant within SHFT; even if this isn’t your first consultant post this helps orientate you to the organisation. We’ve established this to create a network through your first year with the Trust combining a tailored development programme and coaching with organisational understanding.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that GMC registration (with a licence to practice) and right to work in the UK are essential for this role. Successful applicants will already have GMC registration or will be able to demonstrate they are eligible. Applicants requiring Tier 2 sponsorship should ensure they meet the Home Office application criteria prior to submitting an application.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We think we have a lot to offer and look forward to talking to you about the opportunities available, we strongly encourage an informal visit to the unit’s prior to the assessment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information on the role please email shft.medicalworkforce@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Havant", "postalCode": "PO9 2JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8565", "longitude": "-.975569"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916104036", "validThrough": "2020-11-20T23:59:59+0000"}