{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Includes WTR (Annual Leave element) - see attached"}}, "datePosted": "2020-09-02T16:15:44+0100", "description": "&lt;p&gt;Do you want to work in an Intensive Care in a Trust with PRIDE values and work flexible shifts with weekly pay?&lt;br /&gt;&lt;br /&gt;Do you have Passion, Responsibility, Innovation, Drive and Empowerment then BHRUT is the place for you. Come and join us at a very exciting time for Critical Care at BHRUT. Trust Temps is looking to recruit experienced Band 5 Critical Care nurses. We received fantastic feedback from Under-Secretary of State for Health Ben Gummer, who mentioned us in the House of Commons, citing our “remarkable success” and we have been chosen as one of just eight vanguards across the country helping to transform urgent and emergency care for patients.&lt;br /&gt;&lt;br /&gt;BHRUT has 28 ITU beds and 20 HDU in 3 critical care areas – ITU/HDU at King George Hospital, ITU and HDU at Queen’s and Neuro ITU and HDU at Queen’s.&lt;br /&gt;&lt;br /&gt;The Units provides specialist care across all specialties for critically ill medical and surgical patients, including neurosurgery, neurology, trauma, orthopaedics, general surgery, cardiology, renal including renal replacement therapy and haematology. &lt;br /&gt;&lt;br /&gt;If you are passionate, enthusiastic, motivated and dynamic, we definitely would like to hear from you to join Trust Temps.&lt;/p&gt;\n&lt;p&gt;If shortlisted, you will be invited to attend the Trust for testing, interview and to have your I.D documentation taken and relevant forms completed.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Alison Moore Job title: Recruitment Advisor&lt;/p&gt;\n&lt;p&gt;Email address: alison.moore40@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephonenumber01708 435000 ext 2851&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BHRUT Trust Temps, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Trust Temps (Bank)  Qualified Staff Nurse in ITU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916170053", "validThrough": "2020-12-31T23:59:59+0000"}