{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £51,668 per annum"}}, "datePosted": "2020-09-03T11:00:58+0100", "description": "&lt;p&gt;Due to service developments, an exciting vacancy has arisen for an experienced and enthusiastic Child Clinical Psychologist to contribute to work within our CAMHS locality team. As a Clinical Psychologist within the team you will be responsible for the individual clinical work together with supervision and development of other staff working within a multi-disciplinary team setting that genuinely values psychological perspectives and expertise.&lt;/p&gt;\n&lt;p&gt;At ELCAS, our vision is to be a recognised centre of excellence providing high quality Child and Adolescent psychological and mental health services that exceed people’s expectations. As well as rated Outstanding by the CQC, we are also accredited by the Quality Network for Community CAMHS, part of the Royal College of Psychiatry Centre for Quality Improvement.&lt;/p&gt;\n&lt;p&gt;Whilst the post holder will be expected to work autonomously, it is envisaged that this would be a first step to a seamless intensive assessment and treatment service for young people with highly complex needs and mental health difficulties. There are opportunities to join specialist Systemic and Trauma teams in the service as well as scope to develop your own clinical specialisms.&lt;/p&gt;\n&lt;p&gt;You will be a dynamic and forward thinking person who is prepared to meet the challenges of a changing service, having the skills to manage and influence these changes, whilst providing guidance and specialist input to the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;An ability to assess, formulate and intervene from a multi-theoretical perspective is a must as is the ability to work with young people and families from ethnically and culturally diverse backgrounds.&lt;/p&gt;\n&lt;p&gt;Evidence of at least 2 years CAMHS experience is essential whilst knowledge of IT systems would be advantageous. Supervision requirements are acknowledged and supported by East Lancashire Hospitals Trust and these will be negotiated with the successful candidate in order to meet local and professional need.&lt;/p&gt;\n&lt;p&gt;The service offers placements for trainees in core Psychiatry and General Practice; higher specialty trainees in Child &amp; Adolescent Psychiatry; and students from a wide range of disciplines including nursing and clinical psychology. You will be expected to contribute to the overall training offered within the service and to outside agencies. There are good links with the Universities of Manchester, Liverpool and Central Lancashire.&lt;/p&gt;\n&lt;p&gt;East Lancashire Hospitals NHS Trust is a large and integrated healthcare organisation, with a vision to be widely recognised for delivering safe, personal and effective care. ELCAS is part of the Division of Family Care, and we have close relationships with Paediatric colleagues. We have an innovative Primary Care team working with local GPs and schools, and enjoy strong relationships with a range of third sector agencies through our CYP IAPT Partnership.&lt;/p&gt;\n&lt;p&gt;We want to support you in developing your career in children, young people and young adults’ mental health, and give you the opportunity to drive your ideas forward, having a positive impact on the lives of children and young people.&lt;/p&gt;\n&lt;p&gt;The service currently operates from the Burnley General Hospital site with well-established community clinics running in both Darwen and Blackburn. The role involves travel between sites, so access to private transport for work purposes is essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJo WellerJob titleHead of ServiceEmail addressJoanne.weller@elht.nhs.ukTelephone number01282 803317Additional contact information&lt;/p&gt;\n&lt;p&gt;Andrew Beck - Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;01282 804806 / andrew.beck@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across East Lancashire Sites, Across East Lancashire Sites", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916170754", "validThrough": "2020-11-23T23:59:59+0000"}