{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-09-18T11:46:54+0100", "description": "&lt;h2&gt;The role&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Are you an experienced mental health nurse looking for a new challenge in a demanding and rewarding environment?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Can you inspire clinical staff through engaging training and development sessions?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to experience life in one of the UK’s most beautiful areas, with exciting cities, charming countryside and magnificent coastlines?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a Clinical Practice Nurse to join our secure services team providing mental health and treatment and care for those who need it. The post-holder for this new senior nursing role will be working closely with our ward manager on the admissions ward within our medium secure unit (MSU) to develop clinical practice and bolster our ward leadership team.&lt;/strong&gt; &lt;br /&gt; &lt;br /&gt; In this exciting new role you will use your extensive skills and experience as a professional nurse to plan and deliver staff training and development programmes to support our nurses across the site. By role modelling excellent nursing practice you will help to ensure the quality of care is consistent and that staff understand their roles and responsibilities. &lt;br /&gt; &lt;br /&gt; This is a diverse and challenging role that would be suitable for a confident, skilled and dedicated nurse who wants to make a difference. At Devon Partnership NHS Trust we will offer you the opportunity to grow and develop in one of the UK’s most progressive and well-regarded mental health trusts.&lt;/p&gt;\n&lt;h2&gt;About you&lt;/h2&gt;\n&lt;p&gt;You will be a registered nurse with an RMN or RN (LD) qualification, and at least five-years’ post-registration experience. You will be able to motivate, inspire and support more junior members of staff in developing their professional skills and planning their career. The nature of the role demands extensive people knowledge of the mental health act and other legislation and codes of practice.&lt;/p&gt;\n&lt;p&gt;A clear and confident communicator, you will work closely and collaboratively with colleagues and clinical teams. You’ll be confident at solving problems, and an ability to take on new approaches to care.&lt;/p&gt;\n&lt;p&gt;You will be responsible for delivering training and induction programmes, as well as managing staff performance and ensuring that the quality of care is high. You will have demonstrable experience in leading education and development sessions. You will be able to convey complex information clearly and simply to groups of all sizes&lt;/p&gt;\n&lt;p&gt;Personally, we’re looking for an individual who can inform, inspire and lead. You will demonstrate a commitment to our ideals, share our vision for mental health care, and have a desire to continuously challenge and improve.&lt;/p&gt;\n&lt;h2&gt;Langdon Hospital&lt;/h2&gt;\n&lt;p&gt;Langdon Hospitalis home to Devon Partnership NHS Trust&#39;s forensic mental health service.&lt;/p&gt;\n&lt;p&gt;The service supports people who, as a result of their mental health issues, have had contact with the legal system and need a safe and secure environment that enables them to receive a wide range of treatments, therapies and care to help them recover.\u2028&lt;/p&gt;\n&lt;p&gt;There are seven inpatient wards at Langdon Hospital:&lt;/p&gt;\n&lt;p&gt;• Dewnans Centre, with 4 medium secure wards&lt;/p&gt;\n&lt;p&gt;• Avon &amp; Chichester, low secure&lt;/p&gt;\n&lt;p&gt;• Owen House, an open ward&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/p&gt;\n&lt;p&gt;You’ll be part of a team that is compassionate and supportive, and genuinely committed to working together with the people who use our services, their families and carers in everything that we say and do.&lt;/p&gt;\n&lt;p&gt;Our passion and commitment to achieve this shapes our vision, mission and strategy to promote good mental health and wellbeing. Our staffs are pivotal in everything we do and we are committed to involving them fully in the development of the Trust and our services. All of our members of staff work to our organisational values.&lt;/p&gt;\n&lt;h2&gt;Our offer to you&lt;/h2&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. If you are looking to relocate to the fabulous county of Devon we have a relocation package that may be suitable for you.&lt;/p&gt;\n&lt;p&gt;Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working&lt;/li&gt;\n&lt;li&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service with the NHS so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training - including opportunities to work in different services to build your experience and skills&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Refer a friend scheme applies – both earn up to £500* T&amp;C&#39;s apply - See info in links&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Living here&lt;/h2&gt;\n&lt;p&gt;Exeter is a thriving city with fine dining restaurants, excellent schools and flourishing art scene. Alongside a dynamic city lifestyle, as the third largest county in England, it’s no wonder Devon can also offer people the space to contemplate, to relax and reinvigorate yourself. You’ll also have access to some of the UK’s most beautiful countryside and coastlines.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dawlish", "postalCode": "EX7 0NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5997", "longitude": "-3.46819"}}, "title": "Clinical Practice Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916190862", "validThrough": "2020-11-15T23:59:59+0000"}