{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15717", "minValue": "14876", "unitText": "YEAR", "value": "£8.85 to £9.35 per hour"}}, "datePosted": "2020-07-24T09:56:11+0100", "description": "&lt;p&gt;&lt;em&gt;It is really important that our team feel safe when coming to work. We are taking extra precautions in all of our homes, including having freely available PPE, enhanced cleaning, strict hand hygiene, daily temperature checks for all team members and access to the latest information and training. As well as this, we always ensure that we are working in line with the latest Public Health England guidelines. More information on COVID-19 and our commitment to our staff and residents can be found on our website.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Night Care Assistant - Braintree, Essex&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;Riverdale Care Home, Duggers Lane, Braintree, Essex, CM7 1BA&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt;From £8.85 to £9.35 per hour (depending on experience) plus a 50p per hour night enhancement!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;Full time (39 hours per week) or part time, permanent or temporary&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shifts:&lt;/strong&gt;8pm-8am, Monday to Sunday&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We need you now, they need you always...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Westgate Healthcare we know our success depends not just on the happiness of our residents, but also on the happiness of our team. We are currently looking for people to join our team who have an interest in helping others, a ‘can-do’ attitude and are happy to go that extra mile just to make someone’s day. Our team members should have a passion to care for others, and strive to make a difference to the lives of our residents.&lt;/p&gt;\n&lt;p&gt;Riverdale is a luxurious home, equipped to offer residents the complete care package. Riverdale is built according to dementia care best practice; a central circular corridor provides a continuous path around a secure sensory courtyard. All areas of the home reflect a homely, calming environment for our residents, drawing inspiration from our beautiful surroundings.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Night enhancement to increase your hourly wage!&lt;/li&gt;\n&lt;li&gt;‘Refer a Friend’ scheme with instant cash rewards&lt;/li&gt;\n&lt;li&gt;Great induction and on-going training&lt;/li&gt;\n&lt;li&gt;Career progression and support in achieving nationally recognised qualifications&lt;/li&gt;\n&lt;li&gt;Immediate start available (subject to DBS and references)&lt;/li&gt;\n&lt;li&gt;Holiday entitlement, bank holiday pay enhancements, contributory pension scheme, free DBS (refunded upon completion of probation period), free uniform, long service awards and access to discounts from hundreds of nationwide high street and online stores through our Perkz scheme and Blue Light Card&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE ROLE:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work in a team and build relationships with your fellow team members&lt;/li&gt;\n&lt;li&gt;Support our residents with their daily activities whether this be assisting a resident to wash and dress in the morning, developing their individual care plan, or helping them choose and eat their favourite meal&lt;/li&gt;\n&lt;li&gt;Be a friend who our residents can rely on to champion their dignity, independence and support them to live happy and healthy lives.&lt;/li&gt;\n&lt;li&gt;Think on your feet, communicate effectively, take on responsibility, prioritise your work load and keep accurate records.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT YOU:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Right to live and work in the UK&lt;/li&gt;\n&lt;li&gt;Good communication skills, both verbal and written&lt;/li&gt;\n&lt;li&gt;Ability to work in a team and take initiative&lt;/li&gt;\n&lt;li&gt;Previous experience of working with the elderly is desirable but not essential&lt;/li&gt;\n&lt;li&gt;Relevant qualifications such as NVQ in Health &amp; Social Care is desirable but not essential&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Come and make a difference with the team at Westgate Healthcare! #&lt;/strong&gt;&lt;strong&gt;CareWithUsAtWestgate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For more information on adult social care jobs with Westgate Healthcare visit our website or speak to a member of our recruitment team on 07508 907 679.&lt;/p&gt;\n&lt;p&gt;Due to a high volume of applications, if you do not hear from us within 5 working days, please assume that your application has been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“We are an equal opportunities employer and welcome applications from all suitably qualified persons regardless of their race, sex, disability, religion/belief, sexual orientation or age.&quot;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Westgate Healthcare Group Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135377"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Braintree", "postalCode": "CM7 1BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8716", "longitude": ".563199"}}, "title": "Care Assistant - Nights", "url": "https://www.jobs.nhs.uk/xi/vacancy/916124478", "validThrough": "2020-12-28T23:59:59+0000"}