{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32691", "minValue": "32691", "unitText": "YEAR", "value": "£32,691 Locally Agreed Medical Pay Rates - Attache"}}, "datePosted": "2020-09-03T10:46:50+0100", "description": "&lt;p&gt;&lt;strong&gt;Here’s a Medical Staff Bank that really cares…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Remarkable Bank is a new locum service for doctors that provides temporary cover when and where it’s needed most.&lt;/p&gt;\n&lt;p&gt;Employing 9,000 staff within Hull Royal Infirmary and Castle Hill Hospital, and serving over a million people, we are a trust that works right across this extraordinary place and reflects the remarkable people it serves.&lt;/p&gt;\n&lt;p&gt;We want everyone to be a shining example of a happy, healthy, high performing workplace. All in the middle of a great region to live, work, and unwind.&lt;/p&gt;\n&lt;p&gt;As a Bank employee, you’ll receive:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Booking and reviewing shifts easily from your smartphone or laptop&lt;/li&gt;\n&lt;li&gt;Competitive rates of pay&lt;/li&gt;\n&lt;li&gt;Money in the bank … every week.&lt;/li&gt;\n&lt;li&gt;A dedicated support team.&lt;/li&gt;\n&lt;li&gt;Mandatory and statutory training.&lt;/li&gt;\n&lt;li&gt;Regular work with remarkable people in an extraordinary place.&lt;/li&gt;\n&lt;li&gt;Flexible working with shifts to suit and patterns to please.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You should have achieved F1 competencies or equivalent, full GMC Licence to Practice, and experience of working in the NHS. If you believe you can support, shape and enhance what we do, we would really like to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Be a part of it, you’ll love it. We PROMISE. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hull University Teaching Hospitals NHS Trust is launching their &lt;strong&gt;&lt;em&gt;“Remarkable Bank”&lt;/em&gt;&lt;/strong&gt; for doctors of all grades to join our team.&lt;/p&gt;\n&lt;p&gt;The two main hospitals in the Trust, Hull Royal Infirmary and Castle Hill Hospital serve an extended population 1.2 million. The Trust is a Cancer Centre and major trauma centre and also provides tertiary services for a population of more than one million: Radiotherapy, Neurosurgery, Cardio-thoracic Surgery and Renal Dialysis.&lt;/p&gt;\n&lt;p&gt;The Trust has been the base for the Postgraduate Medical School since 1994 with extensive opportunity for research. It accepted its first intake of undergraduate medical students into the Hull York Medical School (HYMS) in September 2003.&lt;/p&gt;\n&lt;p&gt;Hull is a thriving university city with excellent shopping and leisure facilities including concert halls, theatres and the largest aquarium in Europe. It is surrounded by attractive villages and countryside with the Minster town of Beverley only 8 miles from Hull Royal Infirmary and 4 miles from Castle Hill Hospital. It is within easy reach of the Yorkshire Moors and Dales and the East Coast. It has excellent road and rail links with the rest of Britain, as well as ferry and air links to Europe.&lt;/p&gt;\n&lt;p&gt;The Trust is situated in an area of the country where the cost of living is very reasonable. It has excellent access to other parts of the UK and overseas, including quiet roads, direct rail links to London (2 ½ hours), Manchester (2 hours), ferry services to the continent, and flights to the international hub of Schiphol from Humberside airport.&lt;/p&gt;\n&lt;p&gt;Visit our website for more information about the Trust and our “Remarkable Bank”&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;When applying for this could you please add a note to say if you would like to work in Medicine or Surgery or both.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmployee Service Centre HelpdeskEmail addressesc.helpdesk@hey.nhs.ukTelephone number01482 468400Additional contact information&lt;/p&gt;\n&lt;p&gt;Employee Service Centre Helpdesk - esc.helpdesk@hey.nhs.uk / 01482468400&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull Royal Infirmary &amp; Castle Hill Hospital, Hull", "postalCode": "HU3 2JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7444", "longitude": "-.358277"}}, "title": "Bank Doctor - HUTH &quot;Remarkable Bank&quot;", "url": "https://www.jobs.nhs.uk/xi/vacancy/916170710", "validThrough": "2021-01-31T23:59:59+0000"}