{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 pa pro rata"}}, "datePosted": "2020-07-23T08:54:37+0100", "description": "&lt;p&gt;Consultant Clinical Lead - Diabetic Eye Screening Programme&lt;/p&gt;\n&lt;p&gt;Location: Notional Base Memorial Hall, Memorial Hospital, Darlington with clinics throughout trust area.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a part-time Consultant Clinical Lead Band YC72 to join our friendly and enthusiastic Diabetic Eye Screening Programme supporting the delivery and development of the service. The service is provided across 10 hospital and community sites throughout County Durham and Darlington.&lt;/p&gt;\n&lt;p&gt;This is a combined leadership, training and direct clinical role and will facilitate regular MDT meetings. The role can consists of 2 or 3 clinical sessions per week, however, there is the possibility to work these sessions flexibly which can be discussed at interview.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be the Clinical Lead for the programme being responsible for maintaining the clinical quality of the service through regular monitoring of clinical staff performance and the provision of ongoing education and training.&lt;/p&gt;\n&lt;p&gt;The Clinical Lead will be expected to prepare and deliver regular Multidisciplinary and Clinical Governance meetings whilst providing required training to relevant staff along with the ability to effectively represent the service within various arenas, locally and nationally.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits please contact: Kevin J Garrigan - Programme Manager: kevin.garrigan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Consultant Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916122807", "validThrough": "2020-11-30T23:59:59+0000"}