{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22186", "minValue": "22186", "unitText": "YEAR", "value": "£22,186 per annum"}}, "datePosted": "2020-07-16T13:49:31+0100", "description": "&lt;h2&gt;&lt;span&gt;The Royal Hospital for Neuro-disability is a non for profit medical charity, based in Putney, South West London. We provide short, long-term, continuing care specialist rehabilitation services (assessment, rehabilitation, and disability management) for adults with profound or complex disabilities resulting from damage to the brain or nervous system. Through these services, we seek to enable people with neuro-disability to enjoy an optimal quality of life.&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;We are seeking enthusiastic and motivated individuals who wish to gain knowledge and skills in this specialised area of care.&lt;/p&gt;\n&lt;p&gt;Key responsibilities are to work as part of the multi disciplinary team assisting the registered nurses in delivering a high standard of care to the patients and residents of the hospital and in maintaining morale of residents by interaction and communication that is positive, optimistic and instilling hope.&lt;/p&gt;\n&lt;p&gt;To explore more about this position, please read the full job description attached.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;In order to be shortlisted for this position, you must have the following: &lt;/strong&gt;&lt;/h1&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;strong&gt;You MUST hold a FULL NVQ / QCF Level 2 in Health or Health and Social Care (or above), proof of certificates (including the unit submission) must be provided at the assessment centre, otherwise your application will not be advanced&lt;/strong&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;strong&gt;Right to Work in the UK. We are unable to sponsor candidates for this position and are unable to assess candidates whose visas are attached to expired passports (you must have your biometric card, if applicable)&lt;/strong&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We offer opportunities to be involved in expanding knowledge in a specialist clinical setting with a good work-life balance, free on-site parking, accommodation, lovely grounds, staff cafeteria, coffee shop, close to good transport links, friendly working environment, good team work and a staff pension scheme.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Contract Types:&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We offer Permanent, Full-Time / Part-Time contracts. All succesful permanent candidates are expected to work flexibly in accordance to the wards&#39; need (Day shift, Long Day shift, Nights and Weekends). We also have Bank contracts available&lt;/p&gt;\n&lt;h2&gt;Closing Date:&lt;/h2&gt;\n&lt;p&gt;Please note that we also reserve the right to close this before the proposed closing date of theadvert should we receive high number of applications. Due to the anticipated high volume of applications, please note that we are not able to communicate individual feedback to all applicants. If you do not hear from us, 3 weeks after the closing date please consider your application as being unsuccessful.&lt;/p&gt;\n&lt;h1&gt;Assessment / Interview:&lt;/h1&gt;\n&lt;p&gt;If shortlisted to this post, please note that you will be invited to an assessment which involves a series of exercises (numeracy, english, care plan exercise and role play scenario) and a competency based interview. All of the above will be conducted on the same day.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Putney, London", "postalCode": "SW15 3SW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4522", "longitude": "-.213652"}}, "title": "Healthcare Assistant - Level 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916115360", "validThrough": "2020-12-31T23:59:59+0000"}