{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15129", "minValue": "14288", "unitText": "YEAR", "value": "Current £8.50 - £9.00/HR"}}, "datePosted": "2020-09-12T07:09:36+0100", "description": "&lt;p&gt;Northern Health Care provides mental health recovery services across the North of England. Our services include both residential units and community outreach including 24 hr support and access to experienced qualified staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to continued expansion we are looking to recruit Support Workers for our service in Accrington.&lt;/p&gt;\n&lt;p&gt;You will be working in a 24-hour supported living, mental health rehabilitation unit on a rotational shift pattern 8am-8pm days and 8pm-8am waking nights.&lt;/p&gt;\n&lt;p&gt;We are seeking caring, compassionate and committed Support Workers to provide the support that allows our clients to lead ordinary lives. As part of this role we can offer variety, progression, training and job satisfaction.&lt;/p&gt;\n&lt;p&gt;A positive attitude, friendly, caring &amp; understanding nature are an absolute must. Our client’s sometimes need support and they have varied lives and interests, this could be trains, cooking, art or going to social groups. We are seeking caring, compassionate and committed individuals with the right values to be support workers, supporting our clients to lead fulfilling and independent lives. That’s where you come in.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Description&lt;/strong&gt;&lt;br /&gt;Support client’s day to day to be able to live a full and independent life.&lt;br /&gt;Act as an advocate and key worker as and when required&lt;br /&gt;Dispense medication / support clients with taking of medication&lt;br /&gt;Support the service user in line with the care plans&lt;br /&gt;Working positively with other staff within the team&lt;br /&gt;Support the clients to keep a tidy flat and encourage hygiene and cleanliness&lt;br /&gt;Encourage clients to maintain a healthy and active lifestyle&lt;br /&gt;Where appropriate support the involvement of families, friends, social workers etc&lt;br /&gt;Complete all administration work as required using a computer&lt;br /&gt;Work within and implement our policy and procedure, including confidentiality and safeguarding&lt;/p&gt;\n&lt;p&gt;Ideally, you will have some experience or have gained your level 2 or 3 in Health and Social Care,however we will also recruit staff with no experience as long as you show passion and the values a support worker requires to work in care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to the nature of the role, we will pay for you to complete an enhanced Disclosure &amp; Barring Service (DBS) check, prior to starting with us.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135974.JPG", "name": "Northern Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135974"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Accrington", "postalCode": "BB5 1BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7582", "longitude": "-2.36789"}}, "title": "Support Workers (Accrington)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916182539", "validThrough": "2020-11-30T23:59:59+0000"}