{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34700", "minValue": "3000", "unitText": "YEAR", "value": "£34,700 &amp; £3000 Welcome Bonus"}}, "datePosted": "2020-07-07T16:36:50+0100", "description": "&lt;p&gt;Priory Hospital Dewsbury is a purpose built 32 bedded locked service, supporting two different service user groups:&lt;/p&gt;\n&lt;p&gt;Hartley Ward focuses upon the active rehabilitation of men with mental health issues. The emphasis is upon stabilising mental health, reducing risks and enhancing independent living skills, with a view to reintegration into the community.&lt;/p&gt;\n&lt;p&gt;Jubilee Ward supports men with Dementia and/or other neurodegenerative disorders, along with behaviours that challenge. We recognise that a number of our clients on Jubilee Ward require a longer term placement.&lt;/p&gt;\n&lt;p&gt;Our Senior Staff Nurse role involves:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•As a Senior Staff Nurse you will be working within a transdisciplinary team that includes a range of professional.&lt;/p&gt;\n&lt;p&gt;•Contributing to pre-admission assessment of referred patient&lt;/p&gt;\n&lt;p&gt;•Contributing to the comprehensive assessment of a patient on admission.&lt;/p&gt;\n&lt;p&gt;•Looking collaboratively with the individuals to develop their care plan&lt;/p&gt;\n&lt;p&gt;•Compiling a positive risk management plan.&lt;/p&gt;\n&lt;p&gt;•Monitoring and reviewing individualised patient plans, within an evidence based framework.&lt;/p&gt;\n&lt;p&gt;•Prioritising, organising, and deploying under direction, resources to meet the requirements of the ward for the duration of a shift.&lt;/p&gt;\n&lt;p&gt;•Committing to the promotion of basic living skills within a Rehabilitation Setting.&lt;/p&gt;\n&lt;p&gt;•Contributing to the delivery of evidence based therapeutic interventions as agreed by the transdisciplinary team.&lt;/p&gt;\n&lt;p&gt;•Managing medication as per hospital policy.&lt;/p&gt;\n&lt;p&gt;•Adhering at all times to the NMC code of professional conduct.&lt;/p&gt;\n&lt;p&gt;•Ensuring that you are up to date with relevant hospital policies.&lt;/p&gt;\n&lt;p&gt;•Treating others with dignity, respect, honesty, integrity and fairness.&lt;/p&gt;\n&lt;p&gt;•Taking charge of the unit as and when is required.&lt;/p&gt;\n&lt;p&gt;•Communicating effectively with the team.&lt;/p&gt;\n&lt;p&gt;•Taking on the case load of more complex and challenging patients&lt;/p&gt;\n&lt;p&gt;•Act as a role model for other staff, demontrating good practice&lt;/p&gt;\n&lt;p&gt;•To be fully conversant and comply with current legislation and professional standards.&lt;/p&gt;\n&lt;p&gt;•To be successful for the higher level nurse positions you would be expected to take on a higher level of responsibility in the above tasks; beyond monitoring, reviewing and contributing.&lt;/p&gt;\n&lt;p&gt;Managerial&lt;/p&gt;\n&lt;p&gt;•Be responsible for the provision of regular supervision sessions and ensure that annual appraisals are completed for allocated nursing staff in accordance with Hospital policy.&lt;/p&gt;\n&lt;p&gt;•To assist in leading and monitoring the performance of the nursing team.&lt;/p&gt;\n&lt;p&gt;•To be able to plan, organise and deploy staff according to competencies and workload in order to meet patient needs.&lt;/p&gt;\n&lt;p&gt;•Act as a mentor for junior staff&lt;/p&gt;\n&lt;p&gt;•Support recruitment of unqualified staff&lt;/p&gt;\n&lt;p&gt;•Ensure thorough inductions are completed for all new and bureau staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To be successful as a Senior Staff Nurse, you’ll need:&lt;/p&gt;\n&lt;p&gt;•RMN/RNLD Qualification&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Skills/Knowledge:&lt;/p&gt;\n&lt;p&gt;•Completion of pre-registration/ Preceptorship&lt;/p&gt;\n&lt;p&gt;•Self motivated&lt;/p&gt;\n&lt;p&gt;•Positive role model&lt;/p&gt;\n&lt;p&gt;•Drive to take responsibility for personal learning and development.&lt;/p&gt;\n&lt;p&gt;•Experience of working in a similar environment and role&lt;/p&gt;\n&lt;p&gt;•A focus on patient centred care&lt;/p&gt;\n&lt;p&gt;•Demonstrable experience of being a team player&lt;/p&gt;\n&lt;p&gt;•Ability to be self-motivated and flexible&lt;/p&gt;\n&lt;p&gt;•For higher level nursing position strong Leadership and management of people skills&lt;/p&gt;\n&lt;p&gt;•Ability to problem solve and have a solution focussed approach.&lt;/p&gt;\n&lt;p&gt;Experience&lt;/p&gt;\n&lt;p&gt;•Experience of working within an environment with patients presenting as challenging in management.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Need to be committed to:&lt;/p&gt;\n&lt;p&gt;•Personal learning and development&lt;/p&gt;\n&lt;p&gt;•Evidence based practice&lt;/p&gt;\n&lt;p&gt;•Values based practice&lt;/p&gt;\n&lt;p&gt;•Patient centred care&lt;/p&gt;\n&lt;p&gt;•Team player&lt;/p&gt;\n&lt;p&gt;•Self-motivated&lt;/p&gt;\n&lt;p&gt;•Flexible&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "DEWSBURY", "postalCode": "WF12 7LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6937", "longitude": "-1.61427"}}, "title": "SENIOR STAFF NURSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916104888", "validThrough": "2020-11-27T23:59:59+0000"}