{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 plus R&amp;R premia"}}, "datePosted": "2020-09-01T14:42:35+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;The Role&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Full Time Consultant Psychiatrist in Older Adults, Grantham&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;LPFT are advertising for a full time Consultant Psychiatrist in Older Adults in Grantham providing a comprehensive psychiatric service to the older people of Southwest Lincolnshire. This entails assessment, diagnosis and treatment of organic and functional disorders in over 65s, although younger adults meeting certain eligibility criteria on the local transitional protocol may be suitable for the service. In line with New Ways of Working, it is expected that the post holder will keep a small personal caseload.&lt;/p&gt;\n&lt;p&gt;The post-holder will play a leading role in the development of the Community Mental Health Team for older people. As an integral member of a MDT there will be an expectation to participate in local weekly team meetings where cases are discussed and management plans formulated. The role of the consultant within then team is to deal with complex cases and support other members of the team so that they practice independently as much as possible.&lt;/p&gt;\n&lt;p&gt;The post- holder it to support the Memory Assessment Service by contributing to making/formulating diagnoses of dementia in the early stage as well as managing more complex behavioural and psychological problems in the latter stage.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;What’s on offer &lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Lincolnshire Partnership NHS Foundation Trust (LPFT) is a high performing and financially sound organisation. We are rated in the top two Mental Health Trusts in England (Staff Survey); ‘Good’ overall and ‘Outstanding’ for well-led (CQC); and consistently recognised by our junior doctors as the best place in the east midlands for their education, learning and development (GMC Survey). We have vacancies for Consultants and Specialty Doctors across the county of Lincolnshire and we are looking for individuals, with the right vales and behaviours, to come and join us. We can offer you the following support and opportunities:&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Attractive remuneration package that includes an additional recruitment premium(R&amp;R) and local pensions options&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Flexible relocation package&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Protected time for research and/or special clinical interest&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Study leave of 30 days over 3 years with a study leave budget of £2000 per person per annum&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A strong ethos on learning and development for medical staff&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Annual Clinical Excellence Awards&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent staff benefits, e.g. subsidised lease car, a variety of salary sacrifice and savings schemes&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Health and wellbeing support, e.g. early access to physiotherapy, psychological therapies&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Flexible working and less than full time applications supported&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Active internal medical bank with opportunity to undertake extra paid duties&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Why Lincolnshire?&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The county offers an excellent standard of living with the best schools (the majority of senior schools being grammar and academies), below average house prices, lowest crime rates, good air quality, less pollution and beautiful surroundings.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Lincolnshire first Medical School in collaboration with The University of Nottingham and University of Lincoln will take its first cohort of medical students in from September 2019. The Medical School inspiring waterfront campus is right in the heart of a friendly and vibrant city of Lincoln with the aim of creating future medical workforce that is from the community and for the community. LPFT has Senior Consultant representatives steering the development of the medical school ensuring psychiatry is at the forefront of the curriculum as well as cementing quality placements within LPFT. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Why LPFT?&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an excellent and exciting time to join an innovative Trust, aspiring for better patient outcomes. As well as being recognised as one of the best Trusts nationally, we are a values led organisation who believe in compassionate and inclusive leadership. We have been awarded regionally nationally for our work on equality and diversity (including the Stonewall top 100 employers), patient safety, community partnerships and our workforce. Enhancing innovation, research and clinical effectiveness is also a key area for development and we are particularly seeking individuals who can lead in the delivery of National Institute for Health Research (NIHR). Medics are supported with their special interest groups coupled with having an excellent post graduate training experience and medical education team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note whilst this post is commissioned to be full time (40 hours per week) the Trust would welcome applications from those wanting an improved work life balance and if you would like to consider this post on less than full time hours please apply and outline this on your application form and this will be looked at favourably. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants should note LPFT would consider merging job plans to provide the variety and experience you are looking for.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For initial enquiries please contact Dr Ananta Dave, Medical Director on &lt;/span&gt;&lt;span&gt;Ananta.dave@nhs.net &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grantham", "postalCode": "NG31 8DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.921", "longitude": "-.641874"}}, "title": "Consultant Psychiatrist Older Adult", "url": "https://www.jobs.nhs.uk/xi/vacancy/916168009", "validThrough": "2020-12-12T23:59:59+0000"}