{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-09-18T16:01:31+0100", "description": "&lt;p&gt;&lt;strong&gt;Care Organisation: Oldham Care Organisation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title: &lt;/strong&gt;Consultant Community Paediatrician&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Speciality: &lt;/strong&gt;Community Paediatrics/Community Child Health&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract type and hours: &lt;/strong&gt;Permanent – 10PAs&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;________________________________________________________________&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Department and job role&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for a Consultant Community Paediatrician to join our established service in Oldham. You will have a major role in further development of already existing excellent community paediatric service for children who are resident of Oldham and registered with General Practitioners.&lt;/p&gt;\n&lt;p&gt;You will support a team of community paediatricians in the provision of a wide range of community paediatric medical services which includes Neurodisability, Paediatric Audiological Medicine, Adoption and Fostering, transition services for families registered within the area.&lt;/p&gt;\n&lt;p&gt;We are particularly interested in appointing someone who has the capability and passion to lead the neurodisability and transition elements of our service.&lt;/p&gt;\n&lt;p&gt;The newly appointed Consultant Community Paediatrician will be part of Paediatric Directorate which is part of the Women and Children’s Division of The Pennine Acute Hospitals NHS Trust (PAHT). There are no acute or on call commitments to this post.&lt;/p&gt;\n&lt;p&gt;You will have unrivalled opportunities to help improve the patient experience and quality of care of children with neurodisability, special educational needs and child protection and contribute to developing future community paediatricians by contributing to Level 3 community child health trainee supervisions. As part of the acute Trust, the paediatric directorate offers a supportive and encouraging environment and there is a well-established joint working with acute paediatricians. The Trust hosts MRCPCH clinical examination and a number of the Consultants are examiners and senior examiner for MRCPCH.&lt;/p&gt;\n&lt;p&gt;Candidates must have full GMC registration with valid license to practice and will have MRCPCH or equivalent CCT / CESR holders in Community Child Health or within 6 months of achieving a CCT (or equivalent) at the date of interview. Candidates with CCT or equivalent in General paediatrics are also welcome to apply but must be able to show evidence of how they have achieved the Level 3 competences in Community Child Health / Safeguarding.&lt;/p&gt;\n&lt;p&gt;The Job Description indicates the main duties of the post, which may be reviewed in the light of experience and developments within the service. Any review will be undertaken in conjunction with the post holder. All permanent consultants are eligible for relocation allowance as per the terms and conditions of the NHS Consultant contract. The Mission Statement is enshrined in our value statements:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Patient care is at the centre of everything we do. We work together to deliver a high quality service to provide the best possible outcome for patients.&lt;/li&gt;\n&lt;li&gt;Accountability, honesty and integrity are keys to our success both individually and across the Trust.&lt;/li&gt;\n&lt;li&gt;Treating everyone with respect and promoting good working relationships will support individuals in reaching their full potential.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our Care Organisations are designed to operate within our group arrangement of hospitals, community and healthcare services which bring together over 17,000 staff and the services of The Pennine Acute Hospitals NHS Trust and Salford Royal NHS Foundation Trust. Our size and geographical reach means we are creating an environment each individual will be inspired and empowered by to be the best they can be. This is a really exciting time to join our new team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Prospective candidates are encouraged to visit the Trust and meet members of the management team and other senior members of staff. Appointments can be made for a visit at any point prior to the date of interview.&lt;/p&gt;\n&lt;p&gt;Please contact: Dr Christine Howard directly to make an appointment on&lt;/p&gt;\n&lt;p&gt;Tel: 0161 622 1262 /484 1252&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Email: christine.howard@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Oldham Hospital, Oldham", "postalCode": "OL1 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5533", "longitude": "-2.12183"}}, "title": "Consultant Community Paediatrician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916191746", "validThrough": "2020-11-08T23:59:59+0000"}