{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "9491", "minValue": "9491", "unitText": "YEAR", "value": "£9,491.56"}}, "datePosted": "2020-08-20T10:06:05+0100", "description": "&lt;p&gt;Priory Group is the leading healthcare provider for mental health services in the UK with an established track record of delivering high-quality clinical care. The Priory Hospital Southampton is part of the Priory group offering outpatient, day care and inpatient treatment for a wide range of mental health difficulties. The hospital is located in Marchwood on the outskirts of Southampton and comprises 40 inpatient beds across three wards.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Sandpiper Ward: This is an acute admissions unit comprising 17 beds.  Skylark Ward:  11 bedded specialist eating disorders unit&lt;/p&gt;\n&lt;p&gt;Kingfisher Ward:  12 bedded CAMHS inpatient unit&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hospital has a combination of employed and visiting consultants and well established multidisciplinary teams in all wards including nursing, therapy, occupational therapy and psychology input. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hospital provides a combination of NHS funded and private care and has been rated as “Good” in recent CQC inspection with “outstanding” rating in the &quot;caring&quot; domain.&lt;/p&gt;\n&lt;p&gt;The main purpose of the Psychology Assistant will be to assist professional and clinical staff with the planning, implementation and evaluation of therapy and care plans in order to support the mental, emotional, physical and social well-being of assigned clients, their carers and their families.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The duties include:&lt;/p&gt;\n&lt;p&gt;- Support senior staff with patient screening and assessment as part of the care and therapy-planning process, assisting with tests, observations and therapy sessions as directed.&lt;/p&gt;\n&lt;p&gt;- Assist with the planning, delivery and review of one-to-one and group therapy sessions ensuring activities and interventions continue to meet the needs of the client as detailed in the individual’s therapy plan and as directed by senior staff.&lt;/p&gt;\n&lt;p&gt;- Maintain accurate and up-to-date records in the form of case notes, case files, clinical reports and other associated documentation presenting and sharing relevant information with colleagues, in accordance with company policies and procedures.&lt;/p&gt;\n&lt;p&gt;- Collaborates, with professional and clinical colleagues facilitating related therapy sessions and assisting with research, analysis and audit activities as directed.&lt;/p&gt;\n&lt;p&gt;- Addresses routine incidents and issues, referring more unusual occurrences to senior staff.&lt;/p&gt;\n&lt;p&gt;- Teaches and coaches junior or less experienced colleagues as appropriate.&lt;/p&gt;\n&lt;p&gt;- Collective responsibility for the care and security of equipment and other consumables within the unit.&lt;/p&gt;\n&lt;p&gt;- Responsible for the accuracy, security and confidentiality of patient records.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; Knowledge &amp; Skills&lt;/p&gt;\n&lt;p&gt;- The role holder will need to have appropriate degree, whilst working towards professional registration/accreditation.&lt;/p&gt;\n&lt;p&gt;- Previous general work experience.&lt;/p&gt;\n&lt;p&gt;- Well-developed communication and interpersonal skills are an important feature, as this role holder has to gain the trust and build the confidence patients, families and, carers while maintaining good working relationships with consultants, external organizations and agencies. The role holder will undertake some coaching of clinical models, but under supervision.&lt;/p&gt;\n&lt;p&gt;- Flexibility and adaptability as usually, the role holder will work within existing procedures; occasionally, the role holder may be required to adapt their behaviour within existing processes, in order to accommodate requests from patients, pupils and other colleagues.&lt;/p&gt;\n&lt;p&gt;- Intelligent problem solving will based upon acquired knowledge and skill gained through experience and supervised practice.&lt;/p&gt;\n&lt;p&gt;- A creative approach is required when facilitating therapy sessions. .&lt;/p&gt;\n&lt;p&gt;- Great Team player&lt;/p&gt;\n&lt;p&gt;- Strong “can do” attitude&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Special Features&lt;/p&gt;\n&lt;p&gt;- Role holder must participate in appropriate clinical supervision.&lt;/p&gt;\n&lt;p&gt;- The role holder will be required to take part in Priory’s mandatory training programme.&lt;/p&gt;\n&lt;p&gt;- The problems faced by patients may present challenging situations, which may increase the physical, sensory and emotional demands of the role.  &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Benefits&lt;/p&gt;\n&lt;p&gt;Our benefits are flexible and tailored to each individual staff. Some of the benefits we offer you include;&lt;/p&gt;\n&lt;p&gt;• A competitive salary&lt;/p&gt;\n&lt;p&gt;• Up to 25 days annual leave plus Bank holidays&lt;/p&gt;\n&lt;p&gt;• Birthday Leave&lt;/p&gt;\n&lt;p&gt;• Continuing Professional Development opportunities&lt;/p&gt;\n&lt;p&gt;• Pension scheme with a Priory contribution&lt;/p&gt;\n&lt;p&gt;• Your Priory, Your Benefits + - Our shopping discount site where you’ll find great offers for online and in-store shopping, negotiated specially for everyone who works at the Priory Group.&lt;/p&gt;\n&lt;p&gt;• Enhanced Maternity pay in line with NHS&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "PART_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hertfordshire", "postalCode": "SG8 5JP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0781", "longitude": "-.03059"}}, "title": "Psychology Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916155805", "validThrough": "2020-12-02T23:59:59+0000"}