{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 + £2,168 + 1% on-call pro rata"}}, "datePosted": "2020-09-21T16:45:56+0100", "description": "&lt;h1&gt;&lt;strong&gt;Consultant General Adult Inpatient Psychiatry&lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;Woodlands Unit, Queen Mary&#39;s Hospital, Frognal Avenue, Sidcup, Kent, DA14 6LT&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Part Time, 32 hours / 8 PAs per week &lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;£82,096 - £110,683 + £2,168 + 1% on-call supplement pro rata&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Oxleas NHS Foundation Trust, formed in April 1995, is a provider of general mental health services for Bromley, Bexley and Greenwich, and a specialist provider of Forensic and Challenging Behaviour services for Bexley, Greenwich, Lewisham, North Southwark, Bromley, and Learning Disability Services for Greenwich, Bexley and Bromley.&lt;/p&gt;\n&lt;p&gt;Over recent years the Trust has expanded its range of services and now provides Community Health Services in Bexley and Greenwich and a wide range of Prison/forensic services (physical and mental health) in Kent. The Trust was rated as a 3 star organisation for 3 consecutive years and became one of the country’s first mental health foundation trusts in May 2006. Oxleas has been at the forefront of IT developments, New Ways of Working for the Psychiatrists and NICE Guidelines implementation. It was the first Mental Health Trust in London to fully implement RiO as part of London Programme for IT and has since developed its own software solution for electronic records, Oxleas RiO. As an organisation Oxleas sees itself as offering the best practice in ‘needs led technology’ that has been implemented through the electronic care records, and an intranet system to support best clinical practice.&lt;/p&gt;\n&lt;p&gt;The most recent Care Quality Commission (CQC) inspection, in 2018, rated the Trust as ‘Good’ overall, with ‘caring’ on the adult inpatient wards rated ‘Outstanding’.&lt;/p&gt;\n&lt;p&gt;Oxleas NHS Trust now offers a unique Leadership mentoring programme for colleagues new to the Consultant role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post-holder will work with the Lesney ward team based at The Woodlands Unit, Queen Mary&#39;s Hospital, Bexley. The post holder will provide senior medical cover for all acute inpatients (20 patients) admitted to the ward, and be the Responsible Clinician (RC) for all detained inpatients.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post-holder along with the allocated junior doctors will be responsible for all mental health act work related to inpatients and along with other team members ensure that admitted patients have good quality care and that the Trusts quality indicators are not breached.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is expected that the post holder will work very closely with the ward manager to deliver high quality evidence based clinical care to inpatients and take a lead on clinical governance including the delivery of key performance indicators, learning from incidents and service user feedback action plans.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a less than full time role, 8PAs over 4 working days. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There may be capacity for additional work subject to service need across the Bexley Directorate as per discussion with the Clinical Director. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Informal visits to Lesney Ward at The Woodlands Unit will be by appointment with Naidoo Armoordon, Modern Matron. Naidoo may be contacted on 02038895176.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120829.png", "name": "Oxleas NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120829"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woodlands Unit, Sidcup", "postalCode": "DA14 6LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4186", "longitude": ".103279"}}, "title": "Consultant General Adult Inpatient Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916193921", "validThrough": "2020-11-16T23:59:59+0000"}