{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "40000", "unitText": "YEAR", "value": "£40,000 Pro Rata"}}, "datePosted": "2020-09-17T16:56:29+0100", "description": "&lt;p&gt;Join The Limes as a Part-Time Clinical/Forensic Psychologist working between 16 - 24 hours per week and embark on a rewarding career, where you can make a difference and change lives for the better, and experience what delivery great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;Enjoy support from a network of psychologists and a strong emphasis on teamwork and CPD, with continuous access to a range of training opportunities to continue developing your career.&lt;/p&gt;\n&lt;p&gt;Reporting directly to the Hospital Director, you will be responsible for individual and group interventions, diagnostic and cognitive assessments, MDT working and risk assessments. You will also facilitate staff reflective practice sessions and be requested to design and deliver training.&lt;/p&gt;\n&lt;p&gt;As a Clinical/Forensic Psychologist, you will have experience and knowledge in carrying a service user’s caseload, including assessing complex needs and designing and delivering specialist psychological treatments to support their care plans.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a Psychologist, you will be responsible for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supporting the clinical team and area of service in developing new initiatives and ways of working.&lt;/li&gt;\n&lt;li&gt;Working with internal and external agencies to enhance treatment pathways for service users.&lt;/li&gt;\n&lt;li&gt;Supervising and line managing qualified and in-training staff members.&lt;/li&gt;\n&lt;li&gt;Working effectively as a team member, and to take the lead on psychological assessment and interventions within the service area.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you&#39;ll need:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BPS and HCPS registration.&lt;/li&gt;\n&lt;li&gt;Charterable status with the British Psychological Society&lt;/li&gt;\n&lt;li&gt;Experience working in a similar setting.&lt;/li&gt;\n&lt;li&gt;CBT skills&lt;/li&gt;\n&lt;li&gt;Leadership experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you will get:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £40,000 Pro Rata&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Limes provide care for men with personality disorders and mental illness in a diverse service that promotes increased independence and community living.&lt;/p&gt;\n&lt;p&gt;You will empower and support people to reach their own unique goals as you learn about implementing five core zones of Work and Education, Interventions, Social Networks, Health and Empowerment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mansfield", "postalCode": "NG20"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.215", "longitude": "-1.19125"}}, "title": "Part-Time Clinical/Forensic Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916190014", "validThrough": "2020-11-15T23:59:59+0000"}