{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 - £53,459  incl. Fringe HCAS"}}, "datePosted": "2020-09-03T15:47:04+0100", "description": "&lt;p&gt;&lt;span&gt;We are seeking Clinical/Counselling Psychologists &lt;/span&gt;&lt;span&gt;who&lt;/span&gt;&lt;span&gt; are motivated to help change the lives of some of the most vulnerable families in Surrey. The post will be based within the Family Safeguarding Service of Surrey County Council in Woking, Redhill, and Walton-on-Thames or Guildford (permanently seconded from SABP).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our ground-breaking family safeguarding model will bring together all the professionals we need, under one roof, to provide intensive support to parents to address the substance misuse, mental health and domestic abuse that place children at risk of significant harm. An important focus of our model is to invest in training all team members to a high standard in motivational interviewing, to engage parents and children in contributing to their own assessments of risk and change, to make group work and strengthening relationships work part of our everyday work.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will be managed and supervised by the Consultant Clinical/Counselling Psychologist within the Safeguarding service and work alongside a team of social workers and other professionals with parents and their children where there is high risk of severe parenting problems including maltreatment and neglect. The posts will include carrying out supervision, risk assessments and providing group work or one to one interventions with perpetrators of domestic abuse. &lt;/span&gt;&lt;span&gt;You will join a dedicated and enthusiastic multi-disciplinary team committed to developing the highest standards of assessment and treatment for the most vulnerable infants, children and parents. There will be ample opportunity to develop and apply a wide range of skills.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post-holders will be based at Surrey County Council offices. There are professional links across Surrey, with structures in place for supervision and governance.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The candidate must have a full and valid driving licence due to the community element of the role and the large geographical area this Team covers.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity for psychologists with an interest in this field to contribute to the delivery and on-going development of our family safeguarding service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Neena Khosla/ - Family Safeguarding at Neena.Khosla@Surreycc,gov.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woking/ Redhill/Walton-on-Thames /Guildford", "postalCode": "KT22 7AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2976", "longitude": "-.335577"}}, "title": "Clinical/Counselling Psychologist – Family Safeguarding", "url": "https://www.jobs.nhs.uk/xi/vacancy/916171721", "validThrough": "2020-11-17T23:59:59+0000"}