{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 8a"}}, "datePosted": "2020-09-23T17:08:19+0100", "description": "&lt;p&gt;Job Titie: Clinical Pharmacist&lt;/p&gt;\n&lt;p&gt;Salary Band: 8a&lt;/p&gt;\n&lt;p&gt;Accountable to: Partners&lt;/p&gt;\n&lt;p&gt;Full/Part Time: Full Time Permanent&lt;/p&gt;\n&lt;p&gt;The post holder will be an experienced pharmacist, who acts within their professional boundaries and working under the supervision of the GP Partners.&lt;/p&gt;\n&lt;p&gt;To work as part of a multidisciplinary team in a patient centred care and take responsibility for areas of chronic disease management within the practice and undertake clinical medication reviews to proactively manage patients with complex polypharmacy, medicines optimisation, quality improvement, managing aspects of medicines safety and antimicrobial stewardship.&lt;/p&gt;\n&lt;p&gt;The post holder will provide primary support to general practice staff for prescription and medication queries. You will help support the repeat prescription system, medicines reconciliation on transfer of care and systems for safer prescribing, providing expertise in clinical medicines advice while addressing both public and social care needs of patients in the GP practice.&lt;/p&gt;\n&lt;p&gt;The post holder will ensure that the practice integrates with community and hospital pharmacy to help utilise skill mix, improve patient outcomes, ensure better access to healthcare and help manage workload.&lt;/p&gt;\n&lt;p&gt;You will be involved in improving the quality of care and operational efficiencies. Therefore requires motivation and passion to deliver excellent service within general practice.&lt;/p&gt;\n&lt;p&gt;The clinical pharmacists will organise meetings with local community pharmacists to improve collaborative working to provide integrated patient centred care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "E16 3NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5126", "longitude": ".025299"}}, "title": "Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916197650", "validThrough": "2020-11-30T23:59:59+0000"}