{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 pa"}}, "datePosted": "2020-07-16T15:15:12+0100", "description": "&lt;p&gt;Consultant in Gastroenterology&lt;/p&gt;\n&lt;p&gt;We are looking for a consultant gastroenterologist to join our team at Northern Devon Healthcare NHS Trust.&lt;/p&gt;\n&lt;p&gt;We are an innovative trust and use cutting-edge technology to make things happen quickly enabling you to make a real difference in your speciality. We are expanding our endoscopy unit and have clinical nurse specialists in IBD, nutrition and Hep C as well as a non-medical endoscopist forming part of a multi-disciplinary team that will support you to work at the top of your registration.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be given a high degree of autonomy, opportunities to develop the service and time to undertake supporting professional activities including training and teaching or to pursue sub-speciality interests either in North Devon or via our close partnership with the RD&amp;E in Exeter.&lt;/p&gt;\n&lt;p&gt;NDHT is consistently ranked top in the South West for staff satisfaction and is based in Devon, a county rated as one of the best places in Britain to live. We support flexible working and timetables which allow you to enjoy all that our unique location offers from surfing or sailing on pristine beaches to hiking or riding on beautiful moorland.&lt;/p&gt;\n&lt;p&gt;Our Medical Staffing will help you get settled, providing financial relocation support, registration for children at one of the excellent local schools and support for partners seeking employment.&lt;/p&gt;\n&lt;p&gt;Applicants are encouraged to contact Dr Davis or Dr Moran on 01271 313943 for an informal chat ahead of interview.&lt;/p&gt;\n&lt;p&gt;For more information visit ndhtjobs.com&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/134574.jpg", "name": "Northern Devon Healthcare Trust - Medical & Dental", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134574"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnstaple", "postalCode": "EX31 4JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0922", "longitude": "-4.05116"}}, "title": "Consultant in Gastroenterology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916115575", "validThrough": "2020-11-15T23:59:59+0000"}