{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-09-14T14:13:43+0100", "description": "&lt;p&gt;Jointhe newmultidisciplinary team atour new service,Pinhoe ViewinExeter. The service is apurpose-built facility, providing specialist care for adults with acute mental health needs across two wards and eight individual flatsand requires a Consultant Psychiatrist to be part of the team and help shape the care provided.&lt;/p&gt;\n&lt;p&gt;The 24-hour service will be well supported by a multidisciplinary team to support the recovery and rehabilitation of individuals to providea pathway of care supporting them back to their community.&lt;/p&gt;\n&lt;p&gt;Youwillbe trainedin General Adult or ForensicPsychiatry andwill haveexperience working with people with acute mental health and leading multidisciplinary teams. You will be joining the wider network of ConsultantsacrossElysium, giving you access to a support network of like minded professionals.&lt;/p&gt;\n&lt;p&gt;As the finishing touches are made, you will enjoy an extended induction at Wellesley Hospital in Wellington, Somerset. Here you will work alongside a network of healthcare professionals, ensuring you have the necessary training, support and preparation for Pinhoe View. It&#39;s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;Start Date: To beannounced&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals while on duty&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;li&gt;A Group Personal Pension Plan (GPPP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhance&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX1 3PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7264", "longitude": "-3.48346"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916183677", "validThrough": "2020-11-29T23:59:59+0000"}