{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37935", "minValue": "37935", "unitText": "YEAR", "value": "£37,935"}}, "datePosted": "2020-09-23T12:25:46+0100", "description": "&lt;p&gt;&lt;strong&gt;Clinical Teaching Fellow (ST2+ Equivalent)- particular interest in paediatric teaching desirable x 1 post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are pleased to be able to offer one clinical fellow teaching post to be part of the Undergraduate Teaching Academy in Worcestershire to complement our existing 5 teaching fellows.&lt;/p&gt;\n&lt;p&gt;This 12 month post combines clinical experience at CT/ST level with undergraduate teaching of Birmingham and Warwick University medical students. It is suitable for trainees whose career would be advanced by the opportunity to develop clinical skills along with specialist teaching skills. We are particularly interested to hear from candidates with an interest in paediatrics whether as a specialist or from A&amp;E/General Practice. It might be of interest to registered practitioners who are studying for a higher qualification, writing up research, or applying for specialist training rotations, or any combination of these. It may also appeal to higher trainees who wish to take time-out of a training programme, subject to the approval of the appropriate Specialist Training Committee.&lt;/p&gt;\n&lt;p&gt;At least seven half-day sessions will be devoted to teaching plus one half-day session per week allocated to preparation, with exposure to a clinical speciality of choice for the remaining sessions.&lt;/p&gt;\n&lt;p&gt;Although the post does not have education and training approval from the Postgraduate Dean, attention will be paid to the professional development needs of the appointee, who will, in particular, be encouraged to study for a clinical teaching qualification.&lt;/p&gt;\n&lt;p&gt;Interested candidates are advised to contact us to arrange an informal visit and for further information please contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Mark Roberts, Head of Academy - &lt;/strong&gt;mark.roberts14@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Gareth Sellors, Deputy Head of Academy - &lt;/strong&gt;gareth.sellors@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcester", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Clinical Teaching Fellow ST2+ Equivalent", "url": "https://www.jobs.nhs.uk/xi/vacancy/916196740", "validThrough": "2020-11-16T23:59:59+0000"}