{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-09-15T08:30:11+0100", "description": "&lt;p&gt;&lt;span&gt;We currently have an exciting opportunity for an enthusiastic and motivated individual to join our lively and busy multi-disciplinary team at Kingsley Ward.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Kingsley Ward is based in Winchester and provides cares for the needs of service users across Hampshire. We provide care and treatment to service users who are experiencing an acute mental health crisis and require a short period of hospital care to support their recovery. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Mlebury Lodge is located close to the Solent Coast and the beautiful New Forest National Park and have excellent transportation links, either by rail (direct to Waterloo) and by road (M3/M27).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for appoint someone who is highly motivated, enthusiastic, flexible and resourceful individuals who are committed to providing support and assistance to patients in their recovery. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your main responsibilities are: &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;To provide high standards of mental health care for patients by assessing, planning, implementing and evaluating care&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To work closely with all members of the multi professional team to ensure that patients mental health care needs are identified and managed appropriately&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To coordinate care packages in relation to patients mental health care needs&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To provide education around mental health to service users and their families&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To work alongside the mental health lead for the ward to provide education around mental health for the nursing and care support team&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To contribute to the development of individualised and collaborative care plans relating to mental health needs&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To take part in facilitating a mental health clinic on the ward&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;**** We are offering a “£2,500 Golden Hello Payment” to successful candidates from outside of the Trust! ****&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We can offer you the opportunity to work in a supportive team, with regular support from your line manager to further develop your skills in this area of work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Trust also offers a competitive staff benefits package to make sure our staff are well looked after, and make sure they receive what they deserve to make them feel valued.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If this sounds interested to you, please get in touch! We would love to hear from you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information, please contact Lou Salmon or Ruth Latchford on 01962 897700.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Melbury Lodge, Winchester", "postalCode": "SO22 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0614", "longitude": "-1.33095"}}, "title": "Registered Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916184418", "validThrough": "2020-12-31T23:59:59+0000"}