{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6"}}, "datePosted": "2020-09-18T14:48:26+0100", "description": "&lt;p&gt;&lt;strong&gt;NHS Professionals in partnership with Greater Manchester Mental Health NHS Trust are looking for:&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Infection Prevention and Control Nurse&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location – Harrop House&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working Hours 37.5 - Monday to Friday (may include weekends), 9-5, for 6 months, Immediate Start&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS Professionals is the leading provider of managed flexible workforce services to the NHS with approximately 100,000 nurses, doctors, administration and clerical and other healthcare professionals signed to its bank. We help our 65 NHS Trust clients implement tactical measures to improve workforce efficiency and productivity as part of an overall workforce strategy&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting secondment opportunity has become available to appoint an enthusiastic, dynamic &amp; innovative member to our experienced Infection Prevention &amp; Control Team at Greater Manchester Mental Health NHS Foundation Trust. This post is to support the team with the annual staff flu campaign and infection prevention &amp; control&lt;/p&gt;\n&lt;p&gt;We are committed to the delivering the &lt;strong&gt;best care&lt;/strong&gt; for our patients. The successful candidate will share this commitment and demonstrate our Trust values.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to have a broad knowledge of clinical nursing skills and the ability to work with people to empower &amp; facilitate effective infection control practice within the Trust. Ideally candidates will have knowledge regarding immunisations and vaccinations however full training will be provided. Candidates should have been involved in developing, planning &amp; implementing change processes within their current job &amp; ideally have experience working across acute, mental health &amp; community settings. Experience of working with an Infection Control Team would be advantageous.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; A positive approach &amp; the ability to motivate others, be flexible &amp; have the skills to prioritise your workload are all essential requirements of the post. The work is challenging and no two days are the same. You will be required to work to high standards maintaining a high quality finish to aspects of your work.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; The role will be varied and include staff education &amp; training, promoting good clinical practice in respect to infection control, audits &amp; feedback of results, support and guidance for staff and patients and responding to outbreaks and will be involved with the annual influenza staff vaccination programme.&lt;/p&gt;\n&lt;p&gt;Please ensure that you read the Person Specification attached below as your application will be measured against this document. For all posts which require a Disclosure &amp; Barring Service (DBS) check please be aware of the DBService Code of Practice, a copy of which is available by logging on to the DBS website. &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prestwich", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Infection Prevention and Control Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916191454", "validThrough": "2020-11-30T23:59:59+0000"}