{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive, dependent on experience"}}, "datePosted": "2020-08-28T16:26:10+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;GP Opportunities – Exmoor Medical Centre&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Do you want to come and work as a GP in beautiful Somerset?&lt;/li&gt;\n&lt;li&gt;Are you interested in a GP career that gives you the benefits of traditional General Practice but without the risks?&lt;/li&gt;\n&lt;li&gt;Do you want to work in a practice committed to personalised care and high quality, but with the advantage of being part of a network of practices supporting each other?&lt;/li&gt;\n&lt;li&gt;Are you interested in a GP role that gives you leadership opportunities and career progression?&lt;/li&gt;\n&lt;li&gt;Do you want your pay to be guaranteed and reflect your skills and commitment?&lt;/li&gt;\n&lt;li&gt;Are you interested in working with other clinicians to provide Primary Care through a wide multi-disciplinary team?&lt;/li&gt;\n&lt;li&gt;Do you want to work for a group of practices committed to education and research?&lt;/li&gt;\n&lt;li&gt;Are you interested in flexible working arrangements, remote working from home, portfolio working, and variable work commitments?&lt;/li&gt;\n&lt;li&gt;Do you want to be part of an NHS General Practice organisation committed to innovation and redesign of General Practice and exciting to work for?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;If your answer to these questions is yes, then come and join Symphony Healthcare Services at Exmoor Medical Centre.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Symphony Healthcare Services was established in 2016 as part of the award winning Symphony Programme Vanguard (BMJ Awards Primary Care Team of the Year 2018) and have rapidly grown to include a network of 13 GP practices each caring for between 4,000 and 12,000 patients, with 40 Employed GPs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer our GPs a competitive remuneration package based on the BMA GP Contract with additional incentive payments and further allowances for GPs providing specialist skills and leadership roles. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;About Exmoor Medical Centre&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to the relocation of one of our long-term GPs, we now have a four session vacancy at Exmoor Medical Centre in Dulverton.  Our purpose-built building is set within the beautiful Exmoor National Park in West Somerset.  Exmoor Medical Centre is a dispensing practice and serves a population of approximately 4,000 patients over a rural area of 300 square miles which encompasses Devon and Somerset.   &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Exmoor Medical Centre is known for its innovative approaches to healthcare with a significant emphasis on achieving a good work-life balance.  The introduction of GP early and late clinical shifts allows for a healthier workload whilst allowing for flexibility and remote working for administrative tasks.  With a total of 4 GPs, we achieve an excellent 1 GP session: 220 patient population ratio with the addition of an advanced nurse practitioner, a community complex care nurse, mental health liaison worker and social prescribing link workers to meet the needs of our elderly demographic.  Exmoor Medical Centre is a GP training practice and also an active member of the West Somerset Primary Care Network.  Our collaborative working in West Somerset will see many leadership opportunities for GPs within the PCN as well as with Symphony Healthcare Services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;For more information or to arrange an informal visit please contact Sue Oliver, Head of HR, sue.oliver@ydh.nhs.uk or 07342 060865&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132135.JPG", "name": "Symphony ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132135"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dulverton", "postalCode": "TA22 9EN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0385", "longitude": "-3.54485"}}, "title": "Employed GP Exmoor Medical Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916166509", "validThrough": "2020-11-30T23:59:59+0000"}