{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-07-23T09:24:34+0100", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANT LIAISON PSYCHIATRISTS: ADULT MENTAL HEALTH based at Basingstoke and North Hampshire Hospital site (Basingstoke) in North Hampshire in Adult Mental Health. (10 PAs&lt;/strong&gt;&lt;strong&gt;)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a Consultant Liaison Psychiatrist to join our expanding Liaison Psychiatry Team in Southern Health NHS Foundation Trust (SHFT) based at Hampshire Hospitals NHS Foundation Trust (HHFT). The acute trust is a friendly district general hospital with 800 beds split over the 2 acute hospital sites, both with accident and emergency departments and a clear mental health strategy.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This particular post will be based on the Basingstoke site and may be required to provide cover into old age liaison service (only if the OPMH Liaison Psychiatrist was unavailable) but you would not expected to cover other geographical sites.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are excited to be expanding our liaison psychiatry services across Hampshire following additional funding and priortisiation by the STP, commissioners and both the acute and mental health trust. We plan for all liaison services in Hampshire to be clinically led, meet CORE-24 standards and be Royal College of Psychiatrists Psychiatric Liaison Network (PLAN) accredited within the next 3 years. These posts will support this as part of the multi-disciplinary service expansion.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;With a new leadership team in place and a greater focus at STP and trust level in Liaison Psychiatry we’re investing in our liaison services to transform the way they are delivered. You will be joining a cohesive liaison nursing and administration team, already established at both sites. The adult liaison nursing team provide an established accident and emergency and acute medical unit service 24/7 and the older people’s mental health team provide cover in addition to the wards.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will become part of a team of consultants in adult and older adult mental health working in the North Hampshire Division, working across AMHT, CMHT, Liaison and Inpatient Psychiatry. &lt;/strong&gt;You&lt;strong&gt; will also be part of the Southern Health Liaison Psychiatry Network of Liaison consultants and senior nurses working across the 4 acute hospital sites in Hampshire, a supportive network of colleagues who meet quarterly.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Southern Health Trust covers most of Hampshire, with a population of 1.3 million people registered with the six local Clinical Commissioning Groups (CCGs). Southern Health is responsive to local needs and is working closely with Adult Services and the CCGs to develop locally based services. The Trust has a positive working relationship with the University of Southampton, Faculty of Medicine and an active programme of Research and Development.&lt;/p&gt;\n&lt;p&gt;The consultant roles are supported to have a good balance of SPA for service and pathway development, quality improvement and education to support you to develop, set the direction and lead the service with the support of the Band 7 team leader, the director of liaison psychiatry and the acute trust.&lt;/p&gt;\n&lt;p&gt;Our vision is: &lt;em&gt;‘To provide high quality, safe services which improve the health and wellbeing, independence and confidence of the people we serve.’&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are committed to the development of your career and believe that by supporting, developing and nurturing our staff we will deliver outstanding patient care and staff satisfaction.&lt;/p&gt;\n&lt;p&gt;We have a lot to offer and look forward to talking with you about the opportunities available. We strongly encourage an informal visit or meeting prior to the interview.&lt;/p&gt;\n&lt;p&gt;Please note that GMC registration (with a licence to practice) and right to work in the UK are essential for this role. Successful applicants will already have GMC registration or will be able to demonstrate they are eligible. Applicants requiring Tier 2 sponsorship should ensure they meet the Home Office application criteria prior to submitting an application.&lt;/p&gt;\n&lt;p&gt;Dr Mary Kloer, Medical Director North Division, SHFT&lt;/p&gt;\n&lt;p&gt;Mary.kloer@southernhealth.nhs.uk/01256 376418&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke", "postalCode": "RG24 9RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2827", "longitude": "-1.11187"}}, "title": "Consultant Liaison Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916122875", "validThrough": "2020-11-20T23:59:59+0000"}