{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-09-17T12:32:14+0100", "description": "&lt;p&gt;Join the UK’s largest not-for-profit healthcare organisation and we’ll ensure your expertise is used where it’s needed the most, with your patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s in it for you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;On joining our agile and highly energised multidisciplinary team you’ll have a fantastic opportunity to develop your skills and experience across a range of specialties and levels of complexity.&lt;/p&gt;\n&lt;p&gt;Supported by our Clinical Head of Department, Kerry Beckhelling, you’ll have autonomy to utilise your acquired expertise and skills to make decisions that will ensure the delivery of excellent patient care. The work is exciting, varied and challenging, the multiple specialities will enable you to develop new skills and grow. We actively support you to be the best you can be in your role while also offering opportunities to progress.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits, including free gym membership. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Nuffield Manor Hospital - Oxford&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our modern hospital is based within a stone’s throw of the historic City of Oxford, a world renowned centre of excellence for surgical and medical expertise.&lt;/p&gt;\n&lt;p&gt;We are proud of the wonderful environment and team we have established, providing our patients with first class care. We operate 6 well equipped and modern operating theatres with 64 well-presented ensuite rooms across 2 floors. We cater for both inpatient and day care, providing a broad range of surgical specialties and clinics including: Paediatrics (3 years and over), Oncology, Interventional Cardiology &amp; Radiology, Orthopaedics, Endoscopy, Gynaecology, Urology, Ophthalmology as well as women’s and men’s health clinics&lt;/p&gt;\n&lt;p&gt;The hospital is located with excellent transport links by road and rail, both to and from London, Thames Valley and the Midlands.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To be considered for Staff Nurse - Ward, you’ll be a qualified Nurse with appropriate professional body, such as NMC.&lt;/p&gt;\n&lt;p&gt;You’ll possess skills to support the variety of specialties as described above. There is also the opportunity to develop your skills where patients require a higher level of care (level 1). You will have a passion for delivering excellent and individually tailored patient care. Your excellent communications skills will ensure your integration into our multidisciplinary team and you’ll possess the proven ability to work autonomously and flexibly.&lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt;Salary – Competitive&lt;br /&gt; Location - Oxford&lt;br /&gt; Part-Time and Full-Time Roles Considered&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What to do next&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you have any questions contact Ian in our friendly talent acquisition team on 07920 212952. Ian will also be happy to arrange an informal call with Kerry or schedule a site visit ahead of making a formal application.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3 7RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7603", "longitude": "-1.21546"}}, "title": "Staff Nurse - Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916189102", "validThrough": "2021-01-04T23:59:59+0000"}