{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15129", "minValue": "0", "unitText": "YEAR", "value": "£ 9:00 /per hour plus NHS pension scheme"}}, "datePosted": "2020-08-13T14:48:13+0100", "description": "&lt;p&gt;Farnham Road Medical Group (FRMG) is a large, progressive and innovative training practice looking after nearly 38,000 patients with its main base on the northern edge of the diverse and vibrant Slough community, complemented by smaller sites based in southern Slough and the eastern edge of Reading. Our Primary Health Care and Patient Services Teams continues to grow with GPs working alongside Patient Services Managers, Practice Nurses, Health Care Assistants, Paramedics, Physician Associates, and Clinical Pharmacists to provide evolving healthcare and medical service to meet the varying needs of our patients and, in turn, provide what we believe is a sustainable model of modern General Practice.&lt;/p&gt;\n&lt;p&gt;We place an emphasis on teamwork, communication, continual development and learning from each other’s experiences through quality improvement, incident recording, team problem sharing and solving and training and education.&lt;/p&gt;\n&lt;p&gt;Our Patient Services Team is responsible for the day to day operations of the practice. We are looking for a Medical Note Summariser. As Medical Notes Summariser you will carry out administrative tasks relating to patient records, ensuring that all incoming patient notes are electronically summarised and assigned codes to provide a succinct and relevant record of the patients&#39; medical history.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for an enthusiastic, experienced, positive and flexible person to be part of the our Patient Services Team. You will be an effective communicator and problem solver with a flexible approach and the ability to work well as a part of our large team.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Slough", "postalCode": "SL2 1HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5306", "longitude": "-.617874"}}, "title": "Medical Notes Summariser", "url": "https://www.jobs.nhs.uk/xi/vacancy/916148049", "validThrough": "2020-11-06T23:59:59+0000"}