{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24357", "minValue": "24357", "unitText": "YEAR", "value": "£14.49 p/h"}}, "datePosted": "2020-08-27T17:49:10+0100", "description": "&lt;p&gt;Priory Hospital Lincolnshireis a low secure unit for men with mental illness and personality disorder. Located in Gainsborough in Lincolnshire, The hospital has 28 beds to support those who are detained under the Mental Health Act.&lt;/p&gt;\n&lt;p&gt;Our service consists of two wards:&lt;/p&gt;\n&lt;p&gt;Cedar - 14 bedded ward for men who require stabilisation and support to decrease their levels of challenging behaviour&lt;br /&gt;Ash - 14 bedded ward providing continuing care with a focus on rehabilitation and community reintegration and preparing the person to move further along the care pathway or to community living.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful candidates will be motivated to work in a service that offers involvement and empowerment for patients, who may have a personality disorder and/or mental illness, encouraging patients to have a real voice in how services develop and in their individualised care pathways. You will be flexible and supportive, enabling patients to build on their existing strengths and feel positive about their lives.&lt;/p&gt;\n&lt;p&gt;We offer consistent support, training and professional development and we look to ensure that our Nurses do what they love..&lt;/p&gt;\n&lt;p&gt;What we’d like from you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RMN Qualified&lt;/li&gt;\n&lt;li&gt;NMC (Nursing &amp; Midwifery Council Registered)&lt;/li&gt;\n&lt;li&gt;Knowledge of the Mental Health Act&lt;/li&gt;\n&lt;li&gt;Patient centric &amp; commitment to deliveringhigh quality care&lt;/li&gt;\n&lt;li&gt;Fine tuned decision making skills&lt;/li&gt;\n&lt;li&gt;Excellent organisational capability&lt;/li&gt;\n&lt;li&gt;Effective communication skills&lt;/li&gt;\n&lt;li&gt;Flexibility and a strong “can do” attitude&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;What we’d like to give you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary&lt;/li&gt;\n&lt;li&gt;Enhanced disclosure cost coverage&lt;/li&gt;\n&lt;li&gt;Comprehensive induction and commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Online benefits and cashback rewards&lt;/li&gt;\n&lt;li&gt;SMART Pension option&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "GAINSBOROUGH", "postalCode": "DN21 5UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3895", "longitude": "-.560565"}}, "title": "BANK RMN/RNLD", "url": "https://www.jobs.nhs.uk/xi/vacancy/916165152", "validThrough": "2020-11-27T23:59:59+0000"}