{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44089", "minValue": "40228", "unitText": "YEAR", "value": "£40,228.50 - £44,089.50 per annum"}}, "datePosted": "2020-09-03T08:47:31+0100", "description": "&lt;p&gt;We are currently seeking a &lt;strong&gt;Clinical Psychologist&lt;/strong&gt; to join our &lt;strong&gt;Mental Health and Intellectual Disabilities PICU/Acute Service &lt;/strong&gt;at&lt;strong&gt; The Huntercombe Hospital Roehampton, &lt;/strong&gt;4 miles from&lt;strong&gt; Richmond &lt;/strong&gt;and 9 miles from&lt;strong&gt; central London.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Huntercombe Hospital Roehampton – London SW15&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The hospital is a 39 bedded purpose-built &lt;strong&gt;psychiatric intensive care&lt;/strong&gt; unit. The hospital provides a secure and safe, gender-specific environment for adults who have suffered an acute deterioration or relapse in their mental wellbeing.&lt;/p&gt;\n&lt;p&gt;We specialise in providing intensive and bespoke, individualised treatment plans working collaboratively with patients and their families or carers and employ staff in a variety of different roles providing ongoing support, comprehensive training, learning and development opportunities.&lt;/p&gt;\n&lt;p&gt;The hospital is located just off the &lt;strong&gt;A306 in Roehampton&lt;/strong&gt;, &lt;strong&gt;4 miles from Richmond&lt;/strong&gt; and 9 miles from central London. &lt;strong&gt;The nearest main line train station is Putney or Barnes&lt;/strong&gt; with good transport links to the hospital.&lt;/p&gt;\n&lt;p&gt;We are looking for a Clinical Psychologist, who has the ability to work autonomously within the context of a multi-disciplinary team, who will be responsible for the delivery of specialtist psychological assessments and interventions to individuals and groups in a PICU setting.&lt;/p&gt;\n&lt;p&gt;Most patients and residents are referred via NHS and Local authorities. We play an integral part in contributing to new models of care outlined in the&lt;em&gt; Five Year Forward View.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Clinical Psychologist &lt;/strong&gt;working in our &lt;strong&gt;Adult Mental Health and Intellectual Disabilities PICU/Acute Service&lt;/strong&gt; your main duties will be:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing specialist psychological assessments of newly-referred and newly-admitted patients to &lt;strong&gt;The Huntercombe Hospital Roehampton&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Working alongside the Consultant Clinical Psychologist and other professionals to ensure that treatment programmes are delivered effectively, efficiently and in a timely manner&lt;/li&gt;\n&lt;li&gt;Developing and implementing psychological treatment and evaluation plans&lt;/li&gt;\n&lt;li&gt;Monitoring, reviewing and developing therapeutic interventions, individual support guidelines and behavioural support programmes&lt;/li&gt;\n&lt;li&gt;Developing and implementing appropriate individual and group-based psychological treatment programmes consistent within individual psychological formulations and to supervise assistant psychologists and other staff where they have a role in such provision&lt;/li&gt;\n&lt;li&gt;Ensuring the provision of specialist psychological advice, guidance and consultation to other members of the multi-disciplinary team contributing directly to any patient’s formulation, diagnosis, treatment plan and admission or discharge decisions, and the dissemination of information about psychological research and theory to other members of the MDT&lt;/li&gt;\n&lt;li&gt;Undertaking appropriate risk assessment and risk management plans for allocated patients and to provide advice to other members of the multi-disciplinary team regarding psychological aspects of risk assessment and management&lt;/li&gt;\n&lt;li&gt;providing written reports on psychological assessments, formulation and treatment for internal and external patient reviews&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To join The Huntercombe Group as a Clinical Psychologist&lt;/strong&gt; &lt;strong&gt;you will:-&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hold a current HCPC registration as a Clinical Psychologist&lt;/li&gt;\n&lt;li&gt;Hold a post-graduate doctorate in clinical psychology (or its equivalent for those trained prior to 1996 or those in lateral transfer) as accredited by the BPS&lt;/li&gt;\n&lt;li&gt;Have a good understanding of the Mental Health Act (1983) and registration requirements for the hospital and work within the requirements of such legislation&lt;/li&gt;\n&lt;li&gt;Be able to provide evidence based practice of improving patient clinical outcomes&lt;/li&gt;\n&lt;li&gt;Have an understanding of and practical application of psychology models&lt;/li&gt;\n&lt;li&gt;Be flexible and adaptable, well organised and able to manage time and workload effectively in line with the needs of the service&lt;/li&gt;\n&lt;li&gt;Have a desire to expand your professional development and support organisational change&lt;/li&gt;\n&lt;li&gt;Have a legal right to work in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer you:&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/li&gt;\n&lt;li&gt;2 weeks paid paternity leave&lt;/li&gt;\n&lt;li&gt;Shared parental leave, matching the maternity leave benefit&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Opportunities for training and development&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click &lt;strong&gt;Apply&lt;/strong&gt; now.&lt;/p&gt;\n&lt;p&gt;To learn more about The Huntercombe Group please visit our website&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Roehampton, SW London", "postalCode": "SW15 4JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4486", "longitude": "-.24357"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916170389", "validThrough": "2020-11-18T23:59:59+0000"}