{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29629", "minValue": "27784", "unitText": "YEAR", "value": "£27,784 - £29,629"}}, "datePosted": "2020-08-10T16:07:40+0100", "description": "&lt;p&gt;Priory Hospital Cheadle Royal has 14 different wards and cares for 151 patients. Each ward has a dedicated Multi-Disciplinary Team which includes a Consultant Psychiatrist, Speciality Doctor, Ward Manager, Psychologist, Occupational Therapist and support services including RMN and experienced Healthcare Assistants. Our primary aim is to support and care for our patients providing a full clinical pathway for patients onsite.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We operate a comprehensive inpatient mental health service comprising Acute, Psychiatric Intensive Care Services (PICU), Personality Disorder, Eating Disorders and Rehabilitation and Recovery giving our nurses the perfect opportunity to develop their skills across a variety of different services if they so wish.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;About the Personality Disorder Unit…&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Personality Disorder unit is a locked rehabilitation unit that runs a comprehensive Dialectical Behaviour Therapy (DBT) programme for the treatment of female patients with Emotionally Unstable Personality Disorders (EUPD). Patients may also have a co-morbid mental disorder such as psychosis, substance misuse, eating disorders and complex PTSD.&lt;/p&gt;\n&lt;p&gt;As a nurse working on our PDU, you will work alongside the experienced multidisciplinary team in aspiring to provide excellent bespoke care to enable our patients to fulfil their recovery goals and work towards discharge to the life they want.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ethos of the units is to provide support in times of crisis and to offer therapeutic engagement during the inpatient stay working alongside appropriate risk management plans.&lt;/p&gt;\n&lt;p&gt;You would also be expected to:&lt;/p&gt;\n&lt;p&gt;Act as a key worker&lt;br /&gt;Observe/respond to patient behaviours on the ward which may include self harm and acts of aggression&lt;br /&gt;Formulate risk assessments and care plans to meet individual needs&lt;br /&gt;Medication management&lt;br /&gt;Act as shift co-ordinator, allocating staff and having the ability to oversee the work of junior staff and colleagues&lt;br /&gt;Maintain the safety of patients and staff&lt;br /&gt;Ensure good quality of patient documentation which meets regulatory guidance and statutory requirements&lt;br /&gt;Work within the NMC Code of Conduct and practice guidelines&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working hours are 37.5 hours per week, which conventionally works as 3 long shifts every 3 weeks and 4 long shifts in the 4th week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A career with Priory Cheadle Royal not only enables you to manage your own career pathway whilst paying a competitive salary, we also have a range of other benefits such as&lt;/p&gt;\n&lt;p&gt;25 days annual leave (plus 8 Bank holidays) increasing with length of service&lt;br /&gt;Birthday leave&lt;br /&gt;Free on site parking&lt;br /&gt;Subsidised meals&lt;br /&gt;Contributory pension scheme&lt;br /&gt;Priory Perks discount portal&lt;br /&gt;Long Service recognition&lt;br /&gt;Dedicated career pathway&lt;br /&gt;NMC Registration fees paid&lt;br /&gt;Enhanced sick pay and maternity pay after 1 years service&lt;br /&gt;Wellbeing committee&lt;br /&gt;Comprehensive Induction&lt;br /&gt;CPD courses and support&lt;br /&gt;Leadership and Management opportunities&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CHEADLE", "postalCode": "SK8 3DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.375", "longitude": "-2.22149"}}, "title": "RMN - Personality Disorder Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916143397", "validThrough": "2020-11-27T23:59:59+0000"}