{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 inc 5% Fringe HCAS"}}, "datePosted": "2020-08-26T12:31:18+0100", "description": "&lt;p&gt;A rare and exciting opportunity for a band 6 community nurse has arisen within our East Surrey Community team for adults with learning disabilities within Surrey. As a team we continually strive to develop our quality health care services and we are seeking an enthusiastic and highly motivated nurse to join our dynamic multi- disciplinary service.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be joining an innovative team of nurses providing high quality heath interventions as part of the wider forward thinking, diverse multi-disciplinary team, working collaboratively with nurses and other professional clinicians as well as multiple agencies&lt;/p&gt;\n&lt;p&gt;As an individual we will expect you to possess excellent communication skills, enjoy working as part of a team, working closely with colleagues from a range of disciplines, whilst being able to work independently, carry out comprehensive assessments and plan, implement and evaluate delivery of nursing interventions as part of the holistic approach. You will also be able to demonstrate that you are able to apply your nursing skills to a wide range of situations, working with a range of adults with a learning disability living within the community. You will be responsible for managing a caseload across the geographical area of east Surrey, working closely with other agencies as well as members of the multi-disciplinary team. All applicants will either be registered on Part 5 or 14 of the NMC Register&lt;/p&gt;\n&lt;p&gt;If you are looking for a fulfilling and varied role and you have a genuine desire to develop your career in community learning disability nursing and a commitment to providing high quality, evidence based interventions, then we want to hear from you!&lt;/p&gt;\n&lt;p&gt;There is an emphasis on the importance of clinical supervision and continued professional development, which we regard as a vital part of the delivery of care. We offer a variety of opportunities in a supportive, friendly and stimulating working environment, having access to reflective practice within both nursing as well as the multi-disciplinary team. You will be part of an innovative and dynamic team which utilises an evidence-based perspective. We’ll support and encourage you to develop specialist experience and expertise as appropriate&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The candidate must have a full and valid driving licencedue to the community element of the role and the large geographical area that the West Surrey Community Team cover.&lt;/p&gt;\n&lt;p&gt;The team has 2 bases, Epsom and Redhill and there will be an expectation of travel between sites, although one site will be identified as a base for travel expense purposes only. Due to the nature of community health services, the successful candidate will have a clean driving licence and access to a vehicle for work purposes.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact either, Lead Community Nurse or Team Manager on 01372 202100&lt;/p&gt;\n&lt;p&gt;Keywords: Community, Learning Disability, Nurse, Surrey, Epsom&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill and Epsom", "postalCode": "KT19 8PH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.337", "longitude": "-.298015"}}, "title": "Community Learning Disability Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916162871", "validThrough": "2020-11-09T23:59:59+0000"}