{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 per annum / pro rata"}}, "datePosted": "2020-08-21T17:57:44+0100", "description": "&lt;p&gt;We are seeking a compassionate, dynamic and motivated individual to support our colorectal patients whilst undergoing SACT or the management of their advanced disease.&lt;/p&gt;\n&lt;p&gt;Your communication and interpersonal skills will be highly developed as they are integral to your success in providing the highest standard of care and support to patients with a colorectal cancer diagnosis, as is the ability to manage distressing situations involving patients and carers and act as a key worker to ensure single point of contact during a complex pathway.&lt;/p&gt;\n&lt;p&gt;The ability to work autonomously and as part of the multidisciplinary team, along with developing positive and collaborative relationships are integral to this role. This position provides an excellent role for a registered nurse who has experience in cancer services and/ or palliative care. It provides a new exciting challenge for an individual who is looking to gain experience or a career in specialist nursing practice. The successful applicant will be given the opportunity to develop and utilise advanced skills in health assessment and none medical prescribing to support this specialist group of patients.&lt;/p&gt;\n&lt;p&gt;You will need to be self-motivated and have a flexible approach to work, have good organisational skills and the ability to influence others, acting as a role model across disciplines and demonstrate excellent communication skills with computer literacy and awareness of cancer pathways.&lt;/p&gt;\n&lt;p&gt;If any questions or an informal visit please contact Mark Squire, Haematology and Oncology Matron (01905) 763333 ask for bleep 629&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Colorectal Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916158724", "validThrough": "2020-11-15T23:59:59+0000"}