{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-08-14T17:16:18+0100", "description": "&lt;p&gt;We’re looking for nurses to join one of the largest neuroscience centres in the country, providing services to a population of three million people and part of the major trauma centre. If you have a real passion for nursing, and are looking for an exciting, fast moving clinical field to develop your skills, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;Please note that this vacancy is for experienced nurses – if you’re a newly qualified nurse you should apply through our dedicated newly qualified adult or child nurse adverts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR CARE GROUP&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Wessex neurological centre (WNC) provides a dedicated, integrated 24-hour acute neurosurgical, neurological, spinal and stroke assessment, investigation and treatment service. Sitting within a large teaching hospital, it has clear priorities for maintaining high standards of care and developing specialist services for the community and purchasers of the former Wessex region, West Sussex and the Channel Islands.&lt;/p&gt;\n&lt;p&gt;We support our staff, offering a variety of opportunities for career progression. When it comes to careers we are committed to developing yours. We support both professional and personal development, recognising its importance in delivering a quality service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TEAMS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HYPER ACUTE STROKE UNIT (HASU)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;HASU is currently a 13 bedded unit catering for all acute stroke admissions admitted directly from ED to commence on the stroke care pathway. Many of these patients are given thrombolysis treatment on the unit and if indicated may receive intra-arterial clot retrieval (mechanical thrombectomy) which has shown greatly improved patient outcomes in recent studies.&lt;/p&gt;\n&lt;p&gt;This is a particularly exciting time to join our team as we&#39;ve recently implemented a mechanical thrombectomy service for the region. HASU is a dynamic and fast paced area of work where you can develop and utilise acute nursing skills. All the while being supported by a multidisciplinary team including trained stroke nurses, therapy staff and advanced nurse practitioners.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;F8 STROKE REHABILITATION&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A 28 bedded acute stroke unit that works in collaboration with the therapy team to provide intense stroke rehabilitation for patients with complex needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NEURO REGIONAL TRANSFER UNIT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NRTU is a 10 bedded unit which caters for neurosurgical and neurology emergency admissions from across the Wessex region. Common conditions we see are brain bleeds, tumours, head injuries, seizures, myasthenia gravis and guillain-barre syndrome amongst many others.&lt;/p&gt;\n&lt;p&gt;We also take emergency spinal admissions when our sister spinal ward is at full capacity. One of our beds is also a specialist video-telemetry (VT) Suite whereby epilepsy patients are monitored for a week, often reducing medication to promote seizures. This is for either diagnostic measures or to assess whether they would be a candidate for surgery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;F4 SPINAL&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Wessex spinal unit, opened in April 2015.We have 22 beds which take both elective and emergency spinal patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;D AND E NEURO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;D neuro (male) and E neuro (female) each house 24 beds. We also have admission/step down beds for patients who are transferred from neuro ICU. These beds accommodate all acute neuro surgical and neurology conditions, including subarachnoid haemorrhage, head injuries, epilepsy and MS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer the exciting opportunity of a neurosciences course either uncredited or at degree or masters level. The course typically runs over a 6 month period with taught sessions, practice based competency and assignments. The neuro course is fundamental for future career progression to senior roles such as ward leader, advanced practitioner and clinical nurse specialist.&lt;/p&gt;\n&lt;p&gt;The neuro course is delivered within the Wessex neuroscience centre by the education team supported by the multi-disciplinary team. The programme covers all common neurology and neurosurgery conditions such as stroke, head injury, epilepsy, neuro-oncology and spinal pathology.&lt;/p&gt;\n&lt;p&gt;Whilst studying for the course we are able to offer a rotation within the Wessex neurological centre or you could be based in a speciality area. UHS is a large University teaching hospital with clear priorities for maintaining high standards of care; investing in our staff is one way of delivering the high quality service. When it comes to careers we are committed to developing yours.&lt;/p&gt;\n&lt;p&gt;As a care group, we are happy to consider flexible working arrangements. Recently these have included nights only and weekends only, and you’ll have an opportunity to discuss this at interview.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Rated ‘Good’ by the CQC, UHS is one of England&#39;s largest acute teaching trusts. In the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;br /&gt;&lt;br /&gt;Lisa Attrill&lt;br /&gt;&lt;br /&gt;Recruitment Coordinator&lt;br /&gt;&lt;br /&gt;lisa.attrill@uhs.nhs.uk&lt;br /&gt;&lt;br /&gt;023 8120 4488&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Staff nurse - neurosciences", "url": "https://www.jobs.nhs.uk/xi/vacancy/916150302", "validThrough": "2020-11-14T23:59:59+0000"}