{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa pro-rata"}}, "datePosted": "2020-07-14T10:19:30+0100", "description": "&lt;p&gt;Respiratory Medicine – Ward 24 The 28 bedded Respiratory Ward at Good Hope Hospital has Band 5 vacancies for both experienced and newly qualified nurses who are keen to gain further insight to Respiratory and Acute Care.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated individuals with the passion to deliver excellent care and drive for self-development. The position would be ideal for those with a passion to develop their knowledge and skills around Respiratory conditions and care, as well as those who already have a good knowledge and skill base in acute care.&lt;/p&gt;\n&lt;p&gt;We provide care for patients with a multitude of conditions including asthma, COPD, pleural effusions, pneumothorax, chest drains, Type 1 and Type 2 Respiratory failures… Plus soo much more! We are very fortunate to be able to deliver a Non-Invasive Ventilation (NIV) Service within the ward. This is greatly supported by our dedicated Respiratory physiotherapy team who work with our highly skilled nurses as well as the rest of the multi-disciplinary team to provide this specialist acute care. Ward 24 encompasses 16 en-suite side rooms and 3 bays, each with a toilet and shower.&lt;/p&gt;\n&lt;p&gt;We aim to direct our most acute patients to the Respiratory Acute Care Area where this is possible as this allows cohorting of acutely unwell patients to enhance both patient care and experience. Working within Ward 24 at Good Hope Hospital will enable you to develop your knowledge around anatomy and physiology of the respiratory system, enhance/gain new skills around NIV and advance your acute care skills by delivering advanced care to patients with altered airways from both ITU and admission.&lt;/p&gt;\n&lt;p&gt;We have a dedicated and highly knowledgeable clinical educator on site that will support your development and learning needs. They will monitor your progress and assist in your journey with Ward 24. There is a large amount of in-house training available for our staff members to enable self-development. These will include; taught sessions, online learning and also clinical skills.&lt;/p&gt;\n&lt;p&gt;If you are dynamic and feel this position could be for you please contact Senior Sister Sanni Aujla (01214249445) for an informal discussion regarding the post or for a tour of the ward.&lt;/p&gt;\n&lt;p&gt;Candidates will be shortlisted and interviewed on a continuous basis for convenience.&lt;/p&gt;\n&lt;p&gt;At University Hospitals Birmingham we support flexible working and welcome applications from nurses seeking flexible working opportunities and family friendly working hours&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sutton Coldfield", "postalCode": "B75 7RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5674", "longitude": "-1.81204"}}, "title": "Band 5 Staff Nurse - Respiratory (Good Hope Hospital)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916111528", "validThrough": "2020-12-31T23:59:59+0000"}