{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33000", "minValue": "33000", "unitText": "YEAR", "value": "£33,000"}}, "datePosted": "2020-08-24T10:17:00+0100", "description": "&lt;p&gt;&lt;strong&gt;Exciting opportunity for a Clinical Psychologist looking for their next challenge&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Brain Injury Rehabilitation Trust (BIRT) is looking for a Principal Psychologist who wants to develop their experience by working in our highly regarded service at Thomas Edward Mitton House.&lt;/p&gt;\n&lt;p&gt;You will provide strategic, professional leadership to the multi-disciplinary rehabilitation team, which includes a Assistant Psychologists, Rehabilitation Support Workers, Occupational Therapists, Physiotherapists and Speech and Language Therapists.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your responsibilities will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- ensuring the provision and development of high quality, innovative, and evidence based neuropsychological rehabilitation practice.&lt;br /&gt;- providing specialist psychological assessment of our service users, using psychological and neuropsychological tests, self-report scales, structured observations and interviews;&lt;br /&gt;- formulating and implementing specialist psychological treatment plans for mental health and adjustment difficulties based on a multi-factorial psychological understanding and current evidence-based best practice;&lt;br /&gt;- contributing highly specialist psychological advice to the multi-disciplinary formulation of appropriate therapeutic approaches or intervention plans, and supervising their implementation;&lt;br /&gt;- undertaking psychologically based risk assessment and risk management for relevant service users and advising team members appropriately;&lt;br /&gt;- participating in multidisciplinary team meetings concerned with the delivery and development of clinical services&lt;/p&gt;\n&lt;p&gt;- Supporting Service Managers/Regional Managers in all aspects of managing the service and to report to the Consultant Clinical Neuropsychologist.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are we looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful applicant will have a doctorate in clinical psychology (or equivalent) accredited by the BPS. It is essential that you are able to gather, analyse and interpret complex multi-factorial clinical information, and formulate this so as to effectively direct team working.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who has excellent interpersonal and communication skills, with the ability to deal with complex and emotive subjects. You will have excellent organisation skills, the ability to prioritise workloads, the ability to administer and interpret a range of psychometric tests, and a track record of conducting clinical research or audit. We are looking for a clinical psychologist with experience in neurorehabilitation, an interest in neuropsychology, and motivated to develop an excellent service further.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- A salary of £33,000 DOE&lt;br /&gt;- 33 days annual leave (inclusive of bank holidays)&lt;br /&gt;- Excellent training and support&lt;br /&gt;- Group life assurance&lt;br /&gt;- Eye voucher scheme&lt;br /&gt;- Long service and staff awards&lt;br /&gt;- Free parking&lt;br /&gt;- Nationwide employee staff discounts including discounted gym membership, eating out and shopping.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;&lt;br /&gt;This is a permanent part-time position for 21 hour per week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please Note: This post is subject to a DBS check and references.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "PART_TIME", "hiringOrganization": {"@type": "Organization", "name": "Disabilities Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Milton Keynes", "postalCode": "MK4 2JA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9994", "longitude": "-.774"}}, "title": "Principal Psychologist - Milton Keynes", "url": "https://www.jobs.nhs.uk/xi/vacancy/916159164", "validThrough": "2020-11-27T23:59:59+0000"}