{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36600", "minValue": "36600", "unitText": "YEAR", "value": "£36,600"}}, "datePosted": "2020-09-17T16:51:42+0100", "description": "&lt;p&gt;Are you a Senior Forensic Social Worker looking to join a company that values and recognises you? If so, join the team at Thornford Park as maternity cover from December 2020 and help people develop new skills and build a brighter future.&lt;/p&gt;\n&lt;p&gt;Thornford Park is a 130 bedded medium and low secure Forensic Mental Health service in Thatcham that provides a seamless internal care pathways to support and empower people through their recovery and rehabilitation journey. In addition to these services, there is also a PICU Mental Health Service.   Working alongside the multidisciplinary team, you will manage and support a caseload of up to 24 forensic service users with mental health conditions. You will be responsible for assessments, CPA reports, Mental Health Tribunals, Managers Hearings and will be requested to supervise junior staff members.   &lt;/p&gt;\n&lt;p&gt;As a senior member of the team, you will lead and promote child and adult safeguarding and will empower recovery to encourage service users to engage in their care plans and achieve their goals. &lt;/p&gt;\n&lt;p&gt;Working as part of a multidisciplinary team, you will be supported regionally and will have access to a variety of training and online courses to support your career development and growth. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead child and adult safeguarding.&lt;/li&gt;\n&lt;li&gt;Lead the multidisciplinary teams on non-medical mental capacity issues and best interest decisions&lt;/li&gt;\n&lt;li&gt;Liaising with external agencies to enable them to fulfill their statutory duties, for example: MAPPA, Local Authority Social Services, Police and Probation&lt;/li&gt;\n&lt;li&gt;Supporting carers and families of detained patients&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you&#39;ll need:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Social work qualification&lt;/li&gt;\n&lt;li&gt;Registered with Social Work England.&lt;/li&gt;\n&lt;li&gt;Have a good working knowledge of the relevant legislation&lt;/li&gt;\n&lt;li&gt;Have at least 2 years’ experience of working in mental health&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you will get:&lt;/strong&gt;        &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £35,600&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thatcham", "postalCode": "RG19"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3718", "longitude": "-1.25862"}}, "title": "Senior Forensic Social Worker (Maternity Leave)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916190009", "validThrough": "2020-11-17T23:59:59+0000"}