{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-08-25T12:15:19+0100", "description": "&lt;p&gt;&lt;span&gt;Staff Nurse, Band 5, Birmingham Heartlands Hospital&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Emergency Department in Birmingham Heartlands Hospital are looking for band 5 nurses who have a minimum of 1 year’s post registration experience and who have completed their preceptorship&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are at an exciting stage in the development of our service and this is the ideal time to come and be part of a team delivering high quality care and also be part of shaping services in a team approach. The department covers Majors, including trauma, minor injuries/illness and a children’s emergency department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Serving a diverse area, we are a busy and vibrant Emergency department where you will have the opportunity to develop your skills and knowledge in a supportive, fast paced and innovative environment. We are passionate about staff development and offer a full support and training package and ongoing opportunities through our clinical skills team and senior team leaders. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are committed to improving Working Lives and have a flexible approach regards working hours and shift patterns. We can also discuss bespoke arrangements to suit you and your career plans by offering rotations and secondments where possible to ensure our department is the right fit for you and your aspirations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must be able to demonstrate experience of working within an acute setting and be able to show evidence of on-going professional development. Full support and training will be offered to the right candidates. The post will include working on rotation which will include day and nightshifts, bank holidays and working across a 7 day week.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Informal visits are encouraged, we would be happy to discuss any questions you have.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact Matron Clare Gadd on 0121 424 0040, or Sheree Harrison, ED Secretary on 0121 424 3091 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916161165", "validThrough": "2020-12-31T23:59:59+0000"}