{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860-£107,668"}}, "datePosted": "2020-09-02T10:11:11+0100", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Consultant Microbiologist&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a dynamic and motivated Consultant in Medical Microbiology or Medical Microbiology/ Infectious Diseases to join the team at the Torbay and South Devon NHS Foundation Trust. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a new post in recognition of the important and increasing contribution that Infection Specialists are making in providing a comprehensive service covering diagnostics, clinical advice, OPAT, antimicrobial stewardship and Infection Prevention and Control.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;TSDFT is the first fully integrated care organisation in England and we are progressive in the way we deliver safe, high-quality health and social care for all stages of the patient journey. We have a positive and vibrant working atmosphere, with good transport links to all our sites. Our commitment to staff health and wellbeing looks at supporting our staff as ‘whole’ individuals, recognising their own unique set of strengths and skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Microbiology Department is both forward thinking and innovative, providing a comprehensive Microbiology/ Infection service to a population of 300,000 in the Torbay and South Devon area which has areas of outstanding beauty, good road links and excellent schools. The department is fully accredited by UKAS to the ISO 15189 standard and is well equipped including for molecular services. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The full time post has a 10 PA allocation with band A rating (8%) for on call based on a 1 in 4 rota. &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torbay Hospital", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Consultant Microbiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916168839", "validThrough": "2020-11-15T23:59:59+0000"}