{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18050", "minValue": "17100", "unitText": "YEAR", "value": "£17,100- £18,050"}}, "datePosted": "2020-09-22T12:25:35+0100", "description": "&lt;p&gt;Working in partnership with Portsmouth NHS Trust, we have an exciting opportunity in our new renal unit Salisbury, for a healthcare assistant who wants to make a difference in our patient’s lives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will provide patient care according to Diaverum procedures and in order toincrease the quality of life for our patients. A comprehensive professional training programme will be provided to you, including on-the-job training,e-learningand access to our in-house education programme ‘d Academy’.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;RESPONISIBILITIES:&lt;br /&gt;• To support the nursing team and undertake duties as directed by a registered nurse&lt;br /&gt;• To escort patients to and from the clinical area to the waiting areas or transport&lt;br /&gt;• To serve patient drinks and snacks during treatment as required&lt;br /&gt;• To undertake basic health checks with patients pre and post dialysis including weight and blood pressure&lt;br /&gt;• To check and clean equipment following appropriate training&lt;br /&gt;• To assist with patient documentation as appropriate&lt;br /&gt;• To prepare, restore and maintain areas and equipment for clinical treatments, ensuring that supplies and machines are readily available.&lt;br /&gt;• Act as an assigned member of staff for a group of patients ensuring ‘great care‘ is provided at all times&lt;br /&gt;• Proactively participate in quality and service improvement programmes&lt;br /&gt;&lt;br /&gt;REQUIREMENTS:&lt;br /&gt;• Must be educated to GCSE level or equivalent&lt;br /&gt;• Minimum NVQ level 2 in Health; Social Care or equivalent and working towards level 3&lt;br /&gt;• Ideally previous experience in hospital and healthcare setting&lt;br /&gt;• Ability to work effectively independently as well as in a team&lt;br /&gt;• Have a positive and dynamic approach to providing safe and effective delivery of care&lt;br /&gt;• Excellent communication skills (oral + written) with fluency in English&lt;br /&gt;&lt;br /&gt;COME GROW WITH US!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Diaverum UK Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salisbury", "postalCode": "SP2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0439", "longitude": "-1.78981"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916194911", "validThrough": "2020-11-22T23:59:59+0000"}