{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-09-18T09:53:24+0100", "description": "&lt;p&gt;Join us as an Staff Nurse in our Oxford Hospital and play your part in building a healthier nation.&lt;br /&gt;&lt;br /&gt;The Role&lt;br /&gt;&lt;br /&gt;Whether you are currently in the NHS or a private setting, we’re sure you will find your career with us motivating and rewarding.&lt;br /&gt;&lt;br /&gt;Like all of us at Nuffield Health, you do what you do because you care. Every one of our brilliant people is passionate about making a real difference. As a Staff Nurse you will;&lt;br /&gt;&lt;br /&gt;- Be part of a close-knit team headed by our matron.&lt;br /&gt;- With our consultant-led service, you will be working directly with some of the best clinical talent around, gaining experience with new practices, equipment and facilities.&lt;br /&gt;- You’ll interact with practitioners from other departments because you understand the importance of continuity in patient care.&lt;br /&gt;&lt;br /&gt;The Person&lt;br /&gt;&lt;br /&gt;To succeed as a Staff Nurse in our Outpatients you will;&lt;br /&gt;&lt;br /&gt;- Have a registration with the appropriate governing body and have the qualifications and experience relevant to your registration, including NMC.&lt;br /&gt;- Have post-registration experience.&lt;br /&gt;- Be an excellent communicator and team worker – plus be flexible and motivated.&lt;br /&gt;- Have the ability to fully understand each patient’s needs and provide individual attention.&lt;br /&gt;&lt;br /&gt;The Benefits&lt;br /&gt;&lt;br /&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this but we also offer a range of lifestyle and financial wellbeing benefits.&lt;br /&gt;&lt;br /&gt;Be your best and join us in building a healthier nation.&lt;br /&gt;&lt;br /&gt;Location - Oxford&lt;br /&gt;Weekly Hours - Full time, 37.5 hours per week&lt;br /&gt;Salary - Up to £30,000 per annum&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications.Thereforeplease apply early to ensure you are considered for the post.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.777", "longitude": "-1.20489"}}, "title": "Staff Nurse - Outpatients", "url": "https://www.jobs.nhs.uk/xi/vacancy/916190436", "validThrough": "2020-11-10T23:59:59+0000"}