{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890-£44,503 per annum pro rata"}}, "datePosted": "2020-08-20T17:00:21+0100", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Radiology QA Manager&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;We are pleased to be able to seek applicants for the new role of Radiology Quality and Governance Lead in the Torbay and South Devon NHS Foundation Trust Radiology team. The successful applicant will be an enthusiastic and experienced individual with excellent communication, organisation and interpersonal skills to join. The role will cover the Radiology service across our healthcare community.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for a highly motivated individual to lead the quality and governance agenda for the Radiology team. You will be assuring the Radiology and Trust leadership that the service provides a safe, efficient service with high quality care for our patients.&lt;/p&gt;\n&lt;p&gt;The role will support the clinical team in all aspects of quality and safety across the service. It is expected that this will include development of evidence in a format that will allow the department to achieve the requirements of the Quality Standards in Imaging (QSI) and move towards accreditation. This role will also work with the Medical Physics team to provide assurance around relevant legislation (e.g. IRR, IRMER etc).&lt;/p&gt;\n&lt;p&gt;The successful candidate will be pro-active and self-motivated, working under pressure to meet deadlines. You should have significant experience of working in an acute, radiology environment, have a keen interest in Clinical Governance and show evidence of developing clinical practice with implementation of new initiatives to improve patient care. You should have knowledge and experience of risk management, incident reporting/investigation and clinical audit processes. Prior Radiology clinical practice, and a good understanding IR(ME)R and IRR will be an advantage.&lt;/p&gt;\n&lt;p&gt;If you are interested in this exciting new role we welcome your applications. If you wish to discuss this post further, please feel free to contact Tim Simpson, Radiology Directorate Manager on 01803 655618 or tim.simpson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torbay", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Radiology QA Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916157014", "validThrough": "2020-11-15T23:59:59+0000"}