{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25000", "minValue": "24000", "unitText": "YEAR", "value": "24,000 - 25,000"}}, "datePosted": "2020-08-11T15:50:20+0100", "description": "&lt;p&gt;InHealth Intelligence has been and continues to be a proud supporter of the Diabetic Eye Screening Programmes across NHS England and since 2011. InHealth Intelligence has grown to offer fully managed services across the country. To increase efficiency, we built our own software system which enables us to adapt and change to meet the requirements of the National DESP team and our employees, to achieve a better user experience.&lt;/p&gt;\n&lt;p&gt;The remit of the national NHS Screening Programme is to detect Diabetic Retinopathy in the early stages to enable treatment and reduce loss of sight.&lt;/p&gt;\n&lt;p&gt;You will be joining and overseeing the local Failsafe team, in addition to usual care which includes appointing, examination/treatment and discharge, our failsafe team ensure that if something goes wrong in the patient’s pathway, administrative processes are in place and actioned to identify any errors in procedures.&lt;/p&gt;\n&lt;p&gt;As a Manager you will liaise with hospital embedded Failsafe Officers, Hospital Eye Services (HES) Secretaries, and Consultant Ophthalmologists, the Programme Manager, the Programme’s Engagement Manager and the Programme’s Senior Grading Manager and Clinical Lead to ensure the safety of all our patients. Close monitoring of the patient pathway to ensure that all DESP referrals made to Hospital are acknowledged and processed safely. Ensure the patients are appointed in timescales, all appointments are safely outcomed along with timely feedback on discharges and follow-up information is maintained.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Duties&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assist the Failsafe Manager in the operational running of the Failsafe service and deputise for the Failsafe Manager in their absence&lt;/li&gt;\n&lt;li&gt;To work with the Hospital Management Team to improve the working relationship, processes and feedback, for the benefit of the Patients, the Programme and the Hospital.&lt;/li&gt;\n&lt;li&gt;To have line management responsibility for the Local failsafe Team as per the organogram and provide software training to Embedded Failsafe Officers where needed&lt;/li&gt;\n&lt;li&gt;Ensure all patients requiring referral are referred that day and ensure all referred patients are tracked (as per national guidance and Policy) confirming the referral has been acknowledged and received, first appointment date, attendance and treatment information, and notification of discharge/follow-up provided&lt;/li&gt;\n&lt;li&gt;Produce Reports where needed of projects worked on, Serious Incidents, and Updates for Board and Internal Performance Reporting Conference calls&lt;/li&gt;\n&lt;li&gt;Maintain an overview of entire patient pathway and ensure safe systems. Review and audit these systems and undertake failsafe activities to ensure patients are in correct status&lt;/li&gt;\n&lt;li&gt;Advise the Failsafe Manager on changes required to documented Failsafe Procedures&lt;/li&gt;\n&lt;li&gt;Assist the Failsafe Manager in maintaining a programme of pathway review so that each area of patient pathway is reviewed over a quarterly period and opportunities for improvement are reflected in the Corporate Standard Operating Procedures&lt;/li&gt;\n&lt;li&gt;Ensure data quality checks and performance validations are undertaken&lt;/li&gt;\n&lt;li&gt;Regularly review national guidelines and best practice relating to failsafe and take this into account when fulfilling the role&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll need to succeed in this role&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A team player who is supportive, reliable and trustworthy&lt;/li&gt;\n&lt;li&gt;Someone who is approachable, dedicated and hardworking&lt;/li&gt;\n&lt;li&gt;A people person – someone who enjoys working alongside and helping others&lt;/li&gt;\n&lt;li&gt;Someone who thrives on and remains calm and focused in challenging situations&lt;/li&gt;\n&lt;li&gt;Great organisational skills with the ability to prioritise workloads and meet deadlines&lt;/li&gt;\n&lt;li&gt;A high level of attention to detail and who works well within set procedures but is also able to identify errors in procedures and suggest better processes&lt;/li&gt;\n&lt;li&gt;Able to work with and respect private and confidential information&lt;/li&gt;\n&lt;li&gt;Computer literate, able to use Teams, Outlook, Word, Excel and learn an in-house information system&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Intelligence Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ashford", "postalCode": "TN23"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1337", "longitude": ".840397"}}, "title": "Deputy Administration Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916144873", "validThrough": "2020-11-23T23:59:59+0000"}