{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26970", "minValue": "24907", "unitText": "YEAR", "value": "£24,907/ £26,970/ £27,416/ £30,615"}}, "datePosted": "2020-08-05T16:53:05+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Not all Heroes wear capes. Now more than ever, being an #NHSHero is something to be proud about.&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experienced and Newly Qualified Mental Health/LD Nurses Wanted&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you passionate about great care?&lt;/p&gt;\n&lt;p&gt;Do you want to be part of a great team?&lt;/p&gt;\n&lt;p&gt;Do you want access to opportunities that will help you develop your full potential and get the best out of your career?&lt;/p&gt;\n&lt;p&gt;We want to hear from motivated and caring professionals who feel as strongly as we do about our Trust values of Compassion, Respect, Trust and Integrity. The Bradgate Mental Health Unit in Leicester is looking to recruit staff to provide high quality care for acutely unwell patients aged 18 to 65 years on mixed and single-sexed wards.&lt;/p&gt;\n&lt;p&gt;It’s an exciting time to join LPT as we are at the start of a five-year transformation journey to ensure we provide excellent services for patients with mental ill health and support people towards recovery and resilience. It’s a challenging and fulfilling environment with multi-disciplinary teamwork at its core. As an employer we can offer you a range of benefits including:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Payment of your Professional Registration costs in the first year&lt;/li&gt;\n&lt;li&gt;Access to a free bus run by another NHS Trust Monday to Friday day time along a route connecting the 3 main Leicester hospitals and free parking on site&lt;/li&gt;\n&lt;li&gt;Mentorship and career development opportunities&lt;/li&gt;\n&lt;li&gt;Within your first 12 months of employment registered Staff Nurses will be offered the opportunity to progress in a particular area of interest (where opportunities are available)&lt;/li&gt;\n&lt;li&gt;Access to range of discounted benefits as detailed at the bottom of the advert&lt;/li&gt;\n&lt;li&gt;Flexible working arrangements including long days, annualised hours and flexible retirement options&lt;/li&gt;\n&lt;li&gt;Support to return to practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return we ask that you are dedicated to providing quality patient-centred care and can demonstrate an understanding of clinical procedures including the Care Plan Approach and risk assessment.&lt;/p&gt;\n&lt;p&gt;We ask that you demonstrate excellent written and verbal communication skills along with the ability to problem solve and negotiate. We believe all our staff can develop leadership qualities and if you can demonstrate yours there will be opportunities to nurture and develop them.&lt;/p&gt;\n&lt;p&gt;The Bradgate Unit is based at the Glenfield Hospital in Leicester, a vibrant city set within the heart of England, with good transport links and easy access across the East Midlands and beyond. The inpatient unit sits within the wider Adult Mental Health and Learning Disabilities Directorate which offers a range of services within Leicester, Leicestershire and Rutland including Rehabilitation, recovery services, Forensic Mental Health and Community Services.&lt;/p&gt;\n&lt;p&gt;To arrange an informal visit or to hear more about working at the Bradgate Mental Health Unit, please feel free to ring the recruiting manager, Funmi Adenle on 01162951023&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE3 9EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6554", "longitude": "-1.18283"}}, "title": "Band 5 Staff Nurse RMHN/LD", "url": "https://www.jobs.nhs.uk/xi/vacancy/916138611", "validThrough": "2020-11-30T23:59:59+0000"}