{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17650", "minValue": "15969", "unitText": "YEAR", "value": "£9.50-£10.50 p/h"}}, "datePosted": "2020-07-15T10:34:34+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mental Health Transport Assistant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A little about us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Secure Care UK is one of the country’s leaders of specialist patient transport for the NHS and wider healthcare sectors across the UK, nationwide.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The team are responsible for the safe transportation, care, support andmanagement of service users/patients diagnosed with mental health conditions when transporting them from one destination to another and who may display challenging behaviour. It is a demanding yet very rewarding service that we provide, and our Company culture is founded upon the drive and motivation of our people.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are growing rapidly and are looking for enthusiastic individuals that have a passion for providing excellence in Health Care and an interest in gaining experience in our niche sector. For the right individuals we will provide you with a comprehensive Induction Programme where full training will be provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Purpose:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Facilitate the safe transportation of service users detained under the Mental Health Act, maintaining a safe, caring, professional and efficient level of service at all times.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Reporting:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To the Team Leader&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Roles &amp; Responsibilities: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide a professional and caring service for all patients whilst in the care of Secure Care UK, ensuring that at all times patient safety remains paramount and that safe systems of work are adhered to&lt;/li&gt;\n&lt;li&gt;To support and transport vulnerable service users as part of a team&lt;/li&gt;\n&lt;li&gt;To be able to attend the office within one hour during on-call shifts&lt;/li&gt;\n&lt;li&gt;Ensure that health and safety guidelines are followed according to current policies and procedures&lt;/li&gt;\n&lt;li&gt;To ensure that appropriate Lifting and Handling techniques are applied as per training when moving patients under non-emergency conditions, using appropriate equipment or additional supports where necessary&lt;/li&gt;\n&lt;li&gt;In the event of an incident you may be required to administer first aid commensurate to your training, and / or provide social care in non-emergency situations&lt;/li&gt;\n&lt;li&gt;To ensure that the uniform is worn in accordance with the organisations work wear policy and must wear their ID badge at all times whilst on duty&lt;/li&gt;\n&lt;li&gt;To ensure that statutory regulations and organisational policies, procedures, codes of conduct and ethics are implemented and adhered to at all times. This will include but not limited to Data Protection, and accurate reporting of facts concerning accidents or incidents to control and hospital personnel in accordance with Secure Care UK Guidelines and the Company Incident Policy&lt;/li&gt;\n&lt;li&gt;To take part in staff development programmes, regular supervisions and annual performance development reviews and/or undertake further training if and when required&lt;/li&gt;\n&lt;li&gt;To work to the values of the organisation and display high standards of integrity and professionalism towards clients and colleagues, and to act at all times in a manner consistent with legislation, policy and procedures in respect of Equality and Diversity&lt;/li&gt;\n&lt;li&gt;To continuously develop and update own knowledge and skills within the job role and contribute to setting own work objectives, and to ensure up to date with company policies, procedures and staff handbook.&lt;/li&gt;\n&lt;li&gt;To undertake any other duties relevant to the post as may be assigned from time to time which are consistent with the post.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experience and Skills:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Valid Manual Driving License for the UK&lt;/li&gt;\n&lt;li&gt;Age over 21 due to company’s insurance&lt;/li&gt;\n&lt;li&gt;Maintain Enhanced DBS&lt;/li&gt;\n&lt;li&gt;Excellent communication skills&lt;/li&gt;\n&lt;li&gt;Ability to remain calm under pressure&lt;/li&gt;\n&lt;li&gt;Able to work as part of a team&lt;/li&gt;\n&lt;li&gt;Excellent attention to detail&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return, we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Training:&lt;/strong&gt; Including Patient Care, Patient Transport, De-Escalation Techniques, Physical Intervention, Handcuff training, First Aid. Additional training also available.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£9.25 per hour worked between 6am-7pm Monday-Friday, £10.25 per hour worked between 7pm-7am Monday-Friday and on weekends.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Holidays: &lt;/strong&gt;28 days annual leave&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working Pattern: &lt;/strong&gt;4 days on 4 days off or flexible&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: &lt;/strong&gt;Full-time, Guaranteed Hours or Flexible&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt;: Permanent&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are committed to the safer recruitment process; safeguarding and promoting the welfare of children, young people and adults at risk. Due to the nature of our business, any successful applicants will be required to complete Disclosure &amp; Barring Service checks (DBS), and provide 5 years of work history, including two references.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B37 7YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4673", "longitude": "-1.72177"}}, "title": "Mental Health Transport Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916113206", "validThrough": "2020-12-31T23:59:59+0000"}