{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "30000", "unitText": "YEAR", "value": "up to £30,000"}}, "datePosted": "2020-08-14T12:23:55+0100", "description": "&lt;p&gt;Are you a Mammographer looking for a new challenge?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently recruiting for a Mammographer to join our Breast Screening team in Surrey! This includes 5 mobiles sites and the Jarvis Centre, Guilford. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;InHealth are providers of diagnostic and healthcare services to the NHS and Private providers. Through our range of Radiology Services, Pathway Services and Screening Services, we see more than 2 million patients a year across the UK.&lt;/p&gt;\n&lt;p&gt;Our Breast Screening Assessment Clinics are staffed by dedicated multi-disciplinary teams ofConsultant Radiologists,Associate Breast Clinicians, highly experienced Radiographers, clinical and administration staff,recalling womentoobtain a definitive diagnosis of all potential screen detected abnormalities. This is achieved by following the principles of triple assessment – mammography/ultrasound, clinical examination and needle biopsy).&lt;/p&gt;\n&lt;p&gt;Our primary goal is to make healthcare better by providing rapid and accurate assessment of every patient’s condition, enabling the right treatment to be delivered swiftly and effectively by specialist providers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What does being a Mammographer involve?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role is 37&lt;strong&gt;.5 &lt;/strong&gt;hours per week &lt;strong&gt;Monday - Friday. &lt;/strong&gt;Travel expenses will be covered.&lt;/p&gt;\n&lt;p&gt;As a Mammographerat InHealth, You will provide a high quality imaging service to all users of the screening and screen women for breast cancer by mammography. You will participate in assessment clinics including stereotacticbiopsies and participate in the support of development of assistant practitioners.&lt;/p&gt;\n&lt;p&gt;To apply forthis role,you will need a BSc in Radiography and a competency in mammography with HCPC registration.&lt;/p&gt;\n&lt;p&gt;Please see our job description for further information.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can InHealth offer you? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a highly competitive salary and a generous flexible benefits package, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days holiday plus bank holidays&lt;/li&gt;\n&lt;li&gt;Private medical healthcare with Bupa&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;Gym membership discount&lt;/li&gt;\n&lt;li&gt;Plus many more!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We can offer you the opportunity to do something you love, with the right support to access the roles you want, through clear career paths and best-in-class training and development. This is an environment where you have accountability for your career and can make a real contribution to the organization and to our patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;InHealth is an equal opportunities employer and welcomes applications from all areas of the community.&lt;/em&gt;&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;&lt;em&gt;Some of our roles will be subject to DBS criminal record checking in line with legal requirements but don’t worry; we will guide you through this if you are offered a role with us.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;We are a great place to work!! Thank you for your interest in working with InHealth.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "InHealth Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Surrey", "postalCode": "GU1 1LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2524", "longitude": "-.577007"}}, "title": "Mammographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916149370", "validThrough": "2020-11-30T23:59:59+0000"}