{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-07-09T11:47:45+0100", "description": "&lt;p&gt;&lt;strong&gt;We are looking for 2 Consultant Psychiatrists to join our Older Persons Mental Health Teams in the Mid and North Hampshire Division. Both will be based at Avalon House, Winchester.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Southern Health NHS Foundation Trust is a clinically led organisation, operationally supported and driven by patient centered care. We employ around 6,000 people and provide specialist mental health services, learning disability services, and community health care services. Our vision is: &lt;em&gt;‘To provide high quality, safe services which improve the health and wellbeing, independence and confidence of the people we serve.’ &lt;/em&gt;Transformational change and visionary people, are needed in order for us to achieve our goals: far greater inclusion of patients and carers in the delivery of services; closer integration of our mental and physical health services with primary, acute and social care, and much more involvement of clinical staff in the leadership and design of improved services. We are committed to the development of your career and believe that by supporting, developing and nurturing our staff we will deliver outstanding patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work with us?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Up to £8,000 relocation allowance / removal benefit&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Centre of excellence within Wessex research network&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Centre for Professional Development in Mental Health, a diverse programme of high quality multi-professional courses, involving the participation of national and international experts&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;‘New Consultants’ Development Programme’ - We’ve established this to create a network through your first year with the Trust combining a tailored development programme and coaching with organisational understanding.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;The Trust has adopted a strong Quality Improvement agenda and there is the opportunity for training in this methodology.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Protected “off-site” time for CPD can be incorporated as part of the job planning process.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Free parking at many of our sites, including Parklands and Avalon House.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Locally we have a relatively small but cohesive and supportive consultant group, meeting weekly with our consultant colleagues in Adult Mental Health. Here, alongside business and service development agendas there is a strong peer support and clinical focus.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to an excellent local Postgraduate Academic Programme to cater for CPD requirements&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;There is also a monthly Balint Group for Senior Medical staff.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of living in Hampshire&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Beautiful countryside for walks, horse riding and many other outside pursuits&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Amazing beaches with some of the best sailing in the UK, including Cowes Week&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent rail and air links&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Places of interest including Winchester Cathedral, the New Forest, South Downs and Portsmouth historic dockyard&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Leading schools and colleges&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We have a lot to offer and look forward to talking with you about the opportunities available. We strongly encourage an informal visit to the teams prior to the interview.&lt;/p&gt;\n&lt;p&gt;Please note that GMC registration (with a licence to practice) and right to work in the UK are essential for this role. Successful applicants will already have GMC registration or will be able to demonstrate they are eligible. Applicants requiring Tier 2 sponsorship should ensure they meet the Home Office application criteria prior to submitting an application.&lt;/p&gt;\n&lt;p&gt;If requested for information we can supply a copy of the policy document.&lt;/p&gt;\n&lt;p&gt;Dr Susie Carman, Dr Mary Kloer: Divisional Medical Directors 01256 376418 or email susie.carman@southernhealth.nhs.uk ormary.kloer@southernhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester", "postalCode": "SO23 0HU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0599", "longitude": "-1.30687"}}, "title": "Consultant in Older People&#39;s Mental Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916107031", "validThrough": "2020-11-20T23:59:59+0000"}