{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615"}}, "datePosted": "2020-09-02T13:26:14+0100", "description": "&lt;p&gt;Are you a dedicated RGN looking for a new challenge within a diverse, community setting?&lt;/p&gt;\n&lt;p&gt;Do you want to combine your primary care, acute and emergency nursing skills all in one place and keep your NHS Pension?&lt;/p&gt;\n&lt;p&gt;Working in secure healthcare will bring new challenges.&lt;/p&gt;\n&lt;p&gt;The days are varied and there is a wide range of training and development opportunities. You will be part of a wider multi-disciplinary team delivering primary care, mental health and substance misuse services to our patients. This includes nurse led clinics, administering medication and treatments, emergency response, triage, wound care, examinations and referrals. No two days are the same working in our friendly and supportive team.&lt;/p&gt;\n&lt;p&gt;You must have sound nursing knowledge, lots of valuable experience and demonstrate excellent communication skills. If you believe that this could be your next career move and are focussed on delivering high quality patient care, then please apply today.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spectrum Community Healthcare&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spectrum Community Health CIC is a not-for profit organisation dedicated to providing high quality patient centered healthcare. We currently provide a wide range of community and secure environment services for vulnerable groups across the North of England, and we have recently been awarded a 6 year + 3 years NHS contract to provide healthcare services into seven prisons within the North East.&lt;strong&gt; Reconnected to Health &lt;/strong&gt;is an end to end integrated care pathway which will be delivered in partnership with Humankind and Tees, Esk and Wear Valley Foundation Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126014.jpg", "name": "Spectrum Community Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Morpeth", "postalCode": "NE65 9XG"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.2965", "longitude": "-1.63243"}}, "title": "Staff Nurse - HMP Northumberland", "url": "https://www.jobs.nhs.uk/xi/vacancy/916169452", "validThrough": "2020-11-09T23:59:59+0000"}