{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competative"}}, "datePosted": "2020-08-06T14:42:18+0100", "description": "&lt;p&gt;Symphony Healthcare Services was established in 2016 as part of the award winning Symphony Programme Vanguard (BMJ Awards Primary Care Team of the Year 2018) and has rapidly grown to include a network of 13 GP practices in Somerset each caring for between 4,000 and 13,000 patients, with 40 Employed GPs.&lt;/p&gt;\n&lt;p&gt;We offer our GPs a competitive remuneration package based on the BMA GP Contract with additional incentive payments and further allowances for GPs providing specialist skills and leadership roles.&lt;/p&gt;\n&lt;p&gt;We have a GP vacancy at Highbridge Medical Centre for&lt;strong&gt; 5 sessions per week.&lt;/strong&gt;Y ou would be part of a large multidisciplinary team in an urban practice with a patient list size of over 13,000.&lt;/p&gt;\n&lt;p&gt;Maternity, contraception and child health surveillance consultations are higher than the national average and many of the patients are from relatively deprived households.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you interested in a GP career that gives you the benefits of traditional General Practice but without the risks?&lt;/p&gt;\n&lt;p&gt;Do you want to work in a practice committed to personalised care and high quality, but with the advantage of being part of a network of practices supporting each other?&lt;/p&gt;\n&lt;p&gt;Are you interested in a GP role that gives you leadership opportunities and career progression?&lt;/p&gt;\n&lt;p&gt;Do you want your pay to be guaranteed and reflect your skills and commitment?&lt;/p&gt;\n&lt;p&gt;Are you interested in working with other clinicians to provide Primary Care through a wide multi-disciplinary team?&lt;/p&gt;\n&lt;p&gt;Do you want to work for a group of practices committed to education and research?&lt;/p&gt;\n&lt;p&gt;Are you interested in flexible working arrangements, remote working from home, portfolio working, and variable work commitments?&lt;/p&gt;\n&lt;p&gt;Do you want to be part of an NHS General Practice organisation committed to innovation and redesign of General Practice and exciting to work for?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If your answer to these questions is yes, then come and join Symphony Healthcare Services at Highbridge Surgery.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information pleasecontact Sue Oliver, Head of HR, sue.oliver@ydh.nhs.uk&lt;/p&gt;", "employmentType": "PART_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132135.JPG", "name": "Symphony ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132135"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Highbridge", "postalCode": "TA9 3YA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2273", "longitude": "-2.97923"}}, "title": "Employed GP, Highbridge Medical Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916139876", "validThrough": "2020-11-30T23:59:59+0000"}