{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15129", "minValue": "15129", "unitText": "YEAR", "value": "£9.00ph"}}, "datePosted": "2020-09-21T13:39:12+0100", "description": "&lt;p&gt;&lt;strong&gt;Ambulance Care Assistants – (Full training will be provided)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Gillingham, Kent -ME7 2RT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £9.00 per hour&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bank: Various shifts&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking enthusiastic, people with a caring disposition to join our team in Gillingham. As an ambulance care assistant (ACA) you will play an important role transporting patients for hospital appointments and ensuring they return safely home again.&lt;br /&gt;&lt;br /&gt;The role involves driving, or assisting as part of a crew, patients with different requirements based on their mobility classification. The job purpose is to provide and maintain a caring environment for these patients and provide a safe transport service, maintaining high standards of patient and timeliness. Full comprehensive training is provided for the first 2-3 weeks and then mentoring with more experienced ACA’s. If interested, staff can go on to develop and learn more skills transporting and looking after patients with more complex medical needs. All this can be provided at a pace to suit our staff. We are developing training pathways at different levels up to paramedic standards which, as you progress, increases earnings and provides at truly long term and rewarding career.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job outline:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Ambulance Person will provide patient transport services, convey non-emergency patients to and from hospital and clinic appointments ensuring the patient’s welfare in transit and ensuring that safety and best practice are adhered to at all times&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist, move and handle patients, who may be ambulatory or wheelchair bound, using appropriate equipment where necessary e.g. carrying patients up the stairs using carry chair, moving immobile patients in and out of bed, and manoeuvring patients in wheelchairs into and out of the vehicle and on stretchers as necessary. Ensure patients are safely seated whilst in transit.&lt;/li&gt;\n&lt;li&gt;Minimise and deal with aggressive and abusive behaviour to reduce risks to safety and ensure patient welfare&lt;/li&gt;\n&lt;li&gt;Ensure the use of appropriate equipment and approved manual handling techniques&lt;/li&gt;\n&lt;li&gt;Maintain the cleanliness and ensure the routine daily checks of designated vehicles are carried out prior to deployment&lt;/li&gt;\n&lt;li&gt;Assist patients when entering and leaving their homes and take all reasonable actions to ensure the safety and security of their property.&lt;/li&gt;\n&lt;li&gt;Liaise and report to Control as directed within operational procedures in updating location and status and respond appropriately to instructions&lt;/li&gt;\n&lt;li&gt;Upon arrival at the place of treatment, convey patients to the appropriate location within the building as directed by Control&lt;/li&gt;\n&lt;li&gt;Provide support as directed to other agencies in the event of serious injury or emergency&lt;/li&gt;\n&lt;li&gt;To be flexible on a daily basis in relation to shift finishing times&lt;/li&gt;\n&lt;li&gt;To be flexible on a daily basis to support all PTS hospitals/locations where applicable&lt;/li&gt;\n&lt;li&gt;Maintain records as appropriate. Comply with all G4S instructions, procedures, guidelines, protocols, policies and relevant systems and adhere to all statutory legislation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Person Specification:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full driving license required&lt;/li&gt;\n&lt;li&gt;Experience of similar related role&lt;/li&gt;\n&lt;li&gt;Ability to work effectively as part of a team&lt;/li&gt;\n&lt;li&gt;Strong communication and interpersonal skills&lt;/li&gt;\n&lt;li&gt;Application of common sense approach&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The job also requires that crew members are flexible to fit in with fluctuation in service demand or operational need on the contract, i.e. a flexible working pattern&lt;/li&gt;\n&lt;li&gt;Basic literacy and numeracy are required. Formal qualifications (apart from a full, current UK driving license) are less important than the appropriate manner and attitude to patients, clients and colleagues.&lt;/li&gt;\n&lt;li&gt;Geographical knowledge of the local area to be worked within&lt;/li&gt;\n&lt;li&gt;Knowledge of Patient Transport Services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role requires the ability to work with vulnerable, frail people, who may be distressed or experiencing pain, in a caring and compassionate way. A DBS check will therefore be required to exclude any individual with a history of criminal behaviour which could be considered unacceptable (by G4S or the clients) in a patient care environment.&lt;/p&gt;\n&lt;p&gt;Safety is of paramount importance and the post holder must ensure that safe systems of work are followed without compromise. The post holder needs to be committed to maintaining high standards of customer care and service delivery that will include the responsibility of adequate safeguarding and prevent training and awareness and an understanding of reporting concerns to the line manager.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131154.JPG", "name": "G4S", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 2RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": ".573464"}}, "title": "Ambulance Driver", "url": "https://www.jobs.nhs.uk/xi/vacancy/916193215", "validThrough": "2020-11-19T23:59:59+0000"}