{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14843", "minValue": "14843", "unitText": "YEAR", "value": "£8.83 per hour"}}, "datePosted": "2020-09-09T08:55:51+0100", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Set within a safe and therapeutic environment, the Priory Hospital Dewsbury offers a locked rehabilitation service for 32 males. The service has two wards, each comprising of a ten bed unit and six bed self contained apartment.&lt;/p&gt;\n&lt;p&gt;Hartley Ward provides active rehabilitation for males with mental health issues, whilst Jubilee Ward is a slow stream rehabilitation service for males with learning disabilities and complex needs.&lt;/p&gt;\n&lt;p&gt;Personalised treatment programmes are offered alongside the use of a range of therapies. Our services are committed to a whole person approach. Service users are supported by our effective multidisciplinary team, experienced in rehabilitation, recovery and caring forthose with complex needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The position is for Jubilee Ward (Dementia Care)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Providing quality, inspiring innovation and delivering value is what we set out to achieve at Priory Healthcare. Enabling our patients to receive a truly integrated and holistic approach to their treatment and care, regardless of complexity or severity, thanks to the knowledge and expertise of our multidisciplinary clinical teams.&lt;/p&gt;\n&lt;p&gt;Priory Hospital Dewsbury is part of the Priory Group, Europe’s leading provider of specialist treatment in mental illness. We deliver highest standards of care together with an extensive range of clinical services.&lt;/p&gt;\n&lt;p&gt;The above role will be primarily focused around the effective delivery of personal care and working towards improving standards within the areas of the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to have excellent interpersonal skills when liaising with members of the multi-disciplinary team, external agencies and organisations, patients and relatives.To provide effective leadership for care staff through supervision, support and mentoring in all aspects of care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Candidates will be expected to demonstrate genuine commitment and enthusiasm for working with this client group and&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Priory Hospital Dewsbury offers great benefits including contributory pension scheme, a comprehensive employee assistance programme and discount centre and paid birthday leave. There&#39;s also free car parking and subsidised meals while you&#39;re on duty. Located just off J28 of the M62 and J40 of the M1 and is easily reached from the major West Yorkshire conurbations of Bradford, Halifax, Huddersfield, Leeds. Sheffield and surrounding areas&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dewsbury, West Yorkshire", "postalCode": "WF12 7LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6937", "longitude": "-1.61427"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916177618", "validThrough": "2020-11-30T23:59:59+0000"}