{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60516", "minValue": "38663", "unitText": "YEAR", "value": "£23 to £36"}}, "datePosted": "2020-09-09T12:38:46+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title and Grade: Biomedical Scientist Advanced Band 7&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust: &lt;/strong&gt;Ipswich&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: £23 to £36&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: C&lt;/strong&gt;&lt;strong&gt;overing ‘Earlies’, ‘Lates’, ‘Days’, ‘Nights’ &amp; ‘Weekend’.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you interested in the science behind the causes and effects of diseases? Would you like a career in the NHS and make a real difference to people’s lives? If you answered ‘yes’ to the above, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;Our clientoperates across three Hospital laboratory sites located in Colchester, Ipswich, and West Suffolk Hospitals. Hosted by East Suffolk and North Essex NHS Foundation Trust, our client is the largest organisation in the Eastern region with brand new, exciting Molecular Laboratory with state-of-the-art equipment.&lt;/p&gt;\n&lt;p&gt;The service is clinically led and designed to achieve the benefits of scale that can be achieved by three hospitals working together, while remaining close enough to our customers to meet their needs and support the excellent clinical care provided by our hospitals.&lt;/p&gt;\n&lt;p&gt;We want the best staff and are committed to attracting and retaining the best pathology staff and if you want to work with us to develop your own career and help us to achieve our vision then we would like to hear from you as &lt;/p&gt;\n&lt;p&gt;Our client is in the unique position of providing a dedicated Pathology Training Team with the aim of producing a highly skilled workforce through the provision of continued training and development for staff. You will be able to add to your current skill set and grow.&lt;/p&gt;\n&lt;p&gt;Responsible as lead Biomedical Scientist for a specialist area, particularly Molecular and Microbiology experience required.&lt;/p&gt;\n&lt;p&gt;Manages and coordinates the day to day activities of the team&lt;/p&gt;\n&lt;p&gt;Leads on service improvement&lt;/p&gt;\n&lt;p&gt;Processes specialist investigations and responsible for standard and quality of results&lt;/p&gt;\n&lt;p&gt;Provides specialist advice to clinicians as to appropriateness of tests and timescales.&lt;/p&gt;\n&lt;p&gt;Provides specialist service e.g. training, advanced trouble shooting, problem solving for specialist requirement.&lt;/p&gt;\n&lt;p&gt;To work flexibly in reflection of service needs which may include an extended working day and/or participation in delivery of a 24 hour, 7 day per week service.&lt;/p&gt;\n&lt;p&gt;The work of the service brings staff into constant contact with human body fluids, tissues and hazardous chemicals. This may include blood, pus, urine, faeces, and respiratory secretions.&lt;/p&gt;\n&lt;p&gt;Maintain and promote professional image of the pathology Department.&lt;/p&gt;\n&lt;p&gt;Manage the performance of manual, semi-automated, specialist and fully automated laboratory investigations within a defined service area accurately and efficiently.&lt;/p&gt;\n&lt;p&gt;Day to day management of stock control and usage.&lt;/p&gt;\n&lt;p&gt;Manage quality control procedures and the processing of quality control material as per established protocols. .&lt;/p&gt;\n&lt;p&gt;Implement policies for service improvement and propose policy changes that may impact beyond own area.&lt;/p&gt;\n&lt;p&gt;Ensure the validation of test results which may be highly specialised, and escalate where appropriate in line with established protocols.&lt;/p&gt;\n&lt;p&gt;Responsible for ensuring equipment, including highly specialist equipment, is set up and maintained for others to use, to achieve the optimum instrument performance and maintain a clean and safe working environment.&lt;/p&gt;\n&lt;p&gt;Perform advanced troubleshooting in line with established protocols by using judgement on how to proceed during technical failures.&lt;/p&gt;\n&lt;p&gt;Participate in Research and Development, clinical trials and equipment testing.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Biomedical Scientist Advanced Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916178241", "validThrough": "2020-12-31T23:59:59+0000"}