{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 pa"}}, "datePosted": "2020-09-01T14:09:19+0100", "description": "&lt;p&gt;Full Time Consultant Psychiatrist in CAMHS, Grantham&lt;/p&gt;\n&lt;p&gt;The Role&lt;/p&gt;\n&lt;p&gt;Lincolnshire and NEL CAMHS were rated outstanding in the recent CQC visit.&lt;br /&gt;The post-holder will contribute to the provision of a specialist and multi-disciplinary community based Child and Adolescent Mental Health service to the area of Grantham, Sleaford, and North Spalding and surrounding villages, with population of about 38000. The team receives on average 70 referrals per month. The post holder works with colleagues from the Grantham and Boston CAMHS hubs and clinics are held at Sycamore Centre Grantham, Riversdale Clinic Sleaford and Johnson Community Hospital, Spalding. &lt;br /&gt;The post-holder will be expected to liaise with, and develop, sound working relationships with practitioners in other agencies such as the Lincolnshire Councils (Local Authority) Children’s Service which incorporates Social Care and Education Departments as well as acute and community Paediatrics provided by United Lincolnshire Hospital Trusts (ULHT).&lt;br /&gt;After LPFT won the tender for the service, the newly structured team went through a redesign in 2016 which has resulted in a completely new way of working. The outcome of the changes has resulted in children and young people receiving a much more effective and timely service that is excellent value for money and meets the needs of the local population.&lt;/p&gt;\n&lt;p&gt;Whats on offer:&lt;/p&gt;\n&lt;p&gt;Lincolnshire Partnership NHS Foundation Trust (LPFT) is a high performing and financially sound organisation. We are rated in the top two Mental Health Trusts in England (Staff Survey); ‘Good’ overall and ‘Outstanding’ for well-led (CQC); and consistently recognised by our junior doctors as the best place in the east midlands for their education, learning and development (GMC Survey). We have vacancies for Consultants and Specialty Doctors across the county of Lincolnshire and we are looking for individuals, with the right vales and behaviours, to come and join us. We can offer you the following support and opportunities:&lt;/p&gt;\n&lt;p&gt;•Attractive remuneration package that includes an additional recruitment premium (R&amp;R) and local pensions options&lt;br /&gt;•Flexible relocation package&lt;br /&gt;•Protected time for research and/or special clinical interest&lt;br /&gt;•Study leave of 30 days over 3 years with a study leave budget of £2000 per person per annum&lt;br /&gt;•A strong ethos on learning and development for medical staff&lt;br /&gt;•Annual Clinical Excellence Awards&lt;br /&gt;•Excellent staff benefits, e.g. subsidised lease car, a variety of salary sacrifice and savings schemes&lt;br /&gt;•Health and wellbeing support, e.g. early access to physiotherapy, psychological therapies&lt;br /&gt;•Flexible working and less than full time applications supported&lt;br /&gt;•Active internal medical bank with opportunity to undertake extra paid duties&lt;/p&gt;\n&lt;p&gt;Why Lincolnshire?&lt;/p&gt;\n&lt;p&gt;The county offers an excellent standard of living with the best schools (the majority of senior schools being grammar and academies), below average house prices, lowest crime rates, good air quality, less pollution and beautiful surroundings.&lt;/p&gt;\n&lt;p&gt;Lincolnshire first Medical School in collaboration with The University of Nottingham and University of Lincoln will take its first cohort of medical students in from September 2019. The Medical School inspiring waterfront campus is right in the heart of a friendly and vibrant city of Lincoln with the aim of creating future medical workforce that is from the community and for the community. LPFT has Senior Consultant representatives steering the development of the medical school ensuring psychiatry is at the forefront of the curriculum as well as cementing quality placements within LPFT.&lt;/p&gt;\n&lt;p&gt;Why LPFT?&lt;/p&gt;\n&lt;p&gt;This is an excellent and exciting time to join an innovative Trust, aspiring for better patient outcomes. As well as being recognised as one of the best Trusts nationally, we are a values led organisation who believe in compassionate and inclusive leadership.&lt;/p&gt;\n&lt;p&gt;We have been awarded regionally nationally for our work on equality and diversity (including the Stonewall top 100 employers), patient safety, community partnerships and our workforce. Enhancing innovation, research and clinical effectiveness is also a key area for development and we are particularly seeking individuals who can lead in the delivery of National Institute for Health Research (NIHR). Medics are supported with their special interest groups coupled with having an excellent post graduate training experience and medical education team.&lt;/p&gt;\n&lt;p&gt;Please note whilst this post is commissioned to be full time (40 hours per week) the Trust would welcome applications from those wanting an improved work life balance and if you would like to consider this post on less than full time hours please apply and outline this on your application form and this will be looked at favorably.&lt;/p&gt;\n&lt;p&gt;Applicants should note LPFT would consider merging job plans to provide the variety and experience you are looking for, for example Consultant Psychiatrist in LD CAMHS and Consultant Psychiatrist CAMHS.&lt;/p&gt;\n&lt;p&gt;For initial enquiries please contact Dr Ananta Dave, Medical Director / CAMHS Consultant on Ananta.Dave@LPFT.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sycamore Centre, Beacon Lane, Grantham", "postalCode": "NG31 9DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9119", "longitude": "-.630795"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916167896", "validThrough": "2020-12-12T23:59:59+0000"}