{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-08-13T16:31:04+0100", "description": "&lt;p&gt;We’re looking for nurses to join our trauma and orthopaedic care group at University Hospital Southampton NHS Foundation Trust (UHS). T&amp;O serves a diverse range of patient groups, from treating the acutely unwell to expert falls management and dementia care, and we support our staff to deliver effective high standard care at all levels. Join a team of dedicated staff working cohesively and always in the best interest of our patients.&lt;/p&gt;\n&lt;p&gt;Please note that this vacancy is for experienced nurses – if you’re a newly qualified nurse you should apply through our dedicated newly qualified adult or child nurse adverts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR CARE GROUP&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our trauma and orthopaedic unit provides an elective service for patients with conditions which have developed over time, and a trauma service for patients who have been injured in accidents. We have six wards, one major trauma ward, one elective ward, two trauma wards, a trauma Assessment unit, an outpatients department split over 2 sites and a step down ward at the PAH.&lt;/p&gt;\n&lt;p&gt;We have a team of highly specialised consultants, many of whom are nationally and internationally recognised for their expertise and experience. We treat patients from across Hampshire, and provide second opinions and treatment for complex conditions for patients from a wider area. UHS is a Major Trauma Centre (established 2012) and T&amp;O house the Major Trauma ward in it’s footprint.&lt;/p&gt;\n&lt;p&gt;Our consultants are supported by nurses, therapists and other specialist clinical staff who are also experts in their field of orthopaedic care.&lt;/p&gt;\n&lt;p&gt;We are leading the way in innovative procedures including minimally invasive surgery, hip resurfacing and computer-navigated surgery. Our role as a teaching hospital and work in research and development help to keep us at the forefront of new developments and treatments.&lt;/p&gt;\n&lt;p&gt;Our service can be split into several areas:&lt;/p&gt;\n&lt;p&gt;- Major hip and knee joint replacements and revisions&lt;/p&gt;\n&lt;p&gt;- Hand, wrist and elbow surgery&lt;/p&gt;\n&lt;p&gt;- Shoulder surgery&lt;/p&gt;\n&lt;p&gt;- Foot and ankle surgery&lt;/p&gt;\n&lt;p&gt;- Trauma surgery including treating fractured neck of femur&lt;/p&gt;\n&lt;p&gt;- Pelvic fractures&lt;/p&gt;\n&lt;p&gt;- Spinal surgery&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TEAMS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;126 beds&lt;/p&gt;\n&lt;p&gt;Nearly 400 staff&lt;/p&gt;\n&lt;p&gt;Accolades recently won:&lt;/p&gt;\n&lt;p&gt;Chief Nursing Officer’s silver award –Band 7 ward leader&lt;/p&gt;\n&lt;p&gt;Nursing Directors award – Band 7 ward Leader&lt;/p&gt;\n&lt;p&gt;Registered Nurse of the year runner up – Band 7 Ward Leader&lt;/p&gt;\n&lt;p&gt;Registered nurse of the year nominee – Matron&lt;/p&gt;\n&lt;p&gt;Inclusive Team of the Year nominee –Trauma ward team&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Culture&lt;/strong&gt; –&lt;/p&gt;\n&lt;p&gt;warmth, can do attitude, care and compassion. T&amp;O have a strong commitment to training and development with plenty of learning opportunities.&lt;/p&gt;\n&lt;p&gt;Diverse workforce.&lt;/p&gt;\n&lt;p&gt;See attachment for individual areas “blurb”&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pioneering surgery&lt;/strong&gt; –&lt;/p&gt;\n&lt;p&gt;Quality Improvement projects – e.g. model ward, encouraging therapy and nursing teams to work together more closely&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;T&amp;O have their own education team supported by the divisional team. All new employees will be given 2 weeks supernumerary induction and then ongoing support tailored to their needs.&lt;/p&gt;\n&lt;p&gt;Opportunities to shadow various specialist nurses, theatre or Advanced Nurse Practitioners, attend a trauma &amp; orthopaedic course, trauma awareness sessions.&lt;/p&gt;\n&lt;p&gt;All NQNs assigned a mentor and a band 6 lead.&lt;/p&gt;\n&lt;p&gt;Succession planning is key, development actively encouraged either through the ward setting or as a specialist nurse. Secondments offered to aid development.&lt;/p&gt;\n&lt;p&gt;Flexible working offered , aligned to service requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Rated ‘Good’ by the CQC, UHS is one of England&#39;s largest acute teaching trusts. In the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Attrill&lt;/p&gt;\n&lt;p&gt;Recruitment Coordinator&lt;/p&gt;\n&lt;p&gt;lisa.attrill@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;023 8120 4488&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Staff Nurse - Trauma and Orthopaedic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916148386", "validThrough": "2020-11-13T23:59:59+0000"}