{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa (plus premia of up to 10%)"}}, "datePosted": "2020-09-21T09:19:06+0100", "description": "&lt;p&gt;North Cumbria University Hospitals Trust is looking for a dynamic and motivated Locum Consultant Gastroenterologist to join our team of 16 consultants including six consultant gastroenterologists and eight gastrointestinal surgeons as well as one specialty doctor in gastroenterology to provide an integrated digestive diseases service across north Cumbria. The North Cumbria GI Service is a new, cohesive and integrated department, combining the services of gastroenterology and endoscopy, upper gastrointestinal, hepatobiliary, colorectal, emergency GI surgery.&lt;/p&gt;\n&lt;p&gt;The department has two dedicated GI wards within the Cumberland Infirmary at Carlisle for the treatment of inpatients. The plan in the near future is to have all GI areas collocated. There is a dedicated 3-room endoscopy unit at The Cumberland Infirmary and the new endoscopy unit at West Cumberland Hospital, Whitehaven has 2 dedicated rooms in a new, state of the art facility. There is a specialist GI physiology lab on both sites.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a team of gastroenterologists supported by nurse specialists across North Cumbria NHS Trust. Associated with the transformation of all our services across the Trust, and in conjunction with the introduction of our model for acute medical care, it is envisaged that future configurations will focus complex in patient work at the Carlisle site, and elective outpatient services (endoscopy and outpatient clinics) will be provided by all of the team across the Trust. Sub specialty interest will be encouraged where this contributes to and complements the department and Trusts’ service needs.&lt;/p&gt;\n&lt;p&gt;While appointees will be appointed to a base unit, all members of the team will be expected to contribute to all aspects of the general gastroenterology service across the Trust.&lt;/p&gt;\n&lt;p&gt;The On-call commitment is negotiable but could include Out of hours GI Bleed cover and General Internal Medicine. The standard job plan attracts 10 Pas.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Relocation assistance of up to £4,000 may be available for successful applicants moving to the region&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post currently attracts a discretionary recruitment premium of up to 10% (based on basic salary) per annum. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please see full job description and personal specification for details. Interview date to be confirmed.&lt;/p&gt;\n&lt;p&gt;Closing date: 16th Novemeber 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlisle &amp; Whitehaven", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Locum Consultant in Gastroenterology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916192325", "validThrough": "2020-11-16T23:59:59+0000"}