{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "1076681", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 1 additional PA offered as acui"}}, "datePosted": "2020-09-23T12:01:33+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrist – General Adult Psychiatry&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;10 PA + 1 PA additional payment for acuity and managing out of area patients&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Team and Base:&lt;/strong&gt;&lt;strong&gt; Weaver ward – female adult inpatient unit (17 beds),&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Brooker Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a consultant psychiatrist to provide leadership and medical input to our Female adult inpatient unit – Weaver ward at Brooker Centre. The successful candidate will be joining the inpatient team during an exciting period of community service transformation towards locality based care delivery model across the Trust and will be keen to participate in the change process. &lt;br /&gt;&lt;br /&gt;The successful candidate will be strongly committed to patient care and take a leadership role and support the team. You will work closely with the Consultant colleague for Male adult inpatient unit – Bridge ward and will have supervision responsibilities to CT1-3 trainee or FY2 / GP trainee. Please see the job description for more detail. &lt;br /&gt;&lt;br /&gt;This role may be suitable for non-UK or non-EEA job applicants wishing to apply for Home Office Tier 2 sponsorship.&lt;br /&gt;&lt;br /&gt;Halton Borough has excellent senior leadership team, and we are known for our friendly working relationships. Medical input and leadership from medical staff is highly valued in the Borough.&lt;/p&gt;\n&lt;p&gt;The North West Boroughs Healthcare is a specialist NHS Foundation Trust in the North West of England providing a wide range of Mental Health Services for Adults, Older People, Children and Adolescents, Substance Misuse and Specialist Learning Disabilities for the Boroughs of Warrington, Wigan, Halton, St Helens and Knowsley. &lt;br /&gt;&lt;br /&gt;The Trust has academic links with the Universities of Liverpool and Manchester and has an active in-house academic programme&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced check with adults barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For an informal discussion about this post prior to submission of application, please contact Dr Nanda Dayalan - Associate Medical Director on 01928 753175 or email nanda.dayalan@nwbh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brooker Centre, Runcorn", "postalCode": "WA7 2DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3233", "longitude": "-2.69459"}}, "title": "Consultant Psychiatrist Inpatient service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916196658", "validThrough": "2021-01-21T23:59:59+0000"}