{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29270", "minValue": "29270", "unitText": "YEAR", "value": "£29,270"}}, "datePosted": "2020-08-27T18:01:17+0100", "description": "&lt;p&gt;Mill Garth Hospital is a 21-bedded locked rehabilitation and recovery service suitable for men aged 18 years and over. The hospital focuses on active rehabilitation and recovery for those with mental illnesses and personality disorders.&lt;/p&gt;\n&lt;p&gt;We believe that anyone with a mental health condition should be given the best chance possible to lead a happy and fulfilling life, and our aim is to provide individuals with the confidence and skills to move or return to the community..&lt;/p&gt;\n&lt;p&gt;Main Duties:&lt;/p&gt;\n&lt;p&gt;• Assess, plan and deliver, with the patient and their carer/family, nursing care which takes account of patient choice and wishes and acting as the patients named nurse.&lt;/p&gt;\n&lt;p&gt;• Accurately observe and engage with patients in order to assess their need and evaluate their progress.&lt;/p&gt;\n&lt;p&gt;• Monitor and review Nursing Care plans.&lt;/p&gt;\n&lt;p&gt;• Evaluate and respond to changes in patient condition and needs.&lt;/p&gt;\n&lt;p&gt;• Deal proactively and effectively with suggestions and complaints from patients and their families / carers.&lt;/p&gt;\n&lt;p&gt;• Contribute to a team approach to patient care in conjunction with all members of the Multi-Disciplinary team&lt;/p&gt;\n&lt;p&gt;• Participate&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LEEDS", "postalCode": "LS6 4RA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8286", "longitude": "-1.56986"}}, "title": "STAFF NURSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916165158", "validThrough": "2020-11-27T23:59:59+0000"}