{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-09-04T16:30:13+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Theatre Nurse/ ODP – Anaesthetics &amp; Recovery in our Oxford Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s in it for you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;On joining our agile and highly energised multidisciplinary team you’ll have a fantastic opportunity to develop your skills and experience across a range of specialties and levels of complexity.&lt;/p&gt;\n&lt;p&gt;Supported by our Clinical Lead, you’ll have autonomy to utilise your acquired expertise and skills to make decisions that will ensure the delivery excellent patient care. The work is exciting, varied and challenging, the multiple specialities will enable you to develop new skills and grow. We actively support you to be the best you can be in your role while also offering opportunities to progress.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits, including free gym membership. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;With drive, passion and high standards, you might join us from the NHS or a private setting. Either way, you will discover unrivalled scope to work autonomously, making full use of your skills and knowledge and adding value. As a Theatre Nurse/ ODP – Anaesthetic &amp; Recovery you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work closely with leading consultants and other like-minded professionals, who will respect and value what you bring to the close-knit multidisciplinary team.&lt;/li&gt;\n&lt;li&gt;Enjoy opportunities to work on a varied caseload using technology, equipment and facilities, which are all state-of-the-art.&lt;/li&gt;\n&lt;li&gt;Supervise, support and develop junior members of staff.&lt;/li&gt;\n&lt;li&gt;Deliver high quality care and experiences for patients, which is always clinically effective, evidence based and appropriate.&lt;/li&gt;\n&lt;li&gt;As part of the wider hospital team you will interact with colleagues on the ward because you understand that continuity in patient care is key.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To succeed as a Theatre Nurse/ ODP – Anaesthetic &amp; Recovery you will have;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualifications and experience relevant to your registration, including NMC or HCPC.&lt;/li&gt;\n&lt;li&gt;Post-registration experience.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills and will be a great team worker. You will also be flexible and motivated.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dependent on experience&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Location - Oxford&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Full Time, 37.5 hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3 7RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7603", "longitude": "-1.21546"}}, "title": "Operating Department Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916173609", "validThrough": "2021-01-04T23:59:59+0000"}