{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive salary plus benefits"}}, "datePosted": "2020-08-25T10:12:49+0100", "description": "&lt;p&gt;BMI London Independent Hospital in Stepney Green is part of BMI Healthcare, Britain&#39;s leading provider of independent healthcare with a nationwide network of hospitals &amp; clinics, performing more complex surgery than any other private healthcare provider in the country. &lt;/p&gt;\n&lt;p&gt;We have an opportunity for a&lt;strong&gt; Senior Clinical Pharmacist&lt;/strong&gt; to join their team of staff in the &lt;strong&gt;Pharmacy department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a Full time role for 37.5 hours a week. &lt;/strong&gt;The role holder will be required to cover a flexible shift pattern.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Applicants should meet the following criteria:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Degree in Pharmacy MPharm, BSc or BPharm.&lt;/li&gt;\n&lt;li&gt;Registered with the General Pharmaceutical Council as a pharmacist.&lt;/li&gt;\n&lt;li&gt;Knowledge of General Pharmaceutical Council Codes of Professional Conduct, Ethics and Performance and their implications for practice.&lt;/li&gt;\n&lt;li&gt;Post graduate clinical diploma in clinical pharmacy (hospital) or equivalent experience.&lt;/li&gt;\n&lt;li&gt;Post Graduate and ITU experience&lt;/li&gt;\n&lt;li&gt;Knowledge of the Care Standards Act and Care and Quality Commission Requirements.&lt;/li&gt;\n&lt;li&gt;Proficient in the use of a PC, including the use of software and systems.&lt;/li&gt;\n&lt;li&gt;Provision of a clinical pharmacy service to a relevant clinical speciality.&lt;/li&gt;\n&lt;li&gt;Recent experience of dispensing medicines and experience of medicine management in a hospital setting.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Duties of this role include:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide pharmaceutical expertise and input to the care of the patients within a BMI hospital. Supporting the pharmacy department to deliver an excellent medicine management service to all customers, supervising the procurement, preparation, dispensing and distribution of medicines.  To supervise junior staff members in the delivery of the medicine management service, and where necessary to assume responsibility for specialist clinical service.&lt;/li&gt;\n&lt;li&gt;To facilitate the daily running of the pharmacy department, providing a safe and effective medicines management service to all patients, staff, consultants and customers.&lt;/li&gt;\n&lt;li&gt;Provide clinical input with respect to medicines to all patients.&lt;/li&gt;\n&lt;li&gt;Ensure accurate and timely charging.&lt;/li&gt;\n&lt;li&gt;Ensure compliance with all appropriate regulatory, professional and best practice frameworks.&lt;/li&gt;\n&lt;li&gt;Be a proactive member of the Hospital’s multidisciplinary team,&lt;/li&gt;\n&lt;li&gt;Commitment to ensuring quality services are delivered to both internal &amp; external stakeholders through continuous improvement activities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further detailed information on the responsibilities and accountabilities of this vacancy please refer to the job description.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Salary &amp; Benefits:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;BMI Healthcare have committed to being a national living wage employer and offer a competitive starting salary alongside access to a wide range of employee benefits, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BMI Healthcare Private Medical Insurance&lt;/li&gt;\n&lt;li&gt;BMI Pension Scheme&lt;/li&gt;\n&lt;li&gt;25 days holiday per annum increasing up to 30 days with long service&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity, Paternity &amp; Adoption Leave&lt;/li&gt;\n&lt;li&gt;Market leading learning and development, including free courses and industry recognised qualifications&lt;/li&gt;\n&lt;li&gt;Nationwide Gym discounts &amp; Online Fitness Classes&lt;/li&gt;\n&lt;li&gt;BMI Staff Health Checks&lt;/li&gt;\n&lt;li&gt;Blue Light Discount Card for 1,000s of nationwide discounts and exclusive offers&lt;/li&gt;\n&lt;li&gt;Cycle to Work – and much more!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For more information on this role or for an informal chat please contact Ayman Al Omoush on 0207780 2691.&lt;/p&gt;\n&lt;p&gt;If you would like to apply for this opportunity, please complete our brief online application form and ensure to upload the most recent copy of CV.  We aim to respond to your application within 14 days of the closing date.  &lt;/p&gt;\n&lt;p&gt;Owing to the nature of this position, any offer of employment will be subject to a satisfactory Enhanced Disclosure Check.&lt;/p&gt;\n&lt;p&gt;Safeguarding&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;BMI Healthcare is fully committed to safeguarding the welfare of all children and young people, and vulnerable adults by taking all reasonable steps to protect them from harm.  All staff will receive appropriate training and induction so that they understand their roles and responsibilities and are confident about carrying them out.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Disability Confident – Committed Employer:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed Employer BMI we endeavour to ensure that disabled people and those with long term health conditions have the opportunities to fulfil their potential and realise their aspirations within BMI. If you require reasonable adjustments for your application, interview or during your onboarding/induction process BMI will support you. For more information on the Government’s Disability Confident Employer Scheme, please click here&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BMI Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepney Green", "postalCode": "E1 4NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5204", "longitude": "-.046675"}}, "title": "Senior Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916160755", "validThrough": "2020-11-22T23:59:59+0000"}