{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "competitive"}}, "datePosted": "2020-09-14T14:29:21+0100", "description": "&lt;p&gt;We have fantastic opportunities for full and part time Registered Medical Practitioners with extensive Rehabilitation Consultant experience to join Circle Birmingham Hospital on the BBC Pebble Mill site in Birmingham. As one of our Rehabilitation Consultants you play a vital role in shaping the organisation’s culture and strategic vision and communicating this to staff on the front line. In addition this role advocates for the patient at the organisation’s highest level and are crucial to improving the quality and value of care. We opened our doors in September 2020 and we are looking to grow rapidly over the next few months. We include provision for NHS patients and Private patient, along with day-case and outpatient rehabilitation facilities with significant investment in new technologies.  It will incorporate the luxurious interiors and hospitality for which Circle’s private hospitals are known, along with world class equipment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Person Specification:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong leadership&lt;/li&gt;\n&lt;li&gt;Excellent interpersonal skills&lt;/li&gt;\n&lt;li&gt;High professional standards&lt;/li&gt;\n&lt;li&gt;Collaborative working with all members of the MDT&lt;/li&gt;\n&lt;li&gt;Commitment to our vision and strategy ensuring that our patients receive holistic rehabilitation&lt;/li&gt;\n&lt;li&gt;Demonstrate a high level of compassion for patients and their relatives&lt;/li&gt;\n&lt;li&gt;Use and development of evidence based practise&lt;/li&gt;\n&lt;li&gt;Act as a professional role model for junior members of staff&lt;/li&gt;\n&lt;li&gt;Commercial awareness&lt;/li&gt;\n&lt;li&gt;Excellent networking and influencing skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return you will:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the hospital senior leadership team developing and launching an exciting innovative model of Rehabilitation in Birmingham&lt;/li&gt;\n&lt;li&gt;You will be supported by Rehabilitation Director, Rehabilitation Medical Director Head of Nursing and Allied Health Professionals and Therapy Leads, Head of Operations&lt;/li&gt;\n&lt;li&gt;Be encouraged to develop a personalised CPD plan and access unique clinical and academic and development opportunities  &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional benefits of joining Circle Health:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days’ annual leave with additional days for long-term service&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme: save money on a new bike and benefit from interest-free instalments&lt;/li&gt;\n&lt;li&gt;Private pension scheme helping your to live well in retirement&lt;/li&gt;\n&lt;li&gt;Employee assistance programme: get confidential support 24/7&lt;/li&gt;\n&lt;li&gt;Private medical insurance to help you get any treatment you need quickly&lt;/li&gt;\n&lt;li&gt;Non-contributory life assurance and income protection insurance&lt;/li&gt;\n&lt;li&gt;Perkbox for employee discounts at a range of retailers, restaurants and other services&lt;/li&gt;\n&lt;li&gt;Season ticket loan: get the benefit of an annual ticket and pay the cost over 12 months&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Circle Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B5 7AS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4702", "longitude": "-1.89926"}}, "title": "Rehabilitation Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916183737", "validThrough": "2020-11-13T23:59:59+0000"}