{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14069", "minValue": "14069", "unitText": "YEAR", "value": "£8.37 per hour"}}, "datePosted": "2020-09-01T15:00:22+0100", "description": "&lt;h1&gt;&lt;strong&gt;Patient Records Administrator&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Do you have proven the experience of working in administration? OR are you looking for a role that helps build a career in administration and skills that lasts a lifetime?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you be interested in working in our supportive and friendly Administration Team?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is exciting times for our Administration Team and we have new opportunities. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Priory Medical Group….&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are forward thinking, innovative and patient focussed&lt;/li&gt;\n&lt;li&gt;Recognise that the quality of our work is driven by the quality of our people&lt;/li&gt;\n&lt;li&gt;Are committed to providing an open, friendly and supportive environment where all staff are encouraged to share ideas and contribute to continuously improving the service we offer&lt;/li&gt;\n&lt;li&gt;Will provide you with all the tools, training and personal support needed to &lt;strong&gt;enjoy&lt;/strong&gt; and &lt;strong&gt;succeed &lt;/strong&gt;in this key patient service role&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What is a ‘Patient Records Administrator’?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Administration Team is made up of three specialities –Clinical Coding, Patient Records and Secretarial.&lt;/p&gt;\n&lt;p&gt;This role is within the Patient Records speciality and will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Scanning and work-flowing electronic and paper letters from hospitals and other health services&lt;/li&gt;\n&lt;li&gt;Processing deductions for patients who have left the practice and liaising with the Health Authority&lt;/li&gt;\n&lt;li&gt;Processing notes arriving from the Health Authority and filing paper records&lt;/li&gt;\n&lt;li&gt;Processing Choice Office Summaries in an efficient manner&lt;/li&gt;\n&lt;li&gt;Dealing with internal requests including stationery, paper records and opening the post&lt;/li&gt;\n&lt;li&gt;Providing excellent customer service to your colleagues, the patients of the Practice, and our external clients&lt;/li&gt;\n&lt;li&gt;Our company and this role will continue to evolve and you will be expected to rise to the challenge&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we look for in your application:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven background with the positive attitude and outlook required to work in a dynamic, fast-paced and customer centred business&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven Team Player with pride in how you interact with colleagues and contribute to a positive working environment&lt;/li&gt;\n&lt;li&gt;Professional pride in the quality of your work and relationship with your customers&lt;/li&gt;\n&lt;li&gt;A healthy dose of common sense and proven record of working autonomously. Our environment is dynamic and varied and common sense will guide your decision making&lt;/li&gt;\n&lt;li&gt;Proven ability to adapt to change – we are constantly improving and evolving our ways of working and new technologies. You need a proven background of adapting to change&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The skills we are looking for you to bring to the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to work in an efficient, helpful and methodical manner, keeping the patient at the forefront of everything you do&lt;/li&gt;\n&lt;li&gt;Proven background with accurate, timely and efficient data inputting&lt;/li&gt;\n&lt;li&gt;Proven ability to following processes and procedures accurately and efficiently&lt;/li&gt;\n&lt;li&gt;An enthusiastic approach to new changes in an ever-evolving team&lt;/li&gt;\n&lt;li&gt;Meticulous attention to detail&lt;/li&gt;\n&lt;li&gt;Competent in the use of PC based technologies including Microsoft Outlook, Word. Full training will be given for in-house systems. You will also attend several external medical terminology training courses&lt;/li&gt;\n&lt;li&gt;An understanding of the importance of confidentiality in the workplace and able to follow data protection policies and guidelines&lt;/li&gt;\n&lt;li&gt;Great communication skills face to face, on the phone and written / via e-mail&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Job title&lt;/strong&gt;: Administrator – in the Patient Records Team&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working hours/contact times&lt;/strong&gt;: 37.5 hours per week, Monday to Friday&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt;£8.72 per hour + Company (non NHS) pension scheme&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: Priory Medical Group, Acomb, Cornlands Road, York,&lt;/p&gt;\n&lt;p&gt;YO24 3WX&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection for Interview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Practice recognises that discrimination of any kind is both unlawful and would act as a barrier to finding the most talented individuals for our organisation. As such, our recruitment and selection procedures exist to ensure no job applicant, employee or worker is discriminated against either directly or indirectly on the grounds of age, disability, gender reassignment, marriage and civil partnership, pregnancy or maternity, race, religion or belief, sex or sexual orientation.&lt;/p&gt;\n&lt;p&gt;A great deal of careful consideration has been invested in preparing the advert for this post based on the specification for this role and the person we are looking for. &lt;strong&gt;Our selection for the interview process is designed to ensure individuals are selected for interview on the merit of their application only&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;If you are applying through NHS Jobs, you will notice you are asked if you would like a guaranteed interview as part of the ‘Two Tick’ disability scheme. Whilst this is an admirable government initiative, please be aware we are not signed up to this scheme. This is a question on the NHS jobs application form which is outside of our own control. Our own process ensures we consider candidates on the merit of their application only and we do not ask any questions regarding disability as part of our selection process. We only give candidates the opportunity to share information regarding any disability after candidates are invited to interview and only if the candidate feels they require adjustments in the interview process.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Medical Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO24 3WX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9495", "longitude": "-1.12943"}}, "title": "Patient Records Administrator - 37.5 hours per week", "url": "https://www.jobs.nhs.uk/xi/vacancy/916168063", "validThrough": "2020-12-08T23:59:59+0000"}