{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16725", "minValue": "16221", "unitText": "YEAR", "value": "£9.65 - £9.95 per hour"}}, "datePosted": "2020-09-14T10:55:38+0100", "description": "&lt;p&gt;About The Role&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Eldertree Lodge&lt;/strong&gt; in the village of &lt;strong&gt;Ashley, near Market Drayton&lt;/strong&gt; is a residential home for men and women with autism, &lt;strong&gt;Asperger&#39;s or other learning disabilities.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are located on the &lt;strong&gt;Shropshire/Staffordshire border&lt;/strong&gt;, 11 miles from &lt;strong&gt;Stoke-on-Trent&lt;/strong&gt; and we specialise in providing short-term high-dependency rehabilitation that fully prepares individuals for moving into the community from long-stay environments. We also support individuals who are already living in the community but who suddenly find themselves unable to cope.&lt;/p&gt;\n&lt;p&gt;We are now looking for permanent Night Support Worker / Healthcare Assistants&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assist nursing staff in providing high quality individualised care to a clearly defined group of patients / residents, relatives and carers.&lt;/li&gt;\n&lt;li&gt;To work and act as a key member of the team, supporting each patient / resident in achievement of their planned outcomes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key Accountabilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;With regular supervision and support from nursing staff&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assist the nursing team with the assessment of individual patient / resident needs, planning, delivery and evaluation of care for a number of individuals or groups of patients / residents, including following the clinical risk assessment plan.&lt;/li&gt;\n&lt;li&gt;To exercise a reasonable and agreed degree of professional autonomy and make judgements and decisions in order to satisfy the expectations and demands of the job.&lt;/li&gt;\n&lt;li&gt;To undertake clinical work related tasks as delegated by senior nursing staff, following appropriate training and assessment of competency.&lt;/li&gt;\n&lt;li&gt;To undertake clinical supervision to further develop competence and clinical practice.&lt;/li&gt;\n&lt;li&gt;To liaise effectively with all stakeholders in the care process, including carers and relatives, aspiring to provide an effective, seamless and integrated service to patients / residents.&lt;/li&gt;\n&lt;li&gt;To maintain accurate, legible records of care provided, based upon the care plan incorporating all relevant communication and liaison.&lt;/li&gt;\n&lt;li&gt;To maintain and update relevant knowledge and skills, maintain a professional portfolio and participate in further training as appropriate, in order to enhance quality of care for patients / residents and carers.&lt;/li&gt;\n&lt;li&gt;To comply with the Huntercombe Group Health and Safety Policies and Protocols in order to contribute to safe working practices.&lt;/li&gt;\n&lt;li&gt;To protect vulnerable adults / children from internal/external elements and act as a Patient / resident Advocate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Communication and Relationship Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Communicates with clarity in confidence in a variety of situations, relays information accurately to staff&lt;/li&gt;\n&lt;li&gt;Is actively involved in meeting own and team objectives through encouraging and supporting others.&lt;/li&gt;\n&lt;li&gt;Participates in discussions and debates and staff meetings offering views.&lt;/li&gt;\n&lt;li&gt;Participate in the process of positively supporting and inspiring colleagues within the service to improve standards and quality and to develop professional practice.&lt;/li&gt;\n&lt;li&gt;Communicate all relevant issues pertaining to care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Obligations&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;If Statutory/Professional Registration is a requirement of this role it must be maintained at all times.&lt;/li&gt;\n&lt;li&gt;Responsibility to maintain continuous professional development in order to meet requirements of professional registration.&lt;/li&gt;\n&lt;li&gt;To work within the boundaries of your relevant Professional Code of Conduct.&lt;/li&gt;\n&lt;li&gt;Adherence to national guidance and best practice evidence on Infection Control.&lt;/li&gt;\n&lt;li&gt;Compliance with the Huntercombe Group clinical polices and those adopted.&lt;/li&gt;\n&lt;li&gt;Participation in the Huntercombe Group clinical governance work programmes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt; About You &lt;strong&gt;Please take a look at our progressive and rewarding benefits package&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/li&gt;\n&lt;li&gt;2 week’s paid paternity leave&lt;/li&gt;\n&lt;li&gt;Shared parental leave, matching the maternity leave benefit&lt;/li&gt;\n&lt;li&gt;A thorough Induction Programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave allowance&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Continuing Professional Development (CPD)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;For a more detailed job spec please take a look at our Website where you can also read some inspiring stories and find out why working at Huntercombe really sets us apart from the rest.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Market Drayton, Stafford", "postalCode": "TF9 4LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9291", "longitude": "-2.35599"}}, "title": "Night Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916183072", "validThrough": "2020-11-22T23:59:59+0000"}