{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30711", "minValue": "18171", "unitText": "YEAR", "value": "£10.81 to £18.27"}}, "datePosted": "2020-09-01T15:06:08+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt;Medical Laboratory Assistant (higher level)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt;Ipswich&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Day – £10.81Night/Sat – £14.60 Sunday/BH – £18.27&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;&lt;strong&gt;Ad-hoc work, covering ‘Earlies’, ‘Lates’, ‘Days’, ‘Nights’ &amp; ‘Weekend’.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you interested in the science behind the causes and effects of diseases? Would you like a career in the NHS and make a real difference to people’s lives? If you answered ‘yes’ to the above, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;Our client operates across three Hospital laboratory sites located in Colchester, Ipswich, and West Suffolk Hospitals. Hosted by East Suffolk and North Essex NHS Foundation Trust, our client is the largest organisation in the Eastern region with brand new, exciting Molecular Laboratory with state-of-the-art equipment.&lt;/p&gt;\n&lt;p&gt;The service is clinically led and designed to achieve the benefits of scale that can be achieved by three hospitals working together, while remaining close enough to our customers to meet their needs and support the excellent clinical care provided by our hospitals.&lt;/p&gt;\n&lt;p&gt;Providing a wide range of flexible work, covering ‘&lt;strong&gt;Earlies&lt;/strong&gt;’, ‘&lt;strong&gt;Lates&lt;/strong&gt;’, ‘&lt;strong&gt;Days&lt;/strong&gt;’, ‘&lt;strong&gt;Nights&lt;/strong&gt;’ &amp; ‘&lt;strong&gt;Weekend&lt;/strong&gt;’ - Shift patterns ranging from: &lt;strong&gt;We require candidates at Ipswich location only.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- 06:00 - 14:00&lt;/p&gt;\n&lt;p&gt;- 14:00 – 22:00&lt;/p&gt;\n&lt;p&gt;- 22:00 - 06:00&lt;/p&gt;\n&lt;p&gt;To apply for this post, you must have the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;GCSE Maths and English (A-C)&lt;/li&gt;\n&lt;li&gt;Demonstratable knowledge of a range of routine and non-routine healthcare science duties&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our client is in the unique position of providing a dedicated Pathology Training Team with the aim of producing a highly skilled workforce through the provision of continued training and development for staff. You will be able to add to your current skillset and grow.&lt;/p&gt;\n&lt;p&gt;This unique role will provide support to front line healthcare professionals. You will be working in a brand new, exciting Molecular Laboratory with state-of-the-art equipment, meaning that you can bring your vital skills to the following disciplines:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Performs a range of routine and non-routine healthcare science activities under supervision, e.g. performs standard molecular tests.&lt;/li&gt;\n&lt;li&gt;Maintains clinical records in relation to activities carried out.&lt;/li&gt;\n&lt;li&gt;Demonstrate own duties to new or less experienced employees.&lt;/li&gt;\n&lt;li&gt;To work flexibly in reflection of service needs this may include an extended working day and/or participation in delivery of a 24 hour, 7 days per week service.&lt;/li&gt;\n&lt;li&gt;The work of the service brings staff into constant contact with human body fluids, tissues and hazardous chemicals. This may include blood, pus, urine, faeces, and respiratory secretions.&lt;/li&gt;\n&lt;li&gt;Maintain and promote professional image of the Pathology Department.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Registering with NHS Professionals&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;By registering, you can tackle unfilled shift pressures by supporting last-minute shifts, while receiving several attractive incentives:&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of shifts at your Trust&lt;/strong&gt; – Access to shifts before they are available to agency&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working to suit your lifestyle &lt;/strong&gt;– Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance for every shift you work&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book and manage your shifts on the go&lt;/strong&gt; – Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Well … If a hospital cannot supply staff on a ward or area, due to increased demand, sickness, or common staff shortages, they need to call upon Bank staff. NHS Professionals works with trusts to develop ‘bank’ of highly skilled workers who want to work flexibly with the NHS.&lt;/p&gt;\n&lt;p&gt;Working through a staff bank helps a trust reduce their reliance on expensive agencies helping their spend go back into healthcare. Right now, we have over &lt;strong&gt;130,000 members&lt;/strong&gt; registered on our bank from various roles, grades and specialities all saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; per year which is reinvested back into each client trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join today …&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Register with us today for Bank membership and look forward to a choice of flexible work and long-term placements opportunities, as well as the ability to develop professionally and gain experience in some of the most prestigious NHS trusts in England.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Medical Laboratory Assistant (Higher Level)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916168094", "validThrough": "2020-12-31T23:59:59+0000"}