{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23575", "minValue": "22327", "unitText": "YEAR", "value": "£22,327.50 - £23,575.50 per annum"}}, "datePosted": "2020-09-09T08:24:50+0100", "description": "&lt;p&gt;About The Role We are currently seeking Nurse Associates to join our Adult Mental Health and Intellectual Disabilities Low Secure Service, located in the village of Barham, 6 miles from Canterbury and 10 miles from Dover. The successful applicant will either already be NMC registered or in the process of doing so.&lt;br /&gt;&lt;br /&gt; Working with The Huntercombe Group is rewarding and varied. Through our “Conversation into Action” programme we actively encourage our employees to get involved and to drive organisational change for the better.&lt;br /&gt;&lt;br /&gt; The Huntercombe Hospital, Cedar House- near Canterbury&lt;br /&gt;&lt;br /&gt; The hospital is a 40 bed low secure hospital that provides specialist assessments, treatment and care for adults with intellectual disabilities, personality disorders or autistic spectrum disorders, including those with challenging behaviours and forensic histories.&lt;br /&gt;&lt;br /&gt; We work collaboratively with our patients and their families or carers and provide person-centred care and support. We employ staff in a variety of different roles and provide ongoing support with comprehensive training, learning and development opportunities.&lt;br /&gt;&lt;br /&gt; The Huntercombe Group is delighted to announce we are embarking on implementing a strategic new nurse training programme specifically designed for Nurse Associates to join our successful venture.&lt;br /&gt; Are you seeking the opportunity to work for a leading private healthcare provider where you will be valued for your contribution? Are you keen to progress your career with ongoing CPD? If so, this is the opportunity you have been waiting for.&lt;br /&gt;&lt;br /&gt; We are seeking to recruit passionate, driven, enthusiastic nurse associates to contribute to our successful services based in Northampton, Maidenhead, Bristol and Kent. Huntercombe have ambitious plans to develop our services, and this is an exciting time to join us as we move into 2020.&lt;br /&gt;&lt;br /&gt; Essential requirements:-&lt;br /&gt;&lt;br /&gt;• Understanding and assessing clinical risk;&lt;br /&gt;• Ability to utilise care plans to effectively deliver care pathways to patients;&lt;br /&gt;• Excellent oral and written communication skills;&lt;br /&gt;• Ability to work cohesively with clinical teams under the guidance of ward management team;&lt;br /&gt;• Ability to develop professional working relationships with challenging patient groups;&lt;br /&gt;• Experienced in working within multi disciplinary teams;&lt;br /&gt;• Compassionate approach in working with service users, friends, families/carers and professional approach in working with outside agencies;&lt;br /&gt;• You must be a registered Nursing Associate registered with the NMC – or in the process of registering.&lt;br /&gt;&lt;br /&gt;We are able to offer flexible working patterns – full time or part time including days/nights and weekends. In addition, you will have access to ongoing training and development, annual appraisals and clinical supervision.&lt;br /&gt;&lt;br /&gt; Successful candidates will ideally be currently working within either an adult or CAMHS mental health/learning disabilities setting, and have a desire to work in a fast paced environment.&lt;br /&gt;&lt;br /&gt; Interested? Don’t delay apply today! Please contact (The Recruitment Team) for further details/informal visits.&lt;br /&gt;&lt;br /&gt; About You&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please take a look at our progressive and rewarding benefits package&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;• Employee Assistance Programme (EAP)&lt;br /&gt;• Maternity leave at 3 month’s full pay and 3 month’s half pay, (up to a max salary of £50k)&lt;br /&gt;• 2 week’s paid paternity leave&lt;br /&gt;• Shared parental leave, matching the maternity leave benefit&lt;br /&gt;• A thorough Induction Programme tailored to the hospital where you will be working&lt;br /&gt;• Clear pay structure, with competitive rates&lt;br /&gt;• Generous annual leave allowance&lt;br /&gt;• Sick pay of 4 weeks full pay and 4 weeks half pay&lt;br /&gt;• The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;br /&gt;• Death in service benefit equivalent to 2 x salary&lt;br /&gt;• A range of staff discounts&lt;br /&gt;• Continuing Professional Development (CPD)&lt;/p&gt;\n&lt;p&gt;For a more detailed job spec please take a look at our Website where you can also read some inspiring stories and find out why working at Huntercombe really sets us apart from the rest.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barham, Canterbury, kent", "postalCode": "CT4 6PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2019", "longitude": "1.17601"}}, "title": "Nurse Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916177576", "validThrough": "2020-11-11T23:59:59+0000"}