{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24861", "minValue": "24861", "unitText": "YEAR", "value": "14.79"}}, "datePosted": "2020-08-27T17:14:10+0100", "description": "&lt;p&gt;Mount Eveswell  is a rehabilitation unit for brain injury patients. We also look after patients who got complex nursing needs like tracheostomy, CPAP etc&lt;/p&gt;\n&lt;p&gt;We are looking for a hard-working staff who is willing to learn and happy to work with a MDT team.&lt;/p&gt;\nPrinciple responsibilities,\n&lt;ul&gt;\n&lt;li&gt;To provide high standard of nursing care to service users based on the assessment of care needs and in the consultation with the service users, their relatives and care team.&lt;/li&gt;\n&lt;li&gt;To continuously evaluate the quality of care given, and regularly re assess the needs of service users.&lt;/li&gt;\n&lt;li&gt;To administer and order medicines.&lt;/li&gt;\n&lt;li&gt;Liaise with the GP and other health professional involved in the service users care.&lt;/li&gt;\n&lt;li&gt;Care planning and implementation and reviewing of care plans.&lt;/li&gt;\n&lt;li&gt;To continuously review their own nursing practise to develop new skills and knowledge throughout continuous professional development training that contributes to the enhancement of patient care skills.&lt;/li&gt;\n&lt;/ul&gt;\nQualifications/Experience:\n&lt;ul&gt;\n&lt;li&gt;The candidate must be a Qualified Registered Nurse with NMC pin.&lt;/li&gt;\n&lt;li&gt;Experience is not essential.&lt;/li&gt;\n&lt;li&gt;\n&lt;strong&gt;About us&lt;/strong&gt;\n&lt;p&gt;As one of the UK’s leading providers of behavioural care and specialist support services to adults and young people, Priory Group promise a challenging and fulfilling career with the support of a world class organisation willing to invest in your development. &lt;/p&gt;\n&lt;p&gt;Across our network of hospitals, residential care homes, education facilities and supported living services, we are making a real and lasting difference to the lives of the people we support.&lt;/p&gt;\n&lt;strong&gt;Disclosure&lt;/strong&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer. Priory Group will cover the cost of a DBS check.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NEWPORT", "postalCode": "NP19 8GS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5903", "longitude": "-2.97131"}}, "title": "Bank Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916165093", "validThrough": "2020-11-27T23:59:59+0000"}