{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36000", "minValue": "32000", "unitText": "YEAR", "value": "£32,000 - £36,000"}}, "datePosted": "2020-09-03T12:54:19+0100", "description": "&lt;p&gt;InHealth sees more than 3 million patients each year and diagnostic imaging is one of the busiest services that we provide. Our fully integrated imaging services offer increased capacity for NHS trusts and convenient, fast access to services for patients.&lt;/p&gt;\n&lt;p&gt;We are looking for an&lt;strong&gt; Senior MRI Radiographer &lt;/strong&gt;to join our radiology department at&lt;strong&gt; Barnet Hospital&lt;/strong&gt;. This is a full-time role working &lt;strong&gt;36 hours per week, split across 3 x 12-hour shifts.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are the key responsibilities of the Radiographer’s role? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Carry out magnetic resonance imaging procedures to best practice standards of radiographic technique (MHRA Guidance 2015, IR(ME)R 2017, Code of Clinical Practice)&lt;/li&gt;\n&lt;li&gt;Provide a great experience for patients attending for MRI scanning, supporting them through the process from referral to results&lt;/li&gt;\n&lt;li&gt;Run quality assurance checks on equipment and action as appropriate&lt;/li&gt;\n&lt;li&gt;Respect and work within patient’s and service users’ customs, values and spiritual beliefs, making sure their views are sought and taken into account&lt;/li&gt;\n&lt;li&gt;Support patient bookings and make sure Patient Information Systems are maintained with accurate and up-to-date information&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What skills and experience will you need to apply?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BSc Radiography or equivalent&lt;/li&gt;\n&lt;li&gt;Previous experience of MRI scanning&lt;/li&gt;\n&lt;li&gt;A high level of professionalism and technical standard of work, complying with relevant Codes of Practice&lt;/li&gt;\n&lt;li&gt;Member of an appropriate professional body and to hold a valid registration (HCPC)&lt;/li&gt;\n&lt;li&gt;Proven knowledge of the requirements of an MRI radiographer’s role in the care of patients, their visitors and carers, and to colleagues&lt;/li&gt;\n&lt;li&gt;Ability to work in a multidisciplinary team&lt;/li&gt;\n&lt;li&gt;A flexible approach to work, with the ability to work contracted hours across 7 days per week&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What’s in it for you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A highly competitive salary is a given, topped a generous flexible benefits package, including private medical insurance and 27 days holiday (plus bank holidays). We also have aninnovative approach to personal and professional development, helping you to be the best version of you and giving you a real career pathway.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;em&gt;InHealth is an equal opportunities employer and welcomes applications from all areas of the community.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "InHealth Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Senior MRI Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916171110", "validThrough": "2020-11-30T23:59:59+0000"}