{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "168100", "minValue": "168100", "unitText": "YEAR", "value": "£100 - £160"}}, "datePosted": "2020-09-22T12:04:00+0100", "description": "&lt;p&gt;Are you looking to be part of an organisation during an exciting time? Looking to be part of an enthusiastic existing Cardiology team? Do you specialise in electrophysiology?&lt;/p&gt;\n&lt;p&gt;The department consists of a 50 bedded purpose built cardiology unit with 3 cardiac catheterisation laboratories, a 12 bedded CCU, 5 echo rooms, a 14-bedded day ward, a TOE and stress-echo room as well as a dedicated cardiology out-patient suite.&lt;/p&gt;\n&lt;p&gt;The consultant team is supported by 10 SpRs who provide 24/7 middle grade cover. We have 10 junior doctors across grades FY1 – CMT2. The medical staff are supported by a Physicians Associate and teams of Clinician Assistants, hospital based Heart Failure Nurse Specialists, Arrhythmia Nurse Specialists and Cardiac Rehab Nurse Specialists. There is a comprehensive team of cardiac physiologists with national specialist accreditation (BSE or Heart Rhythm UK) who independently run pacemaker. You will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full GMC registration with a license to practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If this sounds like it is for you, please apply with your CV here. Our dedicated Doctors recruiter will get in touch with you to answer any further questions you have and get the review and recruitment process started. For an initial chat please call our team on 0333 577 3316, option 2 or send us an email at join.portsmouth@bankpartners.co.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135154.jpg", "name": "Portsmouth Hospitals NHS Trust Staff Bank", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Bank Cardiology Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916194840", "validThrough": "2020-11-06T23:59:59+0000"}