{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "8531", "minValue": "7959", "unitText": "YEAR", "value": "Between £7,959.64 and £8,531.12 p/session p/year"}}, "datePosted": "2020-09-14T11:38:44+0100", "description": "&lt;h1&gt;&lt;strong&gt;Salaried GP in Rawcliffe Surgery&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;WE ARE NOT YOUR TYPICAL PRACTICE;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;WE ARE NOT YOUR TYPICAL PRACTICE;&lt;br /&gt; &lt;strong&gt;We are not your typical practice&lt;/strong&gt;&lt;strong&gt;;&lt;/strong&gt;PMG is a 9 site Super Practice offering NHS (PMS Contract) and non-NHS healthcare to over 58,000 patients.&lt;br /&gt; &lt;strong&gt;We think differently&lt;/strong&gt;&lt;strong&gt;;&lt;/strong&gt;we are strong believers that if you “look after your staff, they will look after your patients”.&lt;br /&gt; &lt;strong&gt;We are Leaders in healthcare;&lt;/strong&gt;locally, regionally and nationally.&lt;br /&gt; &lt;strong&gt;We are award winning;&lt;/strong&gt;our recent achievements include; Pioneers of Integrated care, Gold Standard Framework Palliative Care Accreditation, Digital Technology Pioneers&lt;br /&gt; &lt;strong&gt;We excel in Clinical Education;&lt;/strong&gt;and Training.&lt;br /&gt; &lt;strong&gt;We are a Team;&lt;/strong&gt;Our high achieving back office team support our clinical staff and multiple GP Practices throughout Yorkshire.&lt;br /&gt; Our high performing Prescribing Admin Team, pioneering in-house Mental Health, Complex Care and MSK teams are designed to support the working day of the GP and offer high quality patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THE POSITION&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deliver coaching and mentorship to our GP’s and Allied Clinical Professionals&lt;/li&gt;\n&lt;li&gt;Deliver clinical sessions to patients face to face, via telephone and e-consultation&lt;/li&gt;\n&lt;li&gt;Full time or Part Time positions are available&lt;/li&gt;\n&lt;li&gt;Six weeks annual leave plus 1 week study leave&lt;/li&gt;\n&lt;li&gt;We are looking for a GP with ambition and enthusiasm with either an established area of interest, such as training, research or a clinical speciality, or a desire to develop an area of specialist interest.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT US&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;List size currently 58,800 pts in beautiful York.&lt;/li&gt;\n&lt;li&gt;12 GP Partners, 24 Salaried GPs&lt;/li&gt;\n&lt;li&gt;Large multidisciplinary team including Advanced Nurse Practitioners, Urgent Care Practitioners, Physician Associates, MSK specialists and dedicated Complex Care, Integrated Care and Mental Health Teams&lt;/li&gt;\n&lt;li&gt;9 surgery sites covering the City of York and surrounding villages&lt;/li&gt;\n&lt;li&gt;Over 250 employees (Clinical, Admin, Reception, AHPs)&lt;/li&gt;\n&lt;li&gt;100% QOF achievement for the last 5 years&lt;/li&gt;\n&lt;li&gt;Wide range of additional and enhanced services&lt;/li&gt;\n&lt;li&gt;Well established teaching and training practice, including Med Students, PAs, Nursing, GPRs and ACPs.&lt;/li&gt;\n&lt;li&gt;Single SystmOne Clinical System&lt;/li&gt;\n&lt;li&gt;Onsite 100 hour pharmacy at one of our sites.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;So are you in?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sessions:&lt;/strong&gt; Rawcliffe Surgery - sessions negotiable&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rate of Pay:&lt;/strong&gt; Salary is between £7,959.64 p/session p/year and £8,531.12 p/session p/year dependent on strength of candidate and any additional responsibilities that might be mutually agreed.&lt;/p&gt;\n&lt;p&gt;Terms and conditions such as occupational sick pay and maternity pay are based on NHS eligible service + Medical Defence Indemnity Fees &amp; General Medical Council Membership Fees paid directly by the partnership for the duration of your time with us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection for Interview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Practice recognises that discrimination of any kind is both unlawful and would act as a barrier to finding the most talented individuals for our organisation. As such, our recruitment and selection procedures exist to ensure no job applicant, employee or worker is discriminated against either directly or indirectly on the grounds of age, disability, gender reassignment, marriage and civil partnership, pregnancy or maternity, race, religion or belief, sex or sexual orientation.&lt;/p&gt;\n&lt;p&gt;A great deal of careful consideration has been invested in preparing the advert for this post based on the specification for this role and the person we are looking for.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our selection for interview process is designed to ensure individuals are selected for interview on the merit of their application only&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;If you are applying through NHS Jobs, you will notice you are asked if you would like a guaranteed interview as part of the ‘Two Tick’ disability scheme. Whilst this is an admirable government initiative, please be aware we are not signed up to this scheme. This is a question on the NHS jobs application form which is outside of our own control. Our own process ensures we consider candidates on the merit of their application only and we do not ask any questions regarding a disability as part of our selection process. We only give candidates the opportunity to share information regarding any disability &lt;strong&gt;after&lt;/strong&gt; candidates are invited to interview and &lt;strong&gt;only&lt;/strong&gt; if the candidate feels they require adjustments in the interview process.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Medical Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO30 6ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9741", "longitude": "-1.09758"}}, "title": "Salaried GP in Rawcliffe Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916183224", "validThrough": "2020-12-08T23:59:59+0000"}