{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-09-07T11:39:08+0100", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Consultant in Anaesthetic and Chronic Pain&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;We invite applications for a substantive Consultant in Chronic Pain and Anaesthetics at Torbay &amp; South Devon NHS Foundation Trust for candidates with a broad range of skills to become active members of our flexible team.&lt;/p&gt;\n&lt;p&gt;We are particularly interested in applicants with expertise in all aspects of Chronic pain and would welcome applicants with wider skills in service improvement, audit and governance, research, teaching, management and leadership would be desirable. Our on-call commitment has evolved to provide the highest quality consultant delivered service whilst responsive to work-life balance. The general anaesthetic rota is a 1 in 20 non-resident on call. The on-call Consultant must have the necessary expertise to cover Obstetric Anaesthesia. Consultants also contribute on a 1:20 basis to Saturday trauma.&lt;/p&gt;\n&lt;p&gt;Torbay hospital has a reputation for a friendly working environment, excellent trainee feedback and is a national innovator in many areas including day surgery and peri-operative medicine. Outside of the hospital, the area offers a great lifestyle with beautiful countryside from the stunning South Devon coastline with its sandy beaches and pebble coves to the rugged peaks of Dartmoor and the rolling South Hams.&lt;/p&gt;\n&lt;p&gt;For new substantive consultants the job plan for this postwill include 2.5 SPAs for the first year.&lt;/p&gt;\n&lt;p&gt;Applicants are required to be on the GMC Specialist Register, or within six months of their expected date of receipt of a CCT/EU equivalent certification at the time of interview. Applications are welcomed from those unable to work full-time for personal reasons or those wishing to job-share.&lt;/p&gt;\n&lt;p&gt;Informal enquiries regarding this post should be addressed to:&lt;/p&gt;\n&lt;p&gt;Dr Andrew Gunatilleke – Clinical Lead in pain Medicine andrew.gunatilleke@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Omar Islam – Clinical Director Anaesthetics e-mail - omarislam@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torbay Hospital", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Consultant in Anaesthetic and Chronic Pain Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916174465", "validThrough": "2020-11-29T23:59:59+0000"}