{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45000", "minValue": "30000", "unitText": "YEAR", "value": "£30,000 - £45,000 DOE"}}, "datePosted": "2020-08-27T19:41:59+0100", "description": "&lt;p&gt;InHealth sees more than 3 million patients each year and our pain management service is one of the most important solutions we provide. We help, support and teach patients to manage pain by delivering evidence-based cognitive behavioural therapy approaches as a multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;We are looking for a &lt;strong&gt;Clinical Psychologist &lt;/strong&gt;to join our pain management team in&lt;strong&gt; Durham and Darlington&lt;/strong&gt;. This is a full-time role working &lt;strong&gt;37.5 hours per week, Monday to Friday.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are the key responsibilities of the Psychologist’s role? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Delivering relevant, effective and sensitive pain management to individuals and groups&lt;/li&gt;\n&lt;li&gt;Assessing, planning and reviewing patients’ pain management treatment appropriately, ensuring that specialist support is focused on the patient’s individual needs&lt;/li&gt;\n&lt;li&gt;Devising and reviewing plans of care aimed at helping patients to achieve their goals&lt;/li&gt;\n&lt;li&gt;Promoting patient education and understanding of pain, rehabilitation and self-management strategies&lt;/li&gt;\n&lt;li&gt;Evaluation the outcome of care with the multi-disciplinary team, assessing the distress and emotional impact of pain&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What skills and experience will you need to apply?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BSc in Psychology with a good understanding of cognitive behavioural therapy&lt;/li&gt;\n&lt;li&gt;Member of an appropriate professional body and to hold a valid registration (HCPC)&lt;/li&gt;\n&lt;li&gt;Understanding of the bio-psychosocial nature of chronic pain experience and management&lt;/li&gt;\n&lt;li&gt;Proven knowledge of the requirements of a Psychologist’s role in the care of patients, their visitors and carers, and to colleagues&lt;/li&gt;\n&lt;li&gt;A high level of professionalism and technical standard of work, complying with relevant Codes of Practice&lt;/li&gt;\n&lt;li&gt;Ability to work in a multidisciplinary team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What’s in it for you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We can offer a highly competitive salary and aninnovative approach to personal and professional development, helping you to be the best version of you and giving you a real career pathway. &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;em&gt;InHealth is an equal opportunities employer and welcomes applications from all areas of the community.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "InHealth Pain Management Solutions Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Durham &amp; Darlington", "postalCode": "DL5 4SF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6303", "longitude": "-1.5806"}}, "title": "Clinical Psychologist - Pain Management", "url": "https://www.jobs.nhs.uk/xi/vacancy/916165178", "validThrough": "2020-11-30T23:59:59+0000"}