{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "30000", "unitText": "YEAR", "value": "£30,000 - £38,000 DOE"}}, "datePosted": "2020-08-04T17:06:46+0100", "description": "&lt;p&gt;InHealth sees more than 3 million patients each year and diagnostic imaging is one of the busiest services that we provide. Our fleet of mobile solutions offers advanced diagnostic capabilities in the community within easy reach of patients.&lt;/p&gt;\n&lt;p&gt;We are looking for a &lt;strong&gt;Senior CT Radiographer &lt;/strong&gt;to join our mobiles division in the North of England! This is a full-time role working &lt;strong&gt;36 hours per week, Monday to Sunday, &lt;/strong&gt;&lt;strong&gt;split across 3 x 12-hour shifts&lt;/strong&gt;. As a Senior Radiographer in our North mobiles CT team you are eligible for a company car or car allowance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What is the overall purpose of the job?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Senior CT Radiographer with InHealth, you will deliver a professional and efficient service, working alongside your colleagues in our dynamic and fast-paced sites. As an integral part of our clinical team, your skills as a Radiographer help us to deliver on our vision to make healthcare better.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are the key responsibilities of the role?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Carry out CT imaging procedures to best practice standards of radiographic technique&lt;/li&gt;\n&lt;li&gt;Provide a great experience for patients attending for CT scanning, supporting them through the process from referral to results&lt;/li&gt;\n&lt;li&gt;Perform triage functions of referrals as required&lt;/li&gt;\n&lt;li&gt;Support patient bookings and make sure Patient Information Systems are maintained with accurate and up-to-date information&lt;/li&gt;\n&lt;li&gt;Demonstrate safe, effective practice in line with policies and procedures&lt;/li&gt;\n&lt;li&gt;Maintain professional competencies and CPD&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What skills and experience will you need to apply?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BSc Radiography or equivalent&lt;/li&gt;\n&lt;li&gt;Previous experience of CT scanning&lt;/li&gt;\n&lt;li&gt;Expertise to ensure the appropriate triage, booking and examination of patients&lt;/li&gt;\n&lt;li&gt;A high level of professionalism and technical standard of work, complying with relevant Codes of Practice&lt;/li&gt;\n&lt;li&gt;Member of an appropriate professional body and to hold a valid registration (HCPC)&lt;/li&gt;\n&lt;li&gt;Ability to work in a multidisciplinary team&lt;/li&gt;\n&lt;li&gt;A flexible approach to work, with the ability to work contracted hours across 7 days per week&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What can InHealth offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a highly competitive salary and a generous flexible benefits package, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days holiday plus bank holidays&lt;/li&gt;\n&lt;li&gt;Private medical healthcare with Bupa&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;Gym membership discount&lt;/li&gt;\n&lt;li&gt;Plus many more!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We can offer you the opportunity to do something you love, with the right support to access the roles you want, through clear career paths and best-in-class training and development. This is an environment where you have accountability for your career and can make a real contribution to the organization and to our patients.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;InHealth is an equal opportunities employer and welcomes applications from all areas of the community.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "InHealth Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Senior CT Radiographer (Mobiles)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916137019", "validThrough": "2020-11-30T23:59:59+0000"}