{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29556", "minValue": "29556", "unitText": "YEAR", "value": "£29,556.80"}}, "datePosted": "2020-08-27T17:58:03+0100", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt;The Priory Hospital Market Weighton was awarded an OUTSTANDING RATING FROM THE CQC in 2018 and is a registered male independant hospital, supporting individuals with learning disabilities, behaviours and challenge and mental health issues.&lt;/p&gt;\n&lt;p&gt;Situated in the attractive town of Market Weighton the service is ideally located for safe, structured and gradual reintergration into the local community. The purpose built hospital is an open service with the ability to lock the doors to maintaintain service user safety.&lt;/p&gt;\n&lt;p&gt;It can accommodation up to 15 individuals in four distinct areas providing a tiered care pathway to support them in their recovery and rehabilitation. All bedrooms have en suite facilities.&lt;/p&gt;\n&lt;p&gt;roviding quality, inspiring innovation and delivering value is what we set out to achieve at Priory Healthcare. Enabling our patients with mental health illness to receive a truly integrated and holistic approach to their treatment, regardless of complexity or severity, thanks to the knowledge and expertise of our multidisciplinary clinical teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our multidisciplinary team work collaboratively with service users and commissioners to deliver a comprehensive assessment and treatment programme and adaptable care pathways, empowering service users to progress towards the least restrictive setting and towards independence.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful candidates will be motivated to work in a service that offers involvement and empowerment for patients, who may have a personality disorder and/or mental illness, encouraging patients to have a real voice in how services develop and in their individualised care pathways. You will be flexible and supportive, enabling patients to build on their existing strengths and feel positive about their lives.&lt;/p&gt;\n&lt;p&gt;What we’d like from you:&lt;/p&gt;\n&lt;p&gt;• RNLD/RMN Qualified&lt;/p&gt;\n&lt;p&gt;• NMC (Nursing &amp; Midwifery Council Registered)&lt;/p&gt;\n&lt;p&gt;• Knowledge of the Mental Health Act&lt;/p&gt;\n&lt;p&gt;• Patient centric &amp; commitment to delivering high quality care&lt;/p&gt;\n&lt;p&gt;• Fine tuned decision making skills&lt;/p&gt;\n&lt;p&gt;• Excellent organisational capability&lt;/p&gt;\n&lt;p&gt;• Effective communication skills&lt;/p&gt;\n&lt;p&gt;• Flexibility and a strong “can do” attitude&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What we’d like to offer you:&lt;/p&gt;\n&lt;p&gt;• Excellent salary&lt;/p&gt;\n&lt;p&gt;• Many benefits in line with the NHS&lt;/p&gt;\n&lt;p&gt;• Working with a dedicated multidisciplinary team&lt;/p&gt;\n&lt;p&gt;• Free on-site parking&lt;/p&gt;\n&lt;p&gt;• Enhanced maternity pay&lt;/p&gt;\n&lt;p&gt;• Flexible benefits including reduced rates and access to new schemes including gym membership, IT technology (laptops / tablets / smartphones) and private healthcare&lt;/p&gt;\n&lt;p&gt;• Access to development opportunities including:&lt;/p&gt;\n&lt;p&gt;• Sponsorship of professional qualifications through our Individual Professional Development (IPD) panel&lt;/p&gt;\n&lt;p&gt;• Improved CPD application &amp; panel process&lt;/p&gt;\n&lt;p&gt;• £250 Contribution towards CPD&lt;/p&gt;\n&lt;p&gt;• Leadership &amp; management development&lt;/p&gt;\n&lt;p&gt;• Support with your Revalidation&lt;/p&gt;\n&lt;p&gt;• NMC Payment in full&lt;/p&gt;\n&lt;p&gt;• Long service award&lt;/p&gt;\n&lt;p&gt;* FREE MEALS WHEN ON DUTY&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the UK’s leading providers of behavioural care and specialist support services to adults and young people, Priory Group promise a challenging and fulfilling career with the support of a world class organisation willing to invest in your development.&lt;/p&gt;\n&lt;p&gt;Across our network of hospitals, residential care homes, education facilities and supported living services, we are making a real and lasting difference to the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.Priory Group will cover the cost of a DBS check.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "MARKET WEIGHTON", "postalCode": "YO43 3EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8643", "longitude": "-.670693"}}, "title": "Staff Nurse (RNLD/RMN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916165156", "validThrough": "2020-11-27T23:59:59+0000"}