{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23761", "minValue": "21089", "unitText": "YEAR", "value": "£21,089 to £23,761 pa"}}, "datePosted": "2020-09-01T12:56:20+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Pharmacy Technician Aseptic Services - Band 4 - Pharmacy- 37.5 hours per week - Permanent&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Serving a rural population of around 280,000, we aim to provide the right care, in the right place, at the right time – whether in the hospital or community setting across west Suffolk. We deliver high-quality services in a variety of settings including people’s own homes, care homes, day centres, schools, GP surgeries and health centres, as well as the Newmarket Community Hospital inpatient unit and clinics, and our main site, the West Suffolk Hospital in Bury St Edmunds.&lt;/p&gt;\n&lt;p&gt;And we do everything we can to make our Trust a great place to work – we truly care about you and your wellbeing.&lt;/p&gt;\n&lt;p&gt;Feedback from our colleagues that already work here tells us we’re generally getting it right; using our results from the latest NHS Staff Survey (2018), the prestigious Health Service Journal scored us as having the best staff engagement score in the East of England, and the fourth best in the country. They’ve also branded us as “the best small hospital in the country” – and we get consistently good feedback from our patients too, who recommend us as a place to receive care.&lt;/p&gt;\n&lt;p&gt;Our patients are at the heart of everything we do. We’re dedicated to delivering the best quality and safest care to our local communities and need dedicated and skilled people to help us achieve this.&lt;/p&gt;\n&lt;p&gt;The Trust has invested significantly to increase the capacity of our aseptic production unit.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to develop your pharmacy career and make a real difference to the lives of those who use our services.&lt;/p&gt;\n&lt;p&gt;This post will support your career and skills development; you’ll work in the following areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Aseptic chemotherapy services&lt;/li&gt;\n&lt;li&gt;Dispensary&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;A flavour of your day to day&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The majority of the time will be spent with the rest of the production team to deliver the preparation of chemotherapy and other cytotoxic drugs for the Trusts cancer services.&lt;/li&gt;\n&lt;li&gt;Time will be spent supporting the running of the hospital pharmacy dispensary; checking stock and prescriptions, ordering medicines, labelling, dispensing to maintain your general competencies&lt;/li&gt;\n&lt;li&gt;Communicating with, informing and coaching patients about their healthcare needs.&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you can expect from us&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A supportive, friendly team&lt;/li&gt;\n&lt;li&gt;A rewarding role in a busy, fast-paced, team environment&lt;/li&gt;\n&lt;li&gt;Career progression – training and education related to CPD/revalidation, pre- and post-registration&lt;/li&gt;\n&lt;li&gt;The opportunity to join the NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;Access to a range of employee benefits including, staff discounts and salary sacrifice schemes, discounted staff restaurant&lt;/li&gt;\n&lt;li&gt;Quality of life and super location in Suffolk.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;What we ask of you&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You’re a newly registered or established pharmacy technician; we welcome applicants who have not worked in a hospital previously&lt;/li&gt;\n&lt;li&gt;You have a genuine passion for patient care&lt;/li&gt;\n&lt;li&gt;You have a desire to work as part of a friendly, helpful team&lt;/li&gt;\n&lt;li&gt;You’re open to working flexibly – with rota’d weekend or evening shift duties, including enhanced pay.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Welcome!&lt;br /&gt; &lt;/strong&gt;As a thank you for joining the West Suffolk Hospital, we are offering all new* band 4 and 5 pharmacy technicians a welcome payment of £500 on appointment** and a further £500 if you remain with the Trust after a year of employment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Accommodation &lt;br /&gt; &lt;/strong&gt;We have three new purpose-built accommodation blocks nestled in the woodland at the back of the West Suffolk Hospital. There are 160 quality furnished en-suite single occupancy bedrooms with modern communal living areas available to rent for all staff at competitive rates.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join us – what will you #BeKnown for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;For an informal chat and to find out more about the role please contact Linda Davies (production manager), Shaun Chaplin (deputy production manager) on 01284 713788.&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional information &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Welcome payment&lt;/strong&gt;&lt;br /&gt; *Previous West Suffolk Hospital employees must have a gap of over six months since their last employment with the Trust to be eligible for this payment.&lt;/p&gt;\n&lt;p&gt;**The welcome payment will be made to you on your second payday with the Trust.&lt;/p&gt;\n&lt;p&gt;Contractual terms will apply – employees leaving the Trust within the first or second year of employment will be required to repay a percentage of the welcome payment on a sliding scale.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tips for completing your application &lt;br /&gt; &lt;/strong&gt;To view the job description and person specification for this position, please click on the link to the right. Use the additional information section of your application to state how you meet the requirements of the person specification.&lt;/p&gt;\n&lt;p&gt;You can download top tips for completing your application in the ‘additional documentation’ section also to the right.&lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled ‘How will my application be processed?’ prior to submitting your application form.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date&lt;br /&gt; &lt;/strong&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Car parking&lt;br /&gt; &lt;/strong&gt;This post &lt;strong&gt;does &lt;/strong&gt;entitle you to apply to park on the West Suffolk Hospital site.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Correspondence via NHS Jobs email &lt;br /&gt; &lt;/strong&gt;All correspondence relating to this vacancy, including invitations to interview will be by email only, via NHS Jobs. Please ensure you check your emails on a regular basis.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form&lt;/strong&gt;, you authorise the Trust to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service &lt;br /&gt; &lt;/strong&gt;The successful candidate for this post will be required to apply for a Disclosure and Barring Service (DBS) Disclosure at &lt;strong&gt;enhanced&lt;/strong&gt; level.&lt;/p&gt;\n&lt;p&gt;For posts at band 3 and above, the cost of the DBS will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Pharmacy Technician Aseptic Services - Band 4 - Pharmacy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916167724", "validThrough": "2020-12-01T23:59:59+0000"}