{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15549", "minValue": "14658", "unitText": "YEAR", "value": "£8.72 ph rising to £9.25 ph after probation period"}}, "datePosted": "2020-08-20T14:01:51+0100", "description": "&lt;p&gt;As one of the Uk&#39;s oldest Charities, based in the heart of Devon, Dame Hannah Rogers Trust is dedicated to empowering and providing young adults with profound physical and learning disabilities with life-changing opportunities and advocating their needs.&lt;/p&gt;\n&lt;p&gt;We are planning for our future and looking for Support Workers to join our dedicated team to encourage and support our young adults enjoy their life to the max!&lt;/p&gt;\n&lt;p&gt;You will help our young adults to take part in a variety of social activities such as festivals, sailing, football matches, cinema, bowling and much more!!&lt;/p&gt;\n&lt;p&gt;You don’t necessarily need experience to join us, as we believe that if you have the right personal qualities, our training programme will equip you with the skills you need to become a successful support worker. You must be positive, caring and compassionate, have great communication skills, and a passion for helping people achieve their dreams and aspirations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BENEFITS PACKAGE:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full Induction training&lt;/li&gt;\n&lt;li&gt;32 days annual leave entitlement including bank holidays (pro rata for part time hours)&lt;/li&gt;\n&lt;li&gt;Progression opportunities&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;Free car parking&lt;/li&gt;\n&lt;li&gt;Subsidised staff lunches, made fresh onsite&lt;/li&gt;\n&lt;li&gt;Employee Recognition scheme&lt;/li&gt;\n&lt;li&gt;PLUS the opportunity to really make a difference&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please note that we will accept applications up to the closing date, however all suitable candidates will be submitted for shortlisting and possible interview as soon as received and the Trust reserves the right to appoint before the closing date.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Dame Hannah Rogers Trust is an equal opportunities employer. &lt;/em&gt;&lt;em&gt;We are committed to equal opportunities. We particularly welcome applications from disabled people and guarantee interviews to suitably qualified disabled applicants. &lt;/em&gt;&lt;em&gt;We are committed to safeguarding and promoting the welfare of the people we support and expect all staff to share this commitment. An enhanced DBS disclosure will be required for this post.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Social Enterprises", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130655"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ivybridge", "postalCode": "PL21 9HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3886", "longitude": "-3.93468"}}, "title": "Day Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916156506", "validThrough": "2020-11-30T23:59:59+0000"}