{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "(£) 31,365 - 37,890 Per Annum Pro Rata"}}, "datePosted": "2020-09-18T10:04:02+0100", "description": "&lt;p&gt;This is an exciting opportunity to join the mental health social care team-based working across Torbay as a Social Worker on a 12 months fixed term contract working 26 hours per week.  Flexibility as to the choice of working days will be offered!&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you passionate about social work and mental health?&lt;/li&gt;\n&lt;li&gt;Would you like to help shaping how we deliver services to those who need them?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post is a fixed term position within a multi-disciplinary mental health community team which provides high quality mental health services across the bay to a range of adults from 18 years and onwards.&lt;/p&gt;\n&lt;p&gt;The post holder will be part of the newly developed mental health social care team which, whilst remaining integrated with the wider team, has a clear focus on social care and social work assessment, strength-based approach and outcome focused interventions that will support service users’ recovery.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to carry a complex caseload and deliver a range of social work interventions, including high quality Care Act assessments and provision of services, safeguarding enquiries, Mental Capacity Assessments/Best Interest determination, proactive case management and signposting to appropriate partner agencies.&lt;/p&gt;\n&lt;p&gt;As Band 6 social worker the candidate will need to be registered with Social Work England. Applications from ASYE will also be considered.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torbay", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Social Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916190477", "validThrough": "2020-11-15T23:59:59+0000"}