{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29270", "minValue": "29270", "unitText": "YEAR", "value": "£29,270"}}, "datePosted": "2020-08-27T17:21:31+0100", "description": "&lt;p&gt;Mount Eveswell  is a rehabilitation unit for brain injury patients. We also look after complex nursing needs patients as well. . The unit is situated in Newport, South wales. At Mount Eveswell, we pride ourselves on offering flexible working arrangements, and we always have a second nurse on duty.&lt;/p&gt;\n&lt;p&gt;      We are looking for a hard-working  staff who is willing to learn and happy to work with a MDT team.&lt;/p&gt;\n&lt;p&gt;•           The candidate must be a  Qualified  Registered Nurse with NMC pin.&lt;/p&gt;\n&lt;p&gt;•           Experience is not essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Principle responsibilities,&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•To provide high standard of nursing care to service users based on the assessment of care needs and in the consultation with the service users, their relatives and care team.&lt;/p&gt;\n&lt;p&gt;•To continuously evaluate the quality of care given, and regularly re assess the needs of service users.&lt;/p&gt;\n&lt;p&gt;•To administer and order medicines.&lt;/p&gt;\n&lt;p&gt;•Liaise with the GP and other health professional involved in the service users care.&lt;/p&gt;\n&lt;p&gt;•Care planning and implementation and reviewing of care plans.&lt;/p&gt;\n&lt;p&gt;•To continuously review their own nursing practise to develop new skills and knowledge throughout continuous professional development training that contributes to the enhancement of patient care skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Benefits&lt;/p&gt;\n&lt;p&gt;•           Opportunities for Career development&lt;/p&gt;\n&lt;p&gt;•           33 days Annual leave&lt;/p&gt;\n&lt;p&gt;•           One extra  annual leave on birthdays.&lt;/p&gt;\n&lt;p&gt;•           NMC payment in full&lt;/p&gt;\n&lt;p&gt;•           £250 contribution towards CPD&lt;/p&gt;\n&lt;p&gt;•           Range of salary sacrifice benefits including childcare vouchers, pension, car leases, gym membership, technology purchase schemes and more&lt;/p&gt;\n&lt;p&gt;•           Online benefits portal with a range of offers and cashback rewards&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Career Pathways&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Priory Group employee, you’ll be able to chart your long-term career along defined pathways (from Support Worker to CEO), each path providing you a fulfilling work environment and support from a world class organisation to achieve your professional goals. We want to invest in you to achieve the next step in your career, so you can continue to make a difference in people’s lives.&lt;/p&gt;\n&lt;p&gt;Disclosure&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;\n&lt;strong&gt;About us&lt;/strong&gt;\n&lt;p&gt;As one of the UK’s leading providers of behavioural care and specialist support services to adults and young people, Priory Group promise a challenging and fulfilling career with the support of a world class organisation willing to invest in your development. &lt;/p&gt;\n&lt;p&gt;Across our network of hospitals, residential care homes, education facilities and supported living services, we are making a real and lasting difference to the lives of the people we support.&lt;/p&gt;\n&lt;strong&gt;Disclosure&lt;/strong&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer. Priory Group will cover the cost of a DBS check.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NEWPORT", "postalCode": "NP19 8GS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5903", "longitude": "-2.97131"}}, "title": "RGN - NIGHT NURSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916165114", "validThrough": "2020-11-27T23:59:59+0000"}