{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 to £30,112 pa"}}, "datePosted": "2020-07-07T14:37:27+0100", "description": "Are you a looking to provide patients with a high standard of care and to develop your post-operative nursing skills within vascular surgery?\n\n\nIf so, Ward 4 at Birmingham Heartlands Hospital are looking for enthusiastic, motivated nurses to join our dynamic team. Ward 4 consists of 33 beds including a  4 bed Vascular Enhanced Care Unit (VECU) that provides a higher level of nursing care in the post-operative period. \nThe vascular department at Heartlands Hospital offers a nationally recognized service to patients from all over Birmingham and beyond of which the nursing team is a key part of. \n\nIt is a challenging, exciting and supportive environment which will facilitate the ongoing advancement of your specialist post-operative surgical care skills. We will enable you to develop and enhance your clinical skills and confidence in a supportive and friendly environment. If you are compassionate, resilient and would like to develop your knowledge of this complex yet rewarding specialty, we would love to hear from you. \n\nNew employees undergo a Trust clinical induction and this is followed by a period of local induction and a supernumerary period when you start on the ward. We have a commitment to professional education and training and can offer a wide range of training and development opportunities from our Clinical Education Team and our large Education Directorate; this includes expanded practice skills / personal and professional development programmes and specialty based training and education. \n\nPost holders work a range of shift patterns including long days / nights / weekends. We also welcome applications from nurses seeking flexible working opportunities and family friendly working hours.", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916104501", "validThrough": "2020-12-31T23:59:59+0000"}