{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48000", "minValue": "35000", "unitText": "YEAR", "value": "£35,000 - £48,000 DOE"}}, "datePosted": "2020-09-07T17:52:54+0100", "description": "&lt;p&gt;&lt;strong&gt;Job title:&lt;/strong&gt; Extended Scope Practitioner (MSK)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Greater Manchester&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt; £35,000 - £48,000 depending on experience&lt;/p&gt;\n&lt;p&gt;InHealth is one of the leading providers of diagnostic and healthcare services to the NHS and Private sectors. Our primary goal is to make healthcare better by providing rapid and accurate assessment of every patient’s condition, enabling the right treatment to be delivered swiftly and effectively by specialist providers. &lt;/p&gt;\n&lt;p&gt;We are looking for a &lt;strong&gt;Senior Extended Scope Practitioner&lt;/strong&gt; with &lt;strong&gt;clinical MSK experience&lt;/strong&gt; to join our NWCATS team in &lt;strong&gt;Greater Manchester!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our North West clinical assessment and treatment services are open &lt;strong&gt;7 days a week, Monday to Sunday,&lt;/strong&gt; and this is a &lt;strong&gt;full-time role working 37.5 hours per week&lt;/strong&gt; on a rota/shift pattern basis.  &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Introduction:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Senior ESP’s from a key part of the MSK leadership team under guidance and support of our four Consultant Clinical Leads in Lower Limb, Upper Limb, Spinal and Foot and Ankle. Our Clinical Leads are all Consultants currently working in NHS Trusts and are committed to training and supporting our service and individual colleagues to develop professionally.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for someone with experience of working as an Extended Scope Practitioner/Advanced Practitioner in MSK who is looking to develop further their leadership, management and organisational skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What is the overall purpose of the job?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To work clinically at the level of a senior expert practitioner in primary care and to undertake advanced neuromuscular assessments of patients with complex orthopaedic conditions. To request specific diagnostic tests then interpret results and provide diagnosis/prognosis to patients and GP referrers along with treatment options. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are the key responsibilities of the role?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Delivering neuromusculoskeletal assessments of patients presenting with acute, chronic and/or highly complex physical and psychosocial conditions&lt;/li&gt;\n&lt;li&gt;Using highly advanced clinical reasoning skills to provide accurate diagnosis and prognosis of patient’s conditions and advise appropriate treatment options moving forwards&lt;/li&gt;\n&lt;li&gt;Determining necessity of investigations e.g. X-ray, Ultrasound or MRI then order and interpret results for patients&lt;/li&gt;\n&lt;li&gt;Undertaking an extended scope of practice for the care of patients referred for MSK assessment, clinical diagnosis and management&lt;/li&gt;\n&lt;li&gt;Working closely with the relevant Clinical Consultants to act as a key leader within the service, responsible for communication between colleagues within the clinical setting&lt;/li&gt;\n&lt;li&gt;Assessing a wide range of orthopaedic conditions based on advanced theoretical knowledge of anatomy, physiology and pathology&lt;/li&gt;\n&lt;li&gt;Providing written reports, guidance and advice to referring GP’s, orthopaedic consultants, physiotherapists, podiatry and orthotic departments regarding diagnosis and patient management&lt;/li&gt;\n&lt;li&gt;Triaging referrals, considering the nature of the information provided, and taking responsibility for decision making on clinical prioritisation&lt;/li&gt;\n&lt;li&gt;Ensuring that all patient interventions performed fall within the current clinical governance framework of the service and national bodies such as NICE&lt;/li&gt;\n&lt;li&gt;Assisting in the delivery of the company’s clinical governance and risk management arrangements and apply these to work situations&lt;/li&gt;\n&lt;li&gt;Ensuring that up to date written and electronic data records are maintained in accordance with professional and company standards&lt;/li&gt;\n&lt;li&gt;Remaining aware of the NWCATS key performance indicators and ensuring that treatment processes and investigations are organised in a timely fashion to avoid breaches&lt;/li&gt;\n&lt;li&gt;Communicating sensitive information to patients and carers regarding the nature, prognosis and rehabilitation potential of their condition, managing potentially stressful, upsetting or emotional situations in an empathetic manner&lt;/li&gt;\n&lt;li&gt;Upholding the protection of patient and staff confidentiality&lt;/li&gt;\n&lt;li&gt;Coordinating and leading monthly Education and Audit teaching sessions for ESP and Physiotherapy colleagues with support of Clinical Leads and external speakers as required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What skills, qualifications and experience will you need to apply?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Previous experience as Extended Scope Practitioner/Advanced Practitioner working in MSK services&lt;/li&gt;\n&lt;li&gt;A degree in Physiotherapy and a member of a relevant professional membership body (HCPC)&lt;/li&gt;\n&lt;li&gt;Specialist knowledge in the management of MSK conditions&lt;/li&gt;\n&lt;li&gt;Experience of providing steroid injections and reviewing diagnostic imaging&lt;/li&gt;\n&lt;li&gt;Proven ability managing a complex case load&lt;/li&gt;\n&lt;li&gt;Portfolio which demonstrates evidence of CPD and reflective practice&lt;/li&gt;\n&lt;li&gt;Awareness of appropriate NICE guidance and evidence-based practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What can InHealth offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We can offer you the opportunity to do something you love, with the right support to access the roles you want, through clear career paths and best-in-class training and development.  This is an environment where you have accountability for your career and can make a real contribution to the organization and to our patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;InHealth is an equal opportunities employer and welcomes applications from all areas of the community.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "InHealth Pain Management Solutions Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Greater Manchester", "postalCode": "M18 7BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.18453"}}, "title": "Extended Scope Practitioner (MSK)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916175561", "validThrough": "2020-11-30T23:59:59+0000"}