{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-07-07T12:15:20+0100", "description": "&lt;p&gt;&lt;span&gt;The post-holder will be based at Gosport War Memorial Hospital, which is run by Southern Health NHS Foundation Trust. The post holder will be appointed by Southern Health Foundation Trust. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be responsible for providing clinical leadership and consultant input into the Older Persons Mental Health Inpatient Psychiatry team covering the Functional (Rose ward) and occasionally providing input to the Organic (Poppy ward). The team cover people aged 65 and over as well as those of any age with dementia. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Gosport War Memorial Hospital is a large community hospital serving a local community covering patients in South East Hampshire. There are two physical rehabilitation step down wards on the premises as well as two mental health wards, Rose (Functional) and Poppy ( Organic) Ward. It is also home to a GP surgery with facilities for X-Ray and phlebotomy on site. Clinicians from Queen Alexandra Hospital have outpatient clinics on site, including a leg clinic, dermatology and diabetic eye clinics on site. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This post is based mainly on Rose ward, a 16 bedded unit for patients with Schizophrenia, Depression, Anxiety and Bipolar affective disorder. The Organic ward, Poppy is a 12 bedded unit for patients at the severe end of the dementia spectrum.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Please note that GMC registration (with a licence to practice) and right to work in the UK are essential for this role. Successful applicants will already have GMC registration or will be able to demonstrate they are eligible. Applicants requiring Tier 2 sponsorship should ensure they meet the Home Office application criteria prior to submitting an application.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;span&gt;&lt;span&gt;For further information about the post please email shft.medicalworkforce@nhs.net&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gosport", "postalCode": "PO12 3PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7931", "longitude": "-1.14807"}}, "title": "Consultant in Old Age Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916104081", "validThrough": "2020-11-20T23:59:59+0000"}