{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683  per annum"}}, "datePosted": "2020-09-24T11:45:54+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Trauma &amp; Orthopaedics with a Sub-Specialty interest in Hip surgery, revision hip and young adult hip surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of &lt;strong&gt;Consultant in Trauma &amp; Orthopaedics&lt;/strong&gt;, with a sub specialty interest in hip surgery to suit the needs of the service, &lt;strong&gt;at the Royal Cornwall Hospital in Truro.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is seeking to appoint a Consultant in Trauma &amp; Orthopaedics with a specialist interest in Trauma and knee surgery to join a team of 20 Consultants/Associate Specialists providing a full range of services within Trauma &amp; Orthopaedics.&lt;/p&gt;\n&lt;p&gt;The Royal Cornwall Hospitals Trust is based across three sites, with the Royal Cornwall Hospital in Truro being the main DGH, with two further hospitals, St Michael’s Hospital and West Cornwall Hospital, based in the west of the county. The trauma service is delivered at the Royal Cornwall Hospital and orthopaedic elective surgery is undertaken at both the Royal Cornwall Hospital and St Michael’s Hospital. We aim to move all elective surgery to St Michael’s hospital in the next 6-12 months.&lt;/p&gt;\n&lt;p&gt;Trauma &amp; Orthopaedics undertakes approximately 5,500 elective operations per year, treats circa 2,700 trauma patients, and sees approximately 13,700 new out-patients and 32,000 follow-up patients. Activity peaks during the summer months as a result of the significant influx of tourists, with a regional reputation for a varied and interesting elective and trauma caseload.&lt;/p&gt;\n&lt;p&gt;The Covid pandemic has shown how important quality of life and work-life balance are. Cornwall is a beautiful county which offers an outstanding quality of life and providing many opportunities for outdoor activities, with its sailing waters, surfing beaches and rugged coastal pathways for walking, and cycling. There is a thriving art and theatre scene, as well as an interesting variety of eating places, including celebrity-owned restaurants within Cornwall. The major route in and out of the county is the recently improved A30 which connects with the M5 motorway at Exeter. There is an excellent rail service, with daily passenger and sleeper services, and an airport at Newquay with daily connections to many cities throughout the UK and abroad.&lt;/p&gt;\n&lt;p&gt;If you are thinking of joining us and have a partner or family who would relocate with you please contact us as we have a variety of employment opportunities within the hospital and would be happy to discuss this with you. Cornwall is fantastic place to raise a family with excellent schools often offering smaller class with high Ofsted reports.&lt;/p&gt;\n&lt;p&gt;Applicants are required to be on the GMC Specialist Register or within 6 months of their expected date of receipt of a CCT at the time of interview. Applications are welcomed from those unable to work full time for personal reasons or those wishing to job-share.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits please contact: Mike ButlerJob titleClinical Director - Email addressmichael.butler3@nhs.net - Telephone number07872450005&lt;/p&gt;\n&lt;p&gt;The Royal Cornwall Hospital is an Equal Opportunities Employer&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Orthopaedic Hip Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916198429", "validThrough": "2020-11-09T23:59:59+0000"}