{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-07-08T14:36:23+0100", "description": "&lt;p&gt;The COVID-19 pandemic is placing exceptional pressures on our NHS. Our Medical colleagues need help and support so they can continue to dedicate their time to delivering care to our patients, families and carers who need them the most.&lt;/p&gt;\n&lt;p&gt;To support the delivery of essential secondary and community-based care services during these unprecedented times, Community Outpatients are looking for Sonographers, Dermatologists, ENT Consultants &amp; Cardiac Physiologists to join our dedicated team to work in both remote and face to face capacity.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;MOBILE CLINICS:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We will be providing mobile services from locations across the UK including London, Manchester and Cambridge. This includes Ultrasound, Dermatology, ENT and Cardiology. The health and safety of our workforce and patients whilst providing these services will be paramount. Provisions will be in place including pre-screening of patients, PPE and strict social distancing measures whenever possible.&lt;/p&gt;\n&lt;p&gt;We can accommodate flexible working including full and part time roles or ad hoc shifts as required.&lt;/p&gt;\n&lt;p&gt;Applicants MUST have the right to work in the United Kingdom and face to face clinicians must not have any underlying health conditions listed on the government website.&lt;/p&gt;\n&lt;p&gt;If you wish to apply for these roles, please apply via NHS jobs, for any further information, please contact recruitment@omneshealthcare.co.uk&lt;/p&gt;\n&lt;p&gt;Thank you for your interest in helping the NHS in response to the Covid-19 outbreak.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We have fully COVID compliant infection control policies in place.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/134554.png", "name": "Omnes Healthcare Limited", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE1 3ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4999", "longitude": "-.084881"}}, "title": "Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916106015", "validThrough": "2021-01-14T23:59:59+0000"}