{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82906", "unitText": "YEAR", "value": "£82,906 - £110,683 + £2,162 LW PER ANNUM + 1% ON C"}}, "datePosted": "2020-09-15T09:15:46+0100", "description": "&lt;h1&gt;&lt;strong&gt;CONSULTANT IN PSYCHIATRY – INTENSIVE CASE MANAGEMENT FOR PSYCHOSIS COMMUNITY MENTAL HEALTH TEAM&lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;FERRYVIEW HEALTH CENTRE, 25 JOHN WILSON STREET, WOOLWICH, LONDON, SE18 6PZ&lt;/h2&gt;\n&lt;h2&gt;£82,906 - £110,683 + £2,162 LW PER ANNUM + 1% ON CALLS Permanent - Full Time, 40 hours/ 10 PAs per week&lt;/h2&gt;\n&lt;p&gt;Oxleas NHS Foundation Trust was formed in April 1995 and is a provider of Mental Health Services for Greenwich, Bexley and Bromley. It is a specialist provider of Forensic and Challenging Behaviour services for Bexley, Greenwich, Lewisham, North Southwark, Bromley and Kent Prisons. Since 2010, Oxleas also provides a range of physical health services to adults and children in the community in the boroughs of Bexley and Greenwich. These range from health visitors and community midwives working with the very young, to district nurses and therapists meeting the physical health needs of older people.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Greenwich Intensive Case Management for Psychosis Community Mental Health Team, Ferryview Health Centre, 25 John Wilson Street, Woolwich, London, SE18 6PZ&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The ICMP Team provides a flexible service to all adults within the psychosis clusters who currently require secondary community mental health care in the locality. The post holder will be responsible for service users who fulfil the agreed inclusion criteria who live in the London Borough of Greenwich. The post holder will be Consultant within the above service working alongside one other consultant (0.7 WTE).&lt;/p&gt;\n&lt;p&gt;Oxleas is committed to safeguarding and promoting the welfare of children and vulnerable adults and expects all staff and volunteers to share this commitment. We recognise our responsibility to ensure that safe working systems are in place for staff working with children, adults and families in their care. The Trust is also committed to equal opportunities promoting diversity, developing supporting policies and operates a variety of flexible working arrangements.&lt;/p&gt;\n&lt;p&gt;Please note all communication will be via e-mail so please can you ensure that you regularly check your e-mails. There is a possibility that if you have set filters on your incoming messages that this message could be delivered to your junk mail. It would be helpful if you could enable your settings so that messages sent are directly received to your inbox. The Trust will not be responsible for any correspondence which has not been received/read in light of the above.&lt;/p&gt;\n&lt;p&gt;If you do not hear anything within 4 weeks of the closing date, please assume you have not been shortlisted.&lt;/p&gt;\n&lt;p&gt;For more information please contact Dr Ajay Bhatnagar, Clinical Director for Greenwich. Email: &lt;span&gt;&lt;span&gt;ajay.bhatnagar1@nhs.net&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120829.png", "name": "Oxleas NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120829"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ferryview Health Centre, Woolwich, London", "postalCode": "SE18 6PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4923", "longitude": ".06155"}}, "title": "Consultant in Psychiatry – Intensive Case Management for Psychosis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916184518", "validThrough": "2020-11-16T23:59:59+0000"}