{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23702", "minValue": "23702", "unitText": "YEAR", "value": "starting at £14.10 p/h plus enhancements"}}, "datePosted": "2020-09-01T10:23:11+0100", "description": "&lt;p&gt;Staff Nurse&lt;br /&gt;starting at £14.10 p/h plus enhancements for nights and weekends&lt;/p&gt;\n&lt;p&gt;Full /Part Time and Bank shifts available&lt;br /&gt;Full time days 36 hours&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking to appoint a dedicated and compassionate Staff Nurse to take responsibility for the assessment, planning, implementation and evaluation of high standards of personalised care for our NEW Neurological Centre Lancashire, Fulwood.&lt;br /&gt;&lt;br /&gt;This is an amazing time to join Sue Ryder as we approach the opening of our state of the art, purpose built Neurological Care and Rehabilitation Centre in Preston.&lt;br /&gt;As Staff Nurse you will begin your employment with us at Bamber Bridge and come with us on our exciting journey to the new centre in Eastway, Preston early this year.&lt;br /&gt;&lt;br /&gt;The Registered Nurse role requirements:&lt;br /&gt;&lt;br /&gt;• Registered Nurse, preferably with experience in neurological or specialist palliative care&lt;br /&gt;• Relevant post-registration training or willing and able to gain within 1 year&lt;br /&gt;• An ability to demonstrate a commitment to continued professional development&lt;br /&gt;• Awareness of current legislation within independent care sector&lt;br /&gt;• Completion of NMC recognised accredited mentor training and able to mentor students and less experienced staff&lt;br /&gt;• Commitment to service user involvement&lt;br /&gt;• An ability to implement and monitor clinical standards&lt;br /&gt;• Demonstrable interest in the client group&lt;br /&gt;• Proven ability to build and lead an effective team&lt;br /&gt;• An ability to actively support and participate in change&lt;br /&gt;• An ability to work in a complex and stressful environment demonstrating effective and appropriate coping strategies&lt;br /&gt;• A prompt response to problems, including identifying and implementing solutions&lt;br /&gt;• An ability to use own initiative in an unsupervised setting&lt;br /&gt;• Effective verbal and written communication&lt;br /&gt;• Willing and able to have a flexible approach to working patterns&lt;br /&gt;&lt;br /&gt;Sue Ryder supports people through the most difficult times of their lives. Whether that’s a terminal illness, the loss of a loved one or a neurological condition – we’re there when it matters. Our doctors, nurses and carers give people the compassion and expert care they need to help them live the best life they possibly can.&lt;br /&gt;&lt;br /&gt;To make the next step in your exciting career move and become a valued member of our team, apply now.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston", "postalCode": "PR5 6AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.71", "longitude": "-2.66211"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916167212", "validThrough": "2020-11-23T23:59:59+0000"}