{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa pro-rata"}}, "datePosted": "2020-08-03T15:30:22+0100", "description": "&lt;p&gt;At University Hospitals Birmingham we support flexible working and welcome applications from nurses seeking flexible working opportunities and family friendly working hours. This is an exciting time to join our Health care Team at University Hospital Birmingham Foundation Trust. The recent acute Trust merger has led to further developments within our specialty becoming an extremely exciting place to work. Our vision is patients should be as happy and healthy as possible, living self-sufficient, independent lives, able to have choice and control over what they do and what happens for them. We expect our workforce, at all grades and professions to be highly skilled and motivated, delivering individualised care for patients at the time they need it. We have fantastic opportunities for band 5 Staff Nurses to work within our renal services team at the Heartlands site. We provide holistic care to acutely unwell patients admitted with acute, complex and chronic needs relating to renal failure. The regional renal unit at UHB is the largest provider of kidney care in the West Midlands and has the largest renal transplant programme in the UK. The unit treats patients with Acute Kidney Injury, Chronic Kidney disease, End Stage Renal Failure, Haemodialysis, Peritoneal dialysis, Transplantation and End of Life Care. The Renal Unit is recognised for its innovation in clinical care and service delivery. We are looking for experienced nurses with excellent communication skills and an interest in the health care of patients with renal problems. We are looking for dynamic and motivated nurses who are able to excel in a busy environment. There will be opportunities for you to rotate throughout our renal care services department in order for you to gain maximum career opportunities. The trust has an excellent in house training facility to assist all staff to reach their career goals. Clinical Educators are on hand to assist with any queries and assistance in building up practice with skills required. This speciality takes a proactive part in helping ensure staff are able to attend training to help them develop the skills they need to ensure they provide the highest standard of care to their patients. We welcome all applicants who are willing to learn and be part of our fantastic team. All successful applicants will have a structured and supported induction period and will be able to access on-going training and support from within our clinical training and education team. If you want to work within a positive and supportive team and have the opportunity to develop professionally then please don’t hesitate to contact us for more information or to arrange an informal visit. The post holder will be required to work flexibly across days, nights and weekends. For more information please contact: - Chona James Senior Sister on 0121 424 0203 Shortlisted candidates will be contacted within two weeks of receipt of their application to arrange an interview. &quot;At University Hospitals Birmingham we support flexible working and welcome applications from nurses seeking flexible working opportunities and family friendly working hours&quot;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 5 Staff Nurse - Renal", "url": "https://www.jobs.nhs.uk/xi/vacancy/916135047", "validThrough": "2020-12-31T23:59:59+0000"}