{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa pro-rata"}}, "datePosted": "2020-07-27T15:17:19+0100", "description": "Respiratory Medicine in Heartlands Hospital is looking for qualified or soon to be qualified nurses\n\n\nWe are extremely passionate about getting it right for patients and their families and in order to achieve this we are looking to appoint enthusiastic, motivated and compassionate Band 5 Registered Nurses to Ward 24 and Ward 26 BHH. As a member of our team, you will work as an integral member of the multidisciplinary teams and be continually supported in your professional development.\n\n\nWard 24 and 26 are busy and dynamic wards, specialising in many different complex respiratory conditions including COPD, CF, asthma, bronchiectasis and ILD. Both wards provide individualised care for acute respiratory patients and we have inpatient areas for both the West Midlands Regional Cystic Fibrosis Unit and the Birmingham Regional Severe Asthma service.\n\n\nWe also have an inpatient area providing level 2 care for Non-Invasive Ventilation and patients with Tracheostomies.\n\n\nFor these posts you should have a keen interest in Respiratory Nursing and be able to work as part of a well-established and dynamic nursing team.  You should be committed and passionate about providing a high standard of nursing care with a keen interest in achieving new skills. \n\n\nIn return as a Band 5 Staff Nurse, you will have the opportunity to develop both personally and professionally and you will be provided with a structured band 5 competency programme as well as a variety of training opportunities, with a dedicated Clinical educator for the area.  \n\n\nThese wards provide care over a 7 day week period and the expectation will be that successful candidates will work on a rotational basis to include long days, weekends and night duties.\n\n\n\nFor further information please contact \n\nSenior Sister Anne Watson – Ward 24 0121 424 1773\nSenior Sister Kristine Canal – clinical educator 0121 424 1773\nSenior Sister Laura Cox - Ward 26 0121 424 0226\n\nShortlisted candidates will be contacted within two weeks of receipt of their application to arrange an interview.\n\nAt University Hospitals Birmingham we support flexible working and welcome applications from nurses seeking flexible working opportunities and family friendly working hours.", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 5 Staff Nurse - Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916127102", "validThrough": "2020-12-31T23:59:59+0000"}