{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "52000", "minValue": "40000", "unitText": "YEAR", "value": "£40,000 - £52,000 DOE"}}, "datePosted": "2020-08-04T16:50:11+0100", "description": "&lt;p&gt;At InHealth we see more than 3 million patients each year and diagnostic imaging is one of the busiest services we provide. Our purpose-built diagnostic centres offer increased imaging capacity for NHS trusts and convenient, fast access to services for patients.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a &lt;strong&gt;Superintendent Radiographer &lt;/strong&gt;to join our MRI team in London&lt;strong&gt;. &lt;/strong&gt;The successful applicant will be responsible for supervising our Radiographers at our diagnostic centres in &lt;strong&gt;Ealing, Golders Green, Enfield and in future, Orpington&lt;/strong&gt;.This is a full-time role, working 36 hours per week on a shift pattern rota basis, Monday to Sunday, and will be a mixture of clinical work and management.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will you be responsible for? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Superintendent Radiographer with InHealth you will be responsible for providing first point of call management and clinical leadership across the 4 sites, operating in accordance with local guidelines and company policies and delivering services that are aligned to contractual and governance requirements. In addition to your supervisory duties, you will work clinically as a Radiographer and complete MRI procedures, coaching other members of staff where necessary. You will also maintain and continually develop an efficient imaging service, optimising patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are some of the other things you will do? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supervise a team of Radiographers undertaking modality specific imaging procedures&lt;/li&gt;\n&lt;li&gt;Undertake MRI scans in line with existing modality specific clinical guidelines and protocols (MHRA Guidance 2007, IR(ME)R 2000, Code of Clinical Practice)&lt;/li&gt;\n&lt;li&gt;Conduct competency assessments at regular intervals, ensuring any development needs are identified and followed up&lt;/li&gt;\n&lt;li&gt;Oversee the recruitment, appointment and induction of new clinical staff&lt;/li&gt;\n&lt;li&gt;Arrange rotas for clinical and admin staff where required&lt;/li&gt;\n&lt;li&gt;Ensure good communication is maintained with the team to deliver a smooth-running service&lt;/li&gt;\n&lt;li&gt;Deal with day to day staff queries, liaising with appropriate support functions where required to resolve the queries within a reasonable timeframe&lt;/li&gt;\n&lt;li&gt;Take ownership of governance activities i.e. audits, personal development, and team meetings with the support of your colleagues&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You should apply if you: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have the ability to supervise and lead a team, instilling confidence in your co-workers&lt;/li&gt;\n&lt;li&gt;Are calm in challenging situations and works well under pressure&lt;/li&gt;\n&lt;li&gt;Have experience of undertaking MRI procedures&lt;/li&gt;\n&lt;li&gt;Have a BSc in diagnostic radiography or equivalent&lt;/li&gt;\n&lt;li&gt;Hold a valid professional membership (HCPC registration)&lt;/li&gt;\n&lt;li&gt;Have a professional and cooperative attitude towards patients, customers and colleagues&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What can InHealth offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a highly competitive salary and a generous flexible benefits package, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days holiday plus bank holidays&lt;/li&gt;\n&lt;li&gt;Private medical insurance with Bupa&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;Gym membership discount&lt;/li&gt;\n&lt;li&gt;Plus many more flexible benefits!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;InHealth is an equal opportunities employer and welcomes applications from all areas of the community.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "InHealth Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London (see advert for details)", "postalCode": "NW11 7HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5781", "longitude": "-.197853"}}, "title": "Superintendent Radiographer (MRI)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916136981", "validThrough": "2020-11-30T23:59:59+0000"}