{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Negotiable salary and excellent benefits"}}, "datePosted": "2020-09-15T17:53:21+0100", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting and challenging opportunity for a Safeguarding Children Lead to join the Clinical team, located from one of HUC&#39;s offices in the South East.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;HUC are committed to promoting the welfare of adults, children and young people and to protect them from the risks of harm and abuse. We are seeking a highly motivated and enthusiastic registered clinician with safeguarding children and paediatric experience.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Part Time - 22.5 hours per week, over 3 days&lt;/li&gt;\n&lt;li&gt;Located from one of HUC&#39;s offices in Welwyn Garden City, Bedford or Peterborough&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are we?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;HUC provides accessible and high quality Integrated Urgent Care services to nearly 3 million patients across a range of counties, including Hertfordshire, Cambridgeshire, Peterborough, Bedfordshire and West Essex. When patients require healthcare advice or need to speak with a healthcare professional, patients can phone the NHS 111 service provided by HUC to access medical advice, assessment and treatment. We also provide a range of other healthcare services to support patients and GPs, including GP surgery services and urgent care centres.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Safeguarding Children Lead is responsible for providing organisational safeguarding children leadership, support and direction to the Medical Director and the Clinical team, whilst ensuring that services are delivered safely and effectively, are of high quality and meet all regulatory and professional standards.&lt;/p&gt;\n&lt;p&gt;In times of absence of the Adult Safeguarding Lead, the post holder will support and cross cover, undertaking clinical duties on an ad hoc requirement to support the ongoing business needs of HUC.&lt;/p&gt;\n&lt;p&gt;As part of the senior clinical team, you will be part of the clinical on call rota and provide clinical advice and support to all areas including NHS111 and Out of Hours, as and when this is required.&lt;/p&gt;\n&lt;p&gt;Flexibility is required totravel across all our locations, to represent the organisation at a variety of strategic Safeguarding meetings.&lt;/p&gt;\n&lt;p&gt;We are looking for a registered clinician with safeguarding, paediatric experience and proven management skills as well as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Thorough understanding of legislation and statutory guidance in relation to safeguarding children&lt;/li&gt;\n&lt;li&gt;Current Professional registration&lt;/li&gt;\n&lt;li&gt;Report and policy writing skills&lt;/li&gt;\n&lt;li&gt;The ability to make decisions autonomously and to think strategically&lt;/li&gt;\n&lt;li&gt;Excellent team and communication skills&lt;/li&gt;\n&lt;li&gt;Training delivery experience and approved/recognised teaching course&lt;/li&gt;\n&lt;li&gt;A valid driving licence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We can offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Generous NHS pension&lt;/li&gt;\n&lt;li&gt;NHS discounts through Blue Light Card&lt;/li&gt;\n&lt;li&gt;Access to the ‘Perkbox’ staff benefit scheme&lt;/li&gt;\n&lt;li&gt;Opportunity to make a difference&lt;/li&gt;\n&lt;li&gt;Senior and peer clinical support&lt;/li&gt;\n&lt;li&gt;Personal development and training&lt;/li&gt;\n&lt;li&gt;Educational events&lt;/li&gt;\n&lt;li&gt;Performance feedback to support appraisal and revalidation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As HUC is an organisation commissioned by the NHS, all roles are listed on the Rehabilitation of Offenders Act 1974 (Exceptions) Order 1975 (SI 1975/1023), which means they are eligible for a standard or enhanced check as appropriate from the Disclosure and Barring Service.&lt;/p&gt;\n&lt;p&gt;We are fully committed to Equality of Opportunity and welcome applications from all sections of the community.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Herts Urgent Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130117"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South East England", "postalCode": "AL7 4HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7826", "longitude": "-.190844"}}, "title": "Safeguarding Children Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916186266", "validThrough": "2020-11-08T23:59:59+0000"}