{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890-£44,503 per annum / pro rata"}}, "datePosted": "2020-09-10T15:11:02+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Part time / full time hours&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen within the Ultrasound departments at Worcester Acute Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;Your base site would be Worcester Royal Hospital however you would be expected to work at any site within the Trust as the service required. Rotation to Alexandra Hospital in Redditch could be considered as part of this position.&lt;/p&gt;\n&lt;p&gt;Staff may also rotate to satellite, single roomed departments at Evesham, Bromsgrove and Tenbury Community Hospitals.&lt;/p&gt;\n&lt;p&gt;All WAHNHST hospital utilise state of the art Philips EPIQ equipment. Toshiba equipment is in use for some obstetric and community units.&lt;/p&gt;\n&lt;p&gt;All departments cover a wide range of ultrasound examinations including Early Pregnancy (via EPAU), Obstetrics (2nd and 3rd Trimester) general abdominal, gynaecological, small parts, DVT scanning and including possible MSK and carotid work.&lt;/p&gt;\n&lt;p&gt;Specialist scanning such as centralised sonographer Baby hip screening, HCC screening and a sonographer lead One stop neck FNA clinic are our latest developments.&lt;/p&gt;\n&lt;p&gt;The Worcester site supports most of the acute work within the Trust.&lt;/p&gt;\n&lt;p&gt;Sonographers report independently but robust Radiologist support is available.&lt;/p&gt;\n&lt;p&gt;As a forward thinking department we participate in training of Pg Dip Ultrasound students, undergraduate sonographer degree students, scanning midwives and also medical staff requiring clinical ultrasound experience.&lt;/p&gt;\n&lt;p&gt;CPD is encouraged and supported with regular cross county Ultrasound audit meetings and designated e-learning/mandatory training time. A proposal for protected CPD time is currently being considered.&lt;/p&gt;\n&lt;p&gt;We offer a flexible working week with negotiable hours to suit both you and the department. Participation in our weekend ultrasound rota is expected but this is self-rostered with flexible TOIL.&lt;/p&gt;\n&lt;p&gt;Ultrasound at Worcestershire Royal Hospital is sonographer led and as a result we are forward looking, promoting career development, with an appetite for continuing change and improvement.&lt;/p&gt;\n&lt;p&gt;Worcester is a beautiful University and Cathedral city with many local attractions and easy access to central transport networks to enable easy commuting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal visits are welcome. We are a friendly, supportive team. You are encouraged to come and meet us, see the department and be part of our exciting future.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Joanne Seymour, Lead Sonographer joanneseymour1@nhs.net telephone number: 01905 763333 (ext 30267)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire Royal Hospital", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916180428", "validThrough": "2020-11-18T23:59:59+0000"}