{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Band 5 or 6"}}, "datePosted": "2020-07-15T13:45:54+0100", "description": "&lt;p&gt;&lt;strong&gt;Nursing Band 5 and Midwifery Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Midwife at Band 5 or 6&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Mid Yorkshire Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wards Covered:&lt;/strong&gt; Maternity and Labour Wards&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Band 5 or 6&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have ambitions to be ‘Outstanding’ in an organisation where you’ll be rewarded by receiving top of Band 5 pay rates (mid Band 6 for Midwives)?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mid Yorkshire Trust has been on a fantastic improvement journey providing acute hospital services to more than half a million people living in the Wakefield and North Kirklees districts of West Yorkshire. It offers services in three main hospitals – Pinderfields (Wakefield), Dewsbury and District and Pontefract. In addition, The Trust provides community services to the people of Wakefield in a range of community settings such as health centres, clinics, GP surgeries, family centres and in people’s own homes. This means our patients benefit from hospital and community services working more closely together to ensure they receive their care in the most appropriate place for them – when and where they need it.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The amazing Maternity Teams, based within this Trust, have a continuity of care team established at their stand alone birth centre, in Wakefield. They have a second geographical team starting as of February 2020 and a plan for further teams rolling out in Summer. The Maternity teams are doing really well with their Attain and PReCePT programmes, with a range of maternity improvement and transformation projects in progress.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Approximately 6300 babies are born each year at Mid Yorkshire Hospitals NHS Trust and we offer women personalised care and choice of home birth, freestanding birth centre, alongside birth centre and multi-disciplinary care on our labour ward.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If we have gained your interest, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for Band 5 and Band 6 midwives to join our continuity of care teams and our core areas on a rotational basis. We offer a range of working hours and patterns including ‘suits you’ hours. So, whether you are looking for a varied work pattern or fixed hours and days we can accommodate you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have a minimum of 6 months paid experience at Band 5 or 6 within Maternity Services in a hospital environment within the last 2 years&lt;/li&gt;\n&lt;li&gt;Have up to date training and certification in CTG/ Neonatal Resus&lt;/li&gt;\n&lt;li&gt;Comply with NMC Professional Registration and keep up to date with current nursing practices&lt;/li&gt;\n&lt;li&gt;Undertake nursing assessment and evaluation to enable development of appropriate plans of care based on the needs of the individual&lt;/li&gt;\n&lt;li&gt;Be proficient in the delivery of care to patients&lt;/li&gt;\n&lt;li&gt;Ensure safe administration of drugs in accordance with NMC and Mid Yorkshire Trust policies&lt;/li&gt;\n&lt;li&gt;Ensure accurate records are kept in accordance with Mid Yorskhire Trust policy and NMC guidelines&lt;/li&gt;\n&lt;li&gt;Carry out nursing procedures and techniques in accordance with agreed policies and standards&lt;/li&gt;\n&lt;li&gt;Undertake regular mandatory training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of shifts at your Trust&lt;/strong&gt; – Access to shifts before they are available to agency&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working to suit your lifestyle &lt;/strong&gt;– Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance for every shift you work &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book and manage your shifts on the go&lt;/strong&gt; – Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03332 407 552&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to Apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, Kerry Fox , Mid Yorkshire Trust Recruiter on 0333 0144283 or Kerry.Fox@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Yorkshire", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Midwife Band 5 or 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916113751", "validThrough": "2021-03-31T23:59:59+0100"}