{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-09-21T07:10:08+0100", "description": "&lt;p&gt;Are you looking for an opportunity to join one of the most renowned Rehabilitation Hospitals in the area? We are looking for proactive, highly motivated, enthusiastic staff nurses to join our friendly nursing team.&lt;/p&gt;\n&lt;p&gt;We work closely with service users, carers and partner organisations, which provides us with the opportunity to make a real difference and improvement to our diverse range of services, from health and social care, alongside general and stroke rehabilitation.&lt;/p&gt;\n&lt;p&gt;Our general rehabilitation wards accept patients from the acute wards to provide appropriate treatments for patients with varying rehabilitation needs. Although we are a small hospital we have a dedicated Multidisciplinary Team and a multi-disciplinary approach is adopted across the wards, with nursing and therapy staff working closely together to provide a high standard of safe, personal and effective care whilst promoting a return to independent living where possible.&lt;/p&gt;\n&lt;p&gt;We work closely with families with this goal in mind, or to support patients and their families to arrange safe discharge with care support, or to an appropriate care setting.&lt;/p&gt;\n&lt;p&gt;The Hospital also has the support of the local charity ‘Friends of Pendle Community Hospital’ that works hard raise funds to provide extra comforts for patients; and has recently been able to redevelop the rooftop and courtyard gardens which allowed some patients’ therapy sessions to be undertaken in a different setting.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be registered with a General Nurse qualification and be on the NMC Register and will demonstrate the Trust’s values at all times ensuring the provision of quality nursing care. They must have the initiative to adapt to the changing demands of the service and be able to contribute to the development of service provision.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be committed to continuously striving to improve the patient experience and outcome at every opportunity utilising a person centred approach.&lt;/p&gt;\n&lt;p&gt;If you would like to be a member of an enthusiastic NHS team committed to training &amp; development to ensure your own continuing professional development then we would welcome your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sr Alison Lacey – Hartley Ward 01282 804970 and Sr Jude Harrison – Reedyford Ward 01282 804974&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "435|4583|Hartley Ward|PCH|CIC, Nelson", "postalCode": "BB9 9SZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.837", "longitude": "-2.214"}}, "title": "Staff Nurse - Hartley Ward - Pendle Community Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916192167", "validThrough": "2020-11-09T23:59:59+0000"}