{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-09-24T17:15:18+0100", "description": "&lt;p&gt;&lt;span&gt;Portsmouth Hospitals University NHS Trust is looking to appoint an enthusiastic, forward-thinking Consultant Haematologist with an interest in Haemostasis and Thrombosis. Based at Queen Alexandra Hospital, the Trust has a vision to be recognized as a world-class hospital, leading the field through innovative healthcare solutions, focusing on the best outcomes for our patients, delivered in a safe, caring and inspiring environment. This post sits within the Regional Cancer Centre, a newly formed care group which has developed in recognition of the expansion of cancer services provided by the Trust. There are opportunities for clinicians in leadership and management roles alongside clinical roles. The department is well supported by three specialist nurses, in addition to three anti-coagulation nurses. There are also three Specialist Trainees from the Wessex training programme.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The department has an excellent record of participation in clinical trials, and benefits from the support of a dedicated research team.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All applicants must have full registration with the GMC and be a holder of the Certificate of Completion of Training (CCT) or equivalent, or be within six months of the award of the CCT or equivalent on the date of interview. Candidates wishing to work part time or job share will also be considered. Modification of the job content would be discussed on a personal basis with the Trust in consultation with colleagues.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This is a replacement, whole-time post due to the imminent retirement of the current post holder. The successful candidate will join an established and enthusiastic team of 8 Consultants, and is expected to be broadly skilled and to take part in clinical and laboratory duties. This is a 11 PA post; applicants wishing to work less than full time are most welcome to discuss their requirements.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please contact Dr Charles Alderman - &lt;/span&gt;&lt;span&gt;Charles.Alderman@porthosp.nhs.uk&lt;/span&gt;&lt;span&gt; or Dr Robert Corser – &lt;/span&gt;&lt;span&gt;Robert.Corser@porthosp.nhs.uk&lt;/span&gt;&lt;span&gt; - phone 02392286000 ext 6311 for informal discussion or further information. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date:&lt;/strong&gt; Sunday 8th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: &lt;/strong&gt;Friday 27th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust (formerly known as Portsmouth Hospitals NHS Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Consultant Haematologist with interest in Haemostasis and Thrombosis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916199579", "validThrough": "2020-11-08T23:59:59+0000"}