{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37000", "minValue": "29500", "unitText": "YEAR", "value": "£29,500 - £37,000 FTE DOE"}}, "datePosted": "2020-07-29T10:24:44+0100", "description": "&lt;p&gt;Are you a Registered Nurse looking for something exciting and a little outside of the day to day norm?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently recruiting for&lt;/strong&gt;&lt;strong&gt; a Registered Nurses to join our Gastroenterology/Endoscopy team in Romford!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;InHealth has been providing patients and commissioners with rapid access to high quality endoscopy services in community gastroenterology clinics for over 10 years.&lt;/p&gt;\n&lt;p&gt;Leading the way in direct access services we work closely with primary care clinicians and commissioners to support the management of patients in the community and reduce waiting times at our local hospitals. We design locally agreed integrated pathways helping CCGs provide patient centered community endoscopy services through a one stop service.&lt;/p&gt;\n&lt;p&gt;Our services include Transnasal &amp; Oral Gastroscopy, Flexible Sigmoidoscopy, Colonoscopy, Bowel Scoping, Community Gastroenterology Clinics.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What does being Registered&lt;/strong&gt;&lt;strong&gt;Nurse involve?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role is 2&lt;strong&gt;0 hours per week, &lt;/strong&gt;working as part of a local rota,&lt;strong&gt; Monday - Sunday&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an Endoscopy Nurse at InHealth, we will provide all the training you need to excel in your role. We have an excellent rating of staff satisfaction and pride ourselves on how we value our team members. You will be carrying out pre, peri and post endoscopy care for patients and supporting them through their pathway whilst continuing to achieve our 98% patient satisfaction rate.&lt;/p&gt;\n&lt;p&gt;To apply for this role, you will need to be an NMC Registered Nurse witha passion for high quality patient care. Please see our job description for further information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can InHealth offer you? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a highly competitive salary and a generous flexible benefits package, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days holiday plus bank holidays&lt;/li&gt;\n&lt;li&gt;Private medical healthcare with Bupa&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;Gym membership discount&lt;/li&gt;\n&lt;li&gt;Plus many more!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We can offer you the opportunity to do something you love, with the right support to access the roles you want, through clear career paths and best-in-class training and development. This is an environment where you have accountability for your career and can make a real contribution to the organization and to our patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;InHealth is an equal opportunities employer and welcomes applications from all areas of the community.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Some of our roles will be subject to DBS criminal record checking in line with legal requirements but don’t worry; we will guide you through this if you are offered a role with us.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are a great place to work!! Thank you for your interest in working with InHealth.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "InHealth Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Romford", "postalCode": "RM1 3LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.577", "longitude": ".183165"}}, "title": "Registered Nurse (part time)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916129462", "validThrough": "2020-11-30T23:59:59+0000"}