{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-09-07T13:46:00+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;An exciting opportunity has arisen for the post of Acute Consultant in the newly developed Same Day Emergency Care Unit at Royal Preston Hospital. The new unit has been developed after £1.9 million of investment which has been utilised to design and build a full new clinical area which the service will operate within. There has also been a further £2.5 million of workforce investment made which will create a fully established Same Day Emergency Care team. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Acute Medical teams have recently developed robust clinical pathways which will underpin the Same Day Emergency Care unit. All patients attending the Emergency Department will be assessed utilizing the pathways and exclusion criteria to ensure patient pathways are effective and efficient. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Same Day Emergency Care Unit has 2 treatment rooms, 8 trolley spaces, 4 reclining chairs and a waiting room. The unit will be absolutely key in ensuring the success in the Acute Medical Clinical Business Unit but will also play an integral part in securing the sustained success of the Division of Medicine. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This is an exciting new venture for at Royal Preston and we are now looking to build a substantial team that share the vision we have. The individuals must be enthusiastic and motivated, who has excellent leadership skills and the ability to problem solve, effectively communicate with patients and all members of the multi-displinary team. The team will be extremely fast paced and proactive. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;As a Consultant you will have the ability to support the department in providing a team approach to ensure high standards of safe care and constant support for junior staff and students in practice.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You must have experience of working in Acute Medicine and be able to demonstrate clinical knowledge and skills in caring for medical patients. You will be a clinical role model and have a willingness to develop the team as well as your own professional growth.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Munish Batra, Consultant and Clinical Director in Acute Medicine, munish.batra@lthtr.nhs.uk, (01257) 247140&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Informal enquiries and requests to visit the Hospitals are welcome and should be made, following shortlisting, with Dr. Geraldine Skailes, Medical Director and Karen Partington, Chief Executive (01772) 522692.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital and Chorley and South Ribble District General Hospital, Preston and Chorley", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Consultant Physician in Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916174891", "validThrough": "2020-11-30T23:59:59+0000"}