{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-09-21T11:54:07+0100", "description": "&lt;p&gt;UHB is looking for an experienced Business Analyst to deliver a challenging EPR / Digital Health programme of work at UHB. As part of the Trust&#39;s expanding Business Change Team applicants must be able to :-:&lt;/p&gt;\n&lt;p&gt;Use advanced technical knowledge and competencies to enhance the user experience of IT solutions infrastructure within the Trust..&lt;/p&gt;\n&lt;p&gt;Take direct responsibility as product champion for research, planning, implementation, configuration, documentation and training delivery of collaboration solutions within specified time scales and budgetary constraints.&lt;/p&gt;\n&lt;p&gt;Take responsibility, as project lead, for the planning and delivery of any technical /business change components of medium to large scale projects.&lt;/p&gt;\n&lt;p&gt;Fully comprehend the role of user advocate and be able to follow through with improvement initiatives to a high level of satisfaction.&lt;/p&gt;\n&lt;p&gt;Workacross the wholeTrust with all staff groups , clinical and none clinical , you&#39;ll be expected to use yourdeveloped communication skills toaccurately scopestakeholder expectations and turn them into tangibeEPR system improvementsthat benefit both patients and staff .&lt;/p&gt;\n&lt;p&gt;Use your strong analytical and problem solving skills to turn opportunities into deliverables.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Senior Business Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916192870", "validThrough": "2020-11-06T23:59:59+0000"}