{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44205", "minValue": "34024", "unitText": "YEAR", "value": "£34,024 - £44,205"}}, "datePosted": "2020-07-14T16:54:55+0100", "description": "&lt;p&gt;We have an opportunity for a Band 5 ICU Nurse to join our Intensive Care Unit based at The London Clinic’s Main Hospital in Central London, W1G (Close to Regents Park &amp; Baker Street tube stations).&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest independently owned non-profit hospital, with state-of-the-art facilities located on Harley Street. We have circa 1200 employees, a total of 8 premises, and we are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise.&lt;/p&gt;\n&lt;p&gt;Our main hospital spans 8 floors comprising of 234 beds and 10 theatres, including a Hybrid theatre and two minimally invasive and day surgery theatres. The Duchess of Devonshire Wing is our award-winning cancer centre, which includes state-of-the-art radiotherapy, chemotherapy suites and dedicated patient bedrooms&lt;/p&gt;\n&lt;p&gt;Job Description&lt;/p&gt;\n&lt;p&gt;As an ICU Staff Nurse, you will assess, plan, deliver and evaluate high standards of nursing care, ensuring the highest level of customer service is delivered to our patients.&lt;/p&gt;\n&lt;p&gt;Job Type&lt;/p&gt;\n&lt;p&gt;This is a full time, permanent position working 37.5 hours per week (days, nights and weekends.)&lt;/p&gt;\n&lt;p&gt;Salary&lt;/p&gt;\n&lt;p&gt;The attractive salary range for this role is £34,024 - £44,205 per annum (inclusive of London Weighting &amp; COLA) and will be dependent upon skills and experience.&lt;/p&gt;\n&lt;p&gt;Benefits package&lt;/p&gt;\n&lt;p&gt;We offer our permanent staff a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 25 day’s annual leave plus bank holidays, season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/p&gt;\n&lt;p&gt;Duties &amp; Responsibilities&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead on the delivery of individualised patient care acting as the named nurse, ensuring the assessment, planning, implementation and evaluation is in line with evidence base practices.&lt;/li&gt;\n&lt;li&gt;Communicate effectively with dignity and respect to patients, relatives, staff and others giving consideration to potential barriers to understanding.&lt;/li&gt;\n&lt;li&gt;Ensure accurate and comprehensive nursing records are maintained using appropriate IT Healthcare systems available.&lt;/li&gt;\n&lt;li&gt;Maintain own continuing professional development in accordance with CPD requirements and contribute to formulation of own objectives and personal development plan.&lt;/li&gt;\n&lt;li&gt;Act as a role model and behave according to the Clinic’s Behavioural Framework.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;This job description is intended as a general guide to the post, but it may change in line with the needs of the department or at the request of the line manager.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Skills &amp; Experience&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Adult Nurse with up-to-date NMC registration&lt;/li&gt;\n&lt;li&gt;Clinical experience within an Acute High Dependency or Intensive Care setting.&lt;/li&gt;\n&lt;li&gt;ITU/Critical Care and/or Mentorship qualification is desirable but we offer the required courses after an initial period of employment has been completed based on a fair interview process.&lt;/li&gt;\n&lt;li&gt;Familiar with basic physiology and have a theoretical knowledge base for acute nursing, including mechanical ventilation, renal replacement therapies, advance haemodynamic monitoring, and knowledge on routine medication administered in Intensive Care Settings.&lt;/li&gt;\n&lt;li&gt;Effective communication with different healthcare players, patients and their relatives, as well as good organisational skills demonstrated by efficient time management.&lt;/li&gt;\n&lt;li&gt;Demonstrates a proactive and positive attitude, with the ability to work professionally within a multi-disciplinary team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;The successful applicant’s offer is subject to relevant DBS, Occupational Health and Reference Checks respectively, alongside standard Right To Work Checks.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/p&gt;\n&lt;p&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "Band 5 ICU Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916112703", "validThrough": "2020-11-29T23:59:59+0000"}