{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-09-08T15:29:36+0100", "description": "&lt;p&gt;Are you ready for a new challenge; the department of General medicine and emergency Surgery at Good Hope Hospital is looking to recruit dynamic innovative nurses to join our team. Vacancies exist on our ward on Ward 16 &amp; ward 17 Good Hope Hospital Ward 16 is a busy 28 bedded medical &amp; emergency surgical ward, which cares for patients who are generally unwell and/or have had emergency surgery. We are also a step down ward for patients who have needed ITU/HDU care: Ward 17 is emergency surgery ward along with surgical assessment area. They have patients from A+E who need further investigations and/or patients that require emergency surgery. These are acutely ill patients that require pre and post-operative care. We are also a step down ward for patients who have needed ITU/HDU care: The posts are rotational, working day and night duty following a 2 day Trust Induction Programme and a Ward Orientation Programme on days. We actively promote personal development. You will need to be a Registered Nurse (Level 1) with preferably at least 6 months experience, but newly qualified nurses will also be considered for the post. Previous applicants over the past three months will not be considered. For an informal visit and discussion concerning the posts available please contact: Stacy Allen and Julie Young Ward Managers ward 16 on 0121 424 7641 All application forms to be completed on line. The Trust operates a no smoking policy and is working towards a smoke free environment.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sutton Coldfield", "postalCode": "B75 7RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5674", "longitude": "-1.81204"}}, "title": "Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916177088", "validThrough": "2020-12-31T23:59:59+0000"}