{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "90000", "minValue": "90000", "unitText": "YEAR", "value": "£90,000 per annum pro rata"}}, "datePosted": "2020-09-18T11:17:25+0100", "description": "&lt;p&gt;&lt;strong&gt;Plastic Surgeon - required across our North Middlesex Dermatology Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;(North middlesex Hospital)&lt;/p&gt;\n&lt;p&gt;£90,000 per annum pro rata&lt;br /&gt;&lt;br /&gt; Part time available - 16 hours a week: Monday &amp; Tuesday&lt;/p&gt;\n&lt;p&gt;Omnes Healthcare is an award winning service and is offering candidates an exciting opportunity to join a successful expanding team working within the NHS. Our Dermatology services currently cover London, Kent, Wolverhampton, and Manchester.&lt;/p&gt;\n&lt;p&gt;We have an opportunity for a Plastic Surgeon based at North middlesex Hospital NHS Services. The post holder will undertake dermatological surgical procedures,including biopsies and excisions.&lt;/p&gt;\n&lt;p&gt;The post holder will report to the Service Manager and the Medical Director, and is responsible for delivery and supervision of all aspects of the dermatology service, in line with agreed aims and objectives. The post holder will drive best practice in overall patient care, efficiency, performance against service level KPIs, staff mentoring, liaison with external agents and suppliers and the wider community.&lt;/p&gt;\n&lt;p&gt;The post holder will actively seek ways of reducing outgoings by new ways of working and motivating all the staff to deliver maximum efficiency.&lt;/p&gt;\n&lt;p&gt;Candidates must have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;MRCP or equivalent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be supported by, and work with, a diverse multi-skilled professional team of clinical and non-clinical friendly staff. In return we offer sponsored training, flexible working , family friendly policies, career progression within an expanding organisation, a competitive salary and benefits package, including medical indemnity for all work undertaken for Omnes Healthcare.&lt;/p&gt;\n&lt;p&gt;To apply for the role please submit your application along with a supporting statement outlining why you would be a suitable candidate for the role.&lt;/p&gt;\n&lt;p&gt;Please note that due to the volume of applications submitted, only successful applicants will be contacted.&lt;/p&gt;\n&lt;p&gt;We are committed to equal opportunities and we welcome applications from ethnic minority groups and people with disabilities.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are only able to consider applicants who have relevant UK experience.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/134554.png", "name": "Omnes Healthcare Limited", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Middlesex Hospital", "postalCode": "N18 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6135", "longitude": "-.07424"}}, "title": "Plastic Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916190740", "validThrough": "2020-11-30T23:59:59+0000"}