{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112"}}, "datePosted": "2020-08-14T08:39:51+0100", "description": "&lt;p&gt;Noah’s Ark Children’s Hospice is an award-winning, growing charity and our people matter enormously.&lt;/p&gt;\n&lt;p&gt;Our expanded care provision will ensure that we are able to offer a complete hospice service for the 1,169 babies, children and young people with life-limiting or life-threatening conditions in our catchment area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A fantastic opportunity has arisen to join our Care Team as a Band 5 Registered Nurse.&lt;/p&gt;\n&lt;p&gt;If you are a band 5 nurse looking for a new challenge and are interested in children’s palliative care, this is a great opportunity for you. Within this rotation programme you may have the opportunity to work within children’s acute care, intensive care, community and hospice environments. This will allow you to experience providing children’s palliative care in a range of settings, increasing your knowledge and skills, and offers an excellent professional development opportunity.&lt;/p&gt;\n&lt;p&gt;Based initially at Noah’s Ark Children’s Hospice and then spending up to 6 months in each acute care environment, you can expect to be well supported throughout by the friendly Noah’s Ark care team, as well as by the rotation programme project manager. The tailored supervision and competence package will support you to flourish as you progress your nursing career.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity for anyone looking to develop their skills and gain knowledge and experience in this specialist field.&lt;/p&gt;\n&lt;p&gt;We would love for you to take a tour of The Ark, our brand new hospice. During this tour, you can meet the team. Please contact Elisha Lewis (Specialist Care and Nursing Team Manager) on 020 8449 8877 / 07908951040 or email her on Elewis@noahsarkhospice.org.uk if you would like to arrange a meet and greet.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Social Enterprises", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130655"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "EN5 4NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6572", "longitude": "-.213179"}}, "title": "Nurse Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916148698", "validThrough": "2021-08-14T23:59:59+0100"}