{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-09-17T11:01:04+0100", "description": "&lt;p&gt;&lt;strong&gt;So, you’re eager to learn more about Anaesthetic Nursing and ODP opportunities at North Bristol NHS Trust. Here are some of the reason’s we’re unique…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our theatre department is the Major Trauma centre for the South West Region and a specialist regional centre for a number of services, including neurosurgery, renal, plastics, burns and orthopaedics and hosts 34 Theatres. At North Bristol Trust, we are proud to offer all our Theatre Practitioners (ODP’s and Nurses) the same job role and access to development opportunities.&lt;/li&gt;\n&lt;li&gt;Our multidisciplinary team receive personalised support from the Perioperative Development Team, providing bespoke training programmes and development days for our theatre staff. We currently have Theatre Nurses and ODPs who have progressed to work in a variety of roles including Assistant General Manager, Simulation Trainers, Research and Surgical First Assistants.&lt;/li&gt;\n&lt;li&gt;Our anaesthetics practitioners also have access to unique multidisciplinary training delivered by our Perioperative simulation team within a purpose built simulation facility; our Clinical Simulation space.&lt;/li&gt;\n&lt;li&gt;We are proud to offer our patient’s access to state-of-the-art facilities in our purpose built Brunel Building at Southmead Hospital, which has won multiple awards for both its design and environmental credentials. We are also innovating the traditional recovery approach, supporting patients during admission, pre-op and post operatively within our Medirooms. A new concept in Healthcare, our Medirooms combine the traditional recovery, day-case, same-day and admission areas into a single patient room environment, specifically designed to enhance patient experience by improving the level of privacy and dignity these areas were traditionally able to offer.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;But it’s not just our theatre departments which are impressive; our Trust itself is pioneering in its approach to healthcare. Let us tell you a little more about it…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our health and well-being initiatives, devised by our dedicated staff wellbeing team, encompass lifestyle support, physical support and psychological support, and have been nationally recognised by REBA&lt;/li&gt;\n&lt;li&gt;Our staff don’t shy away from a challenge in aid of Southmead Hospital Charity. They cycle, run, row and race in aid of a fantastic cause, or sing in our staff choir and compete in ‘Southmead Does Strictly’.&lt;/li&gt;\n&lt;li&gt;We’re committed to supporting staff on their career journey with us offering personalised training packages and bespoke specialty rotations.&lt;/li&gt;\n&lt;li&gt;Staff are consulted on equity issues across the trust within their staff equality and development groups, with mentoring and support to succeed. Our trust is supporting the development of Bristol’s LGBT+ manifesto and a case study of good practice has been reported to NHS England in response to a government review of public services and Trans people&lt;/li&gt;\n&lt;li&gt;Our clinical environment is award-winning in its approach to healthcare design; each patient room has a view, many of which are naturally ventilated and 75% of rooms in our Brunel Building are single and en-suite. With nurses in mind, our clinical spine carefully separates staff and patient areas, with a generous staff canteen extending out to a rooftop terrace.&lt;/li&gt;\n&lt;li&gt;Bristol is consistently voted the best place to live in the UK, with vibrant local music, arts and gastronomic scenes, a wide range of modern and state of the art shopping, recreation and leisure facilities, a wealth of great local family days out, fantastic transport links for local, national and internal holidays, and it has a rich history. If you prefer country, village or smaller town living, NBT is also easily commutable from a range of attractive locations in North Somerset, South Gloucestershire and South Wales (e.g. Portishead, Chepstow)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Right, that’s enough about us… let’s focus on you. Are you…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An experienced Theatre Nurse or ODP working in Anaesthetics with NMC/HCPC registration, looking for a new challenge?&lt;/li&gt;\n&lt;li&gt;A newly qualified/qualifying Nurse/ODP, excited about the prospect of developing your theatre career within a regional specialist centre?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Please note, if you are a Registered Nurse, you will need a recognised post-graduate anaesthetic qualification to be eligible for this role. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;So, are we right for each other? Here are your next steps…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Submit your application via this advert.&lt;/li&gt;\n&lt;li&gt;Find out more about careers within our Trust at an upcoming digital engagement event – email Nursing@nbt.nhs.uk to find out more&lt;/li&gt;\n&lt;li&gt;Looking for flexible working options? Our bank team (NBTeXtra) can offer you flexible working opportunities with competitive rates. Find out more on the adverts below:\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Theatre Nurse- NBTeXtra&lt;/li&gt;\n&lt;li&gt;Operating Department Practitioner- NBTeXtra&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Our theatre department also regularly host professional development study days for Anaesthetics, Scrub and Recovery nurses and ODPs. To be added to the mailing list for future events, please submit your details &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;here.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Follow us on social media to join in the conversation and gain an insight into life at North Bristol NHS Trust (search @NBTNursing on Twitter,&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Theatre Practitioner - Anaesthetics (Nurse/ODP) – Experienced and New", "url": "https://www.jobs.nhs.uk/xi/vacancy/916188818", "validThrough": "2020-11-15T23:59:59+0000"}