{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive salary plus benefits"}}, "datePosted": "2020-09-24T15:52:35+0100", "description": "&lt;p&gt;BMI Mount Alvernia Hospital in Guildford is part of BMI Healthcare, Britain&#39;s leading provider of independent healthcare with a nationwide network of hospitals &amp; clinics, performing more complex surgery than any other private healthcare provider in the country. &lt;/p&gt;\n&lt;p&gt;We have an opportunity for a Registered Nurse to join their team of staff in the Outpatients department.&lt;/p&gt;\n&lt;p&gt;This is a Full time role for 37.5 hours a week. The role holder will be required to cover a flexible shift pattern.&lt;/p&gt;\n&lt;p&gt;Applicants should meet the following criteria:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Nurse Level 1 / Diploma / BSc in Nursing. Or&lt;/li&gt;\n&lt;li&gt;Registered Nurse Level 2  - Relevant Competencies for the role.&lt;/li&gt;\n&lt;li&gt;Evidence of relevant clinical professional development preferably evidenced by certification RN with valid NMC Registration.&lt;/li&gt;\n&lt;li&gt;Up-to-date knowledge in area of practice.&lt;/li&gt;\n&lt;li&gt;Awareness of NMC Code of Accountability.&lt;/li&gt;\n&lt;li&gt;Studies Registered general l nurse level 1.&lt;/li&gt;\n&lt;li&gt;Previous experience working within the acute healthcare sector.&lt;/li&gt;\n&lt;li&gt;Experience of customer care, including interacting with challenging customers and situations.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Duties of this role include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure that standards of patient care are consistently maintained at all times in accordance with agreed operational policies and procedures. Working to maintain and enhance the customer service and satisfaction of service users.  As a skilled member of the nursing team promote and safeguard the well-being and interests of all patients, employees and visitors. Assess, plan, implement and evaluate individualised patient care.&lt;/li&gt;\n&lt;li&gt;Prepare and maintain clinical records of patient care, with reference to Nursing Midwifery Council (NMC) standards for records and record keeping.&lt;/li&gt;\n&lt;li&gt;Conduct yourself professionally within the standard and framework provided by the NMC Codes of professional Conduct and the Health and Care Professions Council (HCPC).&lt;/li&gt;\n&lt;li&gt;Be an advocate for patient care, searching for ways to improve the value and effectiveness of care and services delivered.&lt;/li&gt;\n&lt;li&gt;Encouraging the development of research and audit based clinical practice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further detailed information on the responsibilities and accountabilities of this vacancy please refer to the job description.&lt;/p&gt;\n&lt;p&gt;Salary &amp; Benefits:&lt;/p&gt;\n&lt;p&gt;BMI Healthcare have committed to being a national living wage employer and offer a competitive starting salary alongside access to a wide range of employee benefits, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BMI Healthcare Private Medical Insurance&lt;/li&gt;\n&lt;li&gt;BMI Pension Scheme&lt;/li&gt;\n&lt;li&gt;25 days holiday per annum increasing up to 30 days with long service&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity, Paternity &amp; Adoption Leave&lt;/li&gt;\n&lt;li&gt;Market leading learning and development, including free courses and industry recognised qualifications&lt;/li&gt;\n&lt;li&gt;Nationwide Gym discounts &amp; Online Fitness Classes&lt;/li&gt;\n&lt;li&gt;BMI Staff Health Checks&lt;/li&gt;\n&lt;li&gt;Blue Light Discount Card for 1,000s of nationwide discounts and exclusive offers&lt;/li&gt;\n&lt;li&gt;Cycle to Work – and much more!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Interested?&lt;/p&gt;\n&lt;p&gt;For more information on this role or for an informal chat please contact Kathryn Bruton on 01483 442646&lt;/p&gt;\n&lt;p&gt;Owing to the nature of this position, any offer of employment will be subject to a satisfactory Enhanced Disclosure Check&lt;/p&gt;\n&lt;p&gt;Disability Confident – Committed Employer:&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed Employer BMI we endeavour to ensure that disabled people and those with long term health conditions have the opportunities to fulfil their potential and realise their aspirations within BMI. If you require reasonable adjustments for your application, interview or during your onboarding/induction process BMI will support you. For more information on the Government’s Disability Confident Employer Scheme, please click here&lt;/p&gt;\n&lt;p&gt;Safeguarding&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;BMI Healthcare is fully committed to safeguarding the welfare of all children and young people, and vulnerable adults by taking all reasonable steps to protect them from harm.  All staff will receive appropriate training and induction so that they understand their roles and responsibilities and are confident about carrying them out.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BMI Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford", "postalCode": "GU1 3LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2359", "longitude": "-.564235"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916199344", "validThrough": "2020-11-22T23:59:59+0000"}