{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-09-15T16:18:36+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health Hereford Hospital is situated half a mile from the city centre and is a modern hospital offering exceptional private healthcare to the local community. We offer a vast range of first-class medical and surgical services performed by expert consultants.We&#39;re constantly investing in new facilities, recently refurbishingour day care suite and openingour new mammography unit. We take pride in the high standards of care and treatment our patients receive and haveanoverall CQC rating ofGood.We want to be the best and safest health and wellbeing provider so that our patients, customers and partners have an exceptional experience.If you want to be part of Britain&#39;s largest not-for-profit health organisation join usat Hereford Hospital andcontinue your journey with us whilst we’ll support you to be your best.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s in it for you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;On joining our agile and highly energised multidisciplinary team you’ll have a fantastic opportunity to develop your skills and experience across a range of specialties and levels of complexity.&lt;/p&gt;\n&lt;p&gt;Supported by our Theatre Manager, you’ll have autonomy to utilise your acquired expertise and skills to make decisions that will ensure the delivery excellent patient care. The work is exciting, varied and challenging, the multiple specialities will enable you to develop new skills and grow. We actively support you to be the best you can be in your role while also offering opportunities to progress.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits, including free gym membership. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;You might join us from the NHS or a private setting. Either way, here you will discover a unique opportunity to work with some of the best in the field, and to grow your career. Not only this but you will be valued and free from the constraints that currently prevent you from achieving job satisfaction. As a TheatrePractitioner you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work on a varied caseload using technology, equipment and facilities, which are all state-of-the-art.&lt;/li&gt;\n&lt;li&gt;Supervise, support and develop junior members of staff.&lt;/li&gt;\n&lt;li&gt;Deliver high quality care and experiences for patients, which is always clinically effective, evidence based and appropriate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;To succeed as a Theatre Practitioner you will have;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;High levels of focus and engagement.&lt;/li&gt;\n&lt;li&gt;A passion for high standards and a meticulous eye for detail.&lt;/li&gt;\n&lt;li&gt;Qualifications and experience relevant to your registration, including NMC or HCPC.&lt;/li&gt;\n&lt;li&gt;Post-registration experience.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills and will be a great team worker. You will also be flexible and motivated.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;Key information about the role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;SFA qualification desirable - Theatre Practitioners who have undertaken and fulfil the training and competency requirements as defined in Nuffield Health’s policies, may undertake the role of Surgical First Assistant.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Benefits&lt;/p&gt;\n&lt;p&gt;In return, we offer a working environment that will help you grow your skills and experience and get the best out of life. Other benefits include 25 days’ annual holiday (increasing with service), gym membership, private healthcare and a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary - Competitive&lt;/p&gt;\n&lt;p&gt;Hereford Hospital&lt;/p&gt;\n&lt;p&gt;Full Time, 37.5 hours&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR1 1DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.064", "longitude": "-2.69984"}}, "title": "Theatre Practitioner - Scrub (RGN/ODP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916186092", "validThrough": "2021-01-04T23:59:59+0000"}