{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80000", "minValue": "70000", "unitText": "YEAR", "value": "£70,000-£80,000"}}, "datePosted": "2020-08-24T11:16:32+0100", "description": "&lt;p&gt;&lt;em&gt;&lt;strong&gt;The Disabilities Trust is Hiring in York!&lt;/strong&gt;&lt;/em&gt;&lt;br /&gt;&lt;strong&gt;Exciting opportunity for a Speciality Doctor in Psychiatry looking for their next challenge&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Brain Injury Rehabilitation Trust (BIRT) is looking for a Speciality Doctor in Psychiatry who wants to share their experience by working in our highly regarded service at York House.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post will be operationally accountable to the Hospital’s Registered Manager and the Consultant Psychiatrist, who have access to a range of administrative and governance resources embedded at York House. This post involves administration of the Mental Health Act and governance within the service.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Your responsibilities will include:&lt;/strong&gt;&lt;br /&gt;- Providing psychiatric treatment within a model of highly integrated and well-represented, neurobehavioral multi-disciplinary care&lt;br /&gt;- To undertake regular psychiatric reviews of patients in the service and work with other disciplines to provide a well-balanced model of acquired brain injury, rehabilitation and care&lt;br /&gt;- Attending two weekly clinical team meetings; one weekly ward round and the other the Holistic Neurobehavioural rehabilitation multi-disciplinary team meeting, undertaking medical interventions that are required as necessary on an individual basis.&lt;br /&gt;- To take clinical leadership for cases and having a case load where the postholder develops assessments, oversees delivery of multi-disciplinary inputs, and ensures goal attainment and review meetings are held appropriately.&lt;br /&gt;- Arrange appropriate clinical tests and investigations and take responsibility for chasing up and reviewing results in a timely manner&lt;br /&gt;- Liaising with clinical teams within and outside the Trust as required includinggeneral practitioners and medical specialists with regards to the physical health of the patients&lt;br /&gt;- To be part of the pre-admission team and assess patients in and out of area to ensure suitable for treatment at York House&lt;br /&gt;- To participate in a 1:5 non-residential on call rota which is, confined to units within the City of York&lt;br /&gt;- There is a requirement to be an Approved Section 12 Doctor&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Benefits include:&lt;/strong&gt;&lt;br /&gt;- A salary of £70-£80,000 Per Annual FTE&lt;br /&gt;- 33 days annual leave (inclusive of bank holidays)&lt;br /&gt;- Excellent training and support&lt;br /&gt;- Group life assurance&lt;br /&gt;- Eye voucher scheme&lt;br /&gt;- Long service and staff awards&lt;br /&gt;- Free parking&lt;br /&gt;- Nationwide employee staff discounts including discounted gym membership, eating out and shopping.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;H&lt;strong&gt;ours:&lt;/strong&gt;&lt;br /&gt;This is a Full time position, 35 hours a week.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Please Note: This post is subject to a DBS check and references.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Disabilities Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO10 5BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9508", "longitude": "-1.06314"}}, "title": "Speciality Doctor in Psychiatry - York", "url": "https://www.jobs.nhs.uk/xi/vacancy/916159361", "validThrough": "2020-11-27T23:59:59+0000"}