{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22895", "minValue": "20911", "unitText": "YEAR", "value": "£12.44 - £13.62 per hour plus enhancements"}}, "datePosted": "2020-09-04T10:34:40+0100", "description": "&lt;p&gt;Sue Ryder Leckhampton Court Hospice&lt;br /&gt;Leckhampton, Cheltenham&lt;br /&gt;Staff Nurse - Bank&lt;/p&gt;\n&lt;p&gt;Enhancements:&lt;/p&gt;\n&lt;p&gt;o 8.00 pm to 6.00 am (nights) 30%&lt;br /&gt;o Friday midnight to Sunday midnight (weekends) 45%&lt;br /&gt;o Public Holidays 24 hours midnight to midnight 60%&lt;/p&gt;\n&lt;p&gt;About Us:&lt;/p&gt;\n&lt;p&gt;Sue Ryder provides incredible hospice and neurological care to people facing a life-changing or terminal diagnosis. We do whatever we can to act as a safety net for our patients and their loved ones during the most difficult time of their lives.&lt;/p&gt;\n&lt;p&gt;Leckhampton Court Hospice can be found nestled at the foot of the Cotswold Hills on the edge of Leckhampton, Cheltenham. The only service of its kind in the area, our 16-bed hospice is surrounded by beautiful countryside, and its tranquil and calm setting complements the specialist palliative and end of life care and support provided to people with life-limiting conditions.&lt;/p&gt;\n&lt;p&gt;Your Benefits:&lt;/p&gt;\n&lt;p&gt;- Private pension scheme matched at 5%&lt;br /&gt;- Enhanced maternity and paternity benefits&lt;br /&gt;- Referral scheme of up to £500&lt;br /&gt;- Carer’s leave policy&lt;br /&gt;- 24 hour employee assistance line for free advice on work, family and personal life&lt;br /&gt;- PeoplePerks - discounts with hundreds of retailers and services&lt;br /&gt;- Staff discounts of 15% at the Sue Ryder online shop&lt;br /&gt;- Childcare vouchers and cycle to work scheme&lt;br /&gt;- Staff loans and company car loans&lt;br /&gt;- Free parking and subsidised meals&lt;br /&gt;- Wellbeing centre and free will writing service&lt;br /&gt;- Development opportunities for all through our structured development framework&lt;/p&gt;\n&lt;p&gt;Your role&lt;/p&gt;\n&lt;p&gt;We are looking for experienced registered nurses to join our professional and friendly team on a bank/ad hoc basis. There is plenty of scope to develop your skills in specialist palliative care and planned career progression through our education programme and development framework. So if you are enthusiastic, committed nurse looking to develop your knowledge in specialist palliative care with an expert national charity, then this may be the job for you.&lt;/p&gt;\n&lt;p&gt;In this key role, you will:&lt;/p&gt;\n&lt;p&gt;• Assess, plan, implement and evaluate individualised care using evidence based guidelines&lt;br /&gt;• Liaise with the multidisciplinary team over service user care&lt;br /&gt;• Maintain all records in line with corporate policies and procedures&lt;br /&gt;• Carry out all clinical procedures in line with Sue Ryder policies&lt;br /&gt;• Ensure the care team provide all care in line with the multi professional evidence based care plan&lt;/p&gt;\n&lt;p&gt;About You:&lt;/p&gt;\n&lt;p&gt;To join our team, you’ll need:&lt;/p&gt;\n&lt;p&gt;- To be an NMC registered nurse, ideally with post-registration experience in palliative end of life care&lt;br /&gt;- A compassionate and people-centred approach&lt;br /&gt;- Excellent communication skills&lt;/p&gt;\n&lt;p&gt;Other organisations may call this role Registered Nurse, Staff Nurse, RGN, Registered General Nurse, Nurse, Nurse Practitioner, Palliative Care Nurse or Senior Nurse.&lt;/p&gt;\n&lt;p&gt;Sue Ryder are equal opportunities employers, value diversity and are strongly committed to providing equal employment opportunities for all employees and all applicants for employment. Equal opportunities are the only acceptable way to conduct business and we believe that the more inclusive our environments are, the better our work will be.&lt;/p&gt;\n&lt;p&gt;It takes a special sort of person to join our team so if you could see yourself as one of our Registered Nurses, please apply via the button shown.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leckhampton", "postalCode": "GL53 0QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8727", "longitude": "-2.0873"}}, "title": "Bank Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916172446", "validThrough": "2020-11-22T23:59:59+0000"}