{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "41102", "minValue": "35770", "unitText": "YEAR", "value": "£35,770 - £41,102"}}, "datePosted": "2020-09-01T13:20:39+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With regard to the current COVID-19 restrictions, we are continuing to deliver our services where at all possible bearing in mind social/physical distancing. Our recruitment will also be completed remotely to ensure we adhere to any government guidance. All applicants will need to provide evidence of their right to work in the UK however before we can confirmunconditionaloffersofemployment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FixedTerm for 12 months, covering Maternity Leave&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a full time motivated and enthusiastic Independent Prescriber to join ourdynamic multi-disciplinary team providing clinical interventions across Wigan and Leigh.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Summary of the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will provide appropriate clinical interventions to service users.You will be based inWigan and covering across Wigan and Leigh. You will provideassessment and ongoing management of substitute prescribing for service users in a communitysetting.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For this role you will need to be either a registered nurse with a minimum of two years postregistration experience and a prescribing qualification, or a registered Pharmacist with a&lt;br /&gt;minimum of two years post registration experience and a prescribing qualification. Experienceof delivering interventions in a substance misuse setting would be an advantage.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be committed to working within the voluntary sector, in line with our values and willrelish the challenges of contributing to the development of a service and delivering high quality&lt;br /&gt;clinical care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We will provide an induction period to support you in the initial stages followed by a program ofmeaningful supervision and CPD.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further information about this job&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This is a fixed term role for 37.5 hours per week, for 12 months.&lt;/li&gt;\n&lt;li&gt;If you have any queries regarding this post please email:&lt;span style=&quot;text-decoration: underline;&quot;&gt;workwithus@wearewithyou.org.uk&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;The provisional interview date is 21stAugust 2020&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of working with us&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;28 days holiday plus a bank holiday allowance (pro rata for part time staff)&lt;/li&gt;\n&lt;li&gt;Enhanced employer pension contribution&lt;/li&gt;\n&lt;li&gt;Death in service benefit scheme&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to help with work life balance&lt;/li&gt;\n&lt;li&gt;Training and development opportunities&lt;/li&gt;\n&lt;li&gt;24/7 access to employee assistance programme&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Information about us and our recruitment processes&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are an equal opportunities employer and have committed to promoting equality and diversity in all areas of our work. Although we welcome applications from all sections of the community we are only able to employ those who have the legal right to work in the UK. We want to safeguard and protect the children, young people and adults we work with. Our rigorous selection process applies to all applicants to support this aim. If you are applying for a role which involves regulated activity you will need to have an Enhanced Disclosure and Barring Service (including Barred Lists) check (if in England) or become a member of the Protecting Vulnerable Groups scheme (if in Scotland). We will also seek references as part of the selection process for this role, including from your current or most recent employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wigan", "postalCode": "WN1 1HR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.546", "longitude": "-2.63559"}}, "title": "Independent Prescriber", "url": "https://www.jobs.nhs.uk/xi/vacancy/916167789", "validThrough": "2020-11-23T23:59:59+0000"}