{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 Per Annum"}}, "datePosted": "2020-08-24T11:53:55+0100", "description": "&lt;p&gt;The Older Persons Rapid Assessment Unit is a purpose built Frailty village which address the needs of frail older people within East Lancashire. The unit has nine assessment areas, nineteen in -patient beds for patients not expected to be in hospital longer than 72 hours; and a further nineteen beds for patients admitted requiring a longer stay. The purpose of the unit is to ensure that all patients are comprehensively assessed and treated prior to being discharged home whenever possible. Assessments are completed using the full MDT approach, allowing for the delivery of holistic care and an individualised discharge plan incorporating partner agencies if needed..&lt;/p&gt;\n&lt;p&gt;The unit can actively support the development of newly qualified staff, as well as those looking for a change of area in order to further increase individual knowledge and skill base&lt;/p&gt;\n&lt;p&gt;The Medicine for Older People Directorate have recently appointed a Practice Educator who is keen to promote learning and development; this would be an ideal time to join the team as peer support and learning opportunities are readily available.&lt;/p&gt;\n&lt;p&gt;The OPRA unit is looking to recruit enthusiastic, compassionate and motivated band 5 staff; those who share, and will actively promote the core values of the Trust, and wish to develop their knowledge and skills in the exciting area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dear Potential Applicant,&lt;/p&gt;\n&lt;p&gt;It is important you are made aware of the changes which East Lancashire Hospitals NHS Trust has implemented with regard to charging for the cost of undertaking Disclosure and Barring Scheme (DBS) Checks (previously known as Criminal Records Bureau or CRB) and how this may impact upon you.&lt;/p&gt;\n&lt;p&gt;As this position is exempted from the Rehabilitation of Offenders Act 1974 and involves work that is identified as a regulated activity as defined in the Safeguarding Vulnerable Groups Act (2006), any offer of employment is provisional upon a satisfactory DBS check being obtained.&lt;/p&gt;\n&lt;p&gt;The cost of an Enhanced Disclosure will be £44.00, which includes a small handling fee.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Lynsey Collinge or Laura Ashworth-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01254 732059&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;lynsey.collinge@elht.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;laura.ashworth@elht.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Blackburn Hospital, Haslingden Road, Blackburn BB2 3HH, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Staff Nurse Older Persons Rapid Assessment Unit (OPRA) C1", "url": "https://www.jobs.nhs.uk/xi/vacancy/916159481", "validThrough": "2020-11-06T23:59:59+0000"}