{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6 Agenda for change equivalent’"}}, "datePosted": "2020-08-14T08:38:51+0100", "description": "&lt;p&gt;Noah’s Ark Children’s Hospice helps seriously unwell children and their families&lt;br /&gt;make the most of the special time they have together. The majority of babies and&lt;br /&gt;children we support are unlikely to reach their 18th birthday.&lt;/p&gt;\n&lt;p&gt;With talented individuals who share our passion to improve the lives of seriously&lt;br /&gt;unwell children and their families, we&#39;re changing the landscape for paediatric&lt;br /&gt;palliative care in North and Central London, as well as Hertsmere.&lt;/p&gt;\n&lt;p&gt;We are Charity Today’s ‘Charity of the Year’ and Charity Times’ Fundraising&lt;br /&gt;Team of the Year’. Our culture is fast-paced, innovative and supportive. Based in&lt;br /&gt;The Ark, a brand new children’s hospice building set on a stunning 7.5-acre&lt;br /&gt;nature reserve in Barnet, we work to build an inclusive environment in which&lt;br /&gt;everyone, regardless of gender, race, religion, age, or background, can do their best work.&lt;/p&gt;\n&lt;p&gt;Are you looking for a role where you can develop professionally and personally, all whilst working towards something hugely positive and impactful?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a senior Band 6 Nurse to support with the line management of Nurses, Specialist Carers and students and service development, while providing clinical and holistic care and support to children and young people with life-limiting or life-threatening conditions and their families. The role will include the management of care planning, symptom control and care at the end of life.&lt;/p&gt;\n&lt;p&gt;We have now moved home and we would love for you to take a tour and meet the team, please contact Elisha Lewis (Specialist Care and Nursing Team Manager) on 020 8449 8877 / 07908951040 or email her on Elewis@noahsarkhospice.org.uk if you would like to arrange a meet and greet.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Social Enterprises", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130655"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "EN5 4NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6572", "longitude": "-.213179"}}, "title": "Nurse Team Leader Band 6 (x2 vacancies)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916148696", "validThrough": "2021-08-14T23:59:59+0100"}