{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "109830", "minValue": "82022", "unitText": "YEAR", "value": "£82,022 - £109,830 per annum, inc London Weighting"}}, "datePosted": "2020-07-15T17:45:40+0100", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust is one of the UK’s largest and busiest teaching hospitals with over 1.5 million patient contacts a year and more than 13,000 staff based across five main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s is a key partner in one of London&#39;s foremost Academic Health Science Centres, King&#39;s Health Partners (KHP). KHP is one of only six Department of Health-designated AHSCs in England. It brings together a world-leading research-led university – King’s College London – and three successful NHS Foundation Trusts: King’s College Hospital, Guy’s and St Thomas’, and South London and Maudsley.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity to be a part of our dedicated workforce and join one of the largest and most successful Foundation Trusts in the UK with an international reputation for innovation and the desire to make a difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An opportunity has arisen to join the virology consultant team at King’s College Hospital based at Denmark Hill as a 10 PA consultant. This is one of three new Infection Sciences consultant posts recently created at King’s College Hospital: two in Microbiology and one in Virology [this post]. This expansion underscores the Trust’s commitment to continue to deliver world class Infection services for our patients, representing one of the most complex case mixes of any teaching hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition to providing a broad range of services to the local community, the hospital also has a large number of Regional services covering the Southeast and a number of national and internationally recognised specialist services including Haemato-Oncology that provides bone marrow transplantation and CAR-T cell programmes, Neurosciences, Paediatric and Adult Liver Transplantation, Cardiac and Foetal Medicine.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Trust our ambition is to be an outstanding local hospital for the local community and a world-class centre of specialist clinical and research excellence. Additionally, we work with King’s College London to offer training, education and clinical placements for medical, nursing and dental students. We are also proud to be a founding member of King’s Health Partners, a collaboration to deliver bench to bedside solutions to improve patient health and wellbeing.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking to recruit a highly motivated consultant either with dual accreditation CCT in both Infectious Diseases and Virology or Virology-only CCT or equivalent to be eligible for interview.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The South London Specialist Virology Centre within Viapath Infection Sciences at KCH is a UKAS ISO 15189:2012 accredited department. The large serology and molecular diagnostics service has been developed to ensure a full portfolio of tests are available to achieve a rapid diagnosis in a complex patient population.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is the one of three first-ever posts with an Infectious Diseases component in King’s. The post-holder is expected to work particularly closely with the Haematology team with respect to the Transplant Infection service. The post is based on the Denmark Hill site but the post-holder may be asked to work on and provide support at the Princess Royal site in Bromley if required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The postholder will have regular contact with vulnerable adults and/or children (0-18 years), therefore this post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975, and as such, it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service to check for any previous criminal convictions.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Potential applicants are welcome to visit the department and discuss this post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;Name: Dr Silke Schelenz&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Lead for Infection&lt;/p&gt;\n&lt;p&gt;Email address: silke.schelenz@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Malur Sudhanva, Consultant Virologist and Clinical Director of Viapath KCH laboratories msudhanva@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Mark Zuckerman, Consultant Virologist and Head of Department mark.zuckerman@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Victoria Potter, Haematology Transplant Director victoriapotter@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 18/11/2020, midnight.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AAC Interview Date: 01/12/2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Consultant Virologist and Infectious Diseases Physician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916114383", "validThrough": "2020-11-18T23:59:59+0000"}