{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27047", "minValue": "27047", "unitText": "YEAR", "value": "£16.09"}}, "datePosted": "2020-09-02T10:34:23+0100", "description": "&lt;p&gt;We are currently seeking Bank &lt;strong&gt;Staff Nurses &lt;/strong&gt;to join our Specialist Brain Injury Neurological Care &amp; Rehabilitation Service at &lt;strong&gt;Hothfield Brain Injury Rehabilitation &amp; Neurological Care Centre, &lt;/strong&gt;located in&lt;strong&gt; Hothfield &lt;/strong&gt;just 3 miles from&lt;strong&gt; Ashford, Kent.  &lt;/strong&gt;We would be delighted to speak to you If you’ve previously worked for the&lt;strong&gt; NHS.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working with The Huntercombe Group is rewarding and varied. Through our “Conversation into Action” programme we actively encourage our employees to get involved and to drive organisational change for the better.&lt;/p&gt;\n&lt;p&gt;The centre is a 32 bed facility providing &lt;strong&gt;specialist &lt;/strong&gt;short-term and long-term person-centered rehabilitation, therapy and support for adults with either &lt;strong&gt;a brain injury or other complex&lt;/strong&gt; &lt;strong&gt;neurological conditions&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We also care for patients who are no longer able to be cared for at home but who with some specialist help can take part in everyday activities and live as independently as possible.&lt;/p&gt;\n&lt;p&gt;Situated within 12 acres, our service offers intense rehabilitation for adults in the post-acute phase following a brain injury.&lt;/p&gt;\n&lt;p&gt;The centre is located in the &lt;strong&gt;village of Hothfield, 3 miles from the busy town of Ashford.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our &lt;strong&gt;Staff Nurses&lt;/strong&gt; play an instrumental role in the lives of individuals, supporting and encouraging them to achieve their goals and ambitions.&lt;/p&gt;\n&lt;p&gt;When you join The Huntercombe Group as a &lt;strong&gt;Staff Nurse (RNA)&lt;/strong&gt;, you will be part of a company that is &lt;strong&gt;understanding&lt;/strong&gt;, &lt;strong&gt;strives towards excellence&lt;/strong&gt;, is &lt;strong&gt;innovative&lt;/strong&gt;, &lt;strong&gt;reliable&lt;/strong&gt; and &lt;strong&gt;accessible&lt;/strong&gt; and above all &lt;strong&gt;puts people first&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Staff Nurse &lt;/strong&gt;working in our Specialist Brain Injury Neurological Care and Rehabilitation Service, your main duties will be:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;To provide high standards of nursing and therapeutic care in the rehabilitation of brain injured patients; and through membership of the multi-disciplinary team, provide supervision and guidance to Rehabilitation Assistants.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To assess and deliver effective individual care and treatment towards the rehabilitation of service users&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To undertake the role of named nurse&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To actively participate in clinical meetings promoting, reviewing and initiating relevant changes to service user care&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To effectively co-ordinate the shift, including allocation of service users, supervision of Rehabilitation Assistants, and ensuring the safety of the unit&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To join The Huntercombe Group as a &lt;strong&gt;Staff Nurse&lt;/strong&gt;you will:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Hold current NMC PIN registration and adhere to the NMC Codes of Conduct at all times&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have a person centred ethos, showing empathy and a desire to make a difference&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have the ability to motivate, lead and supervise a team&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be able to demonstrate initiative and creativity&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be flexible and adaptable, well organised and able to manage time and workload effectively in line with the needs of the service&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have a desire to expand your professional development and support organisational change&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have a legal right to work in the UK&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;On completion of 3 months membership of the Flexi Bank arrangements you may automatically be enrolled into NEST Occupational Pension Scheme dependent upon your earnings.&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Continuing Professional Development (CPD)&lt;/li&gt;\n&lt;li&gt;Support for revalidation&lt;/li&gt;\n&lt;li&gt;Professional support through Nurses forum&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click &lt;strong&gt;Apply&lt;/strong&gt; now.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hothfield, nr Ashford, Kent", "postalCode": "TN26 1EL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1661", "longitude": ".814648"}}, "title": "Staff Nurse (RNA)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916168915", "validThrough": "2020-11-17T23:59:59+0000"}