{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19000", "minValue": "19000", "unitText": "YEAR", "value": "19000"}}, "datePosted": "2020-09-08T09:00:52+0100", "description": "&lt;p&gt;&lt;strong&gt;This is a full-time position of 37.5 hours per week Monday-Friday based in Erith (South-East London) paying £19,000&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The CHIS (Child Health Information Service) department stores health data for all children 0-19 on a specialised database to ensure children and young adults are offered vital immunisations and health screening. This information follows a child wherever they live in the UK. Our CHIS programme manages records for children as they move into or out of South-East London.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;So what will you do?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work within the Child Health Information Service (CHIS) to ensure that all data relating to Healthy Child, Screening and Immunisation Programmes is of the highest possible quality. Further to this you will be responsible for monitoring the completeness of data in the Child Health Information System and monitoring the data flows into and out of the CHIS. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key duties&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The post holder will be responsible for the receipt and checking of any electronic data received from: Maternity Units, Bloodspot Laboratories, Hearing Screening Providers, GP Practices, Local Authorities (school population lists), School Age Vaccinators and Health Visiting Services ensuring these are uploaded correctly onto the system to enable team members to process&lt;/li&gt;\n&lt;li&gt;Liaise with Health Visiting Teams, GP Practices and individuals to chase and correct data deficiencies highlighted in data quality reports&lt;/li&gt;\n&lt;li&gt;Monitor that all relevant datasets are received, processed and validated on time every month and that data quality issues are highlighted to the team to ensure consistency for analysis and reporting purposes&lt;/li&gt;\n&lt;li&gt;Produce weekly reports concerning missing NHS numbers, duplicates, incomplete demographic details and other discrepancies&lt;/li&gt;\n&lt;li&gt;Provide analysis by utilising appropriate query tools (e.g. Microsoft Excel, Access) for monitoring, forecasting and audit purposes.&lt;/li&gt;\n&lt;li&gt;Work with the Data Quality Manager to Implement Data Quality plans to correct erroneous data or address information or data gaps.&lt;/li&gt;\n&lt;li&gt;Monitor results for relevant Healthy Child Screening programmes identifying outstanding results and ensure follow up action&lt;/li&gt;\n&lt;li&gt;Assist in the production of data quality reports to illustrate activity and performance and to help with investigating areas of concern around information sources and definitions.&lt;/li&gt;\n&lt;li&gt;Produce datasets to provide information reporting on departmental Key Performance Indicators (KPI’s) and quality standards&lt;/li&gt;\n&lt;li&gt;Participate and cooperate with audits within the service in providing evidence e.g. pulling child records&lt;/li&gt;\n&lt;li&gt;Implement Trust policies and develop work practice for own work environment and implements procedures set by others&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you will need to succeed in this role&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A range of IT applications including Microsoft Office&lt;/li&gt;\n&lt;li&gt;High levels of attention to detail&lt;/li&gt;\n&lt;li&gt;The ability to communicate with a wide range of professionals&lt;/li&gt;\n&lt;li&gt;Enjoy working flexibly within a busy team&lt;/li&gt;\n&lt;li&gt;An inquiring mind to follow-up inconsistencies and gaps in records&lt;/li&gt;\n&lt;li&gt;Capable of understanding and working within processes and protocols guideline&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Intelligence Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Erith", "postalCode": "DA1"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4469", "longitude": ".206297"}}, "title": "Data Quality Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916175698", "validThrough": "2020-11-23T23:59:59+0000"}