{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-07-16T10:30:46+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you a Student Nurse due to qualify in March 2021 or September 2021 and looking for your first post?&lt;/em&gt;&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Then look no further as here at East Lancashire Hospitals NHS Trust we can offer post qualification roles within a variety of specialisms within our Surgical team. &lt;br /&gt;&lt;br /&gt;We know your first post is critical to help embed all your learning and so have developed a 12 month preceptorship programme to help with this transition from student to a newly qualified health professional. &lt;br /&gt;&lt;br /&gt;We have many reasons that make us proud to work at ELHT and below is just a highlight of some of them &lt;br /&gt;&lt;br /&gt;• 2015 saw the Trust in the top 25 out of 135 in a national league table of how staff feel about working for their organisation, and the quality and safety of the care they are able to deliver. The assessment was made against 20 key findings from the national staff survey.&lt;br /&gt;&lt;br /&gt;• ELHT was included in a shortlist of the 100 ‘Best Places to Work’ compiled by the Health Service Journal and Nursing Times. The Trust was also one of only 42 selected of Acute Trusts nationally recognised by the publications as leading the way as the best place to work. &lt;br /&gt;&lt;br /&gt;• Building on the development of our first dementia friendly ward in 2014 (C5), the dedication of staff on this ward, resulted in them being awarded the prestigious Quality Mark in 2015 based on reviews submitted by patients. Run by the Royal College of Psychiatrists, the Quality Mark was established to encourage hospital wards to become involved in improving the quality of essential care of older people and to recognise good care provision, as identified by patient feedback.&lt;br /&gt;&lt;br /&gt;• Patients in Kendal and surrounding areas are now able to get quicker diagnosis and treatment for any vascular problems from a specialist clinic run by skilled surgeons from East Lancashire Hospitals NHS Trust on their doorstep. Following a major regional re-organisation of vascular services 18 months ago in Lancashire and Cumbria, East Lancashire Hospitals NHS Trust was designated as a Vascular Centre of Excellence. &lt;br /&gt;&lt;br /&gt;So you can see why you need to think seriously about what working at East Lancashire Hospitals NHS Trust could do for your career. &lt;br /&gt;&lt;br /&gt;To make the process as simple as possible we suggest that you start to apply for a post, up to 6 months prior to completing your course. Clicking on the link below takes you to our online application form. &lt;br /&gt;&lt;br /&gt;Complete this and you will then be invited to interview at our regular recruitment events.&lt;br /&gt;&lt;br /&gt;At this stage we will be seeing that you are suitable to join the trust and hopefully make you a conditional offer of a job with us. &lt;br /&gt;&lt;br /&gt;At the interview we will gather any preferences that you may have as regards your first post but we are conscious that with 6 months left of your course these could still change. Therefore about 3 months before you qualify you will be asked to confirm your preferred area to work in. Once we have everyone’s preferences we will then allocate accordingly. We work hard to make sure that you are happy with your first posting and are happy to consider rotational post also. &lt;br /&gt;&lt;br /&gt;Even after you have started with us there will be opportunities to rotate with the various areas and develop your skills. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The areas covered by this programme are listed below;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Head &amp; Neck&lt;/li&gt;\n&lt;li&gt;Urology&lt;/li&gt;\n&lt;li&gt;Upper GI&lt;/li&gt;\n&lt;li&gt;Colorectal &amp; HPB&lt;/li&gt;\n&lt;li&gt;Vascular Unit&lt;/li&gt;\n&lt;li&gt;Orthopaedic Planned, Elective &amp; Trauma&lt;/li&gt;\n&lt;li&gt;Ophthalmology&lt;/li&gt;\n&lt;li&gt;Emergency Surgical Unit&lt;/li&gt;\n&lt;li&gt;Theatres&lt;/li&gt;\n&lt;li&gt;Elective Centre at BGH&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:Name: Nicola WhittakerJob title: Lead Practice Development Nurse - Surgical and Anaesthetics ServicesEmail address: Nicola.Whittaker@elht.nhs.ukTelephone number: 01254 732291&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across East Lancashire Sites, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Staff Nurse (Surgical) For Students Due To Qualify", "url": "https://www.jobs.nhs.uk/xi/vacancy/916114754", "validThrough": "2020-11-23T23:59:59+0000"}