{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-09-03T16:06:47+0100", "description": "&lt;p&gt;&lt;strong&gt;THE ROTHERHAM NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Barnsley and Rotherham Integrated Laboratory Services (BRILS)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;CONSULTANT MICROBIOLOGIST&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are sought from enthusiastic Consultant Microbiologists. The successful applicant will complement and strengthen the current Microbiology Services between Barnsley &amp; Rotherham Integrated Laboratory Service (BRILS). The Rotherham NHS Foundation Trust is the main site and there will be a requirement to undertake duties at Barnsley NHS Foundation Trust as part of the formal partnership between the Pathology Laboratories.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The candidate will participate in a UKNEQAS interpretive comments scheme (which will be funded by the Trust). The Job Plan will cover a broad range of duties with available resources that is expected from a service covering a population of half a million between the two sites. There will be a requirement for &lt;/span&gt;&lt;span&gt;the successful candidate to &lt;/span&gt;&lt;span&gt;provide supervision of the Laboratories and provide clinical advice in the diagnosis, treatment and prevention of infections to both the hospital and community settings. &lt;/span&gt;&lt;span&gt;Further details of the post are comprehensively covered in the Job Description.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The appointee will benefit from a spacious, well-appointed office and secretarial support will be provided. You will become part of a dynamic and friendly team working within a well-established department. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The department has close links with The Sheffield NHS Teaching Hospital and there are opportunities to pursue honorary academic positions within Sheffield University.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Rotherham Foundation Trust is currently one of five Trusts involved in the South Yorkshire and Bassetlaw (SYB) Pathology Transformation Programme. &lt;/span&gt;&lt;span&gt;The aim is to design a Pathology Service that provides all SYB patients and clinicians with equitable access to high-quality, innovative laboratory medicine solutions that will ensure the best clinical outcomes for patients.&lt;/span&gt;&lt;span&gt;The service will also be efficient and sustainable, encourage research and development in collaboration with Acadaemia and Industry to improve health and wealth in the region and provide rewarding jobs and career opportunities for all staff.&lt;/span&gt;&lt;span&gt;The Transformation Programme may include the consolidation of some services.&lt;/span&gt;&lt;span&gt;Staff will be consulted about proposals that may involve them.&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Prospective candidates are strongly encouraged to visit the department; for further information, and to arrange a visit, please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Felix Williams: 01709 42 6552&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Consultant in Microbiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916171769", "validThrough": "2020-11-12T23:59:59+0000"}