{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 Per Annum, Pro Rata"}}, "datePosted": "2020-09-07T10:16:42+0100", "description": "&lt;p&gt;&lt;em&gt;Proud to wear our purple uniform&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Someone once called our team the ‘Backbone of our Hospitals’ and it has certainly stuck! We couldn’t run our hospitals without you and the fantastic work you will do keeping our wards, departments and areas clean, tidy, reducing the risk of infections and effectively helping keep our staff well and our patients safe.&lt;/p&gt;\n&lt;p&gt;We know you will love the work you do, seeing how you make such a big impact in keeping everything ticking over smoothly, your dedication will shine through. We want you to be proud to wear the purple coloured domestic assistant uniform, feeling a strong and vital part of our hospital team – knowing you are working side by side on the front-lines making a HUGE difference every single day.&lt;/p&gt;\n&lt;p&gt;In a nutshell, your duties will include general cleaning of the wards, public and staff areas, on a rota with your colleagues as part of our Domestic Team. As you would expect, we do have set cleaning standards and NHS guidelines to work towards, so whilst there is no experience required, we will fully train you on all of this. The work can be physically demanding and we don’t shy away from this, however, we know that this will also be what motivates you.&lt;/p&gt;\n&lt;p&gt;A lot of the things we have to intensively clean are below waist height as they are often areas which need the most attention. Pesky bits of dirt would thrive there if our team members didn’t do such a great job cleaning them and keeping them spick and span.&lt;/p&gt;\n&lt;p&gt;Of course we want you to be friendly, reliable and conscientious as this role isn&#39;t just about vacuuming and cleaning, it’s about being part of a whole team of staff working together to ensure the best environment for our patients to receive their treatments.&lt;/p&gt;\n&lt;p&gt;Go home at the end of your shift knowing you played your part in making our hospitals a great place to be cared for. We have a variety of shift patterns available, so welcome you to state on your application form what kind of hours you are looking for.&lt;/p&gt;\n&lt;p&gt;There are all sorts of training opportunities to ensure you have all the right knowledge to do the role and we actively encourage you to develop and support you to progress within the organisation if that’s what you are looking for.&lt;/p&gt;\n&lt;p&gt;In particular we are looking for motivated individuals that are able to work in both clinical and non-clinical areas for various shift patterns covering both day and evening shifts.&lt;/p&gt;\n&lt;p&gt;There are various shifts available over 24 hour 7 days a week , part time &amp; Full time shifts available.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namecarole GregsonJob titleFacilities Support ManagerEmail addresscarole.gregson@lthtr.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Carole Gregson&lt;/span&gt;&lt;/span&gt; - &lt;span&gt;&lt;span&gt;Facilities Support Manager, carole.gregson@lthtr.nhs.uk &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Domestic Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916174201", "validThrough": "2020-11-20T23:59:59+0000"}