{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39335", "minValue": "34208", "unitText": "YEAR", "value": "Day £23.40   Nights/Sat: £20.35 Sun/BH: £25.05"}}, "datePosted": "2020-09-08T09:11:41+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Theatre Practitioners– RN / Scrub / Recovery &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade: &lt;/strong&gt;Scrub Nurses and Recovery Nurses Band 5&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Mid Yorkshire Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wards Covered:&lt;/strong&gt; Maternity and MainTheatres; Ophthalmology, Urology, Orthopaedics&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Opportunity:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you want first choice of shifts at a Trust offering a range of highly specialist services to patients across West Yorkshire?&lt;/p&gt;\n&lt;p&gt;Do you want more flexibility and a better work-life balance?&lt;/p&gt;\n&lt;p&gt;We are looking for motivated and enthusiastic Theatre Practitioners, experienced within the fields of Anaesthetics, Scrub and Recovery to join the NHSP staff bank at Mid Yorkshire Hospitals Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have access to first choice of shifts to suit your lifestyle, with the opportunity to bring your skills to a leading trust, renowned for their friendly culture, person-centred care, specialist services and convenient location.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mid Yorkshire Trust Hospitals are Pinderfields in Wakefield, Dewsbury and District Hospital and Pontefract. A Trust providing acute hospital and community-based healthcare services to a population of around 430,000 to 512,000 people in West Yorkshire, why not join a dedicated team of over 8000 staff who deliver outstanding care and work together to achieve the highest possible standards for their patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Theatre Practitioners are key to the smooth running of each theatre. ODPs will work closely with Scrub Nurse to ensure that everything the Surgeons and Anaesthetists need each day is ready and available. ODPs will then assist in Theatre and make sure the patient has everything they may need post operatively.&lt;/p&gt;\n&lt;p&gt;You are expected to deliver safe quality care for patients during their peri-operative phase of care.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to have experience of working in Theatres in Scrub, Anaesthetics or Recovery and associated specialist qualification is essential. You will be able to show evidence of continuing professional development and hold a relevant degree.&lt;/p&gt;\n&lt;p&gt;As a Scrub Nurse you will assemble, check, prepare, and coordinate the use of surgical equipment, drugs and consumables for a wide range of operative procedures.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will also act in the circulating role and assist in the safe transfer and positioning of the patient.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are ideally looking for applicants with experience in the following remits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ophthalmology&lt;/li&gt;\n&lt;li&gt;Urology&lt;/li&gt;\n&lt;li&gt;Orthopaedics&lt;/li&gt;\n&lt;li&gt;Maternity&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return&lt;/strong&gt; for your hard work NHSP can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates – currently incentivised to a rate higher than AFC Band 5 &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of shifts at your Trust&lt;/strong&gt; – Access to shifts before they are available to agency&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working to suit your lifestyle &lt;/strong&gt;– Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance for every shift you work &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book and manage your shifts on the go&lt;/strong&gt; – Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03332 407 552&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have a minimum of 6 months paid experience as a Scrub Nurse at Band 5 level in an acute hospital / theatre environment within the last 2 years&lt;/li&gt;\n&lt;li&gt;Comply with NMC /HCPC Professional Registration and keep up to date with current nursing practices&lt;/li&gt;\n&lt;li&gt;Undertake nursing assessment and evaluation to enable development of appropriate plans of care based on the needs of the individual&lt;/li&gt;\n&lt;li&gt;Be proficient in the delivery of care to patients, ideally experienced within Orthopaedics, Ophthalmology and/or Urology but we are not limited to recruiting solely in these areas.&lt;/li&gt;\n&lt;li&gt;Ensure safe administration of drugs in accordance with NMC and CHS policies&lt;/li&gt;\n&lt;li&gt;Ensure accurate records are kept in accordance with Mid Yorkshire’s policy and NMC guidelines&lt;/li&gt;\n&lt;li&gt;Carry out nursing procedures and techniques in accordance with agreed policies and standards&lt;/li&gt;\n&lt;li&gt;Undertake regular mandatory training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Register today for various flexible shifts, you choose when you want to work.&lt;/p&gt;\n&lt;p&gt;For more information on the role or details on how to join NHS Professionals, simply get in touch with Kerry Fox; Trust Recruitment Coordinator, via email Kerry.Fox@NHSprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Yorkshire", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Theatre Practitioners - RN / Scrub / Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916175713", "validThrough": "2021-01-31T23:59:59+0000"}