{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 2"}}, "datePosted": "2020-09-22T15:46:27+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you a looking for flexible bank opportunities to fit around your lifestyle? Are you a thoughtful and dedicated Hotel Services Assistant based in the Colchester area?If the answer is yes, we are looking for you !&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This postholder will support Hotel Services to deliver a professional, efficient and cost effective service with regards to cleaning and the delivery of patient meals at Colchester Hospital.&lt;/p&gt;\n&lt;p&gt;The postholder will be required to adhere to specific cleaning and caterings tasks without supervision, using the materials and equipment as they have been trained and instructed by the Facilities Coordinator. They will require a good understanding of COSHH and responsibilities for due diligence within the role&lt;/p&gt;\n&lt;p&gt;The postholder will be required to engage with ward &amp; departmental staff, colleagues, line managers, patients, relatives and other stakeholders and to deliver the highest standards of customer care and service to ensure a pleasant, safe, clean and welcoming environment&lt;/p&gt;\n&lt;p&gt;Please be aware you may be required to work in/around Covid areas, PPE and training will be provided should you be successful at interview&lt;/p&gt;\n&lt;p&gt;NHS Professionals is run by the NHS, for the NHS&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works inpartnership with hospital truststo provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. Working through the NHSP bank means trusts don’t have to rely on expensive agencies.&lt;/p&gt;\n&lt;p&gt;Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.We serve Acute, Mental Health and Community Trusts across England, along with Social Enterprises.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester Hospital", "postalCode": "CO4 5JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9102", "longitude": ".899214"}}, "title": "Housekeeping - Colchester Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916195600", "validThrough": "2020-11-30T23:59:59+0000"}