{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Salary plus Benefits"}}, "datePosted": "2020-08-31T11:29:31+0100", "description": "&lt;p&gt;BMI Healthcare is the UK’s largest provider of independent healthcare. With a network of hospitals across the country, our aim is to attract the best nursing, theatre and allied healthcare professionals in addition to employing outstanding non-clinical and support staff who underpin everything we do. Being part of the wider BMI Healthcare group also offers the prospect for great career progression with opportunities throughout the UK.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be part of developing our services for the future……&lt;/p&gt;\n&lt;p&gt;Located in central Birmingham BMI Birmingham has embarked on a journey to integrate The BMI Priory and the BMI Edgbaston hospital into BMI Birmingham, taking the best in class to create a two site, single hospital, delivering outstanding care in the right location.&lt;/p&gt;\n&lt;p&gt;The Priory hospital offers a range of routine, non-urgent, complex surgical and medical services, including cardiac, through 118 registered beds, 5 theatres and Cardiac Catheterisation laboratory. The hospital also benefits from being the only independent sector hospital within a 70 mile radius that delivers level 3 critical care with a 6 bed ITU facility. These facilities enable The Priory Hospital to offer unique and niche services to a larger catchment of private patients than a traditional independent hospital. The Edgbaston Hospital offers a similar range of routine and non-urgent services through 55 registered beds and 3 theatres&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In addition to working for a leading independent hospital in Birmingham, our staff benefit from a strong level of commitment to training and development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently recruiting for an experienced and committed Registered Nurse to join our fantastic team of staff in our Ward department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We want our patients to continue to have a safe, effective and caring experience therefore the successful candidate will put patient care at the heart of everything they do.&lt;/p&gt;\n&lt;p&gt;As a qualified practitioner with NMC registration you will use your skills and knowledge to work well within a team, adopting a flexible and collaborative approach at all times. If you are an enthusiastic, highly motivated Registered Nurse with proven skills in general nursing you will find a place to thrive at BMI Healthcare.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please see attached Job Description for further detailed responsibilities &amp; accountabilities of this role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full time post and there is a flexible shift pattern in place.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join the BMI Healthcare journey and become part of a team where people matter&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BMI Healthcare offers a very competitive starting salary of up to £26,000.&lt;/strong&gt;Employee benefits for contracted staff also include 25 days holiday + bank holidays, Pension scheme, Private health insurance, discounted gym membership and many more exclusive discounts and incentives via our “Perks at Work” scheme – we also have free parking at most of our hospitals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are also committed to providing ongoing training and development to our staff via our dedicated in-house BMI Academy which offers one of the most comprehensive packages of training courses available in the private sector.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like any further information or an informal chat before applying then please contact Dolly Baht on 0121-452-2883.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Owing to the nature of this position, any offer of employment will be subject to a satisfactory&lt;/strong&gt;&lt;strong&gt;Enhanced Disclosure Check&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Safeguarding&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;BMI Healthcare is fully committed to safeguarding the welfare of all children and young people, and vulnerable adults by taking all reasonable steps to protect them from harm. All staff will receive appropriate training and induction so that they understand their roles and responsibilities and are confident about carrying them out.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BMI Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B5 7UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4564", "longitude": "-1.91142"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916166756", "validThrough": "2020-11-29T23:59:59+0000"}