{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "38000", "unitText": "YEAR", "value": "£38,000"}}, "datePosted": "2020-08-27T13:55:23+0100", "description": "&lt;p&gt;&lt;strong&gt;The Disabilities Trust are hiring a Physiotherapist in Leeds!&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;We are looking for a highly motivated Physiotherapist to join the clinical team at our brain injury service on a FTC until the end of March 2021.&lt;br /&gt;&lt;br /&gt;We are a purpose built unit with a physio gym area and a team of support workers to help with your treatment plans and actions.&lt;br /&gt;&lt;br /&gt;You will be part of a clinical team who help support the rehabilitation of those who are being discharged from hospital but require continued period of assessment to reach their best potential following their brain injury.&lt;br /&gt;We have a mix of short and long term service users with varying levels of need.&lt;br /&gt;&lt;br /&gt;You will be expected to help support assessments of referrals, manage your own caseload and support the clinical team with the progression and rehabilitation of our service users. We take referrals from all areas however most come from the local areas around Leeds.As part of the team you will helping shape and develop the service for the future alongside the service manager. This is an exciting time at Daniel Yorath House as we have big dreams and goals, if you are someone who is confident in their practiceand looking for new role that will offer challenge and satisfaction we are definitely the place for you.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Essential Criteria:&lt;/strong&gt;&lt;br /&gt;All candidates must be HCPC registered and hold a diploma or degree within Physiotherapy. You need to be experienced in your discipline. There is a clinical team but you are the only physiotherapist.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We&#39;re offering a great benefits package for the right person:&lt;/strong&gt;&lt;br /&gt;- A competitive salary of up to £38,000&lt;br /&gt;- 38 days holiday per year plus bank holidays, pro rata&lt;br /&gt;- Group life assurance&lt;br /&gt;- Access to nationwide staff discounts for shopping, entertainment, leisure through Perkbox&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Disabilities Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS25 2HA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7837", "longitude": "-1.37675"}}, "title": "Physiotherapist - Leeds", "url": "https://www.jobs.nhs.uk/xi/vacancy/916164523", "validThrough": "2020-11-27T23:59:59+0000"}