{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 (dependent on experience)"}}, "datePosted": "2020-09-08T14:52:41+0100", "description": "&lt;p&gt;&lt;strong&gt;Blood Sciences – Southwest Pathology Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Are you looking for a rewarding career in a state-of-the-art laboratory, situated in the heart of Somerset, which offers customer centric medical excellence?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In addition to a competitive pay structure, we offer a joining bonus of up to £5,000 and an annual competency bonus of up to £5,000.&lt;/p&gt;\n&lt;p&gt;Integrated Pathology Partnerships (iPP) is open to flexible working and also offers enhanced leave options, contributory pension scheme as well as MySYNLAB Benefits which provides a great range of discounts on: travel bookings, high street vouchers, gift cards, days out, leisure activities and day to day spending.&lt;/p&gt;\n&lt;p&gt;Inthe heart of the West Country, Somersetis a destination ofdramatic coastline, seaside resorts, epic English countryside including designated areas of outstanding natural beauty, and historic places. Somerset’s lively County Town of Taunton provides you with a genuine and special Somerset experience. Whereas, Yeovil, situated on the Somerset/Dorset border has a selection of modern shops only minutes away from the breath-taking beauty of the surrounding countryside. Both towns offer a fantastic mix of shops, restaurants and leisure facilities, with the added benefit of transport links with the M5, A303 and the Paddington-Penzance rail line.&lt;/p&gt;\n&lt;p&gt;Our teams are fundamental to the principle of making a positive difference to healthcare and you will receive regular training and coaching to develop your skills and to support you in your working life. In addition, to enable you to broaden your experience and increase the depth of your knowledge, thus improving your career potential, we train our scientific and support staff to work in a multi-disciplinary environment and facilitate the rotation of staff amongst key laboratory areas.&lt;/p&gt;\n&lt;p&gt;iPP is a wholly-owned subsidiary of SYNLAB, the European leader in delivery of high-quality pathology testing and imaging services and operates the Southwest Pathology Services contract (“SPS”) which is a joint venture between Yeovil District Hospital NHS Foundation Trust, Taunton and Somerset NHS Foundation Trust and Integrated Pathology Partnerships Ltd.&lt;/p&gt;\n&lt;p&gt;Our Laboratory holds ISO15189 UKAS accreditation is an HCPC approved training laboratory. We take a leading technological approach with a state-of-the-art automated track and analytical systems in Blood Science, Digital slide scanning and Cerebro Tracking system in Histology and Kiestra TLA in Microbiology.&lt;/p&gt;\n&lt;p&gt;We are currently seeking enthusiastic HCPC Registered Biomedical and Specialist Biomedical Scientists to operate within a multi-disciplined environment (Blood Transfusion, Haematology and Biochemistry) and applications are sought from self-motivated candidates who can offer the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Greater than 2 years post HCPC registration with experience of working in a biomedical laboratory at post graduate level ideally with cross disciplinary experience, with good current working knowledge of automated techniques and practices in Biochemistry/Haematology/Coagulation and Blood Transfusion.&lt;/li&gt;\n&lt;li&gt;To operate at Band 6, you will also demonstrate experience to post graduate diploma level e.g.: Specialist portfolio, BBTS.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate(s) dependent on experience would operate across our Hub laboratory in Taunton and our Essential Service Laboratories (ESL’s) at Musgrove Park Hospital and Yeovil District Hospital that operate a 24/7 service.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close any adverts once we have received a sufficient number of applications. If you decide to apply for this post but do not hear back from us within two weeks of your application, please assume that you have not been short-listed on this occasion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;iPP is a committed equal opportunities employer and does not unlawfully discriminate on the basis of any status or condition protected by applicable UK employment law.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Applicants must currently have permission to work in the UK.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Integrated Pathology Partnerships Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133114"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Somerset", "postalCode": "TA1 2LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0151", "longitude": "-3.08099"}}, "title": "Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916176958", "validThrough": "2020-12-31T23:59:59+0000"}