{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-07-07T13:30:15+0100", "description": "&lt;p&gt;&lt;span&gt;Consultants to provide clinical leadership in a dynamic multidisciplinary team in Basingstoke and North OPMH services . &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This 10PA OPMH Community post has been reconfigured recently as part of an exciting transformation project re designing how services are delivered to the Basingstoke and district locality. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will work alongside five Consultant Psychiatrists, an associate specialist, a higher trainee, two Section 12 Approved Specialty Doctors, an FY1 and an FY2 doctor within a multidisciplinary team providing Older Persons Mental Health Care to the Basingstoke and District locality, a combined population of approximately 40,000 people over the age of 65 years. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post is part of a redesign of the OPMH services which includes development a new memory assessment service, an in-reach services into local care homes, OPMH liaison services to the acute hospital and inpatient services (a functional and an organic ward ) at Parklands Hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post aligns with local Primary Care Networks to facilitate closer working with primary care colleagues and hence responsiveness to our local population. &lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;SHFT has a strong ethos on learning and development for medical staff &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Flexible working and less than full time applications supported&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that GMC registration (with a licence to practice) and right to work in the UK are essential for this role. Successful applicants will already have GMC registration or will be able to demonstrate they are eligible. Applicants requiring Tier 2 sponsorship should ensure they meet the Home Office application criteria prior to submitting an application.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For futher information please contact Dr Tracey Eddy. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke", "postalCode": "RG24 9RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2827", "longitude": "-1.11187"}}, "title": "Consultant in Older People&#39;s Mental Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916104305", "validThrough": "2020-11-20T23:59:59+0000"}