{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "40000", "unitText": "YEAR", "value": "£40,000 pro rata"}}, "datePosted": "2020-09-24T15:35:29+0100", "description": "&lt;p&gt;Are you looking to broaden your clinical experience outside of the NHS? Perhaps you have worked with military veterans and would like to know more about mental healthcare for serving military personnel? In this civilian post you will be delivering occupationally-focused mental healthcare within the Ministry of Defence whose purpose is to protect the people of the UK, prevent conflict, and be ready to fight our enemies. Experience of working with military populations would be welcome but it is by no means a pre-requisite for application. Your interest, enthusiasm and commitment are more important!&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a part time Clinical Psychologist to join the Defence Clinical Psychology Service (DCPS), a team of clinical psychologists and psychological therapists working within military Departments of Community Mental Health (DCMH) and specialist services throughout the UK. DCMHs are multi-disciplinary teams comprising military and civilian staff: psychiatrists, mental health nurses, social workers, mental health practitioners and psychologists. The job is challenging and varied. Whilst there are similarities with NHS roles, to make the most of this opportunity you will need to be willing to embrace a different organizational culture, take on wider team responsibilities and draw on your applied psychological knowledge and expertise. For example, you could find yourself running group programmes with military colleagues, completing small scale QIP, audit or research, working with the Navy, Army and RAF to promote psychological wellbeing, teaching and training military GPs, hosting a third-year specialist trainee clinical psychologist or introducing and evaluating a new (to MOD) mode of therapy delivery. We have a strong professional structure led by a Head of Service/Defence Consultant Advisor in Clinical Psychology and regular opportunities to meet and train as a professional community of practice.&lt;/p&gt;\n&lt;p&gt;The successful applicant for this role will work with a part time Clinical Psychology colleague under the line management of the consultant clinical Psychologist, to manage, develop and contribute to clinical psychology and psychological therapy provision within the catchment area for DCMH Plymouth. You will provide advice, training, consultation and supervision to other clinical psychologists / psychological therapists and wider team colleagues as required. It is desirable for you to have at least 2 years post-qualification experience as a qualified clinical/ counselling psychologist, ideally in adult mental health. Formal training in one of the cognitive therapies will be of value in this role. There may be an opportunity to deliver part of your role from another site within the catchment area for the team if that meets the clinical need and is more convenient for you.&lt;/p&gt;\n&lt;p&gt;Postholders will take full responsibility for working with (mainly) complex presentations across the designated service sector but also be able to apply/develop their own areas of clinical expertise and interest. You will be expected to contribute to supervision, audit, research, service development, teaching &amp; training activities locally and across the MOD as a member of DCPS. Supervision and professional support will be provided by the DCPS community of practice whose members have extensive experience of delivering clinical services within the military, NHS and third sector. We have a strong track record for providing on-going training in psychological therapies including CBT, DBT, EMDR, CAT, CPT, CFT, mindfulness and Neuropsychology. We have links with Doctorate Clinical Psychology courses and host specialist third year training placements. Uniquely, you will also be able to take advantage of the support and development opportunities open to you as a member of the Civil Service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have access to several additional benefits including a generous annual leave allowance, enhanced maternity, paternity and adoption leave as well as reimbursement of some professional fees and subscriptions. Work-related travel expenses are reimbursed and overseas travel is sometimes possible. You will be able to access on-site Messing and gym facilities.&lt;/p&gt;\n&lt;p&gt;This is a permanent 0.6 wte part time position for 22 hours per week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate must hold the following:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Doctoral level training in psychology or equivalent, HCPC registered as a Practitioner Psychologist, Post-doctoral training in one or more additional specialised areas of psychological practice, experience working as a qualified clinical psychologist (Band 7) and ability to evidence appropriate knowledge.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following Civil Service Behaviours:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leadership&lt;/li&gt;\n&lt;li&gt;Changing and Improving&lt;/li&gt;\n&lt;li&gt;Communicating and Influencing&lt;/li&gt;\n&lt;li&gt;Delivering at Pace&lt;/li&gt;\n&lt;li&gt;Making Effective Decisions&lt;/li&gt;\n&lt;li&gt;Working Together&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dept of Community Mental Health, Seymour Block, HMS Drake, HM Naval Base, Devonport, Plymouth, PL2 2BG", "postalCode": "PL2 2BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3903", "longitude": "-4.18126"}}, "title": "C1 Principal Clinical Psychologist (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916199273", "validThrough": "2020-11-11T23:59:59+0000"}