{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17004", "minValue": "15990", "unitText": "YEAR", "value": "15,990 to 17,004"}}, "datePosted": "2020-07-18T21:15:06+0100", "description": "&lt;p&gt;&lt;strong&gt;YorMed Ambulance Service&lt;/strong&gt; are delighted to offer twelve Emergency Care Assistant Apprenticeships commencing Monday 9th November, 2020. Emergency Care Assistants (ECAs) work with Paramedics, Ambulance Technicians and Ambulance Care Assistants as part of an emergency ambulance crew attending 999 and 111 calls.&lt;/p&gt;\n&lt;p&gt;An Emergency Care Assistant responds to all category of ambulance calls alongside their crew mate helping them to provide patients with potentially life-saving care and, where needed, getting patients to hospital. They attend every kind of accident and emergency, sometimes covering considerable distances, using expert emergency driving skills to get to the scene with the greatest speed possible.&lt;/p&gt;\n&lt;p&gt;Under the direct supervision of your clinical mentor, you will carry out essential emergency care, such as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;controlling severe bleeding&lt;/li&gt;\n&lt;li&gt;treating wounds and fractures&lt;/li&gt;\n&lt;li&gt;looking after patients with possible spinal injuries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will use a defibrillator to resuscitate patients with heart failure and will be trained to give a range of different drugs.&lt;/p&gt;\n&lt;p&gt;ECAs have to respond to any emergency situation. Many emergencies are likely to be distressing and involve people who are badly hurt and severely traumatised. For example:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;road accidents with victims who have multiple severe injuries&lt;/li&gt;\n&lt;li&gt;someone who has had a heart attack in a busy shopping centre&lt;/li&gt;\n&lt;li&gt;an elderly person who has fallen down the stairs&lt;/li&gt;\n&lt;li&gt;a case of domestic violence&lt;/li&gt;\n&lt;li&gt;a very sick baby being moved to a specialist centre&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;ECAs take relevant information from carers or others at the scene who may be highlydistressed or aggressive.&lt;/p&gt;\n&lt;p&gt;As well as driving emergency vehicles, ECAs check their vehicle at the start of and during each shift, to make sure they are clean, have fuel and are stocked with the right supplies. Other duties include completing paperwork and using communication equipment (radios and telephones) to speak to colleagues.&lt;/p&gt;\n&lt;p&gt;As well as working with paramedics, ECAs work with other members of the ambulance service, such as control room staff. They also work with doctors and with staff from the other emergency services, including the fire and rescue service and police.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The 18-month Apprenticeship covers:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;moving and handling techniques&lt;/li&gt;\n&lt;li&gt;emergency first aid&lt;/li&gt;\n&lt;li&gt;basic patient skills&lt;/li&gt;\n&lt;li&gt;safe driving techniques&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Training includes practical assessments and written exams. Once you have passed these tests, you are allocated to an ambulance region, to the North-East, North-West or Yorkshire. You work under the guidance of a trained supervisor before working unsupervised.&lt;/p&gt;\n&lt;p&gt;Duration -18 months: 6 weeks initial classroom plus 2 additional return weeks plus 4&lt;/p&gt;\n&lt;p&gt;Apprenticeship Reference -ST0627&lt;/p&gt;\n&lt;p&gt;All apprentices will receive:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Level 3 Diploma in Ambulance Emergency and Urgent Care Support&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Level 3 Certificate in Emergency Response AmbulanceDriving&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Level 2 Functional skills (if not alreadyachieved)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Care Certificate&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Pre-requisites - All students will need to be able to demonstrate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;21 years of age&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Full UK driving licence&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;GCSE English &amp; Maths&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North-East, North-West &amp; Yorkshire", "postalCode": "YO17 9QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0846", "longitude": "-.820207"}}, "title": "Emergency Care Assistant Apprenticeships", "url": "https://www.jobs.nhs.uk/xi/vacancy/916117753", "validThrough": "2020-12-31T23:59:59+0000"}