{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 plus £149 HCAS inc."}}, "datePosted": "2020-09-17T17:15:18+0100", "description": "&lt;p&gt;Division of Diagnostics, Therapies, Trauma and Orthopaedics&lt;/p&gt;\n&lt;p&gt;Department of Imaging&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Consultant Radiologist with an interest in Gynaecological, Paediatric and Urological Imaging&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants are invited to apply for the Consultant Radiologist post with a specialised interest in Gynae, Paediatric and Urology Imaging.&lt;/p&gt;\n&lt;p&gt;The Imaging Department is based at two sites, Ashford Hospital and St Peters Hospital Chertsey. The modalities include general radiography, fluoroscopy, CT, ultrasound, mammography and Intervention. The MRI service is currently provided by Alliance Medical. The Department has a Managed Equipment Service contract which ensures equipment is regularly maintained and replaced with state of the art equipment.&lt;/p&gt;\n&lt;p&gt;The purpose built Interventional suite comprises of the newly installed Philips Azurion Interventional equipment complete with XpertCT, CO2 and dose aware packages, as well as a four bed recovery unit, dedicated reporting pod and consultation room. Interventional radiology was awarded Exemplar status in 2015 which was successfully renewed in April 2019.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join a team of sixteen friendly and enthusiastic general radiologists. There will also be the opportunity to close work closely with the Consultant Surgeons and specialist nurses in the specialties.&lt;/p&gt;\n&lt;p&gt;Due to retirements and additional activity there is a requirement for another Consultant Radiologist to join this friendly and enthusiastic team with a passion for excellence.&lt;/p&gt;\n&lt;p&gt;The opportunity to report from home has been implemented to allow more flexibility in job plans and aid work life balance.&lt;/p&gt;\n&lt;p&gt;Ashford &amp; St Peters Hospitals NHS Foundation Trust is a high performing and forward looking NHS Foundation Trust, located in a pleasant area to the south west of London and on the borders of Surrey and Middlesex. Local towns include Woking, Chertsey, Walton-on-Thames, Weybridge, Staines, Bedfont, and Feltham. There are 520 beds covering a wide range of specialties, and a full range of laboratory services. The Trust has two paediatric wards with 23 beds and 2 High Dependency beds. There is a level 3 NICU and the Paediatric A/E department is the largest in Surrey. There are modern Postgraduate facilities and well stocked libraries with internet access on both sites&lt;/p&gt;\n&lt;p&gt;Applicants are required to be fully registered and must be on the GMC’s Specialist Register, or be eligible for admission to the Register within six months from the date of interview for the post.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange a visit, please contact the Clinical Directors: Dr A Chapman on 01932 722791 or Alanna Marvin, Associate Director of Imaging on 01932 722 793.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Consultant Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916190046", "validThrough": "2020-12-28T23:59:59+0000"}