{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-09-16T11:08:51+0100", "description": "&lt;p&gt;Do you want to work in a friendly, committed and established Mental Health service where your knowledge and skills will be valued? Are you a Consultant Psychiatrist with experience of working with people with Mental Health conditions? Then join the team at The Farndon Unit.&lt;/p&gt;\n&lt;p&gt;This permanent Consultant Psychiatrist (37.5 hours per week) positionwill see you join the established multidisciplinary team at The Farndon Unit in Newark which provides care for up to 48 women across low secure wards and a high dependency rehabilitation ward.&lt;/p&gt;\n&lt;p&gt;Working closely with the NHS, you will be a part of an environment which specialised trauma therapy and utilises positive behavioural support to empower recovery.&lt;/p&gt;\n&lt;p&gt;You will have a CCT in General Adult or Forensic Psychiatry as you will act as a Responsible Clinician for women on the high dependency ward and occasionally on across the low secure wards.&lt;/p&gt;\n&lt;p&gt;With excellent transport links, The Farndon Unit is commutable from Lincoln, Nottingham, Sleaford and Mansfield. &lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive annual salary&lt;/li&gt;\n&lt;li&gt;The equivalent of 30 days annual leave (pro-rata) – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newark", "postalCode": "NG24"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0713", "longitude": "-.785674"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916186858", "validThrough": "2020-11-29T23:59:59+0000"}