{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 inc Fringe HCAS"}}, "datePosted": "2020-08-03T10:10:48+0100", "description": "&lt;p&gt;&lt;span&gt;Please only apply for this post if are either newly qualified or experienced Psychological Wellbeing Practitioner and hold the IAPT specific certificate in Low Intensity Psychological Interventions.&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Mind Matters. We are a successful, well-established Improving Access to Psychological Therapies (IAPT) service and are part of Surrey and Borders Partnership NHS Foundation Trust. Mind Matters provides evidence based psychological therapies for people with common mental health problems Surrey-wide.&lt;/p&gt;\n&lt;p&gt;We are looking to recruithighly motivated, experienced and flexible Psychological Wellbeing Practitioners with the IAPT low intensity qualification to join our team and keen to receive applications from experienced/newly qualified PWPs with sound clinical experience within IAPT services. You will have a solid understanding of the IAPT programme, preferably with experience of IAPT and primary healthcare. The successful candidate will provide evidence-based Step 2 interventions in line with NICE guidance. The role will also require delivering group-based interventions.&lt;/p&gt;\n&lt;p&gt;Mind Matters Surrey IAPT service provides a service 8:30 am –8pm and flexibility regarding working hours is necessary. The post-holder is required to work a minimum of two late shifts and or Saturdays, with the need to travel to locations throughout Surrey, including; Chertsey, Woking, Guildford, Epsom, Camberley&amp; Redhill. Access to a car or willingness to travel via public transport is essential.&lt;/p&gt;\n&lt;p&gt;This is a full-time permanent post&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey (base) and various locations in Surrey including Epsom, Woking, Guildford, Redhill, Leatherhead, and Camberley", "postalCode": "KT16 9FG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3897", "longitude": "-.507488"}}, "title": "Psychological Wellbeing Practitioner (PWP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916134060", "validThrough": "2020-11-30T23:59:59+0000"}