{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum (pro rata)"}}, "datePosted": "2020-09-03T23:54:09+0100", "description": "&lt;p&gt;We are seeking to recruit an enthusiastic associate practitioner who will join our dynamic and forward looking Biochemistry team at WAHT to support the department with service development at the Alexandra Hospital in Redditch.&lt;/p&gt;\n&lt;p&gt;The Biochemistry department at Worcestershire Acute Hospitals offers a wide range of diagnostic testing facilities at both Worcester Royal Hospital and The Alexandra Hospital. The department is well equipped with Roche Cobas 8000 + 6000 and MPA/RSA systems, Cobas e411, Sebia Capillarys and Hydrasys, Tosoh HbA1c analysers, HPLC, UVIKON spectrophotometer and Optilite equipment.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work primarily at the Alexandra Hospital site in Redditch to perform tasks within the specialist sections of the department, handling a variety of specimen types performed via manual and automated techniques. The role will also involve some rotation in the Blood Sciences laboratory at the Redditch site assisting Biomedical Scientists with urgent and routine analysis of specimens on our automation platforms. Previous experience in an NHS laboratory would be essential.&lt;/p&gt;\n&lt;p&gt;The department is fully UKAS ISO15189 accredited and is an IBMS accredited training laboratory. This department offers training and development opportunities for the right candidates to further develop their skills and ambition.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information about this post, or to arrange an informal visit to the department please contact Leena Kaur Bhachu, Biochemistry Laboratory Manager on 01905 760535 or email harlovleen.kaur@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Band 4 Associate Practitioner in Biochemistry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916172040", "validThrough": "2020-11-10T23:59:59+0000"}