{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-09-24T11:02:25+0100", "description": "&lt;h1&gt;&lt;strong&gt;&lt;strong&gt;Vita Health Group&lt;/strong&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £38,890 - £44,503 (Band 7 equivalent) pro rata, per annum, depending on skills and experience.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at Vita Health Group one of our many strengths is our proven track record and &lt;strong&gt;success with remote working&lt;/strong&gt;. While we’re very much aware and understand concern about &lt;strong&gt;Covid-19&lt;/strong&gt;, we want to reassure you that as an organisation we endeavour to protect our customers and our colleagues in line with advice issued by Public Health England. With this in mind, with immediate effect, &lt;strong&gt;all interviews will take place via telephone or Skype&lt;/strong&gt; until such time that the current situation changes.&lt;/p&gt;\n&lt;h2&gt;Would you like:&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;To work for an award-winning specialist healthcare company that is dedicated on improving and delivering services rather than delivering the same for less?&lt;/li&gt;\n&lt;li&gt;Outstanding personal development and CPD opportunities?&lt;/li&gt;\n&lt;li&gt;Flexibility that enables you to balance your work life and personal commitments?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you answered yes to the above Vita Health Group is your perfect next employer!&lt;/p&gt;\n&lt;h2&gt;The Role:&lt;/h2&gt;\n&lt;p&gt;We are looking for a High Intensity CBT Therapist to work within our IAPT (&lt;em&gt;Improving Access to Psychological Therapies&lt;/em&gt;) service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a passionate CBT Therapist, can you demonstrate?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualification from High Intensity IAPT Course (Post Graduate Diploma) or other Post Graduate CBT training course.&lt;/li&gt;\n&lt;li&gt;Experience of providing high intensity interventions for common mental health problems&lt;/li&gt;\n&lt;li&gt;Excellent communication skills&lt;/li&gt;\n&lt;li&gt;IT skills - Microsoft Office/Patient record systems&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To achieve our ultimate aim of making people better we recognise importance and benefits of investing in our team. We provide:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Focus of staff wellbeing through, events, staff events, wellbeing champions and initiatives&lt;/li&gt;\n&lt;li&gt;Flexible approach to working through remote and homeworking options&lt;/li&gt;\n&lt;li&gt;Day to day clinical support and leadership&lt;/li&gt;\n&lt;li&gt;Excellent clinical supervision in accordance with IAPT Manual and IAPT Supervision guidance&lt;/li&gt;\n&lt;li&gt;Ongoing continual professional development opportunities&lt;/li&gt;\n&lt;li&gt;Individual CPD and development plans&lt;/li&gt;\n&lt;li&gt;Opportunities for Clinical Supervisor, Leadership roles as part of longer term career development&lt;/li&gt;\n&lt;li&gt;A friendly and supportive work environment with an overall culture of energy, solution focus and excellence in both our service delivery and support to our team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;The Company:&lt;/h2&gt;\n&lt;p&gt;Vita Health Group is a leading UK healthcare provider with over 30 years’ experience delivering best in class physical and mental health services across corporates, NHS and private patients.&lt;/p&gt;\n&lt;p&gt;We comprise of three leading UK healthcare providers, each with their own great reputation within the healthcare industry; RehabWorks, Workplace Wellness and Crystal Palace Physio Group.&lt;/p&gt;\n&lt;h2&gt;Skills and Experience:&lt;/h2&gt;\n&lt;p&gt;Essential:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualification from High Intensity IAPT Course (Post Graduate Diploma) or other Post Graduate CBT training course.&lt;/li&gt;\n&lt;li&gt;BABCP accreditation or eligibility for BABCP accreditation&lt;/li&gt;\n&lt;li&gt;We welcome newly qualified trainees&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Desirable:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of facilitating groups&lt;/li&gt;\n&lt;li&gt;Other IAPT qualifications i.e. EMDR, Couples for Depression, MBCT&lt;/li&gt;\n&lt;li&gt;IAPT Supervision Qualification&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Why Vita Health Group?&lt;/h2&gt;\n&lt;p&gt;Our company purpose is “to make people better” which is inclusive of everyone we treat. In order to achieve this, we strongly believe in our company values:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leadership&lt;/li&gt;\n&lt;li&gt;Customer Focussed&lt;/li&gt;\n&lt;li&gt;People Centred&lt;/li&gt;\n&lt;li&gt;Quality&lt;/li&gt;\n&lt;li&gt;Integrity&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our values provide the building blocks for us to achieve the Vita Health Group vision to be the UKs Leading Healthcare Provider of best in class Physical and Mental Health Solutions.&lt;/p&gt;\n&lt;p&gt;We are proud to be an inclusive, equal opportunities employer and value excellence in everything we do. We have a strong focus on supporting and developing our employees and are keen to bring on board candidates that share our vision to be a workplace of choice.&lt;/p&gt;\n&lt;p&gt;We continually look at attracting the very best people from the widest talent pool. As a Disability Confident Committed Employer, we are dedicated to ensuring that all candidates are treated fairly throughout the recruitment process.&lt;/p&gt;\n&lt;p&gt;Should you wish to discuss any adjustment that you might need in the applications process,you can do so by visiting our website and clicking on “contact us” button located at the top right of the page. Please dial the number for our head office in Bury St Edmunds and ask to speak to a member of our recruitment team who will be happy to discuss your requirements.&lt;/p&gt;\n&lt;h2&gt;Benefit Package&lt;/h2&gt;\n&lt;p&gt;The role offers a comprehensive benefits package including but not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Enhanced annual leave&lt;/li&gt;\n&lt;li&gt;Continued Professional Development opportunities and comprehensive training provided&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;Life Assurance insurance&lt;/li&gt;\n&lt;li&gt;Online benefits portal, including high street discounts and a wellbeing zone&lt;/li&gt;\n&lt;li&gt;Enhanced maternity, paternity and adoption leave&lt;/li&gt;\n&lt;li&gt;Benenden health cover&lt;/li&gt;\n&lt;li&gt;Length of service awards&lt;/li&gt;\n&lt;li&gt;Ability to work from home when required and where possible (min 5mb download speed required)&lt;/li&gt;\n&lt;li&gt;Retirement training&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Employee referral cash incentive (Subject to Tax and NI)&lt;/li&gt;\n&lt;li&gt;Employee Assistantce Program&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;How to Apply&lt;/h2&gt;\n&lt;p&gt;Please submit a copy of your CV for review via the NHS jobs apply section&lt;/p&gt;\n&lt;p&gt;Any data which you share with us throughout the hiring process will be stored securely within the UK and is accessible only by staff who require it. Should your application be unsuccessful, your data will be securely destroyed after 6 months.&lt;/p&gt;\n&lt;p&gt;Vita Health Group is an equal opportunities and Disability Confident Committed Employer. We positively encourage applications from suitably qualified and eligible candidates regardless of sex, race, disability, age, sexual orientation, gender reassignment, religion or belief, marital status, or pregnancy and maternity.&lt;/p&gt;\n&lt;p&gt;We are committed to supporting wellbeing for all employees and are associated with the MINDFUL EMPLOYER Charter for Employers who are Positive About Mental Health.&lt;/p&gt;\n&lt;p&gt;Please note, all applicants must be legally entitled to accept and perform work in the UK and all positions are subject to a DBS check.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.777", "longitude": "-1.20489"}}, "title": "IAPT High Intensity Therapist  (BNSSG 619 RO)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916198292", "validThrough": "2020-11-27T23:59:59+0000"}