{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "37500", "unitText": "YEAR", "value": "£37,500 - £40,000 p/a DOE"}}, "datePosted": "2020-09-24T17:20:53+0100", "description": "&lt;p&gt;18 Week Support are currently seeking Band 6 Endoscopy Nurses in Charge to join our team on a Substantive or Fixed Term basis.  &lt;/p&gt;\n&lt;p&gt;With our largest service provision being Endoscopy, we are now hoping to appoint Band 6 Endoscopy Nurses in Charge to join our team on a substantive or fixed term basis. This is an exciting opportunity for anyone considering options in the private sector, but still wanting to work with, and support, the NHS while leading a great team of medical professionals.  &lt;/p&gt;\n&lt;p&gt;The role also offers the opportunity to work in new departments, experience new systems and explore new cities across the UK with the comfort of a guaranteed income.  &lt;/p&gt;\n&lt;p&gt;Your day will consist of working with and assisting Gastroenterologists and Nurse Endoscopists with a range of specialised procedures such as, but not limited to, Gastroscopy and Colonoscopy. You will oversee our service and support the team with ensuring outstanding patient care, a safe and robust patient journey and lead the team in ensuring an excellent patient experience &lt;/p&gt;\n&lt;p&gt;18 Week Support is an RTT support provider which supports NHS Trusts with meeting their RTT pathways and 18-week waiting time targets. Like the NHS we work with, patient care is at the centre of everything we do, and our clinical teams are dedicated to ensuring excellent patient experience.  &lt;/p&gt;\n&lt;p&gt;We are an ethical and transparent organisation that is committed to the NHS and the delivery of high-quality care, and to helping NHS Trusts reduce RTT waiting times.  &lt;/p&gt;\n&lt;p&gt;Post Summary &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Band 6 Endoscopy Nurse in Charge  &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Substantive or Fixed Term post  &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Highly competitive annual salary  &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;London (services span across the UK) &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Reporting to the 18 Week Support Chief Nurse &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Full time and part time roles available  &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Benefits include; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Pension contribution  &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Private health insurance  &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;27 days’ Annual Leave + Bank Holidays  &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Travel &amp; accommodation costs covered  &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Induction, CPD and career opportunities  &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicant Requirements  &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Registered Nurse  &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Minimum of 3 years’ experience at AfC Band 6 level or above within an NHS Endoscopy Unit  &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience in the management of a clinical team including HR Management &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience working in partnership with MDT and work across professional boundaries   &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience in clinical governance, risk management, incident management and handling complaints &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Essential I.T. (EIT) skills or equivalent  &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;br /&gt;Please see enclosed job description for full post details.  &lt;/p&gt;\n&lt;p&gt;All employees are subject to the requirements of the Health &amp; Safety at Work Act.  The post holder is required to ensure that as an employee, his or her work methods do not endanger other people or themselves.  &lt;/p&gt;\n&lt;p&gt;All employees are subject to the requirements of the Data Protection Act and must maintain strict confidentiality in respect of patient’s and staff’s records.  &lt;/p&gt;\n&lt;p&gt;All employees must comply with 18 Week Support’s &amp; the contracted site’s Equal Opportunities Policy and must not discriminate on grounds of age, colour, race, nationality or ethnic origin, religion, belief, gender, marital status, sexuality, disability, trades union membership (or non-membership) or political affiliation, or any other grounds which cannot be shown to be justifiable.  &lt;/p&gt;\n&lt;p&gt;This job description is not to be taken as an exhaustive list of duties and it may be reviewed in the light of changed service needs and development.  Any changes will be fully discussed with the post holder.  The post holder will be required to carry out the duties appropriate to the grade and scope of the post.  &lt;/p&gt;\n&lt;p&gt;In order to ensure 18 Week Support’s ability to respond to changes in the needs of the service, after appropriate consultation and discussion with you (including consideration of personal circumstances current skills, abilities and career development) 18 Week Support may make a change to your location, duties and responsibilities that are deemed reasonable in the circumstances.  &lt;/p&gt;\n&lt;p&gt;You may be required to work in a number of different locations for the duration of your contract.  Flexibility is required across all relevant speciality contracts.  Where appropriate and against a set criteria travel costs and accommodation will be provided. &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/136015.png", "name": "18 Week Support", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136015"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "EC3R 5AR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5097", "longitude": "-.081231"}}, "title": "Band 6 Endoscopy Nurses in Charge - Substantive/Fixed Term Post", "url": "https://www.jobs.nhs.uk/xi/vacancy/916199599", "validThrough": "2020-12-21T23:59:59+0000"}