{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31000", "minValue": "25000", "unitText": "YEAR", "value": "25000-31000"}}, "datePosted": "2020-08-03T14:24:15+0100", "description": "&lt;p&gt;&lt;strong&gt;Registered Nurse - Circle Rehabilitation Birmingham&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full or Part Time&lt;/strong&gt;&lt;strong&gt; / Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Circle Rehabilitation Birmingham, Pebble Mill, Edgbaston, Birmingham&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;Are you passionate about providing excellent nursing care in rehabilitation? We have put nurses at the forefront of rehabilitation as we believe that “every interaction is a rehabilitation opportunity”. Our service will support people with a wide range of conditions from neurological, progressive diseases, muscular skeletal, frail elderly and intermediate care through a programme of reactivation rehabilitation.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;Circle Health is a company that runs hospitals and health services throughout the UK. We were founded in 2004, and we are different to most healthcare organisations. We build independent hospitals which pioneered five-star hospitality in the UK, and we’re the only organisation running some innovative types of work in the NHS, such as our Bedfordshire and Greenwich musculoskeletal contract. In 2017, Circle Rehabilitation was launched at our hospital in Reading. In 2020, the service is expanding to Birmingham. Circle Birmingham Hospital is our first large-scale rehabilitation hospital, which will be co-located with an elective private hospital, on the former BBC Pebble Mill site in Birmingham.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Circle Rehabilitation &lt;/strong&gt;are leading the way in innovating rehabilitation in the UK, utilizing best practice from our extensive research into rehabilitation models worldwide. Our ground-breaking new service has been designed around a truly patient centred MDT model using the WHO International Classification of Functioning to deliver intensive, holistic rehabilitation which values all functioning not just the physical. Our rehabilitation facilities are world-class centres of excellence in contemporary settings with leading medical experts, state-of-the-art technology, and premium accommodation and catering. Patients are treated by leading MSK and neurological consultants, therapists and nurses from our extensive network of clinicians. We are opening our newly built and state of the art 120-bed rehabilitation hospital attached to the 40-bed Circle Birmingham elective surgical hospital in June 2020. It will include provision for private and NHS patients, along with day-case and outpatient rehabilitation facilities with significant investment in new technologies and world class equipment. It will incorporate the luxurious interiors and hospitality for which Circle’s private hospitals are known.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;Circle Rehabilitation believes that great care can change everything. If you share our passion for rehabilitation - this progressive new rehabilitation team needs you!&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Person Specification:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a Registered Nurse Level 1. Experience in medical or rehabilitation nursing is essential, and a post graduate qualification in a relevant speciality would be advantageous.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;You will be joining a strong, innovative, dedicated, enthusiastic and caring multi-disciplinary team committed to facilitating people through their rehabilitation journey to live their lives to the fullest.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;You will need to be able to demonstrate:-&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Genuine passion for rehabilitation nursing&lt;/li&gt;\n&lt;li&gt;Excellent interpersonal skills&lt;/li&gt;\n&lt;li&gt;High professional standards&lt;/li&gt;\n&lt;li&gt;Collaborative working with all members of the MDT&lt;/li&gt;\n&lt;li&gt;Commitment to our vision and strategy ensuring that our patients receive holistic care&lt;/li&gt;\n&lt;li&gt;Demonstrate a high level of compassion for patients and their relatives&lt;/li&gt;\n&lt;li&gt;Use evidence based practise&lt;/li&gt;\n&lt;li&gt;Act as a professional role model for junior members of staff&lt;/li&gt;\n&lt;li&gt;Deputise in the absence of the Head of Nursing and Allied Health Professionals&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;In return you will:&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be supported by the Unit Charge Nurse, Lead Nurse and Head of Nursing and Allied Health Professionals&lt;/li&gt;\n&lt;li&gt;Be encouraged to develop a personalised CPD plan and access unique clinical and academic and development opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;Cycle scheme&lt;/li&gt;\n&lt;li&gt;27 days annual Leave with additional days after qualifying period (pro-rata for part timers)&lt;/li&gt;\n&lt;li&gt;Pension Scheme&lt;/li&gt;\n&lt;li&gt;Health and Well Being programme which includes free fruit, massages and fitness sessions&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;Discounted food from the Atrium Café&lt;/li&gt;\n&lt;li&gt;Private Medical Insurance after qualifying period&lt;/li&gt;\n&lt;li&gt;Non-contributory Life Assurance&lt;/li&gt;\n&lt;li&gt;Perkbox&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Circle Rehabilitation &lt;/strong&gt;&lt;br /&gt; For people to live their lives to the fullest&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Mission&lt;/strong&gt;&lt;br /&gt; To redefine how rehabilitation is delivered in the UK&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Vision&lt;/strong&gt;&lt;br /&gt; To lead the development of a sustainable and scalable new model of rehabilitation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Culture:&lt;/strong&gt; We view every person as an individual with unique needs and advocate patient-led goal setting, in our centres, in the community and at home. With a holistic and wellbeing approach we focus on all aspects of people’s lives, and we believe every interaction is a rehabilitation opportunity&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Model: &lt;/strong&gt;A medically led service with a comprehensive multi-disciplinary team enables us to manage patients with more complex needs earlier in their pathway.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Intensive Rehabilitation&lt;/strong&gt;: A personalised programme of a minimum of 15 hours a week, delivered over 7 days.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Environment: &lt;/strong&gt;Purpose-built facilities designed to promote a sense of independent health and wellbeing with single occupancy ensuite bedrooms, communal dining and a diverse range of indoor and outdoor recreational therapy areas.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Innovation: &lt;/strong&gt;Harnessing the latest technology and equipment to deliver and measure the best outcomes for our patients across their entire pathway.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Strategy&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For patients; Accelerating their independence and wellbeing through early, intensive and person-centred clinical rehabilitation in the best environment&lt;/p&gt;\n&lt;p&gt;For rehabilitation; Developing research and evidence-base with our partners that will create new models of care and raise its profile&lt;/p&gt;\n&lt;p&gt;For the health economy; Improving access, experience, and outcomes to enhance quality of life and reduce economic burden&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Circle Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingaham", "postalCode": "B5 7SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4518", "longitude": "-1.91227"}}, "title": "Registered Nurse Rehabilitation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916134844", "validThrough": "2020-11-27T23:59:59+0000"}