{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 3 plus Excellent Benefits"}}, "datePosted": "2020-09-23T13:53:30+0100", "description": "&lt;p&gt;&lt;strong&gt;SST | Theatre | Band 3 plus Excellent Benefits | Manchester | Full Time, Permanent.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Manchester Hospital, located in Didsbury has a rare opportunity available for a Sterile Services Technician/Decontamination Technician to join our team on a Full Time and permanent basis.&lt;/p&gt;\n&lt;p&gt;Shift patterns will be on a fair rota basis between the hours of 7am and 9pm Monday to Saturday, please only apply if you are able to commit to these shifts.&lt;/p&gt;\n&lt;p&gt;The Sterile Services Department is aligned with our Theatre team, due to this you will become a valued part of the Patient’s journey whilst they are within our care.&lt;/p&gt;\n&lt;p&gt;Our Theatre Teams are key to patients coming into the Hospital to utilise our wide range of treatments and surgical procedures we offer and we are looking for someone who is looking to thrive in a role that requires genuine autonomy and the chance to work as part of a continually changing environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;There is an element of Manual Handling required within the role, with full training provided.&lt;/li&gt;\n&lt;li&gt;As an SST, duties will include routine tasks related to the delivery of care to ensure our patient’s health and well-being.&lt;/li&gt;\n&lt;li&gt;You will be responsible for Reprocessing, Sterilising and repackaging instruments&lt;/li&gt;\n&lt;li&gt;The successful candidate will also be responsible for the daily testing and logging of equipment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of working within a similar role would be advantageous, however, is not essential for this role&lt;/li&gt;\n&lt;li&gt;Understanding of ISO13485 or a willingness to learn this&lt;/li&gt;\n&lt;li&gt;Must be accurate and have a strong desire for attention to detail.&lt;/li&gt;\n&lt;li&gt;NVQ Level 2 or above in Health and Social Care or equivalent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Free On-site Gym&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals and 8 clinics across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M20 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4149", "longitude": "-2.23507"}}, "title": "Sterile Services Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916196992", "validThrough": "2020-11-23T23:59:59+0000"}