{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32142", "minValue": "32142", "unitText": "YEAR", "value": "Up to £32,142"}}, "datePosted": "2020-08-19T15:59:18+0100", "description": "&lt;p&gt;&lt;strong&gt;The Disabilities Trust is Hiring in York!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Are you a Speech and Language Therapist with Dysphagia experience looking for your next rewarding role?&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are recruiting for a Full-Time Speech and Language Therapist at our service York House&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;York House is a 38 bed, independent hospital offering neurobehavioural assessment, treatment and rehabilitation to adults with acquired brain injury who present with complex health needs and challenging behaviours. The role offers a unique experience of working closely with service users to offer bespoke and meaningful interventions in the short and longer term.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt; This is an exciting opportunity to join our well-established team.You will be involved in the assessment, diagnosis and treatment of a range of adults with acquired brain injury, including social-communication impairments and challenging behaviour. You will work closely with a motivated team including Physiotherapy, Occupational Therapy, Psychology and Rehabilitation Support Workers to deliver a goal-focused, high quality service that enables adults to maximise their individual potential. You will be working closely with our Lead SLT and Multi-Disciplinary Team. You will be dysphagia trained, have a minimum 1-2 years’ experience of working with adults with neurological conditions within either an acute, rehabilitation or community setting.We can offer you commitment and encouragement with CPD, including excellent training opportunities, clinical supervision and peer group support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main Duties:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- Working as an independent clinical professional with knowledge and skills, problem solving and clinical reasoning in a specialist area&lt;/p&gt;\n&lt;p&gt;- Managing, with support and supervision, and prioritise a caseload of clients with complex mental/physical health needs and/or challenging behaviour&lt;/p&gt;\n&lt;p&gt;- Using evidence based/client centred principles and clinical reasoning to assess, plan, implement and evaluate intervention&lt;/p&gt;\n&lt;p&gt;- Facilitating complex discharge packages of care and give advice and information to other disciplines and agencies&lt;/p&gt;\n&lt;p&gt;- Contributing to the training and development of others when required&lt;/p&gt;\n&lt;p&gt;- Participating in the planning, development and evaluation of Speech and language therapy Services within a designated area/team, holding responsibility for defined projects&lt;/p&gt;\n&lt;p&gt;- Supervising other members of staff, e.g. Rehabilitation Support Workers, in carrying out the programmes the Speech and Language Therapist has devised&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- Hours Available: 35 hours a week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- A salary of up to £32,142&lt;/p&gt;\n&lt;p&gt;- 38 days holiday entitlement (inclusive of bank holidays)&lt;/p&gt;\n&lt;p&gt;- Employer pension contribution&lt;/p&gt;\n&lt;p&gt;- Staff discounts through Perkbox and on gym membership&lt;/p&gt;\n&lt;p&gt;- Free Onsite Parking&lt;/p&gt;\n&lt;p&gt;- Long Service and staff awards&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Lead Speech and Language Therapist Sinead Corkery 01904 412666.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please Note: This post is subject to a Disclosure and Barring Service (DBS) and references&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Disabilities Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO10 5BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9508", "longitude": "-1.06314"}}, "title": "Speech and Language Therapist - York", "url": "https://www.jobs.nhs.uk/xi/vacancy/916155229", "validThrough": "2020-11-27T23:59:59+0000"}