{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45749", "minValue": "18299", "unitText": "YEAR", "value": "Up to £18,299pa DoE (FTE £45,749pa)"}}, "datePosted": "2020-09-04T13:12:31+0100", "description": "&lt;p&gt;&lt;strong&gt;Choose a new role that provides you with the opportunities you need to grow&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Cygnet Health Care you’ll be exposed to the realities of healthcare delivery at the highest level, ensuring you continue to learn and build new skills as you develop. Our reputation for quality and innovation makes us an excellent choice to advance your career whilst positively impacting service-user outcomes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Role&lt;/strong&gt;&lt;br /&gt; We are looking to recruit a Highly Specialist Speech and Language Therapist (Band 7) to join our team at Cygnet Bostall House.Cygnet Bostall House provides assessment and treatment for men living with a learning disability and associated complex needs, including mental and physical health needs, and behaviours that may challenge.&lt;/p&gt;\n&lt;p&gt;As a Highly Specialist Speech and Language Therapist to work 16h per week to support the development and delivery of an evidence-based SLT service to meet the needs of the complex client group within an inpatient complex care service.&lt;/p&gt;\n&lt;p&gt;You will work as part of a multi-disciplinary team, using expert skills to assess, advise and intervene with the aim of promoting, implementing and embedding functional communication systems. Bostall House is a 6-bedded unit and so this is a hands-on role with high levels of service user contact. You will be able to train others, promote good practice and maintain a successful total communication environment.&lt;/p&gt;\n&lt;p&gt;You will be accountable to the Director of Speech and Language Therapy and the onsite service manager at Cygnet Bostall House. Postgraduate qualification in the management of dysphagia is essential.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;We are looking for a Speech and Language Therapist with:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong clinical and professional skills&lt;/li&gt;\n&lt;li&gt;Working experience in the field of Learning Disabilities including Autism Spectrum Disorders and Mental Health Conditions&lt;/li&gt;\n&lt;li&gt;Understanding of Positive Behaviour Support with an emphasis on person-centred planning&lt;/li&gt;\n&lt;li&gt;Knowledge of sensory needs and how these may impact on functioning and regulation&lt;/li&gt;\n&lt;li&gt;Knowledge of key national drivers for inpatient services&lt;/li&gt;\n&lt;li&gt;Qualification in Dysphagia management essential&lt;/li&gt;\n&lt;li&gt;Evidence of being a strong team player with a genuine desire to help others&lt;/li&gt;\n&lt;li&gt;Good organisational and project management skills&lt;/li&gt;\n&lt;li&gt;Ability to work flexibly in a fast paced and dynamic environment.&lt;/li&gt;\n&lt;li&gt;Enthusiasm, motivation and passion&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An immediate peer network of 45 SLTs nationwide.&lt;/li&gt;\n&lt;li&gt;Excellent Clinical Supervision, CPD and developmental opportunities for clinical and non-clinical duties&lt;/li&gt;\n&lt;li&gt;Full support from an onsite multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Routine service meetings with Cygnet Speech and Language Therapists&lt;/li&gt;\n&lt;li&gt;CPD and Developmental opportunities.&lt;/li&gt;\n&lt;li&gt;Meal provision on duty&lt;/li&gt;\n&lt;li&gt;A comprehensive employee assistance programme and discount centre&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt; Full induction training is given and you will receive clinical supervision through a member of the Speech and language Therapy team on a monthly basis.&lt;/p&gt;\n&lt;p&gt;You must be a Health &amp; Care Professions Council (HCPC) registered SLT. Please note: successful candidates will be required to undergo an enhanced DBS check.&lt;/p&gt;\n&lt;p&gt;Start Date: Earliest convenience&lt;/p&gt;\n&lt;p&gt;Please note this position may close in advance should sufficient applications be received.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bostall House, Knee Hill, London", "postalCode": "SE2 0AT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4827", "longitude": ".120862"}}, "title": "Highly Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916172978", "validThrough": "2020-11-27T23:59:59+0000"}