{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive salary + including NHS Pension scheme"}}, "datePosted": "2020-08-28T11:08:54+0100", "description": "&lt;h2&gt;&lt;strong&gt;Community Healthcare Support &lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;In our acclaimed ‘York Integrated Care Team’&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are looking for an opportunity to work within a supportive team environment where you have access to team members during a working day? Are you looking for stability in the number of hours you are paid each week?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have an exciting opportunity which can be flexible around you, your lifestyle and commitments, we can offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Guaranteed full time/part time hours (including evening/weekend)&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;or&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Guaranteed evening / weekend hours&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The thriving York Integrated Care Team was established to bring together primary and secondary care, social care and the voluntary sector to form a genuinely multidisciplinary team of different professions.&lt;/p&gt;\n&lt;p&gt;The work this team is doing is at the forefront of innovation. It’s pioneering work to bridge the gap between social and healthcare is receiving professional acclaim and recognition for the difference they make every day…every patient.&lt;/p&gt;\n&lt;p&gt;Our Healthcare Support staff work alongside a team of GP / Nurse / Social Workers and other professionals.&lt;/p&gt;\n&lt;p&gt;This team based approach ensures our Healthcare Support staff can access the support they need.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are the main duties of the role?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Patient centred activities may include health or social care such as assisting with personal hygiene, providing meals, supporting family members and other health and wellness related activities. The successful candidate will support patients to live in their own home and/or community whilst supporting other team members and professionals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt; What we look for in your application&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven background of assisting patient’s to meet their basic needs including diet, maintaining personal hygiene, assessing and using toilet facilities as appropriate&lt;/li&gt;\n&lt;li&gt;Proven ability to provide care and support as set out in the care assessment which will be written by a Registered Nurse&lt;/li&gt;\n&lt;li&gt;Ability to communicate effectively with patients from all walks of life&lt;/li&gt;\n&lt;li&gt;Ability to build positive rapport with a diverse range of internal colleagues and clients&lt;/li&gt;\n&lt;li&gt;Proven history of ensuring patient’s comfort, safety and dignity are maintained at all times&lt;/li&gt;\n&lt;li&gt;Ability to work autonomously whilst also having an awareness of the scope of your role when identifying the need to access the wider clinical team appropriately and safely&lt;/li&gt;\n&lt;li&gt;Ability to function well and work flexibly within a wider clinical team&lt;/li&gt;\n&lt;li&gt;First class organisational and time management skills in a fast paced environment is essential&lt;/li&gt;\n&lt;li&gt;Use of own car with driving license / use of own transport.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;So are you in or are you out?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Weekly Hours:&lt;/strong&gt; We guarantee payment for your contractual weekly hours and any extra hours are also paid as overtime at your hourly rate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you are interested in Full Time&lt;/em&gt;&lt;/strong&gt;; &lt;em&gt;due to the nature of the important service we provide to patients an amount of flexibility is required of all our team members. As such you are required to be available to work during our service’ core evening hours shown below. Your specific weekly hours of work are published to the team in the ROTA with as much notice as possible.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Monday Start time is negotiable – 22:00&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Tuesday Start time is negotiable – 22:00&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Wednesday Start time is negotiable – 22:00&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Thursday Start time is negotiable – 22:00&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Friday Start time is negotiable – 22:00&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Saturday Start time is negotiable – 22:00&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sunday Start time is negotiable – 22:00&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you are interested in Weekend / Evening hours; &lt;/em&gt;&lt;/strong&gt;&lt;em&gt;we are open to discussion through the recruitment process.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rate of Pay:&lt;/strong&gt; Competitive salary + including NHS Pension scheme + Travel mileage paid at approved rates.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; The role operates in a number of health care settings (home visits, in the community/nursing homes etc.) The Integrated Care Team are based at Tang Hall Lane Surgery 190 Tang Hall Lane, York, YO10 3RL&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection for Interview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Practice recognises that discrimination of any kind is both unlawful and would act as a barrier to finding the most talented individuals for our organisation. As such, our recruitment and selection procedures exist to ensure no job applicant, employee or worker is discriminated against either directly or indirectly on the grounds of age, disability, gender reassignment, marriage and civil partnership, pregnancy or maternity, race, religion or belief, sex or sexual orientation.&lt;/p&gt;\n&lt;p&gt;A great deal of careful consideration has been invested in preparing the advert for this post based on the specification for this role and the person we are looking for. &lt;strong&gt;Our selection for interview process is designed to ensure individuals are selected for interview on the merit of their application only&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;If you are applying through NHS Jobs, you will notice you are asked if you would like a guaranteed interview as part of the ‘Two Tick’ disability scheme. Whilst this is an admirable government initiative, please be aware we are not signed up to this scheme. This is a question on the NHS jobs application form which is outside of our own control. Our own process ensures we consider candidates on the merit of their application only and we do not ask any questions regarding a disability as part of our selection process. We only give candidates the opportunity to share information regarding any disability after candidates are invited to interview and only if the candidate feels they require adjustments in the interview process.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Medical Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO10 3RL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9571", "longitude": "-1.04877"}}, "title": "Community Healthcare Support", "url": "https://www.jobs.nhs.uk/xi/vacancy/916165675", "validThrough": "2020-12-08T23:59:59+0000"}