{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58077", "minValue": "39440", "unitText": "YEAR", "value": "£39,440- £58,077"}}, "datePosted": "2020-08-27T14:42:05+0100", "description": "&lt;h1&gt; &lt;/h1&gt;\n&lt;h2&gt;£39,440- £58,077 per annum depending on experience (inc London Weighting) + 4% for on-call commitment&lt;/h2&gt;\n&lt;h1&gt;&lt;span&gt;Full Time / Part Time Opportunity&lt;/span&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;span&gt;40 hours per week as a full time member of staff, part time hours are negotiable, 1 in 6 remote on-call commitment (pro rota). This post is for an initial 12-month fixed term with the possibility of extending by another 12 months.&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;span&gt;&lt;strong&gt;Scope&lt;/strong&gt;&lt;br /&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a highly motivated clinical fellow to work in the brain injury service at the Royal Hospital for Neuro disability. No experience in rehabilitation or brain injury is needed, but would be desirable. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Royal Hospital for Neuro-disability is a private, non-profit, charity hospital and home, based in a beautiful grade II listed building in Putney, South West London. We provide specialist services (assessment, rehabilitation and disability management) for adults with profound or complex disabilities resulting from damage to the brain or nervous system. Through these services, we seek to enable people with profound neuro-disability to enjoy an optimal quality of life.&lt;/span&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;span&gt;The role:&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The job is perfect for those who have become disillusioned and burnt out working in the acute environment in the NHS and want to try something slightly different. At the RHN patients usually stay under one consultant and multidisciplinary team for 3-6 months so there is time to really get to know them and their families well. This means there is excellent continuity of care and a strong MDT focus, so you really feel like part of a valued team. The hospital doesn’t offer acute services and unstable patients are transferred to the local tertiary centre. This means that although busy, the pace is slower than in acute hospitals allowing time to learn and get involved in projects. Despite not having as many acute situations, it is still challenging as the patients are medically very complex and interesting. There is a ventilator unit for those with an interest in ITU, and opportunities to learn other unique skills, for example spasticity management using Botox injections.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The hours are Monday to Friday 9-5 (40 hours per week) with a 1 in 6 on call commitment. The day to day work consists of weekly MDT meetings, weekly consultant ward rounds, family meetings, report writing and day to day management of patients on the ward. The consultants are approachable and supportive, and don’t let the juniors feel abandoned. The evening on calls are from 5pm to 9am the following morning and are done remotely from home. Weekend on calls are 48 hours. The workload during these on calls varies from shift to shift but are generally quite manageable. Usually patients can be managed over the phone and via remote IT access to electronic patient records, investigations + prescribing, but occasionally it requires the doctor to attend in person. Overall, the hours allow for a good life-work balance.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are weekly teaching sessions run by the medical team, which clinical fellows are invited to get involved in. There are also opportunities to get involved with audits, quality improvement projects, research and the continuing development of the specialist services for individuals with complex disabilities. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must hold full registration with the GMC. In addition, experience and familiarity with UK hospital systems and practices or equivalent is essential. Experience in neurological rehabilitation or in a relevant specialty is desirable but not essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Finally, the hospital is in a beautiful setting with a lovely, friendly atmosphere. There is a real team spirit and good relationship between different disciplines. In the summer you can enjoy lunch on the lawn in the sun and in the winter enjoy the festive fairs, Christmas show and excellent Christmas meal. There are fundraising and teambuilding events throughout the year, as well as an RHN staff choir.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;span&gt;The Benefits:&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;- Medical Indemnity cover&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;- Generous study leave allowance&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;- Free on-site parking&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;- Work-life Balance&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;- On-site yoga&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;- A subsidised staff restaurant, café and coffee shop&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;- A professional library&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;- Free eye-sight tests&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;- A contributory staff pension scheme&lt;/p&gt;\n&lt;h1&gt;For informal discussions about this role:&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;For informal general inquiries please contact the Hospital’s main telephone number: 0208 780 4500. To discuss the role further please contact Dr. Kudret Yelden, Lead Consultant Physician for Education and Training on extension 4508 or by email onkyelden@rhn.org.uk.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Closing Date:&lt;br /&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that we will proactively shortlist / interview applicants for this role&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135376.png", "name": "Royal Hospital for Neuro Disability", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135376"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Putney, London", "postalCode": "SW15 3SW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4522", "longitude": "-.213652"}}, "title": "Clinical Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916164673", "validThrough": "2020-11-30T23:59:59+0000"}