{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 inc Fringe HCAS"}}, "datePosted": "2020-09-11T13:15:51+0100", "description": "&lt;p&gt;A full time permanent post will be available from January 2021, for a Band 6 Clinical Nurse Specialist to join the Surrey-wide Eating Disorder Service for Children and Young People in Epsom. This post is established in the team and will be available due to a vacancy in the team. You will be joining a well-established and supportive community based child and adolescent eating disorders service comprising of a Service Manager/Art Psychotherapist, Consultant Psychiatrists and Pediatrician, Nurses, Dieticians, Psychologists, Psychotherapist and Family Therapists. We have excellent admin support. We follow the 2016 NHSE community eating disorders Access and Waiting Times Guidelines and Standards.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your role will involve working with young people and their families, alongside the professionals involved in their care. You will be given training and support to enable you to deliver Family Based Treatment (FBT) for Eating Disorders in accordance with NICE guidelines. Experience of working directly with families, young people and enabling families to re-feed their children is desirable but you will otherwise be given training on this. You will take an active role in the mental and physical health of the young people under our care and will monitor all physical perimeters. You will have the responsibility of managing your own caseload and will be involved in delivering care to our Tier 4 indicated clients, with a goal of preventing admissions where possible and facilitating smooth transitions to and from inpatient care. This will at times require travelling to and from family homes, inpatient facilities and medical units; driving and car ownership is therefore essential for this post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The service has hugely expanded over the last 2-3 years andwe are now recognised as a nationally top achieving service with some of the highest outcomes. We are a really friendly and dynamic team who were shortlisted for the Royal College of Psychiatry’s “Team of the Year Award 2017”, are QNCC-ED registered and are CARE Excellence accredited.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service currently operates between Monday – Friday (9 - 5) with out of hours delivery on a rota basis on Wednesday and Thursday evenings (5 - 6.15pm) * &lt;/span&gt;*currently suspended due to the pandemic.&lt;span&gt; You will be required to participate in this on a very ad hoc basis only, once it is re-established. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like any further information or would like to visit the team, please call the Service Manager, Suzanne Cole, on 01372 206325.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom", "postalCode": "KT19 8QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3493", "longitude": "-.27448"}}, "title": "Eating Disorders Clinical Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916181796", "validThrough": "2020-11-16T23:59:59+0000"}