{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-07-07T12:00:27+0100", "description": "&lt;p&gt;&lt;span&gt;Southern Health is one of the largest Foundation Trusts in the UK, specialising in mental health, adult and child community health and learning disabilities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a Consultant Old Age Liaison Psychiatrist to join our existing team of 1.1 wte old age liaison psychiatrists and to be based at in the Mental Health Liaison Team at Queen Alexandra Hospital, Portsmouth. Our wider Liaison Psychiatry Team in Southern Health NHS Foundation Trust (SHFT) is currently undergoing significant expansion. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be responsible for providing clinical leadership and consultant input alongside the existing consultants into the old age component of the Mental Health Liaison Team covering the Emergency Department, Acute Medical Unit and inpatient wards. The overall team covers adults 18 upwards and there are currently two parts of the team: those covering working age adults; and those covering adults age 65 and older, or younger adults with dementia. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Portsmouth Hospital NHS Trust is a large (1,000 beds approx) district general hospital serving a large rural and urban local community, covering patients in Portsmouth and South East Hampshire, with in excess of 142,000 patients annually within the Emergency pathways and with some regional services such as renal medicine. The hospital is one of the largest acute hospitals closely working with the Ministry of Defence.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Mental Health Liaison Team has an established Older Adults Liaison service comprising 1.1 wte consultants, doctors in training, and 4.2 wte mental health practitioners (nurses and social worker). We are recruiting to expand the number of practitioners at the moment. There is also a nurse-led Emergency Department and Acute Medical Unit liaison assessment service for working age adults, led by a Band 7 team leader with a rota of Band 6 experienced mental health practitioners. The service currently works until midnight, but has now been funded to become 24/7 over the coming months subject to additional nurse recruitment which is in process. This post is part of a consultant-led liaison psychiatry service covering the whole hospital (ED, AMU and wards).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition to the funding for extending the out of hours nursing service for ED/AMU 24/7, the service has recently received national pump-prime funding to expand the service for working-age and older adults liaison psychiatry from April 2020. There is commitment to start recruitment for these posts in advance of this. The current service expansion, which includes three consultant posts (two AMH, one OPMH), band 5, 6, 7 and 8a nursing, liaison psychology and administration, will enable phase 1 stage of expansion towards CORE-24. The service is not currently CORE-24, but there is a 3 year plan agreed to achieve this with support from the STP, commissioners, mental health and acute trusts, with the first wave of funding currently agreed for April 2020.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The aim in addition is for the service to achieve PLAN (Royal College of Psychiatrists Psychiatric Liaison Accreditation Network) accreditation within 3 years. We are currently part of a Trust-wide liaison network where we meet with other Liaison Psychiatry colleagues who work for the three other (also expanding) liaison teams in the Trust (Southampton, Winchester and Basingstoke).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is an established Mental Health Act administrator employed by Portsmouth Hospitals Trust based in Queen Alexandra Hospital, to support the Responsible Clinicians and the mental health and acute trusts.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post will have 2.5 sessions of supporting professional activities to support your revalidation, service and pathway development, education and clinical leadership. The post holder will be strongly supported to lead the developments of the clinical service. The trust will be happy to discuss flexible working patterns and to support other interests such as research or national commitments within the job plan.&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be part of a combined Portsmouth and South East on-call rota for adults, 1 in 10.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that GMC registration (with a licence to practice) and right to work in the UK are essential for this role. Successful applicants will already have GMC registration or will be able to demonstrate they are eligible. Applicants requiring Tier 2 sponsorship should ensure they meet the Home Office application criteria prior to submitting an application.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a lot to offer and look forward to talking with you about the opportunities available. If you have any further questions please email shft.medicalworkforce@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Consultant OPMH Liaison Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916104037", "validThrough": "2020-11-20T23:59:59+0000"}