{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-11-06T15:21:01+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Are you dynamic, forward thinking and an amazing leader?  If yes then we are the employer you are looking for. &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; NHS Northamptonshire CCG is looking for two new leaders, to become part of the Quality and Safeguarding Directorate. This is an exciting time to join us and manage the transition of All Age Adult Continuing Health Care (CHC) , Children and Young People’s( CYP)  Continuing Care ( CC), Individual Funding requests and Prior Approvals into the CCG.  The anticipated go live date for the new in-house CCG services is April 2021.&lt;/p&gt;\n&lt;p&gt;The function of the Head of All Age CHC/CC is to provide senior management and leadership to the Adult CHC and CYP CC, Personalisation and IFR/Prior Approvals clinical and business support team, to continually improve patient outcomes across the health economy in partnership with a range of partners and services, and to ensure quality is embedded within all commissioned services (NHS and Independent Sector), and which reflect national and local policy and best practice.&lt;/p&gt;\n&lt;p&gt;The post holder  will be supported by the new Lead Nurse for CYP CC in  the development and implementation of a new all age CCG CHC / CC business operating model for the CHC/CC team, which combines Quality Improvement, Quality Assurance and Quality Planning, patient safety and value for money.  &lt;/p&gt;\n&lt;p&gt;The post-holder will also have specific responsibility for management oversight of quality issues concerning the CHC /CC at place level.&lt;/p&gt;\n&lt;p&gt;The post holder will be the Quality, Innovation, Productivity and Prevention Lead to ensure the CCG meets its requirements to deliver the CHC/CC and funded nursing care  (QIPP) targets in line with the national frameworks, but that in doing so, it provides a quality service that is value for money.&lt;/p&gt;\n&lt;p&gt;The post holders will be responsible for producing internal and external activity performance and assurance reporting for CCG governance and accountable officers, and NHSE/I regional CHC/CC/Personalisation assurance reporting, collating activity, finance, quality and patient experience data.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fulfil the professional expectations required by the Nursing and Midwifery Council and the Code of Conduct for Managers, and or professional bodies, dependent on professional qualifications such as Allied Health Professional, (Health and Care Professions Council) and or Social care, adhering to the elements contained within these documents, in particular those relating to professional accountability and undergoing individual performance management to establish on-going development and training needs;&lt;/p&gt;\n&lt;p&gt;Pursue a programme of continuous professional development in accordance with relevant professional registration or statutory requirements;&lt;/p&gt;\n&lt;p&gt;Provide and receive highly complex, sensitive and contentious information to a wide range of stakeholders, including presenting information on projects, initiatives and services in formal settings;&lt;/p&gt;\n&lt;p&gt;Actively participate in discussions regarding all age adult Continuing Healthcare and Continuing Care issues contributing professional expertise and knowledge&lt;/p&gt;\n&lt;p&gt;Employ effective communication, negotiation and influencing skills to enable effective change management with stakeholders at all levels (including senior management) who may hold differing and contentious views;&lt;/p&gt;\n&lt;p&gt;Assist with Freedom of Information requests;&lt;/p&gt;\n&lt;p&gt;Develop and monitor project initiation documents in relation to CHC/CC QIPP plans;&lt;/p&gt;\n&lt;p&gt;Produce highly complex and detailed written reports, in line with project management requirements and deadlines.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have:&lt;/p&gt;\n&lt;p&gt; Professional qualification- NMC AHP, (HCPC) or Social Care equivalent.&lt;/p&gt;\n&lt;p&gt;Ability to interpret broad clinical and professional policies and advise others on their application;&lt;/p&gt;\n&lt;p&gt;Experience and sound knowledge of all age CHC/CC initiatives and Personalisation, which impact positively on patient outcomes;&lt;/p&gt;\n&lt;p&gt;Proven track record of managing budgets- and financial reporting systems.&lt;/p&gt;\n&lt;p&gt;Experience of contracting and monitoring, managing brokerage services, quality frameworks and Personal Health Budgets.&lt;/p&gt;\n&lt;p&gt;Experience of managing complex complaints and Subject Access Reviews.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128417.png", "name": "NHS Northamptonshire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128417"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Francis Crick House, 6 Summerhouse Rd, Moulton Park Industrial Estate, Moulton Park, Northampton NN3 6BF", "postalCode": "NN3 6BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2768", "longitude": "-.872766"}}, "title": "Head of CHC &amp; Personal Health Budgets &amp; Individual Funding Requests", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260357", "validThrough": "2020-11-20T23:59:59+0000"}