{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum / pro rata"}}, "datePosted": "2020-11-03T16:45:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Would you like to progress your career within a specialist area of CAMHS?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Wiltshire outreach ‘OSCA’ team are seeking to recruit a positive and ambitious individual to join our well-established existing team based in Melksham.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The team are highly experienced in providing crisis and outreach support to young people with complex mental health needs to help give them the best chance of being treated in the community. You will work alongside an extremely supportive and cohesive team who are highly experienced within their role of doing engagement work and the assessment and management of risk of highly complex young people.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This opportunity will enhance your skills as a practitioner, learning through team work and sharing the work with young people who present with risk. There is the opportunity to focus on particular areas of interest within the OSCA team such as DBT and our ED clinic as well as many training opportunities to enhance your skill set.&lt;/p&gt;\n&lt;p&gt;The work of the team often effectively changes the trajectory of young people&#39;s lives and this is supported by their testimonies. Our team and work is supported by a multi-agency approach including children’s social care, the youth offending team and drug and alcohol services just to name a few.&lt;/p&gt;\n&lt;p&gt;The OSCA team cover extended hours 8am - 8pm including weekends (10-6pm), which allows flexible working patterns and days off during the week. Practitioners will also be required to participate in the liaison rota that covers assessments at Salisbury District Hospital as well as the on call rota that runs 365 days of the year.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma Harding-WyattJob titleDeputy Team ManagerEmail addressEmma.harding-wyatt@oxfordhealth.nhs.ukTelephone number07769641970&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Melksham Community Hospital, Melksham", "postalCode": "SN12 7NZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3671", "longitude": "-2.13154"}}, "title": "Senior Mental Health Practitioner - RMN / OT / SW", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254839", "validThrough": "2020-11-17T23:59:59+0000"}