{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 Annex 21 U"}}, "datePosted": "2020-11-02T10:00:51+0000", "description": "&lt;p&gt;&lt;em&gt;Wirral University Teaching Hospital is seeking to recruit a qualified Assistant practitioner with an interest or specialism in obstetric and gynae surgery or a potential Trainee Assistant Practitioners to join our amazing obstetric and gynaecology theatre team.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This role is for Clinical Support Workers who currently work in theatre or have an interest in working in operating theatres to join our dynamic team. Whether you have experience or are looking to start a career in the operating theatre, WUTH is the organisation for you. The position for either role will be in our obstetric and gynae theatre team based across WUTH theatres. The posts available are full time positions of 37.5 hours per week. The obstetric and gynae theatre team provide skilled support to surgeons undertaking both benign and cancer surgeries in gynaecology and urogynaecology. The theatre team are also dedicated to providing excellent patient care for both elective and emergency obstetric surgery 24 hours a day. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The post holder will be required to work as part of a highly motivated team with real commitment to providing a high standard of patient care. You will be a dynamic motivated health care professional who has patient care and safety at the heart of everything you do.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;By joining us we will give you the support and development you need to become a practitioner of the future. With an initial internal training program and assessment you will achieve competence enabling you to develop your patient care skills. In return for your dedicated care Wirral University Teaching Hospitals can provide you with opportunities to develop into perioperative practitioners of the future. Being part of #PROUD team we can offer you staff benefits including Lease Car Scheme, Smoking Cessation Services, Childcare and Family Support and other healthcare related support packages. If you seek to work in a specialised team and wish to build an exciting and fulfilling career at Wirral University Teaching Hospital, then this is the role for you.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applicants must have NVQ level 2 or 3 in Healthcare Support. You will be expected to complete your apprenticeship within 24 months of your start date. Your initial apprenticeship pay rate is defined by the duration of the apprenticeship; your pay will increase throughout the duration of your apprenticeship when specific milestones are met. On completion of your apprenticeship and subject to all criteria being met, you will continue in your job role on a permanent contract with the trust at the designated pay scale.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Shift Pattern: five day cover comprising of variable shift patterns to support service delivery&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Modern Apprentice: fixed Term contract for 24 months under Annex 21 U of the pay terms and conditions&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Qualified AP : Permanent contract&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;For further details / informal visits contact:&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Nicola McClave&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Obs&amp;Gynae Theatre Coordinator&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;0151678 5111 ext 7199&lt;/em&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wirral University Teaching Hospital, Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251505", "validThrough": "2020-11-16T23:59:59+0000"}