{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 Per annum"}}, "datePosted": "2020-10-30T10:46:28+0000", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting new role for an experienced IT Service Desk Manager to lead a team of Service Desk Analysts and 2nd line support technicians to ensure incidents and service requests are completed within defined SLA’s.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a key role within the IT Business Operations team, providing management support to the Head of IT Service Delivery and acting as the customer escalation path for our IT users. Working to established ITIL principles and best practice guidelines, the IT Service Desk Manager will ensure that all activity is accurately recorded and documented whilst continually identifying areas for quality improvement.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for the direct line management, training and development of the analysts as well as ensuring that the IT Service Desk is adequately resourced to reflect peaks and troughs in the workload. With proven technical and customer service skills you will need to be an excellent communicator and people manager, with the experience of leading and motivating a team. Previous experience of running a similar service is essential. You will have strong relationship building skills with the ability to liaise with people at all levels of the business.&lt;/p&gt;\n&lt;p&gt;The IT Service desk is primarily based in Thurrock but runs as a virtual service desk, with a base in Colchester as well as agents working from home. The IT Service Desk currently operates between 8.45am to 5.15pm, Monday to Friday; the successful candidate will have a flexible attitude and be able to adjust to the operational needs of the department as and when required and will form part of the IT on-call rota.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return of your commitment, the Trust offers a wide range of training opportunities and career development.&lt;/p&gt;\n&lt;p&gt;EPUT are looking for motivated staff who shares our Trust values of Open, Compassionate and Empowering. In return, EPUT can offer you a range of benefits and development including;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Season Ticket Loans&lt;/li&gt;\n&lt;li&gt;NHS discounts for staff&lt;/li&gt;\n&lt;li&gt;Excellent Training facilities and opportunities&lt;/li&gt;\n&lt;li&gt;Buying and Selling annual leave scheme&lt;/li&gt;\n&lt;li&gt;The opportunity to work bank shifts and expand knowledge and experience in other areas&lt;/li&gt;\n&lt;li&gt;Salary Sacrifice schemes including lease cars and Cycle to Work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Informal queries and visits are welcome&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTraceyJob titleHead of IT Service Delivery and Customer ServiceEmail addresstracey.vanwyk@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thurrock Community Hospital, Grays", "postalCode": "RM16 2PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.496", "longitude": ".336337"}}, "title": "IT Service Desk Manger", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249783", "validThrough": "2020-11-13T23:59:59+0000"}