{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per annum (Pro Rata)"}}, "datePosted": "2020-10-12T13:16:14+0100", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANT RHEUMATOLOGIST WITH INTEREST IN ACUTE MEDICINE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is seeking a forward thinking, dynamic, enthusiastic Consultant to work 10 PAs among a team of 2.6wte Consultants, 1wte Specialist Registrar and 4.5wte nurse specialists in the department of Rheumatology.&lt;/p&gt;\n&lt;p&gt;As part of the agreed job plan, you will be expected to contribute to Acute Medicine Department which consists of a team of 8 Consultants and have a flexible approach to job planning to support service requirements. Our Acute Medicine on-site Consultant cover is from 8am-5pm weekdays and 8am-2pm on weekends. The Acute Medicine Consultant contribution to General Medicine on-call rota is approximately 1 in 30 which is only on weekdays.&lt;/p&gt;\n&lt;p&gt;The successful candidate should have the ability to adapt to the departments quickly to ensure the transfer of clinical workload causes minimal disruption to the department and to continuity of patient care.&lt;/p&gt;\n&lt;p&gt;The Rheumatology department in Basildon and Thurrock University Hospitals provide a comprehensive Rheumatology service with outpatient clinics provided in designated Rheumatology suites on the Basildon and Orsett Hospital sites. There are 2 clinic based ultrasound machines. The department has a very active and efficient Rheumatology Day Unit which is used for administration of intravenous therapy including cyclophosphamide and biologics and for various procedures including needle muscle biopsies, minor salivary gland biopsy, chemical synovectomy and ultrasound guided spine injections. The department work closely with other medical departments and provide prompt inpatients consultations for inpatients including those with complex multisystem disorders.&lt;/p&gt;\n&lt;p&gt;The department is currently collaborating with Orthopaedics, Pain management and Tier 2 Physiotherapy to develop a comprehensive well organised musculoskeletal service. The successful candidate would be expected to contribute actively to this ongoing aspect of service development.&lt;/p&gt;\n&lt;p&gt;The Acute Service provides a comprehensive range of in- and out-patient Services to a catchment population of 310,000 including an established Ambulatory Care Service. All acute services are highly valued by patients, hospital and GP colleagues. The consultants have clinical leadership roles in different sub-speciality areas and each is tasked to further develop their allocated service areas.&lt;/p&gt;\n&lt;p&gt;Approximately 20,000 patients are assessed annually (i.e. about 70 per day) with a wide spectrum of acute unselected medical problems.&lt;/p&gt;\n&lt;p&gt;The unit consist of 2 wards (male and female) and has a total of 40 beds. More than half of the beds have cardiac monitors. All patients are seen on a daily basis by consultants 7 days a week with support of a junior team. Typically the patients are split between 3 consultants allowing enough time to be dedicated to each patient.&lt;/p&gt;\n&lt;p&gt;For weekends the arrangements are slightly different, but all patients will be seen by a senior decision maker over the weekend as well. The dedicated team of junior doctors on AMU will consist of 1 SPR, 5 middle grades doctors, 2 ACCS trainees 5 FY2s, 1 Trust doctor and 1 FY1. Two experienced Nurse Practitioners also contribute to the day to day running of the ambulatory care unit.&lt;/p&gt;\n&lt;p&gt;The 2 AMUs have the services of phlebotomists, including Saturday and Sunday mornings.&lt;/p&gt;\n&lt;p&gt;There are 7 day imaging services available including MRI.&lt;/p&gt;\n&lt;p&gt;In-reach speciality services are available 5 days a week for all services and reduced services for agreed pathways over the weekend.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ambulatory Care Unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our quickly expanding Ambulatory Care Unit is now seeing over 1200 patients per month and is co-located with one of our AMUs with its own waiting area, assessment room, special examination chairs, trolleys and beds (a total of 16 chairs, trolleys and beds). Most trolleys, beds and examination chairs have cardiac monitoring facilities. It has its own dedicated staff.&lt;/p&gt;\n&lt;p&gt;Patients are seen by senior medical decision makers, mainly middle grade doctors with acute consultant support and supervision. All GP-referred patients are screened via the Ambulatory Care Unit as well as all clinic admissions and patients referred from ED suitable for the service. It is expected that this service will continue to expand very fast and more senior input from consultants will be required. The service is running 7 days a week.&lt;/p&gt;\n&lt;p&gt;The AMU consultants will cover the medical take Monday to Friday until 5pm with junior doctors from General Medicine. After 5pm an on-call consultant will be responsible for the medical take. The AMU consultant will only be responsible after 5pm when on-call which is roughly 1 in 30 for weekdays. On weekends the medical take is run by General Medicine and the AMU consultants are responsible only for the AMU and Ambulatory Care (1 in 8 weekends).&lt;/p&gt;\n&lt;p&gt;The appointee is anticipated to develop a hot rheumatology service attached to the ambulatory care unit.&lt;/p&gt;\n&lt;p&gt;As a University Teaching Hospital Trust linked with the University College London we value teaching and audit skills and emphasise the role of Clinical Governance in everyday clinical practice. The Trust is committed to driving improvement in the quality of clinical care and to innovation in models of service. We seek colleagues with the ability and willingness to teach in a multi-disciplinary environment, be flexible and adaptable to the challenges faced in the department and be pro-active in audit and governance issues. We will also provide mentoring for the appointee.&lt;/p&gt;\n&lt;p&gt;Our vision is to be an excellent provider of high quality, safe, care for our local community. We are constantly working to ensure that our patients receive the very best care the NHS has to offer, and many of our medical and surgical acute services have developed a reputation for excellence and innovation in their field. The Trust is rated ‘good’ by the Care Quality Commission (CQC) who&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon, Basildon", "postalCode": "SS16 5NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5577", "longitude": ".450587"}}, "title": "Consultant Rheumatolgist With Interest in Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222492", "validThrough": "2020-11-30T23:59:59+0000"}