{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum (pro rata)"}}, "datePosted": "2020-11-03T13:31:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Do you have passion and commitment to public health and the early intervention agenda and want to work in one of the most diverse and thriving cities in England&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are excited to welcome applicants for highly skilled, enthusiastic clinical practitioners who have a good understanding of the needs of children, young people and their families and want to be part of our journey to work as part of an integrated early years, health and wellbeing service.&lt;/p&gt;\n&lt;p&gt;BCHC fully supports a positive work live balance and currently have Health Visitor vacancies, full time/ part time plus job-share and 15hours per week contracts at various locations across the City. We support practitioners who have been out of practice for a while as we offer a Return to Practice framework, all of the above can be discussed at interview.&lt;/p&gt;\n&lt;p&gt;We also encourage the development of our Health Visitors and have a number of Band 7 posts that can be considered alongside either clinical or management development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Information about the Trust and our Health Visiting Service:&lt;/p&gt;\n&lt;p&gt;Our Trust values are about being&lt;strong&gt;: CARING, OPEN, RESPECTFUL, RESPONSIBLE and INCLUSIVE &lt;/strong&gt;and underpins all the work that the Trust does&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) is the lead provider in partnership with 2 national and 2 local Children’s Centre providers; for delivering the Healthy Child Programme and Early Year’s services within the City, the partnership is known as Birmingham Forward Steps. Therefore we have a multi skilled, diverse work force to support families.&lt;/p&gt;\n&lt;p&gt;Birmingham Forward Steps, integrated Health Visiting and Children Centre teams work across 10 districts within the City. Integrated allocation meetings are held for children and families who require services above the universal element of the Healthy Child Programme and therefore offer an innovative approach, supporting the ‘team around the child’ model.&lt;/p&gt;\n&lt;p&gt;Within Our own Health Visiting teams we have a dedicated skill mix of Band 4 and 5 roles to support the team and the families we support.&lt;/p&gt;\n&lt;p&gt;The commissioned integrated Early Years’ service is required to provide a service offer until 8pm one day (alternate weeks) and one weekend day per month in each district. As we provide services city wide there is the requirement to travel across the city. Access to suitable vehicle for business purposes is an essential part of this role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In addition &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are delighted to be able to offer an additional premia of £2,500 to caring and passionate Health Visitors who will join our service in order to deliver services to the children and families within the City of Birmingham. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The premia is payable in 3 instalments over 2 years on the basis that you remain within our Health Visiting teams for this period (subject to terms and conditions).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you have passion and commitment to the public health and early intervention agenda, we would love to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our commitment to equality, diversity and inclusion starts with our people shapes the way we deliver our services and the way we build our teams. We welcome candidates from diverse backgrounds to help us deliver great care to all of our communities.&lt;/p&gt;\n&lt;p&gt;If you wish to work with diverse populations across Birmingham in order &lt;strong&gt;&lt;em&gt;‘&lt;/em&gt;To give every child an equal chance to have the best start in life so they can achieve their full potential’,&lt;/strong&gt; this post would be well suited to you.&lt;/p&gt;\n&lt;p&gt;We welcome applicants to join our team with the following skills and knowledge:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An ability to adapt and embrace new ways of working&lt;/li&gt;\n&lt;li&gt;An ability to work autonomously within corporate and integrated teams&lt;/li&gt;\n&lt;li&gt;An inclusive leadership style with excellent interpersonal and communication skills&lt;/li&gt;\n&lt;li&gt;An up to date knowledge of the current health and early year’s agendas and priorities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;On joining our team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer excellent preceptor ship programmes, alongside development opportunities and leadership programmes. You will be supported by our clinical specialists, clinical Team Leaders, Service Managers and our Safeguarding Team in order to provide excellent professional practice and further develop your skills and knowledge.&lt;/p&gt;\n&lt;p&gt;Also an NHS pension, corporate iHV membership and on-going training and development opportunities e.g.: UNICEF training, Promotional Guidance training, and Perinatal Mental Health training.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please feel free to contact us further for an informal discussion about our plans and what we can offer each other.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tshiwe Madamombe on 07566 766398&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to receiving your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT INFORMATION&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centr&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various location across Birmingham, Various location across Birmingham", "postalCode": "B11 1LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4626", "longitude": "-1.87131"}}, "title": "Band 6 Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254169", "validThrough": "2020-11-17T23:59:59+0000"}