{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 to £42,712 pa Inclusive of HCAS"}}, "datePosted": "2020-10-13T13:05:33+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 6 Staff Nurse&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Cardiothoracic Surgery and Cardiology - &lt;span&gt;Juniper Ward&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Royal Brompton &amp; Harefield NHS Foundation Trust is the largest heart and lung centre in the UK and among the largest in Europe. We are a partnership of two specialist hospitals which are known throughout the world for their expertise, standard of care and research success.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are passionate about what we do and the patients we serve. We are an equal opportunities employer and our patients are rich in diversity. We recruit to ensure we build a similarly diverse mix across our workforce. We are a values led organisation and we are rightly proud of our world class reputation and our people.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The CQC visited the trust in October 2018 and our Surgical Directorate &lt;/span&gt;&lt;span&gt;was rated as outstanding. &lt;/span&gt;&lt;span&gt;Our priority is to deliver excellent patient care and are proud that the CQC has recognised our services and awarded us this rating.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Juniper is a 20 bedded private patient’s ward that includes 4 High Dependency beds. &lt;/span&gt;&lt;span&gt;The ward cares for patients pre and post lung and heart surgery, including transplant patients.&lt;/span&gt;&lt;span&gt;Juniper ward also cares for patients undergoing elective cardiology procedures.&lt;/span&gt;&lt;span&gt;There is the opportunity to undertake competencies to work within the High Dependency area if this is an area of interest to you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our Practice Education Team will support you through a supernumery period during your orientation to the ward. You will have the opportunity to attend in-house study days and regular surgical team days to support your learning and keep you up to date with current practice. &lt;/span&gt;&lt;span&gt;Following completion of relevant competencies, you will have the opportunity to complete a university-based post-graduate course.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Band 6 you will be expected to undertake our specific management competencies, mentor and support colleagues, contributing to key projects within surgery and act as shift leader.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for experienced nurses who are keen to work at the leading edge of cardiothoracic practice in a fast-paced ward setting. You will need to be a highly motivated nurse who is committed to delivering high standards of care and can demonstrate excellent clinical and communication skills. &lt;/span&gt;&lt;span&gt;If you are looking for a career in Cardiothoracic nursing, this is your chance to join a friendly and supportive team at Harefield Hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;For an informal chat or to arrange a visit contact Senior Sister Reeshma Ramroop on 01895 823737 ext. 85464 or email at r.ramroop@rbht.nhs.uk&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121402.jpg", "name": "Royal Brompton and Harefield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121402"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Middlesex - Harefield Hospital", "postalCode": "UB9 6JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6067", "longitude": "-.482733"}}, "title": "Band 6 Senior Staff Nurse - Acute Cardiothoracic - Juniper Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224420", "validThrough": "2020-11-08T23:59:59+0000"}