{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa pro rata"}}, "datePosted": "2020-11-03T14:01:36+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the Salisbury NHS Trust based in Salisbury and covering South Wiltshire and supporting North Wiltshire and Great Western Hospital.&lt;/p&gt;\n&lt;p&gt;The role is a full time 37.5 hours / week Mon – Fri 08:00 – 16:00 and will require a full driving license.&lt;/p&gt;\n&lt;p&gt;The Procurement Department is seeking to recruit an enthusiastic, organised and highly motivated individual to join their Materials Management team. This role is to enhance the level of service delivered to the Acute trust and to drive improvements. As a Materials Management Officer you will be responsible for ensuring that Wards / teams within the hospital have a continuous supply of goods in line with the Trust’s Material Management system. The role requires scheduled visits to the departments, undertaking stock inventory using Electronic Data Capture and other Materials Control systems. This will include investigating discrepancies, problem solving, contacting suppliers and conveying information to Ward Managers.&lt;br /&gt;The ideal candidate will have a full understanding of best customer service practices and possess the ability to work on their own initiative developing customer relationships and new effective order processes. Excellent communications skills are paramount and the ability to work unsupervised as well as part of a team. A good standard of general education and numerical competency is a must. Computer literacy is essential. Previous experience within procurement and the Health sector would be a distinctive advantage.&lt;br /&gt;In addition to the above duties the post holder may also be required to undertake Receipts and Distribution duties. The task is very physical in nature due to the picking, packing, sorting, and delivery of goods.&lt;/p&gt;\n&lt;p&gt;The successful candidate will assist the Operations and Logistics Manager in providing an effective and professional stores service that delivers on-going cost efficiencies / benefits to the Trust in line with departmental objectives.&lt;/p&gt;\n&lt;p&gt;For further details please see the attached job description and person specification, or alternatively should you require further information regarding the role please contact Ian Wilkinson on 01793 607482&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120765.jpg", "name": "Salisbury NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120765"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salisbury District Hospital, Salisbury", "postalCode": "SP2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0439", "longitude": "-1.78981"}}, "title": "Materials Management Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254249", "validThrough": "2020-11-17T23:59:59+0000"}