{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 Per Annum Inc"}}, "datePosted": "2020-11-05T15:31:31+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Southwark directorate provides inpatient and community services for working age adults within the London Borough of Southwark&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting an enthusiastic and experienced Clinical Service Lead to assist in the management of three inpatient wards including the Place of Safety.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for driving operational improvement in inpatient Services within the Directorate with day to day operational responsibility three inpatient wards.&lt;/p&gt;\n&lt;p&gt;There is also an exciting opportunity to support the directorate in the development of innovative projects to improve the pathway and service user experience and move to recovery&lt;/p&gt;\n&lt;p&gt;The Clinical Service Lead will report into the General Manager for inpatient services where they can escalate any issues pertaining to service delivery. The lead will maintain strong links with the Medical Lead, General Managers, other Clinical Service Leads and Deputy Director in the Directorate and will work in liaison with inpatient, community and rehabilitation services.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are based at Maudsley Hospital, Denmark Hill, London, SE5 8AZ&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located at Denmark Hill less than 5 minutes from the train station (zone 2). We also provide services and operate across other locations, such as London boroughs of Croydon, Lambeth, Lewisham and Southwark; and substance misuse services for residents of Bexley, Lambeth, Greenwich and Wandsworth.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChristopher FoxJob titleGeneral Manager for Complex CareEmail addressChristopher.Fox@slam.nhs.ukTelephone number07720340363&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maudsley Hospital, Denmark Hill, Camberwell, London SE5 8AZ, London", "postalCode": "SE5 8AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4687", "longitude": "-.091415"}}, "title": "Clinical Service Lead - Inpatient Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258351", "validThrough": "2020-11-12T23:59:59+0000"}