{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T14:46:34+0000", "description": "&lt;p&gt;Estates &amp; Facilities- Contracts, Governance and Compliance Team - Monitoring &amp; Projects Officer&lt;/p&gt;\n&lt;p&gt;Location/Base - Duncan Macmillan House, Nottingham&lt;/p&gt;\n&lt;p&gt;The Estates and Facilities Directorate provides a comprehensive range of quality estates and facilities services to a number of Healthcare organisations across the East Midlands. - Within this directorate is the Contracts, Governance and Compliance team. This team carries out the management, monitoring and auditing of outsourced contracts including Private Finance Initiatives (PFI&#39;s), LIFT Co, NHSPS, SLA&#39;s with Partner Organisations including neighbouring NHS Trusts. Also procures and manages external commercial contracts for a full range of FM services in Trust freehold premises.&lt;/p&gt;\n&lt;p&gt;A vacancy has arisen for an applicant to join the Contracts, Governance and Compliance team within Estates and Facilities undertaking formal and informal audits using various techniques across the full range of Estates and Facilities Services delivered to the Trust by external organisations. Also, manage ad hoc projects relating to the Trusts occupied estate.&lt;/p&gt;\n&lt;p&gt;To lead on a number of Facilities projects, including the auditing and monitoring of the Estates and Facilities Services provided to the Trust through organisations in third party hosted properties (predominantly hard FM but also soft FM), Service Level Agreements and commercial contracts giving assurances to the Trust Board and the Executive Team that the contractual obligations in accordance with the specifications and method statements are being met.&lt;/p&gt;\n&lt;p&gt;Manage the contracts ensuring that all financial governance and audit requirements are met. Liaise with service providers to resolve operational queries and issues, acting as a day to day point of contact.&lt;/p&gt;\n&lt;p&gt;To support managers in the delivery of Facilities Service Level Agreements and the monitoring of Service Level Agreements provided by others, and in the production and maintenance of information, tender requests and service contracts, in connection with external bodies (NHS and others).&lt;/p&gt;\n&lt;p&gt;Provide project management services and support as necessary to a wide variety of minor capital and associated schemes relative to the estate of the Trust and/or its client organisations.&lt;/p&gt;\n&lt;p&gt;Details of the Essential Criteria -&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Able to access roof spaces and undercrofts&lt;/li&gt;\n&lt;li&gt;Degree in Facilities services , Hard FM discipline or Appropriate level of industry experience&lt;/li&gt;\n&lt;li&gt;Auditing/inspection contracts ad contractors&lt;/li&gt;\n&lt;li&gt;Significant experience of operational Hard FM services in public sector, multi site organisations.&lt;/li&gt;\n&lt;li&gt;Sound knowledge of Facilities services across the industry.&lt;/li&gt;\n&lt;li&gt;Awareness of: Legionella&lt;/li&gt;\n&lt;li&gt;Electricity at work&lt;/li&gt;\n&lt;li&gt;Good working knowledge of MS windows standard software&lt;/li&gt;\n&lt;li&gt;Ability to converse in a professional, approachable and diplomatic manner with all customers.&lt;/li&gt;\n&lt;li&gt;Team member&lt;/li&gt;\n&lt;li&gt;Good negotiator highly motivated able to positively influence others.&lt;/li&gt;\n&lt;li&gt;Problem solver&lt;/li&gt;\n&lt;li&gt;Able to develop effective plans and programmes and deliver against KPI’s&lt;/li&gt;\n&lt;li&gt;Methodical and organised in administration&lt;/li&gt;\n&lt;li&gt;Excellent time management skills&lt;/li&gt;\n&lt;li&gt;Deliver objectives&lt;/li&gt;\n&lt;li&gt;Full UK driving licence &amp; own vehicle for business use/ access to independent means of transport in order to visit sites not accessible by public transport.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact Mandy Turton, Senior Monitoring Manager  on mandy.turton@nottshc.nhs.uk or 07810552681&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Paul Brougham, Facilities Monitoring and Projects Officer on Mob: 07813362320 or paul.brougham@nottshc.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Duncan Macmillan House, Nottinghamshire", "postalCode": "NG3 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9796", "longitude": "-1.12644"}}, "title": "Facilities Monitoring &amp; Projects Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254394", "validThrough": "2020-11-12T23:59:59+0000"}