{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22500", "minValue": "22500", "unitText": "YEAR", "value": "up to £22,500 per annum"}}, "datePosted": "2020-11-01T22:29:53+0000", "description": "&lt;h1&gt;Learn something new everyday&lt;/h1&gt;\n&lt;p&gt;Are you collaborative, caring and compassionate?&lt;br /&gt; &lt;br /&gt; Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;HMP Winchester is a category B men’s prison for those on remand to local courts. With an operational capacity of 690, HMP Winchester is based in Winchester, Hampshire; by car it’s approximately 20 minutes from Eastleigh, 25 minutes from Southampton, 30 minutes from Andover, Basingstoke and Newbury and 45 minutes from Salisbury. On foot, it’s a 20 minute walk from Winchester town centre and 15 minutes’ walk from Winchester train station.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Interested in development?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer opportunities to develop your specialist role. Examples include a NVQ level 3 in Social &amp; Healthcare, Immunisations / Vaccination Training, STIFF L1 competency and long term condition courses. As well as team essentials training.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;In return for your hard work you will…&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; Receive an annual salary of up to £22,500 (full time equivalent) depending on experience.&lt;/p&gt;\n&lt;p&gt;You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;br /&gt; Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt;Onsite benefits at HMP Winchester include access to an onsite gym and free parking.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;About the role and you…&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;p&gt;As a Sexual Healthcare Assistant at HMP Winchester you will have a wide variety of responsibilities. Some of these are; being involved in the implementation of Sexual Health and BBV screening and clinical care packages, providing health promotion and information on safe practices, promoting Sexual Health testing, support in the Management of positive test cases and chaperone Nurses for intimate examinations. You’ll also obtain blood samples to test for HIV and Syphilis alongside other Blood-Borne Viruses.&lt;/p&gt;\n&lt;p&gt;You will have completed a NVQ level 2 or 3 in Social &amp; Healthcare or equivalent qualification and phlebotomy training. Ideally you will have Immunisations/Vaccination Trained and STIFF L1 competency or, if you haven’t already achieved this, a willingness to undertake this training. You will be required to already have a basic knowledge of Sexual Health conditions and be computer literate.&lt;/p&gt;\n&lt;p&gt;As our specialist Healthcare Assistant you will be working closely with all healthcare teams, taking part in the Triage of Sexual Health patients, therefore you will have experience of working in teams under appropriate supervision as part of a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;Next steps&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; If you are shortlisted, you will be contacted by Amelia Smith, the Internal Recruiter for this role.&lt;br /&gt; &lt;br /&gt; Amelia will submit your CV to the hiring manager and then will arrange an interview if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;More information&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; This is a part-time role working 30 hours per week, including evenings, weekends and Bank holidays.&lt;br /&gt; &lt;br /&gt; For more information, an informal discussion or to arrange an informal visit please contact us on the details provided.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested.&lt;/em&gt;&lt;br /&gt; &lt;br /&gt; Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester", "postalCode": "SO22 5DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0624", "longitude": "-1.32874"}}, "title": "Sexual Health Healthcare Assistant - HMP Winchester", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251213", "validThrough": "2020-11-16T23:59:59+0000"}