{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inc"}}, "datePosted": "2020-10-27T14:02:16+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for a friendly and enthusiastic speech and language therapist to join our team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a full-time permanent Band 5 role available in our Early Years team. You will be working with parents and children aged between 2 and 3 ½ years in clinics, and supporting children in nursery and reception classes. You will see children with a broad range of speech, language and communication needs, and be involved in offering a range of different interventions. The service as a whole works within the Care Aims framework and seeks to enable children to communicate more effectively and get the most out of home and school life. The team is a supportive and friendly one where your enthusiasm, empathy and creativity will be welcomed.&lt;/p&gt;\n&lt;p&gt;We provide group clinical supervision, individual line management, a programme of in house training and support, along with ad hoc support from experienced colleagues who will share your office base.&lt;/p&gt;\n&lt;p&gt;Our large, friendly, diverse and supportive SLT office is based at Mile End Hospital, conveniently located between Mile End and Stepney Green tube stations and serviced by a number of local buses. Locations around Tower Hamlets are easily reached by walking, by bike or by public transport.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some quotes from our recent NQTs:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;“I started in Tower Hamlets as a newly qualified therapist and have absolutely loved working with such an amazingly diverse range of families and children. I have benefited from excellent supervision and feel lucky to learn each day from such knowledgeable, caring and supportive colleagues. It’s a great place to start your career, build your confidence and then continue your professional development.”&lt;/p&gt;\n&lt;p&gt;“I can honestly say that I felt so welcome from day 1. The team have really supported me as a newbie and are always willing to answer any questions I have!”&lt;/p&gt;\n&lt;p&gt;“The support I’ve received and resources available to me have been invaluable as an NQP. I have autonomy at work and am trusted by senior staff – there’s no micro-managing! I feel comfortable asking questions and seeking support from everyone in my team”.&lt;/p&gt;\n&lt;p&gt;For more information about this post, please contact Clair Chen, Lead SLT for Early Years and Autism Spectrum Disorder on clairchen@nhs.net or 07927 682 995.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mile End Hospital, London", "postalCode": "E1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5245", "longitude": "-.04262"}}, "title": "Speech and Language Therapist - Community", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244862", "validThrough": "2020-11-10T23:59:59+0000"}