{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £44,503 per annum"}}, "datePosted": "2020-11-02T14:31:20+0000", "description": "&lt;p&gt;To strengthen our Echocardiography Service we have developed an exciting opportunity for an enthusiastic and ambitious Cardiac Physiologist to train in Echocardiography as well as delivering some core Cardiac Physiology Services. The post is primarily a training post in which the successful candidate will move from a Band 6 to a Band 7 on completion of accreditation with the British Society of Echocardiography. Comprehensive support and training will be given to the successful candidate. The candidate will also be expected to deliver other cardiac diagnostics tests (eg: ETT, ambulatory ECG analysis etc) as required by the needs of the department.&lt;/p&gt;\n&lt;p&gt;Harrogate Cardiology provides high quality diagnostic cardiac services, including stress echo, TOE, angiography. We are a productive and well organised team working with high quality equipment to provide the best possible care to our patients. Our cardiac cather lab is currently undergoing a refurbishment which will allow an expansion of services through the lab in the future.&lt;/p&gt;\n&lt;p&gt;We live the values of the organisation in all that we do and look forward to welcoming a high calibre candidate to further strengthen this high performing team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLee BancroftJob titleHighly Specialist Cardiac PhysiologistEmail addressLee.bancroft2@nhs.netTelephone number01423 553323&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate District Hospital, Harrogate", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Senior Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252438", "validThrough": "2020-11-16T23:59:59+0000"}