{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa plus HCAS"}}, "datePosted": "2020-10-26T16:31:22+0000", "description": "&lt;p&gt;&lt;br /&gt;West London NHS Trust’s Health Based Place of Safety (HBPoS) is looking to recruit band 4 mental health care assistants to join our busy and exciting multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;The WLT HBPoS (HBPoS) provides 24/7/365 care to those detained under S136 and S135 of the Mental Health Act. The service is about ensuring the right care and attention is provided to those in crisis who have come to the attention of the police, to ensure that their health is not managed in police custody.&lt;/p&gt;\n&lt;p&gt;The position of HBPoS HCA is an exciting and challenging opportunity for the right candidate. You will be able to demonstrate excellent communication skills while providing first line advice, support, and information to a wide range of clients. The post holder will provide support when someone, both known to services and unknown comes to the unit.&lt;/p&gt;\n&lt;p&gt;You will need to have important assessment skills, a knowledge of the legal framework of mental health law and an understanding of mental health diagnosis, as well as an interest in psychosocial interventions. The post holder will be given clinical supervision by qualified staff and management responsibility is with the HBPoS Team Manager.&lt;/p&gt;\n&lt;p&gt;The HBPoS team is a highly motivated, diverse, energetic and has a ready to help attitude. Our professional and multi-disciplinary staff group whose ability to intercede on behalf of patients across all levels of healthcare is nurtured and respected.&lt;/p&gt;\n&lt;p&gt;We believe in embracing the expertise of our nurses, allied health professionals and HCAS, and making a difference to the lives of our clients. Working in this service places you on the frontline of community mental health care and will equip you with the skills you need to respond to a variety of clinical needs at short notice and provide you with potential future career development.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This post will demand that you are highly motivated, can be flexible in an ever changing environment and can communicate effectively across a multi-professional team. Please see the job description for further information on this role.&lt;/p&gt;\n&lt;p&gt;By joining our team you will have also access to the following benefits:&lt;br /&gt;• 27 day holiday scheme rising to 29 after 5 years and 33 after 10 years&lt;br /&gt;• Flexible working Scheme *&lt;br /&gt;• Excellent opportunities for development&lt;br /&gt;• Competitive NHS pension scheme&lt;br /&gt;• Childcare vouchers&lt;br /&gt;• Cycle to work scheme&lt;br /&gt;• Access to NHS discounts with retailers and leisure companies (please see link)&lt;br /&gt;* These schemes are subject to individual job roles.&lt;/p&gt;\n&lt;p&gt;For further queries about this post please contact Kim Davidson on 020 8483 2887 or email Kim.Davidson@westlondon.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKim DavidsonEmail addressKim.Davidson@westlondon.nhs.ukTelephone number020 8483 2887Additional contact information&lt;/p&gt;\n&lt;p&gt;Flu vaccination – what we expect from our staff&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;At West London we look after patients who are vulnerable. Each year, seasonal flu affects thousands of people in the UK. Occurring mainly in winter, it is an infectious respiratory disease capable of producing symptoms ranging from those similar to the common cold, through to the very severe or even fatal disease.&lt;/p&gt;\n&lt;p&gt;The wellbeing of our staff and patients is of the utmost importance to us, and it is the expectation of the Trust that all patient-facing staff have an annual flu vaccination, provided free of charge by the Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "16249 Virtual Hub Hounslow, Isleworth", "postalCode": "TW7 6AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4741", "longitude": "-.326168"}}, "title": "HBPoS HCA", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243425", "validThrough": "2020-11-09T23:59:59+0000"}