{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58301", "minValue": "55457", "unitText": "YEAR", "value": "£55,457 - £58,301"}}, "datePosted": "2020-10-30T13:29:44+0000", "description": "&lt;p&gt;The Integrated Commissioning Team is looking for an experienced, knowledgeable and motivational leader to focus on the commissioning and management of all-age disability services as part of a 3-day per week job share for 12 months. The services in scope range from working on the learning disability and autism agenda with NHS England to commissioning short breaks for children.&lt;/p&gt;\n&lt;p&gt;The Specialist Commissioning Manager will oversee the daily delivery of commissioning activity within the team to support the new Buckinghamshire Council and Clinical Commissioning Group to deliver transformational change and improve outcomes with available resources.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a keen interest in health and social care, should be committed to making a difference and will enjoy working in a fast-paced, sometimes pressured but friendly environment. You must be able to think strategically, analytically and creatively to identify ways to do things differently with the ability to lead and manage a small team.&lt;/p&gt;\n&lt;p&gt;As a Specialist Commissioning Manager, you will be at the forefront of leading large and complex pieces of work across the health and social care system. You will lead a small team working on all aspects of the commissioning cycle, addressing strategic priorities by commissioning services which are safe, high quality and value for money.&lt;/p&gt;\n&lt;p&gt;This post is a job share for 3 days per week for a 12 month period; the post is shared by an established Specialist Commissioning Manager. Splits in areas of work will be decided upon appointment and dependent upon the skills and experience of the appointee. The team is focussed around the commissioning and contract management of all-age disability services, ensuring that vulnerable people receive timely and effective Care and Treat Reviews (or Care, Treatment and Education Reviews), residents avoid unnecessary inpatient admissions and services work to ensure those with a learning disability and/or autism live as independent a life as possible. Additionally, the team commission integrated therapies services on behalf of the CCG and Council as well as a comprehensive short breaks service for children and young people. This is therefore an exciting opportunity for the successful candidate to work with a wide range of partners across health, adult social care and children’s services to improve the quality and delivery of services for residents of all ages across the county.&lt;/p&gt;\n&lt;p&gt;We are looking for self-motivated, enthusiastic candidates with the following experience and skills, who will play a crucial role in developing an inclusive, ever-improving, forward-thinking culture to achieve integrated working across health and social care to improve the lives of Buckinghamshire residents:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of working within a management capacity in a complex multi-agency service organisation&lt;/li&gt;\n&lt;li&gt;Experience of leading and managing change&lt;/li&gt;\n&lt;li&gt;Strong commissioning performance and/or contracting experience&lt;/li&gt;\n&lt;li&gt;Experience of working successfully and effectively as part of a management team, conveying strategies, policies, objectives, and targets to team members&lt;/li&gt;\n&lt;li&gt;Knowledge of quality assurance and improvement, and performance management processes&lt;/li&gt;\n&lt;li&gt;Knowledge of procurement and contracting practice&lt;/li&gt;\n&lt;li&gt;Experience of advising heads of service on portfolio areas.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post is a 3 day per week job share for a 12 month fixed term contract.&lt;/p&gt;\n&lt;p&gt;The post holder must be able to travel to meetings and meet providers across Buckinghamshire.&lt;/p&gt;\n&lt;p&gt;This post is exempt under the Rehabilitation of Offenders Act 1974. Due to the sensitive nature of the duties the post holder will be expected to undertake a criminal record check as part of the recruitment process.&lt;/p&gt;\n&lt;p&gt;This is a politically restricted post.&lt;/p&gt;\n&lt;p&gt;For further information please contact Sally Parkinson, Head of Service – Integrated Commissioning –&lt;span&gt;sally.parkinson@buckinghamshire.gov.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131354.jpg", "name": "Buckinghamshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aylesbury", "postalCode": "HP20 1XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8145", "longitude": "-.812314"}}, "title": "SPECIALIST COMMISSIONING MANAGER – ALL AGE DISABILITY TEAM", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250349", "validThrough": "2020-11-22T23:59:59+0000"}