{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-21T14:12:35+0100", "description": "&lt;p&gt;Community Staff Nurses - various hours available&lt;/p&gt;\n&lt;p&gt;If you&#39;re an ambitious professional in search of the work-life balance that others can only dream about, prepare for a very pleasant surprise. Locala Community Partnerships are seeking enthusiastic, motivated, reliable Community Staff Nurses who are keen to support and deliver a range of quality nursing services to our patients within Kirklees. We are looking for people with energy, enthusiasm and drive, as well as excellent professional skills. We are able to consider tailored working hours in practice to meet those required for registration and to meet personal needs, we can consider those who can only work weekends and evenings.&lt;/p&gt;\n&lt;p&gt;Working within the integrated community care team, you will undertake duties involving delivery of nursing services and holistic assessments of patients health needs using a person centered approach. This includes providing quality and seamless nursing care to housebound patients and being proactive in coordinating their care needs as appropriate, avoiding unnecessary admission to hospital or long term care institutions. In addition, you will have the opportunity to be involved in facilitating self-care for patients with long term conditions, health promotion and innovative activities and projects that enhance patient service delivery.&lt;/p&gt;\n&lt;p&gt;An enthusiasm to support our teams to deliver high quality services is a must for this role, and you will also need to demonstrate excellent communication and interpersonal skills with the ability to be adaptable, reliable and approachable. &lt;br /&gt; &lt;br /&gt; In return to develop your career in Community Nursing, we can offer you excellent learning and development, clinical supervision and preceptorship for newly qualified nurses.&lt;/p&gt;\n&lt;p&gt;We pride ourselves in providing safe, clean and friendly care, and recruit to our Locala values&lt;strong&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact Julia Waud julia.waud@locala.org.uk or Michelle Sunter michelle.sunter@locala.org.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126414.png", "name": "Locala Community Partnerships CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126414"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kirklees", "postalCode": "HD5 9TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6511", "longitude": "-1.74339"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236766", "validThrough": "2020-11-08T23:59:59+0000"}