{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-27T12:05:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Community Nurse &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band - 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Salary – £24,907- £30,615 per annum&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;Hours per week – 30&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base –&lt;strong&gt;Tewkesbury &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gloucestershire Health &amp; Care NHS Trust provides care for approximately 600,000 adults, children, and young people across Gloucestershire, including community inpatient and outpatient services, public health nursing, community nursing and therapy staff. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Right now we are looking for caring and compassionate Community Staff Nurses who are looking for a new challenge and career development. As a Registered Nurse you will work as part of an Integrated Community Team alongside our MDT colleagues undertaking care of people in their homes across the diverse range of interventions and case management opportunities that community nursing offers.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To excel in this role you will require excellent communication skills, the courage to make clinical decisions and a willingness to develop your potential. You will require current NMC registration as a Registered Nurse, post-registration experience is helpful but not essential and we have an excellent preceptorship programme for newly qualified nurses. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You need to be able to work part time or full time over a shift system which includes early and late shifts across 7 days including weekends and bank holidays.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are a modern trust, which means whilst on the go you’ll be equipped for mobile working (using a laptop and smart phone device); not only is this safer because you will have access all patient information at your fingertips, it also means you can complete records and any other patient paperwork in real time, so you can then focus all your attention on your next patient.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure when completing your application you detail how you meet the person specification requirements.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For information or enquiries, please contact Sian Stillwell (Team Manager) on 01452 328238 or email sian.stillwell@ghc.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 10th November2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 11th November2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tewkesbury", "postalCode": "GL20 5TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9868", "longitude": "-2.16467"}}, "title": "Community Nurse - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244404", "validThrough": "2020-11-10T23:59:59+0000"}