{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - 30,615 pa"}}, "datePosted": "2020-11-05T09:28:08+0000", "description": "&lt;h2&gt;Staff Nurse - All Wards&lt;br /&gt;Full Time and Part time Hours available&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;**Previous applicants need not apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for a new challenge?&lt;/strong&gt;&lt;strong&gt;An exciting opportunity has arisen at The Walton Centre for registered nurses to join our neurosurgical and neurology wards.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Walton Centre NHS Foundation Trust is the only dedicated neuroscience Trust in the UK where you will care for patients with a range of conditions affecting the brain and spine. We are proud of the expert and compassionate care we provide which has been recognised by the CQC who awarded an outstanding rating to the Walton Centre NHS Foundation Trust in 2016 and again in 2019. We have recently maintained our Investors in People Award Gold, demonstrating our commitment to supporting staff, which only 2% of UK Trusts possess.&lt;/p&gt;\n&lt;p&gt;As a Staff Nurse within the Trust you will be responsible for the delivery of high quality patient centred care and should be committed to patient safety. You will have the opportunity to rotate within varied areas of neuroscience care as part of our preceptorship programme where you will be supported through study and mentors within the ward area. You will gain a wide range of experience caring for post-operative surgical patients as well as those requiring long term neurological care.&lt;/p&gt;\n&lt;p&gt;This is an extremely exciting opportunity for applicants who possess excellent standards of communication with a desire to deliver excellent standards of patient care to a specialist group of patients.&lt;/p&gt;\n&lt;p&gt;If you wish to be part of an Outstanding Trust and work with an outstanding team, please apply.&lt;/p&gt;\n&lt;p&gt;Visit our Social media pages to find out more about whats going on at The Walton Centre search &#39;&lt;em&gt;The Walton Centre&lt;/em&gt;&#39; on facebook and instagram and &#39;&lt;em&gt;Walton Centre&lt;/em&gt;&#39; on twitter!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120725.JPG", "name": "Walton Centre NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120725"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L9 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4665", "longitude": "-2.93093"}}, "title": "Staff Nurse - All Wards", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257045", "validThrough": "2020-11-19T23:59:59+0000"}