{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26970", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 / £26,970 / £27,416 / £30,615"}}, "datePosted": "2020-09-28T15:25:46+0100", "description": "&lt;h2&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Staff Nurses for Beechwood Wards (Medical Stepdown) at The Evington Centre, Leicester.&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for Band 5 Staff Nurses who have experience in medical nursing who will take individual responsibility for their work and for their patients, ensuring they have a positive experience and who can demonstrate care and compassion with frail older patients.&lt;/p&gt;\n&lt;p&gt;These positions are also suitable for newly qualified or return to practice nurses to join our preceptorship programme.&lt;/p&gt;\n&lt;p&gt;You will be based on Beechwood Ward - female medical in-patient ward at the Evington Centre caring predominantly for frail, elderly, and/or medically unwell patients. The community hospital wards manage a range of specialities including sub–acute medically unwell patients, those who have complex discharge needs and palliative patients for symptom control or ‘end of life’ care.&lt;/p&gt;\n&lt;p&gt;The Wards all have a multi-disciplinary approach to patient management. Family and MDT goal setting are an integral part of the registered nurse role in all our in-patient areas. Supported by the Ward Sisters and Matron, you will demonstrate and develop your professional accountability, innovative thinking and contribute to the clear vision for the in-patient nursing areas.&lt;/p&gt;\n&lt;p&gt;We offer training and personal development within the Wards and at our Learning and Development Centre to ensure you have the knowledge and skills to meet patient needs and complete your revalidation CPD requirements.&lt;/p&gt;\n&lt;p&gt;You will be supported through a programme of training to ensure you are able to meet your clinical and leadership requirements to provide safe effective care on the ward.&lt;/p&gt;\n&lt;p&gt;We are looking for Nurses who share our passion and commitment for providing high quality care through sound clinical decision making in our busy in-patient wards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In addition we offer free parking on all our sites. We offer flexible working patterns and an opportunity to work predominantly days or predominantly nights. We can clarify this at interview.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We strongly recommend that you visit Beechwood ward during the application process so that you understand fully the types of patients on our Wards, our patient management process with the MDT, how we facilitate timely discharges and communicate this to our patients and their families.&lt;/p&gt;\n&lt;p&gt;Please contact Sophie Daveney (PA to Hospital Matron) on Mobile: 07827939385 or email sophie.daveney@leicspart.nhs.uk for further information and to arrange a visit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Evington Centre, Leicester", "postalCode": "LE5 4QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6306", "longitude": "-1.08552"}}, "title": "Band 5 Staff Nurses - Leicester City (Medical Stepdown Wards)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916203197", "validThrough": "2020-11-29T23:59:59+0000"}