{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15482", "minValue": "15482", "unitText": "YEAR", "value": "£9.21"}}, "datePosted": "2020-11-02T15:53:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an Experienced Receptionist/Administrator&lt;/strong&gt; &lt;strong&gt;and&lt;strong&gt; looking for Temp Work&lt;/strong&gt;?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Oxford University Hospitals (OUH) is a world-renowned centre of clinical excellence and one of the largest NHS teaching trusts in the UK.&lt;/strong&gt; They became a Foundation Trust on 1 October 2015 and believe that this will enable them to work more effectively in partnership with their patients and their local community to provide high quality healthcare.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;They provide a wide range of clinical services, specialist services (including cardiac, cancer, musculoskeletal and neurological rehabilitation) medical education, training, and research.&lt;/p&gt;\n&lt;p&gt;           &lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Who work as a team to provide a high-level service? If yes, Oxford University Hospitals NHS Foundation Trust is the place for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a &lt;strong&gt;Part time&lt;/strong&gt; placement opportunity available for a Band 2 Receptionist administrator available at the Churchill Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We would like an administrator to join the Head &amp; Neck Cancer unit team. If you have a good understanding of EPR and Microsoft Office, then please do get in touch. We would really like someone who can give us regular hours and become an integral part of our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The working pattern for this role is Monday-Wednesday 8am-4pm or 9am-5pm&lt;/p&gt;\n&lt;p&gt;To provide a professional and efficient reception service to the Head &amp; Neck Cancer Unit, ensuring that all patients and visitors are welcomed to the department in an appropriate manner whilst adhering to the Trust Policy on Data Quality.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To provide a professional, comprehensive and effective administration support service to the administration, nursing and the wider medical teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;2. Reception Responsibilities&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To greet patients at reception in a helpful, polite and efficient manner.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           Check all demographics details for patients on arrival, updating these appropriately whilst adhering to the Trust policies for data protection and patient confidentiality.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           Register patient’s attendance on EPR in real-time. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           Deal with enquiries in a sympathetic and professional manner using tact and diplomacy when dealing with anxious patients and relatives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To adhere to correct manual handling procedures and policies at all times.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To book follow up appointments accurately ensuring that the correct referral to treatment (RTT) status is recorded in accordance with Trust guidelines.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To ensure that special requests for additional support in clinics such as interpreters or sign language services are dealt with timeously.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To ensure that all reception clinic lists are available, up to date and accurate, recording all late bookings, cancellations and DNA’s appropriately.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To ensure patients are checked in and out of clinic and future appointments are made on the day of attendance wherever possible and to ensure outpatient procedure activity is captured from outcome forms using the HIM chart coding function in EPR.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To ensure that all patients’ notes are present and prepared the day before the clinics, highlighting any notes that are missing to relevant line manager for each clinic.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To arrange return transport for patients attending appointments at the request of the senior nurse or Arriva and Oxford Ambulance. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           Escort patients to their clinic room if required to do so.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To make sure the relevant reception areas within the Directorate are kept tidy and in good repair, with any defects being reported to the relevant line manager.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To work flexibly in terms of location across John Radcliffe Hospital and Churchill Hospital, as necessary, to cover peaks and troughs of work across the Directorate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To be able to prioritise your workload and work with minimal supervision.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•           To undertake further training as and when required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades, and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to hearing from you soon. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252719", "validThrough": "2020-11-16T23:59:59+0000"}