{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 inc 5% HCAS"}}, "datePosted": "2020-10-12T08:54:30+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;‘Intensive Support Service- Rated Outstanding for Leadership’&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a RNLD / RMHN to join theIntensive Support Service, within the Trust&#39;s Learning Disabilities Directorate. The Intensive Support Service is an innovative team, created in response to the Transforming Care agenda. The main service is based in the Epsom area.&lt;/p&gt;\n&lt;p&gt;We support people with learning disabilities and complex needs, within the community and inpatient settings.&lt;/p&gt;\n&lt;p&gt;The service is designed to support people whose mental health and/or behaviour support needs put them at risk of admission to hospital, or of placement breakdown.&lt;/p&gt;\n&lt;p&gt;A new multi-disciplinary team has been established, to provide an enhanced service alongside the Community Teams disabilities across Surrey.&lt;/p&gt;\n&lt;p&gt;The post-holder would be involved in shift leading for the service and supporting people within the community by assessing and advising on care needs. The post will offer excellent opportunities for development and support within the community crisis team and the inpatient unit. This post may also involve working across the inpatient unit.&lt;/p&gt;\n&lt;p&gt;Opportunities for joint working with other disciplines and agencies would be an integral part to the role.&lt;/p&gt;\n&lt;p&gt;Working pattern: (37.5 hours per week) 24 hour / 7 day week service, which include night shift, working weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;The post-holder would need to hold a full driving license and be prepared to work flexibly in various locations across the Trust.&lt;/p&gt;\n&lt;p&gt;Excellent communication skills and confident use of IT would be key in this role.&lt;/p&gt;\n&lt;p&gt;For informal visits further information or questions please contact Selven Daniel on 01372 206 305. We look forward to your application!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom", "postalCode": "KT19 8PH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.337", "longitude": "-.298015"}}, "title": "Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221595", "validThrough": "2020-11-10T23:59:59+0000"}