{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 £79,860 to £107,668 pa"}}, "datePosted": "2020-10-16T16:46:07+0100", "description": "&lt;p&gt;&lt;strong&gt;OXFORD RADCLIFFE HOSPITALS NHS TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; CONSULTANT IN MEDICAL ONCOLOGY specialising in Uro-oncology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are keen to appoint a dynamic Consultant Medical Oncologist to join our team of 54 Consultant Oncologists working whole-time or part-time in Oxford and the regional units (22 of whom are University appointments). This 10 PA post is based at the Oxford University Hospitals NHS Foundation Trust at the Churchill and visiting the Horton hospital.&lt;/p&gt;\n&lt;p&gt;The post specialises in Urological malignancies, and will work with existing Medical and Clinical Oncology colleagues, clinical nurse specialists, nurse and pharmacist prescribers, as well as other members of the multidisciplinary teams across these tumour sites. The post-holder will also participate in a 1:25 rota for Consultant of the week, AOS for the oncology ward and triage at the Churchill Hospital. We are keen that the post holder undertakes and supports the development of our telemedicine clinics, and there will be the opportunity to contribute to service improvement projects in this field.&lt;/p&gt;\n&lt;p&gt;The oncology department in Oxford moved into a £110M comprehensive diagnostic and treatment cancer centre in 2009. Chemotherapy is prescribed using a pan cancer network e-prescribing system (Aria). The department works closely with the University Department of Oncology providing excellent opportunities for collaborative cancer research.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Candidates are highly recommended to visit the department and hospital and are invited to contact Professor Andrew Protheroe, Consultant Medical Oncologist and Lead for Uro-Oncology, Oxford University Hospitals NHS Trust (Tel: 01865 223663 ) and Professor Bass Hassan, Clinical Director Oncology and Haematology (Tel: 01865 235891).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oncology Medical Staffing A64380, Oxford", "postalCode": "OX3 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "CONSULTANT IN MEDICAL ONCOLOGY", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231168", "validThrough": "2020-11-29T23:59:59+0000"}