{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa pro rata"}}, "datePosted": "2020-11-02T14:01:23+0000", "description": "&lt;p&gt;&lt;strong&gt;University Hospitals Bristol and Weston NHS Foundation Trust is one of the largest acute Trusts in the country and a major teaching and research centre. With 13,000 staff, 10 hospitals and over 100 different clinical services, we support the delivery of excellent care to the people of Bristol, Weston-Super-Mare and beyond.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Consultant Cardiac/Cardiothoracic Radiologist to join our dedicated team of 2.8WTE Consultants in this specialty.&lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol and Weston is the tertiary referral centre in the South West for cardiology and cardiothoracic surgery for both adult, GUCH and paediatric populations.&lt;/p&gt;\n&lt;p&gt;We have seen an increase in growth of cardiac and TAVI CT of over 40% in the last 2 years and this is an additional Cardiac Radiology posts to cope with increasing demand.&lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol has recently merged with Weston Trust and opportunities have arisen to develop the cardiac CT service at the new site.&lt;/p&gt;\n&lt;p&gt;The successful candidates will also support general imaging reporting in UH Bristol as well as acute imaging / on call. On call is 1:19 weekdays and 1:13 weekends with Radiology Registrar cover and outsourcing overnight.&lt;/p&gt;\n&lt;p&gt;The Radiology Department is well-equipped, and is strongly involved in research and training, hosting 15 specialist Radiology trainees from the Severn Deanery at any time as well as Fellows.&lt;/p&gt;\n&lt;p&gt;Bristol was rated as the best city to live in the UK by the Sunday Times in 2017. Bristol has coast and countryside right on its doorstep. There is a real buzz about the city, and whether you are looking for culture, sport, shopping or eating out, it is all here for you. The city has strong transport links, and faster rail networks will see journey times to London cut to just 80 minutes. Bristol is the UK&#39;s first Cycling City, acknowledging the city&#39;s growing status as one of Europe&#39;s most bike-friendly destinations, and in 2015 Bristol became UK’s first European Green Capital.&lt;/p&gt;\n&lt;p&gt;Please note: CVs are not used in the short-listing process. If you are shortlisted your CV will be made available to the interview panel.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Mandy Williams&lt;/p&gt;\n&lt;p&gt;Clinical Director, Radiology&lt;/p&gt;\n&lt;p&gt;Email address - mandy.williams2@UHBristol.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number - 0117 342 9378&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Mark Hamilton-Cardiac Radiologist via email mark.hamilton@uhbristol.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Consultant Cardiac Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252312", "validThrough": "2020-11-29T23:59:59+0000"}