{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43200", "minValue": "35100", "unitText": "YEAR", "value": "£35,100 - £43,200"}}, "datePosted": "2020-11-05T13:18:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title: Trust Operations Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Wirral University Teaching Hospital, Arrowe Park Hospital 2nd Floor NHSP Office, Arrowe Park Road, Upton, Wirral CH49 5PE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £35,100 - £43,200&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type: Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you passionate and exceptional at delivering operational service delivery within fast paced and a forever changing environment? Do you have the magic recipe to lead, manage and motivate a team to not only meet but exceed KPI’s within a temporary workforce solutions organisation?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If this sounds exciting to you and you have what it takes, keep reading…..&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;About the Role &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;You will join the NHS Professionals team in this critical role as our Trust Operations Manager and will do an amazing job at providing operational service delivery leadership and management to the local NHSP Trust Services Team and customer support for the NHSP bank workers (flexible workers) and NHS client stakeholders ward managers, ensuring all contact with NHSP is quick, simple and helpful.&lt;/p&gt;\n&lt;p&gt;The aim of the Trust Services on-site team is to facilitate meeting Trust client flexible workforce needs by filling bank shifts whilst ensuring the workers requirements are also met or exceeded, overall ensuring customer requirements and KPIs are met.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Duties and Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Responsible officer and main point of contact for the Trust operational account delivery and management of operational Trust stakeholder relationships. Ensure agreed and documented operational delivery plans. Develop credibility in service provision through key working relationships to support client retention.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Maintain full knowledge and understanding of Trust commercial contracts and KPIs, monitoring performance against these and creating and implementing service improvement plans. Focus on service and commercial excellence to meet demand and support increased client satisfaction.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Oversee the Trust’s requirements for flexible workers with a view to meeting or exceeding agreed fulfilment and satisfaction targets.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Partnership working with Trusts including regular communications to review service performance, illustrating success and identifying areas for improvement and engaging them in working in partnership to achieve the best outcomes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Creation of service development and performance reports identifying opportunities or areas of excellence or underperformance. Maintain accurate documents following meetings or interactions with Trusts.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work with Trust to understand and effectively plan for their future requirements ie seasonal planning.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work with TSAM to develop plans to support client satisfaction.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Manage implementation of new service areas, such as additional staff groups or the introduction of new departments, ensuring a positive experience for both the ward manager and flexible worker.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To fully thrive and succeed in this role, it is imperative you the appointed candidate can quickly establish strong working relationships with both the Trust management stakeholders, ward manager and flexible worker communities with the end goal of delighting our customers; our aim is to be a “customer obsessed” organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working in the NHS. healthcare or similar customer service environment&lt;/li&gt;\n&lt;li&gt;Proven experience of managing and leading a high performing team&lt;/li&gt;\n&lt;li&gt;Able to demonstrate previous experience of developing and implementing new processes to improve service&lt;/li&gt;\n&lt;li&gt;Experience of performance management and development of team members&lt;/li&gt;\n&lt;li&gt;Experience of managing operational delivery and KPI achievement.&lt;/li&gt;\n&lt;li&gt;Experience of developing operational plans.&lt;/li&gt;\n&lt;li&gt;Experience of presenting operational plans and achievements to stakeholders.&lt;/li&gt;\n&lt;li&gt;Experience of budget management&lt;/li&gt;\n&lt;li&gt;Change management skills within a complex environment&lt;/li&gt;\n&lt;li&gt;Change management skills within a complex environment&lt;/li&gt;\n&lt;li&gt;Ability to effectively manage complex complaints&lt;/li&gt;\n&lt;li&gt;Collaborative working across professions and services; both internal and external&lt;/li&gt;\n&lt;li&gt;IT literate including Microsoft software to include Word, Excel and PowerPoint&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;More reasons to apply: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment, NHS Professionals can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary with a company backed self-development scheme, and the opportunity for unrivalled progression&lt;/li&gt;\n&lt;li&gt;27 days’ annual leave per year plus 8 public holidays&lt;/li&gt;\n&lt;li&gt;Access to a stakeholder pension scheme&lt;/li&gt;\n&lt;li&gt;Health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Access to an employee discount &amp; recognition scheme&lt;/li&gt;\n&lt;li&gt;Ability to buy and sell annual leave.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If a hospital cannot supply staff on a ward or area, due to increased demand, sickness, or common staff shortages, they need to call upon Bank staff. NHS Professionals works with trusts to develop ‘bank’ of highly skilled workers (bank members) who want to work flexibly with the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently saving the NHS £70 million per year&lt;/strong&gt; through the dedicated work of our passionate teams, so if you&#39;re looking for a new and challenging role that contributes to making a real difference, then we look forward to receiving your application to join NHS Professionals today.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are &lt;strong&gt;successfully shortlisted&lt;/strong&gt;, the &lt;strong&gt;Talent Acquisition team will contact you for a telephone interview&lt;/strong&gt;. Following this telephone interview if successful you will be informed of the next steps.&lt;/p&gt;\n&lt;p&gt;Join us on our ‘customer obsessed’ mission!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;*Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 14 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close this vacancy early if enough applications are received. In 2010 NHS Professionals moved to Limited Company status and therefore Agenda for Change terms and conditions are not applicable to this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Corporate Staff", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120988"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Trust Operation Manager - Wirral", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257853", "validThrough": "2020-11-19T23:59:59+0000"}