{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T15:31:10+0000", "description": "&lt;p&gt;Critical Care Clinical Skills and Learning Facilitator&lt;/p&gt;\n&lt;p&gt;William Harvey Hospital – Band 6&lt;/p&gt;\n&lt;p&gt;We are a busy, dynamic and forward thinking 16 bedded Critical Care Unit We are looking to expand our Clinical Education team by recruiting a Critical Care Clinical Skills and Learning Facilitator – Band 6 to assist with the development of our workforce.&lt;/p&gt;\n&lt;p&gt;We are looking for a registered nurse with 3 years critical care experience and that have the critical care course. The candidate needs to be motivated and passionate about educating and developing our new staff and staff already in post.&lt;/p&gt;\n&lt;p&gt;This post involves working closely with the Band 7 - Clinical Nurse Educators and working clinically, alongside staff to assist them in developing the skills needed to deliver safe and effective care to our critically ill patients. We aim to not only provide the highest standards of care but to also develop a workforce that feels valued, respected and that they are making a real difference to their patients.&lt;/p&gt;\n&lt;p&gt;By being an expert critical care nurse with excellent communication, time management and organisational skills you will be an excellent role model for our staff.&lt;/p&gt;\n&lt;p&gt;The post holder will have the responsibility to ensure that the new and junior staff in the Critical Care Unit can demonstrate the development of clinical competence through competency documents provided by the critical care unit. The post holder will also assist with the completion of the National Competency Framework for Adult Critical Care nurses Step 1 Book for nurses within their first year in critical care.&lt;/p&gt;\n&lt;p&gt;The post holder must share the trusts mission ‘&lt;strong&gt;&lt;em&gt;Great Healthcare from Great People’&lt;/em&gt;&lt;/strong&gt; and embrace the trust values so that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;People feel &lt;strong&gt;cared&lt;/strong&gt; for as individuals&lt;/li&gt;\n&lt;li&gt;People feel &lt;strong&gt;safe&lt;/strong&gt;, reassured and involved&lt;/li&gt;\n&lt;li&gt;People feel that we are &lt;strong&gt;making a difference&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;People feel teamwork, trust and &lt;strong&gt;respect&lt;/strong&gt; sit at the heart of everything we do&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you would like to join us and think you have the experience and fit the job description, our friendly team would love to welcome you.&lt;/p&gt;\n&lt;p&gt;To find out more about working with us, or to arrange an informal visit to see us in action, please contact:&lt;/p&gt;\n&lt;p&gt;Anna Reilly - Clinical Nurse Educator on 01233 616114.&lt;/p&gt;\n&lt;p&gt;For further information about the Trust, please access the documents below, or visit our website&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Harvey Hospital, Ashford", "postalCode": "TN24 0LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1415", "longitude": ".91624"}}, "title": "Critical Care Clinical Skills and Learning Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248881", "validThrough": "2020-11-12T23:59:59+0000"}