{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Pro Rata Per Annum"}}, "datePosted": "2020-11-06T14:46:29+0000", "description": "&lt;p&gt;&lt;strong&gt;Do you aspire to deliver excellent maternity care?&lt;/strong&gt; This is the philosophy of Doncaster &amp; Bassetlaw Maternity services.&lt;/p&gt;\n&lt;p&gt;If you are caring and compassionate, there has never been a more exciting time to join our team.&lt;/p&gt;\n&lt;p&gt;Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust are committed to creating the best place to work, where all staff can reach their full potential. We believe in promoting and enhancing inclusion, diversity and equality and welcome and encourage applications from all areas of the community, who meet the criteria for the role, regardless of age, gender, disability, race, religion or sexual orientation.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an experienced midwife to explore your potential.&lt;/p&gt;\n&lt;p&gt;NHS England has committed to fulfilling the ambition in the Five Year Forward View for Mental Health, so that by 2020/21 there will be increased access to specialist perinatal mental health support in all areas of England, allowing at least an additional 30,000 women each year to receive evidence-based treatment, closer to home, when they need it. This includes the right range of specialist community and inpatient care.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an enthusiastic highly motivated midwife with a vision to develop and maintain high standards of care for women with mental health problems in pregnancy and the postnatal period. The post holder will need to have a high level of relevant expert knowledge and skills, to manage, develop and lead care for pregnant women and new mothers with mental health needs.&lt;/p&gt;\n&lt;p&gt;You must be able to demonstrate excellent leadership skills, be a caring and compassionate individual focused on providing excellent quality patient care, working within the values held by the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why join our team? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Service we believe in choice. We are passionate about women centred care, and are committed to offering a wide range of experiences and development for our staff. We aim to provide the best possible standards of care in a warm, relaxed, friendly environment and we are committed to providing this in partnership with women, their families and the multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;With a diverse community and around 4700 births at home, or on one of our two sites, we have an ambitious plan across the Local Maternity System for transforming maternity services aligned with the Better Births recommendations in order to meet the needs of the women with in the local population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join our team and support our vision of delivering the right care first time, every time. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Elaine Merrills - Maternity Matron for Inpatients, elaine.merrills@nhs.net, 01302 642206&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN2 5LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5308", "longitude": "-1.10926"}}, "title": "Specialist Midwife for Perinatal Mental Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260197", "validThrough": "2020-11-22T23:59:59+0000"}