{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "47500", "minValue": "42500", "unitText": "YEAR", "value": "£42,500 - £47,500 dependent upon experience"}}, "datePosted": "2020-10-07T11:14:02+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Providing quality, inspiring innovation and delivering value is what we set out to achieve at Priory Healthcare. We enable our patients to receive a truly integrated and holistic approach to their treatment, regardless of complexity or severity, thanks to the knowledge and expertise of our multidisciplinary clinical teams.&lt;/p&gt;\n&lt;p&gt;At Stockton Hall Hospital, just outside York, we are well-known for producing positive clinical outcomes for highly complex patients. We provide a medium-secure care setting in which patients access a broad range of therapeutic interventions including one-to-one and group-based psychological treatments. Our service has produced excellent recovery results for patients, maximising their opportunity to progress to conditions of lower-security as safely and efficiently as possible.&lt;/p&gt;\n&lt;p&gt;The facility is split across seven wards, providing care for up to 112 male and female patients with a broad range of diagnoses including autism spectrum disorder, learning disability, mental illness, personality disorder, and those with a settled-in presentation that necessitates a long-term rehabilitative approach. This diverse patient population makes Stockton Hall a fulfilling and stimulating environment in which to work, and provides the opportunity to develop a broad range of clinical competencies as well as areas of clinical specialism.&lt;/p&gt;\n&lt;p&gt;Mill Garth Hospital, in Leeds, is a 21-bedded recovery service for males aged 18 years and over. The hospital focuses on active rehabilitation and recovery for those with mental illnesses and personality disorders, and aims to provide individuals with the confidence and skills to move or return to the community. We adopt an integrated treatment approach and encourage patients to be involved in the decisions that are made regarding all aspects of their care. We promote social inclusion and have excellent links to the community that enable our patients to take part in voluntary work and education, and to access local support networks. We also actively encourage families and carers to be a part of the treatment process, including participation in review meetings whenever possible.&lt;/p&gt;\n&lt;p&gt;Our homely setting provides a range of facilities that promote real work and vocational opportunities, as well as allowing for a wide range of group sessions and activities. All patients receive an individualised timetable, covering seven days a week, which includes one-to-one and group-based therapy.&lt;/p&gt;\n&lt;p&gt;If you are looking to join a dynamic, well-established Psychology Department within a successful and respected service, and wish to take your next meaningful steps within your psychology career, then we have an opportunity for you.&lt;/p&gt;\n&lt;p&gt;The current vacancy involves a unique opportunity to work across two related but diverse sites, involving the lead role in developing the psychological service at Mill Garth Hospital (three days) and a clinical role on a complex and stimulating ward at Stockton Hall (two days). Although this configuration amounts to one full-time position, consideration will also be given to part-time applicants or individuals who may be interested in working at only one of the two sites in question.&lt;/p&gt;\n&lt;p&gt;The successful individual will be an enthusiastic forensic or clinical psychologist, ideally with post-qualification experience of working with complex patients in secure or locked settings. Whilst the range of clinical contact will be broad, experience of working with autism spectrum disorder would be of further benefit.&lt;/p&gt;\n&lt;p&gt;You will be involved in both assessment and treatment, including the use of structured risk assessment measures and one-to-one and group-based interventions relating to a range of needs such as sexual and violent offending, fire-setting, problem solving, substance misuse and anger management. Approaches used within individual therapy will largely employ a CBT approach, though opportunities also exist in relation to other models depending upon interest and experience, including Dialectical Behaviour Therapy and Radically Open Dialectical Behaviour Therapy, Cognitive Analytical Therapy, Compassion-Focused Therapy, Acceptance and Commitment Therapy and EMDR.&lt;/p&gt;\n&lt;p&gt;As part of a multi-disciplinary team you will assist with the development, delivery and evaluation of the evidence-based interventions across both sites, in order to comply with best practice principles. Your role will also incorporate staff training, staff formulation and de-brief sessions, research, and supervision of other staff, including members of the Psychology Department and teams of programme facilitators.&lt;/p&gt;\n&lt;p&gt;You will have the ability to apply psychological knowledge to a psychiatric setting, adopting a systematic approach and responding flexibly to both the treatment requirements of mentally disordered individuals and the complexities associated with organisational settings.&lt;/p&gt;\n&lt;p&gt;You will have full registration as a Practitioner Psychologist with the Health and Care Professions Council (HCPC). Some post-registration experience is desirable, though not essential. Experience of working with patients detained under the Mental Health Act (1983) is advantageous.&lt;/p&gt;\n&lt;p&gt;For further information please contact Ian Wootton, Head of Psychology, or Tracy Brookes, Consultant Forensic Psychologist, on 01904 400500.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the UK’s leading providers of behavioural care and specialist support services to adults and young people, Priory Group promise a challenging and fulfilling career with the support of a world class organisation willing to invest in your development.&lt;/p&gt;\n&lt;p&gt;Across our network of hospitals, residential care homes, education facilities and supported living services, we are making a real and lasting difference to the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.Priory Group will cover the cost of a DBS check.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS6 4RA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8286", "longitude": "-1.56986"}}, "title": "Psychologist or Senior Psychologist (Forensic or Clinical)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216160", "validThrough": "2020-11-13T23:59:59+0000"}