{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29583", "minValue": "26544", "unitText": "YEAR", "value": "£26,544 - £29,583 per annum"}}, "datePosted": "2020-11-06T10:33:39+0000", "description": "&lt;p&gt;An exciting opportunity has now become available within the Adults’ Health &amp; Care Reablement Service. We are seeking highly skilled, enthusiastic, and self-motivated Team Leader to join our service in the South East of Hampshire.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; There may also be opportunities to work across Hampshire as part of a county wide Reablement Service comprising Occupational Therapy, Sensory Services and CQC Registered Community Response Staff. &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;What you will be doing:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;As a Reablement Team leader, you will be responsible for participating in the Triage process, receiving, and assessing referrals for the Reablement team.&lt;/li&gt;\n&lt;li&gt;You will undertake assessments with the service user to identify Reablement needs and plan Reablement interventions to promote independence working to agreed goals and outcomes. &lt;/li&gt;\n&lt;li&gt;You must be able to demonstrate using a strengths-based approach to provide advice and information for clients to problem solve their own needs and make informed decisions on their Reablement journey.&lt;/li&gt;\n&lt;li&gt;We are currently working to develop strong links with our colleagues in Health, integrated intermediate care hubs and hospitals, to support discharge pathways and avoiding unnecessary hospital admissions. You will be instrumental in the success of this service development. &lt;/li&gt;\n&lt;li&gt;You will have excellent communication, interpersonal and team player skills.&lt;/li&gt;\n&lt;li&gt;There is a responsibility to line manage reablement assistants within the team, therefore, previous line management experience would be advantageous but not essential&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return, you will receive professional ongoing training, comprehensive induction and the full support of Managers, Occupational Therapists and Sensory Loss Officer&#39;s who will provide coaching and mentoring. We will also help you to gain a National Professional qualification and develop your career within Adults&#39; Health and Care. &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hampshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129457"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fareham", "postalCode": "PO13 0FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.837", "longitude": "-1.17718"}}, "title": "Reablement Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259248", "validThrough": "2020-11-22T23:59:59+0000"}