{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39774", "minValue": "36711", "unitText": "YEAR", "value": "£36,711 - £39,774"}}, "datePosted": "2020-10-21T09:22:28+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;About Us&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Newham is an incredibly diverse borough with a very young population and is experiencing considerable regeneration as part of the Olympic legacy. There are over 86,000 children and young people in Newham and we want each of them to have the same life chances as young people in other parts of London.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Newham’s Children and Young People’s Services is currently undertaking an exciting transformation programme to create integrated Early Help and Safeguarding services for our children, young people and families. Our main aim for integrated working is to get it right first time for more children and young people. To do this, we plan to grow our early help offer so that we make a real impact on children and young people’s learning, achievement, health, wellbeing and resilience. We will closely align our services to improve accessibility for residents and to strengthen partnerships between statutory, specialist, early help and universal services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is directly employed by the London Borough of Newham, whom was the first London borough to offer a fully integrated 0-19 health and social care service, after it assumed direct responsibility for providing School Nursing services, Health Visiting and Family Nurse Partnership in 2017. Therefore our Brighter Futures directorate will be delivering the 0-19 Healthy Child programme through the Children’s Health 0-19 Service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;The Children&#39;s Health 0-19 service had their CQC inspection in 2019 and rated Good in all areas.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Job&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Health Visitor &lt;strong&gt;&lt;em&gt;&lt;span&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;£36,711 - £39,774 inclusive of the high cost area supplement - LBN P03 equivalent to AfC Band 6&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;This post may attract a market supplement to facilitate salary alignment with current equivalent AfC pay grade if applicable.&lt;/em&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We have a permanent and stable management team in the Children’s Health Service and are now recruiting experienced Health Visitors to the remaining vacancies in our Health Visiting Service.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;The overall purpose of the job is;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide a health visiting service to all children and their families based on a national 4,5,6 health visiting model and evidenced by the Health Child Programme 0-5 years (HCP)&lt;/li&gt;\n&lt;li&gt;Responsible for developing health promotion and public health programmes in accordance with identified needs,local and National directives&lt;/li&gt;\n&lt;li&gt;To prepare reports for and participate in child protection conferences, Team around the family, Neighbourhood Acting meetings, court attendances and multi-agency planning meetings as required&lt;/li&gt;\n&lt;li&gt;Develop, implement and evaluate health plans in response to the identified needs of the individual, family and community in partnership with clients. This included planning with families who have complex health and social needs in partnership with parents and carers&lt;/li&gt;\n&lt;li&gt;To actively participate in clinical supervision and child protection supervision&lt;/li&gt;\n&lt;li&gt;Through collaborative working, participate in the identification of local health needs and the development of strategies to meet them.&lt;/li&gt;\n&lt;li&gt;To work within the London borough of Newham Children’s Health service Safeguarding policies; participate in, and develop, early intervention initiatives designed to detect and prevent child maltreatment and neglect, attending relevant meetings and case conferences as required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Further information and duties can be found in the attached job description&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;About You&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Be a registered Nurse (essential)&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;Have a Specialist Community Public Nurse Qualification - Health Visitor (essential)&lt;/li&gt;\n&lt;li&gt;Hold a current NMC registration (essential)&lt;/li&gt;\n&lt;li&gt;Have a BSC/ Post graduate degree or equivalent&lt;/li&gt;\n&lt;li&gt;Have a ENB 998/997 or recognised teaching qualification&lt;/li&gt;\n&lt;li&gt;Be able to assess effectively, manage risk and plan in an outcome focused way.&lt;/li&gt;\n&lt;li&gt;Be confident in delivering and willing to improve upon effective direct work interventions with families.&lt;/li&gt;\n&lt;li&gt;Remain focused on your own continuous professional development.&lt;/li&gt;\n&lt;li&gt;Strive to share learning and collaborate with practitioners and multi-agency partners to achieve outcomes for children and their families.&lt;/li&gt;\n&lt;li&gt;Be IT literate e.g. using clinical systems, word processing, email and internet use.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;Our offer &lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Genuine management support: &lt;/em&gt;&lt;/strong&gt;Low supervisor/supervisee ratios.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Money matters: &lt;/em&gt;&lt;/strong&gt;Flexible starting salary within the allocated grade for the right candidates. Subsidised leisure passes. Generous local government annual leave allowance. Pension scheme. Continued access to the NHS Pension Scheme (NHSPS) for health professionals who satisfy the NHS Pension scheme criteria. NHS continuous service recognised.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Learning &amp; Development:&lt;/em&gt;&lt;/strong&gt; Support to take up advanced clinical training and wider workforce development package to enhance your skills. Clear competency and career progression framework. Access to smart technology.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Contact&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information, please contact ChildrensHealth.Recruitment@newham.gov.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please also see attached the &#39;additional information&#39; document to review our recruitment statement and LBN terms and conditions.&lt;/p&gt;\n&lt;p&gt;Please note shortlisted candidates will be contacted via email within two-four weeks of the advert closing date. Whilst affected by COVID-19, interviews may be facilitated by video, using Zoom.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Previous candidates need not apply&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "London Borough of Newham", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newham", "postalCode": "E16 2QU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5077", "longitude": ".047331"}}, "title": "Health Visitor - B6 equivalent", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235650", "validThrough": "2020-11-06T23:59:59+0000"}