{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "11767", "minValue": "11767", "unitText": "YEAR", "value": "Band 6 or 7"}}, "datePosted": "2020-10-21T11:56:19+0100", "description": "&lt;p&gt;Whittington Health trust are looking for Band 6 or 7 Occupational Health Therapist’s to join their bank team within The Haringey Children’s Occupational Therapy service, based at the Child Development Centre, offers a service to all eligible children/young people (CYP) aged from birth to school leaving age who live in or attend an education setting in Haringey or who is registered with a Haringey GP. The caseload for this post is in a variety of settings: Child Development Centre / Nursery through to secondary school settings.&lt;/p&gt;\n&lt;p&gt;Main Duties of the role will include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To carry a personal clinical caseload maintaining a high level of professional competence and demonstrate developing clinical expertise.&lt;/li&gt;\n&lt;li&gt;To administer specialist standardised and non-standardised assessments, interpret results and contribute to accurate diagnosis and prognosis within the team responsible for the child’s care.&lt;/li&gt;\n&lt;li&gt;To assess and treat individual children with complex needs, in their homes and school or clinic setting, working as part of the multi-disciplinary team, and liaising closely with education staff and parents/carers.&lt;/li&gt;\n&lt;li&gt;To assess, order, set up and review/adjust specialist seating for CYP with postural management needs.&lt;/li&gt;\n&lt;li&gt;To use a range of communication strategies to overcome barriers to communicating e.g. language, communication difficulties or cognitive impairment and English as a second language, in order to engage and motivate the child and their family/carers in their Occupational Therapy treatment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Essential Requirements:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Current HCPC Registration&lt;/li&gt;\n&lt;li&gt;6 months NHS experience in a similar role&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whittington", "postalCode": "N19 5NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5667", "longitude": "-.138149"}}, "title": "Bank Band 6 or 7 Children&#39;s Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236221", "validThrough": "2020-11-30T23:59:59+0000"}