{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T15:16:06+0000", "description": "&lt;p&gt;South Lakes Community Mental Health Team (CMHT) are looking to recruit a qualified Band 6 Mental Health Nurse. The applicant would need to be registered with the NMC. This is a permanent 37.5 hour contract. The successful candidate may be required to work in either the Non-Psychosis Service Line or the Psychosis Service Line and undertake CMHT tasks as required.&lt;/p&gt;\n&lt;p&gt;The team serves the population of South Lakes within the Lake District and has its base in Kendal. It is an established team with a friendly and supportive culture. There is a visible and supportive leadership team who are committed to clinical supervision and professional development.&lt;/p&gt;\n&lt;p&gt;The main job role is to perform duties as a Care Coordinator and to undertake assessments for people who are referred into the service. As a Care Coordinator you will manage a caseload of service users with a range of complex needs. You will develop care plans and deliver evidence based interventions and treatments to patients alongside managing risks in the community.&lt;/p&gt;\n&lt;p&gt;Part of your role will require you to undertake the role of team duty worker. This role involves managing unplanned patient work within the team, responding to escalation of risk/crisis situations and may also include the triaging of new referrals.&lt;/p&gt;\n&lt;p&gt;There is an expectation that the successful candidate will take on some leadership activities such as contributing to the learning and development of junior team members taking a lead on/or contributing to projects identified by the South Lakes CMHT leadership team.&lt;/p&gt;\n&lt;p&gt;In return you will benefit from encouragement to continue to develop your own specialist knowledge and competence. Your development will be guided using clinical supervision, management supervision, Team/Peer support, internal and external training opportunities and the Trust’s appraisal process.&lt;/p&gt;\n&lt;p&gt;The service is based at Garburn House, Burton Road, Kendal. The service is operational between the hours of 9.00am and 5pm however some out of hours and weekend working may be necessary to meet service demands.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alex Gabriel (Team Lead) alex.gabriel@lscft.nhs.uk or Lauren Laisby (Clinical Team Lead) lauren.laisby@lscft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Garburn House, Kendal", "postalCode": "LA9 7RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3067", "longitude": "-2.73255"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248828", "validThrough": "2020-11-12T23:59:59+0000"}