{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-03T13:31:09+0000", "description": "&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We currently have a 1 x permanent posts for a Band 5 RMN 37.5 hours per week, hours are negotiable and part time will be considered for the right candidate. The post is in the Goole Older People’s Community Mental Health Team, currently based at Bartholomew House in Goole.&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated and enthusiastic individual to work within an established and busy Community Mental Health Team. The applicant will be expected to have an interest in Dementia and some previous experience in this area would be an advantage, however training and support will be given. Working within this speciality, will give you the opportunity to enhance your skills and many will be transferable to all aspects of mental health nursing.&lt;/p&gt;\n&lt;p&gt;There is an expectation that the successful candidate will coordinate and manage a caseload for individuals and carers within a community setting, who are experiencing problems with organic and/or functional mental health conditions.&lt;/p&gt;\n&lt;p&gt;The team routinely accommodates and mentors Nursing/OT students in progression through their training and in their final placement. There will be an expectation that the successful candidate will undertake Mentorship training at the earliest opportunity, unless this has already been achieved.&lt;/p&gt;\n&lt;p&gt;We have a wealth of experienced staff able to support newly qualified staff through their preceptorship.&lt;/p&gt;\n&lt;p&gt;We as a team are passionate about our work. We have a good record of staff retention, staff only leaving to retire or move on up their chosen career path. As a Team Leader, I will support you in developing your specific interests related to this service.&lt;/p&gt;\n&lt;p&gt;For those wishing to apply for the post on secondment they must obtain their managers permission to do so before applying.&lt;/p&gt;\n&lt;p&gt;The ability to commute within the Trusts geographical area with access to the appropriate means of transport is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated Good by the Care Quality Commission. The Trust is also proud to be HSJ Provider of the Year 2019 award winners.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,800 staff across more than 79 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Hull has benefitted from being included The Guardian’s ‘Hot List’ of places to visit and rated by Rough Guides as one of the top ten cities in the world to see. The nearby town of Beverley was named by The Sunday Times as one of the ten best places to live in the north. The area boasts a wide array of diverse property from coastal cottages to riverside apartments. Hull and the East Riding of Yorkshire offer some of the most competitive house prices in the country, with access to excellent schools and further and higher education providers.&lt;/p&gt;\n&lt;p&gt;The region has great transport connections with an hour commute York or Leeds. Want to go further afield? There are daily ferry crossings from Hull to Belgium and the Netherlands and from Humberside Airport you can reach destinations across Europe and – via Schiphol – worldwide.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Jackie Vagg Email: jackie.vagg@nhs.netTelephone number: 01405608288 / 07980931338&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Goole, DN14 6AL", "postalCode": "HU10 6ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7726", "longitude": "-.448921"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254156", "validThrough": "2020-11-17T23:59:59+0000"}