{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "78486", "minValue": "68573", "unitText": "YEAR", "value": "£68,573 - £78,486 pa HCA inclusive"}}, "datePosted": "2020-10-27T13:01:04+0000", "description": "&lt;p&gt;‘London Northwest University Healthcare Trust is building its organizational development team and people resources to support the Trust at a time of transformation and unprecedented change. This is a fantastic opportunity to be part of a new leadership team supporting our organisation to shape its form and culture, build diverse leadership thought and facilitate change in a way that continues to make the organisation a great place to train and work. We have refreshed our People Strategy and aligned with our transformation team to deliver &lt;em&gt;The Way Forward&lt;/em&gt; Strategy at pace and with purpose. We need you onboard to make change happen!&lt;/p&gt;\n&lt;p&gt;If you have significant experience as in organisational development, culture change and equality and diversity within complex organisations then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;You will have the skills to work with colleagues in all parts of our complex system to address the ongoing challenge of living with COVID whilst undertaking major change to ensure we are looking longer term. You should also have strong people management skills.&lt;/p&gt;\n&lt;p&gt;You do not need experience in health (although this may be helpful) but you must be a very experienced leader and manager comfortable working within complex organisations and able to evidence success as a strategic change leader with first class influencing skills.&lt;/p&gt;\n&lt;p&gt;If you are interested in discussing this position further please email obi.maduako-ezeanyika@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nameobibugo Maduako-EzeanyikaJob titleAssistant Director of OD and LearningEmail addressobi.maduako-ezeanyika@nhs.netTelephone number0208869 5095&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital - cross site working rrequired, Harrow London", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Head of Organisational Development Culture, and Diversity", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244639", "validThrough": "2020-11-13T23:59:59+0000"}