{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata + 5% HCAS"}}, "datePosted": "2020-10-15T12:05:31+0100", "description": "&lt;h1&gt;&lt;span&gt;Band 7 - Community Matron&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We are currently recruiting for a dedicated and motivated Band 7 Community Matron to join our community nursing team in the Epsom Primary Care Network. The team is based at New Epsom &amp; Ewell Community Hospital, Epsom. The Community Team visit patients in their own home as well as care homes. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Community Matron will work within an integrated team to proactively manage, co-ordinate and support patients with multiple complex long term conditions, with responsibility for ensuring all health and social care needs are met to improve health outcomes, functional status and quality of life, ensure integration of all elements of care, increase patient choice and prevent unnecessary admissions to hospital and reduce the stay of necessary hospital admissions. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact – India Multani, Operational Manager, Epsom Primary Care Network, &lt;/span&gt;&lt;span&gt;i.multani@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;About Surrey Downs Health &amp; Care&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a partnership between the three GP Federations, community trust and acute trust, Surrey Downs Health and Care is delivering true transformational change for adult community services across Surrey Downs to the benefit of patients and the local healthcare system. Our delivery model is formed around a shared vision and innovative use of the wealth and diversity of both the clinical and managerial experience that the partnership brings and as such it will provide a truly holistic, person-centred service that no one partner could provide on its own.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The model focusses on care being provided through distributed clinical leadership using Primary Care Networks (networks of GP practices working together with combined practice populations of around 50,000); integrated community bedded services and specialist services with the development of pathways into and out of the acute trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123532.JPG", "name": "CSH Surrey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom", "postalCode": "KT19 9HG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3471", "longitude": "-.265028"}}, "title": "Band 7 - Community Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228102", "validThrough": "2020-11-12T23:59:59+0000"}