{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inc HCAS"}}, "datePosted": "2020-11-05T15:01:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Golden Hello&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;This position attracts a recruitment incentive bonus for successful applicants of 10% of gross salary to a maximum of £2500. Further details are included in the attached document.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;We are looking for both Bank positions and permanent positions, we can also offer flexible working! &lt;br /&gt;&lt;br /&gt;Are you caring, compassionate and committed? Do you want to provide the best possible care to every patient?&lt;br /&gt;&lt;br /&gt;The role will be based in our St Pancras Inpatient Rehabilitation Unit, and will offer you the chance to learn about other nursing services within Integrated Adults which include: District Nursing, Rapid Response, Heart Failure, Diabetes, Continuing Care, the Respiratory team and Complex Care.&lt;br /&gt;&lt;br /&gt;St Pancras Rehabilitation Unit&lt;br /&gt;&lt;br /&gt;The St Pancras Inpatient Rehabilitation Unit in Camden has consistently been rated as Good both by the external CQC visit last year and our organisation-wide internal review processes. Part of this rigorous assessment is to assess the quality of care and the support, leadership and training and development opportunities that the unit offers to staff. The unit is consistently achieving Outstanding for the compassion of care that staff provide there. The unit provides rehabilitation services for people requiring:&lt;br /&gt;&lt;br /&gt;- Neurological rehabilitation&lt;br /&gt;- Complex rehabilitation following a deterioration in functioning&lt;br /&gt;- Disability management&lt;br /&gt;&lt;br /&gt;We are looking for nurses who are kind and caring but also understand the importance of rehabilitation and working with patients to improve their independence. In return for everything you give you will receive, support, development, dedicated supervision and a first class learning experience of all aspects of rehabilitation nursing.&lt;br /&gt;&lt;br /&gt;We operate 24 hours a day 7 days a week and you will be expected to work on a rota. You will be part of a multi-disciplinary team of doctors, therapists, social workers and health care assistants all focused on rehabilitating our patients to returning home where possible.&lt;br /&gt;&lt;br /&gt;We have recently secured additional investment in our nursing staffing, and we are recruiting to increase our establishment across the unit to enhance the quality of patient care and we would like you to be part of this growth with us.&lt;br /&gt;&lt;br /&gt;There is a full time Tissue Viability Specialist based on inpatients who is dedicated to supporting your development in the care of wounds and the prevention of pressure ulcers. In addition, the unit is supported by Advanced Nurse Practioners from the Rapid Response team as well as specialist nursing services such as Diabetes, Continence and Heart Failure.&lt;br /&gt;&lt;br /&gt;CNWL Camden&lt;br /&gt;&lt;br /&gt;CNWL is recognised locally, nationally and internationally for providing high quality, innovative healthcare. Our track record in recruiting only the best people is well known, and our experts are frequently called upon to contribute to national health strategy and policy, and many models of our care have been adapted for use in other countries.&lt;br /&gt;At CNWL Camden we provide high quality nursing services for rehabilitation inpatient care, district nursing 24/7 including a day service, twilight and overnight. We also have an early hospital discharge team PACE and a Rapid Response team to prevent patients avoidable hospital admissions, we are proud of our achievements. That’s why we need nurses like you to help us to continue to do what we do best. &lt;br /&gt;&lt;br /&gt;Benefits of working as a nurse for CNWL Camden:&lt;br /&gt;&lt;br /&gt;* Inner London weighting&lt;br /&gt;* Training and career development opportunities, including access to Specialist Practitioner District Nursing degree and other education.&lt;br /&gt;* Open to flexible working patterns.&lt;br /&gt;* Good opportunity for progression: nurses identified for development and regular internal promotion of our staff.&lt;br /&gt;* 6 month community preceptorship programme&lt;br /&gt;* Experience of working in a vibrant and diverse Central London location. &lt;br /&gt;* Band 5 St Pancras Inpatients attracts a Golden Hello bonus of 10% of salary, up to £2,500&lt;br /&gt;&lt;br /&gt;Camden is home to one of London’s most visited tourist attractions: the markets, streets and shops that have grown around Camden Lock and its associated music venues. Camden as a Borough is diverse, containing Hampstead Heath and its famous swimming ponds, Holborn and parts of the West End, and the housing estates of Somers Town.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt;&lt;strong&gt;previous applicants need not apply&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Interview date: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Cordelia Hughes&lt;/p&gt;\n&lt;p&gt;cordelia.hughes1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Pancras Hospital, Camden", "postalCode": "NW1 0PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5365", "longitude": "-.131478"}}, "title": "Registered Nurse (Adult) – Rehabilitation Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258245", "validThrough": "2020-11-17T23:59:59+0000"}