{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-15T12:45:54+0100", "description": "&lt;p&gt;Like all of us at Nuffield Health, you do what you do because you care. Every one of our brilliant people is passionate about making a real difference. Our unique approach to connected healthcare means the difference can be truly transformative. Our network spans hospitals, Fitness and Wellbeing Clubs, and specialist services including physiotherapy - which means we can support lasting changes by taking great care of people in every way. And as Britain’s largest not for profit healthcare provider, we’d love to take good care of you too. Investing every penny in our services and people, we’ll bring out the specialist in you.&lt;br /&gt;&lt;br /&gt;Here, you’ll discover nursing as it should be - with more time to care, and get to know the people who are your patients. An exceptional Pre-assessment Nurse with extensive clinical experience, you have a real passion for nursing and the desire to provide the highest standards of patient care. Whether you join us from the NHS or a private setting. We’ll give you the opportunity to make full use of your skills as part of an organisation that values and respects you. At Nuffield Health, your role is equally about empathy and expertise. It’s not only about making correct assessments in accordance with protocols, but also about giving patients reassurance and support.&lt;br /&gt;&lt;br /&gt;You’ll be part of a close-knit team with matron-led care and consultant-led service. We’re looking for a Registered Nurse to join our Pre-AssessmentTeam. We offer a comprehensive pre-assessment service and this is a fantastic opportunity to join a forward thinking team to support our commitment to our patients. You will be able to demonstrate relevant experience in pre-assessment and be motivated and committed to providing the highest standards of healthcare, as well as being a dynamic motivated individual, excellent communicator and team worker.&lt;/p&gt;\n&lt;p&gt;As a nurse with the appropriate governing body, you’ll have the qualifications and experience relevant to your registration including NMC. You’ll also have post-registration experience and Immediate / Advanced Life Support are desirable. Like us, you believe in putting people first. So you’ll appreciate having the time to care – to fully understand each patient’s needs and give them and their families the comfort and reassurance that can mean so much. This is the type of care that comes naturally to a talented professional. You’ll be an excellent communicator and team worker – flexible and motivated. As part of the wider hospital team, you’ll interact with practitioners from other areas because you understand that continuity in patient care is key.&lt;br /&gt;&lt;br /&gt;We want you to be the best you can be. So we promise to support you with training, career development and our unique health and wellbeing focused benefits package. This includes free membership of your local Fitness and Wellbeing Club, physiotherapy services and an annual health assessment, as well as a range of lifestyle and financial wellbeing benefits.Along with a competitive salary package you will also be paid enhancements for shift/unsociable hours worked and on call.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nuffield Health Ipswich Hospital, Foxhall Road, Ipswich, Suffolk", "postalCode": "IP4 5SW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0475", "longitude": "1.22896"}}, "title": "Staff Nurse - Pre-Assessment", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228211", "validThrough": "2020-11-12T23:59:59+0000"}