{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38694", "minValue": "38694", "unitText": "YEAR", "value": "£38,694 per annum excluding on calls"}}, "datePosted": "2020-10-19T11:01:59+0100", "description": "&lt;p&gt;The Royal Marsden NHS Foundation Trust has an international reputation for high quality patient care, education and research and its partnership with the Institute of Cancer Research has created the largest comprehensive cancer centre in Europe. This appointment offers excellent learning opportunities in units leading national and international research programmes. You will gain experience of working in multidisciplinary units composed of medical and clinical oncologists, surgeons and specialists in palliative medicine, all working together to provide high quality management of cancer patients.&lt;br /&gt;&lt;br /&gt;These posts form part of our medical inpatient cover rota and are combined with 6 core medical trainees. They are suitable for doctors who have completed Foundation Training and are looking to gain further medical experience before moving into core training in medicine or general practice. Additionally, doctors who have completed core medical training and are considering a career in oncology or palliative medicine and doctors from overseas with more experience that are looking to for roles in oncology within the NHS may be interested.&lt;br /&gt;&lt;br /&gt;The roles offer general training and experience in the management of patients with chronic medical problems associated with a wide range of malignant diseases. Attendance of weekly teaching programs and journal clubs is encouraged, and there is access to simulation based training and training in the insertion of chest drain, ascitic drains, bone marrow aspiration and lumbar puncture. Additionally, doctors will be offered a clinical supervisor and have access to a study leave budget for personalised training. Trust doctors have access to a state of the art library with online access to a large number of general medical and specialist journals.&lt;br /&gt;&lt;br /&gt;Doctors will work a full shift rota which is compliant with the New Junior Doctor Contracts. &lt;br /&gt;&lt;br /&gt;The position is on the New Junior Doctor Contract pay scale and in addition on calls will be paid separately. These posts are available from February, April and August 2021. The Trust operates an equal opportunity policy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Rachel Horton, Deputy CBU Manager, Rachel.Horton@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden NHS Foundation Trust, Chelsea", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Junior Doctor Oncology - CMT Level", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231948", "validThrough": "2020-11-15T23:59:59+0000"}