{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-05T14:30:53+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Therapy Assistant Practitioner to join our In-patient Therapy Team at the William Harvey Hospital in Ashford, Kent.&lt;/p&gt;\n&lt;p&gt;The Team specialises in the assessment, treatment and discharge planning of in-patients in the Medical and Frailty wards.&lt;/p&gt;\n&lt;p&gt;The team works holistically and generically and consists of clinical specialist occupational therapists &amp; physiotherapists, senior and junior therapists and support staff. As a Band 4 you will work generically, providing high quality care through effective team work and will be expected to follow through treatment plans from admission to discharge. The team strives to provide high quality care and think innovatively to improve the service we deliver. As a team member you will assist and support the therapists on the wards and work closely with all members of the MDT.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to carry out initial assessments of patient’s needs and progress treatment plans to facilitate safe discharge from hospital which may involve home visits and close liaison with community support services.&lt;/p&gt;\n&lt;p&gt;Regular supervision is available. There is regular in-service training provided by both therapies and other MDT members. There is an opportunity to enrol on the apprenticeship scheme to develop your clinical skills further. External training opportunities may also be applied for as appropriate.&lt;/p&gt;\n&lt;p&gt;As a therapy team we are constantly involved in service development and the post holder will be involved alongside the therapy team in new projects, service developments and initiatives to ensure best practice at all times.&lt;/p&gt;\n&lt;p&gt;The successful candidate must hold a qualification such as NVQ, diploma in health and social care or equivalent and have previous therapy experience. They must also demonstrate a clear understanding of the role of a Therapy Assistant Practitioner.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Katy Sampson,Clinical Specialist Physiotherapist&lt;/p&gt;\n&lt;p&gt;Email address:katy.sampson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Harvey Hospital, Ashford", "postalCode": "TN24 0LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1415", "longitude": ".91624"}}, "title": "Therapy Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258131", "validThrough": "2020-11-16T23:59:59+0000"}