{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "TBC"}}, "datePosted": "2020-10-08T11:44:30+0100", "description": "&lt;p&gt;&lt;strong&gt;Job advert text &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr S Cotton &amp; Partners&lt;/p&gt;\n&lt;p&gt;Pendre Surgery, Clayton Road, Mold, CH7 1SS&lt;/p&gt;\n&lt;p&gt;Are you an advanced nurse practitioner looking for an exciting new opportunity? We are looking for an ANP to join our team of 5 GP partners, 2 salaried GPs, 2 ANPs, 4 practice nurses a pharmacist and 1 HCA.&lt;/p&gt;\n&lt;p&gt;The vacancy is for a permanent position working six sessions per week with a competitive salary.&lt;/p&gt;\n&lt;p&gt;We pride ourselves in being a mutually supportive team and encourage personal &amp; professional development while providing high quality patient care. We undertake the training of GPs, medical students and non-medical prescribers.&lt;/p&gt;\n&lt;p&gt;The ANP role is central to our service and manages much of the acute illness presented on a daily basis. The post holder should have relevant qualification at masters level and be a registered non-medical prescriber.&lt;/p&gt;\n&lt;p&gt;Considered applicants will be expert clinical practitioners, responsible for providing clinical assessments, working autonomously utilising high levels of decision making and clinical judgement in relation to patient care including the diagnosis and management of acute conditions. Primary care experience would be advantageous however full support and mentorship will be given to the successful candidate.&lt;/p&gt;\n&lt;p&gt;To discuss the role further or to arrange an informal visit to the practice please contact the Practice Manager Alison Davies 01352 744381.&lt;/p&gt;\n&lt;p&gt;We reserve the right to appoint before this date if a suitable candidate is found.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132734.png", "name": "GP Practices - Betsi Cadwaladr University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132734"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mold", "postalCode": "CH7 1SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1683", "longitude": "-3.14713"}}, "title": "General Practice Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218103", "validThrough": "2020-11-08T23:59:59+0000"}