{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-28T15:31:57+0000", "description": "&lt;p&gt;Applications are invited from forward-thinking individuals to join the Consultant team in Neurosurgery. The post will be for 6 months initially with a possible extension. An opportunity is expected in near future of a substantive appointment to replace a retirement of a senior consultant.&lt;/p&gt;\n&lt;p&gt;This post is required to play a critical role in delivering Cranial neurosurgery on call and General elective spinal surgery for Hull, the Yorkshire &amp; Humber region and North East Lincolnshire. Also post at times may be requested to support the neuro-oncology service when required. The service treats patients from Hull, Scarborough, Bridlington, York, Grimsby, Scunthorpe, Lincoln, Louth and Doncaster. The Neurosurgical Unit has expanded from a two Consultants to twelve Consultants over the past 18 years in response to clinical demand, Government and SBNS backed developments. The department is located across the two Hospital Sites at Hull Royal Infirmary (HRI) and Castle Hill Hospital (CHH) serving a population of approximately 1.3 million people.&lt;/p&gt;\n&lt;p&gt;To succeed you must have undergone extensive clinical training and experience and have the ability to offer expert clinical opinion on a range of problems both emergency and elective within the speciality.&lt;/p&gt;\n&lt;p&gt;The appointee will be expected to cover 1 in 6 Cranial Neurosurgery on call and elective degenerative non-complex spinal service.&lt;/p&gt;\n&lt;p&gt;The establishment of the new Hull York Medical School (HYMS) has strengthened this Trust with the Postgraduate Medical School which provides enhanced opportunities for education and research.&lt;/p&gt;\n&lt;p&gt;Hull University Teaching Hospitals NHS Trust provides a comprehensive range of acute services from two hospital sites. We serve an extended population of approximately 1.2 million. With an annual budget of circa £481 million and employing approximately 8,000 staff we are committed to the continuous development of services for the benefit of patients and to providing a comprehensive service of the highest possible quality.&lt;/p&gt;\n&lt;p&gt;Hull is a modern city with a number of new developments including the Marina and The Deep. It has links with Europe via the ferry and the nearby Humberside Airport, along with good rail and motorway links, but is within easy reach of nearby Coast and Wolds Countryside. It offers affordable housing with good leisure facilities.&lt;/p&gt;\n&lt;p&gt;The successful post holder will be required to provide services over seven days.&lt;/p&gt;\n&lt;p&gt;Please include in the additional information section of the application form; the name of your current revalidation officer, their contact details and your date of revalidation.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr Chittoor RajaramanJob titleCranial Lead NeurosurgeryEmail addresschittoor.rajaraman@hey.nhs.ukTelephone number01482 604477Additional contact information&lt;/p&gt;\n&lt;p&gt;Alternatively, please contact Mr Vasileios Arzoglou, Clinical Lead Neurosurgery, vasileios.arzoglou@hey.nhs.uk 01482 607877&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull Royal Infirmary, Hull", "postalCode": "HU3 2JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7444", "longitude": "-.358277"}}, "title": "Locum Consultant Neurosurgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247213", "validThrough": "2020-11-11T23:59:59+0000"}