{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49908", "minValue": "32796", "unitText": "YEAR", "value": "£19.51 - £29.69"}}, "datePosted": "2020-10-12T13:07:53+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Emergency Department Nurse Team Leader Band 6&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Croydon University Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wards Covered:&lt;/strong&gt; Emergency Department&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates:  &lt;/strong&gt;Days: £19.51 per hour, Saturdays/Nights: £24.60 per hour, Sunday/Bank Hols: £29.69 per hour (rates exclude holiday pay)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and highly motived, with excellent leadership skills to work in Accident and Emergency as a Nurse Team Leader with Acute health experience to join the NHSP Bank, working for Croydon University Hospital. &lt;br /&gt; The post holder has responsibility for the provision of competent professional nursing care, to meet with individual needs of the designated patient population. &lt;br /&gt; The individual will be able to maintain accountability and demonstrate skills in undertaking assessment, planning, implementation, and evaluation of patients presenting with emergency care needs without supervision. You will work primarily in the resuscitation room to provide, develop and co-ordinate thigh quality nursing care to patients attending with emergency care needs. You will participate in the support and professional development of all staff with specific relation to resuscitation and emergency care. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why join our bank?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re committed to giving you more &lt;strong&gt;flexibility&lt;/strong&gt; and &lt;strong&gt;control &lt;/strong&gt;over your working life. By joining the NHSP bank you’ll gain access to the best choice of available shifts.&lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional, caring and reliable service you will have access to the following benefits:&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;First choice of shifts at your Trust&lt;/strong&gt; – Access to shifts before they are available to agency &lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Flexible working to suit your lifestyle &lt;/strong&gt;– Take control of when you want to work&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Build holiday allowance for every shift you work &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Book and manage your shifts on the go&lt;/strong&gt; – Access shifts anywhere, anytime online or through your smartphone&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03332 407 552&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-          To maintain personal contact with patients, relatives and carers; being sensitive to their needs for courtesy, dignity and privacy&lt;/p&gt;\n&lt;p&gt;-          Maintain a safe and clean environment&lt;/p&gt;\n&lt;p&gt;-          To work in all areas of the department if required, in line with need and own scope of competence&lt;/p&gt;\n&lt;p&gt;-           To maintain accountability and demonstrate skills in undertaking assessment, planning, implementation, and evaluation of patients presenting with emergency care needs without supervision&lt;/p&gt;\n&lt;p&gt;-           To review and modify planned interventions in response to the needs of emergency care patients acting independently where appropriate and seeking advice where required.&lt;/p&gt;\n&lt;p&gt;-           To prioritise own work and that of others to ensure the resuscitation room is managed effectively&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Criteria:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-          Registered Practitioner with NMC/HCP&lt;/p&gt;\n&lt;p&gt;-          Significant post-registration experience in emergency and/or acute care setting&lt;/p&gt;\n&lt;p&gt;-          Respect for patients privacy, dignity, wishes and beliefs&lt;/p&gt;\n&lt;p&gt;-          Excellent communications skills&lt;/p&gt;\n&lt;p&gt;-          Post-graduate BSc (hons) or working towards&lt;/p&gt;\n&lt;p&gt;-          Ability to balance and prioritise workload&lt;/p&gt;\n&lt;p&gt;-          Compassionate and empathetic&lt;/p&gt;\n&lt;p&gt;-          Knowledge of Trust policy and procedures especially clinical and HR policies&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), who are wholly owned by the Department of Health, is the leading provider of managed flexible workforce services to the NHS with approximately 60,000 nurses, doctors, administration and clerical and other healthcare professionals signed to its bank. We help over 60 NHS Trust clients to improve workforce efficiency and productivity as part of an overall workforce strategy. #NHSP#&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Register today for various flexible shifts, long term placements and substantive opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with Kelly Grosse, Trust Recruitment Coordinator on Kelly.Grosse@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon", "postalCode": "CR7 7YE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3891", "longitude": "-.108758"}}, "title": "Nurse Team Leader A&amp;E", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222464", "validThrough": "2020-11-23T23:59:59+0000"}