{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-26T08:17:41+0000", "description": "&lt;p&gt;We are seeking an experienced and highly skilled Technologist or Radiographer to lead our Mould Room and Brachytherapy team supporting radiotherapy services at the Northern Centre for Cancer Care.&lt;/p&gt;\n&lt;p&gt;This is a developing and progressive service responding to the increasing technical demands of radiotherapy with an extensive range of immobilisation devices. The Brachytherapy service continues to increase in both scope and activity.&lt;/p&gt;\n&lt;p&gt;The post-holder will have overall responsibility for the joint Brachytherapy and Mould Room services and will directly manage two senior clinical technologists who individually lead the teams providing mould room service and brachytherapy preparation and delivery.&lt;/p&gt;\n&lt;p&gt;Brachytherapy is delivered using a recently installed Flexitron HDR and continues to increase in both scope and activity. Currently the Centre provides oesophageal, gynecological and interstitial HDR brachytherapy. The post is a mix of both managerial and clinical work. The appointee will participate in the preparation and treatment delivery for all HDR patients, in both theatre and clinical environments; prostate brachytherapy using 1-125; patient immobilisation preparation and development of these services. The mould room staff work closely with all clinical teams in the cancer centre and the successful candidate will be able to show excellent communication skills with these staff groups.&lt;/p&gt;\n&lt;p&gt;The Northern Centre for Cancer Care is a modern centre that opened in 2008 within Freeman Hospital. The mould room provides support for nine high energy treatment machines which includes two linacs delivering stereotactic treatments and two TomoTherapy units. The centre provides a full range of radiotherapy treatments including paediatrics, SABR, TBI, TSEI and IMRT. The Trust has an on-going commitment to equipment replacement and the delivery of a high quality modern radiotherapy service.&lt;/p&gt;\n&lt;p&gt;Newcastle upon Tyne is an exciting place to live with easy access to city, coast and country. The nightlife is lively; there is plenty of sport, culture and a good transport network.&lt;/p&gt;\n&lt;p&gt;Applicants are expected to have good knowledge of mould room and radiotherapy techniques and practice and to have demonstrated the ability to work both independently and as team leader. Candidates are required to have an honours degree in a related subject such as clinical physiology or radiotherapy oncology and Master’s level knowledge and experience. They must also be registered with either the HCPC or RCT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 01 Freeman Hospital", "postalCode": "NE7 7DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0028", "longitude": "-1.59341"}}, "title": "Head of Service – Clinical Technologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241737", "validThrough": "2020-11-22T23:59:59+0000"}