{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T10:46:44+0000", "description": "&lt;p&gt;A vacancy has arisen for a permanent Band 6 Community Mental Health Nurse within Adult Mental Health Services, based in Ellesmere Port, and covering the Cheshire West area.&lt;/p&gt;\n&lt;p&gt;Are you interested in working in a recovery focused way with adults with severe and enduring mental health needs? We are a dynamic team, working with an interesting client group, where there’s an opportunity to significantly impact on an individuals well-being and functioning and long-term clinical outcomes.&lt;/p&gt;\n&lt;p&gt;Ellesmere Port and Neston Adult Mental Health Services are looking to recruit an experienced Community Mental Health Nurse who have experience of working with people with severe and enduring mental health problems. We are looking for an enthusiastic, self-motivated, team player, who are able to support, and be actively involved in quality improvement initiatives.&lt;/p&gt;\n&lt;p&gt;The post holder will ideally have at least 2 years post registration experience in working within the Mental Health field and will be expected to work using a high level of expertise within the multi-disciplinary team. The post holder must be able to work autonomously, have good communication skills, an ability to work in partnership with service users and carers and be able to work within a multi-disciplinary team setting. You will be expected to work within a care coordination role and manage a defined caseload of clients with severe and enduring mental illness (organic/functional).&lt;/p&gt;\n&lt;p&gt;In return the post holder will receive regular supervision, the support of a motivated, multi-disciplinary team, have access to varied training and opportunities to consider initiatives within Improving Working Lives policy.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Jarmain / Ben Davies Tel 01514888412&lt;/p&gt;\n&lt;p&gt;Rachel Jarmain Team Manager Email address rachel.jarmain@nhs.net &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cherrybank Resource Centre, 85 Wellington Road, CH65 0BY, Ellesmere Port", "postalCode": "CH65 0BY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2764", "longitude": "-2.90026"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247980", "validThrough": "2020-11-12T23:59:59+0000"}