{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 Per annum"}}, "datePosted": "2020-11-02T09:00:34+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the Estates, Facilities and PFI Division who are looking to appoint a Head of Clinical Technology to manage the Clinical technology team and delivery of the medical devices service. &lt;br /&gt;Clinical Technology is an area of continued innovation and growth in demand of diagnostic services and patient monitoring. The postholder will be expected to respond to the Trust&#39;s changing needs in respect of managing its medical equipment provision and will need to integrate this service across hospital sites not only at County and Royal but also within the community setting. &lt;br /&gt;The post holder will lead on delivering a robust and resilient medical devices service that will provide the capacity to respond to the Trust&#39;s current demands and predicted demands over the next five years. This will not only support the delivery of the highest standards of patient care but will also maximise value for money, productivity and effective cross-site working which will be critical to responding to the Trust&#39;s delivery of the 2025 vision. &lt;br /&gt;The postholders will be responsible for providing technical advice to the Director of EF&amp;PFI, the Trust Medical Director and the Chair of the Medical devices Committee. You will have proven experience in leading this type of service along with the ability to evaluate and deliver on going service improvement / transformation alongside strong interpersonal skills and experience of collaborative working within complex multi-disciplinary teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBarry DeaconJob titleDeputy Director of Estates, Facilities and PFIEmail addressbarry.deacon@uhnm.nhs.ukTelephone number01782 672094&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Stoke, Stoke on Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Head of Clinical Technology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251364", "validThrough": "2020-11-09T23:59:59+0000"}