{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata for part time"}}, "datePosted": "2020-10-29T14:46:21+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Senior Occupational Therapist&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Band 6 &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Permanent Contract&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Mayfield Unit, Thurrock Community Hospital&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;North East London Foundation Trust is shaping the future. This is a thriving and dynamic area of regeneration on the outskirts of London. It is a combined mixture of both rural and urban living.&lt;/p&gt;\n&lt;p&gt;Mayfield Unit has an exciting opening for a Band 6 Senior Occupational therapist to join our friendly Team at Thurrock Community Hospital which provides a multi-disciplinary inpatient therapy service for adults over 18.&lt;/p&gt;\n&lt;p&gt;If you are a forward thinking OT, who has sound decision making skills, effective clinical reasoning and wish to work as part of a supportive inpatient multidisciplinary team this is the position for you.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for the provision of Occupational Therapy assessment, intervention and discharge planning of patients with multiple, sometimes complex diagnoses. You will also need to work inter-dependently with other members of the multi-disciplinary team in order to provide a patient-centred service, working to identify holistic patient goals and rehabilitation plans&lt;/p&gt;\n&lt;p&gt;If you have these qualities we are waiting to hear from you.&lt;/p&gt;\n&lt;p&gt;Probationary Period&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;Assessment/Interview info&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At&lt;/span&gt;&lt;span&gt;NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Starting with NELFT&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;High Cost Area Supplement – Essex&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 5% of the basic salary (with a minimum of £1,034 to a maximum of £1,791)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJeanette WroeJob titleIn-Patient Occupational Therapy LeadEmail addressjeanette.wroe@nelft.nhs.ukTelephone number01277 695135Additional contact information&lt;/p&gt;\n&lt;h1&gt;For more information or an informal chat, please contact Jeanette Wroe on 0300 300 1886 or jeanette.wroe@nelft.nhs.uk&lt;/h1&gt;\n&lt;h1&gt; &lt;/h1&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mayfield Unit, Thurrock Community Hospital, Grays, Essex", "postalCode": "RM16 2PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.496", "longitude": ".336337"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248749", "validThrough": "2020-11-12T23:59:59+0000"}