{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 p.a"}}, "datePosted": "2020-10-29T11:31:03+0000", "description": "&lt;p&gt;&lt;strong&gt;Theatre Surgery Division (WTWA)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are motivated and driven and want to be part of a team who are dedicated to delivering high quality care to patients and their carers then take some time to read through what we have to offer. We are a multidisciplinary team who work closely together and support each other, whilst providing high quality care to our patients.&lt;/p&gt;\n&lt;p&gt;We recruit staff that are open, honest and focused on striving for excellence, having built an enviable international reputation on five unwavering principles for clinical excellence, research and development, teaching, learning and for treating patients with compassion, respect and dignity.&lt;/p&gt;\n&lt;p&gt;We are now seeking to appoint a talented Anaesthetic /Recovery/Scrub practitioner to partner our clinical teams as we continue to shape our strategy. The successful candidate will have a unique opportunity to join Manchester Foundation Trust (MFT) at a time when Manchester is at the forefront of healthcare redesign, developing a model of care that will help the NHS and other care providers in Greater Manchester provide quality services that are safe, accessible and sustainable for future generations. In light of these changes we are looking for a dynamic, innovative and highly motivated registered practitioner (Nurse or ODP) with excellent clinical knowledge in Anaesthetic /Recovery/Scrub to join our talented team.&lt;/p&gt;\n&lt;p&gt;The health care team embraces our nursing strategy for the trust being part of something special, which means being trustworthy, supported, recognised, respected and rewarded. &lt;strong&gt;Trust Values&lt;/strong&gt;: Working Together, Dignity &amp; Care, Everyone Matters &amp; Open and Honest. Patient care is at the front of the service we deliver.&lt;/p&gt;\n&lt;p&gt;There are 5 theatre suites across Wythenshawe Trafford, Withington &amp; Altrincham (WTWA) with a total of 27 operating theatres across the directorate providing a range of specialist surgery. We are an institute that offers all opportunities to develop you in both your career and education. We strive to provide excellent standards of evidence based care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Trafford Theatres&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There are 9 Theatres, undertaking both elective and non-elective work. We specialise in Elective Orthopaedics both upper and lower limb / simple and complex procedures. . The area is referred to as the Manchester Orthopaedics Centre. We also provide surgical procedures under the following specialities: Gynecology, Urology, ENT General and Dental Surgery both adults and pediatrics.&lt;/p&gt;\n&lt;p&gt;Post-holders will also have access to the LEAD Training Programme, a unique and innovative concept to develop skillsets, which brings together all of the education and training activities of the hospital under one umbrella.&lt;/p&gt;\n&lt;p&gt;CPD courses to aid in your development in your role as a Band-5 within the organisation. You will have the opportunity to work cross site Theatres. (Wythenshawe, Trafford, Withington, Altrincham).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma MottersheadJob titleTheatre LeadEmail addressemma.mottershead@mft.nhs.ukTelephone number01617462936Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact:&lt;/p&gt;\n&lt;p&gt;Theatre Matron/ Lead Anima George: anima.george@mft.nhs.uk(01617462244/07712568157)&lt;/p&gt;\n&lt;p&gt;Theatre Lead Emma Mottershead: emma.mottershead@mft.nhs.uk 01617462936&lt;/p&gt;\n&lt;p&gt;Theatre Lead Michael Millward: Michael.millward@mft.nhs.uk 01617462936&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trafford General Theatres, Manchester", "postalCode": "M41 5SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4541", "longitude": "-2.37068"}}, "title": "Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248128", "validThrough": "2020-11-12T23:59:59+0000"}