{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "82096 - 110683"}}, "datePosted": "2020-11-02T11:31:47+0000", "description": "&lt;p&gt;We are seeking an enthusiastic Locum Consultant for a 12 month post. The successful candidate will join to our Cardiology team at Hillingdon Hospital&lt;/p&gt;\n&lt;p&gt;The post holder will play a key role in the delivery of our in-patient care for all patients admitted with acute Cardiac disease, and provides general Cardiac out-patient clinics. The candidate will be a part of the Consultant-led ward round and weekly Consultant-led echo departmental meeting to review interesting and challenging cases. The post holder will be required to contribute to the care of general cardiology patients on the ward, perform 3 outpatient clinics per week and help the other consultants with reporting of direct access GP investigations and vetting of GP referrals.&lt;/p&gt;\n&lt;p&gt;The London Borough of Hillingdon has a registered GP population of 300,000, stretching from Heathrow Airport in the south to Northwood in the north. The airport, with a through put of 65 million passengers a year, adds an international dimension to service provision. The hospital has a busy Accident and Emergency with 110,000 visits a year. Hillingdon Hospital is in the south of the Borough and provides outpatient, elective, day case and ITU/HDU services (among others). In the north of the Borough Mount Vernon Hospital provides outpatient, elective and day care services. Hawthorn Unit (commissioned by CNWL) provides bed based rehabilitation on the Hillingdon grounds with Consultant Geriatrician support.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact or discuss the post and arrange visits with:&lt;/p&gt;\n&lt;p&gt;Dr G Karagiannis – Cardiology Consultant georgios.karagiannis@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr G Rosser – Cardiology Consultant garethrosser@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone 01895279255&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Hillingdon Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120945"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hillingdon and Mount Vernon, Uxbridge", "postalCode": "UB8 3NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5255", "longitude": "-.460885"}}, "title": "Locum Consultant Cardiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251795", "validThrough": "2020-11-16T23:59:59+0000"}