{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907- £37,890"}}, "datePosted": "2020-10-20T11:06:52+0100", "description": "&lt;p&gt;&lt;strong&gt;BAND 5 (£24,907 - £30,615) / BAND 6 (£31,365- £37,890) DEPENDING ON EXPERIENCE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We would like to invite you to join our highly motivated midwifery team where commitment to providing high quality, woman-centred care is our passion.&lt;/p&gt;\n&lt;p&gt;Sandwell and West Birmingham maternity services provide care and support for around 6,000 women and babies per annum. We are privileged to care for the diverse population, ensuring individualised care is provided to all women and their families at this important time in their lives. Our service is defined by the needs of the population, providing opportunity for midwives to gain experience and knowledge in all elements of maternity care.&lt;/p&gt;\n&lt;p&gt;This is an exciting time for the Trust as building work is now under way for the brand new build Midland Metropolitan Hospital. This will include a purpose built maternity inpatient unit to include co-located midwife led unit. Joining our team at this time will provide you the opportunity to be involved with this project from the outset.&lt;/p&gt;\n&lt;p&gt;We are forward thinking with motivated staff who strive to improve the quality of the service that we offer to our women, their babies and their families. We have full Baby Friendly accreditation, CQC rating of ‘good’ and provide professional development opportunities for all levels of staff.&lt;/p&gt;\n&lt;p&gt;Our unit provides three options for place of birth; the established co-located Serenity Birth Centre, home birth and the Delivery Suite. This ensures that all women have access to the optimal birth environment in accordance with their choice and in line with evidence based practice. Midwives are consequently supported and enabled to practice in the optimal environments for all elements of midwifery care for all women (and their families) to enjoy a normal birth experience.&lt;/p&gt;\n&lt;p&gt;We are therefore inviting self-motivated, dynamic, professional midwives with excellent communication and interpersonal skills to join our proactive, professional maternity team.&lt;/p&gt;\n&lt;p&gt;Newly qualified midwives and those midwives currently undertaking their preceptorship period are invited to apply for the Band 5 posts. Band 5 Midwives nearing completion of their Preceptorship period and experienced Band 6 midwives are invited to apply for the Band 6 posts.&lt;/p&gt;\n&lt;p&gt;All posts will include shift working (including night duty) and internal rotation. The successful applicants will receive a comprehensive orientation programme and are assured that they will receive appropriate support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information or to arrange an informal visit, please contact Chris Lewis, Matron for Maternity Inpatients&lt;strong&gt;on 0121 507 4599 or 07527389898. &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Band 5/6 Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234051", "validThrough": "2020-11-15T23:59:59+0000"}