{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro r"}}, "datePosted": "2020-10-21T17:15:39+0100", "description": "&lt;p&gt;&lt;strong&gt;This post is eligible for a financial incentive under our Refer a Friend Scheme. If you would like your application to be considered under this scheme you will need to clearly identify this at the end of your supporting information, and include the name, job title and place of work of the member of staff who referred you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Surgical Nursing – General, Specialty and Rotational posts available.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a Registered Nurse – Adult, (RN) who is looking to work in Surgical Nursing? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at Western Sussex Hospitals NHS Foundation Trust (WSHFT) we are looking for Adult RNs who would like to work in our busy general and specialty Surgical wards at our hospitals in Chichester (St. Richards Hospital) and Worthing (Worthing Hospital).&lt;/p&gt;\n&lt;p&gt;Our Surgical patients are primarily admitted via planned pathways but also as emergencies through our Accident and Emergency Departments and Emergency Floors. The nursing care that our surgical patients require is varied, often requiring periods of high levels of intervention and support. As such, this provides an excellent learning environment.&lt;/p&gt;\n&lt;p&gt;Our wards are supported by Practice Development and we are able to offer a wide variety of in-house training, related to clinical skills and personal development. We also offer the potential to study at our partner Universities in Brighton (Brighton University) and Guildford (University of Surrey).&lt;/p&gt;\n&lt;p&gt;Our Nationally recognised Patient First Improvement system ensures that all members of our staff are actively encouraged to contribute to making improvements in their areas of work&lt;/p&gt;\n&lt;p&gt;Via our ‘Wellbeing Wednesdays’ initiative, we offer our staff the opportunity for ‘time out’ to support their wellbeing. Recent opportunities have included lunch time walks, hand massage, yoga classes, wellbeing MOTs and other formal wellbeing services. We also offer a ‘Gym4staff’ and Bootcamp classes.&lt;/p&gt;\n&lt;p&gt;If you would like to join a &lt;strong&gt;&lt;em&gt;CHKS ‘Top Hospitals’ award winner&lt;/em&gt;&lt;/strong&gt;, a &lt;strong&gt;&lt;em&gt;Top 5 Hospital to be treated at or work for&lt;/em&gt;&lt;/strong&gt; and a &lt;strong&gt;&lt;em&gt;CQC rated ‘Outstanding’ Trust,&lt;/em&gt;&lt;/strong&gt; then come and join us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gerthy Albano – Matron-Surgery: &lt;/strong&gt;&lt;strong&gt;gerthy.albano@wsht.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121075.png", "name": "Western Sussex Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Richards Hospital and Worthing Hospital, Chichester and Worthing", "postalCode": "BN11 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8167", "longitude": "-.364296"}}, "title": "Staff Nurses - Surgery - November - Worthing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237422", "validThrough": "2020-11-17T23:59:59+0000"}