{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 Per annum"}}, "datePosted": "2020-11-04T16:16:29+0000", "description": "&lt;p&gt;Are you interested in a career in Eating Disorders??? If so this may be the advert for you -&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for two Band 3 Healthcare Assistants to become part of the Eating Disorder Team in Durham &amp; Darlington. The Eating Disorder Service currently has 20 beds split over two Health Care Trusts. Birch Ward at West Park Hospital in Darlington has 15 beds run by TEWV and then we have the RVI Hospital in Newcastle run by CNTW trust with a further 5 beds also known as (REDS). Also within the Eating Disorder service we have a community service and a inpatient day service all based from Imperial avenue in Stockton -on-Tees.&lt;/p&gt;\n&lt;p&gt;The post holders will be part of a resilient, welcoming and professional team. The team takes a recovery orientated approach to improving the quality of life for people who use our service.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be based at Birch Ward West Park Hospital. The post center&#39;s on the physical health tasks and monitoring of patients within the Eating Disorder Service but will also support other areas of the Eating Disorder pathway with a focus on recovery. The role requires someone who is caring, enthusiastic and motivated with the aim of improving the lives of people with eating disorders and mental health needs.&lt;/p&gt;\n&lt;p&gt;The successful candidates must have completed the Diploma in Health and Social Care Level 3 or equivalent. Candidates must also have Literacy and Numeracy level 2 or equivalent and must complete the Trust Healthcare Assistant competencies within their probationary period (first 6 months in role).&lt;/p&gt;\n&lt;p&gt;The successful candidates who do not have the required qualifications will be expected to enrol on the Healthcare Assistant Framework which will include the acquisition of the level 3 Diploma Health and Social Care, level 2 in Literacy and Numeracy or equivalent and achievement of competencies. You will have a maximum of 2 years to complete this.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Scott Taylor, Ward Manager&lt;/p&gt;\n&lt;p&gt;scott.taylor2@nhs.net&lt;/p&gt;\n&lt;p&gt;01325552054&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Park Hospital, Darlington", "postalCode": "DL2 2TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5436", "longitude": "-1.59116"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256600", "validThrough": "2020-11-11T23:59:59+0000"}