{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 per annum"}}, "datePosted": "2020-10-26T09:46:10+0000", "description": "&lt;p&gt;The newly established Repurposing Medicines Programme responds to the significant opportunities that have been identified to improve the prescribing of off licence and off label medicines in the NHS; many of these medicines can be ‘re-purposed’ to provide clinical, patient experience or economic benefits for the NHS.&lt;/p&gt;\n&lt;p&gt;This multi-agency programme, which is supported by colleagues from the MHRA, NIHR, and NICE, will identify the most promising medicines and support their future adoption in the NHS by facilitating new research to build the clinical evidence base for their use, supporting the licencing process (including novel partnerships with potential NHS, generic manufacture and third sector sponsors) , and developing new national clinical guidance or policy to promote equitable access.&lt;/p&gt;\n&lt;p&gt;The post-holder will retain oversight of the programme and support the delivery of its objectives including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Establishing horizon scanning and a portal for stakeholder proposals to provide systematic intelligence on future repurposing opportunities of potential benefit to the NHS.&lt;/li&gt;\n&lt;li&gt;Articulating and testing a road map to help identify the actions that will best expedite the repurposing of identified and prioritised candidate medicines.&lt;/li&gt;\n&lt;li&gt;Helping establish a dynamic and effective programme team, in particular drawing in expertise from MHRA, NICE and NIHR, as well as other organisations with direct experience of achieving market authorisations, to progress the pilot topics identified, formalise the identification of future topics and complete the further actions agreed.&lt;/li&gt;\n&lt;li&gt;Fast-tracking evidence generation, working with partner organisations including NICE and NIHR.&lt;/li&gt;\n&lt;li&gt;Working with existing licence holders to identify licencing variation opportunities for repurposed products.&lt;/li&gt;\n&lt;li&gt;Supporting clinicians to draft new clinical commissioning proposals for repurposed products.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The interview process will consist of a presentation and a formal interview.&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;The applicant will be invited to present on Microsoft teams which will be recorded for the interview panel, and a wider stakeholder group, to review prior to the interview.&lt;/li&gt;\n&lt;li&gt;Shortlisted applicants will then be invited to a formal interview.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;The invitation to present via Microsoft teams will be the week commencing the 30th November (subject to availability). The formal interview will be on 11th December 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Georgina Whiteford&lt;/p&gt;\n&lt;p&gt;Job title: Business Manager&lt;/p&gt;\n&lt;p&gt;Email address: georgina.whiteford1@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07783 815 756&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Head of Off Label Medicines (Repurposing) Programme", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241892", "validThrough": "2020-11-09T23:59:59+0000"}