{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 pro rata"}}, "datePosted": "2020-10-23T10:32:03+0100", "description": "&lt;p&gt;&lt;span&gt;We are looking for an experienced Clinical Psychologist to lead the Adult Mental Health specialty in Northamptonshire Healthcare NHS Trust. The specialty includes psychologists working in community and inpatient services as well as some specialist teams such as perinatal mental health, early intervention in psychosis and acute liaison mental health. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role will involve the leadership, supervision and management of around 10 Principal Grade Psychologists in Adult Mental Health, who act as clinical leads in their respective areas. In addition you would be a key player in working with senior managerial and clinical colleagues to develop services and clinical pathways in line with the objectives of the NHS long-term plan. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You would join a peer group of Consultant psychologists in the Trust, and work closely with other Psychology-led specialisms such as Personality Disorder, Older Adults, Eating Disorders and ADHD/ASD services. This group meets regularly, and is a supportive forum to enable senior Psychologists to co-ordinate across the organisation and to share dilemmas and professional issues as required. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a key leadership role which involves both the support of experienced Psychologists, but also the ability to liaise with a wide range of stakeholders within and outside the Trust. We are therefore looking for an experienced clinician who also has demonstrable supervision and leadership skills. Given the multiple demands of the NHS Long-term Plan and the current COVID situation, we are looking for someone who is able to lead around change is able to adapt to quickly changing circumstances. The majority of the role will involve leadership and supervision, but there would also be the opportunity to undertake some clinical work as well. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Northamptonshire Healthcare Foundation NHS Trust was rated as “Outstanding” by CQC in 2018 and is a great place to work. We are proud of the Psychology provision within the Trust, and feedback has consistently been that we have a well-developed Psychology network in the Trust which offers a strong sense of professional identity, support and strategic influence. Psychology and psychological approaches are highly valued in the Trust, and Psychologists have the opportunity to shape clinical and organisational strategy as well as provide clinical services. We believe that supporting and involving our staff means that they enjoy their work more, and that our clinical services are better as a result. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant(s) would receive professional support and be managed by the Professional Head of Psychological Services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are a significant number of psychologists employed within the Trust working across different specialties and there are excellent opportunities for professional development through regular monthly psychology meetings and active peer supervision networks. The Trust enjoys good links with both Oxford and Leicester Doctoral training courses. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Northamptonshire is a pleasant area with a mix of rural and urban locations and is within easy distance of other key locations in the Midlands with excellent rail and road links.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Paul Flecknoe&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Head of Psychological Therapies&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Paul.Flecknoe@nhft.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;07795445342&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Campbell House, Northampton", "postalCode": "NN1 3EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2411", "longitude": "-.896195"}}, "title": "Consultant Clinicial Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240068", "validThrough": "2020-11-08T23:59:59+0000"}