{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-04T09:21:12+0000", "description": "&lt;p&gt;East Kent Early Intervention in Psychosis Services (EIP) are offering an exciting opportunity for an experienced Family Intervention Psychotherapist to join the service. Intent on bringing innovative ideas into practice, this service is forward thinking and flexible in providing good quality psychological therapies for people with psychosis and their families.&lt;/p&gt;\n&lt;p&gt;Family work is an integral part of EIP care offer to service users and their carers/family members. You would be responsible for offering high quality family and carer interventions across the East EIP teams. Case consultation and joint working with staff in the multi-disciplinary teams will also be an expectation. You will have plenty of scope and support to develop your own practice, whilst providing a highly professional service to people with psychosis and to their families.&lt;/p&gt;\n&lt;p&gt;The Early Intervention for Psychosis Service is a well-respected and well-established multi-disciplinary service with a reputation for excellence. The EIP psychological therapies service is integrated within the EIP service and committed to providing support, excellent supervision and to developing its staff&lt;/p&gt;\n&lt;p&gt;Experience in Mental health (especially psychosis) and additional Specialist Post graduate Qualification to Masters level or equivalent in relevant Family and or Systemic Psychotherapy is necessary for the role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Meena McGill, Lead for Psychological Practice&lt;/p&gt;\n&lt;p&gt;Email: meenamcgill@nhs.net, Telephone: 075 356 549 88.&lt;/p&gt;\n&lt;p&gt;Dr Elsa Murphy (Principal Psychologist) on 07980 652268&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastern &amp; Coastal Area Offices, Canterbury", "postalCode": "CT11AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2778", "longitude": "1.11098"}}, "title": "Family Intervention Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255170", "validThrough": "2020-11-18T23:59:59+0000"}