{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-20T09:15:33+0100", "description": "&lt;p&gt;“My team are friendly, supportive and caring,” says surgical Sister Emily and Registered Nurse Nicole agrees, “when I recently joined the Trust I was welcomed by my ward and other members of staff in the hospital. Moving to Harrogate Hospital was the best decision I ever made.”&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, caring and passionate nurses with an interest in providing exceptional care to patients on our surgical wards. Whether you are an experienced Registered Nurse or about to embark on your nursing career, we would welcome your application.&lt;/p&gt;\n&lt;p&gt;We can offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;4 weeks supernumerary and ongoing mentoring&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Bespoke rotational posts to ITU/Emergency Department or Medicine&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to Education Centre, Library and Clinical Skills Lab with quality assured Clinical Educators&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Band 6 development posts&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support and guidance with revalidation&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Our Ward Sister on Wensleydale was keen to tell newly qualified nurses about our “&lt;strong&gt;fantastic two-year preceptorship programme.&lt;/strong&gt; Our new starters are very well supported in our friendly, welcoming team.” We also welcome applications from nurses returning to practice.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At Harrogate and District NHS Foundation Trust we provide ‘outstanding’ care to both our patients and our staff. We support staff through benefits, health and wellbeing initiatives and opportunities for personal and professional development.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;An inclusive and supportive culture – our Trust encourages staff to bring their whole selves to work and active Staff Networks identify areas for improvement.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Staff Recognition - as well as regular appraisals, we recognise staff with our Making a Difference and Team of the Month Awards plus the Christmas Oscars.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Employee Support and wellbeing - we have a comprehensive Employee Assistance Programme, counselling service and fast track physiotherapy service for employees.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Staff Benefits - We have a range of staff benefits and schemes to support staff health, engagement, wellbeing and inclusion.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Harrogate is consistently voted the happiest place to live in the UK, with a vibrant local music, arts and foodie scene. Beautiful natural spaces, sports facilities, great shopping and high performing schools make this a great location to settle down in.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To keep up to date with all of our latest Recruitment activity here at Harrogate and District NHS Foundation Trust, take a look at our Facebook page: ‘Team HDFT jobs – Harrogate and District NHS Foundation Trust’ and follow us on Twitter: @HDFT_Careers.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Registered Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full and part time positions available &lt;strong&gt;Band: &lt;/strong&gt;5 &lt;strong&gt;Salary: &lt;/strong&gt;£24,907 to £30,615 pa pro rata&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential requirements:&lt;/strong&gt; Registered Nurse on the appropriate part of the NMC Register&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lesley Danby, lesley.danby@nhs.net 01423 553168&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate District Hospital, Harrogate", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Registered Nurse - Surgical Wards", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233541", "validThrough": "2020-11-10T23:59:59+0000"}