{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27000", "minValue": "25000", "unitText": "YEAR", "value": "£25,000 - £27,000"}}, "datePosted": "2020-10-29T12:42:23+0000", "description": "&lt;h2&gt;About The Job&lt;/h2&gt;\n&lt;p&gt;Do you pride yourself on your career in administration management?&lt;br /&gt;Do you feel confident working in a healthcare setting?&lt;br /&gt;If so, this may be the role for you!&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are looking for an Administration Manager to join us at The Junction Health Centre, based in Clapham.&lt;/p&gt;\n&lt;h2&gt;Responsibilities&lt;/h2&gt;\n&lt;p&gt;As the Administration Manager, you will be managing our administrators, reception staff and patient service advisors to ensure a smooth and efficient running of the service, You will lead the team and manage enquiries from patients and relatives alike, following guidelines and developing processes in order to give a courteous and proficient experience to those that visit the centre.&lt;/p&gt;\n&lt;p&gt;You will also be a focal point for our clinicians and managers, supporting them as appropriate as you work together within the service.&lt;/p&gt;\n&lt;p&gt;As well as the above, your main duties would also include (but not limited to):&lt;br /&gt;• Responsible for managing the receptionist/administrator rota on a monthly basis&lt;br /&gt;• Maintain, update and monitor the computer systems and associated equipment on an ongoing basis, reporting faults to the IT Helpdesk&lt;br /&gt;• Process all private communications and records between the Practice and third parties, adhering to the Data Protection Act.&lt;br /&gt;• Conducting regular risk assessments, 1-to-1 meetings, KPI reports, stock monitoring, etc&lt;br /&gt;• Participate in any training programmes implemented by the Practice&lt;br /&gt;• Engagement and complaint handling with regards to non-clinical concerns&lt;br /&gt;• Become the super-user for EMIS and generate all reports and provide basic training to staff&lt;br /&gt;• Ensure that there is adequate staff training in the use of technology, identifying a minimum knowledge base for all staff and appropriate levels for development.&lt;br /&gt;• Working with HR to manage the Admin/Reception staff, including recruitment, development and performance (including grievance issues, sickness/performance monitoring, disciplinary investigations and hearings).&lt;br /&gt;• Development and delivery of company policies.&lt;br /&gt;• Identify training and induction needs for direct reports and deliver or organise the delivery of training to meet these needs where appropriate.&lt;br /&gt;• Share the on call Duty Manager responsibilities with the Service Manager.&lt;/p&gt;\n&lt;h2&gt;Who We&#39;re Looking For&lt;/h2&gt;\n&lt;p&gt;• Previous administration manager experience managing a team of staff in healthcare setting&lt;br /&gt;• Able to deal with difficult and demanding situations&lt;br /&gt;• Experienced in providing information and advice to patients/relatives and/or members of the public.&lt;br /&gt;• The ability to plan and organise own time&lt;br /&gt;• The ability to exercise judgement when dealing with patient enquiries /problems.&lt;br /&gt;• Excellent Computer Skills.&lt;br /&gt;• Complaint management&lt;br /&gt;• Knowledge of EMIS WEB&lt;/p&gt;\n&lt;h2&gt;What We Can Offer You&lt;/h2&gt;\n&lt;p&gt;In return for your hard work we can offer a competitive salary of £25,000-£27,000, dependent on experience, as well as the following benefits:&lt;br /&gt;• 25 days annual leave (pro-rata), as well as bank holidays&lt;br /&gt;• Company Pension Scheme&lt;br /&gt;• Contribution towards eye test and glasses.&lt;br /&gt;• Cycle to work scheme – offering discounts rates and payment plans of bicycles and equipment&lt;br /&gt;• Practice Plus Group perks – offering you discounts and cash back with large retailers.&lt;br /&gt;• Occupational health support&lt;br /&gt;• Access to our bespoke e-learning system&lt;/p&gt;\n&lt;h2&gt;Additional Information&lt;/h2&gt;\n&lt;p&gt;This role is a one year fixed term contract; however, this will be reviewed with the possibility of going permanent.&lt;/p&gt;\n&lt;p&gt;The hours will usually be Monday to Friday, but will require occasional weekends (prior notice would be given of this).&lt;/p&gt;\n&lt;p&gt;Once you are shortlisted for interview, you will be contacted by Karla, who will arrange a face to face interview.&lt;/p&gt;\n&lt;p&gt;Please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Offers of employment are subject to receipt of satisfactory pre-employment checks.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clapham", "postalCode": "SW11 2NU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4651", "longitude": "-.1715"}}, "title": "Administration Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248350", "validThrough": "2020-11-12T23:59:59+0000"}