{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inc. HCAS"}}, "datePosted": "2020-10-27T18:00:29+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Senior Innovation Advisor&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;18 months Fixed-term due to funding&lt;/strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt; &lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a passionate, values-driven Senior Innovation Advisor, to support complex change by bringing energy, expertise, and empathy to bear in the development, execution, and management of innovation projects. You will form part of our development pool where we will support you to develop in areas that you are interested in and that meet our business needs.&lt;/p&gt;\n&lt;p&gt;Imperial College Health Partners (ICHP) is seeking candidates with an interest in healthcare to join our growing Strategy directorate.&lt;/p&gt;\n&lt;p&gt;ICHP is a partnership organisation bringing together NHS providers of healthcare services, clinical commissioning groups and leading universities across North West London. We have been designated by NHS England as the Academic Health Science Network (AHSN) for North West London, and we are one of 15 AHSNs across England which make up The AHSN Network.&lt;/p&gt;\n&lt;p&gt;At ICHP we believe that innovation can be a powerful trigger to create new ways of working. &lt;br /&gt;Through working with world leading hospitals, community providers, commissioners and universities, we match health challenges with new innovations. This helps our partners provide the best possible health and care outcomes for North West London’s 2.3 million residents.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our strategic priorities are to:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Innovate and collaborate for a healthier population making a real measurable impact; and&lt;/li&gt;\n&lt;li&gt;Diversify our customer base in order to broaden our income sources and work where we can have the largest impact.&lt;/li&gt;\n&lt;li&gt;Our organisation has a range of talents and experiences, bringing knowledge, skills and experience to the way we connect with our stakeholders.&lt;/li&gt;\n&lt;li&gt;At a time where collaboration and innovation are crucial to help meet some of healthcare’s most pressing challenges, there has never been a better time to join us.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Senior Innovation Advisors support complex change by bringing energy, expertise, and empathy to bear in the development, execution, and management of innovation projects. You will form part of our development pool where we will support you to develop in areas that you are interested in and that meet our business needs.&lt;/p&gt;\n&lt;p&gt;You will work on a mixture of short-term projects and longer-term programmes. This could involve:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Project and financial management&lt;/strong&gt; – organise your own and others work to deliver it on time in the most cost-efficient manner.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Strategy and planning&lt;/strong&gt; – work with our partners to develop strategies and plans to help execute their programmes of work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Searching for best practice and solutions&lt;/strong&gt; – help partners identify new solutions for their problems, often by researching and understanding existing good practice from other organisations, sectors and countries.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt; Analysis&lt;/strong&gt; – understand and interpret data and evidence in a meaningful way for our partners. You will work with our internal team of health economists and analysts to provide in-depth analysis of real-world data to inform decision making.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Communication and relationship building&lt;/strong&gt; – spend time working with NHS staff, academics, industry and the public to understand the need for new innovations.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Implementation&lt;/strong&gt; – work with our partners to implement new ideas, systems and technologies to solve problems in the health service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for people who are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Passionate and forward-thinking about healthcare&lt;/li&gt;\n&lt;li&gt;Problem-solvers with an ability to spot new ways of doing things&lt;/li&gt;\n&lt;li&gt;Collaborative and able to build good relationships&lt;/li&gt;\n&lt;li&gt;Adaptable and self-motivated to work across several projects at any one time&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We don’t expect everyone to be good at everything and are most interested in candidates who have a clear sense of what strengths they could bring to the team and where they will need support and development. We would expect you to have the ability to understand and apply a wide range of evidence to problems in healthcare and to communicate in a compelling way with clinical and managerial staff in the NHS. You will be supported by Innovation Managers and Leads but will be able to work autonomously and lead your own projects.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Interviews will be held in the week commencing 23 November 2020&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAbeer ItrakjyJob titleInnovation LeadEmail addressabeer.itrakjy@imperialcollegehealthpartners.com&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Imperial College Health Partners, London", "postalCode": "NW1 2FB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5265", "longitude": "-.13467"}}, "title": "Senior Innovation Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245603", "validThrough": "2020-11-10T23:59:59+0000"}