{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34208", "minValue": "34208", "unitText": "YEAR", "value": "£20.35"}}, "datePosted": "2020-11-04T01:01:36+0000", "description": "&lt;p&gt;&lt;strong&gt;**PLEASE NOTE THIS IS TO APPLY TO JOIN NHS PROFESSIONALS’ ALLIED HEALTH PROFESSIONALS BANK**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Band 6 Dietitan&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; The Princess Alexandra Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt; AAU&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates:  &lt;/strong&gt;Days: £20.35&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: PAH-AAU&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:         &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’ll help with the little things.…. Join the bank today!&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community, working in a location with all the benefits of coast and country living with the convenience of big city life?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you! &lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for Band 6 Dieitian available at Princess Alexandra Hospital, specifically providing the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To work as part of a team of acute adult dietitians to provide dietetic input to the wards, acting as a source of expertise to patients and healthcare professionals in the dietary management and treatment of a diverse range of clinical conditions.&lt;/li&gt;\n&lt;li&gt;Working closely with the catering manager, lead the development of the hospital menus which requires completing analysis of the menus, suggesting changes in line with national recommendations, and then coding menus for special diets.&lt;/li&gt;\n&lt;li&gt;Attend daily parenteral nutrition rounds as part of the nutrition team and contribute towards provision of expert knowledge and care in assessing, making recommendations for and monitoring patients referred for parenteral nutrition.&lt;/li&gt;\n&lt;li&gt;Active involvement in the nutrition multi-disciplinary team, including attending regular MDT meetings and taking an active role in following up and implementing recommendations made for complex patients to ensure best possible patient care.&lt;/li&gt;\n&lt;li&gt;Provide regular training to other healthcare professionals around nutrition and the dietetic assessment and treatment of a range of conditions.&lt;/li&gt;\n&lt;li&gt;Contribute towards dietetic and Trust service development.&lt;/li&gt;\n&lt;li&gt;Management of junior dietetic staff members.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Princess Alexandra Hospital has an enviable reputation, great supportive team with a family feel.  Based in the heart of the Hospitals main site, which is set within the heart of Harlow, the post holder here will be pivotal in providing the best level of quality care to varying departments and their patient’s needs.&lt;/p&gt;\n&lt;p&gt;Excellent transport links mean their location is commutable from Hertfordshire, London, Buckinghamshire, Bedfordshire, Oxfordshire.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will:&lt;/p&gt;\n&lt;p&gt;Degree in Nutrition and Dietetics&lt;/p&gt;\n&lt;p&gt;HCPC Registered&lt;/p&gt;\n&lt;p&gt;6 months Hospital experience is preferred but not essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03330 144 370&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with &lt;em&gt;Phoebe Toms, Recruitment Consultant on 0333 014 4370 or Phoebe.Toms&lt;/em&gt;&lt;em&gt;@nhsprofessionals.nhs.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harlow", "postalCode": "CM20 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7713", "longitude": ".086331"}}, "title": "Band 6 Dietitan", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255022", "validThrough": "2020-12-31T23:59:59+0000"}