{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-10-29T09:31:02+0000", "description": "&lt;p&gt;Do you have excellent IT skills, enjoy working within a clinic setting and love a challenge? If this sounds like you, we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, approachable, flexible and confident individual to join our friendly team in providing day to day administration and facilities support, for the services using the Parkstone Community Clinic in Poole.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will possess excellent communication skills, an eye for detail and proven IT skills.&lt;/p&gt;\n&lt;p&gt;The main responsibilities of this role will be to provide a reception, administrative and facilities support to services within 6 Bournemouth and Poole Community Clinics and the wider Trust Estates department.&lt;/p&gt;\n&lt;p&gt;Whilst the role will primarily be based at our Parkstone Community Clinic, there will be a requirement for the successful candidate to work across all 6 community clinics to cover annual leave and unexpected absences. Travel expenses will be reimbursed as per Trust policy.&lt;/p&gt;\n&lt;p&gt;The post holder may also be responsible for the security (opening and closing of some of the clinics) and will facilitate the smooth running of the clinics. Duties will include providing a reception service to patients, staff and visitors at the clinics, raising and managing any maintenance and facilities issues and being the designated fire marshal/fire warden for the building.&lt;/p&gt;\n&lt;p&gt;This is a full time Band 2 administrator post, working 37.5 hours per week Monday to Friday, 8.30am - 5pm. The post holder must hold a valid UK driving licence.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires a Standard Disclosure and Barring Service (DBS) check.&lt;/p&gt;\n&lt;p&gt;Should a large number of applications be received for this post the closing date will be brought forward.&lt;/p&gt;\n&lt;p&gt;Interviews are scheduled for Tuesday 17th and Wednesday 18th of November.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jen Ward, Community Clinics Support Manager, Email address: jen.ward@nhs.net, Telephone number: 07557 634157&lt;/p&gt;\n&lt;p&gt;Additional contact information:&lt;/p&gt;\n&lt;p&gt;OR alternatively please contact the Community Clinics Supervisor - Sue Theakston on 07767 417304.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Parkstone Community Clinic (Base) but will be required to support 5 other community clinics, Poole", "postalCode": "BH14 0DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7284", "longitude": "-1.94236"}}, "title": "Community Clinic Support Receptionist/Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247740", "validThrough": "2020-11-08T23:59:59+0000"}