{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14725", "minValue": "14725", "unitText": "YEAR", "value": "£8.76 Per Hour Free DBS check, comprehensive learn"}}, "datePosted": "2020-11-03T10:17:24+0000", "description": "&lt;p&gt;Salary:£8.76 per hour&lt;/p&gt;\n&lt;p&gt;Desirable / Requirements:QCF Level 2 Health &amp; Social Care or willing to work towards&lt;/p&gt;\n&lt;p&gt;Hours of Work: Various, working on a rolling rota basis, Full time, Part time, Nights and Bank opportunities available&lt;/p&gt;\n&lt;p&gt;Contract Type:Permanent, Bank, Nights&lt;/p&gt;\n&lt;p&gt;Benefits of Working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meals Provided, On-site parking, Free Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Enhancements for Night Shifts (+20p per hour night allowance), and Bank Holiday&#39;s (double pay)&lt;/li&gt;\n&lt;li&gt;Comprehensive Learning &amp; Development to support individuals with a forensic/offending background&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Company Funded Benefits: Free DBS check, Flu vaccination and Hepatitis B vaccination.&lt;/p&gt;\n&lt;p&gt;About the Role: We are currently recruiting for night, full time and part time team members. We also have bank opportunities for added flexibility.&lt;/p&gt;\n&lt;p&gt;We support individuals with a learning disability and complex needs, who may also have a forensic/offending history. The post holder will gain satisfaction from working either as part of a team, or on a one to one basis, by providing skilled support which positively impacts individuals health and wellbeing, whilst enabling people to fulfil their potential.&lt;/p&gt;\n&lt;p&gt;Your Daily Tasks as a Complex Care Worker will involve:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensuring ongoing assessment and management of risks associated with individuals within an attitude of &#39;positive risk taking&#39;.&lt;/li&gt;\n&lt;li&gt;Building supportive, trusting relationships with individuals.&lt;/li&gt;\n&lt;li&gt;Proactive development of links with local statutory and voluntary organisations to provide a range of engagement opportunities for individuals in the community.&lt;/li&gt;\n&lt;li&gt;Involving individuals in the design, development and delivery of the service.&lt;/li&gt;\n&lt;li&gt;Supporting individuals through behaviours that may challenge, supporting the development of PBS plans and following plans effectively to limit the impact of the behaviour on the individual&#39;s lives.&lt;/li&gt;\n&lt;li&gt;Where relevant, liaising with external professionals and following Ministry of Justice guidance and restriction/monitoring requirements when supporting individuals.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;If you are an experienced care worker or support worker, or if you feel you can make a real difference to the lives of others, we want to hear from you! Please complete the short application and upload your CV.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Llangwyfan, Denbighshire", "postalCode": "LL16 4LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1846", "longitude": "-3.31823"}}, "title": "COMPLEX CARE WORKER", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253426", "validThrough": "2020-12-03T23:59:59+0000"}