{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31075", "minValue": "31075", "unitText": "YEAR", "value": "31,075"}}, "datePosted": "2020-11-06T11:49:25+0000", "description": "&lt;p&gt;&lt;strong&gt;Job title: Business Manager – NHS Race and Health Observatory &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Location: London or Leeds (initially home based due to Covid19)&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Role: 1 x fulltime permanent 36.5 hours per week &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Salary: Grade D, £27,045 per annum FTE (plus £4,000 London weighting if applicable)&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Do you want to support national work to identify and address the poorer access, experience and outcomes experienced by BME patients, communities and healthcare staff?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Are you interested in providing specialist business and administration support and advice?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Would you like to support the financial management of the Observatory’s function?&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;We would love to hear from you if you:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Are interested in the area of tackling race inequality for patients, communities and the NHS workforce&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Enjoy dealing with, and responding effectively to, complex queries and passing on relevant information to appropriate team members sensitively and in a timely manner&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Have experience in maintaining constructive relationships with a broad range of internal and external stakeholders&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Have excellent communication skills and negotiation skills &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Have experience of supporting the management of budgets and overseeing budget administration &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Enjoy being part of a small team that is passionate about supporting healthcare organisations in tackling race equality&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the Business Manager you will be responsible for the Observatory’s day-to-day business administration; this includes ensuring that there are robust systems in place to meet the team’s overall business and administrative requirements whilst also providing a professional, approachable and efficient first point of contact for internal and external queries.&lt;/p&gt;\n&lt;p&gt;You will specialist business and administrative management including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Overseeing the financial management of the Observatory’s budget&lt;/li&gt;\n&lt;li&gt;Scheduling and organising Observatory Board meetings as necessary&lt;/li&gt;\n&lt;li&gt;Organising and supporting the planning and administration of events and supporting with other relevant paperwork and processes&lt;/li&gt;\n&lt;li&gt;Operating effectively in a flexible and demanding environment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Organisation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will receive an excellent benefits package, including 30 days annual leave, pension scheme, flexible working, salary sacrifice schemes and travel season ticket loans.&lt;/p&gt;\n&lt;p&gt;Equality, diversity and inclusion is at the heart of the NHS Confederation and we are actively seeking to increase diversity in our workforce through a process that is fair, open, consistent, and free from discrimination. We welcome all applications from all backgrounds and encourage applications from our BAME communities, our LGBTQ+ communities and from individuals who identify as being disabled, as well as all other protected characteristics. We are committed to building a diverse and inclusive company culture where all employees feel valued, respected, and acknowledged.&lt;/p&gt;\n&lt;p&gt;The NHS Confederation is committed to being a flexible employer. We understand the value and benefit to our employees being able to work flexibly to respond to changing circumstances and we want to ensure we do as much as possible to help support a work life balance and take care of employee health and wellbeing.&lt;/p&gt;\n&lt;p&gt;The NHS Confederation is a membership body that brings together and speaks on behalf of all organisation’s that plan, commission and provide NHS services with our members drawn from every part of the health and care system. At the NHS Confederation we are passionate about our values (voice, openness, integrity, challenge, empowerment and respect). These are supported by a set of behaviours that demonstrate the attitudes and approach we take to work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply please read the job description and complete the application form.&lt;/p&gt;\n&lt;p&gt;If you wish to discuss the post before applying, then please contact Habib.Naqvi@nhsemployers.org&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Application deadline: 22nd November 2020 (midnight)&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Interview date: 1st December 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Confederation", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW1H 0DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5", "longitude": "-.133449"}}, "title": "Business Manager – NHS Race and Health Observatory", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259520", "validThrough": "2020-11-22T23:59:59+0000"}