{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-02T12:00:26+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a registered band 6 mental health nurse to join the Winchester OPMH CMHT based at Avalon House. The team is a highly supportive and innovative team that aspires to provide a responsive, safe, effective, caring service that is well led. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;OPMH are embarking on an exciting period of transformation, with the development of the Memory Assessment Service and Care Home In-reach Service; the right person should hold a specialist interest in the care and support of older people with an interest in memory and supporting care home environments.  &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be responsible for memory assessments and assessments and support of care needs within care home settings whilst ensuring that the patient and carers are at the centre; this role will be supported by the advanced nurse practitioner and CMHT team leader to ensure robust supervision with opportunities to continue with professional development available to include completion of the prescribing pathway. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be expected to work with a high degree of autonomy and professional accountability and will have excellent time management skills. You will play an important role in the team as we aspire to provide excellent patient care and develop our services in line with national and local drivers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Car driver essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Further enquiries and informal visits are welcome please contact Jo McGee; Team lead on 01962 831010 or joanna.mcgee@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester / Avalon House", "postalCode": "SO23 0HU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0599", "longitude": "-1.30687"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251919", "validThrough": "2020-11-16T23:59:59+0000"}