{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-22T11:16:14+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;YOU CAN HAVE IT ALL!&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a substantive Consultant Psychiatrist in Older Adult Psychiatry to join our well established Older Adult Teams in Furness, South Lake District. This full time, 10 PA role would be based at Furness General Hospital LA14 4LF .&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity and we are looking for a consultant interested in inspiring, leading, and developing our service. You will work with a multidisciplinary team including other doctors, nurses, OTs, Social Worker and Psychologist.&lt;/p&gt;\n&lt;p&gt;Lancashire and South Cumbria is a fantastic place to live and work. We have the Lake District, the Yorkshire Dales and the Ribble Valley on our doorstep. We&#39;re within easy reach of the vibrant cities of Manchester and Liverpool and 2 1/2 hours from London by rail. We have excellent state schooling and affordable rural or city living. Lancashire and South Cumbria Foundation Trust is dynamic and forward thinking. We&#39;re keen to encourage you in developing your interests in education, research, leadership and more alongside your clinical role.&lt;/p&gt;\n&lt;p&gt;We take an innovative and flexible approach to planning your job with you, focusing on work life balance to enable you to make the most of all that living and working in Lancashire and South Cumbria has to offer.&lt;/p&gt;\n&lt;p&gt;The role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;2.5 SPAs as standard for a full time post&lt;/li&gt;\n&lt;li&gt;Excellent old age psychiatry peer support group&lt;/li&gt;\n&lt;li&gt;Opportunities to be a clinical supervisor&lt;/li&gt;\n&lt;li&gt;Relocation package available.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder will be expected to contribute to the on call rota out of hours and at weekend. This work will be remunerated appropriately.&lt;/p&gt;\n&lt;p&gt;The Job Description provides additional information about the post.&lt;/p&gt;\n&lt;p&gt;Lancashire &amp; South Cumbria NHS Foundation Trust has over 100 Consultant Psychiatrists and is recognised as one of the best NHS employers in the country. We are proud to have amongst our Consultant workforce, recent winners of; the RCPsych CESR Evaluator of the Year, RCPsych Researcher of the Year, &amp; RCPsych North West Division Trainer of the Year.&lt;/p&gt;\n&lt;p&gt;Applicants should hold full GMC registration and be included on the Specialist register of the GMC or they should be eligible for entry to the Specialist Register within 6 months of the interview date.&lt;/p&gt;\n&lt;p&gt;It is a requirement that applicants are Section 12 Approved at the time of commencing employment and have or are eligible to have Approved Clinician Status. Remuneration will be as set out in the terms of the New Consultant Contract according to previous experience.&lt;/p&gt;\n&lt;p&gt;We&#39;ll support you with relocating and settling in to your new post.&lt;/p&gt;\n&lt;p&gt;Get in touch to find out more about joining us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Deputy Associate Medical Director Dr Deepa Umadi on 01539 715024 or Dr Alison Napier on 01524 550150 or e-mail medicalrecruitment@lancashirecare.nhs.uk. Informal visits are encouraged.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Furness General Hospital, Barrow in Furness", "postalCode": "LA14 4LF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1364", "longitude": "-3.20788"}}, "title": "Consultant Psychiatrist - Older Adults, Furness (South Lake District)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238106", "validThrough": "2020-11-22T23:59:59+0000"}