{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20795", "minValue": "18813", "unitText": "YEAR", "value": "£18,813 - £20,795 per annum"}}, "datePosted": "2020-10-29T15:01:03+0000", "description": "&lt;p&gt;INTERNAL VACANCY ONLY therefore only current employees of Nottingham University Hospitals NHS trust will be considered for this post.&lt;/p&gt;\n&lt;p&gt;Nottingham University Hospitals NHS Trust are looking to recruit colleagues who are currently working in an HCA/clinical support role to begin training in the HCOP specialty.&lt;/p&gt;\n&lt;p&gt;The Trainee Nursing Associate is a band 3 Apprenticeship role for existing NUH NHS Trust employees to undertake work based learning with a day release programme at Derby University (or Chesterfield Campus) over 24 months leading to a Foundation Degree qualification. Upon successful completion of the 2-year programme, you will be regulated by the NMC and eligible to work as a band 4 Nursing Associate.&lt;/p&gt;\n&lt;p&gt;The Trainee Nursing Associate role will appeal to those with personal ambition to embrace this new role and who are committed to providing excellent patient care. You will be supported in your personal development, your academic journey and in developing your skills in the clinical area. You will need to fulfil the minimum academic requirements detailed in the person specification. You must be able to present a portfolio as evidence of your on-going learning and reflection.&lt;/p&gt;\n&lt;p&gt;Please provide correspondence from your manager outlining your suitability for this role and assurance you have their support as early release for University days may be required. This will be requested from you during the shortlisting process.&lt;/p&gt;\n&lt;p&gt;Please note that candidates must be flexible in the working patterns to meet the needs of their training programme, which will largely be Mon-Fri shift patterns, however flexibility is required to support shifts outside these hours to achieve placement and learning objectives. This role is 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You must be able to provide evidence of Maths and English GCSE Grade A-C (or equivalent e.g functional skills level 2)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBev BradyJob titleLead Nurse for Integrated CareEmail addressbev.brady@nuh.nhs.ukTelephone number73531Additional contact information&lt;/p&gt;\n&lt;p&gt;Emily Brigs-Integrated Care Directorate PA&lt;/p&gt;\n&lt;p&gt;Emily.briggs@nuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "QMC  Campus, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Trainee Nursing Associate ***Internal Applicants Only***", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248794", "validThrough": "2020-11-12T23:59:59+0000"}