{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 Per Annum"}}, "datePosted": "2020-10-28T15:02:00+0000", "description": "&lt;p&gt;This post will be based within the Medical Directorate and the successful candidate will be responsible for provision of a high level efficient, comprehensive and confidential Administrative service to the Medical Directorate.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who has significant organisational skills, initiative, time management skills and personal credibility. The role requires a widely experienced Administrator with the ability to provide an excellent, confidential and efficient service.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to work on their own, using their own initiative within the guidelines set by Nottinghamshire Healthcare NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;You will have extensive experience of dealing efficiently with all correspondence, emails, monitoring telephone enquiries and providing information as appropriate. Producing minutes of meetings, including taking and transcribing minutes of formal meetings, disciplinary and grievance hearings. Management of multiple diaries, composing letters, convening, administering and attending regular meetings. Booking accommodation, making travel arrangements and uploading information to an intranet site, recording and monitoring sickness and ordering stock. You will have excellent written and communication skills along with the ability to prioritise work and meet deadlines.&lt;/p&gt;\n&lt;p&gt;You will have the ability to travel across Trust sites to attend meetings as and when required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact Lorna Viikna, Business Manager on either Lorna.Viikna@nottshc.nhs.uk or 0115 854 2224 - 15672&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Duncan Macmillan House, Mapperley", "postalCode": "NG3 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9796", "longitude": "-1.12644"}}, "title": "Senior Administrator Corporate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247116", "validThrough": "2020-11-08T23:59:59+0000"}