{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-05T08:45:32+0000", "description": "&lt;p&gt;The Pathology Department at Nottingham University Hospitals are looking for enthusiastic candidates to join the team in the role of associate practitioners.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Associate practitioners are high level support staff who work with biomedical scientists to ensure effective service delivery on a rotational basis, duties include data entry, equipment maintenance and processing samples. The role is varied and involves providing support to the scientific staff (Biomedical Scientists) and as such is a key role in sustaining a quality diagnostic service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Work includes the receipt, sorting, preparation and processing and analysis of patient samples, maintaining stocks of consumable items, disposal of biological waste, operating and maintaining laboratory equipment as well as general housekeeping duties and clerical tasks including data input of patient demographics and test request information. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We expect you to be a passionate, self-motivated individual who has an organised approach to work with good attention to detail and who can remain calm when busy. You will possess well developed communication and observational skills and enjoy working as part of a team so together we can provide excellent care and quality in a challenging environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Previous experience in an NHS clinical laboratory or in analytical techniques would be an advantage but is not essential as full training will be provided. What is important to have is a positive attitude; experience of working effectively in a busy team environment, performing work which may have been repetitive in nature but requires good concentration and attention to detail is also experience that we are looking for. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is currently based at Queen&#39;s Medical Centre Campus in the newly formed covid laboartory. Vacancies are fixed term contracts for 6 months in the first instance with a view for possible extension. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working hours: Sunday-Sunday 37.5 hours per week and may include night shifts, weekends and bank holidays . &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStephanie SzolinJob titlePathology Care Group General managerEmail addressstephanie.szolin@nuh.nhs.ukTelephone number07812 268765&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "QMC Campus, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Associate Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256948", "validThrough": "2020-11-18T23:59:59+0000"}