{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa"}}, "datePosted": "2020-11-02T14:31:31+0000", "description": "&lt;p&gt;Pennine Care NHS Foundation Trust &lt;br /&gt;CONSULTANT IN ADULT PSYCHIATRY (COMMUNITY) &lt;br /&gt;CMHT, Bury- 10PAs&lt;br /&gt;&lt;br /&gt;Service/Ward/Department Summary:&lt;br /&gt;&lt;br /&gt;Pennine Care NHS Foundation Trust is looking to recruit a full-time substantive Consultant Psychiatrist. This post is based on the CMHT in Bury and is a Community post. The post holder will be based at the Irwell Unit, Fairfield General Hospital. Bury operates an Inpatient- Outpatient model (New Ways of Working) and is staffed by 6 full-time Consultants in Adult Psychiatry. Each Community Consultant is allocated a Junior Doctor (NW Deanery training schemes) to work with them with support from advanced practitioner and sessional input from a speciality doctor. The EIT is covered by a part time consultant. &lt;br /&gt;&lt;br /&gt;Role Summary:&lt;br /&gt;&lt;br /&gt;This is an exciting time to join the Trust and there are many opportunities to contribute to the organisations’ development and to look at service redesign models. Bury has a very strong teaching commitment and candidates will be expected to contribute to the teaching of medical and nursing staff. There are close links to ongoing research projects. The Consultants contribute to local service user &amp; carer groups. &lt;br /&gt;&lt;br /&gt;Key Responsibilities of the Post: &lt;br /&gt;&lt;br /&gt;&lt;br /&gt;To provide high-quality Mental Health Care for adults with severe and enduring mental health problems within the community&lt;br /&gt;To work closely with other teams and Consultants to ensure coherent and high-quality mental health care for adults with severe and enduring mental health problems within the Bury area &lt;br /&gt;To work with the other Consultants to support the development of the service, and to attend local and divisional service development meetings &lt;br /&gt;&lt;br /&gt;Key Requirements of the Person Specification:&lt;br /&gt;&lt;br /&gt;Applicants must be on the GMC’s Specialist Register or eligible for inclusion or be within six months’ of the anticipated award of a Certificate of Completion of Training (CCT) in General Adult Psychiatry at the time of interview for the post.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Low frequency on-call (1 in 30) with full second tier on call and 1 day off after your on call.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer ample opportunities for our consultants’ professional development and opportunities for additional work for additional PAs ( require negotiation)&lt;/span&gt;&lt;span&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;We have several additional clinical and leadership opportunities in Bury and across the trust that the successful candidate will be encouraged to consider once in post.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please contact Lead consultant-Dr Sarmad Nadeem for further information on 0161 716 1031 or email sarmad.nadeem@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CMHT, Irwell Unit, Fairfield Hospital, Bury", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Consultant in Adult Psychiatry (Community)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252445", "validThrough": "2020-12-07T23:59:59+0000"}