{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "55000", "minValue": "55000", "unitText": "YEAR", "value": "Up to £55,000pa DOE"}}, "datePosted": "2020-11-02T14:17:32+0000", "description": "&lt;p&gt;Cygnet Health Care was established in 1988. Since then we have developed a wide range of services for individuals with mental health needs and learning disabilities within the UK. We have built a reputation for delivering pioneering services and outstanding outcomes for the people in our care.&lt;/p&gt;\n&lt;p&gt;Our expert and highly dedicated care team of 8800 employees empower 3000 individuals across 140 services to consistently make a positive difference to their lives, through service-user focused care and rehabilitation.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has become available for a Psychologist to join our brand new service Cygnet Nield House in Crewe.&lt;/p&gt;\n&lt;p&gt;This role will be working 40 hours per week between Monday to Friday.&lt;/p&gt;\n&lt;p&gt;Cygnet Nield House in Crewe is our new 30-bed mental health hospital for women which is due to open in early 2020. Cygnet Nield House will offer a highly specialised service for individuals with a personality disorder and co-morbid disordered eating. The team will focus on providing a positive therapeutic environment, offering pre-engagement work and clinical models such as DBT informed and Schema focused approaches. The service aims to prepare service users for a move to step-down services, or where appropriate, discharge straight to community services or independent living. Group meetings, structured routines and therapeutic activities are to be provided to support individuals to participate in a meaningful day and within a supportive social network. As our service users progress through the rehabilitation and treatment pathway they will be supported in engaging in socially inclusive activities such as college or voluntary work in the community.&lt;/p&gt;\n&lt;p&gt;Cygnet Nield House will be a multi-disciplinary and psychologically informed service. The focus is on nurturing an enabling environment to deliver a clinical model, developed specifically to meet the needs of service users within an operational framework. Our overarching therapeutic approach is interpersonally focused, consistent, structured, safe, resilient and clinically directed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The opportunity…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post-holder will have a key role in providing specialist psychological assessments, interpretation from psychological tests, semi-structured interviews, individual and group therapy. You will also consider potential risks and social needs of the client group, relevant to their diagnosis.&lt;/p&gt;\n&lt;p&gt;You will work as part of a dedicated clinical team providing a multi-disciplinary approach to rehabilitation in a therapeutic environment where the focus is on maximising positive outcomes and recovery.&lt;/p&gt;\n&lt;p&gt;You will be expected to offer psychological insight and knowledge around the clinical area and provide consultation about the psychological care of the client group to staff, families and other agencies.&lt;/p&gt;\n&lt;p&gt;As a HCPC Registered Psychologist, you will have a pivotal role in the training and clinical supervision of Assistant Psychologists, Volunteers and Psychology Trainees / Students on site. You will also have involvement in audit, policy, service development along with the assessment and interpretation of outcomes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Doctorate Level Qualification (BPS route or equivalent) in Clinical/Counselling or Forensic Psychology along with HCPC Registration&lt;/li&gt;\n&lt;li&gt;Experience of working therapeutically with personality disorders and complex mental health difficulties&lt;/li&gt;\n&lt;li&gt;The ability to work effectively as part of a multi-disciplinary team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with a female personality disorder client group&lt;/li&gt;\n&lt;li&gt;Experience of working within eating disorder services and having a background in DBT and ACT and/or schema focused therapies&lt;/li&gt;\n&lt;li&gt;Training and supervision experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of this role include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;33 days annual leave&lt;/li&gt;\n&lt;li&gt;Fully paid training&lt;/li&gt;\n&lt;li&gt;Paid DBS&lt;/li&gt;\n&lt;li&gt;Freeparking&lt;/li&gt;\n&lt;li&gt;Courtesy meals and refreshments whilst on shift&lt;/li&gt;\n&lt;li&gt;Shopping and entertainment discount scheme(over 800 retailers)&lt;/li&gt;\n&lt;li&gt;Cycle to Work scheme&lt;/li&gt;\n&lt;li&gt;Opportunities to progress and develop&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All successfulapplicants will be required to become a member of the Protecting Vulnerable Groups Scheme (PVG) in respect of regulated work with protected adults and regulated work with children. A PVG certificate contains all unspent and certain spent conviction information. It also contains any other non-conviction information that the police or other&lt;/p&gt;\n&lt;p&gt;government bodies think is relevant. Disclosure Scotland continually monitor PVG scheme members&#39; records for vetting information including criminal convictions that may affect their suitability to work with vulnerable groups.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.118", "longitude": "-2.46723"}}, "title": "Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252405", "validThrough": "2020-11-16T23:59:59+0000"}