{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890"}}, "datePosted": "2020-11-04T10:46:06+0000", "description": "&lt;p&gt;The Peritoneal Dialysis (PD) team have a unique opportunity for a band 6 PD Deputy Sister / Charge Nurse to join our established team in the PD unit. This is a full-time post (37.5 hours per week). You would be based at the Wycombe hospital and visiting patients in the community. You may need to work in the PD unit in Oxford one day per week on an adhoc basis. You will also be carrying out pre-operative assessments in Wycombe.&lt;/p&gt;\n&lt;p&gt;We are looking for a person who is passionate about renal nursing and facilitating a good patient experience. You need to be enthusiastic and professional with a good work ethic, work independently and be flexible. Support is provided virtually through Oxford PD team. You should also be committed to delivering high standards of patient care and have an ability to think quickly on your feet.&lt;/p&gt;\n&lt;p&gt;As a home therapies nurses you would be responsible for teaching patients how to be self-caring on PD and home HD (adult learning theories). Also developing autonomous nursing skills in managing patients with a long-term condition and treating complications. As a large part of the role is community based so you must be a car driver and have access to a car.&lt;/p&gt;\n&lt;p&gt;Previous experience of expert knowledge in haemodialysis is vital as well as training patients in self-care. A qualification in renal nursing would be preferable as well advanced history taking module or a commitment to complete this.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be treating and supporting patients and their family to manage their long-term condition, thus good assessment skills are vital. Much of the work is also carried out over the phone therefore excellent communication skills are a necessity.&lt;/p&gt;\n&lt;p&gt;You would work closely with a small team of experienced and friendly PD nurses.&lt;/p&gt;\n&lt;p&gt;Hours are between 8 and 6pm Monday to Friday. The PD team also provides an out of hour’s telephone advisory on call service (which rotates between the nurses, approx. 1 week in 5) which you would contribute to when competent.&lt;/p&gt;\n&lt;p&gt;Please contact Jayne Woodhouse (Advanced Nurse Practitioner) for further information on 01865 225 792 or email Jayne.woodhouse@ouh.nhs.uk. It is strongly recommended that you attend for an informal visit (can be done via Microsoft teams).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date-12th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Planned interview Date-18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJayne WoodhouseJob titleAdvanced Nurse PractitionerEmail addressjayne.woodhouse@ouh.nhs.ukTelephone number01865 225792Additional contact information&lt;/p&gt;\n&lt;p&gt;Must be a car driver and have access to a car for work purposes.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford Kidney Unit, Wycombe general hospital, High Wycombe", "postalCode": "HP11 2TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6262", "longitude": "-.7534"}}, "title": "Deputy Sister / Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255432", "validThrough": "2020-11-12T23:59:59+0000"}