{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-03T11:16:31+0000", "description": "&lt;h1&gt;SUBSTANTIVE CONSULTANT HAEMATOLOGIST&lt;/h1&gt;\n&lt;p&gt;We are looking to appoint an enthusiastic consultant&lt;br /&gt;colleague who will join a team of 6 friendly&lt;br /&gt;haematologists offering a breadth of specialist care&lt;br /&gt;across Shropshire and mid-Wales, an area of&lt;br /&gt;outstanding natural beauty. This is a new position and&lt;br /&gt;helps meet the needs of a growing population. The&lt;br /&gt;appointment is for a full time substantive consultant&lt;br /&gt;with 10 Programmed Activities per week, but those&lt;br /&gt;seeking less than full time work are still welcome to&lt;br /&gt;apply. There will be a 1:6 on call commitment&lt;br /&gt;attracting an additional supplement.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the Shrewsbury &amp; Telford NHS&lt;br /&gt;Trust which is undergoing a period of transformational change&lt;br /&gt;following £312m of NHSE capital investment. This will fund&lt;br /&gt;significant infrastructural development with a strong focus on&lt;br /&gt;improving patient safety and offering care closer to home&lt;br /&gt;which includes the provision of cancer care.&lt;/p&gt;\n&lt;p&gt;The successful appointee will be based at The Royal Shrewsbury&lt;br /&gt;Hospital but will also have duties at The Princess Royal Hospital,&lt;br /&gt;Telford. The out-patient department at RSH benefits from a&lt;br /&gt;£4.8m stand-alone haematology unit which opened in 2012.&lt;br /&gt;Our innovative service has a strong nurse specialist influence&lt;br /&gt;capable of nurse lead procedural work, independent&lt;br /&gt;prescribing, and lone working with a newly appointed band 8&lt;br /&gt;nurse consultant. There is a keen departmental interest in&lt;br /&gt;research and innovation and for expanding of our current trials&lt;br /&gt;portfolio. The post holder will instil this attitude alongside&lt;br /&gt;delivering compassionate, patient centric care. The post&lt;br /&gt;requires malignant and general haematological work but also&lt;br /&gt;encourages some sub-specialisation to be discussed internally.&lt;/p&gt;\n&lt;p&gt;In-patient care is provided to BSH level 2b on a 30-bedded&lt;br /&gt;Haematology &amp; Oncology ward, fully refurbished in 2014.&lt;br /&gt;Admitting rights and responsibilities are retained by the core&lt;br /&gt;consultant, supported by Trust grade doctors. The Trust houses&lt;br /&gt;an 8 bedded ITU and allied medical teams offering dialysis,&lt;br /&gt;bronchoscopy, and interventional radiology. The haematology&lt;br /&gt;team is highly regarded, facilitated by close inter-disciplinary&lt;br /&gt;working. A motivated personable colleague is desired to&lt;br /&gt;maintain this relationship.&lt;/p&gt;\n&lt;p&gt;The position requires a laboratory commitment with a rota for&lt;br /&gt;reporting duties. The laboratory has full UKAS accreditation&lt;br /&gt;and will benefit from increased collaboration with both our&lt;br /&gt;networked partners in the N8 Network and the University&lt;br /&gt;Hospital Birmingham for HMDS reporting of haematological&lt;br /&gt;malignancies. The department offers a stand-alone cancer MDT&lt;br /&gt;with a population catchment of 520,000.Shropshire is an area of outstanding natural beauty and offers&lt;br /&gt;extensive outdoor recreational opportunities and easy access to&lt;br /&gt;North Wales and the Welsh Coast. Housing standards are high&lt;br /&gt;across the county with good local state and private Schools.&lt;br /&gt;The M54 motorway starts just outside Shrewsbury and provides&lt;br /&gt;quick access to the national motorway network.&lt;/p&gt;\n&lt;p&gt;It is essential that the applicant has full GMC registration with a&lt;br /&gt;licence to practice, possess MRCP and MRCPath (or equivalent&lt;br /&gt;training and experience), and is on the GMC Specialist Register&lt;br /&gt;in Haematology, or within six months of obtaining a CCT at&lt;br /&gt;time of interview&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Dewi EdenJob titleConsultant HaematologistEmail addressdewi.eden@nhs.netTelephone number01743 261000 Ext 1444Additional contact information&lt;/p&gt;\n&lt;p&gt;For an informal discussion, further details or to arrange a visit please contact&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr. Dewi Eden, Consultant Haematologist on 01743 261000 Ext 1444&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Shrewsbury Hospital, Shrewsbury", "postalCode": "SY3 8XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Consultant Haematologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253678", "validThrough": "2020-12-01T23:59:59+0000"}