{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T10:03:28+0000", "description": "\n&lt;p&gt;Business Intelligence Developer&lt;/p&gt;\n&lt;p&gt;An excellent opportunity has arisen to join our expanding team at a very exciting time in the NHS “information revolution”.  We are seeking an intelligent and enthusiastic Business Intelligence Developer with the aptitude to help us lead the way in innovative clinical intelligence delivery.  We have a track record of mutually supportive team working and, for individuals with the ambition and ability to learn quickly, there are excellent prospects for career progression within the team.&lt;/p&gt;\n&lt;p&gt;NHS Nottingham and Nottinghamshire Clinical Commissioning Group (the CCG) hosts a collaborative Data Management Team which directly supports the CCG and around 150 GP Practices and other Health and Social Care providers, collectively delivering care to more than 1.2 million patients across Nottinghamshire.  We work closely with local acute, community and mental health hospital Trusts, voluntary organisations, Local Authorities, IT service providers and national NHS data and Information Governance teams.&lt;/p&gt;\n&lt;p&gt;The CCG is dedicated to commissioning the highest quality services for our patients.  Our managers and clinicians rely on high quality, rich, accurate and very timely information analysed from a range of sources to make best use of increasingly precious resources.  As part of the Data Management Team, you will play a vital part in ensuring that innovative technology continues to deliver revolutionary advances in the way that we’re using data to overcome the challenges facing our health and social care system.&lt;/p&gt;\n&lt;p&gt;We are committed to the benefits of team working, mutual support and, for individuals with the aptitude and commitment to learn quickly, there are excellent opportunities for development within the team.&lt;/p&gt;\n&lt;p&gt;Reporting to the Head of Data Management, our BI Developers are primarily responsible for developing and maintaining a data warehouse and portal containing clinical and contracting information for use by clinicians, analysts and managers across the Nottinghamshire Integrated Care System (ICS)&lt;/p&gt;\n&lt;p&gt;The core deliverables for this post are to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Design, build, develop and maintain SQL-based Business Intelligence solutions presented via a web interface, in collaboration with other members of the team;&lt;/li&gt;\n&lt;li&gt;Provide technical knowledge to support ad-hoc projects and tasks;&lt;/li&gt;\n&lt;li&gt;Transfer knowledge to co-workers and other members of the Data Management Team;&lt;/li&gt;\n&lt;li&gt;Develop innovative technical solutions to ensure the CCG complies with Information Governance guidelines whilst supporting the availability of patient level information to clinical users, where appropriate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role requires a blend of skills – technical proficiency in the Microsoft Business Intelligence tools, an open and team-centred approach to delivery, an enquiring and analytical style of working, plus the ability to communicate with a diverse range of stakeholders and customers.&lt;/p&gt;\n&lt;p&gt;You will be a highly motivated, intelligent individual who is an excellent problem solver capable of working both in a team and autonomously.  Probably a graduate, you will have skills and experience is analytics, database / web development / programming, though not necessarily to an advanced level in every one of the areas in which we operate.  You might already have some NHS experience, but will certainly be able to demonstrate the application of logical and creative thinking, and the aptitude and willingness to learn challenging programming techniques and apply them to the healthcare sector. We will coach you to develop your full potential in this important role, at a time when our team’s solutions are in demand from an increasing number of care providers.&lt;/p&gt;\n&lt;p&gt;For more information or to arrange an informal visit please contact Carl Davis at carldavis1@nhs.net&lt;/p&gt;\n&lt;p&gt;** STRICTLY NO AGENCIES, PLEASE **&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Nottingham and Nottinghamshire Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128368"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Bridgford, Nottingham, NG2 6BJ", "postalCode": "NG2 6BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9378", "longitude": "-1.13131"}}, "title": "Business Intelligence Developer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245974", "validThrough": "2020-11-11T23:59:59+0000"}