{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-03T14:47:08+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;The Job &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have recently put a great deal of thought and effort into improving the work-life balance of our Critical Care Consultants.&lt;/p&gt;\n&lt;p&gt;Our innovative job plan illustrates how we have adapted our on call rota to prioritise both the welfare of our patients and our Consultants.&lt;/p&gt;\n&lt;p&gt;The on call rota has been designed to improve work life balance, reduce burnout and allow for flexibility as Consultants get older.&lt;/p&gt;\n&lt;p&gt;We have ensured a dedicated Consultant on call room next door to the Critical Care Unit.&lt;/p&gt;\n&lt;p&gt;As a unit we have prioritised looking after ourselves and even have a welfare lead with dedicated SPA time.&lt;/p&gt;\n&lt;p&gt;We hope to attract applications from both new and established Consultants who are looking to ensure that they get the right balance between life and work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Your Potential Colleagues &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are an innovative and dynamic team of Consultants who all have a CCT in Critical Care. At present our Consultants’ allied specialties are in Anaesthesia and Emergency Medicine. We welcome the opportunity to appoint Critical Care Consultants with any joint specialty.&lt;/p&gt;\n&lt;p&gt;Amongst our Critical Care Consultants we currently hold a variety of National and Trust positions. These include EDIC Examiner, FRCEM Examiner, RCOA examiner, AAGBI Board Member, NWAFT Associate Medical Director for Patient Safety, Chair of the NWAFT Resuscitation Committee and NWAFT Clinical Lead for Organ Donation.&lt;/p&gt;\n&lt;p&gt;We also benefit from strong links with the military and have two (soon to be three) RAF Consultants with Honorary NHS contracts.&lt;/p&gt;\n&lt;p&gt;We are all strongly family focussed and understand the challenges faced by Critical Care Consultants with young families. We have developed a strong support network amongst ourselves and regularly make time for breakfast and a chat before the start of the working day.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The Area &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Stamford and its surrounding villages is a popular choice amongst our Consultants and is only 20 minutes away from the hospital. Stamford is a small Georgian market town, uniquely endowed with spectacular scenery, historic charm and fantastic schools. Rutland is England’s smallest county and is littered with beautiful villages and market towns. The east of the county is easily commutable to the hospital. Oundle and its surrounding villages are also easily commutable to the hospital. It is a Georgian market town, smaller than Stamford and famed for its school.&lt;/p&gt;\n&lt;p&gt;Schools are always an important consideration when looking at an area and there are excellent schools in the area covering both the state (including grammar schools) and private sector (Stamford, Uppingham, Oakham, Oundle).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The Trust&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;North West Anglia NHS Foundation Trust is currently one of the newest acute hospital trusts in England, formed on 1 April 2017. The Trust runs: Peterborough City Hospital, Hinchingbrooke Hospital and Stamford &amp; Rutland Hospital. Together they serve approximately 700,000 residents.&lt;/p&gt;\n&lt;p&gt;Peterborough City Hospital is a purpose-built, state-of-the-art hospital that opened in 2010, offering a bright and spacious working environment with a comprehensive range of clinical services. It has a 16 bedded Critical Care Unit, providing a flexible mix of level 2 and 3 bed capacity and a spacious theatre complex with 18 operating theatres.&lt;/p&gt;\n&lt;p&gt;You would join a team of 11 Critical Care Consultants. The contract is full time (initially 10 PAs per week): the Critical Care commitment is four out of eleven weeks; and the remaining seven weeks are spent between your base specialty and second on cover for ‘Critical Care’. We would also welcome less than full time applicants and can offer flexible working patterns.&lt;/p&gt;\n&lt;p&gt;Applicants must be in possession of their CCTs or within six months of the completion of specialist training and must be fully registered with the General Medical Council. Evidence of higher training in Intensive Care Medicine is essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Informal enquiries are welcomed by&lt;/p&gt;\n&lt;p&gt;Steven Forde, Associate Divisional Director for Theatres, Critical Care and Pain – 01733 677423&lt;/p&gt;\n&lt;p&gt;Dr Emma Chan, Clinical Lead for Anaesthesia – 01733 677423&lt;/p&gt;\n&lt;p&gt;Dr Athar Yasin, Clinical Lead for Emergency Medicine – 01733 673340&lt;/p&gt;\n&lt;p&gt;Dr Jakki Faccenda, Associate Clinical Director for Cardiac and Respiratory Medicine – 01733 673867&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121323.jpg", "name": "North West Anglia NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121323"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough, Peterborough", "postalCode": "PE3 9GZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5848", "longitude": "-.278479"}}, "title": "Consultant in Critical Care Medicine (Joint specialty)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254415", "validThrough": "2020-11-17T23:59:59+0000"}