{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13169", "minValue": "13169", "unitText": "YEAR", "value": "£13,169.10 pa pro rata"}}, "datePosted": "2020-11-03T09:16:43+0000", "description": "&lt;p&gt;This is an 18 month development opportunity for someone looking for a career in IT support. The successful candidate will complete the Level 3 Digital Support Technician Apprenticeship, focussing on the Digital Service Technician option within that standard.&lt;/p&gt;\n&lt;p&gt;The post holder will work alongside our friendly team of support staff at the CITS office in Redruth. An average of 20% of the working week will be spent on training and work based projects, building up assessment evidence for your qualification.&lt;/p&gt;\n&lt;p&gt;The Service Desk team provide first line support to more than 12,000 clinicians and support staff across Cornwall and the Isles of Scilly, managing around 140,000 requests and incidents a year.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a people person, with an engaging telephone manner and a service-orientated attitude. This role will suit someone with a logical approach to problem solving who has the verbal skills to translate technical issues into customer language and vice versa. An interest in IT, ability to multi-task (accurate keyboard skills whilst conversing with customers) and the confidence to recognise when you need to escalate will also be key. If you think you have some or all of these qualities we would love to meet you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Darren Pooley, Service Desk Team Leader, Darren.Pooley@nhs.net, 01209 881717&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redruth", "postalCode": "TR15 1LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.238", "longitude": "-5.22772"}}, "title": "Service Desk Analyst Apprenticeship", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253258", "validThrough": "2020-11-17T23:59:59+0000"}