{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-20T16:45:57+0100", "description": "&lt;p&gt;Are you ready for a new challenge? Do you want to make a difference?&lt;/p&gt;\n&lt;p&gt;A Band 6 Sister/Charge nurse role has become available at Wrightington, Wigan and Leigh Teaching Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We are seeking an exceptional individual who has energy, commitment and enthusiasm to apply for this exciting post within our Intensive Care Unit/ High Dependency Unit (ICU/HDU). The Unit consists of eleven beds which are utilised flexibly to care for both Level 2 HDU and Level 3 ICU patients and currently receive all general critical care admissions from the Trusts wards and the Emergency Care Centre.&lt;/p&gt;\n&lt;p&gt;The role supports the development of both junior and senior nursing staff and strengthens the foundations of the management team. You will need to be a nurse with significant critical care experience and qualifications with developed interpersonal skills and be able to demonstrate a potential for leadership to fulfil this role.&lt;/p&gt;\n&lt;p&gt;The role will require you to work across all areas in the Trust which includes those that are designated as positive, asymptomatic and negative Covid wards.&lt;/p&gt;\n&lt;p&gt;Please note you will be required to produce original certificates at interview for all qualifications.&lt;/p&gt;\n&lt;p&gt;The interview will be held via Microsoft Teams and we would ask for a 10 minute Poster presentation on&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;“What is the biggest challenge as a result of Covid-19 from an ICU team perspective and how will you facilitate a positive approach which is capable of motivating staff?”&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The proposed interview date will be the 3rd of December 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChristine LewisJob titleSisterEmail addresschristine.lewis@wwl.nhs.ukTelephone number01942 822380/2955Additional contact information&lt;/p&gt;\n&lt;p&gt;For any further information please contact Christine Lewis or a Senior Sister on ICU/HDU on 01942 822380/2955&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wrightington, Wigan and Leigh NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RAEI, Wigan", "postalCode": "WN1 2NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5576", "longitude": "-2.62953"}}, "title": "Sister/ Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235314", "validThrough": "2020-11-22T23:59:59+0000"}