{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 p.a. inclusive"}}, "datePosted": "2020-11-06T12:01:25+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking an enthusiastic Family/Systemic Therapist to join our dedicated multi-disciplinary Community Eating Disorder Team. North East London NHS Foundation Trust Community Eating Disorder service offers the latest in evidence based NICE compliant psychological interventions to clients and their families with an Eating Disorder. Unlike many other mental health services we offer specialist assessment and treatment across the life span from age 8yrs with no upper age limit. The team’s multi-disciplinary approach to the assessment and treatment of individuals with an eating disorder is a real strength. The post holder will primarily work with children and young people and their families however opportunities will be available to work across the lifespan. &lt;br /&gt;&lt;br /&gt;We are looking for an accredited Family Therapist to support the team deliver evidenced based Family Based Treatment to children and young people and their families. We are seeking an individual with the knowledge and skills to work as part of a multi-professional team and be innovative in their approach to supporting this client group.&lt;br /&gt;&lt;br /&gt;The applicant will have proven clinical experience in the application of evidence based psychological therapy to children and young people with an eating disorder.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder is expected to work well within a team setting however should be able deliver an autonomous service as part of the role, operating within recognised professional guidelines and the overall framework of North East London NHS Foundation Trust eating disorder service policies and procedures. &lt;br /&gt;&lt;br /&gt;The successful applicant will deliver highly specialised assessments for service users with an eating disorder. The assessments will include: mental health, physical health, social care, quality of life, domains of strengths and weaknesses. A range of self-report questionnaires and interviews will be employed which require specialist training to administer and interpret.&lt;br /&gt;&lt;br /&gt;There will be an opportunity within this role to develop and deliver evidence based group activities and treatment for clients. We actively encourage a team approach and are interested in informing new treatments for eating disorders.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;JOB PURPOSE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To deliver evidence based Family Based Treatments to children, adolescents and their families seen within the Eating Disorder Team using specialist knowledge and breadth of understanding of child and adolescent mental health theories, evidence-based assessments and interventions and to manage complex cases.&lt;/p&gt;\n&lt;p&gt;To take an active role in developing the research activities of the team and audit and interpret complex data to develop own and others understanding of child and adolescent mental disorders.&lt;/p&gt;\n&lt;p&gt;To contribute to the training activities of the team both within the service and externally.&lt;/p&gt;\n&lt;p&gt;To use and maintain skilled standards of personal professional clinical practice in the treatment modalities required by the children and young people treated by the team and be a resource to the whole service in maintaining the skills of others.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Probationary Period&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Assessment/Interview info&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Starting with NELFT&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focusing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;High Cost Area Supplement – London&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Waltham Forest Integrated Care Directorate, Barking", "postalCode": "IG11 7RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5314", "longitude": ".08154"}}, "title": "Family / Systemic Therapist in Eating Disorders", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259569", "validThrough": "2020-11-19T23:59:59+0000"}