{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-28T10:30:32+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Band 6 Occupational Therapist&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is based at Birmingham Heartlands Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for an opportunity to consolidate your clinical skills and knowledge as an Occupational Therapist working in the acute setting?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a motivated, dynamic and enthusiastic OT with a passion for acute medicine and older people. You should have excellent communication and interpersonal skills and a commitment to providing high quality care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can offer you a unique opportunity to develop your skills working across the specialist area of frailty and acute short stay medicine. You will get the opportunity to work for the newly established OPAL team based across acute short stay wards, working towards early therapeutic intervention and timely discharges. The post is rotational across medical assessment units, the emergency department and frailty ambulatory areas.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to be able to demonstrate clinical experience of managing a caseload of patients with complex needs in an acute hospital setting.  This post will offer you an opportunity to further expand your assessment, treatment and discharge planning skills with an acute, complex, multi-pathology patient cohort. Candidates must possess the necessary knowledge and skills to work with acutely unwell patients, frail patients and those with complex needs, providing efficient timely discharge planning and effective early therapeutic contacts.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to be organised, flexible and adaptable, be able to problem solve and apply clinical reasoning effectively. You must be able to manage and prioritise your own clinical and non-clinical case load, and support and supervise the work of other more junior therapists.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an Occupational therapist with excellent influencing skills to work effectively within the MDT.  You will be able to develop your clinical leadership skills within an established friendly and supportive environment where excellence is encouraged and all staff are dedicated to providing the highest standards of patient care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are committed to continued professional development and career development of all staff.  This will be a challenging and exciting Band 6 role that will provide lots of opportunities for development.  A development post will be considered where the candidate has the appropriate skills.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust provides a 7 day therapy service, and an extended hours service.  This role includes participation in a weekend/evening rota with a frequency of approximately 1 in 6 weekends.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information regarding this post please, contact Matthew Craven (Clinical Team Leader OPAL service).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel:       +44 (0) 121 42 40475 Heartlands Site &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;            Email: matthew.craven@heartofengland.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Or&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Lewis Brady (Opal Team Lead)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;0121 424 2000- Bleep 3354&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;lewis.brady@heartofengland.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Closing date: 12/11/2020&lt;br /&gt;Interview date: 25/11/2020&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 6 - Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246051", "validThrough": "2020-11-12T23:59:59+0000"}