{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20404", "minValue": "16778", "unitText": "YEAR", "value": "£16,778 - £20,404"}}, "datePosted": "2020-11-02T09:41:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Support Worker in Worcester- WR3&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt;£16,778 based on 37 hours / £20,404 based on 45 hours / £8.72 per hour/ Sleep-In shifts are required&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; Full-Time / Part-Time / Bank&lt;/p&gt;\n&lt;p&gt;Do you have a caring nature? Are you looking to make a difference to people&#39;s lives? Do you want to work in an environment where no two days are the same? Areyou flexible with your working hours? Can you see yourself providing care to adults who need your support?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you have answered a big YES to these questions we would love to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job description&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At Turning Point, we support people with Learning Disabilities and Acquired Brain Injury across Worcestershire.&lt;/p&gt;\n&lt;p&gt;As a Support Worker, you will make a real difference to people we support and their&#39; lives as you improve their daily living skills. Passionate about people, you will enjoy the scope and support to enhance your own life and career too, as you gain the experience and training you need to progress with us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where will I be working?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be supporting individualsat our supported living services across Worcestershire for adults with Learning Disabilities. Currently seeking a full time vacancy at our service in Worcester and to widen our bank staff across Worcestershire.&lt;/p&gt;\n&lt;p&gt;You will work as part of a large staff team covering various shift patterns.&lt;/p&gt;\n&lt;p&gt;All the people atthis servicehave individual needs and it is the role of the support worker to support the people in all areas of personal, domestic and social needs, both at home and in the community.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will I be doing?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a hands-on job in which no two days are the same. Your duties will include:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Promoting the independence of people we support&lt;/li&gt;\n&lt;li&gt;Supporting a full range of daily activities including cleaning and cooking, days out, events and attractions, or going away on holiday&lt;/li&gt;\n&lt;li&gt;Arranging activities in the home and in the local community&lt;/li&gt;\n&lt;li&gt;Developing residents&#39; life skills and personal interests&lt;/li&gt;\n&lt;li&gt;Helping residents stay safe and healthy&lt;/li&gt;\n&lt;li&gt;Personal care&lt;/li&gt;\n&lt;li&gt;Manual handling &amp; helping with medication&lt;/li&gt;\n&lt;li&gt;Support with finances – daily expenditure&lt;/li&gt;\n&lt;li&gt;Ensuring record keeping is maintained to the required standard at all times and contributing to service monitoring requirements&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What skills and qualities do I need to have?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Whilst knowledge of learning disabilities and complex needs would be beneficial, it isn&#39;t essential. What is essential is that you are:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Passionate, caring and enthusiastic&lt;/li&gt;\n&lt;li&gt;Flexible, patient and non-judgemental&lt;/li&gt;\n&lt;li&gt;A great team player with lots of energy&lt;/li&gt;\n&lt;li&gt;Able to demonstrate good communication skills&lt;/li&gt;\n&lt;li&gt;Able to complete the physical aspects of the role such as manual handling&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shift Patterns&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a 24 hour service, therefore flexibility is essential. You will be working a range of shifts from 7:00am to 2:00/3:00pm and 2:00/3:00 pm to 9:00/10:00pm, sleep ins or waking nights, some weekends.&lt;/p&gt;\n&lt;p&gt;Please note that the shifts may vary.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive Learning and Development opportunities - we are Investors in People Silver accredited&lt;/li&gt;\n&lt;li&gt;28 days holiday, increasing with each year of service until 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including, bike to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive Pension and Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme and access to online Health and Wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work/life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts including Cinema, Groceries and Gym.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Turning Point?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We take pride in the services that we provide. There is one vision that everyone at Turning Point shares, which is held together by our values. These include believing in potential, communicating in a confident way, embracing change and treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;Running services on a not-for-profit basis, we invest every penny back into our services - and, our people. So, if you are enthusiastic, motivated and committed to support people with Learning Disabilities to live fulfilling lives - here at Turning Point, we don&#39;t just offer you a job: we offer you a career.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcester", "postalCode": "WR9 8DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2664", "longitude": "-2.14897"}}, "title": "Support Worker at Worcester, Learning Disabilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251443", "validThrough": "2020-12-01T23:59:59+0000"}