{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa (pro rata)"}}, "datePosted": "2020-10-28T11:30:26+0000", "description": "&lt;p&gt;Are you interested in developing your skills?&lt;/p&gt;\n&lt;p&gt;The Neighbourhood Night Service is a forward thinking, dynamic team that is continuously looking to improve the service we deliver.&lt;/p&gt;\n&lt;p&gt;The Neighbourhood Night Service operates overnight across the whole of Leeds providing care for patients requiring nursing intervention in their own home. The service is co-located with other community services and operates centrally from Killingbeck Court, Leeds LS14 6FD. Key aims of the service are to prevent unnecessary hospital admissions and ensure that palliative patients can remain in their own homes, where this is their preference. The Neighbourhood Night Service is part of a wider multi-disciplinary team and ensures that there is 24/7 nursing care for patients in the community.&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint Administration Assistants (band 3) to work as part of our award winning team to support us in delivering outstanding patient care.&lt;/p&gt;\n&lt;p&gt;This is an exciting and varied role that is vital in helping us to coordinate our resources to ensure that patients receive the best and most appropriate care from our Nurses, Nursing Assistants and agency providers. &lt;/p&gt;\n&lt;p&gt;The role covers Monday to Sunday 09:00-17:00pm (with half an hour lunch break).&lt;/p&gt;\n&lt;p&gt;The majority of the role will involve excel spreadsheets and communicating with our Senior Nurse, Senior Administrator and Management Support Officer, as well as key external care providers. You will have experience within an office environment and will have excellent written and verbal communication. You will be competent in all Microsoft packages. You will have the ability to work under pressure, solve problems and be able to manage your workload to meet deadlines. &lt;br /&gt; &lt;br /&gt; A full tailored induction programme will be supported and ongoing development encouraged. The contract is for up to 30 hours and will cover 7 days per week.&lt;/p&gt;\n&lt;p&gt;If you&#39;re convinced you&#39;re the best person for this job, let us know more about you! Click apply to submit your application.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123892.jpg", "name": "(AS) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123892"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS14 6FD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.806", "longitude": "-1.48042"}}, "title": "Administrative Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246329", "validThrough": "2020-11-15T23:59:59+0000"}