{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 to £51,069 per annum +LW"}}, "datePosted": "2020-11-04T14:46:15+0000", "description": "&lt;p&gt;We are looking for an enthusiastic capable doctor to join our fantastic respiratory team at St Mary’s Hospital, Imperial College Healthcare NHS Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post has become available as a result of a temporary vacancy in the North West Thames SpR rotation. It is a short-term replacement for one of the respiratory SpR posts. It will suit a doctor trained to ST level with an interest in respiratory medicine, someone enthusiastic, flexible and willing to learn. Respiratory experience is not essential but will be gained during the post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post-holder will join the current team of junior doctors in Respiratory Medicine (3 SpRs, 2 CMT doctors and 2 FY2, and 4 FY1 doctor) involved in the in-patient and out-patient care of respiratory and general medical patients. The department has 12 Respiratory Consultants: who rotate through periods of 10 day ward cover.&lt;/p&gt;\n&lt;p&gt;The Department also has Specialist Respiratory Nurses, physiotherapists, pharmacists, Lung Function Technicians and Senior Research Technicians.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The duties of the post-holder will include weekly outpatient clinics, ward rounds on respiratory ward, including acute respiratory unit and covid support unit, day to day supervision of the CMT and F2 doctors, and respiratory in-reach rounds in Acute Medicine, and attendance at regular Unit x-ray, educational and business meetings. The post holder will contribute to the out of hours on call rota- providing ward cover evenings and weekends.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There is an opportunity to upskill in most aspects of respiratory medicine including NIV, Lung cancer, bronchoscopy, Tuberculosis, COPD, Asthma and Covid pneumonitis. The applicant will be well supported by our knowledgeable and approachable consultant team at all times. This is a great training opportunity and a chance to be part of a fantastic team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;georgina.russell1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St. Mary&#39;s Hospital, London", "postalCode": "W12 0HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5165", "longitude": "-.236635"}}, "title": "Trust Doctor ST3+ (LAS)  in Respiratory and General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256275", "validThrough": "2020-11-18T23:59:59+0000"}