{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T12:16:18+0000", "description": "&lt;p&gt;We are looking to employ X1 WTE Band 6 highly motivated Diabetes Specialist Nurse (DSN), in delivering an exciting integrated diabetes service across Aneurin Bevan University Health Board (ABUHB). You will be providing annual reviews of patients who are injecting Insulin and GLP1 agents along with optimising diabetes therapies. You will be a registered nurse with at least 1 year’s experience of working within the specialist field of diabetes. This role is key to developing an enabling environment to enhance primary care practitioners in the management of patients with diabetes in order to optimise medicine therapies in line with NICE Guidelines and support primary care in the initiation and management of injectable therapies.&lt;/p&gt;\n&lt;p&gt;Reporting to the DSN Team Leader, the post holder will be required to establish relationships and specialist clinical leadership across Neighbourhood Care Networks (NCN) within Primary Care and Secondary Care Specialist services to support the delivery of an Integrated Diabetes Specialist Care Team. There is an expectation that the DSN will work closely with both primary care and secondary care colleagues, across all care interfaces and there is an expectation for post holders to travel daily across the geographical area of ABUHB.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 18th November 2020&lt;/p&gt;\n&lt;p&gt;Please contact Frances Rees on 01495 768676 or frances.rees@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Janice Moses on janice.moses@wales.nhs.uk 01443 802231&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "County Hospital, Coed y Gric Road, Griffithstown, Pontypool", "postalCode": "NP4 5YA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6917", "longitude": "-3.02628"}}, "title": "Diabetes Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255787", "validThrough": "2020-11-18T23:59:59+0000"}