{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888- £36,738 per annum inclusive of HCAS"}}, "datePosted": "2020-10-28T10:16:29+0000", "description": "&lt;p&gt;Take a closer look into Ophthalmic Nursing! Moorfields Eye Hospital NHSFT has expanded their Private Patient Division with the addition of 2 brand-new theatres at Moorfields Eye Hospital, City Road site. We are looking for highly experienced, motivated, forward thinking, Registered Nurses to work in these purpose-built, dedicated Private Patient Operating Theatre.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For this Band 5 Scrub nurse post, successful candidates will be employed on AFC national terms and conditions, encompassing all of the standard NHS Benefits.&lt;br /&gt;We are committed to ongoing professional development and opportunities exist to undertake a wide range of in-house and external courses. Rotational opportunities throughout the other ophthalmic departments that make up Moorfields Private Theatres can be accommodated upon request.&lt;/p&gt;\n&lt;p&gt;The successful candidates will need to have excellent communications skills, be highly motivated, demonstrates good leadership and committed to the delivery of high quality care within all areas of the ophthalmic theatre.&lt;/p&gt;\n&lt;p&gt;The successful candidates will hold the appropriate qualifications to be a current registered practitioner (RGN) and demonstrate evidence of continuing professional development and mentoring qualification.&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period of 6 months.&lt;/p&gt;\n&lt;p&gt;During the probationary period, your suitability for continued employment will be assessed and provided a satisfactory standard is achieved and maintained, your employment will be confirmed. The probationary period may be extended&lt;/p&gt;\n&lt;p&gt;Or your employment terminated either during or at the end of probation, in line with the trust Probationary Policy. For the duration of the probation period, the notice period will be in line with contractual obligations on either side.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMay MallariAdditional contact information&lt;/p&gt;\n&lt;p&gt;May Mallari-Theatre Manager for Moorfields Private on 07711 765374 or email: may.mallari1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Moorfields Eye Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121181"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moorfields Private City Road, London", "postalCode": "EC1V 2PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5272", "longitude": "-.089862"}}, "title": "Band 5 Theatre Practitioner Scrub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246013", "validThrough": "2020-11-11T23:59:59+0000"}