{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T09:30:52+0000", "description": "&lt;p&gt;The Lookout, Hopewood Hospital&lt;/p&gt;\n&lt;p&gt;Staff Nurse, Band 5&lt;/p&gt;\n&lt;p&gt;Hours – Full and Part time posts available&lt;/p&gt;\n&lt;p&gt;Hopewood Hospital in Sherwood, Nottingham is a new building that opened in June 2018. This new build created a large expansion of our CAMHS service that was previously based at Thorneywood.&lt;/p&gt;\n&lt;p&gt;The expansion has created 2 further CAMHS wards and an increase in beds from 13 to 32 and is based on site with an education facility for our inpatients, a CAMHS community base with specialist teams and both inpatient and community perinatal teams.&lt;/p&gt;\n&lt;p&gt;Currently Phoenix Ward and Pegasus Ward have exciting opportunities for an experienced RMN or RNLD to join our teams.&lt;/p&gt;\n&lt;p&gt;Phoenix Ward is an 8 bedded psychiatric intensive care unit that works with young people experience severe and enduring mental health problems. We work closely with families and a full MDT to ensure positive outcomes for young people and we encourage staff to be fully involved in patients care and participate in both group and 1:1 work.&lt;/p&gt;\n&lt;p&gt;Pegasus Ward is a specialist eating disorder ward. Family based treatment is integral to the treatment and recovery of young people with eating disorders and families and carers are encouraged to be fully involved in their care; there are therefore opportunities for staff to be involved in family work as well as individual &amp; group work with the young people.&lt;/p&gt;\n&lt;p&gt;Our nurses have a key clinical role within a well established multidisciplinary team. You will need to demonstrate that you have experience of working with people with mental health problems and supporting carers /families in an acute environment. You should have a working knowledge of the management of safeguarding processes, have excellent communication and leadership skills &amp; be willing to work across a 24 hour/7 day rota.&lt;/p&gt;\n&lt;p&gt;In addition the hospital is supported by a senior nurse who remains on site 24 hours a day.&lt;/p&gt;\n&lt;p&gt;Further details regarding the essential criteria can be found in the person specification.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Corkill and Jessica Horsnell - Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address: emma.corkill@nottshc.nhs.uk / Telephone number: 0115 9691300 ext: 16673 or ext: 15889&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG5 3FL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9905", "longitude": "-1.14201"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241854", "validThrough": "2020-11-15T23:59:59+0000"}