{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50000", "minValue": "35000", "unitText": "YEAR", "value": "£35,000-£50,000 depending on experience"}}, "datePosted": "2020-10-19T11:50:07+0100", "description": "&lt;p&gt;There has never been a more exciting time to join us at gtd healthcare, winner of the 2019 Pride of Tameside Social Enterprise Business of the Year award.&lt;/p&gt;\n&lt;p&gt;gtd healthcare is one of the largest primary and urgent care providers in North West England and has a long and strong track record of more than 20 years in providing innovative healthcare services to meet demand and in line with contemporary healthcare practice. gtd healthcare is a values driven, not-for-profit provider of care to a patient population of approximately 2.7 million.&lt;/p&gt;\n&lt;p&gt;Following a vacancy, we are recruiting senior clinical practitioners to work across our services including Out of Hours, focusing on staff that are experienced in paediatrics, frailty and mental health To work in the Clinical HUB Denton:&lt;/p&gt;\n&lt;p&gt;Predominantly virtual triage however can incorporate face to face assessment in a portfolio role (for those with appropriate skills-clinical examination qualification/ and relevant experience) including home visits, palliative care assessment and management (for appropriately trained specialists).&lt;/p&gt;\n&lt;p&gt;We would welcome applications from specialists e.g. paediatric, frailty and palliative care specialists along with generalists.&lt;/p&gt;\n&lt;p&gt;Full time, part time or bank hours&lt;/p&gt;\n&lt;p&gt;Within the role it is required that you are a competent practitioner who can apply clinical reasoning to assess, diagnose, and prescribe where appropriate. You will support and contribute to the delivery of policy and procedures, provide leadership as required will act as a mentor and positive role model to other staff and will facilitate training and education as required.We are proud that our people say that gtd healthcare is a great organisation to work for with the team being made up of committed, driven individuals who are passionate about ensuring that outstanding patient care is delivered.&lt;/p&gt;\n&lt;p&gt;Staff benefits include;&lt;/p&gt;\n&lt;p&gt;· a highly competitive salary,&lt;/p&gt;\n&lt;p&gt;· 30 days annual leave, rising to 32 days after 5 years continuous service,&lt;/p&gt;\n&lt;p&gt;· continuity of access to the NHS Pension Scheme,&lt;/p&gt;\n&lt;p&gt;· Access to gtd healthcare Wellbeing, which offers a wide range of staff benefits in response to staff suggestions and as a means of improving staff satisfaction.&lt;/p&gt;\n&lt;p&gt;gtd healthcare is an equal opportunities employer and welcomes applications from all. If you think this is the role for you, we look forward to hearing from you!&lt;/p&gt;\n&lt;p&gt;For further information, please contact audrey.leech@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130019.png", "name": "gtd healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130019"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M34 2GP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4503", "longitude": "-2.13308"}}, "title": "Senior Clinical Practitioner - Clinical Hub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232130", "validThrough": "2020-11-06T23:59:59+0000"}