{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "65256", "minValue": "65256", "unitText": "YEAR", "value": "£38.82 an hour an hour plus holiday pay &amp; pension"}}, "datePosted": "2020-11-04T08:32:46+0000", "description": "&lt;h1&gt;&lt;strong&gt;Would you be able to lead and develop the Management Accounts function?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for someone to join the Trust as an Assistant Director of Finance.&lt;/strong&gt;&lt;strong&gt; &lt;/strong&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The University Hospital Southampton NHS Foundation Trust provides services to 1.9 million people living in Southampton and south Hampshire, while also providing specialist services such as neurosciences, cardiac services, and children&#39;s intensive care to the wider area. &lt;/p&gt;\n&lt;p&gt;The Trust is made up of 6 locations with Southampton General Hospital being the largest, running specialist services, emergency, and critical care along with outpatient clinics, diagnostic and treatment work, surgery, research, education and training. This is a large and busy site. &lt;/p&gt;\n&lt;p&gt;The Trust is driven to provide world-class care for all and have a mission that “together we care, innovate and inspire”, does this sound like the place for you? &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have an ongoing placement available for an &lt;strong&gt;Assistant Director of Finance&lt;/strong&gt; (&lt;strong&gt;Management Accounts)&lt;/strong&gt; at Southampton General Hospital (Tremona Road, Southampton, SO16 6YD) &lt;/p&gt;\n&lt;p&gt;The role starts as soon as possible.&lt;strong&gt;&lt;em&gt; &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;To start you will need to be able to provide a reference covering a 6-month period of employment in the last 3 years&lt;/em&gt;&lt;/strong&gt;. &lt;/p&gt;\n&lt;p&gt;The working hours are Monday to Friday 37.5 hours a week. &lt;/p&gt;\n&lt;p&gt;This is a band 8D post and paying £38.82 an hour. &lt;/p&gt;\n&lt;p&gt;This roles main purpose is&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To lead on the development of the Management Accounts function of the Trust including R&amp;D Finance Team, ensuring delivery of a professional, dynamic and proactive service. Direct management responsibility for the Management Accounts function (6+ members of staff).&lt;/li&gt;\n&lt;li&gt;To lead on development of financial reporting for the Trust ensuring that it is comprehensive and meets business needs, driving effective change.&lt;/li&gt;\n&lt;li&gt;To coordinate the Trust’s budget setting process, including review of business developments across the Trust ensuring they fit with the Trust’s strategic plans.&lt;/li&gt;\n&lt;li&gt;Support the delivery of the Trust’s financial targets, including holding budget-holders to account for non-delivery.&lt;/li&gt;\n&lt;li&gt;Provide financial scrutiny to the Trust’s CIP programme, holding to account whilst supporting delivery and setting financial targets.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;They are looking for someone who is a &lt;strong&gt;&lt;em&gt;CCAB qualified accountant&lt;/em&gt; &lt;/strong&gt;with considerable post qualification experience at a senior level or equivalent knowledge and ideally has worked within the NHS. &lt;/p&gt;\n&lt;p&gt;They are also looking for the following: &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;In depth experience at a senior level of finance&lt;/li&gt;\n&lt;li&gt;Proven track record of successful and sustained financial management&lt;/li&gt;\n&lt;li&gt;Record of significant financial and non financial achievements at a senior level&lt;/li&gt;\n&lt;li&gt;Successful delivery of significant organisational and financial change&lt;/li&gt;\n&lt;li&gt;Significant Leadership and management experience in previous roles.&lt;/li&gt;\n&lt;li&gt;Is clearly focused on the goal of service improvement and resists being side tracked&lt;/li&gt;\n&lt;li&gt;Invests sustained effort in making a significant impact on improvement within the organisation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; Do you have these skills and attributes? &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;IF YES … We look forward to hearing from you soon!&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: – &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.  &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 6YD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.933", "longitude": "-1.4351"}}, "title": "Assistant Director of Finance (Management Accounts)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255097", "validThrough": "2020-11-18T23:59:59+0000"}