{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pro rata"}}, "datePosted": "2020-11-04T16:16:34+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for somebody with specialist paediatric knowledge and experience in supporting children with learning difficulties to join the paediatric neurobehavioral sleep clinic working as a sleep practitioner at University Hospital Southampton NHS Foundation Trust (UHS). You will be joining an enthusiastic multidisciplinary team in the assessment, diagnosis and management of sleep disorders in both typically developing children and those with neurodevelopment difficulties.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;We&#39;re a specialist centre for children&#39;s sleep medicine, one of only a few in the UK. We work with children aged between one and 18 with chronic sleep disorders. We have a skill mix of professionals in our service including, a respiratory, neurology and a sleep medicine consultant, one sleep fellow, two clinical nurse specialists, sleep physiologists, sleep technicians, two clinical psychologists and three existing sleep practitioners that you will be working alongside. We are a friendly, cohesive team who thoroughly enjoy working together to diagnose and treat a wide range of childhood sleep disorders including: chronic childhood insomnia parasomnias, including sleep walking and night terrors, movement disorders in sleep, circadian rhythm disorders, sleep disordered breathing, narcolepsy, Kleine-Levin syndrome and idiopathic and secondary hypersomnia. You will be joining the Sleep Practitioner team whom operate their working hours across Monday to Friday. Typically patients are seen face to face in Children Outpatients clinics. At present the Children’s Sleep Disorder Service are using a secure online platform to see families via video consultation. We treat families from all over the UK and we have found that this style of clinic appointment as been most welcomed by all our service users.&lt;/p&gt;\n&lt;p&gt;Our service lead actively leads and participate in clinical sleep medicine research and we speak at and/or attend national and international sleep medicine conferences. Our sleep practitioner team have presented research posters at these events. Our service also provides sleep medicine training for professional’s both nationally and internationally which you will have the opportunity to contribute too and participate in alongside the rest of the team.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;Your main role in the service;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Support lead clinicians in sleep assessment clinics in either the online video consultation format or face to face children’s outpatient settings (when deemed appropriate).&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Hold a caseload of thirty patients with a behavioural insomnia which has resulted in significant sleep problems impacting on daily functioning.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Create individualised sleep intervention programmes and work closely with your caseload of families using telephone and video consultation follow up appointments.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Attend monthly caseload supervision with the senior Band 5 sleep practitioner.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Attend the MDT weekly clinical supervision to discuss and advice on complex families&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Attend the monthly service team meeting to discuss service development and learning from journal club&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;You will need to have a good understanding of child development and child behaviour with relevant experience of working with children with additional needs and their families in a variety of settings.&lt;/p&gt;\n&lt;p&gt;Previous experience of working with children with autism and /or whom have sensory integration needs would be advantageous.&lt;/p&gt;\n&lt;p&gt;Previous community experience will put you in good stead for this post. Knowledge of sleep is preferred but is not a requirement as training will be provided.&lt;/p&gt;\n&lt;p&gt;You will need to be self motivated, flexible, hard working and a quick learner, as well as enjoying being part of an expanding and developing team.&lt;/p&gt;\n&lt;p&gt;Good written and verbal communication skills are required.&lt;/p&gt;\n&lt;p&gt;NNEB, CACHE or equivalent qualification and post registration experience in a relative specialty.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on 25th November 2020&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n\n\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n\n\nFor further details / informal visits contact:\nRomana Henry\nSleep Secretary\nRomana.henry@uhs.nhs.uk\n02381 205922", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Paediatric Specialist Sleep Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256604", "validThrough": "2020-11-18T23:59:59+0000"}