{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-10-29T16:01:02+0000", "description": "&lt;p&gt;The Horton General Hospital, Banbury is seeking a highly motivated individual to join the Portering team as a Flexible Hours Porter.&lt;/p&gt;\n&lt;p&gt;Whilst the position offers 52 annualised hours, this is for training and more shifts will be offered to support the service.&lt;/p&gt;\n&lt;p&gt;The position will require the post holder to work various hours across a 24hr rota which could include nights, weekends and bank holidays,&lt;/p&gt;\n&lt;p&gt;The ideal candidate must be able to use their own initiative when working alone or as part of a team and must also be able to demonstrate excellent customer service skills, show a flexible approach to work and be willing to work when required – this can be at short notice.&lt;/p&gt;\n&lt;p&gt;You will be supporting the shift based Portering Team, providing 24hr Portering support to all wards and departments across the site.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will live within 30 minutes travelling time to the hospital site.&lt;/p&gt;\n&lt;p&gt;Please ensure you read the Job Description and Personal Specification, as all applications will be scored against the required criteria.&lt;/p&gt;\n&lt;p&gt;Training will be provided for successful candidates.&lt;/p&gt;\n&lt;p&gt;Please note that this post is subject to a 6 month probationary period. If you currently hold a contract of employment with the Oxford University Hospitals, this will not apply. This statement does not apply to Medical staff or Executive Appointments.&lt;/p&gt;\n&lt;p&gt;All candidates will be contacted with an update on the application. The majority of correspondence will be via the e-recruitment system; therefore you should check your emails regularly including junk mail folders in web-based email products.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicant requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date: 12th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Denise.Pawley@ouh.nhs.uk Facilities Manager, Horton Hospital&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Horton General Hospital, Banbury", "postalCode": "OX16 9AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0535", "longitude": "-1.33665"}}, "title": "Flexible Hours Shift Porter (52 Annualised Hours)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248991", "validThrough": "2020-11-12T23:59:59+0000"}