{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37740", "minValue": "33600", "unitText": "YEAR", "value": "£33,600.00-£37,740.00"}}, "datePosted": "2020-11-03T16:21:37+0000", "description": "&lt;p&gt;SpaMedica is one of the UK’s leading independent providers of ophthalmic services and largest provider of NHS cataract surgery.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced RGN to be based in Bristol (BS30)to support the design and delivery of training programmes across all SpaMedica sites ensuring competency, regulation obligations and return on investment. Whilst this is a mobile role we aim to keep you within your region 80% of your time. You will be required to support new site set up and training across the country on a fair scheduled basis with the training team.&lt;/p&gt;\n&lt;p&gt;We offer friendly teams, first-class hospitals and time for you to give all your focus and attention to your role.&lt;/p&gt;\n&lt;p&gt;SpaMedica knows work/life balance is vital for our nurses and so we work 4-day shifts and only ‘1 in 4’ weekends. And, you’ll get a great salary plus two bonuses per year, for, hopefully, doing a job you love.&lt;/p&gt;\n&lt;p&gt;You may not have heard of SpaMedica, so it’s important to understand who we are. Please visit our website and/or read some of our fantastic reviews on NHS UK – where we now have over 900 5-star ratings.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;So what can we offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;· Up to 5% annual personal performance related bonus&lt;/p&gt;\n&lt;p&gt;· Annual company performance related bonus&lt;/p&gt;\n&lt;p&gt;· Annual pay reviews and increases&lt;/p&gt;\n&lt;p&gt;· 25 days holiday (33 days including bank holidays)&lt;/p&gt;\n&lt;p&gt;· Company pension scheme&lt;/p&gt;\n&lt;p&gt;· Continuous training and development&lt;/p&gt;\n&lt;p&gt;· Hours worked over 4 days Monday – Friday&lt;/p&gt;\n&lt;p&gt;· Part of a 20 + strong training team delivering excellence across all sites.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why join SpaMedica?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;· We are privileged to be able to support the tens of thousands of NHS patients that come to SpaMedica each year.&lt;/p&gt;\n&lt;p&gt;· We are proud to deliver excellent care and support thousands of patients to achieve better vision – our outcomes are some of the best in the UK&lt;/p&gt;\n&lt;p&gt;· In 2018 we became the largest provider of NHS cataract surgery – 24.000+ surgeries per annum.&lt;/p&gt;\n&lt;p&gt;· We want our staff to enjoy coming to work and provide a friendly and supportive environment for you to work in.&lt;/p&gt;\n&lt;p&gt;· We’re proud to have been awarded gold status from Investors in People (IIP), putting SpaMedica in the top 3% for world-class performance achieved through its staff focus.&lt;/p&gt;\n&lt;p&gt;· We have 17 hospitals and will be opening several new hospitals over the next 12 months.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;· We need someone to act as a mentor to new and existing members of the clinical team overseeing induction, training programmes and competency sign off.&lt;/p&gt;\n&lt;p&gt;· Identifying and assessing future and current training needs for teams.&lt;/p&gt;\n&lt;p&gt;· Be a SpaMedica brand ambassador for best practice and sharing of information in the most appropriate vehicle for delivering the respective training.&lt;/p&gt;\n&lt;p&gt;· Design and deliver training competencies.&lt;/p&gt;\n&lt;p&gt;· Promote training and the training facilities to managers and encourage professional development.&lt;/p&gt;\n&lt;p&gt;· Complete site audits to identify training requirements across all sites.&lt;/p&gt;\n&lt;p&gt;· Embrace quality training and maintain training records to the highest standard and update training matrices.&lt;/p&gt;\n&lt;p&gt;· Deliver high quality learning programme in terms of content, structure and assessment support.&lt;/p&gt;\n&lt;p&gt;· Develop and agree learning objectives with employees.&lt;/p&gt;\n&lt;p&gt;· Monitor, measure and adapt teaching / training programmes for maximum effectiveness to ensure learning objectives are achieved.&lt;/p&gt;\n&lt;p&gt;· Deliver our induction process, ensuring quality on-boarding for all new starters.&lt;/p&gt;\n&lt;p&gt;· Support new site opening and settling of new staff and their training requirements within new hospitals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are we looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully qualified RGN with a minimum 12 months experience in an acute setting&lt;/li&gt;\n&lt;li&gt;Flexibility with the ability to travel on a regular basis&lt;/li&gt;\n&lt;li&gt;Training experience in a busy multi-site business.&lt;/li&gt;\n&lt;li&gt;Proven work experience as a trainer.&lt;/li&gt;\n&lt;li&gt;Scrub experience for cataract surgery (RGN / ODP) or a willingness to undertake training.&lt;/li&gt;\n&lt;li&gt;Familiarity with traditional and modern training methods (mentoring, coaching, on-the-job or in classroom training, e-learning, workshops, simulations etc.)&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spa Medica", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134317"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS30 8FJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4577", "longitude": "-2.47598"}}, "title": "RGN Trainer - Bristol", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254777", "validThrough": "2020-11-16T23:59:59+0000"}