{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Not defined"}}, "datePosted": "2020-10-30T13:30:15+0000", "description": "&lt;p&gt;Leeds is a vibrant, dynamic and multi-cultural city. Our ambition is to be the best city in the UK - compassionate and caring with a strong economy. NHS Leeds CCG, one of the largest in the UK, has a clear focus on tackling health inequalities and driving up the quality of care. We work with a wide range of partners from across the health and care sector, and beyond, to achieve our ambition of establishing Leeds as a healthy and caring city for people of all ages, where people who are the poorest, improve their health the fastest.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We’ve made great strides in city-wide working and those links have been well tested during the pandemic. We have learned new skills and formed new alliances, and we are determined to build on them in the future. We have launched an ambitious programme to develop and embed a new operating model for the CCG. ‘Shaping our Future’ will transform the health and care landscape in Leeds and there is a clear appetite for innovation and change across the city.  Population Healthcare Management (PHM) is integral to that approach.  And that’s where you come in.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking to add a highly skilled and credible leader to our top team who will drive forward our critical plans for Population Health Planning. Your key role will be to lead the development of a city-wide approach towards outcomes for the city and at population cohort level across adult and childrens services. You will define and agree a set of ambitious but attainable improvements that will address health inequalities and drive up the level of health for citizens of Leeds. To do this you will need to be able to influence the adoption of PHM across a wide range of NHS partners and wider stakeholders within the city and in the wider ICS. You will need to show a comprehensive understanding of PHM.  But equally important will be a demonstrable track record of delivering great public health and care programmes and delivering change through collaborative and compassionate leadership and influencing.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will provide leadership across the system so that we can create integrated models of care that deliver improved population outcomes. As importantly, you will need to maintain the vision that supports the technical and cultural change in Leeds which will involve significant transformational work across the  system. You will also be involved in prioritising the investment intentions across the city whilst managing efficiency, clinical risk and developing a diverse workforce that unlocks potential to achieve great results.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be a strategic leader, driving improved health and wellbeing with Leeds communities, with a relentless focus on reducing health inequalities. In addition to working across the city partnership, you will also need excellent relationships and joint working with the ICS, NHS England/Improvement and a range of community, third-sector and private organisations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will also get to the heart of the city’s needs by talking with members of the public and their representatives – hearing their concerns and making the case for change. And that will, on occasions, be significant and contentious.&lt;/p&gt;\n&lt;p&gt;This is a demanding, diverse and challenging role at the heart of health and care innovation. If this sounds like the next role for you, then we would like to hear from you. It is essential that you have a strong background in delivering health and care solutions at both strategic and operational level and can demonstrate an appetite and commitment to continuous improvement.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is one of a number of key senior roles we need to fill as the CCG adopts its new operating model. So we may want to talk to applicants about other opportunities at the CCG.&lt;/p&gt;\n&lt;p&gt;Please note that if you are shortlisted an assessment activity is planned for week commencing 22 November with final interviews on 27 November..&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Depending on circumstances, we may choose to run assessments and interviews via MS Teams or face-to-face.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Further information about working at the CCG is available on the website.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128136.jpg", "name": "NHS Leeds Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS16 6EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8389", "longitude": "-1.61065"}}, "title": "Director of Population Healthcare Planning", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250351", "validThrough": "2020-11-16T23:59:59+0000"}