{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-22T17:39:35+0100", "description": "&lt;p&gt;Do you have strong belief in family centred care and enjoy working in partnership with parents?&lt;/p&gt;\n&lt;p&gt;Would you value the opportunity to create the perfect work/life balance, by joining a progressive neonatal unit situated in the beautiful Cathedral city of Exeter, with easy access to Dartmoor national park and stunning beaches of the South Devon coast?&lt;/p&gt;\n&lt;p&gt;We are looking for Band 5 nurses who will help to develop our neonatal service. This is an exciting time to join our Trust and make a difference to the families in our care.&lt;/p&gt;\n&lt;p&gt;We have a very spacious, purpose built unit with 26 cots. You will join a highly skilled, motivated and supportive neonatal team. We are the only Neonatal Unit in the United Kingdom accredited with the UNICEF GOLD Baby Friendly neonatal standards and the BLISS Baby Charter accreditation. There are many training and development opportunities available to support the personal and professional development of all staff.&lt;/p&gt;\n&lt;p&gt;If you are a newly qualified or experienced band 5 and looking to work with families in a neonatal setting, this is the opportunity for you………&lt;/p&gt;\n&lt;p&gt;For more information please contact: - Clinical Nurse manager Louise Rattenbury (ann.rattenbury@nhs.net) or Sister Ruth Atkinson (ruth.atkinson3@nhs.net ) 01392406623.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more information please contact: - Louise Rattenbury 01392406623&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239539", "validThrough": "2020-11-08T23:59:59+0000"}