{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 Per annum"}}, "datePosted": "2020-09-30T13:16:32+0100", "description": "&lt;p&gt;RMCH is looking to recruit 2 full-time NHS consultants to its busy Blood and Marrow Transplant and Leukaemia services. One of the posts is a replacement post, and one is a new post because of service expansion. The successful candidates will be expected to contribute to both service areas, and the post might suit candidates on the specialist register for haematology or qualified paediatric oncologists with interest and expertise in leukaemia or transplant.&lt;/p&gt;\n&lt;p&gt;RMCH is one of the largest paediatric BMT centres in the UK, and performs about 50 allogeneic grafts per year. As well as a regional transplant service for the children of the North West of England, it is also a specialist referral centre for children with inherited metabolic diseases, and a commissioned CAR-T centre. It recently performed its first stem cell gene therapy transplant in metabolic disease, and this is expected to be an increased activity area in the next years.&lt;/p&gt;\n&lt;p&gt;There are currently 4 consultants in the leukaemia and BMT service, and this will increase to 5. There is transplant and leukaemia junior staff. The team is research active with many active areas of clinical research interest including cell and gene therapy in metabolic diseases, and cord blood transplant in haematological malignancy. It is co-located with the University of Manchester, and there are many opportunities for translational research and laboratory collaborations.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJohn-Paul KildayJob titleClinical Director of Paediatric Haematology and OncologyEmail addressJohn-Paul.Kilday@mft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Professor Rob Wynn, BMT Programme Director&lt;/p&gt;\n&lt;p&gt;Dr Denise Bonney, Leukaemia and CAR-T service lead&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Manchester Children&#39;s Hospital, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Consultant Paediatric Haematologist ((Malignant)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916206583", "validThrough": "2020-11-08T23:59:59+0000"}