{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-10-30T09:43:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking to join a team who are passionate about creating an exceptional experience for patients in modern, clean and comfortable surroundings? Then we would like to hear from you. We are looking for a Scrub Practitioner or Surgical First Assistant to join our team. This is a part time position working 28.5 hours per week on a 18 month fixed term contract.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group Hospital, Shepton Mallet has been rated as Outstanding by the CQC which means that you can be sure you are part of a team providing safe, reliable and patient-focused care.&lt;/p&gt;\n&lt;p&gt;If you are a practitioner outside of the local area we would welcome your application and there is a very generous relocation package available to support you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be a valued member of our multidisciplinary team led by our experienced Theatre Manager, Heidi. As a Scrub Practitioner you will actively participate and maintain the highest standard of care and safety for patients in the operating theatre. As a Surgical First Assistant you will provide skilled assistance under the supervision of a consultant surgeon.&lt;/p&gt;\n&lt;p&gt;You will be a part 1 registered NMC Nurse or an HCPC registered Operating Department Practitioner with recent and relevant scrub experience in orthopaedics, general surgery, ophthalmology, ENT or gynaecology. As well as being up to date with current research and developments in theatre practise you will have a sound knowledge of Health and Safety/Risk management within the operating department. You will be responsible for ensuring the continual cleanliness of the theatre and equipment.&lt;/p&gt;\n&lt;p&gt;It goes without saying privacy and confidentiality are key throughout the team and you will act as an advocate for the patient in the intra-operative phase and be responsible for “total patient” care in the perioperative phase.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. If you want to move up the ladder, we’ll support you. If you just want to stay in your role, that’s fine too.We’ll help you be the best you can be.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contact Sonia Sanghvi in our friendly resourcing team.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidates but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shepton Mallet", "postalCode": "BA4 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1897", "longitude": "-2.56288"}}, "title": "Scrub Practitioner/Surgical First Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249518", "validThrough": "2020-11-27T23:59:59+0000"}