{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 gross per annum"}}, "datePosted": "2020-11-03T14:30:41+0000", "description": "&lt;p&gt;We are delighted to offer an exciting opportunity to join the team at the Dragonfly CAMHS Inpatient Unit. We are looking for an enthusiastic and committed Systemic Family Therapist to join our multidisciplinary team. We are a 12-bed general adolescent psychiatric unit, who support young people between the ages of 12 and 17 who are experiencing a variety of mental health difficulties, including depression, anxiety, psychosis and eating disorders. The Dragonfly Unit opened in September 2016 and has been rated as ‘Outstanding’ by the Care Quality Commission for the last 3 years, and recently received full accreditation by QNIC.&lt;/p&gt;\n&lt;p&gt;As a Family Therapist in the team, you will be joining a therapies team comprising psychology, art psychotherapy and occupational therapy. You will be involved in providing formulation and systemic intervention to young people and their families. There will be opportunities to develop reflecting teams alongside systemic practitioners and other staff members. We have a strong therapeutic group programme, and there is the opportunity to offer group-based interventions to young people and their families, alongside other therapeutic professionals. We value the opportunity to think psychologically as a team, therefore it would be expected that you will also provide support to colleagues via individual and group supervision and consultation.&lt;/p&gt;\n&lt;p&gt;You will be joining the team at an exciting time as we continue to develop the therapeutic strategy at the unit. As such, there is much opportunity to develop your practice. You will work closely with the ward’s Principal Clinical Psychologist and other members of the therapy team to implement psychological formulation, outcome measures, and staff development and training.&lt;/p&gt;\n&lt;p&gt;Informal enquires with the Principal Clinical Psychologist, Matron or Consultant Psychiatrist are welcomed.&lt;/p&gt;\n&lt;p&gt;Please note the interview date is tentative and is subject to change.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Frances IrwinJob titlePrinicipal Clinical PsychologistEmail addressfrances.irwin@nsft.nhs.ukTelephone number01502 527400&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dragonfly Unit, Lowestoft", "postalCode": "NR33 8AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "1.69677"}}, "title": "Systemic Family Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254346", "validThrough": "2020-11-15T23:59:59+0000"}