{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38992", "minValue": "35769", "unitText": "YEAR", "value": "£35,769.37 - £38,992.59 per annum"}}, "datePosted": "2020-10-06T08:40:01+0100", "description": "&lt;p&gt;&lt;strong&gt;We invest in the best – We pay £2,500 Welcome Bonus for all Nurses&lt;/strong&gt; - * Terms &amp; conditions apply. We are now able to offer flexible working hours.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would be delighted to speak to you If you’ve previously worked&lt;/span&gt;&lt;strong&gt;&lt;span&gt; for &lt;/span&gt;&lt;/strong&gt;&lt;span&gt;the&lt;/span&gt;&lt;strong&gt;&lt;span&gt; NHS. &lt;/span&gt;&lt;/strong&gt;Currently we are seeking &lt;strong&gt;Staff Nurses (RMN / RNLD)&lt;/strong&gt; to join our &lt;strong&gt;Adult Mental Health service&lt;/strong&gt; at &lt;strong&gt;The Huntercombe Hospital, Eldertree Lodge, &lt;/strong&gt;located approximately 6 miles from &lt;strong&gt;Market Drayton&lt;/strong&gt; and just &lt;strong&gt;11 miles from&lt;/strong&gt;&lt;strong&gt; Stoke-on-Trent&lt;/strong&gt; and &lt;strong&gt;within one mile from the A53&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Eldertree Lodge is a High Dependency Inpatient Rehabilitation Services for people with Learning Disabilities, that provides specialist assessments, treatments and rehabilitation for adults with intellectual disabilities, mental health needs, autistic spectrum disorders, including those with varying degrees of challenging behaviours and forensic histories. The Hospital has 46 beds spread across six wards.&lt;/p&gt;\n&lt;p&gt;The hospital is located in &lt;strong&gt;Market Drayton&lt;/strong&gt;, just &lt;strong&gt;10 miles from Stoke-on-Trent&lt;/strong&gt; and &lt;strong&gt;within one mile from the A53.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our &lt;strong&gt;Staff Nurses &lt;/strong&gt;are highly respected and they shape how we deliver care. Our &lt;strong&gt;‘Conversation&lt;/strong&gt; &lt;strong&gt;into Action’&lt;/strong&gt; programme actively encourages everyone to get involved and drive change for the better.&lt;/p&gt;\n&lt;p&gt;Huntercombe can &lt;strong&gt;offer you a rewarding career&lt;/strong&gt; where you will be valued as a key member of our team and every day you’ll be able to &lt;strong&gt;make a difference&lt;/strong&gt; to the lives of our patients and residents, supporting and encouraging them to achieve their goals and ambitions.&lt;/p&gt;\n&lt;p&gt;When you join The Huntercombe Group as a &lt;strong&gt;Registered Nurse (RMN / RNLD)&lt;/strong&gt;, you will be part of a company that is &lt;strong&gt;understanding&lt;/strong&gt;, &lt;strong&gt;strives towards excellence&lt;/strong&gt;, is &lt;strong&gt;innovative&lt;/strong&gt;, &lt;strong&gt;reliable &lt;/strong&gt;and &lt;strong&gt;accessible&lt;/strong&gt; and above all &lt;strong&gt;puts people first&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Most patients and residents are referred &lt;strong&gt;via NHS and local authorities&lt;/strong&gt;. We play an integral part in contributing to new models of care outlined in the &lt;em&gt;Five Year Forward View.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Staff Nurse (RMN/RNLD) &lt;/strong&gt;working in our &lt;strong&gt;Adult Mental Health Service (ADMH)&lt;/strong&gt; your main duties will be:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To identify care needs of patients, planning and implementing nursing interventions and evaluating outcomes of care given&lt;/li&gt;\n&lt;li&gt;To communicate information accurately on patient care to the patient, families, internal and external professionals, including Commissioners whilst maintaining confidentiality and adhering to the principles of Information Governance&lt;/li&gt;\n&lt;li&gt;To administer drugs and checking/ preparations in accordance with Company policy and procedures and NMC guidelines.&lt;/li&gt;\n&lt;li&gt;To report and record incident and accidents in accordance with policy and procedures&lt;/li&gt;\n&lt;li&gt;To assist in the induction, development and supervision of, new and junior staff members, as required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To join The Huntercombe Group as a &lt;strong&gt;Staff Nurse (RMN/RNLD)&lt;/strong&gt; you will:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hold current NMC PIN registration and adhere to the NMC Codes of Conduct at all times&lt;/li&gt;\n&lt;li&gt;Have a person centred ethos, showing empathy and a desire to make a difference&lt;/li&gt;\n&lt;li&gt;Have the ability to motivate, lead and supervise a team&lt;/li&gt;\n&lt;li&gt;Be able to demonstrate initiative and creativity&lt;/li&gt;\n&lt;li&gt;Be flexible and adaptable, well organised and able to manage time and workload effectively in line with the needs of the service&lt;/li&gt;\n&lt;li&gt;Have a desire to expand your professional development and support organisational change&lt;/li&gt;\n&lt;li&gt;Have a legal right to work in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return we offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A generous Bonus payment - *Terms and Conditions apply&lt;/li&gt;\n&lt;li&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/li&gt;\n&lt;li&gt;2 weeks paid paternity leave&lt;/li&gt;\n&lt;li&gt;Shared parental leave, matching the maternity leave benefit&lt;/li&gt;\n&lt;li&gt;A fantastic preceptorship programme&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;Reimbursement for NMC registration fees&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Continuing Professional Development (CPD)&lt;/li&gt;\n&lt;li&gt;Support for revalidation&lt;/li&gt;\n&lt;li&gt;Support for BSc and MSc&lt;/li&gt;\n&lt;li&gt;Professional support through Nurses forum&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;li&gt;Relocation allowance of up to £8000.00&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click &lt;strong&gt;Apply&lt;/strong&gt; now.&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;To learn more about The Huntercombe Group please visit our website&lt;/p&gt;\n&lt;p&gt;Posting date: 6th October 2020&lt;/p&gt;\n&lt;p&gt;Closing Date: 10th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Market Drayton, Stoke-on-Trent", "postalCode": "TF9 4LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9291", "longitude": "-2.35599"}}, "title": "Staff Nurse (RMN / RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213922", "validThrough": "2020-11-10T23:59:59+0000"}