{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-28T17:30:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our busy and dynamic pharmacy department is a forward thinking environment. constantly aiming to improve services and training programmes. We are recognised as digitally advanced within the healthcare sector and we have been successful in a number of innovation bids to support our aims.&lt;/p&gt;\n&lt;p&gt;Due to the promotion of the current post holder, we have a fantastic opportunity to join our aseptics and specialist medicine clinical pharmacy team. The right candidate will be an enthusiastic pharmacist with an interest in both aseptics and clinical work. In return you will join the clinical team supporting the haematology, renal, gastroenterology, intestinal failure, medical high dependency and metabolic medicine teams. You will also become a member of the aseptics team, with the opportunity to gain exposure to various aspects of the quality management system and provide professional supervision of the work in the Aseptic Services Department including final product check and release of aseptically prepared items.&lt;/p&gt;\n&lt;p&gt;You will be based at Salford Royal and work across a number of specialist and tertiary referral services. This post offers an excellent opportunity to develop your knowledge and skills working with a team of highly specialist and nationally recognised pharmacy experts.&lt;/p&gt;\n&lt;p&gt;You must have considerable hospital experience and have completed at least the first year of a post graduate clinical diploma. An opportunity to develop a non-medical prescribing role will be supported for the right candidate.&lt;/p&gt;\n&lt;p&gt;You will work with the other senior rotational pharmacists to support the dispensary and aseptic services. Weekend working and a home-based on-call service are part of this role.&lt;/p&gt;\n&lt;p&gt;If you have a strong work ethic, a can do attitude and are enthusiastic and passionate about pharmacy we look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Holly Devine&lt;br /&gt;Senior Clinical Pharmacist: Education and Training, Diabetes and Endocrinology&lt;br /&gt;Holly.devine@srft.nhs.uk&lt;br /&gt;0161 206 1050&lt;br /&gt;&lt;br /&gt;or&lt;br /&gt;&lt;br /&gt;Gillian Crawshaw&lt;br /&gt;Pharmacy PA&lt;br /&gt;Gillian.crawshaw@srft.nhs.uk&lt;br /&gt;0161 206 1050&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Senior Rotational Clinical Pharmacist - Specialist Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247500", "validThrough": "2020-11-11T23:59:59+0000"}