{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096- £110,683"}}, "datePosted": "2020-10-27T13:30:55+0000", "description": "&lt;p&gt;Luton &amp; Dunstable Hospital&lt;/p&gt;\n&lt;p&gt;Locum Consultant Upper GI General Surgeon (10 Programmed Activities)&lt;/p&gt;\n&lt;p&gt;We are looking for a locum consultant surgeon to cover the benign Upper GI service. This is a 1 year fixed term post to commence as soon as possible with a full working week of DCC commitments. The appointments will be made in accordance with the Terms and Conditions of service for the 2003 Consultant contract (England).&lt;/p&gt;\n&lt;p&gt;Key duties will include supervising and running outpatient clinics, operating lists (independent and supporting role for more complex cases), 2 week wait clinics and endoscopy lists if JAG accredited or working towards accreditation. Consultant General Surgery on-call of 1 in 12 weekday and weekday night together with 1 in 12 weekends. Care for patients on wards in collaboration with the multidisciplinary team, including ward nurses and specialist nursing teams.&lt;/p&gt;\n&lt;p&gt;The hospital is a tertiary centre for Head and Neck and Bariatric Surgery. There is a seven bedded Intensive Care Unit and the Maternity Unit cares for over five thousand deliveries each year. There is an Intergraded Pain Management Service.&lt;/p&gt;\n&lt;p&gt;The Luton &amp; Dunstable University Hospital is a highly rated, diverse and forward thinking place to work. We are a Foundation Trust serving a multi-cultural population of over 350,000 across Bedfordshire and North Hertfordshire. We are a regional centre of excellence for several key specialties, including; Obesity Research and surgery, Maxillofacial surgery, Head and Neck Cancer surgery Neurophysiology, Cardiology, Ophthalmology and Cancer Services. We are a tertiary level NICU provider and one of the largest centres for breast screening in the country.&lt;/p&gt;\n&lt;p&gt;The Trust received an overall Good for services at the Luton and Dunstable Hospital following its recent CQC inspection, and was recently announced the only hospital in the country to meet all of the key targets.&lt;/p&gt;\n&lt;p&gt;The Hospital has always been renowned for its friendly atmosphere and good working relationships. Ongoing developments are now enabling a considerable expansion in facilities, staff and hence services offered. The Trust has University Hospital status with UCL and the Royal Free providing an opportunity to strengthen our teaching and R&amp;D programmes and brings a more academic environment to the hospital. Our links for undergraduate students also include Cambridge Medical School and we have an excellent reputation for junior staff training.&lt;/p&gt;\n&lt;p&gt;The Hospital has easy access to central London and the rural Chilterns. The rural areas include many attractive villages and towns within easy reach of the Hospital including St Albans and Harpenden. Excellent schools are found nearby. There is also very good access to the Midlands and London by road using the M1 or A1, or by rail to one of Luton’s three stations. A direct link using the new ‘Busway’ takes passengers from Luton Train station just 7 minutes to reach a stop within a short walking distance of the hospital. London Luton Airport is within fifteen minutes’ drive from the hospital.&lt;/p&gt;\n&lt;p&gt;Applicants must be fully registered on the UK General Medical Council.&lt;/p&gt;\n&lt;p&gt;Applicants must be on the Specialist Register or apply to be on the specialist register/obtaining CCT within 6 months of the date of interview.&lt;/p&gt;\n&lt;p&gt;Residence is required within ten miles by road or up to thirty minutes travelling time of the hospital.&lt;/p&gt;\n&lt;p&gt;Candidates unable for personal reasons to work full-time are invited to apply.&lt;/p&gt;\n&lt;p&gt;The appointment will be subject to an Enhanced Disclosure and Barring Service check for the successful candidate prior to commencement.&lt;/p&gt;\n&lt;p&gt;Informal discussions are encouraged and you are invited to contact via the Hospital switchboard on 01582 491166:&lt;/p&gt;\n&lt;p&gt;Mr Jamulingham – Upper GI, Bariatric and Laparoscopic Surgery (Clinical Director)&lt;/p&gt;\n&lt;p&gt;Mr D E Whitelaw - Pancreatobiliary and Bariatric Surgery Consultant (Clinical Director of Bariatric Surgery)&lt;/p&gt;\n&lt;p&gt;David Cox – General Manager - General Surgery, Obesity and Urology&lt;/p&gt;\n&lt;p&gt;Shortlisted candidate(s) will be contacted within 2 weeks of the closing date of the advert&lt;/p&gt;\n&lt;p&gt;Committed to Equality&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LUTON AND DUNSTABLE HOSPITAL NHS FOUNDATION TRUST, Luton", "postalCode": "LU4 0DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8942", "longitude": "-.474244"}}, "title": "Locum Consultant Upper GI General Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244730", "validThrough": "2020-11-23T23:59:59+0000"}