{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa pro rata inc HCAS"}}, "datePosted": "2020-11-02T09:46:12+0000", "description": "&lt;p&gt;Sutton Health and Care is a pioneering partnership made up of the GP federation in Sutton, the London Borough of Sutton, South West London and St George’s Mental Health Trust and Epsom and St Helier hospitals. Working together, we provide community services in Sutton, caring for adults in their own homes across the borough.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic Band 6 Community Nursing Team Sister to join us in our community nursing services within the London borough of Sutton. If you are a passionate, motivated team player and want to excel in leading a team of healthcare professionals to deliver exceptional holistic healthcare to a diverse patient group supported by a multidisciplinary team of community specialists nurses and district nurses. We want to hear from you.&lt;/p&gt;\n&lt;p&gt;Previous experience of community nursing is essential. We offer clinical supervision and access to learning and development to support your continuous professional development. We encourage community nurses with an interest in developing leadership skills to apply.&lt;/p&gt;\n&lt;p&gt;As a Team Sister you will work directly with patients, their families and Sutton Health &amp; Care multidisciplinary services to plan and facilitate the delivery of holistic evidence based care; supporting patients to remain independent with the aim of avoiding unnecessary hospital admission.&lt;/p&gt;\n&lt;p&gt;The pioneering partnership of Sutton Health and Care is truly exciting, and together, we can achieve more for the people we care for. We want local people to receive the care that they need in the right environment. Bringing together our expertise will allow us to improve patient care and will enable local people to access the right support, care and treatment more easily than ever before.&lt;/p&gt;\n&lt;p&gt;We offer flexible shift patterns and encourage informal visits.&lt;/p&gt;\n&lt;p&gt;We are a 7 day extended hours service; working Monday to Sunday, 8am – 6pm including weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Shirley Forson&lt;/p&gt;\n&lt;p&gt;Job title: Operational Manager&lt;/p&gt;\n&lt;p&gt;Email address: shirley.forson@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07584777122&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Robin Hood Lane Health Centre, Sutton", "postalCode": "SM1 2RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.363", "longitude": "-.19693"}}, "title": "Community Nursing Team Sister/ Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251466", "validThrough": "2020-11-16T23:59:59+0000"}