{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-30T10:47:03+0000", "description": "&lt;p&gt;CHILDRENS DIABETES NURSE BAND 6&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced, enthusiastic and flexible Registered Children’s Nurse to join our Diabetes Team.&lt;/p&gt;\n&lt;p&gt;Working as a member of the team, the post holder will deliver an expert nursing service to children and young people with Diabetes from diagnosis until discharge or transition to the adult service.&lt;/p&gt;\n&lt;p&gt;In addition to this they will also be required to support other members of the children’s community nursing team when the need arises.&lt;/p&gt;\n&lt;p&gt;You will be based at the Wrexham Maelor Hospital. You will have experience of supporting patients with diabetes and delivering education in a variety of formats. You will have a clinical caseload with whom you will support and be responsible for assessment, planning, implementation and evaluation of diabetes care and education with the support of the Band 7 Diabetes Nurse&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for delivering diabetes education to ward staff ensuring competencies are completed. In addition to this there will be a requirement for the post holder to deliver education to staff within education on a rolling annual programme with the support of the Band 7 PDSN.&lt;/p&gt;\n&lt;p&gt;The post holder will establish clear lines of communication with primary healthcare teams in order to increase knowledge and facilitate the care of this patient group within the community setting.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have a positive and progressive attitude, have excellent interpersonal skills, be committed to the Trust Values, and be motivated to learn and share new ideas for improving the patient experience and service.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 15 November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karen Czerniak&lt;/p&gt;\n&lt;p&gt;Team Leader Children&#39;s Community Nursing/ Children&#39;s Diabetes Nurse&lt;/p&gt;\n&lt;p&gt;01978 725290&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wrexham Maelor Hospital, Wrexham", "postalCode": "LL13 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0462", "longitude": "-3.01018"}}, "title": "Childrens Diabetes Nurse Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249806", "validThrough": "2020-11-15T23:59:59+0000"}