{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-05T14:46:27+0000", "description": "&lt;p&gt;The Mental Health Services for Older People care group is looking to recruit a full time Clinical Secretary for City Community Mental Health Team based at Highbury Hospital. This post will provide secretarial and administrative support to the community clinical and medical teams.&lt;/p&gt;\n&lt;p&gt;This role requires an experienced secretary who has worked in a similar role with a comprehensive knowledge of administration and secretarial duties and with the skills and experience to meet the needs of the role.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake clinical administrative and secretarial work as required by the community medical and clinical team. Providing support to the team, maintaining accurate appointment schedules. It is essential that you have excellent planning and organisational skills and ensure that you assist the clinical team with all necessary clerical arrangements.&lt;/p&gt;\n&lt;p&gt;You will be required to coordinate and attend regular team meetings taking accurate minutes, maintain an effective filing system for patients’ records and documentation and ensure that data is input onto the Rio patient information system for patients within the service.&lt;/p&gt;\n&lt;p&gt;It is essential that you have RSA/OCR Level 3 in typing or text processing or equivalent qualification or experience, along with a qualification or working knowledge of Microsoft Office.&lt;/p&gt;\n&lt;p&gt;This is a varied and demanding role and will suit someone who is motivated and conscientious with a flexible approach to work and who enjoys the challenge of working in a busy area and being part of a team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Hayley Smith - Admin Support Manager&lt;/p&gt;\n&lt;p&gt;Email address: hayley.smith@nottshc.nhs.uk / Telephone number: 0115 969 1300 ext: 14319&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Collette Hamer - Admin Lead&lt;/p&gt;\n&lt;p&gt;Email address:  collette.hamer@nottshc.nhs.uk / Telephone: 0115 969 1300 ext: 10848&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG6 9DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9927", "longitude": "-1.19201"}}, "title": "Clinical Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258169", "validThrough": "2020-11-16T23:59:59+0000"}