{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19737", "minValue": "19737", "unitText": "YEAR", "value": "From £19,737 per annum"}}, "datePosted": "2020-11-04T12:16:31+0000", "description": "&lt;p&gt;The Psychological Therapies Service (PTS) in Swindon is seeking to recruit an experienced administrator to join our busy team. You will be based at Chatsworth House but will provide administrative support to PTS staff working across Chatsworth House, the Victoria Centre and Sandalwood Court. PTS comprises a supportive team of Clinical Psychologists, Counselling Psychologists, Clinical Nurse Specialists in CBT and Arts Psychotherapists&lt;/p&gt;\n&lt;p&gt;You will possess excellent secretarial and administrative skills, be familiar with using a range of Microsoft packages, and open to leaning to use the full range of system used in the Trust for booking rooms, ordering supplies and maintaining our roster. However, you will also be able to manage your own time and workload, have a strong sense of teamwork, and have excellent communication skills. You should be able to work flexibly and have excellent strategies for managing what can sometimes be a pressured environment. Our administrator is essential to the safe and effective running of our service, and is a key member of our team.&lt;/p&gt;\n&lt;p&gt;You will have a friendly, empathic and non-judgemental approach to your work, as you will be required to deal with service users over the phone. As you will be dealing with sensitive personal information, it is vital that you understand the importance of confidentiality and information governance.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:   Dr Imogen Reid, Head of Psychological Therapies Service on imogen.reid@nhs.net or 01793 715000 or 07879 440239&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chatsworth House, Swindon", "postalCode": "SN1 4BP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5527", "longitude": "-1.77806"}}, "title": "Band 3 Clinical Services Administrator (Community) - Swindon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255796", "validThrough": "2020-11-11T23:59:59+0000"}