{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-10-23T17:01:22+0100", "description": "&lt;p&gt;Are you an enthusiastic Speech and Language Therapist with experience, who would like to further develop their skills working in Further Education Colleges with young people 16 -25yrs who have a range of communication difficulties and learning needs? &lt;br /&gt;&lt;br /&gt;We are looking for therapists who are interested in working term time only (39 weeks). The posts work within the Bucks Colleges Group across the Amersham/High Wycombe Campus and Aylesbury Campus. You will be part of an Integrated Therapies’ team working closely with our Occupational Therapy and Physiotherapy colleagues as well as education staff, and Music Therapists. In the colleges you will also working alongside organisations such as Talk Back and the McIntyre Charity. We pride ourselves in promoting a person-centred approach to support, with opportunities to work both directly and indirectly with the students. There is a high commitment to upskilling those supporting the young people.&lt;br /&gt;&lt;br /&gt;You will be joining a dynamic team of therapists who are committed to delivering an evidence based person-centred service. A working knowledge of symbol based AAC is required and a basic knowledge of MAKATON signing/or dysphagia would be useful. &lt;br /&gt;&lt;br /&gt;CYP Therapies have a strong commitment to CPD and regular clinical supervision. Access to specialist training is available via internal and external courses, as well as mentoring, clinical supervision, attendance at regional and national CEN meetings.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Theresa Drake theresa.drake@nhs.net&lt;/p&gt;\n&lt;p&gt;Mobile 07767250067&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Buckinghamshire FE colleges, Amersham expect to work across sites", "postalCode": "HP7 0JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.663", "longitude": "-.621366"}}, "title": "Specialist Speech and Language Therapist - FE Colleges", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241406", "validThrough": "2020-11-06T23:59:59+0000"}