{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-04T12:01:45+0000", "description": "&lt;p&gt;An exciting and rewarding opportunity has arisen for a highly professional and motivated Registered Nurse to join our Adult Safeguarding Service.&lt;/p&gt;\n&lt;p&gt;The ideal candidate must have excellent interpersonal and communication skills, and be able to demonstrate that you can manage sensitive, challenging and highly emotional situations with integrity and professionalism. You will approach situation in a measured and non-judgmental manner. You will be professionally curious and be determined and tenacious in understanding situations and circumstances that you will face. You will be able to demonstrate that you can work effectively across all disciplines and services, including working with agencies and professionals outside of the Trust.&lt;/p&gt;\n&lt;p&gt;You will have an awareness of the legislative and best practice frameworks that underpin the adult safeguarding agenda, including domestic abuse, Mental Capacity Act and Deprivation of Liberty Safeguards.&lt;/p&gt;\n&lt;p&gt;The primary role of the focus will be to support the effective delivery of all adult safeguarding services by assisting the Trust&#39;s Matron for Adult safeguarding and the Head of Safeguarding. As a first point of contact the post holder will provide expert advice, professional support, guidance and education to the multi-professional teams, partner agencies, patients and their families and carers. You must have the ability to work autonomously and as part of a team , and be able to prioritise and manage your own workload. You must be committed to advocating for the rights of &#39;adults at risk&#39; of harm, abuse or neglect, and act as a professional role model at all times. You must be willing and able to professionally challenge practice, and to lead and manage adult safeguarding enquiries within the Trust (support and training will be provided for this aspect of the role). Experience of undertaking complaints and incident reviews will be of benefit to the successful candidate.&lt;/p&gt;\n&lt;p&gt;The post holder will report to the Trust&#39;s Matron for Adult Safeguarding . The post holder will provide a service across all sites and CMGs of the Trust, including the Alliance and Satellite services. The post is full time and the successful candidate will need to work flexibly as required.&lt;/p&gt;\n&lt;p&gt;Applicants wishing to apply for this post must be a &lt;strong&gt;Level One Registered Nurse - Adults&lt;/strong&gt;, with a minimum of 6 years post registration experience caring for adults with complex needs, preferably in an acute health care environment. Experience of working in the field of adult safeguarding is desirable, and evidence of professional development is essential.&lt;/p&gt;\n&lt;p&gt;For informal enquiries, please contact Sarah Meadows, Matron Adult Safeguarding on 0116 258 7703.&lt;/p&gt;\n&lt;p&gt;sarah.a.meadows@uhl-tr.nhs.uk&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Candidates can also speak to Suzanne Ford on same telephone number if Sarah Meadows is on leave&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE15WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Adult Safeguarding Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255730", "validThrough": "2020-11-18T23:59:59+0000"}