{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "89333", "minValue": "77732", "unitText": "YEAR", "value": "£77,732 – 89,333 per annum pro rata"}}, "datePosted": "2020-10-21T12:36:09+0100", "description": "&lt;p&gt;We are looking for an enthusiastic, highly motivated and experienced clinician for the post of locum Specialist in Endodontics. The appointee will be joining a small Specialist Dental Service based in Ickenham Clinic, which provides, on referral, level 3 Endodontic and Periodontal treatment to the residents of Hillingdon and Harrow.&lt;/p&gt;\n&lt;p&gt;Ickenham Specialist Dental Service is part of a larger Central and North West London Dental service with approximately 80 members of staff.&lt;/p&gt;\n&lt;p&gt;The appointee will be responsible for the provision of level 3 endodontic specialist dentistry.&lt;/p&gt;\n&lt;p&gt;The appointee will be able to demonstrate clinical leadership within an NHS setting and be able to demonstrate appropriate leadership skills with regard to individual performance, clinical teams, the Trust and work collaboratively with all members of a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Candidates will have the drive and enthusiasm for service development and improvement to include the teaching, peer review and supervision of staff.&lt;/p&gt;\n&lt;p&gt;The appointee will be expected to hold the Bachelor in Dental Surgery qualification or equivalent, hold a relevant postgraduate qualification and have full GDC registration. The appointee must be in possession of a CCST in Endodontics.&lt;/p&gt;\n&lt;p&gt;Applicants must also have an NHS performer number.&lt;/p&gt;\n&lt;p&gt;For an informal discussion or visit, please contact Dr Jane Little, Clinical Director on 01908 724677.&lt;/p&gt;\n&lt;p&gt;Closing date for receipt of applications: Friday 6th November 2020&lt;/p&gt;\n&lt;p&gt;Interview date: To be confirmed&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ickenham, London", "postalCode": "UB10 8RE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5635", "longitude": "-.4435"}}, "title": "Locum Specialist in Endodontics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236399", "validThrough": "2020-11-06T23:59:59+0000"}