{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 Per annum"}}, "datePosted": "2020-11-05T16:16:41+0000", "description": "&lt;p&gt;As one of the main entry points Pilgrim Hospital, Outpatient services attend to patients, carers and visitors arriving with a multitude of information and care needs. These may range from health advice and guidance to life-changing consequences upon their physical and mental well-being. Delivering effective outpatient services that ensures the care and support provided to patients and those closest to them is of the highest standard is fundamental to achieving a good experience for the individual, and providing a positive impression of the Trust.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be enthusiastic, hardworking and professional focussing on the patient experience and care at all times. You must be able to promote the highest standards of customer care in a welcoming and friendly atmosphere. It is essential that the successful candidates possess excellent communication skills as you are the first point of contact for patients visiting our department. Candidates must also be able to prioritise their workload and manage their time effectively.&lt;/p&gt;\n&lt;p&gt;You will work under the direct supervision and guidance of the registered nursing team to ensure a safe and efficient journey for all of our patients.&lt;/p&gt;\n&lt;p&gt;You will be required to perform patients observations, act as a chaperone, support medical staff and patients during procedures, clean equipment and prepare clinic rooms.&lt;/p&gt;\n&lt;p&gt;You will be expected to work within ULHT behavioural framework guidance and support the delivery of the Outpatients Improvement plan and strategy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDiane SmithJob titleSisterEmail addressDiane.smith2@ulh.nhs.ukTelephone number01205446454Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact Sister Diane Smith or Deputy Sister Katy Stephenson for further details.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pilgrim Hospital, Sibsey Road, Boston, Lincolnshire, PE21 9QS, Pilgrim", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Outpatients Department Health Care Support Worker - Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258535", "validThrough": "2020-11-15T23:59:59+0000"}