{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62286", "minValue": "52606", "unitText": "YEAR", "value": "£52,606 - £62,286 per annum"}}, "datePosted": "2020-11-03T16:16:59+0000", "description": "&lt;p&gt;Public Health England’s screening Quality Assurance service (SQAS) wishes to appoint a Senior Business Operations Manager to join the National Team.&lt;/p&gt;\n&lt;p&gt;SQAS is part of the Health Improvement directorate within Public Health England. Screening identifies apparently healthy people who may be at increased risk of a disease or condition, enabling earlier treatment or informed decisions. National population screening programmes are implemented in the NHS on the advice of the UK National Screening Committee (UK NSC), which makes independent, evidence-based recommendations to ministers in the 4 UK countries. PHE advises the government and the NHS so England has safe, high quality screening programmes that reflect the best available evidence and the UK NSC recommendations. PHE also develops standards and provides specific services that help the local NHS implement and run screening services consistently across the country.&lt;/p&gt;\n&lt;p&gt;As Senior Business Operations Manager, you will be a senior member of the National QA Team, providing effective business and financial management to support the delivery of the screening QA service. A knowledge of NHS screening programmes and the quality assurance of the programmes would be advantageous for this role.&lt;/p&gt;\n&lt;p&gt;You will have highly developed communication skills, be able to work with the minimum of supervision, prioritise tasks independently, liaise effectively and develop excellent working relationships with a wide range of senior individuals, partners and organisations.&lt;/p&gt;\n&lt;p&gt;For further discussion please get in touch with Kate O’Connor, Strategic Operations Lead, kate.oconnor@phe.gov.uk&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;When applying for this role, please indicate in the opening line of your Supporting Information, “I am a surplus/at risk employee in the civil service”, if applicable.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name  Kate O&#39;Connor&lt;/p&gt;\n&lt;p&gt;Job title  Strategic Operations Lead&lt;/p&gt;\n&lt;p&gt;Email address  kate.oconnor@phe.gov.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 02036820906&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington House, London", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "Senior Business Operations Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254771", "validThrough": "2020-11-17T23:59:59+0000"}