{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa. Inclusive of HCAS [15%]"}}, "datePosted": "2020-10-29T15:45:41+0000", "description": "&lt;p&gt;Taking care of our patients is at the heart of everything we do.&lt;/p&gt;\n&lt;p&gt;Kingston Hospital NHS Foundation Trust is based about 12 miles from the city with good transport links and is very close to Richmond Park. The hospital supports around 350,000 people in the surrounding area and directly employs around 2,700 staff, with another 300 staff employed by contractors. The IM&amp;T department supports the hospital&#39;s IT systems, applications and infrastructure.&lt;/p&gt;\n&lt;p&gt;The Trust is seeking to recruit a highly skilled senior staff in the IM&amp;T Application Support Team who will be responsible for providing specialist advice across a range of applications supported by the team, with particularly strong experience of Care Record Service (CRS), Cerner Millennium. The Application Support Specialist will also manage technical escalations for complex problems and work with other teams within and outside IM&amp;T to resolve technical issues effectively.&lt;/p&gt;\n&lt;p&gt;This role will also be responsible for analysing applications&#39; performance, capacity and availability data to produce, assess, evaluate, manage and approve the strategic road maps, service improvement plans and annual maintenance plans for the portfolio of applications supported by the team.&lt;/p&gt;\n&lt;p&gt;If you have a can-do attitude, strong support skills, backed by a solid experience in a range of healthcare applications, particularly Cerner Millennium; you continually seek to improve the services and are detail focused to manage long term proactive maintenance plans; you work collaboratively with third parties to deliver the best services and your experience is gained in an ITIL environment, then we are very keen to hear from you.&lt;/p&gt;\n&lt;p&gt;Kingston Hospital will offer you a fun but challenging environment to apply and further develop your skills working alongside a great team of experts in Application and Infrastructure technologies. You will become part of and be able to help drive a positive change.&lt;/p&gt;\n&lt;p&gt;The deadline for applications is 12-Nov-2020. However, we may close this position early if we receive sufficient applications.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Simon Haslett - simonhaslett@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "IM&amp;T, Kingston Hospital NHS Foundation Trust, Kingston upon Thames", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "IM&amp;T Application Support Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248914", "validThrough": "2020-11-12T23:59:59+0000"}