{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 inc 5% Fringe HCAS"}}, "datePosted": "2020-10-09T08:15:30+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band6 Nurse to join the learning disability Liaison Service for adults with learning disabilities. We are looking for a passionate learning disability nurse to join the Primary branch of the Liaison service, which focuses on providing support to people with learning disabilities around accessing their GP practice and additional primary care services.&lt;/p&gt;\n&lt;p&gt;The post is responsible for working alongside social care homes in the Epsom area to ensure equal access and positive health outcomes and with specific focus on overseeing a project across Surrey, to increase engagement between social care providers and GP surgeries.&lt;/p&gt;\n&lt;p&gt;The wider Liaison Service consists of two teams of specialist learning disability nurses, who support people with a learning disability to access mainstream health services in the Surrey and North-East Hants and Farnham area.&lt;/p&gt;\n&lt;p&gt;The Acute team work within the five hospitals across Surrey, whereas the Primary team is more community based, working closely with GP’s to identify individuals with a learning disability and provide additional support, such as helping to arrange appointments for people with special requirements by promoting reasonable adjustments. They also work closely with people with learning disabilities and their families and carers’ with the aims to improve health outcomes and reduce health inequalities.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be supported to retain and manage their own case load and provide some support across the whole Liaison Service during team absences in partnership with the adult community learning disability team.&lt;/p&gt;\n&lt;p&gt;This Primary Care Liaison Nurse post is suitable for someone who is passionate about primary health care and promoting Annual Health Checks by ensuring a high quality holistic approach to the health care and support provided to people with learning disabilities.&lt;/p&gt;\n&lt;p&gt;You need to be highly motivated, imaginative and committed to improving health outcomes and challenging the barriers as identified in “Health Care For All”. You will be happy to develop others including formal delivery of the Enhanced Service training to GP’s, as well as providing specialist training to generic services and support staff.&lt;/p&gt;\n&lt;p&gt;The post is hosted by the Surrey and Borders Partnership NHS Foundation Trust but works in partnership with the CCGs. The post is based within one of the CTPLD offices, but travel is required to other parts of the County on SABP business.&lt;/p&gt;\n&lt;p&gt;You will be required to work autonomously, as part of the wider team, with a variety of agencies outside of the Trust. You will deliver on agreed contractual projects as they may arise between the Trusts and the CCGs.&lt;/p&gt;\n&lt;p&gt;The Trust actively encourages professional development through the appraisal process and regular supervision, and you will therefore be provided support to develop your nursing skills within an established team.&lt;/p&gt;\n&lt;p&gt;For further information regarding the post, please contact Katie Stribblehill on 07557204607&lt;/p&gt;\n&lt;p&gt;Key words: Learning, disability, disabilities, learning disabilities, RNLD, nursing, learning disability nurse, primary care, liaison, developmental, band 6, annual health checks.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ramsay House, Surrey wide", "postalCode": "KT19 8PH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.337", "longitude": "-.298015"}}, "title": "Primary Care Liaison Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219422", "validThrough": "2020-11-17T23:59:59+0000"}