{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30&#39;615"}}, "datePosted": "2020-10-29T16:47:57+0000", "description": "&lt;p&gt;&lt;span&gt;Band 5 Community Staff Nurse – North Staffordshire, Days &amp; Out of Hours Teams &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Do you want to be part of an emerging, unique and diverse organisation that put people at the heart of what we do? A Trust that empowers and engages its workforce to improve care and wellbeing, by delivering better health, better care in partnership?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Are you looking to develop your knowledge and skills in community services, providing both routine and complex treatments to patients within their own home?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Do you see the benefits of closer integrated working between health and social care to ensure the best outcomes for patients?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Are you passionate about wanting to work with patients to help them achieve their goals? Are you caring and compassionate and committed to personalised care?&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Within the MPFT Planned Care Community Nursing Directorate, we have a number of opportunities for Band 5 Community Staff Nurses to join our locality; this includes Stoke, Newcastle and the Staffordshire Moorlands. The positions are across a range of teams within North Staffordshire, including both our daytime and Out of Hours Services, and positions are also available on both a full and part time basis. We are recruiting dedicated and compassionate nurses to further enhance the high quality patient experience we offer in the community. &lt;br /&gt; The successful applicant needs to have a commitment to providing care in patients’ own homes, be able to work on their own initiative and work well within a team, demonstrating a wide-range of clinical skills. Community services are admitting patients with a more complex acuity than ever before, with increasingly specialist treatment and care being provided by highly skilled staff. For the right applicant, training and development can be provided to meet the individualised needs of patients in our community.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting time to join the team and you will be a part of excellent way of working to meet the changing demand on community nursing. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These posts are also open to newly qualified nurses and student nurses due to qualify in January 2021. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; &lt;br /&gt; For more information, please contact -&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Emily Colclough&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Operational Lead &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Emily.Colclough2@mpft.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Staffordshire", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Communtity Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249154", "validThrough": "2020-11-25T23:59:59+0000"}