{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 PA INC"}}, "datePosted": "2020-11-04T10:31:40+0000", "description": "&lt;p&gt;The Royal Marsden NHS Foundation Trust is one of the leading cancer centres in the world and has an international reputation for the care and treatment it provides. The Royal Marsden serves a local, regional, national and international population from two hospital sites, Chelsea and Sutton. The state of the art Critical Care Unit (CCU) at The Royal Marsden, Chelsea, facilitates the provision of exceptional treatment and care to patients throughout critical phases of their cancer journey and received a consistent outstanding rating from the CQC.&lt;/p&gt;\n&lt;p&gt;The 16 bed CCU on the Chelsea site is the only level 3 critical care facility dedicated entirely to cancer patients in the United Kingdom and boasts some of the best survival rates for critically ill haemato-oncology patients in Europe. We also have an additional 2 bed facility on our Sutton site which provides care for patients who are being stabilized prior to transfer to CCU in Chelsea. At the heart of everything we do within this highly technical area is the patient, often immediately post major, complex cancer surgery under a range of specialties, or experiencing acute complications of their cancer treatment.&lt;/p&gt;\n&lt;p&gt;We are an open, dynamic and diverse team who are looking to recruit Band 6 staff nurses with critical care course qualification and recent critical care experience to join us. We provide a supportive and encouraging environment for you to develop within a highly specialized area. Each successful candidate will have a named mentor and access to highly experienced Practice Educators.&lt;/p&gt;\n&lt;p&gt;There is plenty of opportunity for career development and progression at the Royal Marsden which is affiliated to Kingston and St Georges London University. The staff are provided with study leave for relevant courses and given the opportunity to attend critical care conferences.&lt;/p&gt;\n&lt;p&gt;We aspire to be compassionate, supportive, personal and open; patient and family experience is central to everything we do. Together with solid clinical and technical skills, we expect a deep awareness of the special needs of our patients, along with the ability to support and care for them and their families throughout their stay.&lt;/p&gt;\n&lt;p&gt;We are delighted to invite you for an informal visit to show you around. Feel free to contact us on 02073528171 extension 1535 or email Marinella Salvador ( CCU Sister) on marinella.salvador@rmh.nhs.uk to arrange a suitable date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Marinella Salvador, Ward Sister, Marinella.Salvador@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden Hospital, Chelsea", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Staff Nurse - CCU - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255387", "validThrough": "2020-11-18T23:59:59+0000"}