{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pa pr"}}, "datePosted": "2020-10-28T12:31:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Theatre Staff &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;University Hospitals Dorset NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;For this post you will be based at Poole Hospital &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 2 Vacancies: Theatre support workers - TSW &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Main Theatres – Trauma and Orthopaedics&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;University Hospitals Dorset are working to develop an expanded service for the Dorset community and wider areas. Poole is a great place to live and work where patient care and staff welfare are our top priorities. We are located in Poole town centre near the coast and New Forest.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;At this exciting time, are you what we are looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking for a new challenge and career progression? Working with multi professional colleagues, and become part of an exciting trauma and Orthopaedic team? working across sites as required gaining a vast knowledge base within this speciality. Experience in theatres is desirable but not essential. The trusts offers a wider variety of specialities including – gynaecology, general, head and neck, Obstetrics, day surgery, vascular, Ophthalmology, urology, anaesthetics and recovery–We encourage career progression for all our staff and training will be given to facilitate development. Your peers, surgeons and senior staff will support you to learn new skills and to expand your practice&lt;/p&gt;\n&lt;p&gt;We pride ourselves on our friendly working environment and our desire to lead on Best Practice in operating Theatre setting. If you have , skills, experience although, not essential and drive that we are looking for to join our friendly and supportive team, then University Hospitals Dorset theatres are the place for you.&lt;/p&gt;\n&lt;p&gt;If this role is of interest to you please see the Job Description and Person Specification.&lt;/p&gt;\n&lt;p&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/p&gt;\n&lt;p&gt;Closing date: 11/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date: week commencing 23/11/2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;INFORMAL VISITS ARE MOST WELCOME AND ENCOURAGED&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details or to arrange a visit please contact:&lt;/p&gt;\n&lt;p&gt;Jennifer Miller Clinical Team Manager&lt;/p&gt;\n&lt;p&gt;Email: Jennifer.miller@uhd.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Theatre Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246611", "validThrough": "2020-11-11T23:59:59+0000"}