{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a. inc. pro rata"}}, "datePosted": "2020-11-06T13:00:59+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a dynamic, forward-thinking Specialist Occupational Therapist (Band 6) to work at the Homerton Transitional Neurological Rehab Unit (HTNRU). HTNRU is a 7 bedded neurological rehabilitation unit in Hackney which supports people with neurological conditions to return to the community. The unit specialises in a transitional rehabilitation model, which bridges inpatient and community work. HTNRU is dedicated to being client-centered with a focus on positive risk taking and on supporting self-management. There is a strong emphasis on interdisciplinary working with other members of the MDT, including the physiotherapist, speech and language therapist, psychologist, nurse, and rehabilitation assistants, to ensure a whole team approach to rehabilitation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for carrying out assessment and treatment for patients with newly acquired and long term neurological conditions. As the emphasis is on a 24-hour approach to rehabilitation, the post holder will also be expected to delegate and to oversee rehab programmes carried out by the rehabilitation assistants. Therapy sessions are carried out on the unit, the community, and in the home in a combination of individual and group sessions. The team works closely with community services that are vital for supporting the patient once home. In addition to the clinical responsibilities, the post holder will have the opportunity to supervise, to participate in CPD opportunities, and to join quality improvement projects.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must have previous experience in the field of neurosciences. They must have excellent communication and time management skills. They need to have a positive approach to rehabilitation and be an effective team player.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This job opportunity would be ideal for someone who is passionate about neurorehabilitation and about working in a small team focused on supporting a patient’s return to the community. The post holder will be supported to advance their skills under the supervision of the senior occupational therapist as well as internal and external development opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note the working hours are 18.75 hours per week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview date: 20th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Joanna Lyndon-Cohen, Highly Specialist Occupational Therapist. joannacohen@nhs.net . 0207 613 4663&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HTNRU, Mary Seacole Nursing Home, London", "postalCode": "N1 5JS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5342", "longitude": "-.079637"}}, "title": "Specialist Neurological Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259784", "validThrough": "2020-11-16T23:59:59+0000"}