{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-04T08:16:17+0000", "description": "&lt;p&gt;&lt;span&gt;An opportunity has arisen for a motivated&lt;/span&gt;&lt;span&gt; (0.5 wte) Assistant Psychologist to &lt;span&gt;work at &lt;/span&gt;the National Deaf Mental Health Service, Birmingham&lt;span&gt;. &lt;/span&gt;The primary project will involve the monitoring of changes in language and cognition in deaf people who are experiencing mental health difficulties. Thus, the applicant is required to be a psychology graduate, a fluent sign language user and to be exceptional at multidisciplinary working.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The National Deaf Mental Health Service, provided by BSMHFT, operat&lt;/span&gt;&lt;span&gt;es&lt;span&gt; from The Barberry&lt;/span&gt;.&lt;span&gt; We &lt;/span&gt;provide tertiary level services across a third of England via a &lt;span&gt;12 bedded mixed &lt;/span&gt;inpatient &lt;span&gt;ward and a community team. &lt;/span&gt;We work directly with clients who have severe and enduring mental health problems, and co-work with their secondary (local) mental health teams. Some of our services users have concurrent learning disabilities and/or language deprivation. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The applicant would be supervised by an experienced clinical psychologist, and be a member of a small subgroup of psychologists. However, we pride ourselves on our multidisciplinary working and much of the assistant psychologist’s work will involve engaging other professionals, both deaf and hearing. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our &lt;span&gt;service &lt;/span&gt;works closely with other national and international deaf mental health care providers and values the sharing of evidenced based practice. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is our hope that the successful candidate for the assistant psychologist post will have a future in clinical psychology and a long term interest in deaf mental health care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;During the Covid19 phase the candidate may be required to work face to face, using appropriate PPE, and to work remotely. This would be decided, in agreement with the applicant, depending on their own health risks, the tasks being undertaken and the Covid status of our wards and offices at any particular time. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Sally AustenJob titleConsultant Clinical PsychologistEmail addresssally.austen@nhs.netTelephone number07985 882289&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Barberry, Birmingham", "postalCode": "B15 2SY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4502", "longitude": "-1.94218"}}, "title": "Band 5 Assistant Psychologist - Jasmine Deaf Inpatient Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255051", "validThrough": "2020-11-09T23:59:59+0000"}