{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13968", "minValue": "8114", "unitText": "YEAR", "value": "£8,114 - £13,968 per annum, pro rata"}}, "datePosted": "2020-10-30T17:15:30+0000", "description": "&lt;p&gt;We have exciting opportunities in the Trust for Customer Service / Administrator Apprentices. You will play an active part in the effective running of the roles that supports the clinical staff to give compassionate care. Without these roles the clinical staff are unable to provide the safe care in the trust. T&lt;span&gt;he post holder will provide general administrative and customer service duties through the course of the apprenticeship to colleagues, patients and visitors to CHFT’&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Roles can include: Working in a reception area; Booking appointments; Supporting a team with the administration aspects; Secretarial responsibilities; Data inputting.&lt;/p&gt;\n&lt;p&gt;You may be based at the Calderdale Royal Hospital/Huddersfield Royal Infirmary but will be required to work across the two sites subject to service needs. Some of the roles may include working in an outlaying clinic in the community. We are a hardworking Trust with a strong sense of teamwork, and you must be able to show that you are able to work as part of a team. You will also need to possess excellent communication skills. The role will include a variety of skills and this will vary depending on the vacancy at the time.&lt;/p&gt;\n&lt;p&gt;Please provide information in support of your application relating to your skills, experience and knowledge. You should relate these to the essential and desirable requirements of the post. Therefore, you should look at the person specification and tell us how you think you meet the criteria providing examples as necessary. The information you provide can include details of work experience, courses, hobbies or voluntary work.&lt;/p&gt;\n&lt;p&gt;The Apprenticeship programme offers a full time (37.5 hours per week) 18 months fixed term contract which in most cases leads to a permanent position with Calderdale &amp; Huddersfield NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Apprenticeship Scheme is run in conjunction with a training provider to ensure that you are supported through a high-quality training programme. You will be required to undertake the Intermediate Apprenticeship in Customer Service Level 2. Therefore, if you already possess this qualification you will not be eligible for the funding.&lt;/p&gt;\n&lt;p&gt;Candidates must have a genuine interest in being an apprentice in the Trust and ideally possess GCSE’s or equivalent in English and Mathematics grade 3 -9, (A*-D, or equivalent) or have relevant experience to show good English, Maths and communication skills which can be demonstrated on the application form and at interview. You must take responsibility for your own learning.&lt;/p&gt;\n&lt;p&gt;If you are shortlisted you will be required to attend an interview to check your suitability and commitment to commence an apprenticeship, if suitable, you will be placed on a Talent pool and then your details will be passed to the managers who have the vacancies as they occur. You will then be interview by the manager of the department, bear in mind you may be interviewed by more than one manager. Successful applicants will then be processed to commence work in the successful role. We have Customer Service Vacancies that occur on a frequent basis.&lt;/p&gt;\n&lt;p&gt;Interviews will take place remotely on Teams week commencing 23rd November 2020&lt;/p&gt;\n&lt;p&gt;Non-clinical Apprentices are paid a training wage of £8,114 increasing to £13,968 after successful completion of probationary period.&lt;/p&gt;\n&lt;p&gt;Please note:&lt;br /&gt;There is an eligibility criterion for government funded apprenticeships schemes that applies and therefore applicants must be aged 16 or over and have been resident in the UK/EU for the last three years. You must not hold a degree, level four qualification or above in a Business Administration and/or Customer Service related subject.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMichelle WardJob titleProgramme Lead for Non-Clinical ApprenticeshipsEmail addressmichelle.ward@cht.nhs.ukTelephone number07798662130Additional contact information&lt;/p&gt;\n&lt;p&gt;Michelle Ward, Programme Lead for Non-Clinical Apprentices,&lt;/p&gt;\n&lt;p&gt;michelle.ward@cht.nhs.uk / 07798662130&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield", "postalCode": "HD3 3EA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6555", "longitude": "-1.81634"}}, "title": "Customer Service / Administrator Apprentice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251045", "validThrough": "2020-11-08T23:59:59+0000"}