{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata, per annum"}}, "datePosted": "2020-10-23T14:46:15+0100", "description": "&lt;p&gt;Exciting opportunity for a recently or newly qualified Band 5 Speech and Language Therapist to work alongside more experienced Speech &amp; Language Therapists in providing a specialised service to patients with acquired neurological communication and swallowing problems in a Community setting. this is a permanent, part time position at 15 hours per week. There are fabulous opportunities for professional development and support from the experienced Adult Team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide assessment, diagnosis, treatment planning and appropriate intervention, including discharge, for adults with communication and / or swallowing difficulties so as to achieve optimum potential for each individual.&lt;/li&gt;\n&lt;li&gt;To develop and monitor appropriate therapy programmes from a range of options&lt;/li&gt;\n&lt;li&gt;To provide specialised advice to relatives and other health professionals to optimise the communication environment.&lt;/li&gt;\n&lt;li&gt;To continually process patient responses and continuously make fine adjustments to interactions and treatment programmes&lt;/li&gt;\n&lt;li&gt;To provide ongoing training and support for other involved professionals to enable them to implement agreed intervention targets and strategies as appropriate to the caseload&lt;/li&gt;\n&lt;li&gt;To offer advice, support and resources to families and carers to enable them to be actively involved in the therapy programme.&lt;/li&gt;\n&lt;li&gt;To provide training, supervision and support for Speech and Language Therapy Assistants, volunteers and others involved in the treatment and/or care of adults on the caseload&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please refer to the Job Description and Person Specification for all essential and desirable criteria required for the role.&lt;/p&gt;\n&lt;p&gt;This post is for 15 Hours/Week&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Jane Giles Job title Head of Service: Speech &amp; Language Therapy&lt;/p&gt;\n&lt;p&gt;Email addressjane.giles6@nhs.net Telephone number0191 2823085&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Frauke Buerk - 0191-2138841 - Frauke.buerk@nuth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 03 Campus for Ageing and Vitality", "postalCode": "NE4 6BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9744", "longitude": "-1.64304"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240998", "validThrough": "2020-11-06T23:59:59+0000"}