{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 per annum"}}, "datePosted": "2020-11-04T09:27:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Newly Qualified Mental Health Nurse Practitioner &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: Up to £24.907 pro rata&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;School hour working options including term time working, will be reviewed per application&lt;/p&gt;\n&lt;p&gt;Location: Southlands School, Lymington&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Would you like to be part of a rapidly developing service committed to improving the lives of children and young people and their families?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen at Southlands School, Lymington and we are now recruiting for a dedicated passionate individual to join our clinical team as the Newly Qualified Mental Health Practitioner.&lt;/p&gt;\n&lt;p&gt;Southlands School is a 38-52-week residential educational provision for young people aged 7-19 with a diagnosis of Autism Spectrum Disorder and other associated difficulties. The school is part of Cambian Group, and is the UK’s largest provider of specialist services in children’s residential care, education, mental health rehabilitation and learning disabilities, working alongside a network of 7 schools and colleges in the south of England.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic and enthusiastic individual to work collaboratively within our existing Wellbeing Clinical Team. The team consists of Consultant Psychiatrist, Clinical Psychologist, Assistant Clinical Psychologist, Speech and Language Therapy, Occupational Therapy, Holistic therapist and School Nurse. The role will allow the successful candidate to increase and expand their knowledge of working with children and young people using skills to support the mental health needs of our children through either direct or indirect therapeutic interventions.&lt;/p&gt;\n&lt;p&gt;Your skills and knowledge will be welcomed at Southlands to help support our Care and Education teams in supporting children with various mental health diagnosis through induction training, workshops, care planning, direct and indirect work, and working closely with the multidisciplinary team in delivering evidenced based interventions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Therapeutic Assessment and Intervention Opportunities;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assess and deliver evidence-based interventions for children and young people experiencing mild to moderate mental health difficulties.&lt;/li&gt;\n&lt;li&gt;Work in effective, partnership with children, young people, their families and their educators in the development of plans for the intervention and agreed outcomes.&lt;/li&gt;\n&lt;li&gt;Support and empower children, young people, and their parents/carers to make informed choices about the interventions being offered.&lt;/li&gt;\n&lt;li&gt;Undertake and record accurate assessments of risk and operate clear risk management processes in line with Cambian procedures including the safeguarding protocols of the educational setting and Local Safeguarding Board guidance.&lt;/li&gt;\n&lt;li&gt;Practice, evidence and demonstrate an ability to manage one’s own caseload .&lt;/li&gt;\n&lt;li&gt;Contribute to reports for young people’s progress at annual review and interim reviews.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for Newly Qualified Mental Health Practitioner who has:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RMN / RNLD valid PIN&lt;/li&gt;\n&lt;li&gt;Be patient centred and have a commitment to delivering high quality care&lt;/li&gt;\n&lt;li&gt;Good decision-making skills&lt;/li&gt;\n&lt;li&gt;Excellent organisational capacity&lt;/li&gt;\n&lt;li&gt;Effective communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Beneficial&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;CAMHS experience&lt;/li&gt;\n&lt;li&gt;Working with young people with Autism Spectrum Disorder&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we will give you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary&lt;/li&gt;\n&lt;li&gt;25 days annual leave plus bank holidays - pro rata for part time&lt;/li&gt;\n&lt;li&gt;Supervision and preceptorship&lt;/li&gt;\n&lt;li&gt;Enhanced disclosure cost covered by Cambian&lt;/li&gt;\n&lt;li&gt;Free onsite parking&lt;/li&gt;\n&lt;li&gt;Free meals when on duty&lt;/li&gt;\n&lt;li&gt;Online benefits and cashback rewards&lt;/li&gt;\n&lt;li&gt;Comprehensive induction and commitment to ongoing training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful candidates will have to meet the person specification in order to be offered this post. Cambian is committed to Safeguarding and protecting the young people and service users within our care. All candidates will be subject to an enhanced DBS check and reference checks. Cambian is an equal opportunities employer.&lt;strong&gt;&lt;em&gt; Cambian can consider flexible working patterns, part-time working.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please click&lt;strong&gt;Apply&lt;/strong&gt;to proceed&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130935.png", "name": "Cambian Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lymington, Hampshire", "postalCode": "SO41"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7604", "longitude": "-1.55263"}}, "title": "Newly Qualified Mental Health Nurse Practitioner - Southlands School", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255180", "validThrough": "2020-11-18T23:59:59+0000"}