{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-16T13:00:17+0100", "description": "&lt;p&gt;Healthy Minds Lincolnshire provides early and preventative emotional wellbeing interventions for children, young people and their families across Lincolnshire. First established in 2017, the service has provided intervention, advice or guidance to over 5,500 children &amp; young people across the County.&lt;/p&gt;\n&lt;p&gt;The service also staffs the Here4You Line – a supportive phone line for professionals, children, young people and their families, which provides signposting, advice and self-referral.&lt;/p&gt;\n&lt;p&gt;We are advertising for an exceptional Clinical Lead Practitioner to join the team. The successful applicant will support the Team Co-ordinator to lead the team and provide sound clinical leadership to the Practitioners within the service.&lt;/p&gt;\n&lt;p&gt;This role will include support via liaison, consultation, supervision and training to education providers and universal services. This will involve working in a co-ordinated way with the other Clinical Lead Practitioners within the service to develop and deliver educational packages to professionals within the school environment and the wider community.&lt;/p&gt;\n&lt;p&gt;The successful applicant may also be required to provide group and individual therapy sessions for children &amp; young people and their parents/carers. They will also co-ordinate groups and workshops within the team alongside the Team Co-ordinator and Band 5 Practitioners.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be able to provide excellent clinical &amp; management supervision to Band 4 and Band 5 Practitioners within the team, with the ability to inspire and develop staff to their full potential.&lt;/p&gt;\n&lt;p&gt;The successful applicant will need to have experience of managing staff, experience of producing and delivering teaching sessions to professionals as well as knowledge and experience of delivering therapeutic interventions. The successful applicant will be expected to be familiar with clinical and operational policies and procedures including; safeguarding, HR and complaints.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for motivated and highly organised individuals with a passion for children and young people’s emotional wellbeing to help shape the Healthy Minds Lincolnshire service.&lt;/p&gt;\n&lt;p&gt;The successful applicant will need to be able to travel around this large rural county and will need to be able to work flexibly according to the needs of the service.&lt;/p&gt;\n&lt;p&gt;As well as having skills and knowledge in mental health care, it is possible that the successful applicant will have experience of working in education and/or social care.&lt;/p&gt;\n&lt;p&gt;There are well established links between all of the community based Children and Young People’s Mental Health Services and partner organisations.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Len Medlock Centre, Boston", "postalCode": "PE21 8YB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.977", "longitude": "-.028501"}}, "title": "Clinical Lead Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230288", "validThrough": "2020-11-08T23:59:59+0000"}