{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T14:15:54+0000", "description": "&lt;p&gt;The Northern Centre for Cancer Care is one of the country’s leading cancer treatment facilities located in a purpose built Centre at Freeman Hospital, providing radiotherapy services to the population of the North East.&lt;/p&gt;\n&lt;p&gt;The Radiotherapy Department benefits from state of the art equipment which includes 2 Novalis Truebeam STX linacs with stereotactic capability, 4 Varian TrueBeam linacs, and 2 Tomotherapy units . The Imaging section comprises of 2 Siemens CT scanner with ProSoma virtual simulation and a dedicated Siemens Magnetom Espree 1.5T MRI scanner. The Centre is committed to delivering a high quality service, maintaining the highest specification equipment and contributing to radiotherapy research and development.&lt;/p&gt;\n&lt;p&gt;Applications are invited from well-motivated and enthusiastic, experienced diagnostic radiographers with experience working in MRI within radiology departments.&lt;/p&gt;\n&lt;p&gt;The post-holder will be working on our newly replaced MRI scanner supporting both the Diagnostic Service and the Radiotherapy Planning Service. It will be expected that they will be an integral part of the pre-treatment team providing MRI radiotherapy scans that will be used to aid in the accurate planning of radiotherapy treatment. They will be expected to deliver the highest quality of technical practice, patient care and ensure workload targets are achieved.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to have a flexible approach to working hours to accommodate service demands.&lt;/p&gt;\n&lt;p&gt;Opportunities for post-graduate study are encouraged and supported.&lt;/p&gt;\n&lt;p&gt;Full time 37 hours 30 minutes/week&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 01 Freeman Hospital", "postalCode": "NE7 7DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0028", "longitude": "-1.59341"}}, "title": "Senior Diagnostic Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256181", "validThrough": "2020-11-17T23:59:59+0000"}