{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890.00 to 44,503.00"}}, "datePosted": "2020-10-23T12:00:44+0100", "description": "&lt;p&gt;.&lt;/p&gt;\n&lt;p&gt;Band 7 Infection Prevention &amp; Control&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Kent and Medway CCG is going through a very exciting and invigorating period of change as we develop an Integrated Care System. This role is fundamental to the support and delivery of the Infection Prevention and Control agenda across all care providers, including primary care and care homes, working collaboratively with the local authority.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have an exciting opportunity for someone who would want to develop as an Infection Prevention and Control Specialist If you are enthusiastic, motivated, looking to expand your experience and leadership skills with the ability to work autonomously but in close liaison with a team within the world of Infection Prevention and Control this may be a role for you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will need to be adaptable and proactive, with at least five years of post-registration nursing experience, ideally with recent experience of working in infection prevention and control and a recognised teaching qualification.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you do not have a specialist qualification in infection prevention and control, health protection or a related subject but would be interested in this role please make contact to discuss what support may be available to develop into the role. There will be opportunity for mentoring and supervision to develop within the CCG.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We value enthusiasm and a commitment to best practice and will support your professional development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;This role will be employed by Kent and Medway CCG but the office base can be negotiated and some travel across Kent and Medway will be required. &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; For further details please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Gail Locock Director for Infection Prevention Control on 07539 854941&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Joanne Green Head of Infection Prevention and Control on 07468 700123&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Kent and Medway Clinical Commissioning Group (formerly known as NHS Swale CCG)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Medway", "postalCode": "TN23 1PP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1477", "longitude": ".875876"}}, "title": "IPC Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240412", "validThrough": "2020-11-06T23:59:59+0000"}