{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-28T15:14:27+0000", "description": "&lt;p&gt;We’re offering an opportunity to join an organisation that really does make a difference for people, help improve health services within our area and work with inspirational and professional people. Our vision to commission and enable the delivery of high quality patient centred healthcare is being achieved through our values of compassion, honesty, inclusivity, fairness and ambition.&lt;/p&gt;\n&lt;p&gt;We commission healthcare services for a population of nearly 546,000 people in West Hampshire. The health services we buy are provided by hospitals in Southampton, Bournemouth, Salisbury, Basingstoke, Portsmouth, Poole, Andover and Winchester, as well as within our local community. This includes rehabilitation care, emergency care, mental health and learning disability services and care for non-life threatening illnesses and injuries. In addition, we buy primary care services which are provided by our 49 GP surgeries. We also work closely with our partners in health and care services to deliver joint priorities to transform outcomes, improve satisfaction of patients and communities, and deliver financial sustainability.&lt;/p&gt;\n&lt;p&gt;We are an ambitious organisation with big plans for the health of local people and are looking for equally ambitious people to join us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you need a better work/life balance?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to keep up your professional skills?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to gain experience in new areas?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How do you feel about working office hours, without spending all day in an office?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an opportunity for a candidate who has ambition to work in a unique environment, using their assessments skills to support some of the most vulnerable individuals in the community. You will work in close partnership with Local Authorities, NHS colleagues and care providers, producing excellent reports and ensuring the provision of high quality care to individuals who are eligible for NHS funded care.&lt;/p&gt;\n&lt;p&gt;We currently have a number of vacancies within our service and are looking for motivated, enthusiastic and forward thinking health and social care professionals to join the team. The role involves; assessing eligibility criteria under the NHS National Framework for Continuing Healthcare and Funded Nursing Care (revised 2018), planning and commissioning packages of care (including Personal Health Budgets), supporting individuals, their families and health professionals through the Continuing Healthcare process and reviewing eligibility/packages of care.&lt;/p&gt;\n&lt;p&gt;There will be a choice of 3 localities to work in :-&lt;/p&gt;\n&lt;p&gt;North and Mid Hampshire&lt;/p&gt;\n&lt;p&gt;South West Hampshire ( based at Bartley)&lt;/p&gt;\n&lt;p&gt;South East Hampshire ( based at Fareham)&lt;/p&gt;\n&lt;p&gt;The successful candidates will have excellent communication and assessment skills; be resilient, able to work autonomously but also work as part of a team. Previous experience with CHC framework would be desirable but not essential as we can provide a tailored induction and training programme for you. You will be fully supported through 1:1 supervision, a robust induction plan, and a friendly supportive team. This is a community based post and post holders will be expected to be able to travel across their designated locality area.&lt;/p&gt;\n&lt;p&gt;Please note that holding a valid driving licence is essential for this role.&lt;/p&gt;\n&lt;p&gt;We are able to offer excellent benefits for our staff including generous leave arrangements, free car parking, an excellent pension scheme, opportunities for further training and development and a commitment to our own staff health and wellbeing.&lt;/p&gt;\n&lt;p&gt;More details are provided in the job description but if you would like further information contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North and Mid Hants Locality&lt;/strong&gt;: Ana Pereira, Operational Manager Email : a.pereira@nhs.net Tel :07780955378&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;South West Locality&lt;/strong&gt; : Meriel Chamberlain, Operational Manager Email: meriel.chamberlain1@nhs.net Tel:07780 955 983&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;South East Locality&lt;/strong&gt; : Simon Mkwananzi , Operational Manager Email simon.mkwananzi1@nhs.net Tel : 07585 404 926&lt;/p&gt;\n&lt;p&gt;Due to the COVID pandemic this role will be working from home initially. This position will be kept in review in line with CCG policy. Interviews for this post will take place virtually via Microsoft Teams.&lt;/p&gt;\n&lt;p&gt;You should note that we generally appoint at the first pay point of the scale indicated in the advert, unless you are transferring from another NHS organisation when other arrangements apply.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be subject to a six month probationary period.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS West Hampshire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128558"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hampshire", "postalCode": "SO50 5PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9674", "longitude": "-1.35105"}}, "title": "CHC Specialist Practitioner.", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247137", "validThrough": "2020-11-12T23:59:59+0000"}