{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-04T15:01:00+0000", "description": "&lt;p&gt;Are you dynamic, self-motivated and looking for a new and exciting challenge that would, in these rapidly changing times, allow you to contribute to amongst other things, Urgent Public Health Covid research?&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to work in the NIHR Clinical Research Network: Greater Manchester Core Delivery Team who support local teams throughout Greater Manchester in being able to provide NIHR clinical trials to people across the region. We are looking for an organised individual with previous research and administration experience to join us as a Band 4 Senior Clinical Trials Administrator.&lt;/p&gt;\n&lt;p&gt;Whilst the post is based at Manchester University NHS Foundation Trust, you could be assigned to any of the teams, NHS and non-NHS, across our network footprint, depending on where support is most needed. Often this involves working across different teams in the same week. You must, therefore, be willing and able to travel between sites.&lt;/p&gt;\n&lt;p&gt;Good knowledge of the clinical trials process is essential to work effectively within this role as each team you assist will value and be relying on your expert support. This role provides a great opportunity to develop your experience of trials administration through the variety of trials and disease area&#39;s covered.&lt;/p&gt;\n&lt;p&gt;Full time/Part time, secondment hours and short term contract positions will also be considered for this post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note previous applicants need not apply.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We strongly advise an informal visit or contact be made with either the Matron or the Research Team listed below.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSam ChilcottJob titleCRN GM Delivery Team MatronEmail addresssamantha.chilcott@mft.nhs.ukTelephone number07977015659Additional contact information&lt;/p&gt;\n&lt;p&gt;Louise Woodhead- Senior Research Nurse, louise.woodhead@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Jo Henry-Senior Research Nurse, jo.henry@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Hospitals NHS Foundation Trust, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Network Wide Senior Clinical Trials Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256335", "validThrough": "2020-11-17T23:59:59+0000"}