{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33243", "minValue": "5000", "unitText": "YEAR", "value": "£33,243.78 plus £5,000 Welcome Bonus"}}, "datePosted": "2020-10-14T10:11:09+0100", "description": "&lt;p&gt;&lt;em&gt;Ready for the recognition&lt;em&gt;and rewards you deserve?&lt;/em&gt;&lt;/em&gt;We don’t just talk about putting employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort. So we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt;Our service is based on the Norfolk/Suffolk border and provides a range of assessment, treatment, rehabilitation and specialist residential services to over 90 adults with a learning disability in a range of different environments suited to their individual needs including medium, low secure and rehabilitation.&lt;/p&gt;\n&lt;p&gt;In addition to a learning disability, many of our patients have complex needs including forensic histories, mental illness, ASC and Personality Disorders. Most patients are detained under the Mental Health Act 1983.&lt;/p&gt;\n&lt;p&gt;The role:&lt;/p&gt;\n&lt;p&gt;We have exciting career opportunities to work as an integral member of a multi-disciplinary team supporting adult patients who have Learning Disabilities combined with enduring mental illness. Working within our hospitals across south Norfolk and north Suffolk, you will make an effective contribution to providing high quality care within a medium secure forensic setting.&lt;/p&gt;\n&lt;p&gt;Assistance with relocation and accommodation can be offered.&lt;/p&gt;\n&lt;p&gt;Our RNLD/RMN role involves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing high quality care in acute wards, low and medium secure wards, with patients suffering from Personality Disorders and Enduring Mental Illness; and acute episodes of illness&lt;/li&gt;\n&lt;li&gt;Developing therapeutic relationships to optimise patient engagement&lt;/li&gt;\n&lt;li&gt;Following all codes of conduct, standards and legislation, respecting the rights of others and promoting ethical practice&lt;/li&gt;\n&lt;li&gt;Contributing to patient assessments, compiling a plan of care alongside the individual, and monitoring patient progress&lt;/li&gt;\n&lt;li&gt;Mentoring and supporting student nurses and other members of the team&lt;/li&gt;\n&lt;li&gt;Promoting professional development within the team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To be successful as a RNLD/RMN, you’ll need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A RMN or RNLD qualification&lt;/li&gt;\n&lt;li&gt;The ability to assess and teach junior staff&lt;/li&gt;\n&lt;li&gt;A proven ability to co-ordinate care, prioritise tasks and manage Health &amp; Safety issues&lt;/li&gt;\n&lt;li&gt;The drive to learn and develop&lt;/li&gt;\n&lt;li&gt;A commitment to patient-centred care and to values-based and evidence-based practice&lt;/li&gt;\n&lt;li&gt;A flexible, positive, team-orientated approach.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/li&gt;\n&lt;li&gt;Extra Service Annual leave awards&lt;/li&gt;\n&lt;li&gt;Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/li&gt;\n&lt;li&gt;An employee assistance programme&lt;/li&gt;\n&lt;li&gt;Free meals/refreshments when on duty&lt;/li&gt;\n&lt;li&gt;Free car parking&lt;/li&gt;\n&lt;li&gt;NMC Payment in full&lt;/li&gt;\n&lt;li&gt;Sign on bonus - £5000.00 Welcome to Priory&lt;/li&gt;\n&lt;li&gt;Relocation support (including payment for accommodation or moving costs), paid as a lump sum\n&lt;ul&gt;\n&lt;li&gt;Moving less than 100 miles up to £2,000&lt;/li&gt;\n&lt;li&gt;If more than 100 miles up to £4,000&lt;/li&gt;\n&lt;li&gt;To be repaid if individual does not complete probation &amp; leaves&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;Payment into the pension scheme&lt;/li&gt;\n&lt;li&gt;CPD top up&lt;/li&gt;\n&lt;li&gt;Donation to a charity of their choice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;Disclosure&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Palgrave", "postalCode": "IP22 1BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.357", "longitude": "1.08167"}}, "title": "Registered Nurse/RMN/RNLD with £5k Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225620", "validThrough": "2020-11-13T23:59:59+0000"}