{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-09-28T10:31:14+0100", "description": "&lt;p&gt;North Yorkshire and York Child and Adolescent Mental Health Service (CAMHS) is seeking to recruit a full time CAMHS Practitioner to work within the North Yorkshire Youth Justice Service, covering the Harrogate, Craven and Hambleton, Richmond areas.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to offer assessment and intervention to children and young people open to Youth Justice Service that are in need of additional support around their mental health wellbeing. This role will involve working alongside Youth Justice practitioners to ensure the children and young people in service are able to access appropriate health support. Working within a systemic and holistic framework you will undertake needs led, evidence based, assessments and therapeutic interventions with children and young people, their families and carer. You will play an integral role within the Youth Justice Teams and be an active and valued member of the team. You will be provided with support from both YJS and CAMHS, including joint supervision and opportunities for training and development from both NYCC and TEWV.&lt;/p&gt;\n&lt;p&gt;North Yorkshire Youth Justice Service (YJS) is part of the wider Children and Families Service and sits within the Early Help Service, The YJS comprises staff from the Police, the National Probation Service, Children’s Social Care, Health and Education, supported by committed and skilled volunteers. The key objectives of the Youth Justice Service are to reduce youth crime, protect the public from serious harm, and safeguard the welfare of young people. In partnership with the Early Help Service YJS provide preventative and diversionary services to help vulnerable young people stay out of trouble, primarily through the Youth Outcomes Panel (YOP): a multi-agency partnership with North Yorkshire Police and York Youth Justice Service. If a young person is convicted by a Court and placed under our statutory supervision, YJS assess their individual needs and risks, and provide a tailored programme of support and change, including support around mental health.&lt;/p&gt;\n&lt;p&gt;Your role will include working closely with the families of young people who offend, and with local schools and other services, to help the young people to get their lives back on track and achieve positive outcomes.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint an experienced practitioner who is highly motivated and enthusiastic about working with this client group and who will come with a range of transferrable skills. In exchange you will be well supported within a friendly and supportive team, with continuing opportunities for your ongoing professional development&lt;/p&gt;\n&lt;p&gt;We are passionate about the delivery of high quality service that promotes and improves the well-being of children and young people .&lt;/p&gt;\n&lt;p&gt;Please note we require all candidates to be NMC/HCPC registered with a protected professional title (Nurse, Social Worker, Occupational Therapist).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gill Gentle, Team Manager Harrogate CAMHS&lt;/p&gt;\n&lt;p&gt;01423 726900&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dragon Parade Clinic, Harrogate", "postalCode": "HG1 5BY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9956", "longitude": "-1.53484"}}, "title": "CAMHS Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916202133", "validThrough": "2020-11-12T23:59:59+0000"}