{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-20T11:49:15+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;We have an exciting opportunity within the Workington Community nursing ICC team for a Band 6 Senior Community Nurse to join our team. &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;We would welcome applications from nurses who have substantial experience of working as a band 6 nurse or above who are looking for a new challenge. &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Workington is an exciting place to work as part of a developing Integrated Care Community. We are looking to appoint an enthusiastic and motivated senior community nurse, who is committed to working in an evolving community nursing service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be required to: &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Provide quality care to support patients with complex needs within the community setting.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Support the team to implement high quality of care working in partnership with patients with complex health needs.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Support the Team Lead to ensure high standards of care is delivered, maintained, and audited.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Support the Team Lead to provide clinical leadership and management of the clinical caseload for the team. &lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Be responsible for the allocation, assessment, planning, implementation and evaluation of programs of care for patients. &lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Demonstrate procedures to and supervise unqualified and qualified staff. &lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To have excellent communication skills.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To work collaboratively with the wider MDT teams within the Integrated Care Community.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To support the movement of patients between the community in-patient beds, secondary care and community teams where appropriate.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To work as part of a rapid response service to patients within the community to ensure safe and effective assessment of patients presenting with clinical deterioration. Therefore, reduce hospital admissions, and facilitate early hospital discharges.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To implement preventative care provision to reduce the risk of patients within the community reaching crisis point.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To lead the ICC by providing support as professional of the day to ensure patients’ needs are met in the most effective way.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To be actively involved in change management within the ICC.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Support the Team Lead with appraisals and management supervision of other staff.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;Close working relationships must be developed in order to support the case management of patients within the community. The district nursing team visit patients in their own homes, as well as in residential care settings, providing a range of clinical skills, including holistic assessment, intravenous therapy, vaccinations, complex wound care, health promotion, continuing health care assessment, case management, palliative care, continence management and assessment for specialist equipment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post includes evening, weekend and some bank holiday working; therefore a flexible approach is essential. This post may also require some night shift working.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact District Nursing Sisters Melissa Norman on 01900 705225/ 07899068988 &lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;melissa.norman@ncic.nhs.uk&lt;/span&gt;&lt;/span&gt; or Louise Freeman on 07901225116 &lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;louise.freeman@ncic.nhs.uk&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Healthcare Professionals returning to practice, moving into new roles or changing clinical environments, may access an agreed preceptorship period.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Please ensure that you document evidence of meeting all the essential criteria in the supporting information.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;If sufficient response is received this post could be closed earlier than the specified closing date, please apply as soon as possible to ensure that your application is considered.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The Trust is committed to safeguarding adults and children therefore if the post is subject to the Rehabilitation of Offenders Act (ROA) 1974 (Exceptions) Order 1975 (as amended) the successful candidate(s) will be subject to a criminal records check with the Disclosure and Barring Service (DBS). The cost of the DBS must be met by the successful candidate(s) through salary deduction. DBS charges are as follows &lt;strong&gt;if applicable to the post:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Standard Check: £26 + Administration cost of £4.20 = deducted at £10.20 from 1st month salary and £10 deducted from salary over following 2 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Enhanced Check: £44 + administration cost of £4.20 = £15.20 deducted from 1st month salary and £11 deducted from salary over following 3 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of the one of the largest employers in the UK NCIC future employees will have also access to the following benefits.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A lease car may be available for this position; further details will be provided upon appointment if applicable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;27 day holiday scheme rising to 33 after 10 years &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Flexible working Scheme &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Excellent opportunities for development &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Competitive NHS Pension scheme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Access to NHS discounts with retailers and leisure companies&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;EAP (Employee Assistance Programme) a free, confidential counselling and information service to assist with personal or work-related problems&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These schemes are subject to availability&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Workington, Cumbria", "postalCode": "CA14 2RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6428", "longitude": "-3.55147"}}, "title": "Senior Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234250", "validThrough": "2020-11-22T23:59:59+0000"}