{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "63751", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 per annum"}}, "datePosted": "2020-11-05T12:16:22+0000", "description": "&lt;p&gt;&lt;strong&gt;All staff are eligible to apply however staff must ensure they have the permission for a secondment application from their substantive line manager.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Programme Lead to lead on the Enabling Staff Movement Project on behalf of HEE. Working closely with the Improving Employment Models Lead at NHSI you will represent HEE and the Associate Director on this important work; ensuring that policy and practice are aligned to the NHS Long Term Plan and the NHS People Plan in the area of Enabling Staff Movement across the NHS. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;You will work with several collaborators from across NHSI, NHSX, NHS Digital, the NHSBSA, NHS Employers, trade union colleagues and a range of workforce leaders at Regional, Integrated Care System (ICS) and Trust level to develop and adopt improvements in the experience for staff moving around the NHS during their careers.&lt;/p&gt;\n&lt;p&gt;You will have experience of employment policy and practice in operations across the NHS and extensive experience of working on large scale, complex systems change programmes. Experience working on national programmes of work would be advantageous. &lt;br /&gt;&lt;br /&gt;We are looking for someone who has a unique mix of skills and interests, this includes a keen interest in organisational design, an ability to help change cultures in NHS organisations and a passion to improve workforce/HR IT systems.&lt;/p&gt;\n&lt;p&gt;In return you will get to work on a unique and diverse portfolio, be able to engage and influence policy, practice and people at a national, regional and local levels and support improvement initiatives that will help not only all NHS trusts, but all 1.3 million NHS staff.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;This is a key senior role within a national team and encompasses programme management and strategic planning as well as leading on key aspects of the wider national recruitment portfolio as required and associated programme activity.&lt;/p&gt;\n&lt;p&gt;Our Core Values are that everyone feels valued and respected and are included and involved in everything that affects them; are trusted to make decisions with clear reasons in order to be empowered to deliver; are committed to clear, effective communication, which is transparent and open when sharing information; takes pride and has integrity in everything we do and recognises that everyone has a significant contribution whilst taking personal responsibility and accountability for actions and behaviours.&lt;/p&gt;\n&lt;p&gt;Please note there will be an assessment immediately prior to the interview for these posts. Interviews will be conducted online via MS Teams or an alternative.&lt;/p&gt;\n&lt;p&gt;The posts are offered at any HEE office, however remote working will be the default position during the current COVID 19 Pandemic. This will be continually reviewed in line with HEE policy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants will commence at the bottom of Band 8c with a full-time starting salary of £63,751, with a pay step increase after 5 years’ service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For posts based in Inner London, the above salaries will include the additional supplement of 20% of basic salary, subject to a minimum payment of £4,473 per annum and a maximum payment of £6,890 per annum.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;All staff are eligible to apply however staff must ensure they have the permission for a secondment application from their substantive line manager.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close the advert early once a sufficient number of applications have been received.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jonathan Howes&lt;/p&gt;\n&lt;p&gt;jonathan.howes@hee.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National", "postalCode": "LS1 4PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7988", "longitude": "-1.55967"}}, "title": "Programme Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257613", "validThrough": "2020-11-19T23:59:59+0000"}