{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-05T11:00:11+0000", "description": "&lt;p&gt;Senior Statistician (Permanent), NHS Blood and Transplant&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary: Band 7 (£38,890 to £44,503 pa)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Location: Bristol (preferred), Cambridge or Oxford&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Do you want to join a large, enthusiastic team of statisticians who help to save and improve lives through analysis and research? The NHS Blood and Transplant (NHSBT) Clinical Trials Unit has a vacancy for a permanent Senior Statistician to join the team and help shape the development of the statistical service across a range of trials. We are UKCRC registered and conduct CTIMPs, non-CTIMPs, medical device trials and international trials across a broad clinical scope.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;NHSBT is a Special Health Authority within the NHS, responsible for optimising the supply of blood, organs, plasma and tissues and raising the quality, effectiveness and efficiency of blood and transplant services. A permanent vacancy has arisen for a Senior Statistician in the Statistics and Clinical Studies team, tenable at NHSBT’s offices in Bristol (preferred), Cambridge or Oxford.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; The Statistics and Clinical Studies team are a large, supportive team, with good development opportunities. We are engaged in novel design and analysis of clinical trials and other studies in organ and tissue donation and transplantation, blood donation and transfusion medicine.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; This post is an exciting opportunity for someone with an MSc/PhD in statistics or demonstrable equivalent post graduate experience in a statistical subject to be involved in extremely rewarding work in our Clinical Trials Unit. In this role you will be responsible for planning and managing the statistical aspects of several clinical trials, and involved in grant applications, study design, analysis and reporting. The post will involve collaborative work with CTU colleagues, clinicians and others working in organ transplantation, blood donation and haematology, and so the individual appointed will have excellent communication skills. The ability to work effectively to deadlines, both individually and as part of a team, is essential and previous experience of clinical trials would be an advantage.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The normal working hours for this role are 37.5 hours/week, core office hours (this can be discussed at interview).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information, please contact Helen Thomas, Head of Clinical Trial Statistics, NHSBT via email at: helen.thomas@nhsbt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This vacancy will close at 23:59 on 29th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews are expected to be held on 14th December 2020 (Subject to confirmation)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS34 8RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5061", "longitude": "-2.55128"}}, "title": "Senior Statistician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257333", "validThrough": "2020-11-29T23:59:59+0000"}