{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 per annum"}}, "datePosted": "2020-10-29T15:00:25+0000", "description": "&lt;p&gt;NHS Leadership Academy, North East and Yorkshire (NEYLA) is one of 7 regional leadership teams across England and is hosted by County Durham &amp; Darlington NHS FT on behalf of our NHS England and NHS Improvement. Our aim is to deliver on the NHS People Plan: Action for us all 20/21 and the newly launched NHS People Promise, resulting ultimately in improved healthcare for patients and communities in the North East and Yorkshire.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within our growing, high performing team for an experienced administrator to undertake a range of administration duties key to the achievement of the Academy’s objectives&lt;br /&gt;The successful candidate will be able to demonstrate: a commitment to inclusion; the ability to work with minimal supervision and will require a demonstrable ability to use initiative, prioritise workload and provide evidence of work programme completion.&lt;/p&gt;\n&lt;p&gt;Many personal development opportunities will be available and the role will allow exposure to leadership development, and access to a diverse, national network of individuals, organisations and agencies.&lt;/p&gt;\n&lt;p&gt;For informal enquires please contact Jackie Kerr, jackiekerr1@nhs.net &lt;br /&gt;Interview date: TBC via MS Teams&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Palatine House, Durham", "postalCode": "DH1 1TW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.7872", "longitude": "-1.53915"}}, "title": "Leadership Development Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248772", "validThrough": "2020-11-13T23:59:59+0000"}