{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-26T13:16:48+0000", "description": "&lt;p&gt;Would you like to join a newly re-forming team and help shape the way we work in the current climate? In this post there is such variety! There is chance to work with: anxiety of all different aetiologies, depression, psychosis, eating disorders, trauma survivors, emotional dysregulation, amongst other functional conditions as well as numerous and varied organic issues such as young onset dementia. The variety of clinical aetiology is then complimented by the manner in which we work; individually, with family and other caring ‘systems’, couples work, consultation with our MDT colleagues and we are looking to develop therapeutic groups to meet patient needs. The service has also recently expanded our repertoire of delivery to include remote appointments. The service has a good history of providing further CPD opportunities for dedicated clinicians looking to develop their skill sets through formal training and supporting individual clinician projects (for example, the delivery of Trust wide Equality and Diversity sessions to raise awareness of Transgender issues).&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a full time (37.5 hours per week) enthusiastic and motivated Specialist Clinical Psychologist / Counselling Psychologist / Practitioner Psychologist or Cognitive Behavioural Therapist to join our Stepped Care Therapy Team within Older Peoples’ Mental Health Secondary Care Services in Peterborough. The friendly team comprises of Clinical Psychologists, Occupational Therapist and Occupational Therapy Assistants. The team also regularly hosts placements for Occupational Therapy students and Trainee Clinical Psychologists predominantly from the University of East Anglia. We are a proactive team with a strong plan for the further development of the provision of psychology.&lt;/p&gt;\n&lt;p&gt;The Stepped Care Therapy Team links in with the Integrated physical and mental health neighbourhood teams, the Memory Assessment Service, Social Care Team, and Mental Health Reablement Team. The breadth of work is ideal for a newly qualified Clinical or Counselling Psychologist or a more qualified Cognitive Behavioural Therapist looking to broaden their skills.&lt;/p&gt;\n&lt;p&gt;The candidate’s role would include the provision of assessment, formulation and evidence-based intervention including, where appropriate, specialist neuropsychological assessment. There is an expectation that the post holder would provide supervision and consultation input for non-psychology colleagues. The role would involve multidisciplinary working with both mental and physical health staff. The ideal candidate will have a strong team work ethic, sense of accountability, accompanied by an ability to work under considerable pressure at times and have a passion for working with older people.&lt;/p&gt;\n&lt;p&gt;This post is open to professionals with the right attributes to enhance a team. There will also be opportunities to be involved in wider directorate endeavours. If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference for our community by supporting older people with functional and organic mental health needs then we want to hear from you. Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) provides integrated community and mental health, learning disability and social care services of the highest standard due to our continued commitment to quality and service improvement. We aim to support people of all ages to achieve the very best they can for their health and well-being.&lt;/p&gt;\n&lt;p&gt;To ensure that we achieve this goal we look to recruit candidates of a high calibre that share our passion for delivering excellent service user care, research and education. For part time posts the salary will be per annum pro rata.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Chantel Robinson -  Highly Specialist Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;07976 068443 - chantel.robinson@cpft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Pines, Peterborough", "postalCode": "PE2 7JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5546", "longitude": "-.270029"}}, "title": "Clinical/Counselling Psychologist or CBT Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242624", "validThrough": "2020-11-23T23:59:59+0000"}