{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-05T11:31:29+0000", "description": "&lt;p&gt;Aneurin Bevan University Health Board Theatres in Royal Gwent Hospital are seeking a self-motivated, dynamic and assertive Band 7 Anaesthetic Team Leader who will be a suitably registered Practitioner capable of taking charge in the clinical area. We have 13 theatres covering elective surgery in a variety of specialities including general surgery, urology, gynaecology, orthopaedics and ENT. The successful candidate will liaise closely with other team leaders within the suite and with team leaders running the nine bedded PACU which will be attached to the theatre suite. They will also be expected to participate in the theatre coordinators rota.&lt;/p&gt;\n&lt;p&gt;The candidate must be a first level registered nurse /ODP and hold a post graduate qualification in a relevant degree or be willing to work towards . It is essential to this role to be able to lead a team and have insight into team structure, dynamics and development. They must possess exceptional interpersonal, communication and organisational skills and have significant experience in managing a team. The ideal candidate should have substantial experience at Band 6 in a similar clinical environment and be a highly motivated person with good communication and leadership skills. You will be expected to support the Senior Nurse and Directorate Manager in development of the Anaesthetic team to support ABUHB in providing safe, quality patient care whilst also meeting the requirements of clinical futures.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Judith Willis - Senior Nurse&lt;/p&gt;\n&lt;p&gt;Judith.Willis@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01633 234207&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Gwent Hospital, Newport", "postalCode": "NP20 2UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5798", "longitude": "-2.99816"}}, "title": "Team Leader Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257470", "validThrough": "2020-11-19T23:59:59+0000"}