{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-02T17:01:23+0000", "description": "&lt;p&gt;&lt;strong&gt;East Suffolk and North Essex Foundation trust (ESNEFT) – Pathology – Phlebotomy Vacancies&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Quality, Compliance, and Customer Focused&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Location: Based at Colchester General Hospital&lt;/p&gt;\n&lt;p&gt;Hours: 21 hours per week&lt;/p&gt;\n&lt;p&gt;Salary: £18,005 - £19,337 pro rata (£9.21 ph - £9.89 ph) depending on previous experience&lt;/p&gt;\n&lt;p&gt;Contract: Permanent (pending probation period).&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;ESNEFT - Pathology services are a partnership of laboratories based at Colchester and Ipswich Hospitals. Our vision is to deliver innovative, high-performing pathology that is focussed on our customers and delivers high quality and fully compliant services.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Our service is clinically led and designed to achieve the benefits of scale that can be achieved by the hospitals working together, while remaining close enough to our customers to meet their needs and support the excellent clinical care provided by our hospitals.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We are committed to attracting and retaining the best pathology staff and if you want to work with us to develop your own career and help us achieve our vision then we would like to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We require phlebotomists to work in the Colchester area – working between the wards at Colchester General Hospital, the blood clinic at Colchester General and our new service at the Primary Care Centre, Turner Road.&lt;br /&gt;We are looking for reliable, friendly, hardworking staff who thrive in a busy, but rewarding environment. Previous experience with the public in either healthcare or customer services is beneficial.&lt;br /&gt;&lt;br /&gt;Applicants who present a professional appearance and caring attitude who put patients at the heart of what they do are actively encouraged to apply. An initial training period from Monday to Friday will be required for all new members of staff and will take place at the Colchester Hospital site.&lt;br /&gt;The role.&lt;br /&gt;We are looking for a healthcare professional who understands the changing services of pathology and represent the service going forward.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder must be able to:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 Work every other weekend&lt;br /&gt;2 Work in the hospital ward environment with patients who may be severely debilitated&lt;br /&gt;3 Adhere strictly to established protocols and trust policies&lt;br /&gt;4 Have excellent work attendance and good time-keeping&lt;br /&gt;5 Provide a caring and professional service for users&lt;br /&gt;6 Maintain high standards of professional appearance and demonstrate the “OAK” values held by the trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role involves weekday and weekend working. All phlebotomy staff are required to participate in the cover of bank holidays on a rota basis. Flexible working to cover short notice absence will be a huge advantage. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working patterns vary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact Jacqueline Royle (Phlebotomy Supervisor) on 01206 742202 for further information&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Based at Colchester General Hospital, Colchester", "postalCode": "CO4 5JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9069", "longitude": ".903042"}}, "title": "Phlebotomist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252979", "validThrough": "2020-11-15T23:59:59+0000"}