{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-10-26T15:00:26+0000", "description": "&lt;h1&gt;&lt;strong&gt;Deputy Head of Corporate Governance - B8a&lt;/strong&gt;&lt;strong&gt;(maternity cover)&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for an able, enthusiastic and well organised governance professional to join the corporate governance team here at the RUH to provide maternity cover as Deputy Head for a period of 12 months.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful applicant will work closely with the Chair, Chief Executive and the Head of Corporate Governance to support our frontline teams, managers and the Board to ensure that the Trust continues to be well run and that it meets all its governance, regulatory and statutory obligations. The postholder will particularly lead on managing the interface between the organisation, the Council of Governors and the Foundation Trust membership. They will support the Governors in fulfilling their role of holding the Board to account, and ensure that the voice of members, as users of our services and local residents, is heard. The postholder will also have line management responsibility over two members of staff and will be expected to contribute to the overall development of the whole team. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful applicant will have a good knowledge of corporate governance, probably gained within the NHS, other parts of the public sector or the charitable sector, as well as experience in public involvement and event management. Most importantly, they will be flexible and adaptable, and willing to work collaboratively as an integral member of a close-knit team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The postholder will be asked to deputise for the Head of Corporate Governance as required.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Deputy Head of Corporate Governance B8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243010", "validThrough": "2020-11-09T23:59:59+0000"}