{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33620", "minValue": "30258", "unitText": "YEAR", "value": "£18.00-£20.00 per hour dependent on experience"}}, "datePosted": "2020-10-14T10:46:11+0100", "description": "&lt;p&gt;Providing quality, inspiring innovation and delivering value is what we set out to achieve at Priory Healthcare. Enabling our patients with mental health illness to receive a truly integrated and holistic approach to their treatment, regardless of complexity or severity, thanks to the knowledge and expertise of our multidisciplinary clinical teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Priory Hospital Hemel Hempstead offers a safe and supportive complex care and rehabilitation service for male and female service users with enduring mental health problems.The 34 bedded locked facility is split into three services and gender specific wards and has a range of facilities available on site.&lt;/p&gt;\n&lt;p&gt;Our consultant ledmultidisciplinary teamoffer safe and supportive rehabilitation, aimingto work collaboratively with our service users to provide the best quality care, improve the quality of their lives and help them achieve the highest level of independence and dignity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful candidates will be motivated to work in a service that offers involvement and empowerment for patients, who may have a personality disorder and/or mental illness, encouraging patients to have a real voice in how services develop and in their individualised care pathways. You will be flexible and supportive, enabling patients to build on their existing strengths and feel positive about their lives.&lt;/p&gt;\n&lt;p&gt;What we’d like from you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RMN Qualified&lt;/li&gt;\n&lt;li&gt;NMC (Nursing &amp; Midwifery Council Registered)&lt;/li&gt;\n&lt;li&gt;Knowledge of the Mental Health Act&lt;/li&gt;\n&lt;li&gt;Patient centric &amp; commitment to deliveringhigh quality care&lt;/li&gt;\n&lt;li&gt;Fine tuned decision making skills&lt;/li&gt;\n&lt;li&gt;Excellent organisational capability&lt;/li&gt;\n&lt;li&gt;Effective communication skills&lt;/li&gt;\n&lt;li&gt;Flexibility and a strong “can do” attitude&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;What we’d like to give you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary&lt;/li&gt;\n&lt;li&gt;Enhanced disclosure cost coverage&lt;/li&gt;\n&lt;li&gt;Comprehensive induction and commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Online benefits and cashback rewards&lt;/li&gt;\n&lt;li&gt;SMART Pension option&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please apply online or if you have any queries please contact Angela Morrison, HR Advisor atangelamorrison@priorygroup.com&lt;/p&gt;\n&lt;p&gt;‘All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS). Priory Group will cover the cost of a DBS check for all successful applicants.’&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hemel Hempstead", "postalCode": "HP3 0BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7324", "longitude": "-.498062"}}, "title": "Bank Registered Mental Health Nurse (RMN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225779", "validThrough": "2020-11-13T23:59:59+0000"}