{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-27T12:16:55+0000", "description": "&lt;p&gt;This is an exciting opportunity to join a vibrant and busy NHS ICT Service Desk, based in Leamington Spa.&lt;/p&gt;\n&lt;p&gt;The Service Desk offers a high-quality customer focused helpline to all South Warwickshire NHS Foundation Trust and GP Practice staff based in sites across Warwickshire.&lt;/p&gt;\n&lt;p&gt;You must be an enthusiastic person with a flexible attitude, able to work well as a team player. With exceptional communication skills both verbal and written; you will work well with others and have the drive and passion for working in a constantly evolving and demanding environment.&lt;/p&gt;\n&lt;p&gt;Your experience of working in a customer focussed service delivery&lt;em&gt;, &lt;/em&gt;call centre or helpdesk environment means you are able to plan and organise a variety of tasks with differing priorities; have an analytical approach to problem solving; have fast and accurate keyboard skills; have a working knowledge of the Microsoft Office Suite; and be confident to learn new skills.&lt;/p&gt;\n&lt;p&gt;Having excellent IT skills will be key, as will being a dynamic and creative individual that take prides in delivering a first-class customer service, providing prompt action that ensuring the user receives a positive experience whilst addressing their needs.&lt;/p&gt;\n&lt;p&gt;Interviews will be held via MS Teams during the week commencing 16th November&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name - Avinder Channa - Job title - Technical Services Manager&lt;/p&gt;\n&lt;p&gt;Email addressAvinder.channa@swft.nhs.ukTelephone number01926 495321 x 6534&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "IT - Helpdesk Support C26078, Leamington Spa", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "ICT Service Desk Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244444", "validThrough": "2020-11-09T23:59:59+0000"}