{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-04T14:15:44+0000", "description": "&lt;p&gt;Humber Teaching NHS Foundation Trust aims to be a leading provider of integrated health services, recognised for patient care and compassion, commitment to our staff, and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic Band 5 Nurse with experience of or an interest in working in the Community Diabetes Team. The post holder will work in Scarborough/Ryedale as part of our busy Community Diabetes Nursing Team delivering person centred care to patients in their own homes and community clinic sites.&lt;/p&gt;\n&lt;p&gt;There would be an expectation that the successful candidate will be able to deliver structured education in diabetes for both service users and staff following appropriate training.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is enthusiastic, conscientious, adaptable and able to work well as part of a team. The successful candidate will have excellent communication skills and be able to demonstrate an adaptable approach whilst meeting performance targets and standards. The post holder will be expected to work 24 hours per week The ability to commute across the locality is essential, and therefore you must have access to a vehicle suitable for work purposes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Successful applicants will benefit from:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Robust supervision programme and line management structure aligned to a supervision plan that includes professional development groups/support.&lt;/li&gt;\n&lt;li&gt;Clinical competencies to ensure safe and effective working.&lt;/li&gt;\n&lt;li&gt;Opportunity for workplace shadowing with many in house specialist services provided.&lt;/li&gt;\n&lt;li&gt;Opportunity for development and progression to senior positions in our MDT teams.&lt;/li&gt;\n&lt;li&gt;Newly qualified staff will be supported by a Mentorship Programme, and will themselves be given the opportunity to become mentors.&lt;/li&gt;\n&lt;li&gt;Strong focus on staff health and wellbeing with close engagement with our Occupational Health team to support you when needed (e.g. flexible working).&lt;/li&gt;\n&lt;li&gt;Promotion of in-service fast track MSK physio for our workforce.&lt;/li&gt;\n&lt;li&gt;Access to a lease vehicle with a competitive finance scheme.&lt;/li&gt;\n&lt;li&gt;An emphasis on patient focused staff engagement, with daily safety huddles and team meetings.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Our Trust values:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Caring&lt;/strong&gt; for people while ensuring they are always at the heart of everything we do.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Learning&lt;/strong&gt; and using proven research as a basis for delivering safe, effective, integrated care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Growing&lt;/strong&gt; our reputation for being a provider of high-quality services and a great place to work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated Good by the Care Quality Commission. The Trust is also proud to be HSJ Award winners of Provider of the Year 2019.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,700 staff across more than 70 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Within North Yorkshire, Scarborough, Ryedale and Whitby areas boast a wide array of diverse property from coastal cottages to riverside apartments, with access to excellent schools and further and higher education providers. There is beautiful scenery across the locality, including picturesque seaside towns, Market towns, woodland areas, moorland and world heritage sites including castles, and Abbeys. Local events include food festivals, Gothic weekends, Victorian weekends, cycling events, Armed Forces and Lifeboat weekends.&lt;/p&gt;\n&lt;p&gt;The region has transport connections with train services from Scarborough and Malton to York, Leeds, and London, and from Whitby to Teesside, and easily commutable for driving, for example York to Malton within 4o minutes drive.&lt;/p&gt;\n&lt;p&gt;For informal enquires please contact Helen Ray, Diabetic Specialist Nurse. Tel: 07580451920 or Katherine Flint, Diabetic Specialist Nurse. Tel: 07870835804&lt;/p&gt;\n&lt;p&gt;Please do not ring these numbers for application packages.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen RayJob titleDiabetic Specialist NurseEmail addresshelen.ray7@nhs.netTelephone number07580451920&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Malton Hospital, Malton", "postalCode": "YO17 7NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1372", "longitude": "-.806561"}}, "title": "Diabetes Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256175", "validThrough": "2020-11-18T23:59:59+0000"}