{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-29T11:46:57+0000", "description": "&lt;p&gt;The Data Warehouse Manager is a new role being created in response to the needs of the Trust to extend our BI capabilities. The post holder will lead a team of skilled developers supporting and driving forward this vision. This role will help extend the existing reporting functionality to include new areas such as real time dashboards and delivery of data for clinical research purposes. This is a leadership position and will have direct management responsibility for the technical team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Data Warehouse Manager position will report to the Head of Business Intelligence and work closely with the Business Analytics teams to ensure projects are completed. The post holder will also closely integrate with the business owners on planning and preparing for new projects requiring Data Warehouse Team resources.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is a leadership position and will have direct management responsibility for the technical team providing technical leadership and to make iterative changes to develop a better product and skill set mix within the Team&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holder will have responsibility to ensure the Business Intelligence toolset and infrastructure maintained are current. This will involve ensuring software versions are maintained and that the servers maintained to ensure they are secure and perform optimally.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Hampshire Hospitals NHS Foundation Trust is committed to providing patients, visitors and staff with high quality services in a safe environment. Patient care is at the heart of what we do. Hampshire Hospitals NHS Foundation Trust provides medical and surgical services to a population of approximately 600,000 across Hampshire and parts of West Berkshire.&lt;/p&gt;\n&lt;p&gt;We provide some specialist services to people across the UK and internationally. We are one of only two centres in the UK treating pseudomyxoma peritonei (a rare form of abdominal cancer) and we are leaders in the field of tertiary liver cancer and colorectal cancer.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Hampshire Hospitals NHS Foundation Trust provides one service from multiple locations including our own three hospitals. Basingstoke and North Hampshire Hospital (BNHH) and Royal Hampshire County Hospital (RHCH) both provide a full range of planned and emergency services including accident and emergency, general and specialist surgery, general medicine, intensive care, rehabilitation, chemotherapy, diagnostic services, maternity, neonatal, gynaecology, paediatric care and outpatient clinics. Andover War Memorial Hospital (AWMH) provides community and hospital services including a minor injuries unit, outpatient clinics, diagnostic imaging, day surgery, rehabilitation and maternity services.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Trust employs around 5,500 staff and has a turnover of over £340 million a year. There are over 18,000 public and staff members. As a Foundation Trust it as directly accountable to its members through the governors. The Council of Governors represent the interests of their constituencies and influence the future plans of the Foundation Trust.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Diane Maunder - Head of Business Intelligence&lt;/p&gt;\n&lt;p&gt;diane.maunder@hhft.nhs.uk / 01256 852629&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke and North Hampshire Hospital, Basingstoke", "postalCode": "RG24 9NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2806", "longitude": "-1.10986"}}, "title": "Data Warehouse Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248185", "validThrough": "2020-11-18T23:59:59+0000"}