{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 Per annum"}}, "datePosted": "2020-11-03T17:00:44+0000", "description": "&lt;p&gt;Specimen reception at George Eliot Hospital is part of the Coventry and Warwickshire Pathology (CWPS) network, which is based on the hospital sites at Coventry (University Hospital), Nuneaton (George Eliot Hospital),Warwick (South Warwickshire Hospital) and Queens Hospital (Burton) .&lt;/p&gt;\n&lt;p&gt;It offers a comprehensive range of Pathology services to a population of approximately 1.8 million Coventry and Warwickshire residents and has a close relationship with the Medical school at Warwick University.&lt;/p&gt;\n&lt;p&gt;Applications are invited from candidates who are interested in joining the excellent specimen reception team at George Eliot Hospital (Nuneaton). The role of the specimen reception supervisor will be to supervise and manage the team of Biomedical Assistants. They will also be responsible for the day to day running of specimen reception.&lt;/p&gt;\n&lt;p&gt;Biomedical Assistants are technical support staff within the blood science laboratory. With suitable training they will perform; sample booking in, analyser maintenance, basic troubleshooting and some simple manual tests under supervision to ensure samples meet their turnaround times.&lt;/p&gt;\n&lt;p&gt;They will carry out audits, stock checks, stock rotation, reagent preparation and general support to BMS staff. They must also be committed to continued professional development.&lt;/p&gt;\n&lt;p&gt;The candidate should have proven supervisory skills, good numeracy and literacy skills, as well as good computer skills. They should be able to cope with working autonomously, and to strict deadlines, in a very busy environment. They must also be committed to 24/7 working which is an essential part of CWPS. Previous pathology experience is essential.&lt;/p&gt;\n&lt;p&gt;The CWPS network offers an excellent opportunity to those seeking employment in a modern, innovative and high-profile organisation. Applicants are advised to apply as soon as possible as the advert may close early depending on the volume of applications received.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name- Anas Ghivalla&lt;/p&gt;\n&lt;p&gt;Job title- Pre-Analytics Service Lead&lt;/p&gt;\n&lt;p&gt;Email address- anas.ghivalla@uhcw.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "George Eliot Hospital, Nuneaton", "postalCode": "CV10 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.512", "longitude": "-1.47512"}}, "title": "Specimen Reception Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254870", "validThrough": "2020-11-17T23:59:59+0000"}