{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-05T07:56:34+0000", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Advert - Band 6 Agile Research Team Nurse or Practitioner&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Do you want an exciting, fast moving research nurse / practitioner delivery role with lots of opportunities for development? Look no further.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The newly structured Agile Research Team part of the Yorkshire and Humber Clinical Research Networks core team ( Y&amp;H CRN ) are now recruiting a Band 6 Research Nurse/Practitioner role. The current vacancy represents an excellent opportunity for a motivated and hardworking research nurse/ practitioner to be involved in all specialities of research.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You should ideally have experience in clinical research or be able to transfer your previously gained relevant clinical skills and knowledge to the role of a research nurse/practitioner. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Y&amp;H CRN Agile Research Team works on delivering large national portfolio research projects across a variety of clinical specialties within trusts , GP Practices and other community health and social care settings across the region, so you must be willing to be mobile and flexible in your working approach. You will be based at St James Hospital, in the Research and Innovation Centre and employed by Leeds Teaching Hospitals Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working closely with the Agile Research Team Hub Leader, the post holder will take responsibility for the management, co-ordination, and facilitation of concurrent research studies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Informal discussions about the Agile Research Team and the role are encouraged.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;The NIHR Clinical Research Network Yorkshire and Humber&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The National Institute for Health Research (NIHR) was created as part of the Department of Health’s Research and development strategy, to provide a world-class infrastructure for clinical trials and high quality research in all areas of disease and clinical need within the NHS. The Clinical Research Network Yorkshire and Humber (CRN Y&amp;H) is part of the NIHR and is one of 15 Local Clinical Research Networks in England and aims to support clinical teams to recruit NHS patients to NIHR portfolio studies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The CRN Y&amp;H area includes 22 Trusts and 21 CCGs and staff provide a coordinated and efficient infrastructure of research personnel and facilities to support recruitment and drive clinical research delivery performance across the locality.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For enquiries about the application/assessment process or to arrange an informal discussion on the team and / or the role, contact Eleanor Baldwin on &lt;/span&gt;&lt;span&gt;eleanor.baldwin@nihr.ac.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122692.jpg", "name": "Trust Executives", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122692"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Agile Research Team Nurse [Hub Leader] (XR06)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256912", "validThrough": "2020-11-19T23:59:59+0000"}