{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20000", "minValue": "20000", "unitText": "YEAR", "value": "Up to £20,000 (Pro-Ratqa)"}}, "datePosted": "2020-10-26T15:28:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term Contract - Up to 4 Months + (Possible Extension)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a passionate, proactive and credible individual to work within a new project to tackle violence and knife crime in young people in Leicestershire.&lt;/p&gt;\n&lt;p&gt;Based within Leicester Royal Infirmary and run by Turning Point the project will intervene and engage with young people who come into hospital with injuries caused through knife crime or other related violence. You will engage with these vulnerable young people at this key opportunity to help make a difference and support them to move away from violence towards safer, healthier more productive lives. You must be able to show empathy and forge a connection with people who are at their lowest ebb, then back it up with the ability to create strong, trusting relationships that support people to access the help they need. You will provide mentoring beyond the young person’s hospital stay, linking them into other agencies who can support them longer term.&lt;/p&gt;\n&lt;p&gt;Initially this is a fixed term contract until 31st March 2021 due to initial short term funding. It is very much hoped that funding will be secured to extend the post beyond this date, although this cannot be guaranteed.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role will be based within Leicester Royal Infirmary Hospital, but you may be required to work across other University Hospitals of Leicester NHS Trust (UHL) sites and you will also run outreach, meeting young people after their discharge from hospital anywhere in Leicestershire County, Leicester City and Rutland County. Willingness and flexibility to travel across the county is therefore essential. To maximise opportunities to engage the project will have a presence in the hospital between 9am and 10pm 7 days a week. Shift working and ability to work weekends and flexibly of working hours is absolutely essential for this role. &lt;/p&gt;\n&lt;p&gt;If people describe you as; level headed, a listener, compassionate, patient, a great communicator, hard worker, resilient, dedicated, great in a crisis – and you have the energy and commitment to always go the extra mile to support people effectively then we would like to hear from you. We are particularly keen to hear from individuals who have had previous involvement with the criminal justice system or with lived experience of the challenges these vulnerable young people are going through to act as a credible role model to young people engaged with this project.&lt;/p&gt;\n&lt;p&gt;A driving licence and car access is desirable but flexibility in travel across the county is essential.&lt;/p&gt;\n\n\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a highly effective communicator, efficient and organised and have a real passion for supporting young people to achieve goals.&lt;/p&gt;\n\n\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from &lt;em&gt;Investors in People&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;28 days’ paid holiday a year, increasing with each year of service up to 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester, Coalville, Loughborough", "postalCode": "LE1 3QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6376", "longitude": "-1.12764"}}, "title": "Violence Intervention Project Worker - LLR", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243132", "validThrough": "2020-11-09T23:59:59+0000"}