{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-06T14:01:23+0000", "description": "&lt;p&gt;Our St Helens Psychological Therapies Recovery Team are looking to recruit a band 6 Duty Practitioner Full Time on a permanent contract. We are a supportive, well-resourced and dynamic team, and there will be opportunities for professional development within the role.&lt;/p&gt;\n&lt;p&gt;We are looking for a mental health practitioner with RMN, Occupational Therapy or Social Work background to work alongside our large multidisciplinary psychological therapy team. A special interest in psychological ways of working is required, and full induction and training will be provided to the right candidate.&lt;/p&gt;\n&lt;p&gt;Your role would be to provide responsive therapeutic interventions to service users on the psychological therapies pathways who are struggling to manage. You would work alongside another duty practitioner who provides duty to the Recovery Team severe and enduring pathway. The successful candidate will be trained in psychological models including Structured Clinical Management and Dialectical Behaviour Therapy.&lt;/p&gt;\n&lt;p&gt;This will be a varied role, as not only will you be providing duty cover for people phoning up seeking support but you will also be expected to provide structured psychological sessions in crisis management. This would be an exciting role for a mental health practitioner who wants to build skills and expertise in psychological therapies whilst keeping their core mental health skills.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced check with adult’s barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;Interviews are expected to be carried out on the 30th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Judith Baker&lt;/p&gt;\n&lt;p&gt;judith.baker@nwbh.nhs.uk&lt;/p&gt;\n&lt;p&gt;01744 736 708&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harry Blackman House, St. Helens", "postalCode": "WA9 3DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4405", "longitude": "-2.71946"}}, "title": "Senior Mental Health Practitioner Duty Role", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260034", "validThrough": "2020-11-20T23:59:59+0000"}