{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa inc"}}, "datePosted": "2020-10-30T15:16:23+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a full-time Band 7 Asthma &amp; Allergy Clinical Nurse Specialist within the Respiratory &amp; Allergy service at Imperial College Healthcare NHS Trust. The post holder will be mainly based at St Mary’s Hospital but may require cross-site working at times.&lt;br /&gt; &lt;br /&gt; The role will include the opportunity to review asthma patients within the acute setting and the post holder will be expected to deliver nurse-led outpatient clinics to both asthma and allergy patients. Working within our multidisciplinary team, you will work closely with the Senior Chest &amp; Allergy Nurse and the Respiratory &amp; Allergy Consultants to develop your own advanced skills and knowledge within asthma and allergy.&lt;br /&gt; &lt;br /&gt; Awareness of the current guidelines and issues in asthma &amp; allergy management is essential in order to provide high quality specialist nursing assessment, evidence-based intervention and self-management support for our patients. Teaching experience is also highly desirable as is the ability to work autonomously and as part of a team. You must be organised, confident and have excellent communication skills to enable you to liaise effectively with the multi-disciplinary team and work with a complex group of patients and carers. &lt;br /&gt; &lt;br /&gt; This is a great opportunity for any individual who has an interest in this speciality and who is willing to undertake training appropriate to the post.&lt;br /&gt; &lt;br /&gt; You must be organised, confident and have excellent communication skills to enable you to liaise effectively with the multi-disciplinary team and work with a complex group of patients and carers. &lt;br /&gt; &lt;br /&gt; The Trust offers the chance to work in a forward thinking and dynamic organisation, where there is a strong emphasis of continuing professional development and encouragement to advance personal practice.&lt;br /&gt; Internal candidates for secondment will be considered for this position.&lt;br /&gt; &lt;br /&gt; For further details and to arrange an informal visit please contact Carina Rodrigues, Senior Chest &amp; Allergy Clinical Nurse Specialist email: carina.rodrigues@nhs.net. Tel: 0203 312 1542&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 7 Asthma &amp; Allergy CNS  - MIC", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250718", "validThrough": "2020-11-12T23:59:59+0000"}