{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-23T08:45:35+0100", "description": "&lt;p&gt;NHSX is leading the largest digital health and social care transformation programme in the world. With investment of more than £1 billion pounds a year nationally and a significant additional spend locally, NHSX has been created to give staff and citizens the technology they need.&lt;/p&gt;\n&lt;p&gt;NHSX brings together the Department of Health and Social Care, NHS England and NHS Improvement who will deliver the Health Secretary’s Tech Vision, building on the NHS Long Term Plan. We will speed up the digital transformation of the NHS and social care. We have set ourselves five missions, which are focused on how we can make things better for patients and staff.&lt;br /&gt;&lt;br /&gt;These are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Reducing the burden on clinicians and staff, so they can focus on patients&lt;/li&gt;\n&lt;li&gt;Giving people the tools to access information and services directly&lt;/li&gt;\n&lt;li&gt;Ensuring clinical information can be safely accessed, wherever it is needed&lt;/li&gt;\n&lt;li&gt;Improving patient safety across the NHS&lt;/li&gt;\n&lt;li&gt;Improving NHS productivity with digital technology&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is an exciting opportunity to join a new team that will be working with social care providers to accelerate the adoption of digital social care records. We are currently looking for four programme managers, each focussed on a different area of expertise, and a business support officer.&lt;/p&gt;\n&lt;p&gt;Although we will be running a single application process you should ensure that your application meets the specific additional requirements of at least one of the assignment briefs. We will be shortlisting for each role separately so it will strengthen your application if you are able to demonstrate the additional experience specified in the assignment brief.&lt;/p&gt;\n&lt;p&gt;We believe that a critical success factor to delivering this important work will be to have as diverse and inclusive a team as possible. A wide range of differing views will be critical to helping us deliver a complex programme that spans a wide variety of social care providers. To encourage applications from as diverse backgrounds as possible, we will offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;1:1 video chats / calls while posts are being advertised so you have the opportunity to find out more about the role and the team. We encourage you to get in touch because it&#39;s equally important that we suit what you are looking for too.&lt;/li&gt;\n&lt;li&gt;Blind sifting. This means all personal identifying information will be removed from your application before it reaches us for shortlisting.&lt;/li&gt;\n&lt;li&gt;All interview panels will be diverse and include at least one person who is external to the team.&lt;/li&gt;\n&lt;li&gt;All panels will receive interview training to ensure every interview is a positive one.&lt;/li&gt;\n&lt;li&gt;If you are invited to interview, we will provide you with details of any interview-related tasks in advance. We want to hear about your skills and experience rather than testing your memory.&lt;/li&gt;\n&lt;li&gt;We may ask you follow up questions during the interview. This is to help us to get a clear picture of your experience, not to catch you out. Our aim is to make the interview a positive and enjoyable process so that we can get the best out of you and so that we fully understand your skills and attributes.&lt;/li&gt;\n&lt;li&gt;We are all working from home at the moment so we will be interviewing remotely but will do our best to accommodate your personal circumstances when scheduling interviews. We don’t mind interruptions from children or pets during any interview - but be warned that some of ours may join in too!&lt;/li&gt;\n&lt;li&gt;If you&#39;re invited to an interview we will offer you the chance to test your video connection with a member of the team in advance so that you can be confident that the technology will work smoothly on the day.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please be aware that we&#39;re a small team so it may take us a little bit of time to respond, especially if there is a lot of interest and applications, but we&#39;ll do our best to get back to you as quickly as possible. And if there&#39;s anything else that you think we could do to support you to apply, please do let us know.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePeter SkinnerEmail addresspeter.skinner@nhsx.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact Peter Skinner.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Quarry House, Leeds", "postalCode": "LS2 7UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Programme Manager - NHSX", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239715", "validThrough": "2020-11-08T23:59:59+0000"}