{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-22T12:46:24+0100", "description": "&lt;p&gt;Applications are invited for two Consultant in Histopathology posts at Addenbrooke’s Hospital, part of Cambridge University Hospitals NHS Foundation Trust. These posts are full time, (10 PAs).&lt;/p&gt;\n&lt;p&gt;The duties of these posts include reporting surgical pathology, which is fully sub-specialised at Addenbrooke’s but includes opportunities for more generalised practice. It will be possible for the successful applicants to develop their interests in response to the service needs of the department. Currently there are potential requirements for specialist input into Gynaecology, Gastrointestinal, Head and Neck, and Haematopathology. The department is staffed by a team of 40 specialist Histopathologists.&lt;/p&gt;\n&lt;p&gt;You will be fully registered with the GMC and ideally have a CCT in Histopathology or be within six months of award of CCT at the time of interview. Applications are welcomed from those unable to work full time for personal reasons or those wishing to job-share.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to supporting the medical workforce in the part they play in delivering an excellent caring service to patients, all newly appointed Consultants attend our five-day Consultant development programme within a year of joining the Trust. Leadership is a key requirement of doctors’ professional work and this innovative programme is designed to support Consultants to hone the leadership and management skills they need to succeed at CUH.&lt;/p&gt;\n&lt;p&gt;The applicant must have demonstrable skills in listening, reading, writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013).&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr. Michael Eden, Clinical Lead, by email: michael.eden@addenbrookes.nhs.uk or telephone: 01223 596250&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Consultant in Histopathology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238476", "validThrough": "2020-11-17T23:59:59+0000"}