{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103806", "minValue": "79957", "unitText": "YEAR", "value": "£79,957 - £103,806 Dependant on Experience"}}, "datePosted": "2020-10-21T15:46:20+0100", "description": "&lt;p&gt;Hywel Dda University Health Board is one of seven acute Health Boards in Wales, serving a population of 384,000. ‘Right now we are building our Future, setting the Pace for Care’&lt;/p&gt;\n&lt;p&gt;The Health Board is committed to delivering high quality Paediatric Care and sees the provision of consistent Paediatric Care, as a key strategic priority. You will enjoy excellent conditions of employment, whilst building your future in one of the best locations in the UK. Carmarthen is a historic town, nestled within the beautiful county of Carmarthenshire, which is adjacent to Pembrokeshire National Park. Carmarthenshire’s’ relaxed lifestyle, picturesque countryside and award winning beaches, makes the county popular with both locals and visitors alike.&lt;/p&gt;\n&lt;p&gt;The post is offered on a 37.5 hour working week – 10 sessions. The post is subject to the Terms and Conditions of Service, which governs the appointment of Hospital Medical and Dental Staff in Wales.&lt;/p&gt;\n&lt;p&gt;In this post you will contribute to a current on-call rota at Glangwili; as resident on call, you will be expected to reside (for on-call purposes) within 30 minutes of the Hospital site.&lt;/p&gt;\n&lt;p&gt;So, if you are a senior doctor, looking for a change of scene, or if you think life in one of the most beautiful parts of the UK might suit you, then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;For informal visits and a no obligation chat, please call Dr Prem Kumar Pitchaikani: Consultant Paediatrician &amp; Joint Neonatal Lead Clinical Director - Women &amp; Child Health Tel: 01267 227523&lt;/p&gt;\n&lt;p&gt;Information on the Health Board is provided with a full Job Description of this post. The Health Board operates a&lt;em&gt; No Smoking Policy and promotes Equal Opportunities.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Consultant in General Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237134", "validThrough": "2020-11-23T23:59:59+0000"}