{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum excl HCAs"}}, "datePosted": "2020-10-28T18:00:29+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;ICAT Pharmacy Technician&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Whittington Health NHS Trust is an integrated care organisation, committed to truly developing integrated patient pathways across acute and community care.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic pharmacy technician who is passionate about the care of frail, older people to join our community geriatrics service (Integrated Community Ageing Team - ICAT) on a permanent basis.&lt;/p&gt;\n&lt;p&gt;ICAT was developed in 2014, led by a consultant geriatrician, and a GP with a special interest in the care of frail older patients. ICAT initially focused on intervention in care homes, providing specialist support for residents, their carers and GPs.&lt;/p&gt;\n&lt;p&gt;In the care homes, the pharmacists began working alongside the consultant geriatricians and the wider multidisciplinary team (MDT) in order to carry out comprehensive medication reviews. Present day, there are monthly face to face multidisciplinary meetings for each care home which allows for better development of trust between the MDT members, better integrated working and patient involvement.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an experienced technician who is passionate about providing high quality, integrated care for older people. They will also have the opportunity to develop their skills in medicines reconciliation, counselling, carrying out audit and project work and also with education and training. We offer a programme of professional leadership and peer support, clinical supervision, ongoing education and professional development.&lt;/p&gt;\n&lt;p&gt;We are an engaged and committed team that strives to provide high quality, integrated patient care and would welcome the opportunity to further discuss the role with potential applicants or arrange an informal visit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRadha ShahJob titleICAT care home pharmacistEmail addressradha.shah1@nhs.netTelephone number020 7288 5326Additional contact information&lt;/p&gt;\n&lt;p&gt;Radha Shah (ICAT Care home pharmacist) or Clare Martin (ICAT Pharmacist)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hornsey Street, Islington", "postalCode": "N7 8GG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5513", "longitude": "-.11512"}}, "title": "ICAT Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247520", "validThrough": "2020-11-19T23:59:59+0000"}