{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-15T16:58:42+0100", "description": "&lt;p&gt;&lt;em&gt;Here at Omnes Healthcare we believe in innovation; we believe in listening to everyone; we believe in providing quality service; and we believe our employees will help us achieve our mission. We are looking for individuals who share these values to join our growing organisation.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are seeking a Chief Technology Officer (CTO) to join the Omnes Healthcare Family. To become part of a company that makes a positive impact within Healthcare and to the patients we provide care for please apply today!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Location: Remote working and up to 1 day onsite per week &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Salary: Competitive&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Who are Omnes Healthcare?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Omnes Healthcare are a trusted partner in delivering primary and secondary NHS care services. Our quality services cover a wide range of specialities, including General Practice, and our aim is to provide accessible and patient-focused care by working collaboratively and embracing new ways of working, including the application of innovative technology.&lt;/p&gt;\n&lt;p&gt;We are dedicated to achieving better outcomes for our patients, whilst supporting the NHS. Our staff are rewarded by becoming an integral part of delivering excellent patient care, working within an innovative company and our attractive employee benefits, including remote working and your birthday off!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What is the purpose of the position?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a CTO you will be a pivotal member of the Senior Leadership Team. You will be required to shape the strategic development of the IT team, ensure the efficient delivery of current systems, whilst also leading and implementing innovative solutions to drive improved patient experience and the effective delivery of IT solutions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are the key responsibilities?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop technological and data warehouse aspects of company strategy aligning these with the wider business goals&lt;/li&gt;\n&lt;li&gt;Seek out and implement technology and solutions that improve the effectiveness and efficiency of delivery&lt;/li&gt;\n&lt;li&gt;Support across the business to use technology and data effectively&lt;/li&gt;\n&lt;li&gt;Ensure and enhance existing controls and process for IT and data are developed following a continuous improvement and risk-based approach to ensure that the company and the data it holds are appropriately protected&lt;/li&gt;\n&lt;li&gt;Rigorously manage KPIs and budgets for the IT and data teams to a very high standard&lt;/li&gt;\n&lt;li&gt;Effectively communicate technology and data strategy&lt;/li&gt;\n&lt;li&gt;Coordinate all technical and data aspects, including web sites and technology integrated into them.&lt;/li&gt;\n&lt;li&gt;Oversight over all communications technology within the business including telephony, and other electronic communications.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What do you need to join the Omnes Healthcare Family?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven track record as a CTO or similar leadership role&lt;/li&gt;\n&lt;li&gt;BA/BSc in Computer Science, Engineering or a related field&lt;/li&gt;\n&lt;li&gt;Strong understanding of NHS and UK regulatory requirements for IT and data.&lt;/li&gt;\n&lt;li&gt;A detailed understanding of health IT and the emerging trends to allow strategic planning&lt;/li&gt;\n&lt;li&gt;Track record of managing teams and budgets effectively&lt;/li&gt;\n&lt;li&gt;Highly motivated, disciplined and driven&lt;/li&gt;\n&lt;li&gt;Excellent communication skills (verbal and written)&lt;/li&gt;\n&lt;li&gt;High quality leadership and organisational skills&lt;/li&gt;\n&lt;li&gt;Clear thinking with an analytical approach&lt;/li&gt;\n&lt;li&gt;Problem solving mindset&lt;/li&gt;\n&lt;li&gt;Able to demonstrate introduction of new technology into a business&lt;/li&gt;\n&lt;li&gt;Experience of SME environments from £20m to £100m, preferably within a multi-site structure.&lt;/li&gt;\n&lt;li&gt;Experience of managing a small team including first/second line support, network management, strategic planning.&lt;/li&gt;\n&lt;li&gt;Ability to communicate and give direction proficiently&lt;/li&gt;\n&lt;li&gt;Ability to communicate effectively with internal and external stakeholders at all levels including Executive Board members&lt;/li&gt;\n&lt;li&gt;Ability to effectively explain technical solutions to all stakeholders&lt;/li&gt;\n&lt;li&gt;Disciplined in asset management, user management, security.&lt;/li&gt;\n&lt;li&gt;Experience of network/server management/security and effective utilisation of third-party support to complement and enhance the internal team.&lt;/li&gt;\n&lt;li&gt;A strong understanding of internal service level requirements and the concept of an IT team as an internal supplier.&lt;/li&gt;\n&lt;li&gt;Strong understanding of data warehouse implementation&lt;/li&gt;\n&lt;li&gt;Ability to work across a distributed, multi-site organisation and to work effectively remotely.&lt;/li&gt;\n&lt;li&gt;Ability to attend our Head Office at London Bridge (Southend Onwards from December 2020) and | or GP and Secondary Care Practices as required to attend training sessions, participate in engagement activities and other duties when required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What Omnes Healthcare will offer you in return?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A supportive organisation and the opportunity to make a difference&lt;/li&gt;\n&lt;li&gt;25 days holiday plus bank holidays&lt;/li&gt;\n&lt;li&gt;An extra day off to celebrate your birthday&lt;/li&gt;\n&lt;li&gt;NHS Discount&lt;/li&gt;\n&lt;li&gt;Remote working&lt;/li&gt;\n&lt;li&gt;And other fantastic benefits&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Apply today if you would like a rewarding job where you are able to make a difference.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/134554.png", "name": "Omnes Healthcare Limited", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Remote | London and Southend", "postalCode": "SE1 0HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5047", "longitude": "-.097623"}}, "title": "Chief Technology Officer (CTO)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229093", "validThrough": "2020-11-29T23:59:59+0000"}