{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£ 30,401 - £37,267 pa"}}, "datePosted": "2020-11-02T16:31:22+0000", "description": "&lt;p&gt;&lt;span&gt;Are you an experienced pharmacist seeking a new challenge? Are you tech-savvy and have a keen interest in the use of digital solutions to improve patient safety? Do you enjoy working on exciting new projects that offer a real sense of achievement? Are you excited by the opportunity to work in a progressive pharmacy department that has a clear vision for the future? If so, then we have the role for you.&lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;span&gt; The Lister Hospital, Stevenage is looking for a high calibre technician to join our expanding team for electronic prescribing and medicines administration (ePMA). This is a new post which will work alongside fantastic multidisciplinary and IT teams to support on pharmacy aspects of the implementation of ePMA. The successful candidate will be enthusiastic, innovative and resourceful, whilst possessing good IT knowledge which they will utilise to deliver an ePMA solution as the Trust transitions from its pilot to a full-scale roll out in 2021. They will&lt;/span&gt; support the ePMA Pharmacist in the drug file build pre go live and ongoing maintenance of the formulary as per guidance from New Drugs and Formulary and Medication Forum. They will take a lead on all elements of drug file build configuration and associated governance&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; Being driven and adaptable are essential characteristics for this role as this is a unique opportunity to shape the future pathway of a major Trust project as the system is fine-tuned in order to deliver key benefits and informatics advantages through maturing to &#39;business as usual.&#39; &lt;br /&gt;&lt;br /&gt;The post holder will lead and line manage other members of the pharmacy team, and there may be a clinical commitment to the role for suitable candidates.&lt;br /&gt;&lt;br /&gt;Continued professional development is actively supported in the pharmacy department and there will be opportunities to undertake training where applicable. The successful candidate will also be supported to develop their leadership and management skills.&lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;span&gt; If this sounds like the opportunity for you, please get in touch with us!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Below is what members of the team had to say about the Pharmacy department:&lt;/p&gt;\n&lt;p&gt;&quot;Great department to work in - everyone is very friendly, helpful and supportive&quot;&lt;/p&gt;\n&lt;p&gt;&quot;Friendly, forward thinking department; good emphasis on education and training&quot;&lt;/p&gt;\n&lt;p&gt;“Friendly, supportive team members. Development opportunities and courses are provided&quot;&lt;/p&gt;\n&lt;p&gt;If this sounds like the opportunity for you, please get in touch with us!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarb Sarai 01438 284032&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LISTER, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Pharmacy IT Technician ePMA", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252876", "validThrough": "2020-11-16T23:59:59+0000"}