{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 ​ -  £36,738  per annum inc"}}, "datePosted": "2020-11-02T14:16:09+0000", "description": "&lt;p&gt;Advert&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Older Peoples Services, Acute Medicine and Accident &amp; Emergency Department Services at the Royal London Hospital is very excited to offer a brand-new rotational programme for newly qualified or experienced nurses, developing into specialist practitioners.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The programme will run for 24 months across our Older Peoples unit, Acute Admissions Unit and our Emergency Department, with a placement of 8 months in each area at the end of which you may choose where you would like to take up your permanent post pending available vacancies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;2.5million people living in East London and beyond look to the services run by the Barts Health group of hospitals to provide them with the healthcare they need. We strive to provide safe and compassionate care to our patients and we can offer you the opportunity and support to experience a wide and varied career within one Trust on this rotational programme.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Nurses will gain a wide range of experience within our Older Peoples Services caring for patients with complex medical needs. Within our Acute Admissions Unit caring for patients with acute medical conditions and within our Accident and Emergency Department which provides clinical services to treat the range of problems with which patients present as an emergency or urgently, from life-threatening conditions to minor injury and illness.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting and excellent opportunity for newly qualified or experienced nurses to become competent practitioners, experienced in a specialist area of your choice – Older Peoples Services, Acute Medicine or Accident &amp; Emergency Department. You will be provided a preceptor and the opportunity to work alongside the Practice Development Facilitator for each individual area.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested in this opportunity you are strongly advised to apply for this post as soon as possible. This advertisement will close as soon as sufficient applications are received.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Find out more about us and Follow us on Twitter @RoyalLondonHosp&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Sarah Capsey, Senior Nurse, Older Peoples Services &amp; Acute Medicine on &lt;/span&gt;&lt;span&gt;s.capsey@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah Capsey, Senior Nurse, Older Peoples Services &amp; Acute Medicine on Sarah.Capsey@bartshealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal London Hospital, London", "postalCode": "E1 1BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.519", "longitude": "-.058048"}}, "title": "Emergency Dept &amp; Acute Medicine Rotation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252373", "validThrough": "2020-11-15T23:59:59+0000"}