{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata per annum"}}, "datePosted": "2020-10-26T11:31:11+0000", "description": "&lt;p&gt;This is an exciting opportunity for an experienced midwife who is passionate about supporting women and their partners through their birth journey. The early intervention midwife will be responsible for coordinating care for women with complex needs including alcohol and substance misuse and severe mental health problems. This will include liaising with the wider multidisciplinary team and external organisations to ensure appropriate care pathways are instigated.&lt;/p&gt;\n&lt;p&gt;The post holder will also be responsible for initiating pathways and guidance in order to promote health and well-being for women, including smoking cessation.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for training and educating staff in care of women with complex needs, mental health and smoking cessation.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be experienced in caring for women from a wide variety of backgrounds, including those with complex needs and safeguarding concerns. The candidate will be articulate, professional and confident, being able to work in complex and stressful situations with ease.&lt;/p&gt;\n&lt;p&gt;Here at Airedale we pride ourselves on high quality care, empowering and supporting women to make informed decisions about their pregnancy and birth journey. If you have the skills to be part of our innovative, compassionate team we would love to hear from you&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 11 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 20 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Any offer of employment for this post will be subject to the Trust being satisfied that the result of an enhanced disclosure of criminal convictions, including checks for the Protection of Children/Vulnerable adults, does not indicate that you are unsuitable for the post.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you are successful, as a condition of your employment you must provide us with your original DBS Disclosure Certificate prior to commencing in post as part of the pre-employment check process unless you are registered with the DBS Update Service in which case you can provide us with your surname, date of birth and certificate number to enable us to complete a status check.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you are offered a position which requires you to undertake a Disclosure &amp; Barring Service (DBS) check, the Trust will administer the DBS check on your behalf and will recover the cost (Enhanced £47.50 or Standard £29.50) from your first full months salary. This is a condition of your employment.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;You are encouraged to participate in the DBS Update Service and pay the £13 cost per year. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Probation Policy is attached to all adverts on NHS Jobs as part of the job pack, in order that prospective candidates are aware of the need to complete a 6 month probation period and also the details of how the policy operates.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebi GibsonJob titleDeputy Head of MidwiferyEmail addressdebi.gibson@nhs.netTelephone number01535 292404&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Airedale NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120636"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Airedale General Hospital, Steeton, Keighley", "postalCode": "BD20 6TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.898", "longitude": "-1.9627"}}, "title": "Specialist Midwife - Early Intervention  (Band 7)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242220", "validThrough": "2020-11-11T23:59:59+0000"}