{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Pro rata"}}, "datePosted": "2020-11-04T15:16:38+0000", "description": "&lt;p&gt;The District Nursing Service in East Lancashire is a well led and dynamic service providing high quality care to adults with complex acute and long term conditions in their own homes and regulated care home settings. The area has a considerable number of well recognised Queen&#39;s Nurses and is dedicated to promoting the specialist skills and knowledge needed to provide excellent home based care. The Band 6 Sister role will enable experienced community staff nurses to develop their clinical leadership skills in a supportive environment where professional development opportunities are available to build a confident and highly skilled specialist nursing workforce. . The post holder will be expected to work flexibly across all of the 9 District Nursing bases if required and to participate in the evening and weekend shift rotas as a routine part of the role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community nursing experience is essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a committed and enthusiastic nurse with considerable community experience to complement the existing senior nursing team and deliver high quality, safe and effective care.&lt;/p&gt;\n&lt;p&gt;Duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assessment of new and complex patients&lt;/li&gt;\n&lt;li&gt;Delivery of comprehensive Sister Reviews as required&lt;/li&gt;\n&lt;li&gt;Delivery of clinical nursing care to housebound patients&lt;/li&gt;\n&lt;li&gt;Development of the team through leadership and role modelling&lt;/li&gt;\n&lt;li&gt;Management of staffing rotas and allocation of clinical work&lt;/li&gt;\n&lt;li&gt;Establishing and maintaining effective communication with all clinical staff, patients and families, and other professionals&lt;/li&gt;\n&lt;li&gt;Leading and facilitating developments and change to improve patient care&lt;/li&gt;\n&lt;li&gt;Undertaking personal professional development to support leadership in a senior role&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder must demonstrate professional leadership qualities and be passionate about high quality patient care. They will need to be able to problem solve and adapt to challenging situations, manage resources efficiently, and ensure the delivery of safe, personal and effective care. We are looking for a nurse with a commitment to delivering evidence based care, the ability to positively challenge perceptions and practice to ensure patient and staff safety, and a strong desire to make their career in District Nursing. Car driver with access to vehicle essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicola GornallJob titleClinial Team LeaderEmail addressnicola.gornall@elht.nhs.ukTelephone number01282 805679Additional contact information&lt;/p&gt;\n&lt;p&gt;Polly Harris - Matron&lt;/p&gt;\n&lt;p&gt;07966 414 978&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Burnley West District Nurses - Kiddrow Lane Health Centre, Burnley", "postalCode": "BB12 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7952", "longitude": "-2.28863"}}, "title": "Team Sister - District Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256398", "validThrough": "2020-11-18T23:59:59+0000"}