{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18899", "minValue": "18899", "unitText": "YEAR", "value": "£18,899 per annum all inclusive"}}, "datePosted": "2020-10-27T15:45:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Apprentice Administrator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will play an important role within the corporate nursing team. The post holder will provide efficient and comprehensive administration support. This will include arranging meetings, creating and managing documents and diary management. We are looking for individuals with a positive approach to change who are supportive of service improvements.&lt;/p&gt;\n&lt;p&gt;Applicants will need to be computer literate in Microsoft Word, Microsoft Excel and Microsoft Outlook with excellent accuracy in data input.&lt;/p&gt;\n&lt;p&gt;The post holder will be offered the Business and Administration Diploma Level 3 Advanced Apprenticeship in order to develop their skills and knowledge. The post holder will be supported in the workplace to achieve the knowledge, skills and competencies required to successfully complete the diploma.&lt;/p&gt;\n&lt;p&gt;On successful and timely completion of the Apprenticeship plus Performance Development Review by their manager, the post holder may be offered the substantive post under Band 3 Agenda for Change Terms and Conditions.&lt;/p&gt;\n&lt;p&gt;Please note that this post is across our main sites.&lt;/p&gt;\n&lt;p&gt;Chelsea and Westminster NHS Foundation Trust has values that we summarise with a five letter word. In the first line of your opening statement insert and complete the statement &quot;The word that summarises the Trust values is ...&quot;Your supporting statement needs to have address this phrase. Your answers will tell us that you’re the kind of person that lives our values every day hence this will be a criteria for you to move to the shortlisting stage.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Richard Jackson, Quality Improvement Lead&lt;/p&gt;\n&lt;p&gt;Richard.jackson@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel:&lt;span style=&quot;text-decoration: underline;&quot;&gt; 020 3315 0040&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Middlesex University Hospital and Chelsea and Westminster Hospital, Isleworth", "postalCode": "TW7 6AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4741", "longitude": "-.326168"}}, "title": "Apprentice Administrator, Corporate Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245250", "validThrough": "2020-11-08T23:59:59+0000"}