{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata for part time"}}, "datePosted": "2020-10-30T08:16:44+0000", "description": "&lt;p&gt;2 x Permanent and 2 x Fixed Term/Secondment&lt;/p&gt;\n&lt;p&gt;The Sheffield Teaching Hospitals NHS Foundation Trust is situated in the rapidly modernising industrial city of Sheffield. The area allows a high quality of life, boasting leisure and lively cultural activities in the centre and being surrounded by the scenic countryside of the Peak District.&lt;/p&gt;\n&lt;p&gt;The third largest NHS Trust in the UK, we are focused on delivering the highest quality patient care across a multi-site operation within the City of Sheffield. For a caring professional like you, we have the environment and opportunity to enable you to explore and discover your true potential. We also enjoy strong links wit the University and as a major teaching hospital we offer excellent training and development.&lt;/p&gt;\n&lt;p&gt;The core of your role will be supplying a positive team leadership for the PACU team, ensuring a high standard of patient care is delivered in a safe, professional environment.&lt;/p&gt;\n&lt;p&gt;Working towards degree level credits in associated pathway, you will have extensive experience in managing a busy clinical area with proven expertise in resource, financial and workload management. You will also be an effective leader, communicator and motivator with the ability to manage and champion change.&lt;/p&gt;\n&lt;p&gt;This role is exempt from the Rehabilitation of Offenders Act and/or a regulated activity. Therefore the Trust legally requires any successful candidates entering into this role to complete a Disclosure &amp; Barring Service (DBS) check. Therefore, successful candidates will be required to complete a DBS application form.&lt;/p&gt;\n&lt;p&gt;Please ensure you read the DBS Employee Guidance Document at the foot of the NHS Jobs page, which provides further guidance on the requirements for this check and your responsibilities in complying with this check should you be successful at interview.&lt;/p&gt;\n&lt;p&gt;Following a UK Border Agency announcement on 23rd December 2010, Tier 1 applications made from Overseas will no longer be accepted. Therefore applications for this vacancy requiring this Tier 1 status cannot be processed.&lt;/p&gt;\n&lt;p&gt;This vacancy is advertised on a fixed term contract basis for the maximum period of 12 months. Where there is potential, the secondment/fixed term contract may finish early, or in the first instance, the secondment/fixed term contract may be extended due to the internal/external secondment of the substantive post holder. The fixed term contract status of the post holder will be reviewed in accordance with the Trust&#39;s legal obligations regarding fixed term contracts and secondments in relation to the substantive post holder.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karen Horton&lt;/p&gt;\n&lt;p&gt;Matron&lt;/p&gt;\n&lt;p&gt;RHH Operating Services&lt;/p&gt;\n&lt;p&gt;Telephone: 0114 2268781&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Laurie Faux&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Lead Practitioner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;0114 2268816 / 2712023&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As part of the recruitment process at application stage, Sheffield Teaching Hospitals will assess applicants’ individual values and behaviours to ensure that these behaviours align with our PROUD values: Patient First, Respectful, Ownership, Unity and Deliver.&lt;/p&gt;\n&lt;p&gt;Our values are what help to make us different and ‘a Brilliant Place to Work’. We expect all our employees to share our values and demonstrate them in every aspect of their role.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake an online values assessment at application stage and the results of this assessment will be used as part of the on-going selection process to assess your suitability for the post.&lt;/p&gt;\n&lt;p&gt;The deadline for completing the online assessment is midnight 22/11/2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The link to the assessment can be found below, the address can be copied and pasted into a search engine e.g. google:&lt;/p&gt;\n&lt;p&gt;login.talentqgroup.com/Login/SelfService/AGCKWRBWCN&lt;/p&gt;\n&lt;p&gt;If you have any queries, require any assistance to complete this assessment or have already completed it within the past 12 months, please contact the Trust Recruitment Team at &lt;strong&gt;sth.centralrecruitment@nhs.net&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Hallamshire Hospital, Sheffield", "postalCode": "S10 2JF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3785", "longitude": "-1.49346"}}, "title": "Senior Practitioner (Post Anaesthetic Care Unit)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249355", "validThrough": "2020-11-06T23:59:59+0000"}