{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pro rata per annum"}}, "datePosted": "2020-11-06T09:31:10+0000", "description": "&lt;p&gt;We are looking for enthusiastic and committed Band 5 nurses to join the nursing team within Ward 22 at Scunthorpe General Hospital.&lt;/p&gt;\n&lt;p&gt;Ward 22 is a 29 bedded medical ward specializing in Respiratory Medicine –this area offers the chance for you as a Registered Nurse to develop your expertise in acute respiratory nursing whilst increasing your skills and knowledge in acute medical nursing. Our patients have a variety of respiratory conditions such as COPD, Asthma, Lung Cancer, Pulmonary Embolus, and Pneumothorax and will require a range of interventions such as chest drains, oxygen therapy, and non-invasive ventilation. It is a high turnover, dynamic environment that is continually evolving to meet the needs of our patients.&lt;/p&gt;\n&lt;p&gt;Ward 22 is a well led organised ward, with a great team spirit- its therefore a great place learn – the ward has a number of mentors and supports students’ from all disciplines to develop their knowledge and skills. It is also well supported by a number of Clinical Nurse Specialists, meaning you have access to a wealth of knowledge to help you develop your nursing caree&lt;br /&gt;Our nursing staff and physicians value and work closely together to provide outstanding, cutting edge care for our patients, creating an environment in which one can grow and reach high potential; and will reward you with professional growth and career development.&lt;br /&gt;&lt;br /&gt;We can offer opportunities for career progression within a friendly and supportive learning environment. Applicants should hold 1st level registration and, like the rest of our nursing team, demonstrate motivation towards delivering the highest standard of nursing care and the ability to work as part of a multi disciplinary team. &lt;br /&gt;&lt;br /&gt;Applicants should have a minimum of six months post registration experience in an area of acute care and already hold their NMC PIN Number. In addition, experience in emergency care or minor injuries unit would be advantageous; however, full training will be given if required. These posts will provide great learning and development opportunities to the successful applicant&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Michelle Longbone, Ward Manager 22, tel 03033 302212 email michellelongbone@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe", "postalCode": "DN15 7BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5875", "longitude": "-.666943"}}, "title": "Staff Nurse - Ward 22 - Scunthorpe", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259030", "validThrough": "2020-11-22T23:59:59+0000"}