{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-05T12:46:08+0000", "description": "&lt;p&gt;Specialist Community Dietitian&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a friendly, enthusiastic, confident Dietitian to become part of the Community Dietetic Team delivering community healthcare around Central Lancashire. The permanent post will be based at Minerva Health Centre in Preston but flexibility to work and travel around the area is required. We offer a mentoring and clinical supervision programme with an experienced clinician for those new to community work.&lt;/p&gt;\n&lt;p&gt;The successful candidate will gain a wide range of dietetic experience. These roles are development roles for staff who wish to specialise. You will gain the opportunity to be involved in working within specialised areas including mental health, home enteral feeding, nutritional support, diabetes and gastroenterology. You will be supported and guided by a specialised dietitian within each rotation who will enable you to gain invaluable experience in these areas. We have a strong commitment to ongoing professional and personal development.&lt;/p&gt;\n&lt;p&gt;We recognise these roles will support place based care and be aligned to localities.&lt;/p&gt;\n&lt;p&gt;Your role will involve the assessment and implementation of care plans for patients in their own home, care homes and community locations including community hospitals. Assist in the training of health care professionals and carers and maintenance of IT systems that support patient care.&lt;/p&gt;\n&lt;p&gt;The department has excellent IT facilities with good clerical support across the Preston, Chorley and South Ribble locality.&lt;/p&gt;\n&lt;p&gt;The department is involved in the training of Dietetic students with the University of Chester.&lt;/p&gt;\n&lt;p&gt;Preston city and our surrounding areas have good motorway and train links to Greater Manchester including the cities of Manchester, Salford and Liverpool. The Greater Manchester and Liverpool areas are rich in sport and cultural activities. Beautiful countryside is easily reached for those who like the outdoors.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Team Leaders Kate Fayad or Christine Elwell on 01772 644155&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Specialist Community Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257707", "validThrough": "2020-11-19T23:59:59+0000"}