{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum plus Fringe HCAS"}}, "datePosted": "2020-11-04T13:32:00+0000", "description": "&lt;p&gt;Surrey Heartlands CCG is seeking a Primary Care Administrator who will provide both administrative and project support to members of the Primary Care Team across Surrey Heartlands. This is a critical supporting role, which will enable the efficient functioning of the wider team. The post holder will be motivated and enthusiastic, with a keen eye for attention to detail, as well as a proactive approach. The post-holder will play a key role in providing administrative and project support, including organisation of meetings and events, and the preparation and production of agendas and minutes. The post-holder will be the main contact person for queries from GP practices, and as such will need to have strong inter-personal skills and be confident in developing relationships with a wide range of stakeholders.&lt;/p&gt;\n&lt;p&gt;Microsoft Word, Excel and Outlook experience is essential. Experience of working in the NHS is preferable but not essential. This is a fast paced work environment and we are looking for an Administrator who thrives from this. Some travel may be required.&lt;/p&gt;\n&lt;p&gt;We would warmly welcome any questions about this opportunity - please contact Emily Taylor (details on the right), in the first instance.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey Heartlands CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128537"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Home based", "postalCode": "KT22 9AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2931", "longitude": "-.335021"}}, "title": "Primary Care Commissioning Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256035", "validThrough": "2020-11-11T23:59:59+0000"}