{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa (plus London Weighting)"}}, "datePosted": "2020-10-30T19:30:19+0000", "description": "&lt;p&gt;&lt;span&gt;The Redbridge Access and Assessment/ Brief Intervention Service was formed in 2009 as a Single Point Of Entry into Secondary Care. The Service accepts referrals for adults from 18 to 65 years of age. Sources of referral include GP, the Intake &amp; Home treatment teams, Inpatient wards, Psychiatric liaison Service at King George’s Hospital. We are a progressive service that provides a full MDT service providing assessment of mental health conditions and offer treatment options based on bio psycho-social lines over 6months to 1 year. All patients are offered core and risk assessments and then offered a comprehensive treatment package that is fully linked with the community resources and group based care. Our patients are not severe enough to require CPA engagement though they may be key worked. The service is linked closely to the CRT and EIP services at Mellmead House where referrals are directly made. We have a caseload of about approximately 340 patients per 1wte Consultant. There are 2.5 WTE consultants in the post. The Consultant clinic is expected to have 20 contacts per week and the discharge rate is 10%.We have leads in nursing, OT and Social Care and we discuss all clients through a RAG service in the weekly Zoning meeting on Wednesdays. We are closely affiliated to the CRT Teams and we hold specialist Well-being Clinics (to cater for non-CPA Depot clients), and Physical Health Clinics for patients with SMI.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Patients within the Service have access to psychology input as required. A personality disorder service providing dialectical behaviour therapy and mindfulness interventions are also available in the Trust and patients can be referred to this service as required. There is a forensic liaison service from East London NHS Foundation Trust, which regularly visits Mellmead House and provides advice and support to the CRTs as required. Drug and Alcohol services are based within the borough and provided by East London NHS Foundation Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Discharge planning starts at the point of entry to the Service. Staff work in partnership with patients and carers shall identify needs, to agree appropriate outcomes and service provision necessary to support them in their journey of recovery for the period of time their care is managed by secondary care mental health services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a part time consultant post in General Adult Psychiatry based at Redbridge Access Assessment and Brief Intervention Team, Mellmead House, 4 Orchard Close, Rodney Road, Wanstead E11 2DH. The employing organisation is North East London NHS Foundation Trust. The doctor will be working closely with other 2 consultants in Access and all consultants will be expected to cross cover annual leave and sickness.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post provides sound clinical experience including in areas such as assessment and management of a broad range of mental health conditions, mental state examinations, risk assessments, medical treatments, multidisciplinary model of team working, interface with primary care, cross cultural psychiatry.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is access to local academics, trust wide academics, a variety of free courses within the Trust and also to the monthly Bart’s academic programme. As a number of general adult mental health services are co located in Mellmead House, the post holder will work alongside several other trainees including GP trainees, middle grades, higher psychiatric trainees and consultants in an active learning atmosphere.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The consultant psychiatrist will receive office space for Direct Clinical Care and SPA. All notes are recorded on Rio (an electronic patient journal system). There is Section 12 work, a working knowledge of the MHA including the Code of Practice to ensure fair assessment and treatment is necessary. There are no CTO or conditionally discharged patients within the Shared Caseload. There are infrequent home visits and the ability to drive is beneficial. He/she will work closely with other consultant psychiatrist, the multidisciplinary team, the staff grade psychiatrists and the GP trainee in the team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is dedicated secretarial support through two medical secretaries in the team. Wanstead High Street is close by and offers a wide variety of cafes, shops and good public transport links. Car parking is available in and around Mellmead House. Library facilities are available at Goodmayes Hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post requires candidates to have Full GMC Registration with License to Practice in the UK, MRC Psych ( or equivalent) and Section 12 Approval .&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will support their peers and team leader and be an effective team member whilst working on their own initiative. They will supervise junior colleagues. They will have a commitment to collaborative working and actively supporting and liaising with other health and social professionals and agencies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;On call&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The out of hours on call rota is 1 in 50 offsite rotas. It covers the A&amp;E departments of Whips Cross Hospital, Q&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mellmead House Orchard Close Rodney Road, Wanstead", "postalCode": "E11 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5838", "longitude": ".028749"}}, "title": "Consultant Psychiatrist, Access", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251110", "validThrough": "2020-12-01T23:59:59+0000"}