{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T10:31:35+0000", "description": "&lt;p&gt;Following on from local developments within our mental health crisis pathway and a move towards an all age service we are looking to recruit additional Band 6 Mental Health Practitioners - at Stepping Hill Hospital in Stockport.&lt;/p&gt;\n&lt;p&gt;If you are a registered mental health professional with experience in assessing and supporting individuals of any age, either children and young people or older adults and would like to be part of a growing and developing service we would like to hear from you. We are particularly interested in nurse with experience of working within acute and crisis services to support our emergency pathway within the team&lt;/p&gt;\n&lt;p&gt;You will comprehensively assess individuals mental health, risk manage, support and appropriately refer on and signpost patients who come through the range of services within the general hospital. The role is extremely varied and each day is different. The focus of the team is supporting people to receive high quality care in a holistic and person centred way. There is an emphasis on working with non mental health colleagues within the hospital, sharing knowledge and skills and advocating for the mental health and wellbeing of patients.&lt;/p&gt;\n&lt;p&gt;As part of this dynamic and progressive multidisciplinary team you will also be involved in effective interfacing between teams, other mental health services and agencies such as the Police, NWAS and local authority.&lt;/p&gt;\n&lt;p&gt;As part of the Mental Health Liaison service you can expect professional support and development in this exciting and challenging area of work. You will be joining a friendly and supportive team at Stepping Hill Hospital and will receive regular management and clinical supervision and have opportunities to engage in CPD. As a valued member of the liaison team you will be fully involved in all service developments and given opportunities to support quality improvement.&lt;/p&gt;\n&lt;p&gt;The service runs 24 hours a day, 7 days a week, so posts will be worked on a shift basis with 24 hour working required including bank holidays, weekends and some rotational night duties.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire WarhurstJob titleService ManagerEmail addressclairewarhurst@nhs.netTelephone number0161 716 5828Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details about the role or to come and meet the team and have a look at how we operate then please contact: Claire Warhurst – Service Manager Tel: 0161 716 5828 or email clairewarhurst@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Senior Liaison Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255385", "validThrough": "2020-11-18T23:59:59+0000"}