{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-10-26T12:23:07+0000", "description": "&lt;h2&gt;The role&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Are you someone looking to start a career in one of the UK’s most respected mental health trusts?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to be part of a dedicated team committed to those with mental health problems enjoy a better future?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to do a job that makes a difference every day?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for a Liaison Psychiatry Healthcare Assistant to join the Liaison Psychiatry team based in Exeter.&lt;/p&gt;\n&lt;p&gt;Liaison Psychiatry is the branch of psychiatry that specialises in the interface between medicine and psychiatry.&lt;/p&gt;\n&lt;p&gt;We accept referrals from in-patient wards and the Emergency Department. These include requests for specialist mental health assessment and interventions to people of all ages from 18 upwards.&lt;/p&gt;\n&lt;p&gt;The mental health presentations of those accessing our services are varied and include self-harm as well as both functional &amp; organic mental illness.&lt;/p&gt;\n&lt;p&gt;We provide a 24/7 comprehensive service to patients, clinicians and carers. The role is dynamic and challenging.&lt;/p&gt;\n&lt;p&gt;Devon Partnership NHS Trust is growing as we establish ourselves us as one of the leading providers of mental health services in the country.&lt;/p&gt;\n&lt;p&gt;Working as part of Devon Partnership NHS Trust, you will make a difference to people’s lives from the moment you start.&lt;/p&gt;\n&lt;h2&gt;About you&lt;/h2&gt;\n&lt;p&gt;This is an opportunity for a motivated and passionate Healthcare Assistant to support people with mental health presentations in the Royal Devon &amp; Exeter Foundation Trust. You will always work under the supervision of senior practitioners and will support the team in both the delivery of care, as well as the enhancement of positive relationships with our acute Trust colleagues as well as Devon Partnership Trust. The team consists of a number of disciplines including Nurses, Doctors, Social Workers and Occupational Therapists.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be well supported within the team and encouraged to develop their clinical competencies within a stimulating learning environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A team visit is recommended prior to application&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you do not hold a QCF/NVQ Level 3 in Health &amp; Social Care, an equivalent qualification, or the Care Certificate – you will need to complete the Care Certificate within 3 months of commencement of the Band 3 post.&lt;/p&gt;\n&lt;p&gt;If you have a minimum of 6 months experience in the last 2 years working in a care role, but do not hold the Care Certificate you can complete the form “Care Certificate Evidence Document” from the additional documentation list to evidence that this experience is equivalent to the 15 standards as set out within the Care Certificate. You will need to take this completed form to interview where it will be reviewed by the appointing manager and if you meet the criteria, the manager can approve this in place of completing the Care Certificate.&lt;/p&gt;\n&lt;p&gt;More information about the content of the Care Certificate can be found at skillsforcare.org.uk/Learning-development/inducting-staff/care-certificate/Care-Certificate.aspx&lt;/p&gt;\n&lt;p&gt;We will also offer entry onto our Apprenticeship programme to initially undertake the Level 3 in Health &amp; Social Care, this open to applications every 6 months. This allows entry onto our career progression pathway to enable you to undertake further training to degree level clinical posts.If you are interested developing a career in care but do not have the relevant experience required then please contact our Practice Education Team who give your details of our up and coming apprenticeship careers events on dpt.practiceeducation@nhs.net&lt;/p&gt;\n&lt;h2&gt;The location&lt;/h2&gt;\n&lt;p&gt;Exeter&lt;/p&gt;\n&lt;h2&gt;About us&lt;/h2&gt;\n&lt;p&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/p&gt;\n&lt;p&gt;You’ll be part of a team that is compassionate and supportive, and genuinely committed to working together with the people who use our services, their families and carers in everything that we say and do.&lt;/p&gt;\n&lt;h2&gt;Our offer to you&lt;/h2&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. If you are looking to relocate tothefabulous county of Devon we have a relocation package that may be suitable for you.&lt;br /&gt; &lt;br /&gt; Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working&lt;/li&gt;\n&lt;li&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service withtheNHS so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training - including opportunities to work in different services to build your experience and skills&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Living here&lt;/h2&gt;\n&lt;h1&gt;&lt;em&gt;Great place to work. Great place to live&lt;/em&gt;&lt;/h1&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "Liaison Psychiatry Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242408", "validThrough": "2020-11-09T23:59:59+0000"}