{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum/ pro rata"}}, "datePosted": "2020-10-30T10:17:18+0000", "description": "&lt;p&gt;We are looking for a motivated and enthusiastic person to join us in providing comprehensive administrative support to the Sobell House Bereavement and Voluntary Services team.&lt;/p&gt;\n&lt;p&gt;Based in Sobell House, you will provide support to the team by contributing to an efficient and effective administrative service. Essential skills required for the post include – excellent telephone manner, strong interpersonal skills, excellent organisational skills, ability to prioritise tasks, effective time management, the ability to work calmly under pressure on own initiative and to have some office/ clerical experience. The successful applicant will be flexible and organised, providing administration support using increasingly paper-light systems, with duties including data entry, scanning, filing and the upkeep of records. Attention to detail is key as, together with the service administrator, the post holder will be responsible for receiving, maintaining and providing manual and electronic data containing sensitive and confidential information.&lt;/p&gt;\n&lt;p&gt;Good communication skills are essential as you will have some direct contact with patients&#39; family members, as well as with volunteers and other hospice staff . You will have an excellent telephone manner and the ability to maintain composure whether taking messages from bereaved relatives or answering volunteer queries.&lt;/p&gt;\n&lt;p&gt;A request for an informal phone call or visit would be welcome.&lt;/p&gt;\n&lt;p&gt;Please note the salary quoted is pro rata.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date 13/11/20&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Melanie Kay, Bereavement Service Coordinator, sobellbereavementservice@ouh.nhs.uk, 01865 225857&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Churchill Hospital, Oxford", "postalCode": "OX3 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Speciality Administrative Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249700", "validThrough": "2020-11-13T23:59:59+0000"}