{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum, inc HCAS"}}, "datePosted": "2020-10-27T11:31:11+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Programme Management Office Support&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;18 Months Fixed Term due to funding&lt;/strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated, resilient, and forward-thinking Programme Officer to support in the delivery of a range of key strategic projects and service changes at Imperial College Health Partners (ICHP).&lt;/p&gt;\n&lt;p&gt;ICHP is a partnership organisation bringing together NHS providers of healthcare services, clinical commissioning groups and leading universities across North West London. We have been designated by NHS England as the Academic Health Science Network (AHSN) for North West London, and we are one of 15 AHSNs across England which make up The AHSN Network.&lt;/p&gt;\n&lt;p&gt;At ICHP we believe that innovation can be a powerful trigger to create new ways of working.&lt;/p&gt;\n&lt;p&gt;Through working with world leading hospitals, community providers, commissioners and universities, we match health challenges with new innovations. This helps our partners provide the best possible health and care outcomes for North West London’s 2.3 million residents.&lt;/p&gt;\n&lt;p&gt;Our strategic priorities are to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Innovate and collaborate for a healthier population making a real measurable impact; and&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;Diversify our customer base in order to broaden our income sources and work where we can have the largest impact.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our organisation has a range of talents and experiences, bringing knowledge, skills and experience to the way we connect with our stakeholders.&lt;/p&gt;\n&lt;p&gt;At a time where collaboration and innovation are crucial to help meet some of healthcare’s most pressing challenges, there has never been a better time to join us.&lt;/p&gt;\n&lt;p&gt;Role&lt;/p&gt;\n&lt;p&gt;The post holder will be a key member of, and be supported by, an experienced Portfolio Management Office (PMO) team which is central to the planning, monitoring and assurance of the partnership’s diverse portfolio, and we are looking for an exceptional individual who can contribute to the continuous improvement of the partnerships’ PMO.&lt;/p&gt;\n&lt;p&gt;You will provide support to project delivery teams and provide assurance to senior stakeholders that projects are being successfully and effectively delivered through the rigorous application of a robust project management approach, ensuring they are delivered to agreed time, cost and quality criteria, meet the needs of clients and help the Partnership to achieve its strategic objectives. The post requires close working relationships with the PMO team as well as other internal and external stakeholders from across the sector.&lt;/p&gt;\n&lt;p&gt;The ideal candidate is comfortable operating with a fast-paced, start-up mindset in a diverse environment. Having a ‘can do’ attitude and being able to demonstrate the key behaviours that we value (collaboration, courage, quality, and impact) will be essential and you will need to have superb communication skills to not only work effectively and efficiently within the organisation but also to actively build positive and meaningful relationships with multiple external stakeholders and organisations.&lt;/p&gt;\n&lt;p&gt;What we will offer you&lt;/p&gt;\n&lt;p&gt;A healthy, engaged, and well-supported workforce are better equipped to do their best work and, more importantly, enjoy their lives inside and outside the workplace. That is why we are committed to providing an environment with your development and wellbeing at its centre. Other benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We offer a generous pension&lt;/li&gt;\n&lt;li&gt;Flexible working hours&lt;/li&gt;\n&lt;li&gt;Opportunity to work from home&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held on 20 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For informal enquiries: please contact Natalie Angus, Company Secretary/ Associate Directornatalie.angus@imperialcollegehealthpartners.com&lt;/p&gt;\n&lt;p&gt;Tel: 03330771715&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;chris.marot@imperialcollegehealthpartners.com&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Euston, Euston", "postalCode": "NW1 2FB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5265", "longitude": "-.13467"}}, "title": "Programme Management Office Support", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244240", "validThrough": "2020-11-10T23:59:59+0000"}