{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-11-06T12:30:18+0000", "description": "&lt;p&gt;Partners across the wider Devon health and care community are united in a single ambition and shared purpose to create a clinically, socially and financially sustainable health and care system that will improve health and wellbeing across the population of Devon.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and organised individuals to join the STP Programme Team to support this challenging programme of work. You will be working with senior project staff across the health and social care system. The role holder will be expected to assist with project support, document drafting, project planning, research, data collection and presentation, document website administration and general meeting support.&lt;/p&gt;\n&lt;p&gt;You will need to be highly motivated and able to work unsupervised, particularly in current working conditions. Prioritising your own workload and dealing with a number of complex issues at one time whilst working under pressure is key.&lt;/p&gt;\n&lt;p&gt;Successful candidates will have proven excellent organisational and interpersonal skills, to make sure programme delivery operates both efficiently and productively to ensure delivery.&lt;/p&gt;\n&lt;p&gt;Previous experience of system working and basic project management skills would beneficial.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;There is a possibility that this role may become permanent&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128674.jpg", "name": "NHS Devon Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128674"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 4QD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7145", "longitude": "-3.5175"}}, "title": "STP Programme Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259649", "validThrough": "2020-11-20T23:59:59+0000"}