{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata pa inc plus Inner Londo"}}, "datePosted": "2020-11-03T14:16:36+0000", "description": "&lt;p&gt;Lewisham Child and Adolescent Mental Health Services (CAMHS) is looking to recruit a Senior Psychotherapist in a busy multi-disciplinary team offering assessment and treatment to children and young people aged from 0-18 years with a range of mental health problems.&lt;/p&gt;\n&lt;p&gt;The post holder will be a member of the core CAMHS team, and will be responsible for the further development of psychotherapy. Lewisham CAMHS is based in the Kaleidoscope Children’s Centre in Catford, South London. Lewisham is a lively and diverse area, with many nearby transport links to central London. The generic team (Horizon) sits alongside, and works closely with other CAMHS teams such as the Neuro Developmental team, the Symbol team, working with looked after children, and the Lewisham Young Persons Service (LYPS). There is a well-established Psychotherapy discussion group which is open across teams.&lt;/p&gt;\n&lt;p&gt;This post provides the applicant with the opportunity to develop child psychotherapy and psycho-therapeutic thinking within this vibrant and developing team. The successful applicant will have in-depth individual therapeutic skills and confident clinical assessment and risk management skills. The post holder will be a member of the wider senior team in Lewisham CAMHS and will be expected to hold some management and supervisory responsibilities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you feel valued and appreciated and that is why we have a comprehensive benefits package on offer.&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and supporting a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefit from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefit from keyworker housing which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands through Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;South London and Maudsley NHS Foundation Trust encourages and welcomes applications from people with lived experience of mental health challenges. We see this as valuable and recognise the positive impact this experience can have on the work we do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Robin Bennett Job title Consultant Clinical Psychologis Telephone number 0207 138 1250 Additional contact information&lt;/p&gt;\n&lt;p&gt;Danny Goldberger, Consultant Child &amp; Adolescent Psychotherapist on 0203 228 7370&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kaleidoscope, 32 Rushey Green, Catford, London, Lewisham", "postalCode": "SE6 4JF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.45", "longitude": "-.017486"}}, "title": "CAMHS Senior Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254297", "validThrough": "2020-11-10T23:59:59+0000"}