{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum Pro Rata"}}, "datePosted": "2020-10-29T10:02:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Paediatric Community - Clinical Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to work in the Integrated Children&#39;s Nursing and Therapy Team (ICNT). Working in Morecambe Bay supported by a collaborative team of Nurses and Therapists whose joint goal is to improve outcomes for children.&lt;/p&gt;\n&lt;p&gt;We are looking for a Nurse with Paediatric experience to specialise in the management of children at home and school.You will be mentored and supported by the Specialist Nurses and Community Children&#39;s Nurse Lead.&lt;/p&gt;\n&lt;p&gt;In this post you can improve the lives of children and families, reduce unnecessary hospital admissions, support early safe discharge from hospital and ensuring children receive care closer to home.&lt;/p&gt;\n&lt;p&gt;If you are passionate about developing a service for children, if you are committed and enjoy a challenge, are flexible and enjoy working with children and families then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;University Hospitals of Morecambe Bay NHS Foundation Trust (UHMBT) covers a large geographic area which encompasses the Furness peninsula, the city of Lancaster and the Southern Lake District. It provides a comprehensive range of acute and support hospital services to a population of 350,000 based around Morecambe Bay. UHMBT is one of the largest employers in the area, with approximately 6,000 staff working across five sites.&lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nameval.baxter@mbht.nhs.ukJob titleChildren and Young Peoples Community MatronEmail addressVal.baxter@mbht.nhs.ukTelephone number07967767076Additional contact information&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the post please contact&lt;/p&gt;\n&lt;p&gt;Jenny Dodd&#39;s Clinical Lead Community Children&#39;s Nursing 07825914999&lt;/p&gt;\n&lt;p&gt;Val Baxter, Children and Young Peoples Community Matron 07967767076&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ryelands House, Lancaster", "postalCode": "LA1 2LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.057", "longitude": "-2.80224"}}, "title": "Paediatric Community - Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247827", "validThrough": "2020-11-12T23:59:59+0000"}