{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207  pa inc HCAS"}}, "datePosted": "2020-10-29T11:01:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Epsom &amp; St. Helier University Hospitals NHS Trust is rated as Good by the CQC and we’d welcome applications from individuals committed to being part of the team to maintain and build on this&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Do you have a real passion for caring for injured and unwell patients in the Emergency Department?&lt;/p&gt;\n&lt;p&gt;Are you a nurse with the enthusiasm for working in busy clinical environments and with the determination to develop a career in Emergency Care?&lt;/p&gt;\n&lt;p&gt;If so, Epsom and St Helier University Hospitals NHS Trust is the place for you! We have vacancies for Staff Nurses within our Emergency Department.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a great time to join our team and make a difference.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic Band 5 nurses with a passion for patient centred care to join our friendly team in ED. The applicant should have excellent communication and organisational skills and the ability to work in a fast-moving environment. You will be responsible for ensuring the delivery of safe and effective care to our service users and safe discharge of patients. You will also get experience in all aspects of emergency care.&lt;/p&gt;\n&lt;p&gt;As a Trauma Unit we have a newly refurbish and expanded resuscitation suite and are in the process of transforming the acute medical pathway in bringing acute medicine to the front door with our ED and improving out medical and surgical ambulatory pathways.&lt;/p&gt;\n&lt;p&gt;Our ED Senior Charge Nurses and ED Matron will support and encourage you to develop both clinically and managerially and offer a comprehensive induction programme, teaching sessions and in-house training.&lt;/p&gt;\n&lt;p&gt;Applicant must be flexible in shift working pattern to include weekday, night and weekend.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;kamila Kalka  Clinical Matron&lt;/p&gt;\n&lt;p&gt;k.kalka@nhs.net   0208 296 2000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Helier Hospital, Carshalton", "postalCode": "SM5 1AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3801", "longitude": "-.183166"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248023", "validThrough": "2020-11-12T23:59:59+0000"}