{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-05T17:31:07+0000", "description": "&lt;p&gt;Wiltshire Health and Care are now recruiting to a range of exciting development roles for graduate nurses which will include our supportive and comprehensive preceptorship programme.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to join a forward thinking and innovative organisation with dedicated and committed staff who provide outstanding, patient-centric clinical care to adults across Wiltshire. We have a range of opportunities on offer to develop and shape your career pathway that include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Patient’s own homes&lt;/strong&gt;- developing patient centred programmes to meet current and future need with development pathways to Distinct Nurse and Clinical lead&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Community wards&lt;/strong&gt; – with development pathways up to Advanced Care practitioners&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;12m Rotational posts &lt;/strong&gt;&lt;strong&gt;–&lt;/strong&gt; to gain experience and insight into the range of services offered and help inform future career choices in patients’ homes and therapy and nurse led inpatient units&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will also be given the opportunity to work with us as a Band 4 Pre-Registration Nurse until your NMC pin is received&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wilshire Health and Care services are&lt;/strong&gt; rated overall as &#39;Good&#39; with some of our community services rated as &#39;Outstanding&#39; by the CQC.&lt;/p&gt;\n&lt;p&gt;Due to current circumstances, we will be holding a virtual recruitment event which will include presentations about Wiltshire Health and Care and what we can offer you, an opportunity to chat with staff and services to find out what it’s like to work with Wiltshire Health and Care as well as information on our development opportunities. You will also have the opportunity to virtually interview so that we can learn more about and in order to ensure we find the right role for you within the organisation.&lt;/p&gt;\n&lt;p&gt;Please apply now to reistered your interest and find out more about how to start your qualified nursing journey here and be part of the future of Wiltshire Health and Care!&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that this is a rolling advert; applications will be reviewed regularly and candidates contacted as soon as possible throughout this process. If you have any queries, please get in touch with the recruitment team at &lt;/em&gt;&lt;em&gt;whc.recruitment@nhs.net&lt;/em&gt;&lt;em&gt; or on 01249 456591.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wiltshire Health and Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wiltshire", "postalCode": "SN15 2FD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4511", "longitude": "-2.13171"}}, "title": "Graduate Preceptee Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258724", "validThrough": "2020-11-26T23:59:59+0000"}