{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42000", "minValue": "42000", "unitText": "YEAR", "value": "Circa £42,000 pro rata"}}, "datePosted": "2020-10-19T13:13:16+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Cardiac Physiologist in ourCambridge Hospital and play your part in building a healthier nation.&lt;br /&gt;&lt;br /&gt;Cambridge hospital is a 38 bed surgical and oncology hospital which opened in state of the artnew building in 2015 and was rated Outstanding by the CQC in 2016. We have plans for expansion and an exciting partis the development of a diagnostic and interventionalcardiology service working in close collaboration withlocal Cardiology Consultants. We are building a small and dynamic team of key cardiology clinicians tohelp drive and develop this service whilst maintaining our excellent clinical standards and a focus on patient safety&lt;br /&gt;&lt;br /&gt;The Role&lt;br /&gt;&lt;br /&gt;Supporting the Cardiac Unit, as a Cardiac Physiologist you will;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Undertake echo cardiograms.&lt;/li&gt;\n&lt;li&gt;Ensure accurate clinical records are maintained in accordance with professional, statutory and organisational guidelines&lt;/li&gt;\n&lt;li&gt;Provide clinical supervision in line with statutory requirements.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;The Person&lt;br /&gt;&lt;br /&gt;To succeed as a Cardiac Physiologist you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be currently be registered with the RCCP as a Clinical Physiologist.&lt;/li&gt;\n&lt;li&gt;Hold a BTEC ONC and HNC Medical Physics and Physiological Measurement and / or BSc Clinical Science /Physiology or equivalent experience.&lt;/li&gt;\n&lt;li&gt;As required for RCCP registration; you will also have a valid Immediate Life Support certificate.&lt;/li&gt;\n&lt;li&gt;Accreditation with professional bodies such as SCST and BSE would be desirable.&lt;/li&gt;\n&lt;li&gt;An excellent communicator and team worker&lt;/li&gt;\n&lt;li&gt;Be flexible, motivated and committed to the highest standards of patient care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;The Benefits&lt;br /&gt;&lt;br /&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this but we also offer a range of lifestyle and financial wellbeing benefits.&lt;br /&gt;&lt;br /&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt;Salary - Circa £42,000 pro rata&lt;/p&gt;\n&lt;p&gt;Location - Cambridge&lt;/p&gt;\n&lt;p&gt;Weekly Hours - 24 hours&lt;/p&gt;\n&lt;p&gt;Closing Date - 16/09/2020&lt;/p&gt;\n&lt;p&gt;Contract Type – Permanent, part-time&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;“&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore, please apply early to ensure you are considered for the post.”&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge", "postalCode": "CB2 8AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1903", "longitude": ".124295"}}, "title": "Cardiac Physiologist  Echocardiography", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232407", "validThrough": "2020-11-16T23:59:59+0000"}