{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51828", "minValue": "32000", "unitText": "YEAR", "value": "£32,000 - £51,828"}}, "datePosted": "2020-10-23T14:13:54+0100", "description": "&lt;p&gt;Applications are invited for vacancies in the Obstetrics and Gynaecology training programme at ST1 level for HEE local offices and deaneries across England, Scotland and Wales starting from 4 August 2021.&lt;/p&gt;\n&lt;p&gt;The following NHS Employers pay scales will apply (&lt;em&gt;subject to change&lt;/em&gt;):&lt;/p&gt;\n&lt;p&gt;Posts in England - £38,694 - £49,036&lt;/p&gt;\n&lt;p&gt;Posts in Scotland - £32,961 - £51,828&lt;/p&gt;\n&lt;p&gt;Posts in Wales - £32,000 - £50,315&lt;/p&gt;\n&lt;p&gt;Candidates are permitted to have undertaken 24 months experience in Obstetrics and Gynaecology posts (excluding foundation modules and honorary/observer posts) prior to applying for ST1 training.&lt;/p&gt;\n&lt;p&gt;All longlisted candidates will be required to sit the Medical Specialty Recruitment Assessment prior to their interview. The MSRA will be held from 28th January 2021 - 12th February 2021 at various locations across the UK &amp; overseas.&lt;/p&gt;\n&lt;p&gt;All interviews for ST1 Obstetrics and Gynaecology posts will take place on line between 8th March 2021 - 19th March 2021&lt;/p&gt;\n&lt;p&gt;The application window opens on 05/11/2020 and closes on 01/12/2020 at 16:00 UK time. You will not be able to submit your application after this time. Please ensure that you have completed all the relevant sections of the application forms as missing information will deem your application incomplete and it will not be considered.&lt;/p&gt;\n&lt;p&gt;You must apply via our online recruitment system, Oriel. Oriel can be accessed from the link provided. Registration is available to applicants prior to the application window opening.&lt;/p&gt;\n&lt;p&gt;The qualifications and professional registration requirements plus other eligibility criteria can be found in the person specification. The person specification for this specialty is available from the Specialty Training website which can be accessed from Oriel.&lt;/p&gt;\n&lt;p&gt;Please visit the Health Education England (North West) website (contact details can be accessed from Oriel) to find out the following information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Indicative number of vacancies available&lt;/li&gt;\n&lt;li&gt;Likely locations of posts within the training programme&lt;/li&gt;\n&lt;li&gt;Expected rotation details&lt;/li&gt;\n&lt;li&gt;Anticipated outcome of the training programme, subject to satisfactory progression&lt;/li&gt;\n&lt;li&gt;Travel and relocation expenses policy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Eligibility Criteria for recruitment to Specialty Training 2021 – Immigration Requirements&lt;/p&gt;\n&lt;p&gt;From October 2019 ST1 Obstetrics and Gynaecology training is on the Home Office list of Shortage Occupations meaning that for applicants requiring a Tier 2 visa , Resident Labour Market Test, does not need to be met for this specialty&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Evidence of immigration status should normally consist of a biometric residence card, date stamped passport, and accompanying letter from the Home Office. Please visit their website for more information&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Western Deanery", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "England, Scotland, Wales", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "ST1 Obstetrics &amp; Gynaecology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240861", "validThrough": "2020-12-01T23:59:59+0000"}