{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum plus HCAS"}}, "datePosted": "2020-10-30T10:16:50+0000", "description": "&lt;p&gt;This is an exciting opportunity to be part of a major national initiative, and an innovative service which is fundamentally changing the way in which psychological treatments are provided in the NHS in England.&lt;/p&gt;\n&lt;p&gt;You will be part of workforce that will significantly increase access to treatment for people with depression, anxiety and other common mental health conditions, within a Primary Care setting.&lt;/p&gt;\n&lt;p&gt;NELFT Talking Therapies services are third wave sites that provide psychological therapy within the standards of the stepped care model i.e. Step 2 (Low intensity) and step 3 (High Intensity).&lt;/p&gt;\n&lt;p&gt;NELFT is committed to the four Talking Therapies services and the trust is seeking to employ motivated staff to contribute to the success of these services. We are looking to recruit High Intensity Therapists to support our expanding IAPT services.&lt;/p&gt;\n&lt;p&gt;We are looking for applicants who have enthusiasm for working in a primary care setting, who are adaptable; enjoy variety, can work independently as well as understanding the importance of team working.&lt;/p&gt;\n&lt;p&gt;Applicants should be either qualified High-Intensity CBT Therapists ( BABCP-accredited or in the process of applying for accreditation) or Clinical / Counselling Psychologist, They will provide assessments and CBT interventions (individual and group-based) to people with common mental health problems (i.e., depression, anxiety disorders).&lt;/p&gt;\n&lt;p&gt;The main responsibilities of the post:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To be responsible for the comprehensive psychological assessment of clients referred into the service and accepted onto the post holder’s caseload.&lt;/li&gt;\n&lt;li&gt;To formulate treatment plans, based on sound and current theoretical knowledge and good practice, following a thorough and specialist assessment&lt;/li&gt;\n&lt;li&gt;To be responsible for carrying out therapeutic interventions with a variety of clients and using a range of specialist therapeutic interventions as appropriate, with particular emphasis on advanced CBT approaches.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;Priority Post – Assessment/Interview info&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement - London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,722 to a maximum of £4,743).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMina SpathaJob titleRedbridge IAPT Clinical LeadEmail addressmina.spatha@nelft.nhs.ukTelephone number0300 555 1200 ext 67271Additional contact information&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact:&lt;/p&gt;\n&lt;p&gt;Name: Mina Spatha&lt;/p&gt;\n&lt;p&gt;Job Title: Redbridge IAPT Clinical Lead&lt;/p&gt;\n&lt;p&gt;e-mail address: mina.spatha@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redbridge Talking Therapies, Redbridge", "postalCode": "IG3 8XJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.578", "longitude": ".110514"}}, "title": "High Intensity Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249682", "validThrough": "2020-11-16T23:59:59+0000"}