{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum incl. HCAS"}}, "datePosted": "2020-11-03T10:00:52+0000", "description": "&lt;p&gt;Gazzard Day Unit is a chemotherapy and HIV daycare based at Chelsea and Westminster Hospital. Our HIV service is part of the largest in Europe. The opening times are 8-6pm Monday-Friday.&lt;/p&gt;\n&lt;p&gt;A vacancy has arisen, for a Band 5 nurse, in our friendly and dedicated team. Experience in chemotherapy administration, venepuncture and cannulation is desirable but not essential. Most importantly, we seek someone with energy and commitment for our dynamic and fast paced environment where no two days are the same. Our diverse patient population will allow you to develop both clinical skills and a broad knowledge base across several specialties.&lt;/p&gt;\n&lt;p&gt;The unit consists of a combination of beds, treatment chairs and negative pressure isolation facilities. Patients seen here usually have HIV and/or a cancer diagnosis of lung, urology, haematological or HIV related malignancies. They attend the unit for duration of chemotherapy but also for supportive therapies, line management and oncological emergencies. Patients are also admitted to hospital via the unit. These regular attendances allows for continuity of care and our nurses report they find this a particularly satisfying aspect of working here.&lt;/p&gt;\n&lt;p&gt;If you are a registered nurse with a compassionate attitude, excellent communication skills and a drive to help us provide an exceptional patient experience we look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAngela ReapeJob titleCharge NurseEmail addressangela.reape@chelwest.nhs.ukTelephone number02033156151&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelsea and Westminster Hospital, Chelsea", "postalCode": "SW10 9NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.181435"}}, "title": "Staff Nurse - Gazzard Day Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253349", "validThrough": "2020-11-17T23:59:59+0000"}