{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-05T13:45:55+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the Hampshire Bowel cancer screening programme as a Lead Nurse within University Hospital Southampton NHS Foundation Trust (UHS). The successful candidate will be responsible for the delivery of the Hampshire Bowel Cancer screening programmes. This post is offered on a fixed term basis, for 6 months.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;This post will lead a team of bowel screening practitioners to deliver the bowel screening programme across multiple sites including Southampton General Hospital, Royal Hampshire County Hospital in Winchester and North Hampshire Hospitals in Basingstoke. This post also gives the successful candidate to work across organisations regularly liaising with the Screening hub, local CCGs, regional health promotion teams and MDTs across Hospital Trusts.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;This role will be responsible for the development, implementation of Bowel Cancer screening programmes including both FIT and bowel scope. This role involves continually working across organisational and professional boundaries to ensure effective patient/service user outcome and experience.&lt;/p&gt;\n&lt;p&gt;You will be responsible of achieving the quality indicators and delivering the service within the agreed financial envelope. Manage staffing levels to enable the sustainability of the service to meet agreed national and trust access standards and wait times.&lt;/p&gt;\n&lt;p&gt;Lead and support organisational change and wider organisation to ensure efficient service delivery and productivity and compliance with Trust and NHS targets; this could include consultation with staff and promoting new ways of working, implementing new policies and procedures.&lt;/p&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;We are looking for an experience registered nurse who has experience of working in a senior operational delivery/management position.&lt;/p&gt;\n&lt;p&gt;Applicants should have a motivated and enthusiastic approach which has led to evidence of successful leadership and engaging teams through change. The successful applicant will be able to analyse and interpret a range of information including both operational and financial data.&lt;/p&gt;\n&lt;p&gt;If you are a passionate, patient-focussed and motivated individual who lives the Trust values we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Friday, 11 December 2020.&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Collette Byelong&lt;/p&gt;\n&lt;p&gt;Care group Manager&lt;/p&gt;\n&lt;p&gt;Collette.byelong@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381205543&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Lead Nurse for Bowel Screening", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257940", "validThrough": "2020-11-19T23:59:59+0000"}