{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34000", "minValue": "34000", "unitText": "YEAR", "value": "Up to £34,000 - dependent on experience"}}, "datePosted": "2020-10-15T15:07:15+0100", "description": "&lt;h1&gt;I help to make a difference&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Have you ever thought about working within the prison environment? Are you looking for an opportunity to gain experience in a challenging and rewarding role&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Then look no further…&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;What will you be doing?&lt;/h1&gt;\n&lt;p&gt;As the Learning Disabilities Practitioner you will have responsibility for your caseload and will be accountable for all aspects of delivering a service for adults with learning disabilities/ challenging behaviour, within this criminal justice setting. You will be working with adults whose behaviours have resulted in their offending and coming into contact with the criminal justice system.&lt;br /&gt; &lt;br /&gt; You will be working with a multi-disciplinary team to undertake person centered specialist behavioural assessments, planning and co-ordination of positive non-aversive behavioural approaches to service users within HMP YOI Hollesley Bay a diverse range of professionals and service providers.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;What we will need from you?&lt;/h1&gt;\n&lt;p&gt;You will be a registered Learning Disability Nurse with a valid NMC pin and evidence of continued professional development. You&#39;ll collaboratively assess the needs of patients by planning, implementing and evaluating the care given and maintain records associated with this process. This may include the coordination of care of patients and liaising with other members of the multi-disciplinary team where necessary.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will provide outstanding evidence based care, listening and acting on patient feedback so that care is personalised and informed by what matters to them. Focusing on both planned and unplanned care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; You&#39;ll actively encourage patients to work towards ownership over their health and wellbeing and will forge strong links with our partners and stakeholders, providing a service that people can trust, feel safe within and feel proud of.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;Next Steps&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. The recruiter will submit your CV to the hiring manager and in turn will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;More Information...&lt;/h1&gt;\n&lt;p&gt;HMP YOI Hollesley Bay, is a Category D open prison holding males from 18 years on. It is built on a strong reputation in successfully preparing prisoners for final release. Spaced across 85 acres, it is situated in Woodbridge, Suffolk.&lt;/p&gt;\n&lt;p&gt;This is a permanent, full-time role working 37.5 hours per week. The salary for this role is up to £34,000 per annum - dependent on experience&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;em&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woodbridge", "postalCode": "IP12 3JW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0511", "longitude": "1.45136"}}, "title": "Learning Disabilities Practitioner - HMP Hollesley Bay", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228731", "validThrough": "2020-11-16T23:59:59+0000"}