{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Agenda for change"}}, "datePosted": "2020-10-01T12:43:25+0100", "description": "&lt;p&gt;&lt;strong&gt;Candidate Highlights :- Band 6 Occupational Therapist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;HCPC Registration | B. Sc Occupational Therapy |Location :- Hertfordshire |&lt;/p&gt;\n&lt;p&gt;It is a requirement to have a valid, full UK driving licence.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Characteristics/Skills needed :-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Physically fit |Good listeners |Able to motivate people |Calm and understanding |Able to follow procedures |Able to use gym equipment |Willing to demonstrate exercises |Willing to work alone or in a team |Happy to be hands-on with patients |Happy to talk to and work with groups.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;JOB PURPOSE SUMMARY:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;To support Team Leader in delivering of high standard occupational therapy service, including service evaluation. • To organise, develop and maintain an efficient and effective occupational therapy (OT) service. • To undertake therapeutic assessment of patients, some of whom may have complex and diverse conditions, and delegate tasks as appropriate. • Following assessment to provide, develop and implement individual care/treatment plans.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;MAIN DUTIES and RESPONSIBILITIES:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Operational Delivery&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;To provide advice, training and education to other members of the MDT/colleagues regarding the rehabilitation of patients. • To take responsibility for planning, co-ordination and leading assessments. Working with the patient or with carers, relatives and other professionals, making recommendations as required to meet the patient’s need. • To supervise and co-ordinate less experienced staff and students working with the post holder on a daily basis. • To ensure priorities for own work area balance patient related and professional demands.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Patient / Customer Care&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;To formulate and deliver an individual occupational therapy treatment programme based on a sound knowledge of evidence based practice and treatment options using clinical assessment, reasoning skills and knowledge of treatment skills e.g. therapeutic handling, patient education, and other alternative options. • To interpret and analyse clinical and non-clinical information to form an accurate assessment across a wide range of conditions, to recommend the best course of intervention and to develop comprehensive rehabilitation and discharge plans. • To assess capacity, gain valid and effective consent and work within a legal framework with patients who lack capacity to consent to treatment. • To evaluate patient progress, reassess and alter treatment programmes if necessary.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Service Development and Improvement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To undertake measurement and evaluation of OT service through the use of evidence based projects, audits and outcome measures, either individually or in co-operation with others. • To participate in appropriate/relevant working groups where changes will impact on service users. • Contribute to changes in department policy and service development and actively participate in the implementation and review process at department level. • To participate in clinical audit/quality assurance programmes/research as required. • To demonstrate an understanding of Risk Management and apply it to the work situation.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Key relationships:&lt;/strong&gt;&lt;br /&gt;Patients, relatives and carers. • Multi-disciplinary team members, including medical staff within the Trust and Primary Care. • Team Manager for OT and Physiotherapy • In-Patient Therapy Team Leader. • Occupational therapy staff within and external to the Trust. • Other organisations and agencies in the interests of patient care. • Peer networking locally, regionally and nationally.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;EFFORT, PHYSICAL SKILLS and WORKING CONDITIONS:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Physical skills and effort&lt;/strong&gt;&lt;br /&gt;Moderate physical effort required when treating patients, e.g. patients with long-standing mobility problems.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Supplementary Information:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Equality and Diversity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is committed to eliminate racism, sexism and forms of discrimination. The Trust will not discriminate on grounds of age, colour, disability, ethnic origin, gender, gender reassignment, culture, health status, marital status, social or economic status, nationality or national origins, race, religious beliefs, or non beliefs, responsibility for dependants, sexuality, trade union membership or hours of work.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Mobility / Flexibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The normal place of work for the post is as stated above, but as a term of employment post holders may be required to work from any of the Trust&#39;s establishments.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Health and Safety at Work&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In accordance with the Management of Health and Safety at Work Regulations 1992 (as amended) and other relevant Health and Safety legislation, staff have a duty to take responsible care to avoid injury to themselves and others by their work activities and to co-operate in meeting statutory requirements.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Infection Control&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Employees must be aware that preventing healthcare acquired infections and infection control is the responsibility of all staff. Clinical procedures should be carried out in a safe manner by following best practice and infection control policies.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Data Protection and Confidentiality&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Employees must maintain confidentiality when dealing with sensitive material and information and be aware of the Caldicott principles, the Data Protection Act 1998 and the Human Rights Act 1998. The protection of data about individuals is a requirement of the law and if any employee is found to have permitted unauthorised disclosure, the Trust and individual may be prosecuted. Disciplinary action will be taken for any breach.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;No Smoking Policy&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust operates a smoke free policy which means that smoking is not allowed anywhere on Trust sites including buildings, car parks and entrances.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Safeguarding&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Post holders have a general responsibility for safeguarding children and vulnerable adults in the course of their daily duties and for ensuring that they are aware of the specific duties relating to their role. The expectation is that the post holder is familiar with the relevant procedures and guidelines, all of which can be found on the Trust’s intranet.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hertfordshire", "postalCode": "HP2 4TZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7556", "longitude": "-.425633"}}, "title": "Band 6 Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916208503", "validThrough": "2020-12-31T23:59:59+0000"}