{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "pro rata pa inc plus Inner London HCAS"}}, "datePosted": "2020-11-04T16:16:22+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are inviting applications from enthusiastic psychologists for a part-time Highly Specialist Clinical Psychologist with the ARFID Team, part of the Maudsley Centre for Child and Adolescent Eating Disorders (MCCAED).&lt;/p&gt;\n&lt;p&gt;MCCAED is a comprehensive, specialist Eating Disorders Service for young people aged up to 18 years and based at the Michael Rutter Centre at the Maudsley Hospital, Denmark Hill. The service includes the outpatient eating disorder clinic, primarily seeing young people with anorexia nervosa and bulimia nervosa; the out-patient Avoidant Restrictive Food Intake Disorder (ARFID) clinic, which accepts local and national referrals; and the Intensive Treatment Programme (ITP) for young people with restrictive eating disorders. The wider multi-disciplinary team consists of Family Therapists, Psychiatrists, Clinical Psychologists, Clinical Nurse Specialists, Assistant Psychologists with Paediatric and Dietetic input.&lt;/p&gt;\n&lt;p&gt;The ARFID service is a fast developing, innovative service, providing specialist assessment, treatment, consultation and training, and seeing children and young people (from 2 up to 18 years) and their families. We offer a friendly and supportive multi-disciplinary team environment, staffed by highly experienced clinicians who are keen to support your wellbeing at work and your professional development. We provide plenty of opportunities to develop your knowledge and expertise, with potential for further, specialist training appropriate to the post. The post will involve some home working (in particular during the COVID pandemic), with equipment provided as required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for providing:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;expertise in highly specialist clinical assessment, treatment and consultation relevant to ARFID&lt;/li&gt;\n&lt;li&gt;research and development initiatives and output which will contribute to clinical and research requirements and developments in the field of ARFID&lt;/li&gt;\n&lt;li&gt;supervision to more junior members of staff&lt;/li&gt;\n&lt;li&gt;professional expertise in the form of contributions to the clinical multi-disciplinary team, MCCAED colleagues and the wider department&lt;/li&gt;\n&lt;li&gt;liaison with professionals from other agencies as indicated&lt;/li&gt;\n&lt;li&gt;teaching and training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located at Denmark Hill less than 5 minutes from the train station (zone 2). We also provide services and operate across other locations, such as London boroughs of Croydon, Lambeth, Lewisham and Southwark; and substance misuse services for residents of Bexley, Lambeth, Greenwich and Wandsworth.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you feel valued and appreciated and that is why we have a comprehensive benefits package on offer.&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave. &lt;/strong&gt;We offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance. &lt;/strong&gt;We support a range of flexible working options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development. &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease. &lt;/strong&gt;Our staff benefit from competitive deals to lease cars.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation. &lt;/strong&gt;Our staff benefit from keyworker housing, which is available on selected sites.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts. &lt;/strong&gt;With discounts of up to 10% from a variety of well-known retail brands through the Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Rachel Bryant-WaughJob titleConsultant Clinical Psychologist and Lead Clinician ARFID ServiceEmail addressrachel.bryant-waugh@slam.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;MCCAEDAdmin@slam.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Michael Rutter Centre, Maudsley Hospital, London", "postalCode": "SE5 8SN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4696", "longitude": "-.087073"}}, "title": "Highly Specialist Clinical Psychologist (ARFID Service)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256596", "validThrough": "2020-11-11T23:59:59+0000"}