{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependant on experience"}}, "datePosted": "2020-10-30T12:16:58+0000", "description": "&lt;p&gt;&lt;strong&gt;NHS Herefordshire and Worcestershire CCG&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;NHS Herefordshire and Worcestershire CCG is the NHS commissioning organisation for Herefordshire and Worcestershire and was established on 1 April 2020 following a merger of NHS Herefordshire CCG, NHS Redditch and Bromsgrove CCG, NHS South Worcestershire CCG and NHS Wyre Forest CCG.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;ASSOCIATE DIRECTOR OF NURSING &amp; QUALITY&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;HOURS - FULL TIME&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;VSM – Competitive Salary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is a unique opportunity for a talented individual to join our amazing Quality and Nursing Team, within a very forward thinking, ambitious and progressive Clinical Commissioning Group (CCG).  This is an exciting time to join the CCG as we progress with our journey with all system partners to become an Integrated Care System (ICS).&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will need to have the necessary drive and credibility to provide strong, visible clinical leadership to a portfolio of work that includes,&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- Having the strategic and operational responsibility for the CCG NHS Continuing Health Care and Funded Nursing Care Service.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- Leading and managing a large team of staff with the responsibility for quality assuring and quality monitoring NHS commissioned health and care services in Nursing Homes and Domiciliary Care Providers.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- Overseeing and supporting the transformation and delivery of End of Life Care Services across the ICS, including the implementation of a new ICS End of Life Care Strategy.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- Deputising for the Chief Nursing Officer with both internal and external commitments.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a senior member of the Quality and Nursing Team you will have responsibility for contributing to a culture that demonstrates our values and behaviours. You should have a track record in leading teams, previous experience of working within the field of NHS Continuing Health care and have recent experience of working in a Senior Nursing position.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;For more information please contact Lisa Levy, Chief Nursing Officer on 07702 897067&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;or email lisa.levy@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are committed to Equal Opportunities and welcome applications regardless of age, gender, race, disability or sexual orientation. We are committed to offering an interview to all applicants with a disability who meet the minimum criteria for the post.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The CCG seeks to be a supportive caring employer and expects all colleagues to behave in a professional and respectful manner and demonstrate the values which underpin our vision for the population of Herefordshire and Worcestershire: that through an integrated care model, local people will live well in a supportive community with joined up care, underpinned by specialist expertise and delivered in the best place by the most appropriate people.&lt;br /&gt;Prospective employees are therefore also expected to demonstrate these values throughout the process.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128360.png", "name": "NHS Herefordshire and Worcestershire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Coach House, Worcester", "postalCode": "WR3 7NS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2169", "longitude": "-2.21576"}}, "title": "Associate Director of Nursing and Quality", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250138", "validThrough": "2020-11-13T23:59:59+0000"}