{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 Per Annum"}}, "datePosted": "2020-11-03T15:16:30+0000", "description": "&lt;p&gt;Exciting opportunities have arisen to work in this inpatient Secure Mental Health service at Guild Lodge Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THE POST IS FULL TIME FOLLOWING A SHIFT PATTERN &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Lancashire &amp; South Cumbria NHS Foundation Trust is a specialist mental health Trust providing adult mental health and substance misuse services to the residents of Lancashire and South Cumbria. The Trust also provides low and medium secure care and forensic services.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Lancashire &amp; South Cumbria NHS Foundation Trust is a great place to work and has a sound future as a leading provider of excellent mental health and substance misuse services. The Trust invests in its staff and seeks to provide them with opportunities for training and personal development.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Secure Mental Health Care for Lancashire and South Cumbria is provided at Guild Lodge, Whittingham. The service has steadily expanded from it’s inception in 1999 and currently has a range of inpatient and community services including 164 inpatient beds.&lt;/p&gt;\n&lt;p&gt;Guild Lodge consists of 3 main service lines (15 wards), which include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Men’s service&lt;/li&gt;\n&lt;li&gt;Women’s service&lt;/li&gt;\n&lt;li&gt;Acquired Brain Injury Service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Caring for adults within Medium and Low Security, and Step Down environments.&lt;/p&gt;\n&lt;p&gt;Each of the services has their own model of care and provides bespoke training in addition to the comprehensive LSCFT Induction and local induction.&lt;/p&gt;\n&lt;p&gt;Applications are now invited from motivated, innovative and reliable individuals who would like to join a multi-disciplinary team committed to delivering excellent care within a Secure environment. Applicants will have a strong sense of compassion, respect for others and team working. They must demonstrate a desire to support and care for others yet be comfortable working with clients who present challenging behaviours.&lt;/p&gt;\n&lt;p&gt;The Secure Service Network provides high quality care for men and woman, with acquired brain injuries who experience enduring mental illness with a range of complex cognitive, relational and mental health difficulties and risk-related needs. Our core values include a focus on developing excellent therapeutic relationships with service users and working jointly to understand their rehabilitation needs, ensuring optimal quality of life. We value working in a way which enhances our service users’ sense of empowerment, choice and control and develops their positive sense of self. This post will be suited to someone with experience of understanding, managing challenging and emotionally demanding clinical presentations. The individual will be able to guide, support, supervise and role-model on how to respond to these challenges. We welcome applications from people who are motivated to work in an informed way and who enjoy both the challenges and sense of achievement that can be experienced as part of this work.&lt;/p&gt;\n&lt;p&gt;This post will be suited to those looking for and with experience of understanding, managing challenging and emotionally demanding clinical presentations. The individual will be able to guide, support, supervise and role-model within a team on how to respond to these challenges and offer excellent quality care.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be able to experience a broad range of clinical specialities and will have access to a comprehensive package of professional coaching, education and clinical support.&lt;/p&gt;\n&lt;p&gt;Guild Lodge hospital site is situated in beautiful rural area, yet close to motorway links from all directions of travel (improved greatly with a new bypass soon to be opened).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The hospital site offers:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free staff parking&lt;/li&gt;\n&lt;li&gt;Onsite restaurant facilities&lt;/li&gt;\n&lt;li&gt;Access to new housing area with local school&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Our valued staff receive:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Induction and support for those new to the services&lt;/li&gt;\n&lt;li&gt;Extensive mandatory training for all staff&lt;/li&gt;\n&lt;li&gt;Access to salary sacrifice schemes for cars, electronics etc.&lt;/li&gt;\n&lt;li&gt;Excellent support and Wellbeing services&lt;/li&gt;\n&lt;li&gt;Superb external training and development opportunities&lt;/li&gt;\n&lt;li&gt;Opportunities to develop skills across differing care environments&lt;/li&gt;\n&lt;li&gt;1:1 support from clinical supervision&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will be an enthusiastic and motivated individual, who is caring and compassionate with an interest support individuals in their recovery. The individual needs to be able to role model and have good understanding of confidentiality and boundaries. They also need to demonstrate effective communication skills as well good IT and written skills. The individual will be required to work shifts and work with the Multi-Disciplinary Team to ensure the delivery of a quality service in line with CQC essential standards.&lt;/p&gt;\n&lt;p&gt;Please note that an assessment day for interview to take place will take place on Monday 30th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Louise Eland, Project Manager on: 01772 406730&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guild Lodge, Preston", "postalCode": "PR3 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8165", "longitude": "-2.65834"}}, "title": "Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254524", "validThrough": "2020-11-17T23:59:59+0000"}