{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "24157", "unitText": "YEAR", "value": "Up to £24,157 per annum"}}, "datePosted": "2020-11-06T09:45:43+0000", "description": "&lt;p&gt;West Kent Primary Care (WKPC) is a dynamic and innovative GP Federation that oversees support to 54 GP practices and 9 Primary care networks in West Kent. The GPs work collaboratively to learn from each other and build their PCNs. They have excellent clinical leadership through their Clinical Directors. The ongoing development of the PCNs is supported by the WKPC Operations team.&lt;/p&gt;\n&lt;p&gt;WKPC is a community Interest company that provides favorable terms and conditions and has a track record of employing a variety of workforce on behalf of the PCNs. We work closely with other health and social care system partners such as the Acute Trust and Community Provider and we are an established member of the Integrated Care Partnership in West Kent.&lt;/p&gt;\n&lt;p&gt;In West Kent we are working with other providers to support the healthcare system during the COVID crisis and respond to increasing demand. We are creating two key initiatives to form the West Kent Primary care treatment centre during the winter season:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;COVID Virtual Ward &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The COVID Virtual Ward will be led by an experienced nurse who will support Health Care Assistants to virtually follow patients who are COVID positive and who are considered high risk due to long standing health conditions. These patients require close monitoring via a telephone triage service to ascertain that they are remaining clinically stable at home. In addition, the Senior nurse will act as a site manager for the hot hubs which are dedicated GP clinics set up to review patients in person that are potentially symptomatic of COVID. These clinics will be delivered by GPs and their practice nurses who participate in the rota.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The COVID Virtual Ward is looking to recruit initially for a 5-month fixed term contract: &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;X1 band 7 Lead Nurse (salary up to £44, 530 per annum)&lt;/p&gt;\n&lt;p&gt;X2 band 6 Nurse posts (salary up to £37,890 per annum)&lt;/p&gt;\n&lt;p&gt;X2 band 4 Health Care Assistant posts (salary up to £24,157 per annum)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The Home Visiting Service &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Home Visiting Service will consist of Physician Associates and Nursing Associates providing home visiting support for Primary care. Some home visits will be referred from the Virtual COVID Ward and other visits will involve visiting non - COVID patients for usual home visits to help support GPs.&lt;/p&gt;\n&lt;p&gt;The team will be led by two GP Clinical Directors from West Kent who will provide leadership, support and guidance. In addition, the team will receive support from some GPs who have a specialist interest in Frailty.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The home visiting team is looking to recruit initially for a 5-month fixed term contract:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;X2 band 7 Physician Associate posts (salary up to £44,503 per annum)&lt;/p&gt;\n&lt;p&gt;X2 band 4 Nursing Associates or trainees (salary up to £24,157 per annum)&lt;/p&gt;\n&lt;p&gt;WKPC would hope to be able to provide ongoing permanent contracts for Physician Associates and Nursing Associates or those wishing to train to be Nursing Associates within PCNs from next April as ongoing funding opportunities become available and PCNs look to continue to expand their workforce which they are all extremely keen to do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Receptionist/ Administration Assistants (salary to be confirmed on enquiry)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;1-2 receptionists/ Administrators&lt;/p&gt;\n&lt;p&gt;WKPC is looking to appoint receptionists/administers to support the booking of appointments into the virtual covid ward the hubs and the home visiting service. The post holder will be pivotal to the team and will help to coordinate appointments.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;These roles &lt;/strong&gt;&lt;strong&gt;will be based at either Maidstone or Pembury Hospital sites. &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Salary depending upon experience.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Please see Job description for further information. &lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone or Pembury", "postalCode": "ME14"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2957", "longitude": ".562727"}}, "title": "Covid Virtual Ward – Band 3/4 Health Care Assistants", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259070", "validThrough": "2020-11-15T23:59:59+0000"}