{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T10:46:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse - Critical Care &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you seeking an exciting new challenge?&lt;/li&gt;\n&lt;li&gt;Would you like the chance to join a dynamic team caring for the most critically ill patients and the opportunity to develop your skills and knowledge to provide care for Level 2 and 3 patients?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you think you like the sound of this – there’s more…..&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are looking to recruit committed and self-motivated Band 5 nurses.&lt;/li&gt;\n&lt;li&gt;We offer &lt;span&gt;8&lt;/span&gt; weeks supernumerary status where you will be allocated a mentor and supervisor to work alongside – our structured induction programme helps prepare you for your critical care nursing career.&lt;/li&gt;\n&lt;li&gt;We support staff in the completion of the nationally recognised Step competency booklets. We have our own in-house Critical Care course and support staff to complete the Critical Care post registration course.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If this sounds interesting - then you maybe you are the person we are looking for!&lt;/p&gt;\n&lt;p&gt;The Critical Care Unit at the University Hospital of North Midlands is a dedicated state of the art facility which provides care for seriously ill patients from across a range of medical and surgical specialities including neurosurgery and major trauma as well as being one of the designated Major Trauma Centres within the West Midlands. We provide the highest standards of care for patients who have sustained traumatic brain and spinal injuries.&lt;/p&gt;\n&lt;p&gt;Critical Care prides itself by actively supporting all staff in their continued educational and professional development. We also provide all newly recruited staff with an excellent preceptorship period supported by our very own Practice Development team.&lt;/p&gt;\n&lt;p&gt;As a Staff Nurse you will be responsible for providing high quality care and support to patients and families as part of the wider Critical Care team.&lt;/p&gt;\n&lt;p&gt;In order to fulfil the job role and learning requirements, and meet service needs, successful candidates will be required to work a full rotation on both days and nights.&lt;/p&gt;\n&lt;p&gt;If you are a dynamic, enthusiastic nurse with the ability to work well within a highly motivated team, and can deliver high quality nursing care we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;There are limited full and part time positions available so be quick and apply today!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For an informal visit or enquiries please contact one of our Senior Sisters on 01782 675771/679037, or the Practice Development Senior Sister on 01782 675509&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke-on-Trent, Stoke-on-Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Band 5 Staff Nurse - Critical Care Pods 3-6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251657", "validThrough": "2020-11-16T23:59:59+0000"}