{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata + 5% of basic"}}, "datePosted": "2020-10-27T15:31:45+0000", "description": "&lt;p&gt;We are currently seeking motivated and skilled mental health practitioners to join us in a key service development. Following a successful pilot project we are building and developing the Primary Care Mental Health Liaison service in the St Albans and Borehamwood areas. This exciting development is in line with the Five Year Forward View for Mental Health and recognises that by placing specialist mental health staff in GP practices promoting early assessment and treatment in a recovery focused way, will help the service user achieve the best outcomes&lt;/p&gt;\n&lt;p&gt;We are seeking to build a team of Band 6 mental health practitioners with a relevant professional qualification (nursing, social work, OT) who will be based within the primary care setting. We currently have 22.5 hours in the St Albans area and 18.75 in Borehamwood. The practitioners will offer primary care mental health liaison support to GP surgeries within a designated hub of surgeries and will have the opportunity to support the development and implementation of this service in West Hertfordshire. The service will provide support to those being referred for support and will also seek to support primary care practitioners in the transfer of service users from secondary care to primary care.&lt;/p&gt;\n&lt;p&gt;The post holders will provide specialist advice, support and consultation to primary care practitioners as well as offering timely support to service users (and where relevant their carer’s), within local GP surgeries. This post will also provide the opportunity to work alongside various professional groups including GP’s and other primary care professionals, community navigators and wider community agencies. Post holders will receive clinical support and supervision from operational managers and a Consultant Psychiatrist.&lt;/p&gt;\n&lt;p&gt;We are seeking applicants with extensive knowledge and experience of working with individuals with mental health needs and who possess advanced assessment and formulation skills. We also welcome applicants with relevant registration who are keen to develop their clinical skill base. The role requires our staff to be confident, flexible and dynamic in their approach to their work with a positive outlook to working within a fast paced environment, You will be able to work autonomously whilst also being a good team player. In return for this you would be offered continued training, and an opportunity to contribute to service development whilst working within a friendly and supportive team.&lt;/p&gt;\n&lt;p&gt;At HPFT we view our staff as our most important resource and offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A thorough induction to your role and team&lt;/li&gt;\n&lt;li&gt;A regular, good quality supervision&lt;/li&gt;\n&lt;li&gt;Access to Lead clinician for your area promoting professional development&lt;/li&gt;\n&lt;li&gt;A range of developmental opportunities to support you to grow in your profession and your practice&lt;/li&gt;\n&lt;li&gt;The opportunity to apply to work flexibly so that you can balance your work with your life outside work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Dudeney - 07833 235 057&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various primary care sites, West Herts  - Watford, Hertsmere and St Albans", "postalCode": "WD18 0JP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6567", "longitude": "-.40142"}}, "title": "Primary Care Mental Health Liaison Practitioners", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245219", "validThrough": "2020-11-10T23:59:59+0000"}