{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "Band 6 £31,365 - £37,890 per annum (or Band 5)"}}, "datePosted": "2020-10-16T10:02:05+0100", "description": "&lt;p&gt;CLINICAL TECHNOLOGIST (DOSIMETRIST) BAND 6 (or 5) IN RADIOTHERAPY PHYSICS&lt;/p&gt;\n&lt;p&gt;The Radiotherapy Physics Service is seeking an enthusiastic Clinical Technologist/ Radiographer to join a team providing a scientific and technical service to the Radiotherapy department at The Royal Shrewsbury Hospital (RSH). Shrewsbury and the surrounding Shropshire county area provide a pleasant rural environment with affordable housing and motorway access to nearby city amenities.&lt;/p&gt;\n&lt;p&gt;The applicant should have a minimum of 2 years post qualification knowledge of treatment planning and mould room practice in radiotherapy. The candidate should also possess an accredited Degree in Clinical Technology (Radiotherapy Physics), or Therapy Radiography.&lt;/p&gt;\n&lt;p&gt;Applicants completing their final year of appropriate Graduate Diploma or Qualified Therapy Radiographers will be considered on a lower band.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be required to participate in the development and implementation of new techniques and work as a team member in a multi-disciplinary clinical environment. Mentoring and training of other staff members is an essential part of this role.&lt;/p&gt;\n&lt;p&gt;The Radiotherapy Service has implemented an extended treatment day of 08:00 to 18:00. This is usually worked over four days with one day off per week. The post holder would be expected, at a suitable time and by agreement, to participate flexibly in this initiative.&lt;/p&gt;\n&lt;p&gt;The Royal Shrewsbury Hospital Treatment Centre is based around Varian networked therapy equipment and uses the Eclipse treatment planning system. IMRT/VMAT &amp; IGRT are in routine clinical use at the centre above target levels, with new clinical sites in development. SABR is currently being commissioned on site. The Trust&#39;s Radiotherapy physics team comprises eleven clinical technologists and nine clinical scientists supporting radiotherapy services.&lt;/p&gt;\n&lt;p&gt;We are an accredited training centre for the Dosimetrist (Graduate Diploma) programme, STP/HSST Radiotherapy Physics and IPEM Radiation Engineering.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Radiotherapy Physics, The Royal Shrewsbury Hospital, Shrewsbury", "postalCode": "SY38XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Clinical Technologist (Dosimetrist)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229545", "validThrough": "2020-11-11T23:59:59+0000"}