{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-16T16:31:37+0100", "description": "&lt;p&gt;The Post&lt;/p&gt;\n&lt;p&gt;The advertised post is for Consultants in OMFS, primarily based at the Ipswich Hospital however the post holder will be cross site and will be required to offer clinics and theatre lists from the Colchester site.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to provide a full range of OMFS, including treatment of maxillofacial injuries, benign and diagnostic tumour surgery and the correction of facial deformities and orthognathic surgery.&lt;/p&gt;\n&lt;p&gt;Provide maxillo-facial expertise to local branch of the combined Anglia East Head and Neck MDT. Definitive surgery is currently carried out at the NNUH. The local MDT is composed of ENT surgeons, Oncologists, plastic surgeons and is appropriately supported by a number of AHPs&lt;/p&gt;\n&lt;p&gt;Take and share the consultant clinical responsibilities within the Department. The precise allocation of session time will be agreed with consultant colleagues, but it is envisaged that there will be 2.5 operating sessions per week, and a bimonthly medical audit/teaching session. The policy of the Trust is to develop and increase the amount of day surgery as a proportion of the total workload&lt;/p&gt;\n&lt;p&gt;Assist in teaching, and training of junior staff, medical students, nursing and allied health professionals&lt;/p&gt;\n&lt;p&gt;Share in the rota of consultant cover for emergency work can be discussed, and the post-holder will provide cover for colleagues during leave and other authorised absences&lt;/p&gt;\n&lt;p&gt;The following is the proposed on-call arrangement:&lt;/p&gt;\n&lt;p&gt;1:3 on call cover based on the Ipswich site. This is a 3 tier system with 1&lt;span&gt;st&lt;/span&gt; tier resident&lt;/p&gt;\n&lt;p&gt;undertake audit of their clinical and organisational work and present or record this within the Trust and department audit programmes&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma NunnJob titleGeneral ManagerEmail addressEmma.Nunn@esneft.nhs.ukTelephone number07584187124&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester &amp; Ipswich,", "postalCode": "CO4 5JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9102", "longitude": ".899214"}}, "title": "CONSULTANT IN ORAL AND MAXILLOFACIAL SURGERY", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231130", "validThrough": "2020-11-16T23:59:59+0000"}