{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pro rata"}}, "datePosted": "2020-11-04T15:15:22+0000", "description": "&lt;p&gt;Senior Acute Care Practitioner-&lt;/p&gt;\n&lt;p&gt;Looking for a fresh career within Psychiatric Nursing?&lt;/p&gt;\n&lt;p&gt;Lincolnshire Partnership NHS Foundation Trust is recruiting an exceptional Band 6 Practitioner for our Lincoln based Crisis Resolution and Home Treatment Team. This service provides 24hr care.&lt;/p&gt;\n&lt;p&gt;The team provide a swift response to people who are in acute phase of mental illness which involves both assessment and treatment. The team currently run the Crisis Vehicular Response Service, which provides an urgent response to referrals. We also work in partnership with Lincolnshire Police to have a Mental Health Professional based in the Police Force Control Room&lt;/p&gt;\n&lt;p&gt;This is an exciting time for LPFT, as we continue on our journey of service improvement, undergoing a range of service transformations and delivering high standards of care for our patients.&lt;/p&gt;\n&lt;p&gt;To be successful in this role, we want to hear from Practitioners who really want to ‘make a difference’, with the Trust values at the core of patient care and who have previous experience of working with acute mental illness, or are seeking to develop a career within acute care.&lt;/p&gt;\n&lt;p&gt;You will be joining a forward thinking Trust, where, at our most recent CQC inspection we were rated overall as ‘&lt;strong&gt;Good&lt;/strong&gt;’ and given &lt;strong&gt;‘outstanding’&lt;/strong&gt; for well led.&lt;/p&gt;\n&lt;p&gt;Lincolnshire is a large county which can offer you whatever you are looking for, in both your personal or your professional life. The county has vibrant towns and the City of Lincoln at its core, as well as idyllic rural villages, offering a high quality of life with affordable living, excellent education and social life facilities – sound interesting? All this with easy access via the A1 and A46 to Newark, Nottingham, Sheffield, Grantham, Grimsby &amp; Hull – all within an hour&lt;/p&gt;\n&lt;p&gt;LPFT offers an excellent benefits package, continued professional development and support, career opportunities and relocation assistance where required.&lt;/p&gt;\n&lt;p&gt;Successful applicants would be required to undertake a full police vetting application in order to work in the police force control room.&lt;/p&gt;\n&lt;p&gt;If you would like to be considered for this post we look forward to hearing from you. If you require any further information please contact Hannah Darrant or Anna Black ( Team Co-ordinators) on 01522 573648.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peter Hodgkinson Centre, Greetwell Road, Lincoln", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Senior Acute Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256377", "validThrough": "2020-11-19T23:59:59+0000"}