{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28560", "minValue": "28560", "unitText": "YEAR", "value": "Up to £28,560"}}, "datePosted": "2020-10-29T11:44:10+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Have you ever thought about working in a prison environment?&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt;Are you looking for an opportunity to gain experience in a challenging and rewarding role?&lt;br /&gt; &lt;br /&gt;Then look no further… HMP Leeds is a Cat B adult male prison located in Leeds, West Yorkshire.&lt;br /&gt; &lt;br /&gt;Practice Plus Group are the Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt; &lt;br /&gt;You will assist with the provision and delivery of an integrated pharmaceutical service based on National (Divisional) policies supported with local standard operating protocols, taking into consideration, at all times, the need to maintain a high level of security. You&#39;ll be required to support the delivery of Pharmacy Services, which will be part be of a comprehensive healthcare package, based on the prison service’s needs. As a Pharmacy Technician, you will be an integral member of the Pharmacy Team, who forms part of the wider cluster of Healthcare Services. Practice Plus Group policies and procedures and statutory frameworks governing patient care in a prison setting, will be used in order to deliver the highest standard of care to patients in line with National Guidelines.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The Job Requirements&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt;You will hold NVQ Level 3, BTEC or equivalent qualifications and must have a current registration with the General Pharmaceutical Council to be considered for this role. You will also have relevant post-qualification experience working within a pharmacy environment and multi-disciplinary team. You’ll be able to demonstrate assessment skills, including undertaking of risk assessments and have sound patient counselling skills, treating patients with respect and dignity at all times, adopting a culturally sensitive approach.&lt;br /&gt; &lt;br /&gt;As a Pharmacy Technician, you may be required to take on a role of working across multiple Pharmacy Services if and when required. If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Salary and Benefits&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt; &lt;br /&gt;The salary range is up to £ 28,560 per annum - dependent on experience. Practice Plus Group benefits include training &amp; development opportunities, company contributory pension scheme, 25 days annual leave plus 8 public bank holidays, staff well-being, access to bank hours, CPD, re-validation, cycle to work scheme, on-site gym facilities and free onsite parking at some locations. We are also proud to support our employees with continued professional development opportunities and further education subject to service needs...&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Further Job Information&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt;This is a full time vacancy, working 37.5 hours per week. We reserve the right to close this advert earlier than stated if sufficient number of applications has been received. Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and employment is subject to receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS12 2TJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7956", "longitude": "-1.5761"}}, "title": "Pharmacy Technician - HMP Leeds", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248150", "validThrough": "2020-11-12T23:59:59+0000"}