{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa pro rata"}}, "datePosted": "2020-10-26T15:15:36+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Specialist FCP in MSK &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;MSK Outpatient Physiotherapy &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full and Part Time Opportunities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ready for a new challenge in 2020?&lt;/p&gt;\n&lt;p&gt;We are looking for a competent, driven professional to join our increasing first contact physiotherapy team offering a new MSK pathway.  FCPs are qualified autonomous clinical practitioners who can assess, diagnose, and manage MSK problems and undifferentiated conditions, and where appropriate, discharge a person without a medical referral. You need to be a self-motivated person, keen to take part in data collection and evaluation of this exciting opportunity for developing advanced practitioners in physiotherapy This post will be based in GP surgeries covering  the Chippenham, Corsham and Box patient populations&lt;/p&gt;\n&lt;p&gt;You must be able to demonstrate excellent assessment and clinical reasoning skills that this post will require, within a variety of musculoskeletal, orthopaedic and general health conditions. Good communication skills with a variety of people, conditions and within demanding situations will be an asset.&lt;/p&gt;\n&lt;p&gt; Experience of electronic patient records and telephone triage will be an advantage. You will join a friendly team with other physiotherapy and  primary care staff and will be supervised by APP clinicians. An FCP Implementation Lead will provide support to the growing FCP team. Staff are required to work towards the National MSK Core Capabilities framework for First Contact Practitioners (NHS England) 2018. This role is developmental post and once you have worked through the competencies there will be the opportunity for advanced Practice competency development to a Band 8a. &lt;/p&gt;\n&lt;p&gt;The MSK service for Wiltshire is based in 9 community hospitals and additional GP clinics with excellent links to our acute hospitals in Bath, Salisbury, and Swindon. We receive MSK referrals from GPs, Orthopaedics, A&amp;E, Rheumatology, Midwives and other Health Care Professionals. Alongside MSK Physiotherapy we deliver services in Hand Therapy, Rheumatology, Women’s and Men’s Health and Amputees.&lt;/p&gt;\n&lt;p&gt;Wiltshire Health and Care is a partnership, focused solely on delivering improved community services in Wiltshire and enabling people to live independent and fulfilling lives for as long as possible.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are an NHS partnership formed by the three local Foundation Trusts which serve Wiltshire:&lt;/li&gt;\n&lt;li&gt;Great Western Hospitals NHS Foundation Trust&lt;/li&gt;\n&lt;li&gt;Royal United Hospitals BathNHS Foundation Trust&lt;/li&gt;\n&lt;li&gt;Salisbury NHSFoundation Trust&lt;/li&gt;\n&lt;li&gt;We will be responsible for the delivery of adult community health services in Wiltshire from July 2016, for at least the next 5 years; however this role offers a permanent NHS contract.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact-&lt;/p&gt;\n&lt;p&gt;Emily Thomas 07958130110&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wiltshire Health and Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chippenham", "postalCode": "SN15 2AJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4525", "longitude": "-2.12672"}}, "title": "Clinical Specialist FCP in MSK", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243085", "validThrough": "2020-11-10T23:59:59+0000"}