{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata)"}}, "datePosted": "2020-10-23T15:45:43+0100", "description": "&lt;p&gt;&lt;strong&gt;Children’s Community Therapy Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Children and Families Division&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: City wide service, locations are various, and will include community/educational settings &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Grade: Band 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £31,365 &lt;/strong&gt;&lt;strong&gt;to&lt;/strong&gt;&lt;strong&gt; £37,890 pro rata &amp; &lt;/strong&gt;&lt;strong&gt;depending&lt;/strong&gt;&lt;strong&gt; on experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract type: Permanent – Full Time - Term Time Only&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Proposed Interview dates: week commencing 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Come and join us to work within a new and exciting service across the city of Birmingham, working alongside education and local authority partners, supporting a graduated approach to helping children with Special Educational Needs and Disabilities (SEND).&lt;/p&gt;\n&lt;p&gt;Are you passionate about supporting, promoting, and sharing good practice with educational colleagues, families, children and young people across the city, strengthening their skills in supporting the SEND agenda?&lt;/p&gt;\n&lt;p&gt;We are delighted to be able to offer committed, experienced and dynamic Speech and Language Therapists (SLTs) and Occupational Therapists (OTs) the opportunity to join our friendly and forward thinking children’s community therapy services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In support of the SEND developments in Birmingham, we are in a position to allocate 1 SLT posts and 2 OT posts to work in the newly defined SEND localities. We are looking for therapists who have experience of successful collaborative working with families, educational settings and the wider multi-agency team. Candidates must also have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;well developed clinical and negotiation skills&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;experience with providing training to parents and/or education settings&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;experience of contributing to the monitoring, review and evaluation of service provision &lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will contribute to the development of the SLT and OT services alongside colleagues and the Professional Clinical Leads. You may also have responsibility for supervision of designated staff.&lt;/p&gt;\n&lt;p&gt;If you are looking for a challenging role in which no two days are th&lt;/p&gt;\n&lt;p&gt;the same, we want to meet you. We need therapists who are adaptable, innovative and who enjoy working autonomously and as part of a team.&lt;/p&gt;\n&lt;p&gt;To make effective use of our mobile working technology and IT systems, you will also have good IT skills.&lt;/p&gt;\n&lt;p&gt;The SLT and OT teams work as part of Inclusion Services within the Children and Families Division of Birmingham Community Healthcare NHS Foundation Trust. We work across the whole City, within a range of community and educational settings, thus requiring successful applicants to demonstrate a high level of flexibility.&lt;/p&gt;\n&lt;p&gt;We value our staff and advocate career progression internally. We encourage our therapists to contribute to service development, and we welcome and value new ideas and experiences.&lt;/p&gt;\n&lt;p&gt;We offer a supportive working environment with access to specialist clinical support, and an emphasis on sharing good practice through effective team working.&lt;/p&gt;\n&lt;p&gt;For further information about our departments follow the links below:&lt;/p&gt;\n&lt;p&gt;Access to reliable transport or means of travel is essential. The post-holder may be required to transport items of therapy equipment on a regular basis.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust is committed to providing a safe working environment for all staff.&lt;/p&gt;\n&lt;p&gt;As part of the Trust’s on-going response to the management of COVID-19 secure workplaces, strict health and safety measures and infection prevention and control has been put into place. As with any healthcare setting that cares for patients, we are and remain committed to ensure that we adhere to nationally mandated infection prevention and control policies and practices, alongside the appropriate tra&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mosely Hall, Old Hall, Birmingham", "postalCode": "B13 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4459", "longitude": "-1.89289"}}, "title": "Band 6 Specialist Paediatric Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241152", "validThrough": "2020-11-08T23:59:59+0000"}