{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-21T11:15:19+0100", "description": "&lt;p&gt;Are you a current registered nurse with a Critical Care, Oncology, Haematology or Dialysis background?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Do you have excellent communication skills, are you able to demonstrate/work on your own initiative and do you want the challenge of an exciting, autonomous clinical role?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you answered yes to the above, then this career could be for you...&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Apheresis experience is not essential; however, you should have experience of mentoring, teaching, daily clinical/ward management in an acute environment and are now looking to develop/consolidate your leadership and management skills.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;NHS Blood &amp; Transplant (NHSBT) - Therapeutic Apheresis Services (TAS) is a National team that we are really proud of, we perform inspiring work on a daily basis, so we need you to help us maintain our incredibly high standards. This is your opportunity to hone your clinical and leadership skills as a Nurse Practitioner whilst being involved in our cutting-edge work to improve patient outcomes and save lives.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The services we provide are an area of clinical development and have a vital role in modern healthcare and provide a service to NHS Trusts. TAS provide lifesaving and life enhancing treatments to both adults and children using constantly evolving technology, equipment and techniques to deliver expert treatments to patients.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;TAS provide specialist patient treatments from eight units based within NHS Trusts across England. Selected units are collection sites for the exciting, new and developing CAR-T Therapy for blood cancer patients and collaborate with all 3 UK based donor stem cell registries: Anthony Nolan, British Bone Marrow Registry (BBMR) and DKMS. NHSBT TAS is the UK’s largest NHS service provider for donor registries outside of London. It is our ambition to become the NHS preferred provider of high quality, cost effective therapeutic apheresis services. As a service we are unique, highly expertise and deliver exemplary high standards of care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;TAS delivers a portfolio of treatments which include:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- Automated Red Cell Exchange&lt;br /&gt;- Therapeutic Plasma Exchange&lt;br /&gt;- Stem Cell Harvest&lt;br /&gt;- Extracorporeal Photopheresis&lt;br /&gt;- Lymphocyte Collection&lt;br /&gt;- White Cell Depletion&lt;br /&gt;- Platelet Depletion&lt;br /&gt;- Low Density Lipid Removal&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Nurse Practitioner role involves working as part of a specialised team, acting as a source of clinical expertise and supervising staff and student nurses.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The team performs treatments for NHS Trusts across the &lt;strong&gt;North West&lt;/strong&gt; region, driving is an integral part of the job as you may need to travel between TAS units within and out of region on occasion, and you will therefore need to hold a full driving license and have access to a vehicle. Participation in a weekend and bank holiday on call rota in addition to your contracted hours (up to 18.75 hours per week), will also be required.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;In return, NHSBT is a great national organisation to work for and we offer a rewarding career with great benefits, flexibility, plus every opportunity for development through a comprehensive in-house training package, support of academic study and career development.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For informal enquiries about this vacancy please contact Clare Harrop – Lead Nurse - Therapeutic Apheresis Services (TAS) via email at: Clare.Harrop@nhsbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;This vacancy will close at 23:59 on Sunday 8th November 2020 (subject to change).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Interviews are scheduled to take place on Friday 20th November 2020 (subject to confirmation).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester - The Christie Hospital", "postalCode": "M20 4BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4298", "longitude": "-2.23005"}}, "title": "Nurse Practitioner - Therapeutic Apheresis Services (TAS)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236062", "validThrough": "2020-11-08T23:59:59+0000"}