{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum/pro rata"}}, "datePosted": "2020-11-06T11:31:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Sister / Charge Nurse - Neonatal ICU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Division: Planned Care&lt;/p&gt;\n&lt;p&gt;Care Group: Women &amp; Children&#39;s Health&lt;/p&gt;\n&lt;p&gt;Band: 6&lt;/p&gt;\n&lt;p&gt;Salary: £31,365 - £37,890 per annum/pro rata&lt;/p&gt;\n&lt;p&gt;Interview date: Monday 14th December 2020&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that any applicants who hold a Specialist Neonatal Qualification will also receive an RNR payment of £1500 per annum/pro rata&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting for a &lt;strong&gt;Clinical Sister / Charge Nurse&lt;/strong&gt; who shares our ambition and vision to deliver the &lt;strong&gt;&lt;em&gt;Best of Care by the Best People&lt;/em&gt;&lt;/strong&gt; and has the drive to take us forward, by ensuring that the Trust continues to be the first choice for patients and our staff.&lt;/p&gt;\n&lt;p&gt;As a Clinical Sister / Charge Nurse you will ensure that you are committed to contributing to a team, delivering excellence in neonatal care and are serious about pursuing a rewarding career.&lt;/p&gt;\n&lt;p&gt;The Clinical Sister / Charge Nurse will work in partnership with our team of highly skilled Consultants and Advanced Neonatal Nurse Practitioners who work collaboratively to deliver high quality care to our patients and their families.&lt;/p&gt;\n&lt;p&gt;The role will be based in our level three unit that currently cares for Intensive/High Dependency and Special Care babies. We have recently opened an additional bedded bay within the unit.&lt;/p&gt;\n&lt;p&gt;In addition, consideration will be given to applicants for Band 6 who are Adult or Child Registered Nurses with the Specialist Neonatal qualification. Our experienced Education Team provides a supportive and progressive environment with a strong commitment to induction and preceptorship.&lt;/p&gt;\n&lt;p&gt;The Trust and its employees are all committed to creating and maintaining a fair and supportive working environment and culture.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to you, we will give you the opportunity to utilise and enhance your talents to assist us in the development of shaping the future of Medway NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Trust offers a number of apprenticeships and training opportunities in Leadership and Management, Business Services, Finance, Accounting, Human Resources, Clinical Support Work, Research and Innovation, Nursing Associate and Assistant Practitioner alongside our in-house comprehensive clinical pathways.&lt;/p&gt;\n&lt;p&gt;Our hope is that our education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the protection of children, young people, their families and vulnerable adults accessing its services. Promoting the message that “safeguarding is everyone’s business” is vital to ensure our patients are protected and safe from abuse. To this end you must comply with Trust’s and the Kent and Medway Safeguarding Board’s policies on safeguarding children, young people and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anna Francis&lt;/p&gt;\n&lt;p&gt;Matron - NICU&lt;/p&gt;\n&lt;p&gt;annafrancis@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Clinical Sister / Charge Nurse - NICU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259439", "validThrough": "2020-11-26T23:59:59+0000"}