{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Per annum prorata"}}, "datePosted": "2020-10-26T10:01:20+0000", "description": "&lt;p&gt;Service/Ward/Department Summary:&lt;/p&gt;\n&lt;p&gt;Our Rehabilitation and High Support Directorate (RHSD), part of the Trust’s Specialist Services Division, provides low secure care for men and a range of step-down services for both men and women, along with a Psychiatric Intensive Care Unit (PICU) for men.&lt;/p&gt;\n&lt;p&gt;We aim to support service users to reach their full potential and optimum level of independence and to enhance their life skills and community functioning. The ultimate aim is to enable service users to safely integrate back into their local communities, where appropriate.&lt;/p&gt;\n&lt;p&gt;Our RHSD services are delivered at nine bespoke units, which are age and gender specific (with the exception of one mixed sex unit) and are located across the Pennine Care footprint either within the community or on a hospital site.&lt;/p&gt;\n&lt;p&gt;Role Summary:&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Clinical Psychologist to work in our PICU as part of the multidisciplinary team (MDT). The post holder will have the support of an Assistant Psychologist.&lt;/p&gt;\n&lt;p&gt;Cobden Unit is a ten bedded male PICU situated at Stepping Hill Hospital, Stockport.&lt;/p&gt;\n&lt;p&gt;The post will require you to provide specialist psychological assessment, formulation and intervention to service users who present with complex mental health problems, including psychosis, self-harm and other behavioural and emotional difficulties. You will be expected to attend multi-disciplinary meetings and to facilitate regular clinical discussion groups to offer the MDT reflective space for formulation meetings, case presentations and training. In addition you will provide one-to-one clinical supervision to psychologists and to other members of the MDT delivering psychological interventions. The post will require you to be involved in service developments and governance within the service as required.&lt;/p&gt;\n&lt;p&gt;The Psychology Service at RHSD currently consists of a Consultant Clinical Psychologist, five Band 8a Highly Specialist Clinical Psychologist posts, including this post, and four Band 6 Assistant Psychologist posts.&lt;/p&gt;\n&lt;p&gt;Key Responsibilities of the Post:&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Carry out specialist psychological assessments and formulations&lt;/li&gt;\n&lt;li&gt;Offer both group and individual interventions&lt;/li&gt;\n&lt;li&gt;Provide a psychological perspective at multi-disciplinary meetings&lt;/li&gt;\n&lt;li&gt;Offer supervision, training and consultation to the MDT&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Key Requirements of the Person Specification:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Doctoral level training in Clinical Psychology as accredited by the BPS and registration with the Health and Care Professions Council&lt;/li&gt;\n&lt;li&gt;Evidence of working in an inpatient setting (psychiatric rehabilitation/ PICU/acute)&lt;/li&gt;\n&lt;li&gt;Willingness to work as part of a psychology team providing input into the PICU. Skills in models of service delivery and an ability to articulate the value added by clinical psychology services within the context of multi-disciplinary mental health inpatient services.&lt;/li&gt;\n&lt;li&gt;Experience of specialist psychological assessment, formulation and intervention&lt;/li&gt;\n&lt;li&gt;Experience of providing clinical supervision to other psychological therapists&lt;/li&gt;\n&lt;li&gt;Experience of working in a multi-disciplinary team&lt;/li&gt;\n&lt;li&gt;Knowledge of the application of clinical governance and risk management policies&lt;/li&gt;\n&lt;li&gt;Skills in providing supervision and consultation to others&lt;/li&gt;\n&lt;li&gt;Skills to teach and train others&lt;/li&gt;\n&lt;li&gt;Ability to play an active role in service development via evaluation, audit and research&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Rachel Chin: Consultant Clinical Psychologist and Clinical Lead for Psychological Therapies in RHSD&lt;/p&gt;\n&lt;p&gt;Contact Number: 07824 432 955&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Poplar Grove, Stockport, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Highly Specialist Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241943", "validThrough": "2020-11-09T23:59:59+0000"}