{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa (pro rata)"}}, "datePosted": "2020-10-20T10:17:32+0100", "description": "&lt;p&gt;Elderly care sister Sheena came to Harrogate to complete her nurse training, and has worked for the Trust ever since. “I wouldn’t want to do anything else,” she says. “The team is well rounded and supports each other in our day-to-day working life.” If this sounds like the kind of team you’d like to be part of, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We care for patients with a wide range of conditions, meaning our nursing staff enjoy a role where no two days are the same, and compassionate patient care is paramount.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Jo Burns, Elderly care matron, has also been with Trust since qualifying 16 years ago. Jo says she is really happy with how her career has progressed and still thoroughly enjoys her time here. If you’re looking for a Trust who will support you to achieve your career goals, Harrogate and District NHS Foundation Trust could be just the place for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a Trust we offer our Registered Nurses:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Access to clinical skills training in our Clinical Skills Lab and personal development courses&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;First Line Leadership programme to help develop your leadership skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Highly recommended two-year Preceptorship Programme and your first year of NMC fees paid&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;4 weeks supernumerary and ongoing mentoring&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Band 6 and 7 development posts&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support and guidance with revalidation&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At Harrogate and District NHS Foundation Trust we provide ‘outstanding’ care to both our patients and our staff. We support staff through benefits, health and wellbeing initiatives and opportunities for personal and professional development.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;An inclusive and supportive culture – our Trust encourages staff to bring their whole selves to work and active Staff Networks identify areas for improvement.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Staff Recognition - as well as regular appraisals, we recognise staff with our Making a Difference and Team of the Month Awards plus the Christmas Oscars.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Employee Support and wellbeing - we have a comprehensive Employee Assistance Programme, counselling service and fast track physiotherapy service for employees.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Staff Benefits - We have a range of staff benefits and schemes to support staff health, engagement, wellbeing and inclusion.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Harrogate is consistently voted the happiest place to live in the UK, with a vibrant local music, arts and foodie scene. Beautiful natural spaces, sports facilities, great shopping and high performing schools make this a great location to settle down in.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To keep up to date with all of our latest Recruitment activity here at Harrogate and District NHS Foundation Trust, please follow us on Facebook : ‘Team HDFT jobs – Harrogate and District NHS Foundation Trust’ and on Twitter: @HDFT_Careers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**This job advert will close as soon as a sufficient amount of applications have been received. Please apply for this job as soon as you can, if you are interested.**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jo Burns Matron  joanne.burns7@nhs.netTelephone 01423 555309&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate District Hospital, Harrogate", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Registered Nurse - Care of the Elderly wards", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233798", "validThrough": "2020-11-10T23:59:59+0000"}