{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069"}}, "datePosted": "2020-10-15T10:01:04+0100", "description": "&lt;p&gt;Applications are invited for a Clinical Fellow ST5+ post in Oculoplastics at the Sussex Eye Hospital, Brighton, starting 04/08/2021 until 02/08/2022.&lt;/p&gt;\n&lt;p&gt;The Sussex Eye Hospital within Brighton and Sussex University Hospital is a specialist eye hospital and the main training hub of the Kent, Surrey and Sussex Deanery/School of Ophthalmology. We serve a population of approximately 750,000, through the hub at the Sussex Eye Hospital and the spoke unit at Princes Royal Hospital (with oculoplastic work at both sites). It is a tertiary referral unit for oculoplastics with orbital, lacrimal, paediatric and complex eyelid cases being referred from a wider population of around 1.5 million.&lt;/p&gt;\n&lt;p&gt;The oculoplastics fellowship is an intensive fellowship, under the supervision of Mr Saul Rajak, with supervised and independent operating (according to experience) and the opportunity to conduct multidisciplinary surgery with other specialities such as ENT and neurosurgery. It has a strong research component and the post-holder is expected to take an active role in ongoing and new research studies and clinical and surgical improvement projects.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Goudman, Head &amp; Neck Directorate PA&lt;/p&gt;\n&lt;p&gt;Email address: e.goudman@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton", "postalCode": "BN2 5JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8174", "longitude": "-.112525"}}, "title": "Oculoplastics Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227618", "validThrough": "2020-11-15T23:59:59+0000"}