{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-27T12:16:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you highly motivated and passionate about providing support to children and young people with low to moderate mental health difficulties and would like to do so as part of a Mental Health in Schools Team (MHST)? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If so, we are excited to tell you more about Mental Health Supervisor role …&lt;/p&gt;\n&lt;p&gt;As part of the Mental Health in Schools Team (MHST) the post holder will provide interventions for young people referred into the service. As a mental health practitioner/ supervisor the post holder will have particular responsibility for providing advice on child and adolescent mental health matters to the education system and schools in which you are working with.&lt;/p&gt;\n&lt;p&gt;You will be one of the first points of contact for the MHST for many partner agencies and contribute to the formation and delivery of care plans for young people within the MHST team in line with the agreed clinical thresholds.&lt;/p&gt;\n&lt;p&gt;You will facilitate referral to other services where appropriate but will support and work with colleagues in schools and Wellbeing partnership boards to manage children and young people’s needs without specialist referral whenever possible.&lt;/p&gt;\n&lt;p&gt;You will develop close working relationships with key partner agencies in their locality, including GP practices, schools, colleges, public health and social care practitioners.&lt;/p&gt;\n&lt;p&gt;You will provide support to other team members and provide clinical supervision to the education mental health trainees/practitioners in line with the university training on supervising.&lt;/p&gt;\n&lt;p&gt;Attendance and successful completion of the CYP – IAPT supervisory course is part of the expected job description and delivery of this role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in one of the most desirable places within the UK?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working here in Somerset, you can soak up all that the idyllic countryside has to offer with our areas of outstanding beauty and stunning coastlines. You get to enjoy these perks whilst still only being a stone’s throw away from bustling city centres like Bristol, Bath and Exeter and only two hours away from London.&lt;/p&gt;\n&lt;p&gt;There are excellent educational facilities in the area and, when compared to other regions, house prices are reasonable. You get to experience the best of both in Somerset, the countryside and the cosmopolitan – there is truly something for everyone!&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Wendie Noble&lt;/p&gt;\n&lt;p&gt;Job title Clinical Lead&lt;/p&gt;\n&lt;p&gt;Email address Wendie.Noble@SomersetFT.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number01823 368 481&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Foundation House, Taunton", "postalCode": "TA2 7PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0318", "longitude": "-3.10241"}}, "title": "Mental Health Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244426", "validThrough": "2020-11-12T23:59:59+0000"}