{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 £40,037-£74,661 dependent on exp"}}, "datePosted": "2020-10-23T11:02:08+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you a motivated and compassionate doctor looking for an opportunity to practice and develop your acute medical skills? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you enjoy the challenge of assessing and managing a wide range of pathologies in a complex group of patients? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like a predictable work pattern as a crucial member of a skilled group of professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are delighted to offer the opportunity for two motivated individuals to complement our growing Frailty Service as &lt;strong&gt;Specialty or Trust Grade Doctors&lt;/strong&gt;, depending on prior experience. Each post carries 10 PAs (8.5 DCC / 1.5 SPA) and will initially be for a fixed term of 12 months, with an aim to extend to a substantive arrangement after successful appraisal and performance review.&lt;/p&gt;\n&lt;p&gt;As part of an overall plan for enhanced and expanded front door frailty provision, we intend to increase middle grade medical input into our multidisciplinary team. Successful applicants will join a group of highly skilled and enthusiastic professionals who provide comprehensive acute assessment and intervention for older people living with frailty.&lt;/p&gt;\n&lt;p&gt;The Frailty Service aims to deliver a crisis response which is timely, person centred and of high quality. We hope to improve overall patient well-being through holistic assessment and care planning and enhance systemic productivity by avoiding hospital admission or reducing the length of stay required. Our work requires lots of compassion, problem solving and teamwork. It is often challenging but is also highly rewarding.&lt;/p&gt;\n&lt;p&gt;Our new doctors will assume a central clinical role within this busy and dynamic MDT, bringing specialist medical assessment and decision making skills. A particular area of focus will include the management of frailty syndromes such as falls, immobility, fragility fractures, dementia, delirium, mood disorders, incontinence, malnutrition, pressure area breakdown, polypharmacy and end of life care.&lt;/p&gt;\n&lt;p&gt;At present, patients are predominantly received from our Emergency Department and Acute Medical Unit. However, with recruitment and service expansion we hope to build on this core activity to receive patients directly from community and ambulance services, develop rapid access assessment pathways and allow the early review of patients with higher levels of acute illness.&lt;/p&gt;\n&lt;p&gt;Additional duties and opportunities will include the supervision and education of junior doctors attached to the service, engagement in service measurement and quality improvement processes and helping in wider hospital and locality efforts to improve frailty awareness and knowledge.&lt;/p&gt;\n&lt;p&gt;This post will provide excellent experience in acute frailty and interface medicine and we are happy to help support and encourage employees in their educational, research and professional development goals.&lt;/p&gt;\n&lt;p&gt;It will be an exciting time to join the Frailty Service. It is seen as a key element of a variety of local initiatives, including the creation of purpose built frailty facilities within a completely new Acute and Emergency Care Centre and the frailty focussed integration of local primary, secondary, community, social and voluntary care agencies under the Walsall Together banner.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Andrew O&#39;NeillJob titleConsultant Geriatrician and Frail Elderly Service LeadEmail addressandrew.o&#39;neill@walsallhealthcare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120984.jpg", "name": "Walsall Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120984"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walsall Manor Hospital, Walsall", "postalCode": "WS2 9PS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5822", "longitude": "-1.99918"}}, "title": "Middle Grade Doctor - Frailty Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240204", "validThrough": "2020-11-25T23:59:59+0000"}