{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 per annum (inclusive of HCAS)"}}, "datePosted": "2020-10-28T09:48:18+0000", "description": "&lt;p&gt;&lt;span&gt;Berkshire Healthcare’s vision is to provide the best care in the right place; developing and delivering excellent services in local communities with people and their families to improve their health, well-being and independence. We pride ourselves in recruiting staff who display our values and the right behaviours and work hard to create a culture which respects all of our staff for the unique contribution they make to ensuring high quality care is delivered. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Berkshire Specialist Perinatal Mental Health Service has been developing and expanding since the introduction of Wave 1 (NHSE) funding in 2016 and continues to grow. We are currently looking for an enthusiastic and dedicated mental health clinician to work in a Rapid Response Clinician role. The role will form part of our Duty and Assessment Team, who respond promptly to referrals made to the Perinatal Service in line with National Perinatal Standards. The Rapid Response role will include: attending Strategy Meetings, Crisis Team handovers, Initial Assessments (within 48 hours of referral) and liaison with relevant health and social care providers as appropriate. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We work with patients, who are either experiencing acute and severe mental health issues or are at high risk of relapse during the perinatal period. We aim to help them to understand and manage their illnesses and symptoms in relation to their experience of pregnancy and motherhood, as well as facilitating their recovery, engaging with families and carers and other agencies. We also have a specialist Birth Trauma Pathway, which provides assessment, information and treatment for patients significantly affected by their birth experience.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are a health driven team with multi-professionals such as; medical staff, psychology, nursery nurses, peer support, mental health nurses and social workers all based together. This allows us to provide locally based services which are responsive to the needs of those open to our service. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Rapid Response role provides lots of opportunities for learning, career development, as well as multi-agency whilst supporting patients who require a specialist level of mental health care and intervention. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;BHFT provide exceptional training opportunities and are undertaking numerous initiatives to improve quality and encourage innovation.&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details and information, or to arrange an informal visit please contact Samantha Danesh-Pour on 07500 783606. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wokingham", "postalCode": "RG40 1XJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4105", "longitude": "-.831558"}}, "title": "Senior Perinatal Mental Health Practitioner (Rapid Response Clinician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245900", "validThrough": "2020-11-11T23:59:59+0000"}