{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa/pro rata"}}, "datePosted": "2020-11-05T11:16:08+0000", "description": "&lt;p&gt;Assistant Practitioner (Transfer to Assess)&lt;/p&gt;\n&lt;p&gt;We are excited to announce that we are recruiting a Band 4 Assistant Practitioner to join our Transfer to Assess Team.&lt;/p&gt;\n&lt;p&gt;The team consists of Occupational Therapists, Physiotherapists and Technical Instructors. We are currently based in care homes across the Wirral, where we have ‘transfer to assess’ step up/step down units, admitting people from community for further assessment and therapy intervention to prevent hospital admission, or from the acute hospital if they need a period of further assessment and therapy prior to discharge home. The work is varied and interesting and required flexibility from the post holder. Your role will be to provide holistic assessments to an identified group of patients and be able to follow them up to enable them to reach their rehabilitation potential, with the support of a multidisciplinary team around you.&lt;/p&gt;\n&lt;p&gt;As this is an enhanced therapy assistant role, the successful candidate will have a prior set of skills as described in the person specification with sound knowledge and experience of working with complex, frail and older people in a rehabilitation setting. You will have excellent communication and interpersonal skills and be able to work closely and collaboratively with a wide range of people, recognising and respecting the contribution of other health and social care professionals/ workers.&lt;/p&gt;\n&lt;p&gt;Ideally, we are looking for someone who already has an Assistant Practitioner qualification (or nearing completion) but will consider applications from individuals who can demonstrate that they are practising at an enhanced level and have achieved competencies equivalent to that of an Assistant Practitioner.&lt;/p&gt;\n&lt;p&gt;You will be well supported in this new role by experienced therapists and via our robust supervision, training and appraisal structure. If you are enthusiastic about being part of a team and developing service, come and join us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jennifer Fell, Service Manager Email address jenniferfell@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126754.png", "name": "Wirral Community Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Catherines Health Centre, Birkenhead", "postalCode": "CH42 0LQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3799", "longitude": "-3.02641"}}, "title": "Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257404", "validThrough": "2020-11-19T23:59:59+0000"}