{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-19T16:24:16+0100", "description": "&lt;p&gt;&lt;strong&gt;Torbay &amp; South Devon NHS Foundation Trust (TSDFT)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5: Community Public Health Staff Nurse – 0 – 19 Torbay&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;TSDFT Vision is a community where we are all supported and empowered to be as well and as independent as possible able to manage our own health &amp; wellbeing, in our own homes. When we need care we have a choice about how our needs are met; only having to tell our story once.&lt;/p&gt;\n&lt;p&gt;TSDFT Community Children’s Services has been rated as Good by the Care Quality Commission (CQC)&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic nurse on Part 1 of the NMC register with an interest in children and young people’s health, development and emotional wellbeing. The successful candidates will be joining the organisation at an exciting time as part of the new 0 to 19 Partnership working in a skill mixed team consisting of staff from TSDFT, Action for Children and the Children Society. Together we are planning to deliver services differently to improve outcomes for children in Torbay developing into a trauma informed service.&lt;/p&gt;\n&lt;p&gt;We are looking for a nurse who is motivated to develop new skills enabling them to provide Public Health Nursing Services to children, young people and their families in Torbay. Applicants should be able to work with a multiagency team and have excellent communication and IT skills. You will have an understanding of the role of a Public Health Staff Nurse and experience of providing services to children, young people, families and their carers.&lt;/p&gt;\n&lt;p&gt;We provide a robust supervision model and development opportunities for staff.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact Andrea Bouchaib&lt;/p&gt;\n&lt;p&gt;0 – 19 Team Leader on 07867 349047 or email andrea.bouchaib@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torbay", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Public Health Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233129", "validThrough": "2020-11-15T23:59:59+0000"}