{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa inc"}}, "datePosted": "2020-10-29T16:15:54+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a suitably qualified Registered Mental Health Nurse (RMN), to apply for a Band 7 Psychiatric Liaison Nurse, Senior Practitioner position within the Liaison Psychiatry Team. The Team is integrated and provides a 24/7 all age (18+years) adult liaison psychiatry service to Northwick Park Hospital.&lt;/p&gt;\n&lt;p&gt;The Liaison Psychiatry Team is based at the Mental Health centre The Liaison Psychiatry Team is an integrated mental health team which includes psychiatric liaison nurses, social worker, Psychiatrists specialising in Liaison Psychiatry. The team provides assessment and consultation to any patient attending Northwick Park Hospital. The Team accredited by the Psychiatric Liaison Accreditation Network (PLAN).&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated, suitably qualified and experienced Psychiatric Liaison Nurse who is a self-starter and can demonstrate clear leadership ability. This position is only open to applicants who have post registration experience including Band 6 Older Adult nursing role (community or hospital based). The specialist nature of this role requires us to appoint a clinician with significant knowledge and experience to this front line clinical/managerial position.&lt;/p&gt;\n&lt;p&gt;The post-holder will support the Team Manager in the day to day operational and clinical management of the Psychiatric Liaison service and will be expected to regularly undertake delegated managerial responsibilities and duties, and to deputise for the Team Manager in his/her absence or as required.&lt;/p&gt;\n&lt;p&gt;They will support the Team Manager in delivering a service which is soundly evidence based, has a reputation for quality and ensures that all available resources are utilised efficiently and within budget.&lt;/p&gt;\n&lt;p&gt;You must have a warm and friendly disposition and have very good communication and interpersonal skills. You must be a team player, be confident and motivated as well as being flexible and able to show initiative. You must be robust and resourceful and willing to work outside their comfort zone in an environment which can often be demanding and stressful.&lt;/p&gt;\n&lt;p&gt;You will be expected to inspire, build and drive the performance of the team and deliver to deadlines and targets with the strong support of the Team Manager.&lt;/p&gt;\n&lt;p&gt;All applicants must have completed a Mentorship in Practice or equivalent course, or be willing to do so, as the Team base is a student nurse training placement.&lt;/p&gt;\n&lt;p&gt;Interview date:TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFungayi UseyaJob titleTeam ManagerEmail addressfungayi.useya@nhs.netTelephone number07703886936&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Liaison Psychiatry Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249042", "validThrough": "2020-11-12T23:59:59+0000"}