{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-03T08:15:58+0000", "description": "&lt;p&gt;We are looking for dedicated and flexible Theatre Practitioners (ODP&#96;s/Nurses) to join our friendly team across our busy theatre departments at Maidstone Hospital.&lt;/p&gt;\n&lt;p&gt;Whether you are an anaesthetic or scrub practitioner there are exciting opportunities available and we would encourage you to apply.&lt;/p&gt;\n&lt;p&gt;We are looking for people dedicated to working in theatres and therefore being familiar with the Theatre environment is an advantage, however if you are a Nurse with limited or no theatre experience, we will assist your training with a supportive rotation package to help you settle into our departments.&lt;/p&gt;\n&lt;p&gt;We are a mainly elective site at Maidstone Hospital and cover a wide range of specialities with a focus on elective surgery – including Urology, Oncology and non Oncology Gynecology, Upper GI, Breast and Orthopaedics. We do perform emergency Urology and Ophthalmology surgery, and remain on standby for any complications.&lt;/p&gt;\n&lt;p&gt;We have four theatres in our Main Theatre department, two theatres in our Day Case theatres, two Ophthalmology theatres, one and one Oncology theatre. We also visit outside areas like Cardiac Cath Lab and the CT scanner to assist our colleagues in other departments. We also opened our Elective Joint Surgery theatre (Maidstone Orthopaedic Unit) in December 2016.&lt;/p&gt;\n&lt;p&gt;These posts are full time (37.5 hour four day week with varied shifts). This post will also require you to work the occasional late shifts (until 20:00), and perform weekday/weekend on calls from home currently standing at 1/12 weekends.&lt;/p&gt;\n&lt;p&gt;You will be expected to attend the Trust’s Induction Programme for RNs, RMs and ODPs (which starts on the first day of employment). The programme is full-time (please contact the programme lead if this is problematic: nicola.henthorn@nhs.net), lasts for two weeks and will involve travelling to both Trust sites. The programme includes supernumerary shifts in the clinical area and classroom-based study days which run from 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Tuesday 10th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: To be confirmed &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRobert OrmsbyEmail addressrobert.ormsby@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone Hospital", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253121", "validThrough": "2020-11-10T23:59:59+0000"}