{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 Per Annum"}}, "datePosted": "2020-11-02T12:00:34+0000", "description": "&lt;h1&gt;Physiotherapy Technician&lt;/h1&gt;\n&lt;p&gt;Portsmouth Hospitals University NHS Trust is one of the largest acute Hospital Trusts in the country. We provide acute and specialist services to people across Portsmouth, South East Hampshire and West Sussex. We continue to build our reputation for innovation and excellence, consistently delivering outstanding performance, whilst developing the skills and abilities of our staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A vacancy has been developed for a Physiotherapy Technician to provide support to the Physiotherapy Team working on the busy Inpatient Orthopaedic Wards.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your work will involve assisting the Physiotherapists (and sometimes the Occupational Therapists) in the rehabilitation of often very ill, complex patients who have been admitted to hospital with a variety of Orthopaedic injuries and conditions and multiple comorbidities that are in-depth and require high level quality care. You may also be working with elective orthopaedic patients where we aim to provide high level care whilst achieving the best length of stay for the patient. Some will be suffering cognitive characteristics and many will be unable to move or care for themselves. You will also be working with our fractured neck of femur patients, where Queen Alexandra Hospital ranks in the top quartile nationally for best practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We work in a variety of settings and we endeavour to provide dynamic rehabilitation to aid the recovery of our patients.&lt;/p&gt;\n&lt;p&gt;You need to be well motivated and able to take initiative. The post holder must have excellent communication skills and be able to work as part of a team within the busy ward environment and enjoy the challenges of dealing with these clients. The post holder also needs to be organised and able to prioritise and manage their time effectively, as they will have to manage their own caseload of patients, as well as supporting the physiotherapists and undertaking some administrative tasks.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting time for Physiotherapy within Queen Alexandra Hospital, as we are one of the key services for these people to improve and leave hospital. In return you will work with highly experienced staff and have full training relevant to the post.&lt;/p&gt;\n&lt;p&gt;The post would be ideal for applicants with experience of working within physiotherapy in Orthopaedics or with adults and older people’s services. This post involves working some weekends as part of a 7 day working pattern.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Contact name: Charlotte Lane&lt;/p&gt;\n&lt;p&gt;Contact Bleep number: Bleep 0087 via Switchboard 02392 286000&lt;/p&gt;\n&lt;p&gt;Closing date: 16/11/2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Physiotherapy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251926", "validThrough": "2020-11-16T23:59:59+0000"}