{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20323", "minValue": "20323", "unitText": "YEAR", "value": "£12.09 Per Hour"}}, "datePosted": "2020-10-15T09:00:53+0100", "description": "&lt;p&gt;Senior Nursing Care Assistant - Penylan House Nursing Home, Cardiff (Day Shifts)&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;39.38 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;£12.09 per hour&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Are you a Senior Care Assistant who is ready for your next challenge? Are you looking for a rewarding role to progress within your career? Can you act as a role model to a team of Care Assistants?&lt;/p&gt;\n&lt;p&gt;If you answered yes, this could be the role for you!&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Linc-Cymru are offering the opportunity to join our night team as a Senior Nursing Care Assistant based at our Penylan House Nursing Home. We are looking for exceptionally caring individuals who really want to go above and beyond for the residents in our home. This is a role suited to someone who has previously worked in a senior care position or higher. We also welcome candidates who have trained overseas, but do not currently hold an NMC pin.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;In this role, you will have the chance to use your skills and knowledge to take on more responsibility and develop professionally, with the support from the nursing and managerial team within the home.&lt;br /&gt;With a dedicated Learning &amp; Development Team, you can rest assured that you will have all the training and support you will need to be successful and excel in this role.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Senior Nursing Care Assistant provides an essential role in contributing to the smooth running of our nursing care homes for older people. You should have an NVQ Level 3, overseas PIN, or higher qualification in social care to apply for this role. The role is an enhanced senior care assistant role that will, after being trained and assessed as competent under the guidance of registered nurses, you will undertake clinical tasks which may include: medication administration, observations, check blood sugar levels, change simple dressings, liaise with MDT&#39;s, administer ear and eye drops, PEG feeding, catheter care and colostomy care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Senior Nursing Care Assistant will be tasked to develop, review and update the resident&#39;s individualised care plans to meet their changing physical, social and psychological needs. Senior Nursing Care Assistants will promote high standards of care by ensuring all team members are trained and supervised appropriately and will communicate professionally and warmly with visitors, family members, and other health care professionals.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you think this is the role for you, don&#39;t delay - apply today!&lt;/p&gt;\n&lt;p&gt;The closing date for this advert is 23:45 on 22nd October 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Linc Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cardiff", "postalCode": "CF23 5YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5015", "longitude": "-3.16073"}}, "title": "Senior Nursing Care Assistant – Penylan House Nursing Home, Cardiff (D", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227434", "validThrough": "2020-11-14T23:59:59+0000"}