{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 per annum"}}, "datePosted": "2020-10-27T10:45:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Community staff nurse (Adult nurse) – Wokingham; covering Woodley, Lower Earley &amp; Twyford.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Come and join our CQC rated ‘Outstanding’ Trust as a Community Staff Nurse in Wokingham. As a Community Staff Nurse you’ll help deliver care to people in their own homes and get to work with inspiring, skilled teams whilst you do it. We offer a supportive environment with opportunities for further career development, a strong in-house training programme, including excellent links with our partner Universities and opportunities to gain further qualifications. For newly qualified staff we offer a comprehensive 12-month preceptorship.&lt;/p&gt;\n&lt;p&gt;We believe in care that treats the whole person, not just the condition. We enable patients to stay at home longer and leave hospitals faster. Our community nurses work closely with members of the wider multi-disciplinary teams, including our GP&#39;s, local hospices, complex care nurses, health and social care coordinators, specialist nurses and therapist colleagues.&lt;/p&gt;\n&lt;p&gt;The NHS is changing. More emphasis on community-based care means there&#39;s never been a better time to join Berkshire Healthcare NHS Foundation Trust. And Following our latest Care Quality Commission (CQC) inspection, we’re delighted to announce that we’ve been awarded ‘Outstanding’ as a community and mental health care provider. One of the highlights from the report states ‘Staff across the trust felt valued and there was a real focus on doing what was best for staff, patients and carers and a real commitment to the delivery of good quality patient care at every level. Staff at all levels of the trust were proud to work there and morale amongst staff was good.’&lt;/p&gt;\n&lt;p&gt;So join us and you can be confident that Berkshire Healthcare is a Great Place to Work!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further information about this opportunity;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will visit numerous patients on a daily basis within their own homes&lt;/li&gt;\n&lt;li&gt;You will provide high quality nursing care to a range of patients with varying healthcare needs&lt;/li&gt;\n&lt;li&gt;Some of the healthcare you will be expected to provide include; end of life care, wound management, and much more&lt;/li&gt;\n&lt;li&gt;We have both full time (37.5 hours per week) and part time opportunities available&lt;/li&gt;\n&lt;li&gt;With bases at Woodley, Finchampstead &amp; Chalfont Surgery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of joining our team:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AfC Salary ranging from&lt;strong&gt; £24,907&lt;/strong&gt; to&lt;strong&gt; £30,615&lt;/strong&gt; per annum&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working opportunities&lt;/strong&gt; and a strong emphasis on your work , life balance&lt;/li&gt;\n&lt;li&gt;Annual leave – 27 days for new starters, &lt;strong&gt;plus bank holidays&lt;/strong&gt;. Increasing to 29 days after 5 years and 33 days after 10 years NHS service. Pro rata for part time staff&lt;/li&gt;\n&lt;li&gt;Excellent &lt;strong&gt;learning and development opportunities&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car&lt;/li&gt;\n&lt;li&gt;Lease car scheme&lt;/li&gt;\n&lt;li&gt;Generous &lt;strong&gt;maternity, paternity and adoption leave&lt;/strong&gt; for eligible staff&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Advanced IT&lt;/strong&gt; enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent &lt;strong&gt;support and advice for staff&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Are you familiar with Wokingham?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are not familiar with the market town of Wokingham, it lies approx 4 miles west of Bracknell and 7 miles from Reading. Transport links are excellent. Wokingham is extremely well-placed, being served by the A329 London to Reading road and by the M4, which links it to Heathrow airport, the West of England and South Wales.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The 3 “must haves” for you to be considered for this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;A passion for community nursing, that matches our passion to provide excellent healthcare for patients within their own homes&lt;/li&gt;\n&lt;li&gt;Either a qualified adult nurse or currently in your last year of training (with NMC registration)&lt;/li&gt;\n&lt;li&gt;Hold a full UK Driving Licence and have use of a car for work purposes&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Should you match up to the 3 points listed above, then we would recommend you make your application for this role today! We interview candidates for this role in the order applications are received, so don’t delay and apply today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details about this role or questions in general about working for Berkshire Healthcare please contact Saiyad Allymamod, Community Nursing Team Manager on email at: Saiyad.Allymamod@berkshire.nhs.uk or call Saiyad on: 07930914721&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wokingham Community Hospital, Wokingham", "postalCode": "RG41 2XR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4104", "longitude": "-.843681"}}, "title": "Community Staff Nurse (District Nursing) - Wokingham", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244068", "validThrough": "2020-11-29T23:59:59+0000"}