{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum pro rata incl. HCAS"}}, "datePosted": "2020-10-26T16:45:56+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Band 7 Highly Specialist Paediatric Physiotherapist&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;£45,780 - £51,393 per annum incl. HCAS&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Fixed term contract 12 months.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Chelsea and Westminster Hospital &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;A Band 7 fixed term position has become vacant within the Community Paediatric Therapy team based at the Chelsea &amp; Westminster Hospital Paediatric Physiotherapy Service. Chelsea is centrally located with good transport links, making it a great place for people who like culture with the local museums and art galleries and is also close to areas with a village atmosphere and green spaces.&lt;/p&gt;\n&lt;p&gt;The Community Paediatric Physiotherapy team provide high quality, family-centred care to children and young people within the boroughs of Hammersmith and Fulham, South Kensington and Chelsea, and South Westminster. The post is based with the community team Chelsea and Westminster Hospital but you may also be required to work with our other team at Parkview Centre for Health in White City. The community team sees children from 0-19 years in homes, clinics, nurseries and schools. Hydrotherapy facilities are available in the hospital and the community.&lt;/p&gt;\n&lt;p&gt;You should have band 7 paediatric experience with demonstrable knowledge of specific paediatric assessments and treatments. Experience in early intervention and follow up would be beneficial. The post provides plenty of opportunities to further develop your skills across a range of paediatric conditions, with regular supervision to support your development. &lt;br /&gt;&lt;br /&gt;Good communication skills are essential, as you will be working independently and alongside other health and social care professionals; supervising band 6s, assistants and students and working with our highly specialized paediatric orthopaedic team, orthotics service and the wider multi-disciplinary team.&lt;br /&gt;&lt;br /&gt;Chelsea and Westminster Therapy Department is committed to evidence based practice and research is actively encouraged. Development of clinical skills is supported through a programme of regular in-service training, supervision, CPD and appraisal. This includes support to develop your skills with children with neurodisabilities from expert practitioners.&lt;/p&gt;\n&lt;p&gt;Please note that shortlisting will be based on meeting the essential criteria in the job description and the person specification.&lt;/p&gt;\n&lt;p&gt;Interview Date 18th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Virginia Knox, Clinical Team Lead for Children&#39;s Community Paediatric Physiotherapy&lt;/p&gt;\n&lt;p&gt;virginia.knox@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt;02033158667&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelsea and Westminster Hospital, London", "postalCode": "SW10 9NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.181435"}}, "title": "Specialist Paediatric Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243493", "validThrough": "2020-11-09T23:59:59+0000"}