{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 -  £21,142"}}, "datePosted": "2020-10-28T09:46:35+0000", "description": "&lt;p&gt;We have an exciting opportunity for a podiatry assistant to join our proactive diabetes foot protection team within the community diabetes service. Trust values are embedded within the diabetes multidisciplinary team and we aim to provide high quality compassionate care to those in our community. So if your values match ours, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic experienced full time Band 3 podiatry assistant with a range of skills which will include excellent interpersonal skills, verbal and written communications and the willingness and drive to deliver great patientcare. You will need to have a calm and helpful attitude and a flexible approach to your workload. Previous experience of working in a health care field, and experience of using SystmOne would be an advantage. Car owner/driver is required in order to meet service needs.&lt;/p&gt;\n&lt;p&gt;The team works closely within the Multi-Disciplinary Team (MDT) and you will have the opportunity to participate in regular team clinical supervision You will benefit from the support of a friendly and experienced team of podiatrists who will help you to further develop your clinical and professional skills. Your career progression is important to us and we are committed to continuous professional development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Deborah Hindso Hounslow Diabetes Service Manager&lt;/p&gt;\n&lt;p&gt;Email address deborah.hindson@nhs.net Telephone number 07387049824&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122296.jpg", "name": "Hounslow and Richmond Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122296"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heart of Hounslow, Hounslow", "postalCode": "TW3 3EL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4683", "longitude": "-.371733"}}, "title": "Poidatry Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245879", "validThrough": "2020-11-10T23:59:59+0000"}