{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668"}}, "datePosted": "2020-10-27T14:42:41+0000", "description": "&lt;p&gt;&lt;span&gt;Following a significant service transformation we are seeking to appoint to the above posts within the RotherhamCare Group. The Trust provides a comprehensive mental health services to Rotherham, Doncaster and North Lincolnshire and is divided into three geographically based Care Groups with an additional Children’s Care Group which covers all three localities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of our continuous improvementprocess we have maintained a strong focus on patient need whilst retaining clear professional boundaries for our medical and nursing staff. This is an exciting time to join RDaSH and you will be able to influence and shape our services from the outset of your appointment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking to appoint a dynamic and flexible candidate with a good understanding of the role of the consultant and the ability to work in an appropriately boundaried way, whilst displaying clear clinical leadership and support to the MDT’s. This post offers a varied and interesting workload providing consultant clinical input to a skilled and diverse MDT covering either North or South Rotherham.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Rotherham is an industrial market town in South Yorkshire with a diverse population, it is in close proximity to the vibrant City of Sheffield which is about 15 minutes commute, another 15 minutes will take you into the stunning Peak District National Park. There are excellent transport links with both the M1 and A1 nearby and great air links with no fewer than 6 international airports within 90 minutes drive. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Allfull time posts include 2.5 sessions of Supporting Programmed Activities (SPAs), enabling the post holder to pursue CPD, service development, management, teaching or research interests. There is a generous study leave allowance and assistance with relocation is available.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must be on the GMC Specialist Register (Psychiatry) or a trainee within 6 months of completing their CCT. Section 12 (2) approval and Approved Clinician status are also essential to the role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Prospective applicants are encouraged to contact Dr Diarmid Sinclair, Associate Medical Director, RotherhamCare Group (Tel: 01709 447295) to discuss the role and future service development, or email: diarmid.sinclair@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Visits to the services are welcome and can be arranged upon request.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;All posts will be subject to regular job planning review. Part-time or job share applications are welcome.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S26 4TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3679", "longitude": "-1.32198"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244996", "validThrough": "2020-11-10T23:59:59+0000"}