{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-16T11:30:23+0100", "description": "&lt;h1&gt;Medical Examiner Officer&lt;/h1&gt;\n&lt;p&gt;An exciting opportunity has arisen to support the expansion of the Medical Examiners service at Portsmouth Hospital University Trust as part of the National implementation of the Medical Examiner system in England and Wales. Since November 2019 all adult deaths within the hospital are scrutinised including the Emergency Department since June 2020 and the expansion of the service will include community deaths within the local area. The Medical Examiners office works very closely with bereavement services and other multidisciplinary teams including Patient Safety, Patient Experience and the Governance teams.&lt;/p&gt;\n&lt;p&gt;The overarching purpose of the National Medical Examiner service is to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide greater safeguards for the public by ensuring proper scrutiny of all deaths&lt;/li&gt;\n&lt;li&gt;Ensure appropriate referrals to the coronial system&lt;/li&gt;\n&lt;li&gt;Provide a better service for the bereaved to ensure they can raise any concerns to a doctor not involved in the care of the deceased&lt;/li&gt;\n&lt;li&gt;Improve the quality of both death certification and mortality data.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder should have strong interpersonal skills and be able to communicate effectively in difficult and emotional settings to provide non-judgemental, compassionate and sensitive support to the bereaved and clinical staff. Also, an ability to work as part of a small multidisciplinary team and organisational skills to manage fluctuating workloads is essential as each day is unique.&lt;/p&gt;\n&lt;p&gt;The post holder will include working closely with the Medical Examiners as well as the current Medical Examiner Officer to support their roles in independently scrutinising the circumstances and cause of deaths for patients and discussing this with the bereaved. Jointly this will allow any immediate learning to be identified and fed back to individuals and teams with further thematic analysis which will feed into the Trust governance structures including patient safety and patient experience.&lt;/p&gt;\n&lt;p&gt;The role requires someone with a degree level education or equivalent experience; and either with a professional clinical background or relevant experience in the bereavement or coroner service as well as the ability to talk to bereaved families in a sensitive and appropriate manner. As the role involves reviewing medical notes and working closely with doctors from all disciplines and grades, an understanding of medical terminology is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Closing Date 6th november 2020&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Interview Date 20th November 2020&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Medical Examiner Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229893", "validThrough": "2020-11-06T23:59:59+0000"}