{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 per annum, pro rata"}}, "datePosted": "2020-11-06T12:15:19+0000", "description": "&lt;p&gt;The Endoscopy Unit is located in the Treatment Centre at Leighton Hospital. The Unit prides itself on providing high quality standards of care and is JAG Accredited. In April 2009 the Unit was appointed as a Bowel Cancer Screening Centre. The Endoscopy service is predicted to continue to increase in demand over time and the Unit was expanded in 2015 with the addition of a 5th procedure room, improved patient areas and updated decontamination facilities, compliant with external accreditation, at the Leighton site as well as a single room Unit at the Victoria Infirmary Northwich.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking to employ an enthusiastic Clinical Support Worker to join our existing CSWs and multidisciplinary team, in the planning, implementation and evaluation of care for patients undergoing endoscopic procedures. This is an opportunity to assist the Registered Nurses in the Unit, in all aspects of endoscopy work, including caring for patients undergoing diagnostic and therapeutic procedures, and the preparation of the environment and that of patients for their procedures.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Although previous endoscopy experience is not essential, it is desirable that the applicant has had exposure to the specialty, or similar. It is expected that the applicant will possess good communication skills and have the ability to work effectively within a team in a fast paced challenging environment. It is essential that the individual has previous health care experience and is keen to learn, as it is an expectation of the role that they will complete a 2day Health Care Induction and associated Care Certificate. They will also receive competency based training in all aspects of the role, with a named mentor.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is a requirement that the post holder will work flexibly across the 2 hospital sites of Leighton Hospital and Victoria Infirmary, Northwich and will commit to evening and weekend working as part of their core hours.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Treatment Centre is currently a designated Covid-19 ‘green’ area within the Trust, and as such staff are swabbed every 2 weeks. Patients are also swabbed within 72 hours prior to their admission date and asked to isolate until this time. There are processes in place to manage safe social distancing and information regarding Covid-19 is communicated to staff on a daily basis.&lt;/p&gt;\n&lt;p&gt;if you would like more information please contact CN Jay Chacko, SR Angela Hewitt or SSR Maureen Brown 0n 01270 277908 / 01270 278789&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Clinical Support Worker Endoscopy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259600", "validThrough": "2020-11-13T23:59:59+0000"}