{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38693", "minValue": "38693", "unitText": "YEAR", "value": "£38,693 per annum pro-rata"}}, "datePosted": "2020-11-04T15:46:34+0000", "description": "&lt;p&gt;Applications are invited for the post of Clinical Fellow (Core) in Haematology (equivalent to CT1-2) at Addenbrooke’s Hospital, part of Cambridge University Hospitals NHS Foundation Trust (CUH) available to commence from 16 November 2020 until 03 August 2021 with the possibility of extension.&lt;/p&gt;\n&lt;p&gt;The duties of the posts include the day to day care of patients under the care of the Haematology team. This includes not only patients undergoing intensive therapies for Haematological malignancies and bone marrow transplantation but also non-malignant disorders such as haemolysis, haemoglobinopathies and haemophilia.&lt;/p&gt;\n&lt;p&gt;Experience in a wide range of practical techniques including bone marrow aspiration and lumbar puncture is offered, and there is opportunity for regular participation in departmental seminars, audit, and teaching.&lt;/p&gt;\n&lt;p&gt;The post is flexible in that time may be spent based in the in-patient and out-patient Services to increase exposure to wider aspects of Haematology. When working with the in-patient team, the post will provide extensive experience in the management of complex patients with multisystem pathologies.&lt;/p&gt;\n&lt;p&gt;While working on the Haematology Day Unit, the post-holder will oversee outpatient care of Haematology patients in our newly refurbished and expanded Haematology Day Unit.&lt;/p&gt;\n&lt;p&gt;Since 2018 ambulatory bone marrow transplantation has commenced as part of a wider programme of ambulatory chemotherapy and this is an exciting new area of Haematology treatment provision.&lt;/p&gt;\n&lt;p&gt;This post will attract a supplement for out of hours cover of Haematology and Oncology in-patients according to an on-call rota.&lt;/p&gt;\n&lt;p&gt;In order to be considered, applicants &lt;strong&gt;must&lt;/strong&gt; have full GMC registration at time of application and have completed Foundation training, with a &lt;strong&gt;minimum&lt;/strong&gt; of one year’s experience in Adult General Medicine. MRCP part 1, or equivalent, is desirable.&lt;/p&gt;\n&lt;p&gt;Please note that this post does &lt;strong&gt;not &lt;/strong&gt;carry Postgraduate Dean’s approval or training recognition.&lt;/p&gt;\n&lt;p&gt;The applicant must have demonstrable skills in listening, reading, writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013). Non-UK applicants must possess the IELTS/OET exam before obtaining a GMC licence to practice.&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Informal enquiries regarding these posts should be directed to Dr Kiran Tawana, Consultant Haematologist via email at kiran.tawana@addenbrookes.nhs.uk or Dr Andrew King, Consultant Haematologist at andrew.king@addenbrookes.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Clinical Fellow (Core) in Haematology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256502", "validThrough": "2020-11-18T23:59:59+0000"}