{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T08:45:45+0100", "description": "&lt;p&gt;Complaints Case Officer - 12 months fixed term contract or secondment.&lt;/p&gt;\n&lt;p&gt;The East of England Complaints Team are responsible for the management of formal complaints predominantly about primary care health services. The team are seeking a highly motivated Complaints Case Officer, with experience of working in a healthcare complaints environment to manage a caseload of complaints from the point of receipt to resolution.&lt;/p&gt;\n&lt;p&gt;Fundamental to this role is a commitment and passion for improving the experience of our patients. In order to achieve this the post holder needs to demonstrate how complaints data is used to support clinical staff to deliver better outcomes for patients.&lt;/p&gt;\n&lt;p&gt;The ability to manage a caseload within the timeframe set out in the NHS complaints regulations (2009) is essential, as is supporting the team to meet the key performance indicators (KPI’s) within the NHS England Complaints Policy.&lt;/p&gt;\n&lt;p&gt;Excellent communication skills, both written and verbal are vital to this role with the ability to produce high quality responses ensuring that all aspects of the complaint have been addressed. This requires the ability to extract complex information ensuring that the response to the complainant is presented in a format that is suitable for their individual needs.&lt;/p&gt;\n&lt;p&gt;The role requires the ability to deal with highly emotive and challenging situations whilst remaining professional, calm and resilient.&lt;/p&gt;\n&lt;p&gt;Please note that the reason for the fixed term of your contract is to backfill the post during a secondment.&lt;/p&gt;\n&lt;p&gt;Flexible/part time working will be considered.&lt;/p&gt;\n&lt;p&gt;Shortlisting will be completed within one week of the advert closing, with interviews taking place during the following fortnight (ie within 3 weeks of the advert close date).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Kim Clark&lt;/p&gt;\n&lt;p&gt;Job title: Senior Complaints &amp; Experience Manager&lt;/p&gt;\n&lt;p&gt;Email address: kim.clark6@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07725 490381&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge", "postalCode": "CB21 5XB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Complaints Case Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239721", "validThrough": "2020-11-08T23:59:59+0000"}