{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32050", "minValue": "32050", "unitText": "YEAR", "value": "£32,050.00 per annum"}}, "datePosted": "2020-11-04T15:31:18+0000", "description": "&lt;p&gt;&lt;span&gt;This is an exciting time to join the Department of Trauma Orthopaedics at University Hospitals Of Leicester NHS Trust. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for enthusiastic individuals who will bring their skills, knowledge and experience to our existing teams. You will work closely with colleagues in Orthopaedics, Medicine and the Emergency Department as well as community services. University Hospitals Of Leicester NHS Trust has a reputation for upholding the highest standards of quality of care, and as a department we pride ourselves in being part of this. Clinical governance, education, training and research are key to this, and successful candidates will have ample opportunity to contribute and become active members of the department, both within their base hospital and cross-site.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are invited for Foundation Year 2 doctors&lt;/span&gt;&lt;span&gt;to work within the Orthopaedic Department at Foundation level. All posts are full-time with Rota commitments. The basic salary &lt;/span&gt;&lt;span&gt;is £32,050.00 Per Annum.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;While this post is not formally recognised for training, it offers an exceptional opportunity to gain skills and experiences in the management of orthopaedic inpatients, including specialist management of the elderly, frail &amp; hip fracture rehabilitation. Active educational support tailored to the individuals’ experience and needs will be provided through an assigned educational supervisor.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will also gain the Foundation Level Competencies that you need to progress to Specialist Training. Several of our previous Overseas Medical Graduates have progressed to training in GP, Internal medicine, Psychiatry.&lt;/p&gt;\n&lt;p&gt;“ ……great opportunity to familiarize with the NHS-management of orthopaedic emergencies, medical co-morbidities and on-call decision making. Great support from senior doctors and JDA office, good rota management and junior doctors coverage with supported study time……&quot;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alywn Abraham Alwyn.Abraham@uhl-tr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospitals of Leicester NHS Trust, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Trust Grade Foundation Year 2 Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256455", "validThrough": "2020-12-04T23:59:59+0000"}