{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-06T15:46:22+0000", "description": "&lt;p&gt;The Royal Wolverhampton NHS Trust is the main provider of hospital, community and a growing primary care team to the population of Wolverhampton, Cannock and South Staffordshire. We also provide some specialist cardiac and cancer services to the wider population of the Black Country and beyond. We are a growing Trust that is proud of our track record to deliver caring, safe and effective services for the populations we serve.&lt;/p&gt;\n&lt;p&gt;With the promotioon of the current post holder we are looking to appoint an exceptional person to lead our Hotel Services Department. The successful individual will need to have a professional, proactive leadership style that can take the department vision forward, along with leading the day to day operational delivery of Hotel Service teams.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have a track record in managing Facilities teams in a large organisation. The post holder will provide line management accountability for staff and will ensure appropriate financial, workforce and performance management arrangements are in place. the post includes accountability for a budget of £22m and the management of 498 wte staff.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLindsay Ibbs-GeorgeJob titleHead of Hotel servicesEmail addresslindsay.ibbs-george@nhs.net Telephone number01902 448610&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Cross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Head of Hotel Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260438", "validThrough": "2020-11-15T23:59:59+0000"}