{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-19T10:15:11+0100", "description": "&lt;p&gt;&lt;span&gt;Are you looking to develop your career as a vascular scientist? If so this exciting opportunity could be for you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an experienced and enthusiastic Lead Vascular Scientist to lead the Vascular Laboratory Services at University Hospitals of Birmingham (UHB).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This unit provides high quality specialist non-invasive vascular diagnostic assessment service for Vascular Surgery and other specialties. This busy department supports the largest Vascular Surgery Department within the Midlands and one of the largest in the UK across 6 hospitals, including Queen Elizabeth Hospital Birmingham, Birmingham Heartlands Hospital, Solihull Hospital, Good Hope Hospital, City General Hospital and Sandwell Hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are well equipped with a range of ultrasound machines, running one stop and stand alone clinics on all sites. We are a training unit and are ready to appoint further vascular scientists at Band 7 level.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate is expected to have a BSc in a relevant science, extensive experience in Vascular ultrasound and to hold Accreditation as a Vascular Scientist or equivalent with proven management experience.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a senior manager within the Vascular Directorate, the post holder will manage the team of Vascular Scientists/Trainees, overseeing the management of the Vascular Laboratory including all operational aspects of the service, training activities and research. The post holder will also be responsible for clinical governance, quality, safety and development of the service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Opportunities exist to develop further clinical, academic, managerial and training interests.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you feel you are suited to this post, and would like to discuss further please contact Nicola Butts, General Manager on 0121 371 4472 or email &lt;/span&gt;&lt;span&gt;nicola.butts@uhb.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 8a Lead Vascular Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231728", "validThrough": "2020-11-16T23:59:59+0000"}