{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-22T14:31:25+0100", "description": "&lt;p&gt;&lt;strong&gt;Global Digital Exemplar (GDE) Deputy Information Manager - Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contracting, Performance, Systems &amp; Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wayside House, Wilsons Lane, Coventry&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term for 12 months (with an option to extend for a further 6 months)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Coventry and Warwickshire Partnership NHS Trust (CWPT) has successfully secured funding from NHS England to become a Global Digital Exemplar Fast Follower. This means services from CWPT will be harnessing the latest innovations in patient care and safety through the use of digital technology. For trust staff and patients, this is a significant step towards our ambition of harnessing more technology to provide safe, sustainable patient care throughout our services now and in the future, and empowering local people to take more control of their condition, creating greater independence and improving understanding of how best to manage their health needs. Being a GDE fast follower affords us access to national expertise and resource and helps to transform the services we offer through our own digital improvement programme, for us and our health and care partners across the patch, enhancing our service portfolio alongside our colleagues across health and social care.&lt;/p&gt;\n&lt;p&gt;There are a number of exciting opportunities across roles in project management, systems and analytics to be part of this programme, working in partnership with clinical services to enable the delivery of clinically led digital transformation and the benefits it brings. For further information please contact Jayne Flynn, Assistant Director of Systems, Information and Business Intelligence&lt;/p&gt;\n&lt;p&gt;The post holder will support the Head of Information in the development and implementation of a Trust-wide information strategy that delivers the information requirements of the organisation, and promotes effective business partnership working and the development of an information culture.&lt;/p&gt;\n&lt;p&gt;The post holder will manage and support the Trust’s information department on a day to day basis.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To support the Head of Information in the development of an Information Strategy that supports the Trusts business and management agenda’s, including the development and implementation of Trust-wide business rules for all services&lt;/li&gt;\n&lt;li&gt;To develop and establish key information performance monitoring mechanisms to enable the early identification of adverse performance variance and to liaise with the relevant operational managers to agree appropriate action&lt;/li&gt;\n&lt;li&gt;To work closely with operational services and teams to further develop understanding of the information processes and to ensure that information issues are taken into consideration as part of the operational decision making process.&lt;/li&gt;\n&lt;li&gt;To deputise for the Head of Information in relation to information issues as and when required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants must be educated to masters degree level or equivalent or knowledge gained through in depth experience and/or formal training and have evidence of continuous professional and personal development. Applicants will have a demonstrable understanding of NHS Information data definitions and standards and returns and datasets. They will also have a working knowledge and understanding of clinical systems and be able to work with, manipulate and understand highly complex data and information to ensure targets are met and plans are produced which will ensure objectives can be achieved.. Applicants will have excellent communication and people management skills and have the ability to collect, analyse and interpret complex data and information from a variety of sources ensuring a high degree of accuracy. Applicants will also be able to work autonomously and effectively on own and as part of the Team and can lead others by effective engagement and communication skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note Trust interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jayne Flynn - Assistant Director of Systems, Information and Business Intelligence, email: jayne.flynn@covwarkpt.nhs.uk, Tel: 07825 010627&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Caroline Brown email caroline.brown@covwarkpt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wayside House, Coventry", "postalCode": "CV6 6NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4571", "longitude": "-1.48652"}}, "title": "GDE Deputy Information Manager - Band 7 FTC", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238911", "validThrough": "2020-11-11T23:59:59+0000"}