{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-27T14:15:25+0000", "description": "&lt;h1&gt;Assistant CBU Manager -Medical Care&lt;/h1&gt;\n&lt;p&gt;Applications are invited for an Assistant CBU Manager in Medical Care..&lt;/p&gt;\n&lt;p&gt;Warrington and Halton Hospitals NHS Foundation Trust are seeking an operational manager to fulfill the post of Clinical Business Unit Assistant Manager within Medical Care.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to work in an excellent Clinical Business Unit within a dynamic and challenging arena. The successful applicant will be working closely with the CBU triumvirate leadership team and will work under the guidance of the CBU Manager.&lt;/p&gt;\n&lt;p&gt;As the CBU Assistant Manager you will support the CBU Manager in the daily management of the service, operational planning and management of the Clinical Business Unit, ensuring that all available capacity is utilised.&lt;/p&gt;\n&lt;p&gt;To be successful in this role, you will need to have significant experience of working in the NHS or other similar large organisation. In addition you will need experience of managing targets and performance&lt;/p&gt;\n&lt;p&gt;We encourage you to come and talk to us to understand a bit more about our organisation and what we can offer. For an informal discussion please contact Sharon Kilkenny, Acting Associate Director of Unplanned Care (sharon.kilkenny@nhs.net/ 01925 662950).&lt;/p&gt;\n&lt;p&gt;**Please provide email addresses for referees as this will facilitate a quicker recruitment process**. &lt;br /&gt; &lt;br /&gt; IMPORTANT – Invitations to interview are sent to the email address you use to apply. Please ensure that you check your email account regularly as you will receive an alert from the NHS Jobsite informing you of a message.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121088.png", "name": "Warrington and Halton Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121088"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington", "postalCode": "WA5 1QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.394", "longitude": "-2.61073"}}, "title": "Assistant CBU Manager - Medical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244898", "validThrough": "2020-11-12T23:59:59+0000"}