{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum/pro rata"}}, "datePosted": "2020-10-28T14:31:17+0000", "description": "&lt;p&gt;&lt;strong&gt;IT (Network) Infrastructure Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Division: Corporate&lt;/p&gt;\n&lt;p&gt;Band: 7&lt;/p&gt;\n&lt;p&gt;Salary: £38,890 - £44,503 per annum/pro rata&lt;/p&gt;\n&lt;p&gt;Interview date: 23rd November 2020&lt;/p&gt;\n&lt;p&gt;We are recruiting for an IT Network Infrastructure Manager who shares our ambition and vision to deliver the &lt;em&gt;&lt;strong&gt;Best of Care by the Best of People&lt;/strong&gt;&lt;/em&gt; and has the drive to take us forward, by ensuring that the Trust continues to be the first choice for patients and our staff.&lt;/p&gt;\n&lt;p&gt;The use of digital solutions within NHS organisations has significantly grown over the last decade and Medway NHS Foundation Trust sees digital services and systems providing a major role in ensuring transformation within the organisation and the safe, successful care of patients across the organisation. As a result, this is an exciting time to be part of the digital team which will be developing and supporting solutions which will have a direct impact on patient care. This is your opportunity to be in a role which will make a real difference.&lt;/p&gt;\n&lt;p&gt;The successful post holder will be expected to represent IT Services to the majority of the Trust’s IT users, and as such the post-holder will require good technical skills, and the professionalism and initiative to resolve problems as efficiently as possible. They will be able to work flexibly in a fast paced working environment, with excellent communication skills and a proven track record of developing productive relationships with a range of key stakeholders.&lt;/p&gt;\n&lt;p&gt;As an &lt;strong&gt;IT &lt;/strong&gt;&lt;strong&gt;Network Infrastructure Manager &lt;/strong&gt;you will help maintain service capability of the Trust’s IT infrastructure, specifically in the area of WAN, LAN WLAN and firewall management. You will manage the Network Infrastructure support team and act as a leader for those staff and leadership representative for the department. You will manage the day to day operation and support of all network services and act as an expert lead on all network affecting projects and changes,&lt;/p&gt;\n&lt;p&gt;The &lt;strong&gt;Network Infrastructure Manager &lt;/strong&gt;will work in partnership with the Trust’s other IT teams, to deliver a support facility for all Trust IT users ensuring that Trust staff and other IT colleagues are fully informed of the progress of calls through to resolution.&lt;/p&gt;\n&lt;p&gt;The Trust and its employees are all committed to creating and maintaining a fair and supportive working environment and culture.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to you, we will give you the opportunity to utilise and enhance your talents to assist us in the development of shaping the future of Medway NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Trust offers a number of apprenticeships and training opportunities in Leadership and Management, Business Services, Finance, Accounting, Human Resources, Clinical Support Work, Research and Innovation, Nursing Associate and Assistant Practitioner alongside our in-house comprehensive clinical pathways.&lt;/p&gt;\n&lt;p&gt;Our hope is that our education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the protection of children, young people, their families and vulnerable adults accessing its services. Promoting the message that “safeguarding is everyone’s business” is vital to ensure our patients are protected and safe from abuse. To this end you must comply with Trust’s and the Kent and Medway Safeguarding Board’s policies on safeguarding children, young people and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Craig Allen - Head of IT&lt;/p&gt;\n&lt;p&gt;craigallen@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham, Kent", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "IT (Network) Infrastructure Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246994", "validThrough": "2020-11-10T23:59:59+0000"}