{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-26T13:01:19+0000", "description": "&lt;p&gt;&lt;em&gt;&lt;strong&gt;BE A PART OF SOMETHING SPECIAL in East Kent&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Every one of our 8,000 staff at East Kent Hospitals University Foundation Teaching NHS Trust plays a vital role in providing quality care to thousands of people living across East Kent .&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re proud to say that our hard working, talented and dynamic workforce is our greatest asset, which strives for excellence every day, providing quality care and support to those who use our services. If you are a dynamic, innovative, forward thinking clinician who would like to make a significant contribution to the Trust then you could become part of the team. Applications from people wishing to work flexible hours or less than full-time will be welcomed&lt;/p&gt;\n&lt;p&gt;We are looking for three dynamic and motivated Elderly Care Consultants to join our friendly and enthusiastic team. The successful candidates will join other substantive Consultants in providing the highest quality care possible for older patients in Ashford, Canterbury and Thanet.&lt;/p&gt;\n&lt;p&gt;The posts will be a combination of acute inpatient care for patients coming from a distinct locality and ED liaison and Frailty service sessions. However, as a large and dynamic department, there is opportunity to negotiate job plans to fit specialist interests. There is also flexibility to work between Medicine for Older People and Acute Medicine if this balance of work is desired - we are developing a new acute medical model to be implemented across the Trust&lt;/p&gt;\n&lt;p&gt;The East Kent Hospitals University Foundation Teaching NHS Trust is a large multi-site Trust whose ambitious programme to reconfigure services in line with leading national and international care delivery models.&lt;/p&gt;\n&lt;p&gt;It was also recently announced that a new medical school, the first in the county, will be opening in two years. The school, which will offer 100 medical school places per year, is a game-changing opportunity and one which the two universities and Kent and Medway trusts have been working towards and hoping for over several years.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Previous applicants need not apply&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Jonathon Hawkins on 01233 616075.&lt;/p&gt;\n&lt;p&gt;If you would like a site visit then please contact Mrs Alison Guy, Service Manager for HCOOP on 07917 076843&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth the Queen Mother Hospital, Margate", "postalCode": "CT9 4AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3781", "longitude": "1.38941"}}, "title": "Consultant Geriatrician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242561", "validThrough": "2020-11-23T23:59:59+0000"}