{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inclusive"}}, "datePosted": "2020-10-22T13:00:51+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 8a Leadership Development Programme Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(18 months secondment / fixed-term contract)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Staff Development team at UCLH for an experienced manager to help lead and drive delivery of UCLH’s new Leadership and Management Framework.&lt;/p&gt;\n&lt;p&gt;More than ever before, the capacity and capability of our leaders and managers are crucial to leading UCLH through the challenges of the pandemic and beyond. In this role you will be responsible for the successful design, delivery and implementation of the Trust’s leadership and management development programmes as part of our drive to develop all of our diverse staff to their full potential.&lt;/p&gt;\n&lt;p&gt;Educated to Master’s level, you will understand the challenges in delivering education and training in an organisational context, knowledge of the current best practice in the field of learning and leadership development, and experience in working at a senior level across complex organisations. You will also have experience of leading and managing projects and programmes that involve multiple stakeholders, as well as of managing people, budgets and resources.&lt;/p&gt;\n&lt;p&gt;You will use your training and learning expertise to help co-design the content of our programmes alongside an internal faculty, drawing on subject matter expertise as required. You will also be comfortable with being “hands on” in terms of leading and facilitating learning interventions as part of the programme delivery.&lt;/p&gt;\n&lt;p&gt;In return you will get the opportunity to help develop and implement a programme that will be legacy for the organisation in the years to come, as well as work with our fantastic colleagues from all roles and disciplines across the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;As part of the recruitment process, candidates will undertake and a competency- based interview, and be required to make an on-line presentation.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For an informal conversation about this role, please contact Marita Brown, Head of Staff Development, marita.brown@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Leadership Development Programme Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238551", "validThrough": "2020-11-08T23:59:59+0000"}