{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-26T13:17:11+0000", "description": "&lt;p&gt;The Luton and Dunstable University Hospital is welcoming applications for the position of a part time Locum Consultant in Acute Paediatrics to start as soon as possible for 6 months. The successful candidate will gain experience as a consultant in a busy but very supportive Paediatric unit.&lt;/p&gt;\n&lt;p&gt;The post will be based at the Luton and Dunstable University Hospital; the appointee will be expected to significantly contribute to the acute Paediatric ward, attending Paediatric Assessment Unit (PAU) and Night on call rota cover. It is expected that the post holder, once appointed, will work in partnership with the existing Consultant Paediatricians.&lt;/p&gt;\n&lt;p&gt;The Paediatrics Department is a busy unit with growing in-patient and out-patient services. In 2018/19 there were in excess of 10,000 Paediatrics emergency admissions including an increasing number receiving High Dependency Care. During the same time period more than 11,000 appointments were offered in the Paediatric/Neonatal outpatient clinics.&lt;/p&gt;\n&lt;p&gt;The Department has always been renowned for its friendly atmosphere, good working relationships and an enthusiasm for teaching and training. There are well-developed links with Tertiary Units in both London and Cambridge and there are a number of specialist Outreach clinics. Our Tertiary level 3 Neonatal Unit has entirely separate Junior and Consultant rotas.&lt;/p&gt;\n&lt;p&gt;The Hospital serves a local population of approximately 310,000 and has excellent access to Central London by road or rail and to the Midlands and the North via the M1/A1. The town also has an international and domestic airport. The surrounding areas are both urban and rural, the latter including many attractive villages within easy reach of the Hospital. Excellent schools are found nearby.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be subject to full Occupational Health Clearance and an Enhanced Disclosure and Barring Service check prior to commencement.&lt;/p&gt;\n&lt;p&gt;Residence is required within ten miles by road or thirty minutes travelling time to the hospital when on-call.&lt;/p&gt;\n&lt;p&gt;It is an exciting time to be joining the newly formed Bedfordshire Hospitals NHS Foundation Trust which has resulted from the merger of The Luton and Dunstable University Hospital and Bedford Hospital NHS Trusts. The merger took place on 1st April 2020 and under the umbrella of the single NHS Trust both hospitals will retain their identity and individual hospital names. Key services will remain on both sites and be managed as single teams across the whole Bedfordshire catchment area. This will bring many benefits for patients and opportunities for staff. Travel between hospital sites may be required.&lt;/p&gt;\n&lt;p&gt;Applicants should have an appropriate CCT in Paediatrics and be on the General Medical Council’s Specialist Register. Those who are within six months of obtaining their CCT may apply.&lt;/p&gt;\n&lt;p&gt;The L&amp;D is an Equal Opportunities Employer and operates a No Smoking Policy.&lt;/p&gt;\n&lt;p&gt;(To apply online please visit NHS Jobs, job reference: 418-M-PD-383&lt;/p&gt;\n&lt;p&gt;Advert will close: Monday 9th November&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;COMMITTED TO EQUAL OPPORTUNITIES&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Ronald MisquithJob titleConsultant Paediatrician and Clinical Director Telephone number 01582 718173&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Luton and Dunstable Hospital, Luton", "postalCode": "LU4 0DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8942", "longitude": "-.474244"}}, "title": "Locum Consultant in Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242638", "validThrough": "2020-11-09T23:59:59+0000"}