{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-03T10:31:27+0000", "description": "&lt;p&gt;As one of the largest acute Trusts in the UK – and with more than 20,000 employees – Manchester University NHS Foundation Trust (MFT) is on an exciting mission to deliver high-quality care to the people of Manchester, Trafford and beyond. Our vision is to create and deliver a seamless 24/7 service that extends beyond excellent care within our nine hospitals and community services within our Local Care Organisations.&lt;/p&gt;\n&lt;p&gt;Your role will be to provide strategic and operational support to the Fire Safety, Prevention &amp; HIP2 Prog.&lt;/p&gt;\n&lt;p&gt;Your role will be to assist the Group Fire Safety Manager in all fire safety matters across the North Manchester General Hospital (NMGH) and associated estate (including community properties). They will be responsible for the day to day supervision of the fire safety team located at NMGH. They will also provide support to the Group Fire Safety Manager in relation to managing the Helipad Response Team.&lt;/p&gt;\n&lt;p&gt;Your role will be to take responsibility for the day-to-day implementation of the fire safety policy and fire safety management plan&lt;/p&gt;\n&lt;p&gt;Your role will be to Report non-compliance with legislation, policies and procedures to the Director of Estates and Facilities&lt;/p&gt;\n&lt;p&gt;Your role will be to obtain expert advice on fire legislation&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Senior Fire Safety Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253464", "validThrough": "2020-11-18T23:59:59+0000"}