{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T15:01:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Stroke Research Nurse, &lt;/strong&gt;&lt;strong&gt;Band 6, 1.0 WTE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Kent &amp; Canterbury Hospital&lt;/strong&gt;&lt;strong&gt;, Canterbury&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term Contract/Secondment (12 months)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;East Kent Hospitals University NHS Foundation Trust (EKHUFT) is a large, diverse and complex organisation with an active and vibrant research programme. &lt;span&gt;&lt;span&gt;An exciting opportunity is available for an enthusiastic and motivated individual to join our busy research team in east Kent. We are looking for an experienced nurse to support and expand the large portfolio of NIHR research studies within the Trust. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The post-holder will initially be based at the Kent &amp; Canterbury Hospital, within our well-established research team. As part of the Research &amp; Innovation department, you can expect to work with a dynamic and proactive team, who recognise and integrate research as a core aspect of care delivery. The role will involve setting up and recruiting patients to a variety of high quality research studies, including commercially sponsored studies.&lt;/p&gt;\n&lt;p&gt;This post will focus primarily on stroke research and will be initially based at the Kent and Canterbury Hospital as stroke services are currently located at this site. However, this is not a permanent situation and long-term, the service will relocate to one or both of the other acute sites located in Ashford and Margate. The post-holder will therefore be required to follow the movements of the service so flexibility, along with the ability and willingness to travel to all sites, are essential requirements for this post.&lt;/p&gt;\n&lt;p&gt;Applicants should have current NMC registration with at least 3 years of post-registration experience and previous knowledge/experience of research. Experience of working with stroke patients is also essential. Excellent communication &amp; organisational skills and meticulous attention to detail are other essential requirements for this post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ruth Hulbert, Lead Research Nurse&lt;/p&gt;\n&lt;p&gt;Email address:rhulbert@nhs.netTelephone number07866793813&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Stroke Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254471", "validThrough": "2020-11-17T23:59:59+0000"}