{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata)"}}, "datePosted": "2020-11-06T14:16:04+0000", "description": "&lt;p&gt;Ward 230 are looking for motivated, enthusiastic and innovative band 5 staff nurses to join their team. We are a 36 bedded acute medical ward specialising in Gastroenterology and Hepatology. We have a workforce model focused on providing safe and effective patient care and developing skills and leadership within the nursing team.&lt;/p&gt;\n&lt;p&gt;We have a Clinical Educator specific to Gastroenterology who will support you fully in developing the skills required in this speciality, in addition to the rest of the team who will offer excellent support and training.&lt;/p&gt;\n&lt;p&gt;In this post you will be responsible for assessing and caring for patients and providing an effective care pathway within ward 230. We are committed to developing a culture in line with the Trust values that will improve quality and enhance the patients&#39; experience. You will be able to play a vital part in developing new ways of working to achieve this goal.&lt;/p&gt;\n&lt;p&gt;Candidates must be a first level registered nurse and be flexible to the demands of the service. You will be working as part of a multi-disciplinary team that includes Clinical Nurse Specialists in Liver disease, Inflammatory Bowel Disease, Nutrition, Gastro Dieticians, Alcohol Liaison and many more.&lt;/p&gt;\n&lt;p&gt;Excellent communication skills are essential for the post&lt;/p&gt;\n&lt;p&gt;Full and part time hours are available to cover a 7 day 24 hour service including weekends and public holidays. We can also offer predominant night shifts in line with the flexible working hours policy if so desired.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLaura GilbertJob titleWard ManagerEmail addresslaura.gilbert@uhnm.nhs.ukTelephone number01782 676230&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Stoke / County Hospital, Stoke on Trent / Staffordshire", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Staff Nurse Ward 230", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260079", "validThrough": "2020-12-04T23:59:59+0000"}