{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,112"}}, "datePosted": "2020-10-22T09:46:08+0100", "description": "&lt;p&gt;&lt;strong&gt;Looking for a new nursing role with flexibility?&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Need a bit of guaranteed income to get you through the expense of Christmas and New Year?&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Join our Winter Warriors team for flexible working opportunities this winter and beyond!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To support our existing teams across the Northern Care Alliance we are seeking registered nurses and ODP’s to join us on a flexible basis. With a variety of contract types available, these roles are aimed at providing you with a role that will fit around both your needs and the needs of our patients.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Our nursing teams appreciate that you will have lots of commitments in your home life and finding a job to fit around that can sometimes be a challenge. We are keen to ensure our workforce is accommodated as much as possible and are made to feel valued so that you can come to work ready to take on the world every day.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;So whether you want nights only, weekends only or other flexible shift patterns we welcome the chance to discuss this with you.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;There are both permanent and fixed term positions available. So if it’s some security over the winter months you’re after we’d be happy to support you. Alternatively if you decide you’d like to work with us permanently, this is also something we can accommodate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our commitment to you&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Nursing teams who are passionate about delivering high quality care.&lt;/li&gt;\n&lt;li&gt;Support and encouragement from a future focused senior nursing team.&lt;/li&gt;\n&lt;li&gt;Flexibility, where possible we will support you with a shift pattern and contract that fits in with your day to day life.&lt;/li&gt;\n&lt;li&gt;A no strings contract, we’d love to keep great people with us but if 3 - 4 months is all you’re after then that’s absolutely fine.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nursing for the future&lt;/strong&gt;&lt;br /&gt;We are looking for enthusiastic and energetic individuals willing to get stuck in and hit the ground running. You’ll be someone who works well under pressure, is a great team player as well as being self-motivated and able to work independently when needed. You will be a professional who truly understands the need for care, consideration and respect for our patients but can also apply these qualities to your team members.&lt;br /&gt;A sense of ownership for your patients, a ‘can do’ attitude and determination to deliver the best patient care is essential in departments that can have a massive impact on the patient experience.Our teams here are passionate about making the experience as patient focused as possible.&lt;/p&gt;\n&lt;p&gt;We welcome the chance for you to see how our departments work together and encourage you to visit us as part of your application.&lt;br /&gt;For further details / informal visits contact:&lt;br /&gt;resourcingNCA@srft.nhs.uk with the subject titled &lt;strong&gt;‘Winter warriors&lt;/strong&gt;’ and detailing the site and specialty you are interested in.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;br /&gt;resourcingNCA@srft.nhs.uk with the subject titled ‘Winter warriors’ and detailing the site and specialty you are interested in.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various, Various", "postalCode": "M50 1SY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4824", "longitude": "-2.31492"}}, "title": "Staff Nurse - flexible", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237763", "validThrough": "2020-11-30T23:59:59+0000"}