{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40894", "minValue": "40894", "unitText": "YEAR", "value": "Up to £40,894 depending on experience"}}, "datePosted": "2020-11-01T15:14:03+0000", "description": "&lt;p&gt;&lt;strong&gt;Role&lt;/strong&gt;: Highly Specialist Speech and Language Therapist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full or Part-time options available&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: Southlands School&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary/Benefits&lt;/strong&gt;: Generous package available up to £40,894 depending on the level of experience. Wider Management Responsibilities options for the right candidates with additional compensation availiablie.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you a passionate and enthusiastic Speech and Language Therapist (SLT) who is looking to join our multidisciplinary team?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a unique post where you will deliver an SLT service and provide support to individuals with a range of Learning Disabilities and Autism Spectrum Disorders (ASD), often accompanied by complex needs and challenging behaviours.&lt;/p&gt;\n&lt;p&gt;This an exciting opportunity to be part of a dynamic team to support the change and reinvigoration of Southlands School. An exciting opportunity has arisen for a Highly Specialist Speech and Language Therapist to work along site the onsite clinical team and be part of the new leadership team, which has a clear vision for growth and positive change.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Southlands School&lt;/strong&gt; is an Ofsted-registered independent specialist school, offering 38-week through to 52-week residential and day placements for boys and girls aged 7-19 years old with a diagnosis of Asperger&#39;s Syndrome and other associated difficulties on the Autistic Spectrum.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The purpose of the school is to prepare students for the demands of adult life through staff expertise and specialist approaches. This included providing a nurturing environment that encourages students to flourish academically, socially, emotionally and spiritually.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Southlands School&#39;s approach to behaviour change is positive and non-aversive. The teaching styles and strategies are developed with Asperger Syndrome/high functioning Autism in mind and are very much led by the needs of the students.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The work of staff is based upon understanding the ability of the student to manage academically, socially and emotionally in various situations. Individualised plans are designed to meet students&#39; specific needs, and these plans form the basis of the four way partnership between the student, school, family and local authority.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why join us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Along with a competitive salary and benefits package, we also offer excellent training and development opportunities to include: full induction training, excellent clinical supervision, CPD and developmental opportunities for clinical and non-clinical duties. You will receive full support from our onsite multidisciplinary team and join in routine service meetings with companywide Speech and Language Therapists.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Speech and Language Therapist, you will work with a range of individuals to maximise their potential and to enable them to enjoy the best possible quality of life. As an SLT, you will be independently working with individuals to assess communication needs in a range of environments,implement approaches to support communication based on the outcome of individual’s assessments and provide functional targets and recommendations to aid day-to-day communicative success. You will work as part of a multidisciplinary team and support the implementation of the therapeutic approach across the environment.&lt;/p&gt;\n&lt;p&gt;You will respond to referrals and be responsible for ensuring an inclusive communication environment is maintained, audits are completed and the RCSLT 5 good communication standards are utilised. A key aspect of your role will be to work effectively as part of the companywide SLT team and contribute to service development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate for this role will have a degree or a postgraduate diploma in Speech and Language Therapy (or equivalent) and be registered with the Health &amp; Care Professions Council (HCPC). You will have experience working with individuals that have Learning Disabilities and/or Autism Spectrum Disorders and preferably have worked with AAC approaches.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full support from a multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Clinical supervision&lt;/li&gt;\n&lt;li&gt;Developmental opportunities&lt;/li&gt;\n&lt;li&gt;Research opportunities &amp; support&lt;/li&gt;\n&lt;li&gt;Internal/external training on new initiatives&lt;/li&gt;\n&lt;li&gt;25 days annual leave plus bank holidays (with increments for the length of service included) - Pro Rata&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for a dedicated, enthusiastic, resilient and forward thinking Speech and Language Therapist to join our team. You will be someone with a genuine desire to help others.&lt;/p&gt;\n&lt;p&gt;This role is exempt from the Rehabilitation of Offenders Act 1974 and we are committed to safeguarding and protecting the people within our care. Therefore, the successful candidate will be required to undergo an enhanced DBS check and an offer of employment will be subject to successful clearance.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130935.png", "name": "Cambian Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lymington", "postalCode": "SO41 5QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7748", "longitude": "-1.53975"}}, "title": "Highly Specialist Speech and Language Therapist - Southlands School", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251184", "validThrough": "2020-11-29T23:59:59+0000"}