{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-10-27T09:31:17+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Staff Nurses&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Meadowfield Hospital&lt;/span&gt;&lt;/strong&gt;&lt;strong&gt;&lt;span&gt; @Rowan Ward want you!!!!&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Full Time (part time also considered)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a passionate, motivated and innovative mental health nurse? &lt;/span&gt;&lt;span&gt;Do you want to work in a vibrant and exciting environment within acute mental health inpatient services? If you answered yes to any these questions, then Rowan/Maple ward &lt;/span&gt;&lt;span&gt;are looking for people like you to join us on the journey to providing outstanding care and support to service users, carers and their families in West Sussex.&lt;/span&gt;&lt;span&gt; We have opportunities for staff nurses, both newly qualified, and for those with experience who are looking to further their professional development, and are looking for a new challenge. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We here at Meadowfield are excited at the prospect of developing our service further this year and building upon the recent ‘Good’ CQC rating across Acute services, with recognition of ‘Outstanding’ in the caring domain&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Meadowfield is a purpose built acute mental health unit in Worthing, offering person-centered and individualised care to the people of Adur, Arun and Worthing. Meadowfield has 34 mixed gender beds for people of working age (Maple and Rowan Wards). We also have Larch Ward for people over the age of 65; all 3 wards operate with open doors. This is something we are incredibly proud of here at Meadowfield, and often contributes to positive comments about the atmosphere here on any of the wards.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for experienced and newly qualified mental health nurses who are motivated, dynamic and forward thinking to work at Meadowfield. You will have a commitment to maintaining and improving service user centered care to the highest standards. Working as part of the multi-disciplinary team you will be able to demonstrate sound communication and clinical skills and be willing to develop these. With 3 Charge Nurses on each ward and links to other acute services there are opportunities to progress your career here at Meadowfield and within Sussex Partnership Foundation Trust. In return you will benefit from working in a therapeutic environment conducive to the treatment and recovery of people with acute functional mental health problems.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All your skills and training will be fully utilised and developed through clinical supervision and training opportunities including a preceptorship academy for newly qualified nurses and modules offered by the University of Surrey and University of Brighton as well as Trust essential training and an Emerging Leadership Course. We offer a two week induction which gives you the opportunity to spend time working with different teams including Crisis Resolution Teams, A&amp;E Liaison, Community Teams and AOT to offer you a better understanding of how services fit into the community around us. There are plenty of opportunities for career development in one of the largest Mental Health Trusts in the South of England.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All&lt;/span&gt;&lt;span&gt; post&lt;/span&gt;&lt;span&gt;s&lt;/span&gt;&lt;span&gt; offers the Trust&#39;s £2000 Golden Hello for band 5 or 6 Nurses, or a relocation package up to a maximum of £2000 (subject to terms and conditions).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please feel free to get in touch for an informal chat, or even to arrange a visit to come in and have a cup of tea and have a look around our hospital and see what services are on offer here. Contact details can be found below. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We look forward to your application.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJohn RogersJob titleWard ManagerEmail addressjohn.rogers@sussexpartnership.nhs.ukTelephone numberTel: 01903 843222 Mob: 07391 415567&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Meadowfield, Worthing", "postalCode": "BN13 3EF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8424", "longitude": "-.41189"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243835", "validThrough": "2020-11-10T23:59:59+0000"}