{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 pa inc"}}, "datePosted": "2020-10-30T15:31:47+0000", "description": "&lt;p&gt;The Royal Marsden NHS Foundation Trust is one of the leading cancer centres in the world and has an international reputation for the care and treatment it provides. The Royal Marsden serves a local, regional, national and international population from two hospital sites, Chelsea and Sutton.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and committed Band 5 staff nurse to join our nursing team to provide expert care and support to our patients within the outpatient clinic setting.&lt;/p&gt;\n&lt;p&gt;There are many new and exciting innovative opportunities for a Band 5 nurse within the Royal Marsden Trust. This is a great opportunity to develop your existing skills and knowledge, but also to learn new one’s in caring for cancer patients at all points of their cancer pathway.&lt;/p&gt;\n&lt;p&gt;RDAC offers a variety of clinics from Breast one stop clinics, minor ops clinics, head &amp; neck clinics, bladder and sarcoma clinics, plus many others.&lt;/p&gt;\n&lt;p&gt;If you are passionate about making a real difference to patients’ experiences, understand their anxieties and wish to gain an insight into cancer care, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a qualified Staff Nurse with at least a year’s experience in an acute hospital setting. We are looking for someone who is flexible, a good team player with a real commitment to providing good quality patient care. Experience of working in a clinic setting would be an advantage but is not essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Laura Asika, Deputy Matron, Laura.Asika@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden Hospital, Chelsea", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Staff Nurse - RDAC", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250768", "validThrough": "2020-11-13T23:59:59+0000"}