{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-26T08:17:09+0000", "description": "&lt;p&gt;&lt;strong&gt;***Overseas nurses - Please note we are not currently recruiting overseas nurses until Spring 2021. We would welcome applications at that time.***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A city with a historic past – A nursing career with a promising future!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to work in a team that is passionate about providing the best possible patient centred care? If so, then this could be the role for you.&lt;/p&gt;\n&lt;p&gt;At York Teaching Hospital NHS Foundation Trust, we are looking for talented and caring nurses to join our workforce to become true Heroes of Healthcare. This advert is for Registered Nurses, University Nursing Graduates, or returning to practice.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Reasons to choose York Teaching Hospital NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Trust we continually invest in growing and developing our staff, while supporting them to provide the best possible care to our patients. Our Nurses make a genuine difference to patients’ lives, so as a Registered Nurse joining our Trust, we offer you continuous support to help your development while you help to make a difference to our patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What wards are you looking to recruit to?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We currently have a range of exciting opportunities across many of our general nursing areas including medical and surgical. We will always endeavour to offer you a role in your preferred area, so simply submit your application telling us your top three choices. If you are only interested in one particular area please just let us know.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What incentives can you offer me?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We promise you a warm welcome and all the help and support we can offer to enable you to be the very best you can be. This includes a first rate induction, access to a range of development programmes and an excellent staff benefits package. We also offer a number of other benefits for our Band 5 Staff Nurses which include the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Relocation payment - You may be eligible for a payment of £750 if you are relocating to join our Trust.&lt;/li&gt;\n&lt;li&gt;Refer a Friend - You will receive a £250 payment if you refer a nurse to us who subsequently takes up employment in our Trust (paid after the new starter completes 3-months in post).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What if I am currently studying my nursing degree?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Not a problem! We welcome applications from student who are in their final year of their nursing degree, or those coming to the end of their second year&lt;strong&gt;. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Trust we continually invest in growing and developing our staff to support them in providing the best possible care to our patients. Our Nurses make a genuine difference to patients’ lives, so as a University Nursing Graduate joining the Trust we want to show how much we value you as you make the transition from Graduate to Newly Registered Nurse.&lt;/p&gt;\n&lt;p&gt;What we can offer you as a University Nursing Graduate&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Registration fee - We will pay your admission fee for entry onto the NMC register&lt;/li&gt;\n&lt;li&gt;Relocation payment - As above.&lt;/li&gt;\n&lt;li&gt;Refer a Friend - As above.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will automatically be enrolled in our 12 month preceptorship programme. This is an established preceptorship scheme designed around your continuous development with nursing skills, leadership, values and the importance of care and compassion.&lt;/p&gt;\n&lt;p&gt;Here are some of the comments that our recently recruited newly qualified staff fed back about our preceptorship programme;&lt;/p&gt;\n&lt;p&gt;“Stress free learning environment”&lt;/p&gt;\n&lt;p&gt;“The opportunity to voice worries &amp; concerns in a safe environment”&lt;/p&gt;\n&lt;p&gt;“Nice to have protected time away from the departments”&lt;/p&gt;\n&lt;p&gt;“A chance to learn &amp; develop further skills”&lt;/p&gt;\n&lt;p&gt;“Getting to know the specialist &amp; senior teams”&lt;/p&gt;\n&lt;p&gt;During preceptorship&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will receive a local induction and also a period of supervised practice in which you will retain supernumerary status&lt;/li&gt;\n&lt;li&gt;You will have the support of an assigned preceptor/mentor.&lt;/li&gt;\n&lt;li&gt;You will receive support from our team of Professional Education Facilitators&lt;/li&gt;\n&lt;li&gt;You will paid a band 5 salary while awaiting registration with the NMC&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further information about our fantastic preceptorship programme please feel free to contact our dedicated Quality and Professional Practice Sister, Vicky Angell on 01904 724052 or victoria.angell@york.nhs.uk who will be happy to provide you with some further details.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What happens after I apply?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;After submitting your application form you will receive a phone call from the Recruitment Team. This is a withheld number so please do pick up. We will discuss your ward preferences and the next steps regarding arranging an interview. All Nurses are offered a guaranteed interview at the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Want to know a little more about York Teaching Hospital NHS Foundation Trust?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust provides a comprehensive range of specialist acute and community healthcare services for approximately 800,000 people living in York, North and East Yorkshire and Ryedale - an area covering 3,400 square miles. We manage community-based services in Selby, York, Scarborough, and Ryedale, and deliver a wide range of acute and elective services in our hospitals in Scarborough, York and Bridlington, as well as outpatient services across all of our localities. We manage eight hospital sites and have a workforce of 8,500 staff working across our hospitals and in the community.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to receiving your application!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt; for Midwifery and Mental Health Nurse positions please look out for separate, dedicated vacancies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Other opportunities&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Registered Nurses at Scarborough&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are interested in registered staff nurse vacancies at Scarborough hospital, please look at vacancy reference: &lt;strong&gt;419-261020-S-SN&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York Teaching Hospital, York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Registered Nurse/ Nurse Graduate Opportunites at York", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241716", "validThrough": "2020-12-07T23:59:59+0000"}