{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T13:01:15+0000", "description": "&lt;p&gt;A fantastic opportunity has arisen for dynamic and motivated psychological professionals to join Durham and Darlington Child and Adolescent Mental Health Service. We have three full-time Band 7 posts available and invite applications from suitably qualified psychological therapists in evidence-based psychological therapies including systemic family therapy and CBT, and HCPC registered applied psychologists.&lt;/p&gt;\n&lt;p&gt;The post holders would join our service at an exciting time of service transformation as we seek to enhance our psychological therapy provision within our community child and adolescent mental health services. We deliver evidence-based psychological therapies to children and families from our community bases in Darlington, Newton Aycliffe, Consett, Durham City and Peterlee. The posts have been developed following increased service demand due to Covid-19. We are therefore seeking creative and flexible psychological professionals to help improve access to psychological therapies, deliver interventions locally to children and families and also through use of remote methods such as video calls.&lt;/p&gt;\n&lt;p&gt;You will be expected to have the necessary skills and experience to undertake direct clinical work with children and families, offer clinical supervision and consultation, contribute to service evaluation, as well as manage the demands of service development and change. Candidates should be skilled psychological professionals with excellent interdisciplinary working skills and interested in contributing to the development of an innovative service.&lt;/p&gt;\n&lt;p&gt;There is a well-established and supportive Psychological Professions Network within the wider Durham and Darlington Children and Young People’s Service supported by a highly motivated team of senior managers and clinical leads. Strong links exist between the service and local training courses in clinical psychology, counselling psychology and psychological therapy. Within the Trust we have an established Foundation Programme in Family Therapy and Systemic Practice accredited with AFT and specialist interest groups in evidence-based psychological therapies including systemic family therapy and CBT.&lt;/p&gt;\n&lt;p&gt;Applied Psychology and Psychological Therapy is highly valued within the Trust with good professional support. Psychological Professionals provide key leadership roles within the Trust and leadership skills and behaviours are integral to the recruitment process.&lt;/p&gt;\n&lt;p&gt;The Trust is a strongly value based, person-centred organisation which has taken a strategic approach to continued service improvement, the modernisation of clinical roles and the use of care pathways embedded within a functioning system of governance.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Nigel Trevarrow, Consultant Clinical Psychologist and Locality Lead for Psychological Professions, Durham and Darlington CAMHS; nigel.trevarrow@nhs.net; Tel 0191 2888400&lt;/p&gt;\n&lt;p&gt;Tracy Storey, Service Manager, Durham and Darlington CAMHS; tracy.storey@nhs.net; Tel. 07771 387583&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Gillian Leckenby, Locality Manager for D&amp;D CAMHS, Manager, South Durham CAMHS; gillian.leckenby@nhs.net, Tel. 07909 970809&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester House, Peterlee", "postalCode": "SR8 2RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.7557", "longitude": "-1.36562"}}, "title": "Psychological Therapist / Systemic Family Therapist / CBT Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246693", "validThrough": "2020-11-15T23:59:59+0000"}