{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112  pa pro rata"}}, "datePosted": "2020-10-13T12:46:20+0100", "description": "&lt;p&gt;We’re looking for nurses to join our medicine care group at University Hospital Southampton NHS Foundation Trust (UHS). The medicine care group incorporates inpatient respiratory, gastroenterology, general medicine, medicine for older people and cystic fibrosis ward.&lt;/p&gt;\n&lt;p&gt;Please note that this vacancy is for experienced nurses – if you’re a newly qualified nurse you should apply through our dedicated newly qualified adult or child nurse adverts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TEAMS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;RESPIRATORY MEDICINE&lt;/p&gt;\n&lt;p&gt;The inpatient respiratory department has two wards and a high dependency unit caring for a wide range of respiratory conditions including those requiring non-invasive ventilation, tracheostomy care and long-term respiratory conditions. We’re a multi-disciplinary team working alongside the respiratory specialist nurses and physiotherapists to provide excellence in nursing care.&lt;/p&gt;\n&lt;p&gt;GASTROENTEROLOGY, HEPATOLOGY AND RENAL&lt;/p&gt;\n&lt;p&gt;Gastroenterology care for inpatients with a variety of gastrointestinal illnesses. The department has links with the newly refurbished endoscopy unit, working collectively in the patients’ best interests. You’d be part of a team who strive for compassionate care in a friendly and safe environment. In addition, this area also cares for patients with a hepatology diagnosis which includes liver disease, detoxing and much more. Renal patients are also catered for in this area.&lt;/p&gt;\n&lt;p&gt;GENERAL MEDICINE&lt;/p&gt;\n&lt;p&gt;The inpatient general medicine department is located on ward E7 and D7 and cater for any other medical need that does not fall within gastroenterology, renal, hepatology and respiratory. An element of our work also includes looking after patients with a mental health diagnosis in their acute phase.&lt;/p&gt;\n&lt;p&gt;D10 ISOLATION WARD&lt;/p&gt;\n&lt;p&gt;This area cares for patients with an infection that requires isolation. This area provides greater knowledge of infectious diseases.&lt;/p&gt;\n&lt;p&gt;MEDICINE FOR OLDER PEOPLE&lt;/p&gt;\n&lt;p&gt;Medicine for Older people (MOP) comprises of four acute wards, a transition ward and an enhanced dementia unit. You will be support in an inclusive environment supported by strong nursing leadership including a dedicated matron, older person’s practitioners and a committed band 7 team to guide and support you. MOP can offer a rotation through the different areas and provide an education program to support specialism in elderly care nursing.&lt;/p&gt;\n&lt;p&gt;The MOP multi-disciplinary team have recently won the prestigious BMJ care of the older person award praising the culture of putting patients at the centre.&lt;/p&gt;\n&lt;p&gt;C5 ISOLATION WARD&lt;/p&gt;\n&lt;p&gt;C5 has 14 rooms and cares for patients with higher risk diseases and also is the base for our cystic fibrosis patients. Our isolation unit is an exciting development that will see us deliver world-class infection prevention practice. You will be shaping how we deliver truly individual care, bringing vision, fresh ideas and a willingness to learn.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We run comprehensive education programmes such as our respiratory and gastroenterology education programme which ensures out team have high levels of knowledge and the skills required to provide excellent specialist care. MOP will also give you the chance to develop your acute care and dementia care skills, learning how to manage complex patients.&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible environment in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;All areas will give you the opportunity to take part in rotations and will consider any flexible working requirements that you may have and you’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Rated ‘Good’ by the CQC, UHS is one of England&#39;s largest acute teaching trusts. In the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kelly Hedges&lt;/p&gt;\n&lt;p&gt;Kelly.hedges@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381208348&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Staff nurse - Specialist medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224352", "validThrough": "2021-01-13T23:59:59+0000"}