{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum pro rata"}}, "datePosted": "2020-10-26T12:46:57+0000", "description": "&lt;p&gt;&lt;strong&gt;Birmingham and Solihull Mental Health NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ACUTE AND URGENT CARE SERVICES &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent Principal Clinical or Counselling Psychologist, Band 8b&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Based at The Oleaster Centre, within Acute Psychological Services, Part Time (0.5 whole time equivalent). &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is much exciting transformational work going on within the service at the moment. If appointed, you will be encouraged to bring innovative ideas and enthusiasm to participating in taking this work forward.&lt;/p&gt;\n&lt;p&gt;Along with another part-time Band 8B clinical psychologist, the successful applicant will share leadership and line management responsibilities for the psychology staff at this base. You will provide clinical supervision to psychology colleagues and to trainees, as needed. You will also work closely with the Clinical Nurse Manager and other senior colleagues and will be professionally line managed by the Consultant Lead Clinical Psychologist for Acute Psychological Services.&lt;/p&gt;\n&lt;p&gt;We are looking for applicants who are passionate about working with service users with severe and enduring mental health problems. You will provide comprehensive psychological assessments and formulations for our service users to help them more fully understand their difficulties. You will have expertise in a range of psychological interventions and provide brief therapy to help service users through the crisis and to reduce their risk. You will be responsible for liaising with psychological services, internal and external to the Trust, to ensure service users move on as smoothly as possible through the care pathway, to receive the psychological input they need to recover.&lt;/p&gt;\n&lt;p&gt;BSMHFT has fifteen single gender inpatient wards and nine Home Treatment Teams, providing support for adults of working age. You will be joining an established and supportive acute psychological services team of twelve qualified psychologists and two psychology assistants.&lt;/p&gt;\n&lt;p&gt;We support research and development. We are committed to anti-racist practice and ensuring a service that embraces all aspects of diversity in service users and colleagues. Ideas for innovation are welcome and their development is actively supported. We are part of a wider psychological service across working age adults and have an annual in-house programme of continuing professional development. We also have training specifically tailored to acute working. There also opportunities to access external training in specific therapeutic interventions that are in line with the needs of the service, our service users and their carers.&lt;/p&gt;\n&lt;p&gt;We have long-established links with the clinical psychology training programmes in the region and you will be involved in the supervision of trainees from the Birmingham and Coventry/Warwick doctorate courses. There will be opportunities for teaching.&lt;/p&gt;\n&lt;p&gt;You must be registered as a Practitioner Psychologist with the Health and Care Professions Council. You will have had considerable post qualification experience of working with service users in adult secondary and tertiary care settings.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Gary Roberts, Consultant Lead Psychologist for Acute Psychological Services. on 0121 301 6100.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGary RobertsJob titleConsultant Lead Clinica PsychologistEmail addressgary.roberts4@nhs.netTelephone number0121 301 6100&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oleaster Centre, Birmingham", "postalCode": "B15 2SY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4502", "longitude": "-1.94218"}}, "title": "Band 8b Principal Clinical Psychologist - Oleaster Adult Inpatients", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242515", "validThrough": "2020-11-13T23:59:59+0000"}