{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58769", "minValue": "55931", "unitText": "YEAR", "value": "£55,931 - £58,769 per annum"}}, "datePosted": "2020-11-05T16:45:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Reference Number: 919-SH-2780199-EXT&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job title: &lt;/strong&gt;Senior Finance Manager – NIS North&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;Public Health England&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; Financial Management (FM)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locations:&lt;/strong&gt; Leeds&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Grade: &lt;/strong&gt;G7 Upper&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£55,931 - £58,764&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 37.5&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt; Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: &lt;/strong&gt;10 November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: &lt;/strong&gt;tbc&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Public Health England provides strategic leadership and vision for protecting and improving the nation’s health. Its ambition is to lead nationally, and enable locally, a transformation in the health expectations of all people in England, regardless of where they live and the circumstance of their birth. It will achieve this through the application of research, knowledge and skills. PHE is an executive agency of the Department of Health. It is a distinct delivery organisation with operational autonomy to advise and support government, local authorities and the NHS in a professionally independent manner.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Finance &amp; Commercial Directorate&#39;s aim is to provide PHE with efficient, effective and economic financial, IT, estates and facilities and business development services to enable PHE to achieve its strategic goals, as well as taking the lead on a number of general activities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Financial Management (FM) service sits within the wider finance function and is formed of local teams whose roles cover budget setting and budget monitoring, financial analysis &amp; financial modelling, financial systems, revenue activity and for the provision of a comprehensive business partnering service. Revenue project accounting and the accounting for the local authority public health grant also fall under the remit of the FM department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Purpose / Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To support the delivery of a professional and expert Finance decision support service in order to optimise decision making and financial management across the Directorates’ business units that have been assigned to the postholder; acting as the main resource for all financial aspects of the assigned units including specialist financial input and advice, financial analysis and operational support that is required to deliver the complex objectives.&lt;/p&gt;\n&lt;p&gt;To help the Deputy Head of Financial Management work with the Director, the Deputy Director equivalents and other senior staff to provide expert advice, to foster a culture of sound budgetary management, financial probity and value for money.&lt;/p&gt;\n&lt;p&gt;To ensure the provision of traditional management accounting and financial management functions to senior management teams and assigned units by business partnering, and including the management of the junior staff in the team.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information / an informal discussion about the post, please contact Andres Van den Berg, Head of Finance – National Infections Service - on 079 1921 6724 or andres.vandenberg@phe.gov.uk&lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Andres Van den Berg Job title Head of Finance - NIS Email address andres.vandenberg@phe.gov.uk Telephone number 079 1921 6724&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds, Leeds", "postalCode": "LS2 7PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Senior Finance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258616", "validThrough": "2020-11-19T23:59:59+0000"}