{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. pro rata"}}, "datePosted": "2020-11-02T12:31:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust has transitioned to a new provider of IT infrastructure and support services. As part of this change an exciting new opportunity has arisen to join a recently formed Service Delivery team within eHospital (IT). Three IT Service Delivery Analyst posts have been created. The first two posts have been filled and we are looking to complete the team and fill the final post focussing on Change Management and Request management. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As an IT Service Delivery Analyst you will&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Be responsible for managing impacts to IT service, ensuring changes, incidents, risks and issues are well managed as well as running effective problem management and continuous service improvement processes.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work in unison with the IT outsourcer and other 3rd party providers to ensure that operational practises and processes work effectively on a daily basis by monitoring KPIs and the achievement of agreed SLAs. These will be delivered using ITIL principles.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build credible relationships with both users and IT suppliers exhibiting an appropriate level of support and challenge.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Retain the customer at the centre of their thinking by developing a detailed understanding of the user operational requirements.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Have an individual specific focus area but be able to cover for others in the team as required&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You will need to have experience of ITIL service principles and processes and significant experience in IT service delivery, in particular the areas of change and request management. You should have excellent interpersonal skills and be comfortable building relationships with customers at all levels. You must have excellent analytical and problem solving skills and be able to make recommendations based on analysis of complex data. You must be able to work under demanding timescales and remain calm under pressure particularly during major service disruptions&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This vacancy closes on 15 November 2020 – Midnight&lt;/p&gt;\n&lt;p&gt;Benefits to you&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel. For further details of our fantastic benefits please refer to the attachment below - CUH Benefits. Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered. We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSuzanne MulhollandJob titleService Delivery ManagerEmail addresssuzanne.muholland@addenbrookes.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital - Division Corporate, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "IT Service Delivery Analyst - eHospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252056", "validThrough": "2020-11-15T23:59:59+0000"}