{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-11-03T15:46:25+0000", "description": "&lt;p&gt;&lt;strong&gt;The Job Itself – 6 PA job Plan&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Consultant Physician – General Internal Medicine with a lead role in developing Diabetes Service (Technologies and Antenatal Care) (new post). This lead role is part of a core job with specialist interest in Diabetes and Endocrinology.&lt;/p&gt;\n&lt;p&gt;The content of this post is open to negotiation dependent on the skills of the prospective candidate and approval by the divisional team.&lt;/p&gt;\n&lt;p&gt;For Illustration we would be happy to include a Diabetes Specialist Pump Clinic, Antenatal and preconception diabetes clinics, Young persons- diabetes pump clinic, and the potential for a mix of General diabetes clinics, general endocrinology clinics, Diabetes foot clinic. We believe it is important for all colleagues to have some ongoing contribution to General medicine on call and inpatient care.&lt;/p&gt;\n&lt;p&gt;We are excited to offer a lead service development role in technologies. We hope that this will enable you to supporting our team in expansion of virtual clinic capacity and Advice and Guidance to primary care through existing E-referral service and new innovations.&lt;/p&gt;\n&lt;p&gt;The Antenatal multi-disciplinary team comprises an existing Diabetes Consultant, Obstetrician with a specialist interest in Diabetes and Medical Obstetrics, Senior Diabetes Specialist Midwife, Supporting Diabetes Specialist Midwife, Diabetes Nurse, Diabetes Specialist Dietician.&lt;/p&gt;\n&lt;p&gt;As an inpatient Consultant you have the ability to control access to our newly refurbished 14 bedded Diabetes and Endocrine unit (Ward C3). We have put considerable effort in recent years building appropriate skills and nurse development on this ward. The unit hosts the inpatient diabetes nursing Hub, a team of dedicated inpatient specialist nurses and educators, supported by our specialist dietician and specialist podiatry team. We anticipate that you will find continuity and control in this environment a rewarding experience. You are supported by a ward team comprising 2 Foundation year 1 doctors, a Physician Associate, a Diabetes specialist Pharmacist, a Core Medical trainee, an Associate specialist, and a Specialty training Registrar.&lt;/p&gt;\n&lt;p&gt;Outpatient clinics are also provided with the support of a multi-professional specialist outpatient team. The specialist team comprises specialist nurses, dieticians and podiatrists. We offer specialist clinics in all aspects of endocrinology and diabetes.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary. In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Angela Barrett&lt;/p&gt;\n&lt;p&gt;angela.barratt@stockport.nhs.uk&lt;/p&gt;\n&lt;p&gt;0161 419 4866&lt;/p&gt;\n&lt;p&gt;Richard Bell - Consultant Physician/ Clinical Director&lt;/p&gt;\n&lt;p&gt;richard.bell@stockport.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockport NHS Foundation Trust, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Consultant - Endocrinology and Diabetes", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254624", "validThrough": "2020-11-17T23:59:59+0000"}