{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a"}}, "datePosted": "2020-10-28T11:47:06+0000", "description": "&lt;p&gt;&lt;span&gt;Are you an experienced CAMHS Mental Health Practitioner looking for a new challenge? We have 2 whole time permanent posts 37.5 hours per week to join our existing A&amp;E Crisis Liaison service and a Home Treatment Service. The crisis service operates three shifts 8am-8pm, 12-12 and 8pm-8am 7 days a week and candidates will work on a rota basis across these hours.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will carry out initial assessments of children and young people presenting in the A&amp;E Department and on the wards of Milton Keynes University Hospital in mental health crisis, following an overdose, psychosis, deliberate self-harm or suicidal ideation. The post holder will undertake home support to avoid admission to hospital or to minimise length of time spent in hospital by providing an intensive community package of immediate post-discharge support to children/young people. To provide evidence based, short term interventions to children and young people such as: distraction/relaxation techniques, positive coping strategies, positive risk management, safety planning and risk reduction (self-harming behaviours), psycho education to service users and families/carers, and CBT-based interventions focussed on anxiety management.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCharlotte WilsonJob titleBusiness and Administration ManagerEmail addresscharlottewilson3@nhs.netTelephone number01908 724544&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eaglestone Health Centre, Milton Keynes", "postalCode": "MK6 5NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0248", "longitude": "-.738428"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246422", "validThrough": "2020-11-10T23:59:59+0000"}