{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-23T11:12:11+0100", "description": "&lt;p&gt;In order to cover maternity leave within our team, we are looking to recruit a highly skilled, enthusiastic and forward thinking Registered Children’s Nurse to our integrated Community Children&#39;s Nursing (CCN) Team.&lt;/p&gt;\n&lt;p&gt;Our established, passionate and dedicated CCN and Special School Nursing teams work collaboratively with children, young people (CYP) and families within the wider multi-disciplinary team to ensure care is provided within the community wherever possible. We provide high quality and holistic, family centred care to CYP with a nursing need across Southampton and Hampshire area including those with;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Acute and short-term conditions&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Long term conditions&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Disabilities, complex conditions, those requiring continuing care and neonates&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Life-limiting and life-threatening illness, including those requiring palliative and end of life care&lt;/p&gt;\n&lt;p&gt;As a Staff Nurse within the CCN service you will have the opportunity to be part of a responsive service which continually adapts to the ever changing needs of the families we care for. You will have a key role in care planning, training and multi-disciplinary liaison for CYP with a range of needs within their home, school and wider community settings.&lt;/p&gt;\n&lt;p&gt;This opportunity will provide experience of working with CYP and families in the community setting as well as the chance to transfer a wide range of clinical skills. If you have excellent communication and interpersonal skills, the ability to work as part of a supportive team, as well as the initiative to work autonomously and effectively this could be the challenge for you.&lt;/p&gt;\n&lt;p&gt;At Solent NHS Trust, we are committed to putting patients at the forefront of care and are always looking for dedicated professionals who share our HEART values and passion for delivering high quality care. As a valued member of Solent NHS Trust, we’ll offer you regular 1-1 support, clinical supervision, comprehensive and on-going training/development and good quality working conditions. Solent NHS Trust is a well-regarded and established provider of community services in Southampton and across Hampshire. Join us and be part of a truly compassionate and caring team working to make a real difference within our Trust.&lt;/p&gt;\n&lt;p&gt;If our Staff Nurse within Community Children’s Nursing role appeals, you have the qualities we are looking for, share our values and feel excited by the prospect of how we can complement your professional career then we’d love to hear from you. We welcome you to contact us prior to interview to discuss this post further and would be happy to facilitate an informal visit.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Children&#39;s Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240243", "validThrough": "2020-11-30T23:59:59+0000"}