{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-21T10:46:03+0100", "description": "&lt;p&gt;These are exciting times in Aneurin Bevan University Health Board. Located in south east Wales, we are implementing the next phase of our Clinical Futures Programme - developing care closer to home. Our new acute and critical care centre, the Grange University Hospital near Cwmbran is due to open later this year. Aneurin Bevan University Health Board (ABUHB) has a large and complex ICT service that underpins the delivery of digital health care. ICT supports around 14,000 users and over 200 services across more than 120 sites. The adoption and expectations placed upon digital healthcare are expected to grow substantially over the next 5 years as the health board adopts mobility both in primary and secondary care settings.&lt;/p&gt;\n&lt;p&gt;You will be part of the Technical Services team and ICT management team, providing line management and leader ship to the Systems Services team. You will be expected to undertake personal development reviews and appraisals in line with health board policy, manage staff performance and wellbeing as well as provide staff with regular 121s for team leaders.&lt;/p&gt;\n&lt;p&gt;You will schedule the work for your teams and ensure that service standards and business objectives are met by developing business and service improvement plans for your teams. You will lead on Servers, Storage and High Availability as well as business systems applications such as Exchange, SQL and SharePoint as well as contributing to the Technical Services Strategy. You will need to work closely with departments and emergency planning to coordinate business continuity test.&lt;/p&gt;\n&lt;p&gt;You will need be an excellent communicator and influencer, allowing you to build and maintain strong relationships within ICT and Informatics and deputise for the Technical Services manager where required at both local and national meetings. Evaluation of technology, benefits and the development of business cases to ensure strategic alignment and value for money on technology platforms will be mandatory.&lt;/p&gt;\n&lt;p&gt;You will need to manage, implement and maintain standardised ways of working by applying the principles of the IT Infrastructure Library (ITIL) framework to the team. You will be accountable for the overall performance monitoring, evaluation, and review of our Compute, Storage and High Availability infrastructure, business systems applications such as Exchange, SQL and SharePoint, and required to produce monthly reports of activity including threat analysis and a selection of Key Performance Indicators (KPIs) and Critical Success Factors (CSF).&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 18th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sharif Biharie&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mamhilad, Pontypool", "postalCode": "NP4 0YP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7181", "longitude": "-3.00195"}}, "title": "ICT Business Systems Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235954", "validThrough": "2020-11-18T23:59:59+0000"}