{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-10-26T15:16:35+0000", "description": "&lt;p&gt;&lt;strong&gt;We have Vacancies!!!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you open to new challenges? &lt;/strong&gt;&lt;strong&gt;Have you got a sensible approach to life? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to work in a supportive team looking after children and young people with complex needs?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are an established, caring NHS Continuing Care Service and are looking for the right people to join our fabulous team.&lt;/p&gt;\n&lt;p&gt;The service provides bespoke care for a wide range of conditions which range from ventilator dependent young people, terminally ill children and others with severe disabilities/additional complex health problems.&lt;/p&gt;\n&lt;p&gt;You will need to show patience, interpersonal skills, a sensible approach and have a genuine regard for children’s welfare and wellbeing. A full training package is provided and competency certification. We consider training to be ongoing and this is your opportunity to begin you career with the NHS.&lt;/p&gt;\n&lt;p&gt;Some of the children we support have a huge amount of care. The utter devotion of their parents is unquestionable but the demands of looking after these children around the clock mean that parents/carers need support too.&lt;/p&gt;\n&lt;p&gt;We work on a rotational shift basis which includes: earlies, lates, nights, weekends and bank holidays. You will be required to work with parents/carers to deliver the best possible care to the child/young person and the work will include undertaking shifts in the client’s own home as well as other community settings.&lt;/p&gt;\n&lt;p&gt;Flexibility in relation to shift cover is a requirement of the post, with the ability to undertake early shifts, late shifts and night duty.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Without CCT we as a family would not be able to lead a normal life. CCT is a saving grace to our family with all the help and support we get from a team of carers and our team leader. They are an absolute fantastic service and our carers are now like family. They don’t just support my son; they involve my other children and help support me in more ways than one. CCT have enabled us to lead a normal family life, without them we as family wouldn’t be able cope on our own but thanks to them we can” – Feedback from &lt;/em&gt;Chantelle (Parent of patient and service user ).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The necessary qualifications for this post are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NVQ Level 2 in Direct Patient Care or Nursery Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Desirable attributes for this post are&lt;/strong&gt;&lt;strong&gt;:-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experience of working with children&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experience of working in a care setting&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Car driver &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working towards additional qualifications &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NVQ Level 3 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If successful in this role, there is a requirement for you to have a Enhanced DBS. This will be paid for by the Trust and then deducted from your salary over a period of 3 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As this vacancy is within the division of Womens and Childrens, there is a mandatory requirement for successful applicants to join the DBS update service. The cost of joining the update service is £13 per year, and applicants are liable to cover this cost with no reimbursement from the Trust. Further details of how to join the update service will be provided upon appointment. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Fiona Price, Complex Care Manager, on 0151 514 2513 / 0151 514 2515&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clatterbridge Hospital, Wirral", "postalCode": "CH63 4JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3323", "longitude": "-3.02585"}}, "title": "Senior Clinical Support Worker - Children’s Continuing Care Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243108", "validThrough": "2020-11-09T23:59:59+0000"}