{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa inc"}}, "datePosted": "2020-11-02T16:16:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Senior Sonographer&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;We are seeking to recruit enthusiastic, motivated, full time band 7 sonographers to join our busy, friendly Ultrasound team at Imperial College Healthcare NHS Trust. We provide a comprehensive (mainly non-obstetric) ultrasound service to a wide range of specialities within the hospital and local GPs. &lt;br /&gt;&lt;br /&gt;At Hammersmith Hospital, we perform a wide range of ultrasound examinations including general abdominal, gynaecological, transplant kidneys, small parts, venous and carotid Doppler and contrast enhanced microbubble scans. &lt;br /&gt;&lt;br /&gt;At Charing Cross Hospital, we perform general abdominal, gynaecological, small parts including Head &amp; Neck, venous Doppler, MSK and contrast enhanced microbubble scans.&lt;br /&gt;&lt;br /&gt;At St Mary’s Hospital, we perform general abdominal, gynaecological, small parts, MSK and early pregnancy scans. We also have a busy recurrent miscarriage clinic where we provide ultrasound services to investigate for congenital uterine anomalies using 3D TV scan. &lt;br /&gt;&lt;br /&gt;Experience in MSK would be preferable but is not essential. We would support training in MSK scanning by encouraging attendance to courses and working with MSK consultants in order to gain knowledge and experience and to eventually deliver independent MSK sessions.&lt;br /&gt;&lt;br /&gt;Posts are available at Hammersmith Hospital, Charing Cross Hospital and St Mary’s Hospital. Sonographers are not required to rotate between sites and current working hours are Monday to Friday, 08:30 to 17:00 but this may change in the future to provide 7-day service.&lt;br /&gt;&lt;br /&gt;All three departments are excellent to work in, where further training and development is supported. Regular meetings are held to discuss interesting cases. You will be expected to work independently, however support from other sonographers and radiologists is always available and encouraged.&lt;br /&gt;&lt;br /&gt;Candidates must hold PG (cert), PG (Dip) or DMU or equivalent and be state registered with the HCPC if you have an underlying profession. &lt;br /&gt;&lt;br /&gt;Imperial College Healthcare NHS trust is known around the world for our expertise and outstanding clinical services.&lt;br /&gt;&lt;br /&gt;As the UK’s first Academic Health Science Centre, we combine the healthcare expertise of our people with the academic excellence of Imperial College London. It means we can bring the benefits of cutting-edge research to patients faster than ever before.&lt;br /&gt;&lt;br /&gt;It also means our people are at the forefront of ground-breaking developments in medicine and clinical care.&lt;br /&gt;&lt;br /&gt;Across five hospital, comprising of St Mary’s Hospital, Charing Cross Hospital, Hammersmith Hospital, Western Eye Hospital, Queen Charlotte’s Hospital and services in the community, some 10,000 people work together to provide the best clinical outcomes and standards of care to our patients. We value our people and are committed to developing their careers and offering an excellent range of benefits.&lt;br /&gt;&lt;br /&gt;Join us and you’ll be part of a community that recognises your contribution – and inspires you to achieve great things.&lt;/p&gt;\n&lt;p&gt;Please note, You will be required to attend a face to face interview as you will need to complete an assessment.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;The Trust reserves the right to close this vacancy prior to the closing date should we receive 50 applications prior to the advertised closing date.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;We are committed to equal opportunities and improving the working lives of our staff and will consider applications to work flexibly, part-time or job share. Please talk to us at interview about the flexibility you may need.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vishal Pratap Ultrasound Modality Lead, Charing Cross Hospital or Tareq Ismail, Ultrasound Modality Lead, St Mary’s Hospital (020 3312 3000).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 7 Senior Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252785", "validThrough": "2020-11-15T23:59:59+0000"}