{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39000", "minValue": "39000", "unitText": "YEAR", "value": "up to £39,000 per annum DOE"}}, "datePosted": "2020-10-29T09:21:59+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;I treat more than just symptoms&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Have you ever thought about working within a prison environment, helping to rehabilitate and support offenders to live decent and purposeful lives as a member of the community?&lt;br /&gt; &lt;br /&gt; Are you looking for a challenging and rewarding role with career developments?&lt;br /&gt; &lt;br /&gt; Then look no further… We’re looking for an innovative Paramedic who thrives on a challenge to provide high quality emergency care and minor injury treatment to patients with both primary care and acute care needs in a prison setting - performing procedures such as suturing, IV access, haemorrhage control, wound care and cardiac &amp; CVA intervention.&lt;br /&gt; &lt;br /&gt; You’ll be playing an active part in the assessment, planning, implementation and evaluation of the patients care, working as part of a team of primary care nurses within HMP YOI Doncaster delivering care to patients both within the healthcare centre and on the Wings/Houseblocks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What we need from you to do the job..&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; With the ability to think on your feet and a flexible attitude, you’ll be a qualified paramedic with current HCPC registration and ALS/ATLS/PALS qualification for Paramedics. Capable of demonstrating initiative, you’ll have proven experience of post-registration experience in any of these following clinical areas: Accident &amp; Emergency, Primary Care environments, Minor Injuries / Illness Units.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Salary and Benefits&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full-time role; working 37.5 hours per week on a rota basis. The salary for this role is up to £39,000 per annum.&lt;br /&gt; &lt;br /&gt; We also offer 25 days annual leave + 8 public holidays, Contributory pension scheme 2-5%. As well as CPD, Revalidation, free online and face to face training, regional/national opportunities, cycle to work scheme, childcare vouchers and online discounts.&lt;br /&gt; &lt;br /&gt; Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About Practice Plus Group&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Practice Plus Group is the Health in Justice Market leader, providing healthcare services to over 22,000 offenders in over 40 prisons across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN5 8UX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5259", "longitude": "-1.14584"}}, "title": "Paramedic - HMP YOI Doncaster", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247723", "validThrough": "2020-11-29T23:59:59+0000"}