{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-06T13:00:19+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Speech and Langauge Therapist - Band 6 - Speech and Language Therapy - 37.5 Hours per week - Permanent&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Speech and Language Therapy Department at West Suffolk Hospital has an exciting opportunity for a Senior Speech and Language Therapist (SLT) to join our team.&lt;/p&gt;\n&lt;p&gt;This newly funded role offers the successful candidate the opportunity to join our band 6 rotation programme. Rotations include acute stroke, early supported discharge, acute medicine, community and outpatients. The successful candidate will work closely with the multidisciplinary team and will be part of our expanding Speech and Language Therapy service across West Suffolk.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To fulfil the role of Senior SLT, you will have experience of working in the assessment, differential diagnosis and management of dysphagia and communication impairments within relevant clinical settings. The successful candidate will also be a team player and confident working as part of a multidisciplinary team. Skills in videofluoroscopy and/or FEES would be an advantage, but are not essential. We would also be willing to consider applicants for band 5/6 development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The West Suffolk Speech and Language Therapy team are an expanding and self-motivated team who are committed to professional development and evidence-based practice. This is demonstrated through regular departmental and joint training sessions, the employment of new initiatives and the constant review and improvement of the service.&lt;/p&gt;\n&lt;p&gt;Applicants must have current HPC and RCSLT registration and be able to show evidence of CPD.&lt;/p&gt;\n&lt;p&gt;Bury St Edmunds is a historic market town with modern leisure facilities and a good mix of housing available. The town has excellent transport links with easy road and rail access.&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Liza Asti, Professional Lead West Suffolk Speech and Language Therapy Team t: 01284 713303.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does&lt;/strong&gt; entitle you to apply to park on the Hospital site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at Enhanced level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Speech &amp; Language Therapist - Band 6 - Speech and Language Therapy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259779", "validThrough": "2020-11-20T23:59:59+0000"}