{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-24T14:48:36+0100", "description": "&lt;p&gt;Are you a committed individual with a passion for empowering and enabling health professionals through intelligent information?&lt;/p&gt;\n&lt;p&gt;The Health Informatics Department at the University Hospitals Birmingham (UHB) are seeking a passionate, enthusiastic and innovative Information Analyst to join their team.&lt;/p&gt;\n&lt;p&gt;Following the development of an innovative Informatics tool, the successful candidate will be invited to join the department working in the Healthcare Evaluation Data (HED) team. HED is a fast growing and diverse team that includes web-developers, analysts, statisticians and business managers, focused on providing data-driven analytics to UHB and the wider NHS.&lt;/p&gt;\n&lt;p&gt;The post holder will play a key role in providing comprehensive, efficient information and analytics services, focussed on clinical quality, operational efficiency, patient safety and financial opportunity.&lt;/p&gt;\n&lt;p&gt;The daily role will involve using SQL server and other packages to analyse, visualise and manipulate data, supporting HED development and user queries.&lt;/p&gt;\n&lt;p&gt;Reporting to the Senior Intelligence Analyst, the successful applicant will be an enthusiastic individual with drive and commitment, who is motivated by achieving, empowering and informing.&lt;/p&gt;\n&lt;p&gt;Candidates invited to interview will be sent details of a short exercise to prepare in advance. Interviews may be held as a two-stage process, with successful applicants invited back for a second round.&lt;/p&gt;\n&lt;p&gt;This role is based at Yardley Court, Edgbaston but will initially be based remotely due to the current coronavirus restrictions. The post is currently offered on a 23 month fixed term basis in line with approved funding.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Information Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241559", "validThrough": "2020-11-10T23:59:59+0000"}