{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36069", "unitText": "YEAR", "value": "£36,069 - £42,712 incl of HCAs pa"}}, "datePosted": "2020-10-19T15:01:18+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Tuberculosis (TB) Clinical Nurse Specialist (CNS) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you an experienced Registered Nurse with a genuine interest in TB nursing and who wants to be part of our dynamic TB service in Croydon? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for someone who wants to work as a CNS and wants to make a real difference to people affected by, or at risk of TB.&lt;/p&gt;\n&lt;p&gt;Our TB service covers the whole borough of Croydon caring for in-patients as well as outpatients and we also have the responsibility for delivering TB care in the local community.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to work within a dynamic and experienced team that is dedicated on delivering enhanced patient care. You will be working in the Nurse-led clinics, reviewing patients on the ward and visiting patients in the community as well.&lt;/p&gt;\n&lt;p&gt;As a TB CNS you will be working autonomously and within the team where good decision making skill and collaborative working will be key. You should also have skills and experience to manage a designated caseload of patients consisting of adults and paediatrics including patients with resistant TB, HIV and other co-morbidities. You will provide standard and complex case management to individuals being investigated and treated for TB, including contact investigation and screening, pre-biologic treatment TB screening, occupational health TB screening and organising, preparing and presenting Cohort Review.&lt;/p&gt;\n&lt;p&gt;You must demonstrate skills in effective communication, problem solving, vetting referrals, contribution in TB incident meeting and ability to prioritise workload. You will also be supporting clinical staff in inpatient/outpatient and community settings and contribute to multi-disciplinary team decisions about patient holistic care. You will also be required to support with staff and student nurse training and development, undertake audits and support the Team with projects to develop the service further to meet the needs of our patients and the local community.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held on 19th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Roshan Soobratty Lead TB Nurse PractitionerEmail addressmsoobratty@nhs.netTelephone number02084013923&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120967.PNG", "name": "Croydon Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120967"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon University Hospital Chest clinic, Croydon", "postalCode": "CR77YE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3891", "longitude": "-.108758"}}, "title": "TB Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232802", "validThrough": "2020-11-08T23:59:59+0000"}