{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53280", "minValue": "31997", "unitText": "YEAR", "value": "*£31997 - £53280; AfC"}}, "datePosted": "2020-11-02T07:05:39+0000", "description": "&lt;p&gt;Applications are invited for approximately 60 vacancies in the Public Health training programme at ST1 level across England, Northern Ireland, Scotland and Wales&lt;/p&gt;\n&lt;p&gt;Consultants in Public Health serve the population, whether they are working for a rural community, a large city or the entire national population. The principles remain the same: prevention of ill health, promotion of healthy life styles and provision of good health care services.&lt;/p&gt;\n&lt;p&gt;The programme combines academic training, service experience and skills based training, resulting in a CCT /CESR (CP) in Public Health and the ability to gain entry to the UK Public Health Register or the GMC Specialist Register.&lt;/p&gt;\n&lt;p&gt;This is a five year training programme in Public Health aimed at doctors and graduates/professionals from a background other than medicine who can demonstrate the essential competences to enter training.&lt;/p&gt;\n&lt;p&gt;The Public Health National Recruitment Office via Health Education England - East Midlands is coordinating the national recruitment process for entry at ST1 level for all participating deaneries/HEE local offices in England, Northern Ireland,Scotland and Wales. Further details on vacancy numbers and participating programmes can be found on the Faculty of Public Health webpages. See link provided.&lt;/p&gt;\n&lt;p&gt;The application window opens at 10.00 am on Thursday 5 November 2020 and closes at 4.00 pm on Tuesday 1 December 2020&lt;em&gt;. &lt;/em&gt;You will not be able to submit your application after this time. Please ensure that you have completed all the relevant sections of the application forms as missing information will deem your application incomplete and it will not be considered.&lt;/p&gt;\n&lt;p&gt;You must apply via our online recruitment system, Oriel. Oriel can be accessed from the link provided. Registration on Oriel is available to applicants prior to the application window opening.&lt;/p&gt;\n&lt;p&gt;The qualifications and professional registration requirements plus other eligibility criteria can be found in the relevant person specification. The relevant person specifications for this specialty are available from the Specialty Training website. It is essential that you refer to the guidance available and the relevant person specification before submitting your application form.&lt;/p&gt;\n&lt;p&gt;Details of vacancies for each deanery/HEE local office can be accessed via the recruitment information pages on the Faculty of Public Health website. See weblink.&lt;/p&gt;\n&lt;p&gt;Please visit individual deanery/HEE local office websites for information on their programmes, and also for their travel and relocation expenses policies.&lt;/p&gt;\n&lt;p&gt;Please see the HEE Applicant Handbook for further information.&lt;/p&gt;\n&lt;p&gt;Please note the medical trainee salary displayed above is a catch-all to cover all participating countries. For the relevant payscales for England, Northern Ireland, Scotland and Wales please refer to the links included alongside this advert.&lt;/p&gt;\n&lt;p&gt;Applicants who apply via the non-medical route would be remunerated under the terms of the Agenda for Change agreement&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Midlands Deanery", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "England, Northern Ireland, Scotland and Wales", "postalCode": "LE19 1RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6133", "longitude": "-1.19265"}}, "title": "Public Health Specialty Registrar", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251287", "validThrough": "2020-12-01T23:59:59+0000"}