{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35216", "minValue": "35216", "unitText": "YEAR", "value": "£20.95 per hour (£41,941)"}}, "datePosted": "2020-11-02T11:44:35+0000", "description": "&lt;p&gt;&lt;span&gt;Are you:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Committed to the highest standards of care and excellence?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Looking to enhance or develop your skills to lead an award-winning team?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Wanting to make a difference in a growing organisation and innovative culture?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Wanting to be continually supported in your chosen path of progression?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Do you enjoy a working environment where no two days are the same?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Do you want to make a difference the lives of residents with neurological conditions and their family and carers? &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;Do you have the skills and enthusiasm to manage a team of very experienced Nurses and can provide high level clinical expertise to the team?&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you want to make an impact in your Nursing career, then we are the organisation to do it with and we want to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Eagle Wood has four units within one large building, with 105 beds in total. The overall remit of Eagle Wood is to provide specialist neurological care to those residents who cannot be supported in more traditional nursing homes due to the level of challenging behaviour, complexity of their neurological conditions which require a multi-disciplinary team to assess and consult swiftly.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;PJ Care is one of the Sunday Times Top 100 Companies To Work For in 2019, and is a leading provider of specialist neurological care and neuro rehabilitation for people with progressive or acquired neurological conditions. We specialise in the multidisciplinary care of adults and work with residents, families, charities and the NHS to provide the highest quality care. Our residents are at the heart of everything we do and we strive to nurture dignity, independence and holistic wellbeing through the specialist care models, therapies and activities we provide.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "P J Care Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134817"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE3 8AQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5925", "longitude": "-.287674"}}, "title": "Charge Nurse (Lead)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251863", "validThrough": "2020-11-16T23:59:59+0000"}