{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Dependent on Experience"}}, "datePosted": "2020-11-03T10:17:14+0000", "description": "&lt;p&gt;As one of the largest acute Trusts in the UK – and with more than 20,000 employees – Manchester University NHS Foundation Trust (MFT) is on an exciting mission to deliver high-quality care to the people of Manchester, Trafford and beyond. Our vision is to create and deliver a seamless 24/7 service that extends beyond excellent care within our nine hospitals and community services within our Local Care Organisations.&lt;/p&gt;\n&lt;p&gt;Business Management support for the Estates and Facilities Department and alignment with MFT corporate objectives. Support on the separation, transition and integration of EFM corporate governance.&lt;/p&gt;\n&lt;p&gt;The post of Estates and Facilities Business Manager is a key position within the department’s senior management structure of the Estates and Facilities Department. Reporting to the Director of Estates and Facilities, the Business Manager is responsible for providing operational and strategic management support to the department and to lead on the development of the estates and facilities strategic and operational corporate business governance, compliance and assurance.&lt;/p&gt;\n&lt;p&gt;The business manager has a wide range of responsibilities including acting as interface between the trust’s corporate and operational services and partnering hosts trusts to ensure components of non-clinical service level agreements (SLA’s) are reviewed, updated and monitored in line with service delivery and business need, seeking assurance of statutory and mandatory compliance, staff management, financial control, management of resources and service improvement whilst working towards the strategic vision and enhancing the experience of patients, staff, carers and visitors..&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Estates and Facilities Business Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253420", "validThrough": "2020-11-18T23:59:59+0000"}