{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "168100", "minValue": "168100", "unitText": "YEAR", "value": "Upto £100 per hour (approx)"}}, "datePosted": "2020-10-27T09:14:42+0000", "description": "&lt;h2&gt;Are you an experienced GP who is confident in working independently?&lt;/h2&gt;\n&lt;p&gt;Are you looking for the flexibility of working from home, whilst still being able to visit patients?&lt;/p&gt;\n&lt;p&gt;If this sounds like you, then we may have an exciting new role for you!&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are currently planning to deliver a new model of care for a virtual private practice: Practice Plus Private. This model aims to provide an enhanced virtual, private health care service to patients through the use of technology, enabling remote care and local clinical services whilst also offering home visits.&lt;/p&gt;\n&lt;p&gt;The model will also offer cosmetic services and procedures alongside other general medical services. This new way of delivering private practice services in the UK will utilise Practice Plus Group healthcare’s extensive clinical contact centre capability as well as optimising patient experience and service quality through use of a comprehensive online capability&lt;br /&gt;The model will also offer cosmetic services and procedures alongside other general medical services. This new way of delivering private practice services in the UK will utilise Practice Plus Group healthcare’s extensive clinical contact centre capability as well as optimising patient experience and service quality through use of a comprehensive online capability.&lt;/p&gt;\n&lt;p&gt;We have a number of great opportunities for General Practitioners to join our new Private Practice, so would love to hear from you!&lt;/p&gt;\n&lt;h2&gt;About The Role&lt;/h2&gt;\n&lt;p&gt;This role offers flexible shift patterns, including days, evenings and weekends, and can be offered on a salaried or self-employed basis. Typical shifts are 3-5 hours across the week.&lt;/p&gt;\n&lt;p&gt;Home visits to patients in the Lambeth, Kensington, Chelsea, Hammersmith and Fulham area.&lt;/p&gt;\n&lt;p&gt;You will be given all the kit required for the home visits and will need to pick this up from the base and return the kit at the end of your shift.&lt;/p&gt;\n&lt;p&gt;PPE will be provided and all calls would be triaged for Covid19 symptoms, however when you turn up to the patients home you would re-triage to ensure still Covid19 safe.&lt;/p&gt;\n&lt;p&gt;There is mandatory training and you will be given training on the Heydoc clinical systems which is remunerated.&lt;/p&gt;\n&lt;h2&gt;Who We&#39;re Looking For&lt;/h2&gt;\n&lt;p&gt;As well as the relevant registrations and qualifications below, we are looking for GPs who are experienced in a Primary Care setting.&lt;/p&gt;\n&lt;p&gt;You will be able to complete telephone consultations and home visits and you will have evidence of delivering a high level of care to your patients, whilst supporting the business on its objectives of the Practice.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role requiring home visits, you must also be happy to travel to the Lambeth, Kensington, Chelsea, Hammersmith and Fulham areas. Therefore you must also have a full UK driving licence and your own car.&lt;/p&gt;\n&lt;p&gt;You will work alongside the Private Practice Management team, in actively participating in the delivery of clinical governance and all clinical aspects of the service. You will be an individual that strives to better its colleagues and will be more than happy to share your knowledge and skillset with other healthcare professionals within the practice&lt;/p&gt;\n&lt;p&gt;Essential qualifications:&lt;br /&gt;• Current GMC certificate&lt;br /&gt;• Full membership of a medical indemnity organisation (covering private work)&lt;br /&gt;• Current HEP B immunity certificate&lt;br /&gt;• Inclusion on an NHSE Medical Performers list&lt;br /&gt;• MRCGP&lt;br /&gt;• Full UK driving licence and your own car&lt;/p&gt;\n&lt;h2&gt;Additional Information&lt;/h2&gt;\n&lt;p&gt;We can offer sessional rates of:&lt;br /&gt;- Approximately £100 per hour for Mon-Fri working&lt;br /&gt;- Approximately £90 per hour for weekend working&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to receipt of satisfactory references and a DBS check.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group is committed to creating a diverse environment and we are proud to be an equal opportunity employer.&lt;/p&gt;\n&lt;p&gt;If you are an external candidate, please contact Karla Smithfor more information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South West London", "postalCode": "SW11 2NU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4651", "longitude": "-.1715"}}, "title": "General Practitioner - Practice Plus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243787", "validThrough": "2020-11-08T23:59:59+0000"}