{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competetive hourly rate"}}, "datePosted": "2020-11-06T14:03:58+0000", "description": "&lt;p&gt;Are you a nurse looking for a rewarding Bank role? You’ll find a friendly welcome and a home for your talents at Practice Plus Group. Whether you’re coming from an NHS or private hospital, we’ll give you time to use your nursing skillswith ad-hoc shifts to fit around your other commitments.&lt;/p&gt;\n&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;You will be part of a close knit collaborative team who pride themselves in providing the highest standard of care to our patients and their families. Our outpatients team is comprised of experienced nurses and healthcare assistants supported by our welcoming Outpatients Manager, Debbie. As well as undertaking basic duties you will function as a clinical practitioner being responsible for the delivery of patient care, managing and organising a work load on a daily basis. All of our work is planned so you will be able to plan your week with ease knowing your work schedule won’t change.&lt;br /&gt;You will liaise with the wider Practice Plus Group medical team to ensure the patient’s treatment is carried out whilst maintaining the principles of patient confidentiality.&lt;br /&gt;Your sound clinical and preoperative knowledge combined with your ability to solve problems and think both literally and laterally will enable you to coach and support others in your team. We encourage sharing of best practice across our site to develop your skills and take advantage of our excellent clinical leadership knowledge.&lt;/p&gt;\n&lt;h2&gt;Working at Practice Plus Group&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Everything we do is focused on providing a high standard of safe and effective patient care. As a CQC Outstanding rated hospital we believe in developing and nurturing our people.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We want our team members to feel motivated and rewarded. So we offer a competitivehourly rate andwe recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;br /&gt;&lt;br /&gt;We will contact all shortlisted candidate but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO14 0YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9124", "longitude": "-1.39707"}}, "title": "Bank Outpatients Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260049", "validThrough": "2020-11-20T23:59:59+0000"}