{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "78569", "minValue": "49102", "unitText": "YEAR", "value": "£29.21 (ph) £46.74"}}, "datePosted": "2020-10-13T15:52:17+0100", "description": "&lt;p&gt;We are seeking an experienced and motivated &lt;strong&gt;Senior Communications and Engagement Manager&lt;/strong&gt;to join the Portsmouth Staff Bank at Queen Alexandra Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties for include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strategic communication and engagement advice to programme and project teams.&lt;/li&gt;\n&lt;li&gt;Development of communication and engagement strategy and plan.&lt;/li&gt;\n&lt;li&gt;Delivery of internal and external communication plan with approaches designed for specific audiences using appropriate on and offline channels.&lt;/li&gt;\n&lt;li&gt;Design and support for effective engagement of stakeholders, patients and the public to enable the delivery of benefits to patients, working with and through the Trust’s established routes, as well as bringing additional experience and innovation.&lt;/li&gt;\n&lt;li&gt;Building and maintaining excellent relationships with a wide range of internal and external stakeholders including media, local and regional partners and communities.&lt;/li&gt;\n&lt;li&gt;Working with colleagues across the Trust maintain proactive relationships with key influencers associated with the programme of work such as local health overview and scrutiny committees and patient representative groups&lt;/li&gt;\n&lt;li&gt;Gathering, analysis and presentation of information to support programme and project objectives.&lt;/li&gt;\n&lt;li&gt;Creation and production of communication and engagement materials, working with external agencies as needed.&lt;/li&gt;\n&lt;li&gt;Coordination and participation in relevant internal and external working groups, providing project advice, information and analytical advice and support for delivery of project milestones.&lt;/li&gt;\n&lt;li&gt;Collaboration across the Trust and with partners across local government; NHS commissioners and providers; and contractors to ensure a joined-up approach&lt;/li&gt;\n&lt;li&gt;Collaboration with communication colleagues in the Trust to ensure that programme communications are an integral part of Trust and relevant partner communications.&lt;/li&gt;\n&lt;li&gt;Support for the development of individuals and the communications team through coaching and mentoring.&lt;/li&gt;\n&lt;li&gt;Partnering with others and as part of cross directorate teams to deliver successful outcomes to include leadership of communications workstream and indirect management of project teams.&lt;/li&gt;\n&lt;li&gt;Identification, reporting and management of risk.&lt;/li&gt;\n&lt;li&gt;Development and implementation of qualitative and quantitative measures to determine performance against the communications and engagement plans. Reporting progress against the plans through personal representation at senior management forums and by written reports to appropriate boards and groups of staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Required Skills &amp; Experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Educated to degree level or equivalent experience&lt;/li&gt;\n&lt;li&gt;Evidence of continued professional development and national best practice within the communications sector&lt;/li&gt;\n&lt;li&gt;Relevant post graduate qualification, CIPR diploma or equivalent&lt;/li&gt;\n&lt;li&gt;Project management qualification or equivalent experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Extensive experience as a communications professional at a senior level in a large complex organisation&lt;/li&gt;\n&lt;li&gt;Demonstratable experience of delivering projects in complex and challenging environments&lt;/li&gt;\n&lt;li&gt;Experience of developing high-quality communications collateral&lt;/li&gt;\n&lt;li&gt;Experience of events/workshop facilitation and management&lt;/li&gt;\n&lt;li&gt;Experience of planning and delivering integrated communication programmes across a range of platforms&lt;/li&gt;\n&lt;li&gt;Consistently achieving high standards and delivering objectives&lt;/li&gt;\n&lt;li&gt;Evidence of continued professional development relating to communications and engagement&lt;/li&gt;\n&lt;li&gt;Experience of leading NHS consultations on service changes and reconfigurations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our Bank workers are invaluable to us and in return of your hard work and commitment we can offer the following benefits:&lt;/p&gt;\n&lt;p&gt;Competitive pay rates – enhanced payrates paid during the weekend and Bank Holidays&lt;/p&gt;\n&lt;p&gt;Flexible working pattern&lt;/p&gt;\n&lt;p&gt;Opportunities to work across sites, gaining invaluable knowledge and experience&lt;/p&gt;\n&lt;p&gt;Priority placements over an Agency Workers&lt;/p&gt;\n&lt;p&gt;A dedicated onsite bookings team&lt;/p&gt;\n&lt;p&gt;Electronic timesheet submission and weekly pay&lt;/p&gt;\n&lt;p&gt;An onsite office and designated Business Partners to offer daily support&lt;/p&gt;\n&lt;p&gt;A professional compliance team that will ensure you remain compliant to work&lt;/p&gt;\n&lt;p&gt;We also offer Core Skills Training&lt;/p&gt;\n&lt;p&gt;Please apply directly to this advertisement, ensuring you upload a full and up to date CV. Successful applicants will be contacted shortly. If you require further information then please contact the Portsmouth Staff Bank Recruitment Team on 0333 577 3316&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135154.jpg", "name": "Portsmouth Hospitals NHS Trust Staff Bank", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Senior Communications and Engagement Manager (Programmes) Band 8b", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224954", "validThrough": "2020-11-15T23:59:59+0000"}