{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Pro Rata Per Annum"}}, "datePosted": "2020-11-06T14:01:08+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced nurse to join the existing renal out- patient team within the department of renal medicine in the Trust. We are searching for a dynamic, highly motivated and passionate individual committed to high quality patient care within the renal setting. Proven experience in renal replacement therapy is essential.&lt;/p&gt;\n&lt;p&gt;The post holder must have a flexible approach, and it is essential to be committed to delivering high standards of patient focused care. The post will provide an excellent opportunity for a nurse to display excellent clinical and leadership skills across the Renal MDT. In addition the post holder will be responsible for supporting the Band 7 Sister with the management of Renal Home therapies and Renal Access co-ordination. Also leading a skilled workforce to implement changes that will see an improvement to patient pathways as well as being a role model for the nursing workforce. You will be required to demonstrate professional attributes, including, diversity, dealing with change, and be able to work autonomously and effectively within the multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;The post holder will be primarily based on the renal Out-patient department at Doncaster Royal Infirmary, however, will be required to work within the remit of the renal home therapies that requires travelling hence a clean driving licence is essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Debra Starbuck - Ward Manager, debra.starbuck@nhs.net, 01302 642725&lt;/p&gt;\n&lt;p&gt;Alice Waweru - Matron , 01302 642621&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster Royal Infirmary", "postalCode": "DN2 5LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5308", "longitude": "-1.10926"}}, "title": "Sister / Charge Nurse - Renal Outpatients", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260024", "validThrough": "2020-11-22T23:59:59+0000"}