{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-05T09:00:49+0000", "description": "&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) provides integrated specialist community physical and mental health, learning disability and social care services of the highest standard, due to our continued commitment to quality and service improvement. We aim to support people of all ages to achieve the very best they can for their health and well-being. To ensure that we achieve this goal we look to recruit candidates of a high calibre who share our passion for delivering excellent service user care, research and education.&lt;/p&gt;\n&lt;p&gt;We are currently looking to recruit a full time (37.5 hours per week) enthusiastic, motivated and skilled Advanced Podiatrist to join our Team based at the City Care Centre, Peterborough but also providing cover to other sites in East Cambs &amp; Fens and Huntingdon. The role will work within the Advanced Podiatry Service, providing care to people with Active diabetic foot problems in the community setting. This service is part of the community Podiatry team but works closely with the secondary care MDT of consultants and will involve working across community and acute settings in both clinic and wards, to provide gold standard diabetic foot management according to national guidelines.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a strong team work ethic, sense of accountability, accompanied by an ability to work under considerable pressure at times. The post is open to professionals with the right attributes to enhance a team and who strive to continually improve patient care.&lt;/p&gt;\n&lt;p&gt;The candidate will have in depth specialist knowledge, skills and experience of working with people with active foot disease including vascular assessment, wound management and offloading/casting and be capable of making timely and safe decisions about onward referral / admission. Prescribing knowledge / experience will be an advantage.&lt;/p&gt;\n&lt;p&gt;The postholder is expected to supervise, support and develop junior staff members in this clinical specialism. There is an education aspect of the role providing training to primary and secondary HCPs both within and external to the trust.&lt;/p&gt;\n&lt;p&gt;There is ample opportunity and support to ensure your development within your role through a clear career pathway and we encourage promotional opportunities within the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This post is eligible for a £3000 new hire bonus. An initial payment of £1000 will be paid in the first 6 months and a final payment of £2000 will be paid 1 year after your start date (pro rata for part time).&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Benefits of working for CPFT include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual leave allowance 27 days plus bank holidays (this may increase depending on NHS service)&lt;/li&gt;\n&lt;li&gt;Pension scheme&lt;/li&gt;\n&lt;li&gt;Flexible job share opportunities&lt;/li&gt;\n&lt;li&gt;Salary sacrifice schemes&lt;/li&gt;\n&lt;li&gt;Staff discount schemes&lt;/li&gt;\n&lt;li&gt;Professional development via the CPFT Academy which provides in-house training programmes&lt;/li&gt;\n&lt;li&gt;Stress awareness training&lt;/li&gt;\n&lt;li&gt;Mindfulness training&lt;/li&gt;\n&lt;li&gt;Counselling service&lt;/li&gt;\n&lt;li&gt;Access to coaching&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;£3000 New Hire Bonus&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sara Hill&lt;/strong&gt; - Service Lead&lt;/p&gt;\n&lt;p&gt;sarahill@nhs.net - 07908 713848&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Care Centre, Peterborough", "postalCode": "PE3 6DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5744", "longitude": "-.258806"}}, "title": "Advanced Podiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256966", "validThrough": "2020-11-19T23:59:59+0000"}