{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-04T11:41:05+0000", "description": "&lt;p&gt;East Cheshire NHS Trust is looking to appoint enthusiastic, self-motivated and compassionate people to join our team of Health Care Assistants. We currently have vacancies in the following areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ward 4 - Medicine/Respiratory&lt;/li&gt;\n&lt;li&gt;Ward 2 - General Medical Ward&lt;/li&gt;\n&lt;li&gt;Ward 8 - Medical Assessment Unit&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;**For further information about the respective wards, please refer to the attached information document**.&lt;/p&gt;\n&lt;p&gt;Shift pattern: shifts will be either early (7:00-15:00), late (13:00-20:00), long day (7:00-20:00) or night shifts (19:30-7:30)&lt;/p&gt;\n&lt;p&gt;We are looking for Health Care Assistants who are capable of working in a busy, challenging and rewarding environment who possess excellent communication skills, can maintain a high degree of confidentiality and are able to work to deadlines, provide excellent personal care to our patients and work as part of team.&lt;/p&gt;\n&lt;p&gt;Duties will include providing a high standard of care by attending to aspects of patient personal hygiene, maintaining patient tissue integrity and providing pressure area care, recording of observations, liaising with the patient&#39;s families and the general public and supporting your colleagues in providing a positive experience for the patient. &lt;/p&gt;\n&lt;p&gt;We can offer a range of working opportunities including full and part time hours covering a variety of shift patterns over a 7 day rota including early, lates and night duty.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Value Based Recruitment Exercise: &lt;/strong&gt;East Cheshire NHS Trust is looking for staff who share the NHS Values of belief in the quality of patient care. To find out if your values are aligned to the values of the NHS we request that you undertake a short on-line value based exercise. For guidance on how to access this excercise, please refer to the additional information document (this document will also provide information about East Cheshire NHS Values, for your information).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Prior experience:&lt;/strong&gt; We are looking for Health Care Assistants who can&lt;em&gt;&#39;hit the ground running,&#39;&lt;/em&gt;therefore successful applicants must have prior experience of working in a care environment however we will provide a package of training on commencement. You will be working with staff at all levels and we are looking for you to demonstrate a dedicated approach in providing a high quality service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Health Care Assistant Induction &amp; Training: &lt;/strong&gt;When you join East Cheshire NHS Trust as a Health Care Assistant (HCA) you will take part in an Induction programme that will support you in developing the skills and knowledge required to deliver safe and compassionate care to our patients. Our Corporate induction and core clinical statutory and mandatory day will introduce you to our organisation and our values and behaviours.&lt;/p&gt;\n&lt;p&gt;East Cheshire NHS Trust strongly believes in investing in the training and education of its workforce to support the delivery of the high standard of care expected by our patients. In order to achieve this all HCA’s are required to attend a clinical statutory and mandatory training day, complete allocated e-learning modules as well as attend our three day Be AWARE to Care Course, which incorporates the nationally accredited AWARE course.&lt;/p&gt;\n&lt;p&gt;Consolidation of the skills and knowledge acquired from attending this training programme, together with the support of Trust colleagues from various departments will help you to complete the nationally recognised Care Certificate over a six month period.&lt;/p&gt;\n&lt;p&gt;Please access the Skills for Care website for more details on this training by going to the Standards section, and then click into the Care Certificate link.&lt;/p&gt;\n&lt;p&gt;This post is Permanent&lt;/p&gt;\n&lt;p&gt;Hours per week: various hours available including full and part time&lt;/p&gt;\n&lt;p&gt;Closing date: 18th November 2020&lt;/p&gt;\n&lt;p&gt;Please note the scenario questions included within the application form will be used as part of the assessment criteria to assess your suitability for shortlisting for an interview.&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. If you would like to be considered for a position please apply for this job as soon as you can.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Facebook and Twitter pages.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;The Recruitment Team&lt;/p&gt;\n&lt;p&gt;Telephone number: 01625 656510&lt;/p&gt;\n&lt;p&gt;Email: ecn-tr.recruitment@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Victoria Road, Macclesfield, Cheshire, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Health Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255647", "validThrough": "2020-11-18T23:59:59+0000"}