{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-27T10:02:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Previous applicants need not apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An &lt;strong&gt;exciting opportunity&lt;/strong&gt; has risen for a friendly, motivated and enthusiastic Children’s Nurse to join our Paediatric Nursing Team within a fast-paced DGH. With a new Matron in post, and departmental developments happening now, we have a number of new opportunities in a variety of area’s and would certainly consider a rotational post that can be tailored to your own unique requirements.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;If you are dynamic, passionate and proactive, looking for a new challenge and want to be part of a developing team then we would be pleased to hear from you.&lt;/li&gt;\n&lt;li&gt;You will need to be a Registered Nurse (Child)/RSCN.&lt;/li&gt;\n&lt;li&gt;Part time hours will be considered.&lt;/li&gt;\n&lt;li&gt;We have an excellent competency and development programme and you will be supported and guided by our Paediatric Sisters and Practice Development Nurse. You will have the opportunity to learn and expand on existing skills including, the care of the critically ill child or young person.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What will I be doing in my new role?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently recruiting registered nurses to join our committed and evolving team within Paediatrics. If you are motivated, enjoy working in a fast pace environment and are keen to learn new skills we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;You will be expected to work within the 3 main areas of Paediatrics:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Children&#39;s Assessment Unit&lt;/li&gt;\n&lt;li&gt;Children&#39;s Day Surgery&lt;/li&gt;\n&lt;li&gt;Riverbank Inpatient Ward&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;CAU / Ambulatory Care&lt;/strong&gt; - The Children’s Assessment Unit &amp; Ambulatory Care provides acute medical and nursing care to Paediatirc patients within an 8 bedded unit on Riverbank Ward. We take referrals from GPs, health visitors, midwives, A&amp;E and patients with long term conditions and open access to the unit. This role will involve carrying out a range day-to-day nursing skills and running the children’s assessment unit and ambulatory care services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Riverbank Ward / Children&#39;s Day Surgery&lt;/strong&gt; - Patients are either discharged home from the paediatric assessment unit or admitted as an inpatient to Riverbank Ward. Riverbank Inpatient Unit is a 16 bedded unit providing acute paediatric and high dependency care across all specialities.&lt;/p&gt;\n&lt;p&gt;If you would like any further information or to arrange an informal visit please contact:&lt;/p&gt;\n&lt;p&gt;Kyrsti Watson (Children&#39;s Assessment Unit Manager) or Julie Sharpe (Riverbank Ward Inpatient Manager) 01234 355122 Ex: 6480&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedford Hospital, Bedford", "postalCode": "MK42 9DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1289", "longitude": "-.471708"}}, "title": "Paediatric Staff Nurse - Inpatient Unit &amp; Children’s Assessment Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243934", "validThrough": "2020-11-10T23:59:59+0000"}