{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 per annum"}}, "datePosted": "2020-10-27T10:30:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Resilience Support Officer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Edward Jenner Court, Brockworth&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £21,892 - £24,157 per annum (Band 4)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a dynamic support officer, with excellent communication and IT skills, to join our Organisational Resilience Team at Edward Jenner Court, in Gloucester.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is essential that the successful candidate has current experience with administration of policies. Is able to keep safe stewardship of the Teams administrative functions for the national and contractual requirements for the Trust, in relation to Emergency Preparedness, Resilience and Response and Business Continuity Management. The successful candidate will also cover the administration function of the Trust Senior Management On-Call.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are a team player, with excellent communication and organisational skills, able to manage your own workload on a day to day basis, we would very much welcome your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer an excellent team environment with regular supervision, appraisals and a commitment to support staff in their continuous development.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion and any enquires please contact David Nankivell, Head of Organisational Resilience, on 0300 421 8518 or email david.nankivell@ghc.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL3 4AW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8471", "longitude": "-2.17646"}}, "title": "Resilience Support Officer - Band 4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243996", "validThrough": "2020-11-11T23:59:59+0000"}