{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26970", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 / £26,970 / £27,416 / £30,615"}}, "datePosted": "2020-10-26T09:34:46+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a Registered General Nurse - Adults who strives to make a positive difference to the lives of your patients? Do you want flexibility with your work hours? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In 2020, we understand the need for flexibility when it comes to the hours that you work. So if you feel stuck with the hours you’re currently on, you’ll want to read on. In addition you can earn bonus payments see additional documentation attached.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our teams located at Merlyn Vaz Health and Social Care Centre and Braunstone Health and Social Care Centre can offer the hours-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here are some examples of the hours that we could consider:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The late – 6pm till 10pm (weekends included)&lt;/li&gt;\n&lt;li&gt;Part-time – 22.5 hour per week contracts, working 3 days a week (weekends included)&lt;/li&gt;\n&lt;li&gt;The school shift – 9:30am till 3pm (must do weekend rotas)&lt;/li&gt;\n&lt;li&gt;Mornings – 8am till 1pm (including weekends)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is part of our new and developing hub based Community Nursing Teams where we offer core Community Nursing, rapid response and Home First nursing interventions to patients living in their own homes, residential homes and in local accessible clinics.&lt;/p&gt;\n&lt;p&gt;We work in an integrated way with health and care providers across the whole system in Leicester, Leicestershire and Rutland to ensure that care is joined up and that whenever we can, we strive to care for patients at home, helping them to maintain independence and ensuring that high quality care is delivered in an efficient and holistic manner.&lt;/p&gt;\n&lt;p&gt;With the role being based in the community, &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;you will need to be a car driver&lt;/span&gt;&lt;/strong&gt;. LPT offer a car leasing or car salary sacrifice scheme subject to meeting the acceptance criteria.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What We Can Offer You&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Regular, meaningful clinical supervision tailored to your specific needs.&lt;/li&gt;\n&lt;li&gt;A well-supported and individually tailored induction.&lt;/li&gt;\n&lt;li&gt;A professional development plan which supports your continuous learning and development.&lt;/li&gt;\n&lt;li&gt;Training and quality improvement opportunities.&lt;/li&gt;\n&lt;li&gt;A healthy work life balance with weekend working on a rota of one in three, long and short days available and no night shifts.&lt;/li&gt;\n&lt;li&gt;The opportunity to work within an innovative and progressive service which is testing and developing new ways of working, which is involved in the national Ageing Well programme as an early implementer site and which has been shortlisted for national awards in 2019/2020.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;A &lt;strong&gt;bonus payment&lt;/strong&gt; of £2,000 will go to registered Community Nurses who join the above teams and stay for 3 years. (Terms and Conditions apply, so please have a read of the attached document titled “Bonus Payments.”)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Next Steps&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you like what you have read, please apply today. If you’d like to have an informal conversation, please contact Jackie Mitchell (07917013535).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester - based at Merlyn Vaz Health &amp; Social Care Centre OR Braunstone Health &amp; Social Care Centre", "postalCode": "LE5 3GH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6412", "longitude": "-1.10879"}}, "title": "Band 5 Community Staff Nurse (RECRUITMENT PREMIA  APPLIES)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241871", "validThrough": "2020-11-17T23:59:59+0000"}