{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-26T09:45:57+0000", "description": "&lt;p&gt;Specialised services support people with a range of rare and complex conditions. They often involve treatments provided to patients with rare cancers, genetic disorders or complex medical or surgical conditions. They deliver cutting-edge care and are a catalyst for innovation, supporting pioneering clinical practice in the NHS. The services in the specialised portfolio (currently around 149 in number) range from the higher volume services such as renal dialysis or chemotherapy, secure inpatient mental health services, through to treatments for rare cancers and genetic disorders or complex medical or surgical interventions.&lt;/p&gt;\n&lt;p&gt;The PMO and the Business Office is a central, over-arching team within Specialised Commissioning which sets consistent standards and provides best-practice guidance to all teams within the Specialised Commissioning. In exceptional cases, the team also provides direct support to teams with specific pieces of work.&lt;/p&gt;\n&lt;p&gt;The team is responsible for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing a single-point-of-contact interface with functions in the wider organisation (for example, central Finance, HR, procurement, risk, governance and assurance)&lt;/li&gt;\n&lt;li&gt;Developing and holding information resources on directorate-wide activity (for example, portfolio of projects and programmes, organisational structures)&lt;/li&gt;\n&lt;li&gt;Developing and maintaining consistent standards, templates and tools for use across the directorate&lt;/li&gt;\n&lt;li&gt;Sharing and training staff on NHS England standards, templates and tools&lt;/li&gt;\n&lt;li&gt;Supporting local teams with advice and guidance and proactively engage to encourage best practice and use of the consistent standards, tools and templates&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a PMO Planning and Reporting Manager, the post holder will work as part of a dynamic team in delivering an effective service supporting managers and staff across the Specialised Commissioning, Health and Justice and Armed Forces team to carry out the following duties:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensure NHS England’s internal business planning process for specialised commissioning’s programme-related workstreams are aligned to support the delivery of the Specialised Commissioning Strategic Framework&lt;/li&gt;\n&lt;li&gt;Provide advice and guidance on programme planning in order to support successful delivery, including business cases, resourcing, and risk management.&lt;/li&gt;\n&lt;li&gt;Develop reports and reporting processes for senior management team on the directorate’s delivery against the strategic framework.&lt;/li&gt;\n&lt;li&gt;Demonstrate, train and coach teams in best practice programme/project management methodologies.&lt;/li&gt;\n&lt;li&gt;Support the senior management team with portfolio database maintenance, portfolio reporting and portfolio secretariat service.&lt;/li&gt;\n&lt;li&gt;Develop and manage a content management service to ensure information is properly management and best practice is shared across the directorate.&lt;/li&gt;\n&lt;li&gt;Ensure robust quarterly programme financial forecasting is undertaken and reported to central finance&lt;/li&gt;\n&lt;li&gt;Ensure that corporate, department and wider government standards on programme and project assurance are reflected in specialised commissioning’s local processes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The role supports the business in driving transformation as well as value for money in planning, commissioning and service. The role is designed to build a combination of subject matter expertise and technical skills to develop a strong service delivery.&lt;/p&gt;\n&lt;p&gt;This is a national team role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Graham McLaurin&lt;/p&gt;\n&lt;p&gt;Job title: PMO Portfolio Manager&lt;/p&gt;\n&lt;p&gt;Email address: graham.mclaurin1@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07900 715169&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House, London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "PMO Planning &amp; Reporting Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241883", "validThrough": "2020-11-09T23:59:59+0000"}