{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "Band 8a - (£45,753 - £51,668 per annum)"}}, "datePosted": "2020-10-23T15:16:14+0100", "description": "&lt;p&gt;An opportunity has arisen for a full time Band 8a to offer a specialist psychology service to adult clients resident in homeless accommodation or rough sleeping. The role will require the provision of specialist assessment, treatment, planning, implementation and monitoring of outcomes as well as clinical consultation and training to RSI project staff. The post holder will be required to draw on evidence based interventions for working with the mental health needs of people who are homeless including evidence based interventions for complex trauma, personality disorder, anxiety, depression, addictions, learning difficulties and psychosis.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The RSI pilot will be piloting the impact of providing a service model based on the principles of both Trauma Informed Care and Psychologically Informed Environments. Knowledge and experience of these ways of working would therefore be an advantage.&lt;/p&gt;\n&lt;p&gt;The role will also enable the post holder to contribute to audit and evaluation of this pilot service in order to support future service commissioning and the development of new models of best practice.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Rough Sleeper&#39;s Initiative&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;With homeless figures continuing to rise and the NHS Long Term Plan (2019) recognising the need for better physical and mental health interventions to address homelessness; Public Health has awarded funds to pilot new community-based models of access to clinical support for those rough sleeping or at risk of returning to rough sleeping. The pilot will be attached to an existing service – The Rough Sleeping Initiative.&lt;/p&gt;\n&lt;p&gt;The Rough Sleeping Initiative (RSI) is a national programme funded by the MHCLG (Ministry for Housing, Communities and Local Government). The 5x borough and district councils have jointly commissioned a countywide service with the aim of&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Improving access to key statutory services&lt;/li&gt;\n&lt;li&gt;Creating bespoke temporary accommodation solutions for entrenched rough sleepers&lt;/li&gt;\n&lt;li&gt;Improving access to long term accommodation, including Housing First units&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The project has developed&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A multi-disciplinary team of health, mental health, social care, substance misuse &amp; housing professionals&lt;/li&gt;\n&lt;li&gt;An enhanced accommodation pathway including a 12 bed dedicated Assessment Unit&lt;/li&gt;\n&lt;li&gt;Expansion of Outreach services across the county&lt;/li&gt;\n&lt;li&gt;Expansion of day center services with weekly drop-in sessions in key areas&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The primary purpose of this pilot is to test the impact of trauma-informed care and psychologically informed service models with current and former rough sleepers. The model will allow an evaluation of how access to and delivery of services can be improved. This will provide a base from which to inform local priorities, policy-making and future commissioning of health and support services for MCN client groups.&lt;/p&gt;\n&lt;p&gt;The post holder will be based across East Sussex and will sit within the Rough Sleeping Initiative (RSI) Team, seconded from Sussex Partnership NHS Foundation Trust. The RSI has a multi-disciplinary team of housing, social care, substance dependence, mental health and physical health nurses. Contracted Outreach and Housing First staff work across the 5x boroughs and districts, with a 12 bed Assessment Unit designed for immediate placement for a 1-3month period.&lt;/p&gt;\n&lt;p&gt;The Clinical Psychologist will be supported by a Band 7 CPN and Band 4 Community Support Workers. As the project develops there is scope for honorary students and trainee clinical psychologist&#39;s placement opportunities.&lt;/p&gt;\n&lt;p&gt;The postholder will be supervised and supported By Dr Tara Daniels, Consultant Clinical Psychologist. The wider project will also be supported by an RSI Operational Board and RSI Strategic Board attended by Commissioners and Heads of Service from partners to the project.&lt;/p&gt;\n&lt;p&gt;This is currently funded as a 12 month fixed term contract and the role requires a full time post holder.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Tara Daniels - tara.daniels@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;Consultant Clinical Psychologist&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Sussex,", "postalCode": "BN21 3UU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7729", "longitude": ".28379"}}, "title": "Registered (HCPC) Practitioner Clinical/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241071", "validThrough": "2020-11-08T23:59:59+0000"}