{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 per annum (pro"}}, "datePosted": "2020-11-03T20:00:19+0000", "description": "&lt;p&gt;&lt;span&gt;Are you looking for an exciting challenge and an opportunity to gain experience in the prison within our busy and friendly Community Healthcare Trust? If so, you will be interested in an exciting opportunity to work in one of the largest community healthcare trusts in the country right here in Birmingham.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join our friendly teams within the Urgent Care Services and as a welcome to our team we will;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Pay the NMC for your next professional registration fee&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Pay for your Disclosure and Barring Service (DBS) certificate and DBS Update Service annual subscription whilst you are employed with the Trust.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Pay any Newly Qualified nurses as a Band 4 Transition Practitioner until you receive your professional registration.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Offer &lt;/strong&gt;&lt;strong&gt;free onsite parking at most of our bases&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are now actively recruiting high quality clinical professionals with the commitment and compassion to make a real difference to fill a number of roles to help keep the communities we serve healthy, safe and supported. We are proud of the quality of our community services and we want the right people to help us maintain that standard of care delivery.&lt;/p&gt;\n&lt;p&gt;As part of our ongoing commitment to ‘Safe Staffing’ standards, we are excited to announce that a number of vacancies have arisen for Band 5 Prison Registered Nurses.&lt;/p&gt;\n&lt;p&gt;HMP Birmingham is a male prison that can house up to 1450 prisoners. The Trust provides primary care &amp; inpatient services in a challenging environment. It is a 24 hour service and offers a varied nursing experience and training opportunities.&lt;/p&gt;\n&lt;p&gt;Full time and part time hours are available and staff will be expected to work across 7 days and to participate in shift work which will include early shifts, late shifts and night shifts.&lt;/p&gt;\n&lt;p&gt;In addition to the above position we also offer the opportunity to join Birmingham Community Healthcare&#39;s Bank facility that has opportunities across all clinical areas and professions, offering flexible working arrangements to suit your work-life Balance.&lt;/p&gt;\n&lt;p&gt;In return, all successful candidates will be offered a package of an induction, mandatory training and all Essential to Role training and an opportunity to rotate through the specialist areas to gain further knowledge and experience. We also offer bespoke professional development programme for all our staff and have a track record of providing an excellent preceptorship programme for all newly qualified nurses. As a nurse working in the Prison Services, you will additionally receive £1500 pro rata environmental allowance&lt;/p&gt;\n&lt;p&gt;The Recruitment open days will take place at Birmingham Community Healthcare NHS Foundation Trust HQ, 3, Priestley Wharf, Holt Street, Birmingham Science Park, Birmingham B7 4BN.&lt;/p&gt;\n&lt;p&gt;The day will consist of a drug calculation test with an interview and pre-employment checking and successful candidates will be issued a conditional offer of employment before leaving the event. Sample drug calculation tests are available in the documents section below.&lt;/p&gt;\n&lt;p&gt;If you are invited for interview you will need to bring along the following documents with you on the day.&lt;br /&gt;&lt;br /&gt;1. Passport or Full Birth certificate with parents’ names on&lt;br /&gt;2. Driving licence (both parts) if required &lt;br /&gt;3. Proof of national insurance number (recent payslips or a letter from the tax office)&lt;br /&gt;4. Two proof of address (utility bill or bank statements, dated within the last three months) &lt;br /&gt;5. Evidence of professional registration and relevant qualifications &lt;br /&gt;6. Proof of immunisations.&lt;br /&gt;7. Details of employment references from your current or most recent employer – only with your permission will we contact them on the day&lt;br /&gt;&lt;br /&gt;With free car parking provided on the day at our city centre Trust Headquarters, we would be delighted to see you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;As part of the Trust’s on-going response to the management of COVID-19 secure workplaces, strict health and safety measures and infection prevention and control has been put into place&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winson Green, Birmingham", "postalCode": "B7 4BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4873", "longitude": "-1.88581"}}, "title": "Band 5 Prison Nurse - INTERVIEW DAY Decmber 2020", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255004", "validThrough": "2020-11-17T23:59:59+0000"}