{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103806", "minValue": "79957", "unitText": "YEAR", "value": "£79,957 - £103,806 per annum"}}, "datePosted": "2020-11-05T13:01:54+0000", "description": "&lt;p&gt;Job Reference: 100-MED-GGH-086-B&lt;/p&gt;\n&lt;p&gt;Consultant in Respiratory and General Medicine&lt;/p&gt;\n&lt;p&gt;Location: Glangwili Hospital, Carmarthen&lt;/p&gt;\n&lt;p&gt;Salary: £79,957 - £103,806 per annum (37.5 hours/10 sessions)&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a motivated Respiratory and General Medicine Consultant to work in a supportive Respiratory Department.&lt;/p&gt;\n&lt;p&gt;This post has arisen due to the need to backfill the Respiratory Services across the Health Board due to vacancies. This appointment will form a network of respiratory medicine across the 4 sites, where the post-holder will be required to work at other hospitals providing respiratory expertise to support outpatient clinics and inpatient in-reach support. Development of sub-specialty interest is encouraged&lt;/p&gt;\n&lt;p&gt;The department of Respiratory Medicine in Hywel Dda UHB has been undergoing significant and exciting re-design and development, Professor Keir Lewis has been appointed the Chair of Respiratory Medicine in Hywel Dda. His post has already significantly increased the already very active research portfolio within the health board.&lt;/p&gt;\n&lt;p&gt;The Respiratory team currently comprises 7 substantive and 1 locum Respiratory Physicians based in Carmarthenshire working across Glangwili General Hospital, Prince Philip Hospital &amp; providing a visiting Consultant service to Withybush General Hospital, and supporting Bronglais Hospital. The health board backed future blueprint for Respiratory services is for a motivated team of Respiratory Physicians providing very high quality specialist respiratory services for the population of Mid &amp; West Wales across 4 sites, with a 1 in 20 on-call for General Medicine. For on-call purposes this post will be based in Glangwilli Hospital as part of a General Medical take.&lt;/p&gt;\n&lt;p&gt;The Health Board runs a successful Consultant Development and Mentoring programme for newly appointed Consultants aimed at developing you as a senior leader to enable you to effectively contribute to Hywel Dda and its future direction.&lt;/p&gt;\n&lt;p&gt;You will enjoy excellent conditions of employment, whilst building your future in one of the best locations in the UK.&lt;/p&gt;\n&lt;p&gt;Hywel Dda University Health Board is one of seven acute Health Boards in Wales serving a population of circa 384,000 with over 9,500 staff. It is an integrated health body, ensuring the delivery of high quality primary, community, mental health and secondary care services, and it is responsible for the health and wellbeing of people across Carmarthenshire, Ceredigion and Pembrokeshire. It also provides a range of services for people living in south Gwynedd and Powys. Integrated health boards are a key first step in creating a world class NHS in Wales. Primary care and community services are delivered through: 55 GP practices, 51 Dental practices, 100 Community pharmacies, 52 Optometry premises, 8 Community hospitals, 11 Health centres.&lt;/p&gt;\n&lt;p&gt;The Health Board is fully committed to supporting employees to achieve an appropriate work life balance. We are continually developing ways in which to support greater flexibility. Job sharing and part-time working is already widespread throughout the organisation. Training and education are central to the function of the Health Board, forming a core element of the Clinical Governance Strategy. Hywel Dda is the prescribed connection for approximately 800 Doctors, with a dedicated Medical Appraisal and Revalidation Lead and Manager, who manages and co-ordinates appraisal and revalidation processes across all sites. There is also a team of 52 trained appraisers to undertake appraisal meetings. Appraisal workshops and training sessions are provided regularly across the Health Board.&lt;/p&gt;\n&lt;p&gt;South West Wales provides a wonderful lifestyle opportunity, and is renowned for being one of the most beautiful places in the UK. Some of our major sites are near coastal areas, from the area of outstanding Natural Beauty Gower and the equally beautiful beaches of Pembrokeshire to the spectacular mountains of Ceredigion, the region offers excellent quality schools, an abundance of outdoor activities such as surfing, mountain biking, fishing, sailing, hiking and walking in a natural and clean environment. Reasonable property prices and excellent state schools contribute to low living costs and high quality of life. There are also good road and rail connections to Cardiff and London.&lt;/p&gt;\n&lt;p&gt;Please ensure that you read the person specification carefully and that you meet all the essential criteria prior to applying. We encourage pre-interview visits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you are interested in progressing your career and contributing to the development of innovative models of healthcare in South Wales then please contact:&lt;/p&gt;\n&lt;p&gt;Prof Keir Lewis - Consultant in Respiratory Medicine - Health board Respiratory Lead&lt;/p&gt;\n&lt;p&gt;Keir.Lewis@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Eiry Edmunds, Consultant Cardiologist/ Hospital Director : 01267 235151&lt;/p&gt;\n&lt;p&gt;Eiry.Edmunds@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Consultant in Respiratory and General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257779", "validThrough": "2020-12-07T23:59:59+0000"}