{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103490", "minValue": "63733", "unitText": "YEAR", "value": "£63,733 - £103,490"}}, "datePosted": "2020-10-26T15:16:43+0000", "description": "&lt;p&gt;CONSULTANT MEDICAL ONCOLOGIST&lt;/p&gt;\n&lt;p&gt;2 POSTS (1 FTE, 1 PART-TIME)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An excellent opportunity to join an expanding team at Blackpool Victoria Hospital.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This advert is for additional posts at Blackpool Teaching Hospitals NHS Foundation Trust The appointed candidate will be expected to have a specialist interest in one or more of the following disease sites:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Upper Gastrointestinal, Gynaecology, Urology. Colorectal, CUP and Acute Oncology Sessions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There are 1.5 FTE posts currently being advertised to expand our team and there is the opportunity for the Directorate to be flexible in the specialities offered to potential candidates.&lt;/p&gt;\n&lt;p&gt;Blackpool Teaching Hospitals are looking to recruit dynamic individuals who can bring their experience, enthusiasm and vision to work across professional and organisational boundaries to expand and develop Oncology services.&lt;/p&gt;\n&lt;p&gt;Blackpool Teaching Hospitals NHS Foundation Trust provides systemic treatments for Blackpool and the Fylde Coast (population 352,000). The Oncology department continues to grow and we are proud of our reputation for excellent patient centred care and collaborative working. The department saw the expansion of the Day Unit in 2014, the addition of a 9 bedded ward in 2018 and will see the opening of the Acute Oncology Triage Unit in 2020.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join a multi-professional team of Consultant Clinical Oncologists (who visit from Lancashire Teaching Hospital), Medical Oncologists and Nursing Teams. You will be part of an established senior team who are forward thinking and development focused.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Sin LauAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Sin Lau or Dr Pavel Bezecny via 01253 957107.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Consultant Medical Oncologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243113", "validThrough": "2020-11-16T23:59:59+0000"}