{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T13:16:14+0000", "description": "&lt;p&gt;The post holder is identified as a skilled and creative Occupational Therapist with knowledge of working with and supporting people living within their own communities and will be an integral member of the Integrated Community Network Teams. The post holder will need to work closely with GP staff, and the wider Multi-disciplinary staff within the practices as well as the Integrated Community Network Teams to support individuals to have good quality emotional and physical well-being in their own homes.&lt;/p&gt;\n&lt;p&gt;The Integrated Community Network Teams work to develop seamless pathways of care and support. This role will be key to be responsive to people’s needs within their localities by working in collaboration with the GP practices and professionals with the Integrated Community Network Team in getting involved at the very earliest point to try to keep people in their homes. The role will be key in bringing existing services through already established Integrated Network Teams, Community Resource Teams and Community Services together in a multi-disciplinary/agency approach to wrap around people’s needs. We aim to provide a team around the person, which enabled individuals to have the right support at the right time. This ensures choice and control for individuals and places the person at the centre of their care. It provides a clear expectation that the person’s voice and choice will be heard. The role with concentrate on maximising the independence of adults and enabling them to live their lives as they wish. The Teams are ambitious in looking to develop innovative and creative ways to support the individual and those important to them. It works to recognise the changing needs within communities and works collaboratively to meet them.&lt;/p&gt;\n&lt;p&gt;The Team currently consists of staff from Social Work, District Nursing Service and the Third Sector. It is now expanding to include a wider range of professionals, which will include: Occupational Therapy; Physiotherapy; Community Psychiatric Nursing; Speech and Language Therapy and Pharmacy support. The Team will work collaboratively with staff from the GP surgeries as a key part of the role. This holistic approach provides a full offer of support for adults with changing needs in their localities as well as meeting complexity of needs.&lt;/p&gt;\n&lt;p&gt;Acting within their professional boundaries, the post holder will provide support and intervention for the presenting person through holistic person centred assessment, clinical assessment, diagnosis, treatment and evaluation of their care within set parameters and across the multi-agency team approach. They will demonstrate safe, clinical decision-making and expert care and support for people within their homes and locality general practices.&lt;/p&gt;\n&lt;p&gt;The post holder will work collaboratively with the wider multi-disciplinary general practice teams to meet the needs of people within their communities. They will be a key member in providing an effective team around the person.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply. &lt;/p&gt;\n&lt;p&gt;Closing Date: 17/11/2020 &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: &lt;/p&gt;\n&lt;p&gt;Name: Jason Howells&lt;/p&gt;\n&lt;p&gt;Additional contact information &lt;/p&gt;\n&lt;p&gt;Jason Howells, Integrated Community Network Manager on tel no 01656 753770 &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glanrhyd Hospital, Bridgend or Pyle Life Centre, Bridgend", "postalCode": "CF31 4LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5268", "longitude": "-3.58784"}}, "title": "Specialist Community Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254111", "validThrough": "2020-11-17T23:59:59+0000"}