{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum, inc HCA"}}, "datePosted": "2020-11-03T17:15:59+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s College Hospital is a renowned research institution in south east London and with KCL and Guys/St Thomas’s forms Kings Health Partners.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The non-invasive department at Denmark Hill site performs over 12,000 non-invasive procedures per annum, Including ETT, CPET, arrhythmia analysis, syncope services and a busy device CRM clinic.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This permanent position is available for an enthusiastic individual looking to work in a supportive and patient centered environment. The post holder will perform basic cardiology investigations unsupervised and will undertake work-based training in a wide range of techniques.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be expected to perform non-invasive cardiac investigations, analysis of 24hour and 7 day holter tapes and assist in exercise tolerance, head up tilt and cardio-pulmonary exercise testing.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Department works flexible hours 9 -5 and 8-6 weekdays in a 37.5 hrs week; and you will be expected to work flexibly. This role will be based primarily within the Cardiac department Suite 6 and the cardiac catheter laboratories at Denmark Hill, but the post holder will be employed to work on any KCH site as required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Key requirements of this position are:&lt;br /&gt;· Successful completion of either BSc Clinical Physiology (old degree) or Healthcare Science (new degree) – Clinical Cardiac Physiology or equivalent&lt;br /&gt;· Intermediate Life Support (ILS)&lt;br /&gt;· Proficiency in and a strong underpinning knowledge of exercise tolerance testing and resting and ambulatory ECG and BP recording and interpretation&lt;br /&gt;· Basic competency in coronary angiography, single chamber pacemaker implantation and follow up and Reveal implantation and follow up&lt;br /&gt;· Willingness to attend courses/conferences and to undertake professional qualifications to keep abreast with new developments&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Nishat Jahagirdar&lt;/p&gt;\n&lt;p&gt;Job title Principal Cardiac Physiologist&lt;/p&gt;\n&lt;p&gt;Email address nishat.jahagirdar@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 02032998638&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254907", "validThrough": "2020-11-17T23:59:59+0000"}