{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa pro rata"}}, "datePosted": "2020-10-29T10:48:44+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a band 4 school nurse assistant part time within the county of Herefordshire.&lt;/p&gt;\n&lt;p&gt;We are looking for a school nurse assistant who will be NVQ/Diploma level 3 child care trained and require a high degree of organisational skills, time management and has experience of using IT programmes.&lt;/p&gt;\n&lt;p&gt;You need to be able to work independently and as part of the team. You will be expected to have effective communication skills that can be adapted appropriately as you will be liaising with other professionals, parents/carers and children from 5 years upwards. This post sits within the 5-19 public health school nursing service.&lt;/p&gt;\n&lt;p&gt;You will be working alongside the school nurses to deliver health promotion and emotional support in a variety of settings.&lt;/p&gt;\n&lt;p&gt;You will need to have a good understanding of safeguarding but you will also receive regular safeguarding, clinical and restorative supervision as part of developing skills to ensure a quality service.&lt;/p&gt;\n&lt;p&gt;If you feel you would like to be a part of our team and have the relevant experience and qualifications we look forward to hearing from you. Experience of working in the community and with knowledge of child development, health promotion, public health and safeguarding would be an advantage.&lt;/p&gt;\n&lt;p&gt;You will be expected to travel around the county of Herefordshire to deliver the National Child Measurement Program and complete public health promotions as part of your role so access to transport will be required.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Herefordshire", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "School Nurse Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247988", "validThrough": "2020-11-12T23:59:59+0000"}