{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T09:47:00+0000", "description": "&lt;p&gt;&lt;span&gt;We are currently looking to recruit dynamic, enthusiastic, motivated, forward thinking Band 6 Theatre Team Leaders to join our &lt;strong&gt;&lt;span&gt;Theatre and&lt;/span&gt;&lt;/strong&gt; &lt;strong&gt;&lt;span&gt;Recovery&lt;/span&gt;&lt;/strong&gt; Teams at The Princess Royal Hospital, Telford (permanent position and temporary position). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Princess Royal Hospital, Telford consists of 10 operating theatres, 8 theatres and 2 maternity theatres. We have an on call team that covers the main theatres 24/7 and a team consisting of an ODP and scrub practitioner that covers maternity 24/7. On our Telford site we cover the following specialities: Trauma &amp; Orthopaedics, ENT, Max-Fax, Gynaecology, Paediatrics, Breast surgery, CEPOD and Maternity.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be required to cover a range of shifts which will include weekends and nights. There will also be an expectation that during period’s staff sickness or staff shortages you may be asked to work across both sites. You will also have the opportunity to gain experience in those specialities not covered at your base unit.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You should demonstrate in your application a desire to develop your career within the theatre setting and have a strong commitment to teaching.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of our vision to provide “the best care” we are looking for talented and passionate practitioners who share the Trusts beliefs and who want to grow with our organisation. This is reflected in our selection processes which now include a Values Based Interview (VBI). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Together with our staff we have developed a set of values which form a framework for a positive and supportive environment for our patients, visitors and staff. We believe that all candidates should be able to demonstrate and be equally committed in fulfilling these values to be successful in their application.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Princess Royal Hospital, Telford", "postalCode": "TF1 6TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7124", "longitude": "-2.51054"}}, "title": "Theatre Team Leader / Recovery Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245896", "validThrough": "2020-11-11T23:59:59+0000"}