{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 Salary is dependent on experienc"}}, "datePosted": "2020-11-03T10:16:47+0000", "description": "&lt;p&gt;As one of the largest acute Trusts in the UK – and with more than 20,000 employees – Manchester University NHS Foundation Trust (MFT) is on an exciting mission to deliver high-quality care to the people of Manchester, Trafford and beyond. Our vision is to create and deliver a seamless 24/7 service that extends beyond excellent care within our nine hospitals and community services within our Local Care Organisations.&lt;/p&gt;\n&lt;p&gt;Your key role will to be to lead on the separation, transition and integration of Estates and Facilities, phase 2 recruitment and support the hospital redevelopment&lt;/p&gt;\n&lt;p&gt;You will play a key role in shaping the future provision of Estates Services within the Trust. This will include the strategic development of services to ensure they are high quality, progressive, responsive to internal and external demand, patient focused and fully support the strategic and future operational needs of the service delivery contracts.&lt;/p&gt;\n&lt;p&gt;You will be responsible for leading the development and implementation of strategic business development plans and a strong governance and assurance framework to provide and demonstrate that all services are safe, fit for purpose, efficient and effective for patients and staff including relatives and visitors.&lt;/p&gt;\n&lt;p&gt;You will help to maintain and develop strong and effective links with all key stakeholders, which will involve deputising for the Director of Estates and Facilities when required at local, regional and national level.&lt;/p&gt;\n&lt;p&gt;The Deputy Director of Estates will be responsible for the operational management and delivery of the range of services outlined in the portfolio below:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;KEY DUTIES AND RESPONSIBILITIES&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Fire safety &amp; prevention&lt;/li&gt;\n&lt;li&gt;Grounds and Gardens&lt;/li&gt;\n&lt;li&gt;Hard FM Services – including electrical, mechanical and building maintenance services&lt;/li&gt;\n&lt;li&gt;Minor (Backlog) Capital Work Schemes / Existing Capital Development Schemes&lt;/li&gt;\n&lt;li&gt;Pest Control&lt;/li&gt;\n&lt;li&gt;Shared Support Services (i.e. Compliance &amp; Governance, Helpdesk, Information Management)&lt;/li&gt;\n&lt;li&gt;Hospital Energy Centers including 24 hour, 365 days, Electrical and Heat&lt;/li&gt;\n&lt;li&gt;Estates / Hard FM Compliance and Planned and Preventative Maintenance&lt;/li&gt;\n&lt;li&gt;Waste, Transport and Main stores&lt;/li&gt;\n&lt;li&gt;Develop and Implementation of Governance and Assurance Framework for Hard FM which must be compliant with the Premises Assurance Model, demonstrate compliance with statutory requirements and Risk Management / Business Continuity&lt;/li&gt;\n&lt;li&gt;ERIC Data / PLACE / Lord Carter Assessment and External Performance Reviews&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Deputy Director of Estates", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253404", "validThrough": "2020-11-18T23:59:59+0000"}