{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104408", "minValue": "104408", "unitText": "YEAR", "value": "£104,408 pro rata"}}, "datePosted": "2020-10-22T11:46:33+0100", "description": "&lt;p&gt;The Associate Dean for Post-CCT is is an exciting role within Health Education England South West Peninsula and the School of Primary Care. The role of Associate Dean has evolved over a number of years as a result of changes in healthcare education and training, the implementation of revalidation, the emergence of new workforce solutions and the continuing development of Health Education England (HEE).&lt;/p&gt;\n&lt;p&gt;To support the Postgraduate Dean, Associate Deans will work across the spectrum of health and where relevant, social care, within the context of a team, so that the provision of education reflects changing service models. This will deliver an integrated workforce comprising individuals from a spectrum of professional and other backgrounds.&lt;/p&gt;\n&lt;p&gt;The role of Associate Dean Post-CCT specifically supports the retention of GPs within the workforce and involves close collaborative working with NHSE/I and HEE Primary Care colleagues across HEE SW Peninsula. The role leads and supports the retention scheme, I&amp;R scheme and IGPR scheme.&lt;/p&gt;\n&lt;p&gt;For more information about this post, please review the Job Description and Person Specification which provide an outline of the tasks, responsibilities and outcomes required of the role along with eligibility criteria.&lt;/p&gt;\n&lt;p&gt;It is anticipated that interviews will be conducted virtually via Microsoft Teams on a date to be confirmed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rebecca Williams-Lock&lt;/p&gt;\n&lt;p&gt;rebecca.williams-lock@hee.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plumer House, Plymouth", "postalCode": "PL6 5DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4081", "longitude": "-4.12717"}}, "title": "Associate Dean - Post CCT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238238", "validThrough": "2020-11-19T23:59:59+0000"}