{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Per Annum"}}, "datePosted": "2020-10-27T15:31:12+0000", "description": "&lt;p&gt;The post available is for a Senior Clinical Psychologist to join the Emotional &amp; Behavioral Team in Luton CAMHS. We are willing to consider candidates who work part-time or job share arrangements.&lt;/p&gt;\n&lt;p&gt;Closing date: Sunday 8th Novmeber 2020&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and experienced Senior Clinical Psychologist with a keen interest in service development and delivery to join our thriving and innovative multi-disciplinary Emotional &amp; Behavioural Team (EBT). We are willing to consider candidates who work part-time or job share arrangements.&lt;/p&gt;\n&lt;p&gt;Luton is a fast growing hub and multi-ethnic community within a half hour train journey from central London, with the clinic a five minute walk from the station. The Trust has an arrangement for 50% discount on season ticket fares with Thameslink, the rail provider, for its staff.&lt;/p&gt;\n&lt;p&gt;Luton Specialist CAMHS is part of ELFT (East London Foundation Trust), which also provides CAMHS services in East London and Bedfordshire and has an active child psychotherapy forum.&lt;/p&gt;\n&lt;p&gt;Luton CAMHS is a well-established multidisciplinary service that provides a comprehensive stepped model of care for children, young people and their families in the locality. CAMH Access Services provide a first step level of early intervention (mild to moderate) mental health care through GP practices, schools, provisions and Early Help services. For our second level of care we provide four discrete pathways (for moderate to severe mental health): emotional &amp; behavioural difficulties in childhood and adolescence (EBT), adolescent complex and crisis care (AMHT), neurodevelopmental child &amp; adolescent care (NDT), and our county wide eating disorders care (CEDS). The aim of the Emotional and Behavioural Team (EBT) is to deliver a wide range of mental health assessments and treatments to children and young people between the ages of 0-18.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an experienced Senior Clinical Psychologist to bring a psychological perspective in clinical thinking to the senior team and E &amp; B pathway. They will provide guidance on evidence informed therapies that can help address the capacity of and demand on services, and in particular the growing complex challenges that children, young people and their families face, and how we as a service can most effectively respond. The post holder will lead on service audits, quality improvement projects and clinical outcomes, and ensure the findings of audits inform service development, based on the needs of the diverse communities in Luton.&lt;/p&gt;\n&lt;p&gt;Responsibilities will include direct clinical work and case management of complex and high risk cases, line management and clinical supervision. The senior role is integral to contributing towards achieving the wider EBT and Luton CAMH Service objectives.&lt;/p&gt;\n&lt;p&gt;The post holder will support the Clinical team lead of the EBT and the Psychological Therapies Leads within the Luton CAMH Service across the teams and pathways and contribute to senior management meetings.&lt;/p&gt;\n&lt;p&gt;For further information regarding this post, please contact:&lt;/p&gt;\n&lt;p&gt;Dr Vicky Taylor, Clinical Team Lead, Luton Emotional and Behavioural Team&lt;/p&gt;\n&lt;p&gt;Dr Marc van Roosmalen, Psychological Therapy Lead, Luton and South Bedfordshire CAMHS, or&lt;/p&gt;\n&lt;p&gt;Linda Hurst, General Manager, Luton and South Bedfordshire CAMHS,&lt;/p&gt;\n&lt;p&gt;Telephone number: 01525 638614 or 01525 638613.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLinda HURSTJob titleLine ManagerEmail addresslinda.hurst3@nhs.netTelephone number01582 708140&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SS LUT Emotional and Behavioural Team, LUTON", "postalCode": "LU1 2PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8809", "longitude": "-.418598"}}, "title": "Senior Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245195", "validThrough": "2020-11-22T23:59:59+0000"}