{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 Per annum"}}, "datePosted": "2020-11-03T10:46:26+0000", "description": "&lt;p&gt;An excellent opportunity has arisen within the Primary Care Development Team for an enthusiastic and motivated Team Administrator (maternity cover). You would be part of a friendly team working to provide comprehensive administrative support to the Primary Care Development team to enable the team to carry out their work effectively. This post holder’s role will help to support development within Primary Care, involving GP practices and the wider community health system.&lt;/p&gt;\n&lt;p&gt;As Team Administrator, you will provide a professional administrative support service and be an integral member of the Team. Key responsibilities will include maintaining and continuing to develop efficient and effective systems of administration, as well as the organisation and co-ordination of meetings, minute taking and dissemination of information to a range of internal and external contacts and maintaining information logs and assisting with events. This role is key to supporting primary care development and underpins processes and systems that will support day to day operations.&lt;/p&gt;\n&lt;p&gt;This post requires someone who has excellent administrative skills, with attention to detail, the ability to organise and prioritise tasks, work to deadlines and is able to communicate effectively and confidently with a wide range of stakeholders.&lt;/p&gt;\n&lt;p&gt;Candidates are expected to have a good understanding of the public health environment and it would be advantageous to have previous experience of working in a busy office/administrative area particularly within the NHS.&lt;/p&gt;\n&lt;p&gt;The ability to work effectively and efficiently as part of a team and independently is pivotal to the success of this post.&lt;/p&gt;\n&lt;p&gt;You will be able to demonstrate the attributes and capabilities required for the post as outlined in the job description and person specification.&lt;/p&gt;\n&lt;p&gt;You will have excellent organisational skills and a sound working knowledge of MS office packages such as Word, Excel, Teams and Outlook, Excel, alongside excellent communication skills both written, face-to-face and over the telephone.&lt;/p&gt;\n&lt;p&gt;This post is based at East and North Hertfordshire Clinical Commissioning Group, Charter House, Parkway, Welwyn Garden City, Hertfordshire, AL8 6JL. However, due to the current COVID-19 pandemic, some home working will be required.&lt;/p&gt;\n&lt;p&gt;This is a fixed term (maternity cover) contract of 18.5 hours a week.&lt;/p&gt;\n&lt;p&gt;For more information or an informal discussion about the role prior to applying, please contact:&lt;/p&gt;\n&lt;p&gt;Monica Wright, Project Officer, Primary Care Development (Monica.Wright@nhs.net, 07881832398) or&lt;/p&gt;\n&lt;p&gt;Andrew Tarry, Head of Primary Care Development (Andrew.Tarry@nhs.net 0788 0480239).&lt;/p&gt;\n&lt;p&gt;This post will close at midnight on Tuesday 10th November 2020. Please note however, that this post may close sooner, if we receive a large number of applications.&lt;/p&gt;\n&lt;p&gt;We thank you in advance for your interest in working for East and North Hertfordshire Clinical Commissioning Group and look forward to receiving your application.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128256.jpg", "name": "East and North Herts CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128256"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NHS East and North Hertfordshire Clinical Commissioning Group, Welwyn Garden City", "postalCode": "AL8 6JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8027", "longitude": "-.207565"}}, "title": "Team Administrator (Maternity Cover)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253526", "validThrough": "2020-11-10T23:59:59+0000"}