{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T17:00:36+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Practice Development Staff Nurse/ Practice Development Practitioner &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An exciting new opportunity has arisen within the Clinical Education and Practice Development Team for a Band 5 Practice Development Staff Nurse / Practitioner. This is a new role for the team and we are looking for a Registered Nurse or Registered Allied Health Professional who is passionate about supporting the education and development of others and upholding high standards of patient care. You must be clinically up to date, have excellent communication skills, demonstrate values and behaviours which align to our Trust CARE values and be able to inspire, motivate and empower others. Experience of supporting new staff/learners within a clinical area is essential.&lt;/p&gt;\n&lt;p&gt;You will join a highly motivated, innovative and friendly team who are committed to improving patient care and work on a wide range of Trust-wide projects and initiatives to achieve this. As the Practice Development Staff Nurse/ Practitioner you will be heavily involved in the delivery of the Care Certificate for Clinical Support Workers joining the Trust, delivering some of the classroom-based teaching sessions, and online delivery of classes. Working with individuals and managers to ensure completion of the programme within the 12-week national timeframes and undertaking quality assurance procedures. You will also have the opportunity to work with international nurses who are preparing for NMC registration and other projects being delivered within the team. We will offer you a full induction to the role and the opportunity to develop your skills in and knowledge in the education field.&lt;/p&gt;\n&lt;p&gt;The post will offer 37.5 hours per week, working Monday – Friday, with the occasional need to work at a weekend.&lt;/p&gt;\n&lt;p&gt;Interviews for this post will be held on &lt;strong&gt;15th December 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;For further information please contact Abigail Cooper, Practice Development Nurse on 0118 322 8033 or abigail.cooper@royalberkshire.nhs.uk or Jo Sandy, Lead Practice Development Nurse on 0118 322 8034 or jo.sandy@royalberkshire.nhs.uk&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Practice Development Staff Nurse/ Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254865", "validThrough": "2020-11-17T23:59:59+0000"}