{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-22T16:01:31+0100", "description": "&lt;p&gt;Are you feeling fed up in your current role? If so, Wincanton Community Hospital has the perfect opportunity for you to re-ignite your passion for nursing.&lt;/p&gt;\n&lt;p&gt;Wincanton Community Hospital is a fully refurbished hospital nestled in the charming town of Wincanton.&lt;/p&gt;\n&lt;p&gt;You will work closely with the multi-disciplinary teams to help patients return to their own homes. Our complex patients and nurse-led ward provides plenty of opportunity for up-skilling in areas such as rehabilitation, end of life care and experience of Mental Health.&lt;/p&gt;\n&lt;p&gt;There is plenty to get involved in at the Hospital which you may not experience working in an acute environment. Our patients enjoy activities such as hands on craft, music sessions, and tea parties, all arranged by our innovative Activities Co-ordinator. You may also be lucky enough to be at the hospital when Lofty the therapy horse pays a visit!&lt;/p&gt;\n&lt;p&gt;We are confident that once you’ve seen what we can offer you won’t want to leave. Informal visits/chats are always welcome.&lt;/p&gt;\n&lt;p&gt;As part of the interview process, you will be required to bring the following with you: Proof of any essential qualifications stated on the Job Description, proof of NHS payslip if coming from another NHS Organisation and all ID to prove your identity and Right to Work (More details will follow for successful applicants invited to interview)&lt;/p&gt;\n&lt;p&gt;All our staff at the hospital benefit from free parking.&lt;/p&gt;\n&lt;p&gt;If you are as excited as we are about this opportunity, please get in touch or apply now.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tania Colin&lt;/p&gt;\n&lt;p&gt;Ward Sister&lt;/p&gt;\n&lt;p&gt;01963 828447&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wincanton Community Hospital, Wincanton", "postalCode": "BA9 9DQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0587", "longitude": "-2.41817"}}, "title": "Community Hospital Staff Nurse, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239263", "validThrough": "2020-11-13T23:59:59+0000"}