{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-10-20T13:01:12+0100", "description": "&lt;p&gt;&lt;strong&gt;Locum Consultant Radiologists: General with Subspecialty Interests (three posts)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The LNWUH NHS Trust is looking for dynamic and motivated radiologists to join a team of 59 consultants, three staff grade doctors and 23 registrars working collaboratively across the three sites to provide high quality imaging service.&lt;/p&gt;\n&lt;p&gt;The successful candidates will contribute to the broad spectrum of work that is undertaken by our consultant radiologists. Specialist interests are encouraged.&lt;/p&gt;\n&lt;p&gt;Their is a general locum posts are available to cover extended leave and provide support for increasing demand across all modalities. All posts are predominantly based at Northwick Park Hospital and are initially for a period of 12 months. Post holders will be expected to cover activities on other sites if required. All subspecialty interests are welcome. However, there is a particular need for lymphoma, acute, paediatric, chest, musculoskeletal and neuroradiology imaging. MDT commitments may be available dependent on subspecialty interest and departmental requirements. There will be an on call commitment incorporating weekend working. Opportunities for teaching and management are ample.&lt;/p&gt;\n&lt;p&gt;The department is highly regarded across London, having developed innovative and integrated solutions in response to the changing needs of patients and clinical teams. The service has expanded to meet rising clinical demand and the three radiology departments provide a wide range of diagnostic services using state of the art equipment, much of which has been and will continue to be replaced and upgraded.&lt;/p&gt;\n&lt;p&gt;Established on 1st October 2014, London North West University Healthcare NHS Trust is one of the largest integrated NHS Trusts in the country employing more than 8,000 staff with a budget of more than £640 million a year. The Trust is the first Trust of its kind to provide complete hospital-based and community healthcare services to a combined population of 850,000 in the boroughs of Brent, Harrow and Ealing.&lt;/p&gt;\n&lt;p&gt;Our services include four major acute hospitals including the internationally renowned St Marks’ Hospital; Northwick Park Hospital, Central Middlesex Hospital, Ealing Hospital and community services across Brent, Harrow and Ealing, including Clayponds Rehabilitation Hospital, Meadow House Hospice and Willesden Centre.&lt;/p&gt;\n&lt;p&gt;Applications should contain names and addresses of three referees (one of which should be your current or most recent employer), details of GMC registration and CCT (or evidence of eligibility to apply for CCT).&lt;/p&gt;\n&lt;p&gt;Applicants must have full GMC Registration and be on the Specialist Register or be eligible for inclusion within six months of the interview date.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For information and enquiries please contact Dr Phillip Lung – Clinical Director / Dr Harmeet Chana (Consultant Radiologists) on 020 8869 3882 / 3908 and/or email lnwh.radiology2@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London Northwest University Health care, HARROW", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Locum Consultant Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234487", "validThrough": "2020-11-30T23:59:59+0000"}