{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20000", "minValue": "20000", "unitText": "YEAR", "value": "£20000.00 Per Annum Free DBS check, Flu vaccinatio"}}, "datePosted": "2020-10-09T14:46:18+0100", "description": "&lt;p&gt;Salary: £20,000 per annum&lt;/p&gt;\n&lt;p&gt;Requirements: Basic Food Hygiene certificate level 3 or above (less than 3 year&#39;s old) C &amp; G 706-3 or equivalent NVQ qualification and good working knowledge of health and safety procedures and COSHH&lt;/p&gt;\n&lt;p&gt;Hours of Work: 40 hours per week, on a rota basis&lt;/p&gt;\n&lt;p&gt;Contract Type: Permanent&lt;/p&gt;\n&lt;p&gt;Benefits of Working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meals Provided&lt;/li&gt;\n&lt;li&gt;On-site parking available&lt;/li&gt;\n&lt;li&gt;Free Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Work Place Pension with Legal &amp; General where applicable&lt;/li&gt;\n&lt;li&gt;Comprehensive Learning &amp; Development Package&lt;/li&gt;\n&lt;li&gt;Progression Opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Company Funded Benefits: Free DBS check, Flu vaccination and Hepatitis B vaccination&lt;/p&gt;\n&lt;p&gt;About the role: We are seeking to recruit a Catering Manager, to be based at New Hall Independent Hospital in Ruabon. The Hospital caters for up to 15 patients and has over 90 staff.&lt;/p&gt;\n&lt;p&gt;We are looking for an innovative and motivated Manager who will lead the catering service, develop nutritional diet plans and cater for diverse cultural and religious requirements when needed. We are looking for someone with relevant experience and the ability to communicate at all levels.&lt;/p&gt;\n&lt;p&gt;Good working knowledge of current food trends and cultural/religious dietary requirements are essential for this role. Experience of budget control is also essential.&lt;/p&gt;\n&lt;p&gt;The ability to demonstrate effective commercial and people management skills are desirable.&lt;/p&gt;\n&lt;p&gt;As the Catering Manager your role will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensuring the efficient and smooth running of the kitchen&lt;/li&gt;\n&lt;li&gt;Demonstrating and maintaining high standards of cooking&lt;/li&gt;\n&lt;li&gt;Devise and plan menus for all patients and staff, including visitors and conference meals&lt;/li&gt;\n&lt;li&gt;Managing the production and planning of dishes&lt;/li&gt;\n&lt;li&gt;Managing and monitoring daily food budgets&lt;/li&gt;\n&lt;li&gt;Ensure that an effective stock rotation procedure is adhered to at all times&lt;/li&gt;\n&lt;li&gt;Provide hands on support with preparation, cooking and cleaning&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;About the Service: Situated within walking distance of the village of Ruabon and 5 miles from Wrexham, the largest town in North Wales, New Hall benefits from all the local communities have to offer. In the heart of Ruabon there is a small supermarket, fish &amp; chip shop, café, bakery, library, bank, post office and newsagents.&lt;/p&gt;\n&lt;p&gt;Equal Opportunities: MHC are an equal opportunities employer and welcome applications from all who believe they fit the essential requirements for this role regardless of their race, sex, disability, religion / belief, sexual orientation or age.&lt;/p&gt;\n&lt;p&gt;How to Apply: Please complete the short application and upload your CV, alternatively for an informal discussion about this role you can contact MHC Workforce on 01824 572 020.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ruabon, Wrexham", "postalCode": "LL14 6HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9984", "longitude": "-3.03144"}}, "title": "CATERING MANAGER – NEW HALL INDEPENDENT HOSPITAL", "url": "https://www.jobs.nhs.uk/xi/vacancy/916220741", "validThrough": "2020-11-08T23:59:59+0000"}