{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 to £35,207 pa pro rata inc HCAS"}}, "datePosted": "2020-11-03T09:31:00+0000", "description": "&lt;p&gt;Sutton Health and Care is a pioneering partnership made up of the GP federation in Sutton, the London Borough of Sutton, South West London and St George’s Mental Health Trust and Epsom and St Helier hospitals. Working together, we provide community services in Sutton, caring for adults in their own homes across the borough.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic Band 5 community nurses to join us in our community nursing services within the London borough of Sutton. If you are a passionate, motivated team player and want to excel in delivering exceptional holistic healthcare to a diverse patient group supported by a multidisciplinary team of community specialists nurses and district nurses. We want to hear from you.&lt;/p&gt;\n&lt;p&gt;Previous experience of community nursing is desirable but not essential as we offer a structured preceptor ship programmme alongside Nurses new to community course, clinical supervision and access to learning and development to support your continuous professional development. We encourage student nurses with an interest in pursuing a career in community nursing to apply.&lt;/p&gt;\n&lt;p&gt;As a community nurse you will work directly with patients, their families and multidisciplinary services to plan and facilitate the delivery of holistic evidence based care. supporting patients to remain independent with the aim of avoiding unnecessary hospital admission.&lt;/p&gt;\n&lt;p&gt;The pioneering partnership of Sutton Health and Care is truly exciting, and together, we can achieve more for the people we care for. We want local people to receive the care that they need in the right environment. Bringing together our expertise will allow us to improve patient care and will enable local people to access the right support, care and treatment more easily than ever before.&lt;/p&gt;\n&lt;p&gt;We offer flexible shift patterns and encourage informal visits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Trish Thompson- Clinical Integrated Locality Manager Carshalton &amp; Wallington via Mob 07917553568&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Robin Hood Lane Health Center, Green Wrythe Lane, Sutton/Cheam/Carshalton", "postalCode": "SM1 2RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.363", "longitude": "-.19693"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253287", "validThrough": "2020-11-17T23:59:59+0000"}