{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "38000", "unitText": "YEAR", "value": "up to £38,000"}}, "datePosted": "2020-11-05T13:50:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Occupational Health Physiotherapist&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Part time&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£26,500 - £38,000 depending on experience&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Thetford - Norfolk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a well-organised and experienced Physiotherapist, ideally with an Occupational Health background, to deliver quality clinical care for patients suffering with a musculoskeletal condition. Whilst undertaking comprehensive assessment and diagnosis of patients with a wide variety of physical and emotional needs, you must formulate, deliver, review and progress individual treatment programmes and ensure effective treatment, specialist advice and timely discharge are achieved. &lt;/p&gt;\n&lt;p&gt;You’ll be positive, constructive and approachable, along with being registered with the HCPC and a fully qualified Physiotherapist. We’re looking for you to manage a varied caseload of MSK patients, as well as the ability to work under pressure and being committed to CPD. &lt;/p&gt;\n&lt;p&gt;You should have the desire to facilitate improvement in yourself and the service. You will have excellent and confident communication skills with both patients and colleagues alike.  You may have experience of working within the NHS, Public or Private Sector, bringing transferrable skills to Connect. We are looking for committed staff to support our agile and dynamic working strategy and to give clinicians an opportunity to see what working within the Connect team feels like. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Connect&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;Connect is one of the largest and most respected independent providers of specialist Occupational Health Physiotherapy Services (OPS) in the UK, employing over 250 physiotherapists UK wide. &lt;/p&gt;\n&lt;p&gt;We’ve been treating patients with MSK disorders to keep them moving and improve their quality of life for 30 years, which means that our systems and approaches are designed to facilitate great care for patients?with MSK conditions. &lt;br /&gt; &lt;br /&gt;We have one vision, and that is to help people improve their quality of life. It’s why we exist and it’s what we care passionately about. Our services are wholly designed to focus on the patient experience and what really makes a difference to them. Being seen in the right place, at the right time, by the right clinician. It’s exactly what a patient wants, and it’s helped countless people improve their quality of life. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of working for Connect&lt;/strong&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development of OH physio skills: Functional rehabilitation, ergonomics, DSE assessments, manual handling training, communication and work management reporting&lt;/li&gt;\n&lt;li&gt;up to 30 days’ holiday (plus public holidays)&lt;/li&gt;\n&lt;li&gt;option to buy additional annual leave&lt;/li&gt;\n&lt;li&gt;an additional day off for your birthday&lt;/li&gt;\n&lt;li&gt;online discounts portal&lt;/li&gt;\n&lt;li&gt;employer pension contributions&lt;/li&gt;\n&lt;li&gt;salary sacrifice schemes&lt;/li&gt;\n&lt;li&gt;an employee assistance programme&lt;/li&gt;\n&lt;li&gt;performance related pay rewards&lt;/li&gt;\n&lt;li&gt;team building/away days&lt;/li&gt;\n&lt;li&gt;reimbursement of HCPC and CSP membership fees for clinicians&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; “Best thing about Connect - for me it’s the opportunity to develop”&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Connect Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thetford", "postalCode": "IP24 3RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4087", "longitude": ".728758"}}, "title": "Senior Occupational MSK Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257967", "validThrough": "2020-11-19T23:59:59+0000"}