{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-27T16:14:39+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An opportunity has arisen within Midlands Partnership NHS Foundation Trust for an enthusiastic, highly motivated individual with excellent interpersonal skills to support the Directorate of Facilities and Estates.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 4 - &lt;/strong&gt;&lt;strong&gt;Professional PPE, Transport and Car Parking Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Main areas of responsibility for the Facilities administration teams, Car parking permits and passes, door access control systems, transport and logistical services Trustwide which includes non-emergency patient transport, courier (secure and non-secure), taxi, secure service transport, commercial fleet, pool cars and the Management responsibility of the Trust wide COVID-19 PPE service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Reporting to the Facilities Senior Performance and Quality Manager, the post holder’s main duties will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;To lead on the management of all parking, transport and logistical related issues, to ensure smooth running of related services in a safe, efficient and cost effective manner for all transport related services including: Secure/NEPT/Courier, Taxis, commercial fleet, pool cars and Trustwide COVID-19 PPE.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Responsible for the development, implementation and monitoring of the new COVID-19 PPE service for the Trust. As well as the following contracts: NEPTS, Courier, Secure Patient transport and Fleet.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;The move from interim to steady state COVID-19 PPE receipt, stock control and delivery of all PPE. To advise of impact of any changes in significant demand variations as different Government instructions are issued and changes to the supply chain of PPE varies in consultation with Procurement.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Maintain Operational Trust delivery of Non Urgent Patient Transport services currently outsourced to external providers (including High Dependency journeys).&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Management of all non-patient services transport (Collection/Delivery of supplies, goods, equipment, mail and administration of clinical and non clinical items to premises, wards and departments across the local health economy.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Ensuring all vehicles meet legislation standards.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Manage and monitor all Car parking permits/passes systems and fuel /mileage documentation in relation Trust requirements.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Manage internal F&amp;E fleet.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support the F&amp;E Sustainable development plan, reduction of the Carbon Footprint.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Administration of documentation legal and legislative requirements of fleet management, i.e. driving licence, insurance, tax, MOT and vehicle plating.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills and Experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Previous experience in a similar Facilities Management operational role or a Transport Manager post would be an advantage, as would previous NHS experience&lt;/p&gt;\n&lt;p&gt;Candidates should meet all the essential aspects of the Person Specification.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further Information:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details about this role please contact Mark Cooper, Head of Facilities on telephone number: 0300 790 7000 or Email: Mark.cooper@mpft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Georges Hospital, Stafford", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Facilities Manager – Professional PPE, Transport and Car Parking", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245352", "validThrough": "2020-11-13T23:59:59+0000"}