{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27041", "minValue": "24012", "unitText": "YEAR", "value": "£24,012 - £27,041 (pro rata for part time)"}}, "datePosted": "2020-10-22T13:06:22+0100", "description": "&lt;p&gt;Are you a nurse thinking about working in a different way, promoting health and wellness?&lt;/p&gt;\n&lt;p&gt;Interested in the opportunity to work with Families and Children within the Community setting?&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for Registered Nurses from a variety of backgrounds and experience to develop their career in working with children and families. You will have the opportunity to deliver the Healthy Child Programme with School nurses, to develop skills in public health and multi-agency working to support the health needs of the children and families. The vacancies to work with the School Nurse teams arein North Devon and Torridge. Part time applications will be considered.&lt;/p&gt;\n&lt;p&gt;OurPublic HealthNurse teams are innovative, enthusiastic and motivated to deliver the best healthy outcomes for children and families within Devon. Excellent peer-based support and supervision will be given while you develop your knowledge, skills and competence.&lt;/p&gt;\n&lt;p&gt;You should also have evidence of recent professional development and an understanding of Community Practice and Public Health Issues. If you have the drive and passion to influence healthy outcomes for communities and families and in doing so help make a difference to the lives of children and families then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;Successful applicants will have the opportunity to commence appropriate training programme in 2022 to be a Specialist Community Public Health Nurse (School Nurse).&lt;/p&gt;\n&lt;p&gt;We are committed to safeguarding and promoting the welfare of children and vulnerable adults, and expect all staff and volunteers to share this commitment.&lt;/p&gt;\n&lt;p&gt;This role requires a DBS disclosure.&lt;/p&gt;\n&lt;p&gt;This role requires the ability to fulfil all spoken aspects of the role with confidence and fluency in English.&lt;/p&gt;\n&lt;p&gt;Personal data we collect from you will be processed in accordance with the Applicant privacy notice.&lt;/p&gt;\n&lt;p&gt;For more information about Working for Devon please visit our Working for Devon page.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Devon County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Devon and Torridge", "postalCode": "EX2 4QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7145", "longitude": "-3.5175"}}, "title": "Public Health Staff Nurse - School Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238576", "validThrough": "2020-11-13T23:59:59+0000"}