{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "109749", "minValue": "95826", "unitText": "YEAR", "value": "£95,826 - £109,749 per annum, inc HCA"}}, "datePosted": "2020-10-28T17:15:51+0000", "description": "&lt;p&gt;King’s College Hospital NHS Foundation Trust is one of London’s largest and busiest teaching hospitals, with a strong profile of local services primarily serving the boroughs of Lambeth, Southwark, Lewisham and Bromley and Bexley. With over 12,500 colleagues and an annual turnover of £1.1 bn, their specialist services include nationally and internationally recognised work in liver disease and transplantation, neurosciences, haemato-oncology and foetal medicine. The three main sites for the Trust are King’s College Hospital, Denmark Hill, the Princess Royal University Hospital and Orpington Hospital.&lt;/p&gt;\n&lt;p&gt;Guy’s &amp; St Thomas&#39; NHS Foundation Trust is one of the largest hospital trusts in the country, with around 17,000 staff, an annual turnover of more than £1.6 bn, and over 2.6 million patient contacts a year. Our hospitals have a long and proud history, dating back almost 900 years, and have been at the forefront of medical progress and innovation since they were founded. We continue to build on these traditions and have a reputation for clinical, teaching and research excellence.&lt;/p&gt;\n&lt;p&gt;Essentia, Guy’s and St Thomas’ Trust in-house team, is responsible for non-clinical healthcare services. Essentia designs, builds and maintains healthcare infrastructure vital to the smooth running of healthcare services. This encompasses everything from construction projects and healthcare planning to waste management, housekeeping, transport and security. Essentia employs around 1,700 people, who provide essential facilities management support to clinical teams. It combines exceptionally high standards and public sector values with commercial focus, innovative thinking and modern technology to create the best possible patient experience.&lt;/p&gt;\n&lt;p&gt;In a valued and long-term relationship between the two Trusts, Essentia is providing strategic and operational leadership to the estates and facilities team supporting King’s, including its Princess Royal University Hospital PFI and South sites.&lt;/p&gt;\n&lt;p&gt;As part of a transformation programme to support both Trusts’ strategic ambitions, we are seeking to appoint a Site Director of Estates and Facilities for the PRUH and the South sites, covering a diverse portfolio which includes the Princess Royal University Hospital, Orpington Hospital and Queen Mary’s Hospital, Sidcup. They will be employed by Guy’s and St Thomas’, seconded to King’s College Hospital NHS Foundation Trust, and supported by a central, specialist Essentia team, and a local King’s operational team.&lt;/p&gt;\n&lt;p&gt;The Site Director of Estates will lead the high-quality provision of all hard and soft facilities management (FM) services, (including the outsourced providers), and co-ordinate all capital projects on behalf of the Site Chief Executive. The role provides leadership and management across the hospitals portfolio and will be a key member of both the Essentia executive (senior leadership team) and the King’s senior leadership team. With dual reporting to the PRUH Site Chief Executive and Essentia Director of Operations the Site Director of Estates and Facilities is accountable to both Trusts for the direct delivery of broad spectrum of crucial estates and facilities services across a high-footfall and technically complex healthcare estate portfolio.&lt;/p&gt;\n&lt;p&gt;We are seeking an individual with a proven track record of leading best in class estates and facilities management services across large scale, complex, high-footfall estates portfolios. You with be an enthusiastic, inspiring and inclusive leader, with demonstrable experience of leading and motivating large scale teams from senior managers through to operational service delivery professionals. An aptitude and track record for driving continuous performance improvement of operational service delivery is also key, as is the ability to drive value from outsourced contract provision.&lt;/p&gt;\n&lt;p&gt;The role offers the opportunity to play a crucial role in leading high-quality services across one of the UK’s most complex healthcare portfolios, creating an environment that in turn will make a fantastic difference to so many. The Candidate Brief can be viewed and downloaded from the King’s College Hospital website.&lt;/p&gt;\n&lt;p&gt;For a confidential briefing discussion please contact our advisors Ben Duffill (ben.duffill@mrgpeople.co.uk) and Michael Hewlett (michael.hewlett@mrgpeople.co.uk) of The Management Recruitment Group on 0203 962 9900.&lt;/p&gt;\n&lt;p&gt;The closing date for applications is 15th November 2020. Applications are by CV and covering letter.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;King’s serves a richly diverse population and aims to employ a workforce which is as representative as possible of this population, so is open to the value of differences in age, disability, gender, marital status, pregnancy and maternity, race, sexual orientation, and religion or belief.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;GSTT has an active commitment to equality and diversity, welcoming people of all backgrounds, nationalities and religions. The Trust is recognised as a healthcare leader by Stonewall and the Trust is a disability confident employer.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, London", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Site Director of Estates, PRUH and associated South sites", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247480", "validThrough": "2020-11-15T23:59:59+0000"}