{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17010", "minValue": "17010", "unitText": "YEAR", "value": "17,010"}}, "datePosted": "2020-10-13T10:21:04+0100", "description": "&lt;p&gt;Providing quality, inspiring innovation and delivering value is what we set out to achieve at Priory Healthcare. Enabling our patients with mental health difficulties to receive a truly integrated and holistic approach to their treatment, regardless of complexity or severity, thanks to the knowledge and expertise of our multidisciplinary clinical teams.&lt;/p&gt;\n&lt;p&gt;Llanarth Court Hospital is a 114 bedded forensic hospital providing a secure environment consisting of medium, low and open rehabilitation settings for men and women with mental illness and or personality disorder.&lt;/p&gt;\n&lt;p&gt;Role Description&lt;/p&gt;\n&lt;p&gt;You will beacritical member of the ward team by supporting and assisting registered Nurses in the assessment, planning and implementation of patient care. You will deliver care to the patient as prescribed by the individual care plans and liaise with family members as appropriate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Main Duties:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assists qualified staff with the assessment and implementation of individual patient care plans undertaking routine tasks and activities as directed to facilitate the wellbeing, dignity and treatment of all patients.&lt;/li&gt;\n&lt;li&gt;Provides practical support and responsive care to patients who require assistance with intimate personal needs such as dressing, bathing and toileting activities ensuring that such activities comply with procedures and the relevant healthcare legislation.&lt;/li&gt;\n&lt;li&gt;Observes and monitors the wellbeing of patients ensuring that any unusual physical, mental or emotional occurrences are promptly referred to senior staff/the primary nurse and documented as appropriate.&lt;/li&gt;\n&lt;li&gt;Provide specific interventions with patients as delegated by a Registered Nurse, and following training and competency attainment. Such interventions include Observation and Engagement with Patients, escorting patients on leave, and being involved in de-escalation and management of violence and aggression.&lt;/li&gt;\n&lt;li&gt;Contribute to a team approach to patient care in conjunction with all members of the multidisciplinary team.&lt;/li&gt;\n&lt;li&gt;Participate in regular ward meetings and attend other meetings as requested.&lt;/li&gt;\n&lt;li&gt;To assist in the maintenance of stock levels, including pharmaceutical products.&lt;/li&gt;\n&lt;li&gt;To assist in the maintenance of ward cleanliness and tidiness and adhere to infection control policy and procedures at all times.&lt;/li&gt;\n&lt;li&gt;Develops and maintains a good professional relationship with patients, colleagues and visitors responding promptly and courteously to requests and enquiries.&lt;/li&gt;\n&lt;li&gt;Help promote and maintain an environment conducive to meeting the needs of the patient / relatives and carers.&lt;/li&gt;\n&lt;li&gt;Ensure service users are gaining a quality service that is value for their money.&lt;/li&gt;\n&lt;li&gt;To receive and convey information from telephone or personal enquiries in a courteous manner and ensure all persons visiting the ward are greeted and assisted in a welcoming and supportive manner.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Knowledge/ Education/ Skills:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Educated to a minimum NVQ 1 or GCSE’s in Mathematics and English.&lt;/li&gt;\n&lt;li&gt;Understands the need for strict confidentiality&lt;/li&gt;\n&lt;li&gt;Basic IT literacy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits including&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;25 days annual leave plus bank holidays&lt;/li&gt;\n&lt;li&gt;A Group Personal Pension Plan (GPPP)&lt;/li&gt;\n&lt;li&gt;Private Medical Insurance Scheme&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Free meals while on duty&lt;/li&gt;\n&lt;li&gt;Carefirst – Employee Assistance Services&lt;/li&gt;\n&lt;li&gt;Continuous learning and development&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Career development&lt;/li&gt;\n&lt;li&gt;Personal health insurance&lt;/li&gt;\n&lt;li&gt;An employee assistance programme&lt;/li&gt;\n&lt;li&gt;Free car parking (at most sites)&lt;/li&gt;\n&lt;li&gt;Voluntary Benefits&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Division DBS info&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nr Usk, Monmouthshire", "postalCode": "NP15 2YD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7895", "longitude": "-2.89922"}}, "title": "Mental Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223776", "validThrough": "2020-11-30T23:59:59+0000"}