{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15969", "minValue": "14725", "unitText": "YEAR", "value": "£8.76 - £9.50 Per Hour"}}, "datePosted": "2020-11-05T17:16:30+0000", "description": "&lt;p&gt;Salary: £8.76 - £9.50 per hour&lt;/p&gt;\n&lt;p&gt;Hours of Work: Flexible hours to suit / as and when required&lt;/p&gt;\n&lt;p&gt;Contract Type: Bank&lt;/p&gt;\n&lt;p&gt;Benefits of Working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meals Provided, Free Parking&lt;/li&gt;\n&lt;li&gt;Enhancement for Night Shifts &amp; Bank Holidays&lt;/li&gt;\n&lt;li&gt;Company Funded DBS Check&lt;/li&gt;\n&lt;li&gt;Comprehensive Training Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Company Funded Benefits: Free DBS check&lt;/p&gt;\n&lt;p&gt;About the Role: We are looking for Bank staff to support the existing staff teams by maintaining the high standards of resident safety and care. Bank staff play a vital role of support if staffing levels reduce due to sickness, increased demand or staff shortages.&lt;/p&gt;\n&lt;p&gt;The role of a Support Worker is to enable the residents to lead a meaningful life through the implementation of a person centred support plan. You will support them to achieve their full potential through well planned support and care that you will deliver as part of a dedicated, qualified and capable staff team who put the people living here at the heart of what we do. We strive to help people remain as independent as possible and to maximise their quality of life.&lt;/p&gt;\n&lt;p&gt;The ideal candidate for this post may have experience in learning disabilities and mental health issues (however this is not essential). Within this role you will be supported to develop an understanding of, medication procedures, safeguarding policies and person centred care.&lt;/p&gt;\n&lt;p&gt;We want to attract the best people and we aim to create an environment that helps our staff to deliver high quality services and ensures they want to stay with us. To do this we provide a range of benefits and training opportunities.&lt;/p&gt;\n&lt;p&gt;If you were to join MHC, you would be a valued team member and play a key role towards leading us to the next phase of our development, sharing your experiences along the way. We very much look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;Skills: Strong communicator, creative, motivated, ability to work on own initiative, ability to cope in challenging situations, understand and support individuals to lead a good quality of life whilst achieving positive outcomes along the way.&lt;/p&gt;\n&lt;p&gt;MHC is an equal opportunities employer and positively encourages applications from all sections of the community.&lt;/p&gt;\n&lt;p&gt;How to Apply: Please complete the short application and upload your CV, alternatively for an informal discussion about this role you can contact MHC Workforce on 01824 572 020.&lt;/p&gt;\n&lt;p&gt;*Please note, successful candidates must be aged 18 or over*&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest).&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Llangwyfan", "postalCode": "LL16 4LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1846", "longitude": "-3.31823"}}, "title": "BANK SUPPORT STAFF", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258707", "validThrough": "2020-12-05T23:59:59+0000"}