{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inc"}}, "datePosted": "2020-10-21T12:46:48+0100", "description": "&lt;p&gt;With a turnover of £1.4 billion and a workforce of around 16,000, Barts Health is the largest NHS trust in the country, and one of Britain’s leading healthcare providers. The Trust’s five hospitals – St Bartholomew’s Hospital in the City, including the Barts Heart Centre, The Royal London Hospital in Whitechapel, Newham University Hospital in Plaistow, Whipps Cross University Hospital in Leytonstone and Mile End – deliver high quality compassionate care to the 2.5 million people of East London and beyond.&lt;/p&gt;\n&lt;p&gt;Recent improvements has led to a stronger focus on providing Safe and Compassionate care to our patients and this has increased opportunities available to learn, develop and expand your career. We believe that providing excellent education, training and development for our staff is essential. We offer a wide range of benefits for example access to childcare vouchers, home-electronic scheme giving you discounted prices for home –electronics, salary sacrifice for cars, season ticket loans and access to staff discount for local restaurants and gyms. So while we are improving, you can too - within a professionally challenging yet exciting environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Trauma and Rehabilitation Coordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 Hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you passionate and driven about managing trauma and orthopaedics and would like to be part of a team who thrive to deliver safe and effective orthopaedic service? If so we are looking to recruit a highly motivated, compassionate and committed nurse to join our Trauma and Orthopaedics (T&amp;O) service here at Newham University Hospital.&lt;/p&gt;\n&lt;p&gt;The T&amp;O contribute towards a safe and effective delivery of care in Barts Health Orthopaedic Center (BHOC). To achieve this, you will be expected to demonstrate knowledge and skills required for a Trauma and Rehabilitation coordinator. The Trauma &amp; Rehabilitation Coordinator role will have the responsibility to coordinate the rehabilitation needs for all trauma patients. Therapies team once made aware of a trauma patient by the Trauma &amp; Rehabilitation Coordinator will perform an assessment for the rehabilitation needs for trauma patients and will make arrangements to deliver the required rehabilitation services&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Aim of the role&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The co-ordination of the Trauma services&lt;/li&gt;\n&lt;li&gt;To comprehensively assess trauma patients, assist and co-ordinate trauma activity within the musculoskeletal specialty. Liaising with various health care professionals to ensure that each patient’s hospital episode is managed in the most effective and efficient way in line with trust strategy on nursing, midwifery and patient Centre care.&lt;/li&gt;\n&lt;li&gt;To improve the scheduling of surgery for trauma patients, reduced cancelled operations and reduce pre-operative starvation.&lt;/li&gt;\n&lt;li&gt;To assist in the data collection pertaining to these issues by means of quantitate/ qualitative audit, on-going monitoring and general feedback. Maintaining close liaison with patients, carers, and multi-disciplinary team.&lt;/li&gt;\n&lt;li&gt;To be responsible for repatriation of trauma patients including rehabilitation and ensuring coordination of all aspects of care, including rehabilitation prescription&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Candidates for this post must be a registered nurse with a minimum 5 years post registration experience, preferably 2 years at band 6 working as a Charge Nurse and fulfills KSF outline for Sister/Charge Nurse. Ideally you should have completed or are working towards completing an MSc degree and must possess teaching, assessing and mentoring qualifications. Your role will evolve through personal development and supported learning.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: ANNAMMA GEORGE, Senior Nurse for Surgery and Cancer and Pain Management Team at: annamma.george2@nhs.net or phone 02073639135&lt;/p&gt;\n&lt;p&gt;We strive to live by our WeCare values and are committed to promoting inclusion, where every staff member has a sense of belonging. We value our differences and fully advocate, cultivate and support an inclusive working environment where staff treat one another with dignity and respect. We aim to create an equitable working environment where every individual can fulfil their potential.&lt;/p&gt;\n&lt;p&gt;As an Equal Opportunities Employer we actively support applications from individuals’ who apply under the Guaranteed Interview Scheme and will process your application as appropriate.&lt;/p&gt;\n&lt;p&gt;We reserve the right to expire vacancies prior to the advertised closing date once a sufficient number of applications has been received and we regret that we are unable to provide notification if your application is unsuccessful.&lt;/p&gt;\n&lt;p&gt;After applying via NHS Jobs, your submitted application will be imported into our preferred Third party recruitment system. All subsequent information regarding your application will be generated from apps.trac.jobs.&lt;/p&gt;\n&lt;p&gt;By applying for this post you are agreeing to Barts Heath NHS Trust transferring the information contained in this application to its preferred applicant management system. If you are offered a job, information will also be transferred into the national NHS Electronic Staff Records system.&lt;/p&gt;\n&lt;p&gt;Barts Health is committed to safeguarding the welfare of children and to child protection. The Trust aims to ensure as far as is possible that anyone, paid or unpaid, who seeks to work in our organisation and who gains access to children, is safe to do so. As such, you may be required to undertake a Disclosure and Barring Check as part of the recruitment process if appointed to a post with direct access to children or vulnerable adults.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newham University Hospital, London", "postalCode": "E13 8SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": ".035418"}}, "title": "Trauma and Rehabilitation Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236452", "validThrough": "2020-11-11T23:59:59+0000"}