{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-04T11:15:12+0000", "description": "&lt;p&gt;The Programme Management Office (PMO) has an opportunity for a proactive, enthusiastic and innovative Senior PMO Support Officer to join the PMO Team; that sits within the Directorate for Strategic Planning, Performance &amp; Delivery.&lt;/p&gt;\n&lt;p&gt;The PMO provides programme management support, expertise and tools for a number of organisations across the Kirklees, Wakefield and Calderdale footprint. The PMO is one of the many mechanisms in providing assurances and robust audit trails for the CCGs, NHS England and our local key partners; specifically on the alignment of projects and programmes to the governance processes required.&lt;/p&gt;\n&lt;p&gt;The post will provide programme management expertise to teams and individuals across a number of organisations and will be responsible for supporting the Senior PMO Manager in providing assurances and meeting tight deadlines.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with a wide range of subject matter experts, project leads, senior management and clinicians, typically within multi-disciplinary or inter-disciplinary teams, to understand and support the development and delivery of the programmes.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have experience of working in a fast paced and complex environment and can demonstrate a good understanding of programme management.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Greater Huddersfield CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield", "postalCode": "HD1 2LF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.645", "longitude": "-1.78469"}}, "title": "Programme Management Office (PMO) Senior Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255548", "validThrough": "2020-11-20T23:59:59+0000"}