{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a inc. HCA"}}, "datePosted": "2020-10-30T11:31:42+0000", "description": "&lt;p&gt;We are seeking an experienced and motivated Speech and Language Therapist to be part of a large multi-disciplinary Neuro Rehab Team in Lambeth. This is a fixed-term contract to cover a nine month maternity leave.&lt;/p&gt;\n&lt;p&gt;Our service consists of Speech and Language Therapists, Physiotherapists, Occupational Therapists, Rehab Assistants, Psychologists and Social Workers and we provide short term multidisciplinary neuro rehabilitation to patients living with a long term neurological condition, such as Stroke, Parkinson’s Disease, MS, MND etc. Intervention is person centred, goal oriented and we use a self-management approach enabling patients to participate actively in their rehab. Our SLTs also provide a much needed service to non-neuro patients in the community and in Care Homes in the borough.&lt;/p&gt;\n&lt;p&gt;We are looking for a Speech and Language Therapist with&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong neuro-rehabilitation skills and experience, ideally within the community.&lt;/li&gt;\n&lt;li&gt;Experience working with a non-neuro caseload&lt;/li&gt;\n&lt;li&gt;Excellent communication skills&lt;/li&gt;\n&lt;li&gt;Enthusiasm, initiative and drive to work individually and a willingness to work as part of a team&lt;/li&gt;\n&lt;li&gt;Experience of service development, data collection and knowledge of relevant outcome measures&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This position provides an excellent opportunity for consolidation of leadership and management skills. You will work closely with a Band 7 SLT colleague within the Lambeth Neuro Rehab Team and be part of a wider SLT professional group. You will have access to regular supervision and ongoing professional development. You will be expected to supervise a Band 6 Speech and Language Therapist and be involved in leading and maintaining a high quality evidence-based service.&lt;/p&gt;\n&lt;p&gt;The post is predominantly covering the borough of Lambeth and utilises agile working to ensure that we can deliver services flexibly and effectively across the Lambeth and Southwark boroughs when needed. All staff are provided with mobile devices and work-related travel is reimbursed.&lt;/p&gt;\n&lt;p&gt;Please note you do not need to drive for this community post. If you do drive there are pool cars available or you can be reimbursed for using your own car. If you do not drive you will be expected to use public transport, your own bicycle or walk to see patients in the community.&lt;/p&gt;\n&lt;p&gt;It is an exciting time to join our team; we are enthusiastic, forward thinking and aim to put our patients at the centre of all we do.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCamilla BarberJob titleClinical Manager and Clinical Lead Speech and Language TherapistEmail addresscamilla.barber@gstt.nhs.ukTelephone number07918338904Additional contact information&lt;/p&gt;\n&lt;p&gt;Camilla Barber, NRT Clinical Manager and Clinical Lead: Camilla.barber@gstt.nhs.uk; Tel: 07918 338 904 (please note I do not work Wednesdays)&lt;/p&gt;\n&lt;p&gt;Or Ursula Braidwood, Highly Specialist SLT, Lambeth Neuro Rehab Team: Ursula.braidwood@gstt.nhs.uk; Tel: 077 878 44947.&lt;/p&gt;\n&lt;p&gt;Interview week commencing 23rd November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pulross Centre, London", "postalCode": "SW9 8AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.464", "longitude": "-.121472"}}, "title": "Highly Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249957", "validThrough": "2020-11-15T23:59:59+0000"}