{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-11-04T15:05:49+0000", "description": "&lt;p&gt;&lt;strong&gt;MID CHESHIRE HOSPITALS NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;LEIGHTON HOSPITAL &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Locum Consultant Physician in Acute Medicine (12 Months Fixed Term)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a Locum Consultant in Acute Medicine at Mid Cheshire Hospitals NHS Foundation Trust. The successful candidate will join a team of 6 WTE substantive Consultants on a fixed term basis, based at Leighton Hospital, Crewe. This post is a replacement post. The Trust has an Acute Medical Unit (32 beds) and an Ambulatory Care Unit (18 spaces) for designated GP referrals which is open from 12pm to 8pm and takes the majority of patients referred in to Medicine during daytime hours, Monday to Friday. The Acute Physician team is also responsible for a 32 bedded short stay ward to ensure continuity of acute care.&lt;/p&gt;\n&lt;p&gt;The main purpose of the role is to manage acute medical admissisions, particularly during the first 24-72 hours of admission and to ensure that interventions and investigations are initiated in a timely manner as soon as possible after the patient’s arrival.&lt;/p&gt;\n&lt;p&gt;The post-holder will participate in the General Medical Consultant on-call rota which is currently on a 1:12 basis.&lt;/p&gt;\n&lt;p&gt;The department is working with the Acute Frailty Network to develop strategies and new ways of working to manage the frail older person presenting to Acute Medicine and the Emergency department. If you are interested in getting involved with grass roots change and integrated working with community teams then we would encourage you to apply.&lt;/p&gt;\n&lt;p&gt;There are many exciting possibilities for other developmental opportunities within the department including opportunities to incorporate sub specialty interests outside of Acute Medicine.&lt;/p&gt;\n&lt;p&gt;Applicants must have full registration with the GMC including a License to Practice.&lt;/p&gt;\n&lt;p&gt;The post is offered on a full-time basis; however, the Trust would welcome discussion with individuals looking for a more flexible working pattern to support a different work life balance.&lt;/p&gt;\n&lt;p&gt;Please contact us for an informal discussion or further details:&lt;/p&gt;\n&lt;p&gt;Dr Shirley Hammersley&lt;/p&gt;\n&lt;p&gt;Consultant Acute Physician / Associate Medical Director&lt;/p&gt;\n&lt;p&gt;Tel: 01270 612092&lt;/p&gt;\n&lt;p&gt;Email: Shirley.Hammersley@mcht.nhs.uk&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Mrs Rebecca Viggars&lt;/p&gt;\n&lt;p&gt;Service Manager&lt;/p&gt;\n&lt;p&gt;Tel: 01270 273173&lt;/p&gt;\n&lt;p&gt;Email: Rebecca.Viggars@mcht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mid Cheshire Hospitals NHS Foundation Trust : Medical Resourcing", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133574"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Locum Consultant Acute Physician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256358", "validThrough": "2020-11-18T23:59:59+0000"}