{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544.00-£53,459.00 incl. Fringe HCAS"}}, "datePosted": "2020-10-30T17:49:27+0000", "description": "&lt;p&gt;An excellent opportunity has arisen for a motivated, driven and enthusiastic individual to join our Digital Desktop Services Team at Surrey &amp; Borders Partnership NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;As the Desktop Services Manager and key member of the Digital Operational Services team you will be responsible for the management and delivery of all end user devices and provision of service to support these within the Trust. The role requires driving efficiency, service improvement with the adoption of good practice and passion to ensure that every customer contact receives an excellent service. You will work with senior leaders, management, staff, relevant NHS bodies and external stakeholders to create, develop and maintain an exceptional delivery of Desktop Services. You will be required to mentor and coach other members of the digital services department aiding career development and to be the technical lead within the team. You must be a proactive leader who can think outside of the box to ensure the provision of service whilst driving excellence in the customer experience.&lt;/p&gt;\n&lt;p&gt;If you are committed professional and are looking for a new challenge in leading a great team, then we would really like to hear from you!&lt;/p&gt;\n&lt;p&gt;Surrey and Borders Partnership NHS Foundation Trust (SABP) is one of the largest Mental Health and Learning Disability Trusts in the South East working collaboratively with health, social care and voluntary organisations. We also work in partnership with university colleagues to develop research projects and funding streams. SABP’s innovative approach to learning disability and mental health care has been recognised nationally (HSJ).&lt;/p&gt;\n&lt;p&gt;Working hours 37.5 hours per week. Monday to Friday&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Shortlisted candidates will be invited to attend an assessment centre, the outcome of which will inform who will go through to interview.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leatherhead, Surrey", "postalCode": "KT22 7AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2976", "longitude": "-.335577"}}, "title": "Digital Desktop Services Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251077", "validThrough": "2020-11-18T23:59:59+0000"}