{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa based on full time hours"}}, "datePosted": "2020-10-21T08:30:17+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you passionate about Child and Adolescent Mental Health? &lt;strong&gt;Are you ready for a new and exciting challenge? Then we want to hear from you!&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*********£2,500 ‘Golden Hello’ Payment**********&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Apply now and If you are successfully recruited you will receive £2,500- &lt;em&gt;does not apply to current HIOW NHS Staff&lt;strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for looking for enthusiastic, motivated nurses to join the team at Leigh House as a charge Nurse. The successful candidate will take on the role of Team Leader alongside a primary nurse role which involves working with young people and their families ensuring you provide a high standard of person centred care. The ability to mentor, supervise and teach qualified staff and students both formally and informally will also be part of your role.&lt;/p&gt;\n&lt;p&gt;Leigh House is an acute adolescent psychiatric service, providing both residential and day care for up to 21 young people aged between 12 and 18. Set in its own grounds, Leigh House is an award winning purpose built hospital which provides a comprehensive treatment programme for young people experiencing acute mental illness, such as depression and psychotic disorders. Leigh House also has particular expertise in the management of young people suffering from anorexia nervosa.&lt;/p&gt;\n&lt;p&gt;Our ideal candidate will will possess excellent communication skills, robust theoretical and working knowledge of risk assessment and management and evidenced based clinical skills. Ultimately, you will provide effective leadership and management to staff to promote high performance standards both individually and as a team, in order to achieve the Trust’s objectives and priorities.&lt;/p&gt;\n&lt;p&gt;If you are looking to enhance and develop your professional and personnel development then this is an opportunity not to be missed!&lt;/p&gt;\n&lt;p&gt;Please click the links at the side to take a virtual tour of Leigh House and see some of the amazing work we do or we would love for you to come and see just how special Leigh House is. You can make an appointment by contacting &lt;strong&gt;Charlotte Miller, Clinical Ward Manager on 02382 310 100&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Happy to Talk Flexible Working&lt;/strong&gt; - all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester", "postalCode": "SO21 1HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0624", "longitude": "-1.28354"}}, "title": "Charge Nurse- Mental Health, Learning Disability, Children&#39;s Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235548", "validThrough": "2020-11-15T23:59:59+0000"}