{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa"}}, "datePosted": "2020-10-05T16:46:12+0100", "description": "&lt;p&gt;Are you looking for a new challenge? Then this is the role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Intensive Home Support Service (IHSS) are seeking an Advanced Clinical Practitioner who possesses confidence, enthusiasm, initiative, has a positive approach to teamwork but most importantly have a genuine passion for patient care.&lt;/p&gt;\n&lt;p&gt;IHSS are an integrated community based multi-professional team that provides person centred care and intensive support for patients in their own home.&lt;/p&gt;\n&lt;p&gt;The service manages patients who have an acute need for a period of up to 7 days with the aim to proactively manage patients’ health and wellbeing within the community, prevent the patient reaching crisis point and reduce the risk of hospital admission or readmission and expedite discharges from the front door team based at the acute hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;General Duties / Duties will include:&lt;/p&gt;\n&lt;p&gt;General duties will include proactively case managing high risk patients with chronic long term conditions and complex health and social needs to avoid unnecessary hospital admission. Working closely with an integrated neighbourhood team, primary care services and local GP practices.&lt;/p&gt;\n&lt;p&gt;You will provide history taking, advanced clinical assessment, diagnosis and prescribing for patients in their own home presenting with an acute illness or exacerbation of a long term condition.&lt;/p&gt;\n&lt;p&gt;As we are a community based service it is essential that you are a car driver with access to a vehicle for work purposes.&lt;/p&gt;\n&lt;p&gt;The working hours are 37.5 hours per week which are worked over 7 days between the hours of 08:30am until 10:00pm.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Kay&lt;/p&gt;\n&lt;p&gt;Clinical Lead&lt;/p&gt;\n&lt;p&gt;Lisa.kay@elht.nhs.uk&lt;/p&gt;\n&lt;p&gt;01282 805553&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Lancashire Hospitals Trust, East Lancashire", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Advanced Clinical Practitioner - Intensive Home Support Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213671", "validThrough": "2020-11-06T23:59:59+0000"}