{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35276", "minValue": "33989", "unitText": "YEAR", "value": "£33,989 - £35,276 per annum pro rata"}}, "datePosted": "2020-10-05T09:29:34+0100", "description": "&lt;p&gt;Nights – full time, part-time, bank. (11.5 hour shifts with a 1 hour break.)&lt;/p&gt;\n&lt;p&gt;Calling all registered and newly qualified &lt;strong&gt;nurses&lt;/strong&gt; - We would be delighted to speak to you If you’ve previously worked for the&lt;strong&gt; NHS - &lt;/strong&gt;come and join our very friendly, dedicated, high calibre night team and help us make a difference. In return, we will give you a warm welcome, all the support you need to settle in and enjoy life working at BIRU and a future full of opportunities. &lt;br /&gt;&lt;br /&gt; Please call us now on 01179 562697 to discuss our night nursing posts. You can book a time to come and meet members of the nursing team and to tour the unit and get a real feel for what it’s like to work in our unit. If you would like to apply we can interview you very quickly and get you started.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; The Frenchay Brain Injury Rehabilitation Centre is a well renowned, 52 bed established brain injury rehabilitation unit providing specialist in-patient rehabilitation for adults and adolecents (16+) with a traumatic or acquired brain injury. The service aims to provide exceptional care and rehabilitation, achieving outcomes for patients that are consistently above the national average. &lt;br /&gt; We’re looking for experienced, enthusiastic, motivated night nurses who have excellent communication skills and are committed to delivering high standards of patient care in a multi-disciplinary team. &lt;br /&gt; Qualifying in 2019 / 20?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; When you join our very friendly night team, we will offer you a comprehensive 12 month preceptorship programme which will guide and support you through making that transition from student to developing your practice further. You can find out more about this programme from Pearl Griffiths, our Head of Nursing, so please give her a ring.&lt;br /&gt;&lt;br /&gt; Looking for flexible work? &lt;br /&gt; We have regular and bank work to suit your needs and can offer flexible working patterns – including fixed nights – so you can work around other commitments. Pearl Griffiths, our Head of Nursing will be very happy to discuss.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; As a Registered Nurse (RN/ RMN/RNLD) working in our Brain Injury Rehabilitation Centre your main duties will be:- &lt;br /&gt; o To identify care needs of patients, planning and implementing nursing interventions and evaluating outcomes of care given &lt;br /&gt; o To ensure high standards of evidence based nursing care are delivered consistently &lt;br /&gt; o To administer drugs and check preparations in accordance with Company policy and NMC guidelines. &lt;br /&gt; o To communicate information accurately on patient care to the patient, families, internal and external professionals, whilst maintaining confidentiality and adhering to the principles of Information Governance &lt;br /&gt; o To report and record incident and accidents in accordance with policy and procedures &lt;br /&gt; o To assist in the induction, development and supervision of, new and junior night staff members, as required.&lt;/p&gt;\n&lt;p&gt;To join The Huntercombe Group as a Registered Nurse (RN/RMN/RNLD) you will:- &lt;br /&gt;• Hold current NMC PIN registration and adhere to the NMC Codes of Conduct at all times &lt;br /&gt;• Have a person centred ethos, showing compassion, empathy and a desire to make a difference &lt;br /&gt;• Have the ability to motivate, lead and supervise a team &lt;br /&gt;• Be able to demonstrate initiative and creativity &lt;br /&gt;• Be flexible and adaptable, well organised and able to manage time and workload effectively in line with the needs of the service &lt;br /&gt;• Have a desire to expand your professional development and support organisational change &lt;br /&gt;• Have a legal right to work in the UK&lt;/p&gt;\n&lt;p&gt;About You&lt;/p&gt;\n&lt;p&gt;In return we offer you: &lt;br /&gt;• A thorough induction programme tailored specifically to brain injury nursing &lt;br /&gt;• A commitment to your Continuing Professional Development (CPD) &lt;br /&gt;• Regular clinical supervison &lt;br /&gt;• Support for revalidation &lt;br /&gt;• Welcome Bonus of £1,000 &lt;br /&gt;• Clear pay structure, with competitive rates &lt;br /&gt;• A range of staff discounts &lt;br /&gt;• Professional support through Nurses forum &lt;br /&gt;• Access to Myfamilycare services which provides support and information at critical life events including access to experts and emergency care services &lt;br /&gt;• Employee Assistance Programme (EAP)&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; An enhanced DBS disclosure will be required for all successful applicants. Costs will be met by the Company. &lt;br /&gt; If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please apply now, we would welcome your application. &lt;br /&gt; To learn more about The Huntercombe Group please visit our website&lt;br /&gt;&lt;br /&gt; For an informal discussion or visit please contact Pearl Griffiths, Head of Nursing / Jason Tovey, Deputy Head of Nursing / Kay Staite, HR Advisor on 0117 9562697 &lt;br /&gt;&lt;br /&gt; Frenchay Brain Injury Rehabilitation Centre &lt;br /&gt; Frenchay Park Road, Bristol, BS16 1UU&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS16 1UU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4962", "longitude": "-2.5256"}}, "title": "Night Duty Senior Staff Nurse Grade 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212015", "validThrough": "2020-12-02T23:59:59+0000"}