{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17499", "minValue": "16826", "unitText": "YEAR", "value": "£10.01 - £10.41"}}, "datePosted": "2020-11-04T12:00:13+0000", "description": "&lt;p&gt;Are you looking for a part-time, fulfilling career opportunity?&lt;/p&gt;\n&lt;p&gt;We have full time and part time vacancies avaliable, and are looking to welcome someone new to our team.&lt;/p&gt;\n&lt;p&gt;The reablement team provides a life changing service to people by helping them to regain or attain as much independence as they can in their own homes.&lt;br /&gt;&lt;br /&gt;Our support workers do this by motivating and inspiring people to re-learn daily skills and enhance their quality of life.&lt;br /&gt;&lt;br /&gt;You will be fully trained to assist our service users to meet their care needs, which can range from motivational support to personal care.&lt;br /&gt;&lt;br /&gt;You will work to individualised goal plans, with the aim of encouraging service users to do these things for themselves, wherever possible. We also promote and supply tech equipment to help people.&lt;br /&gt;&lt;br /&gt;Preference will be given to candidates with experience in the care sector and we will help support you to reach your full potential by providing you with training, guidance and career development.&lt;br /&gt;&lt;br /&gt;We will assist you with gaining your Care Certificate and your Level 2 or 3 Diploma in Health and Social Care, as well as:&lt;br /&gt;&lt;br /&gt;• Generous mileage allowance of 30p per mile&lt;br /&gt;• 24 days annual leave entitlement, plus bank holidays (pro rata)&lt;br /&gt;• Membership of the Local Government Pension Scheme&lt;br /&gt;• Up to £3000 retention bonus after 3 years’ service (T&amp;C’s apply)&lt;br /&gt;• Professional career development&lt;br /&gt;• Excellent management support.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;The role involves travel across Peterborough, so you must be a car driver and have access to a vehicle.&lt;/p&gt;\n&lt;p&gt;We have 35 hour positions, 26 hour positions and 16 hour evening only positions avaliable, with 9 day fortnights on a 2 week rota.&lt;/p&gt;\n&lt;p&gt;To be considered for this role please upload your CV, or alternatively, complete an application form (found in the additional documents section) and upload this instead.&lt;/p&gt;\n&lt;p&gt;Applications will be reviewed regularly, so don&#39;t wait to apply! Please bear in mind that a full job history is required and any gaps in employment will need to be clearly explained. We look forward to hearing from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Peterborough City Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE2 8TY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5663", "longitude": "-.237346"}}, "title": "Support Worker - Reablement", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255700", "validThrough": "2020-11-30T23:59:59+0000"}