{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa pro rata"}}, "datePosted": "2020-10-22T16:16:37+0100", "description": "&lt;p&gt;&lt;strong&gt;Locum Consultant in Gynaecological Oncology - &lt;/strong&gt;&lt;span&gt;St Michael’s Hospital - &lt;/span&gt;&lt;strong&gt;10 PAs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The appointment is for a 10 PA Locum Consultant posts in Gynaecological Oncology based in the Bristol Gynaecological Cancer Centre at St Michael’s Hospital. The post is advertised to cover rising gynaecological oncology workload and to cover maternity leave.&lt;/p&gt;\n&lt;p&gt;You will join a cohesive and friendly team of 24 consultants in obstetrics and gynaecology, including 4 subspecialists in gynaecological oncology. The appointee will be an experienced gynaecological surgeon with RCOG sub specialist accreditation for gynaecological oncology. Expertise in minimal access surgery for treatment of gynaecological cancers and experience in radical surgery for ovarian cancer is essential. A demonstrable track record and commitment to research is desirable.&lt;/p&gt;\n&lt;p&gt;The Bristol Gynaecological Cancer Centre serves a population of 1.5 million and treats more than 400 new cancers per annum. The multidisciplinary team consists of 4 surgeons, 2 clinical oncologists, a medical oncologist (research lead for Bristol Haematology and Oncology Centre), 2 specialist gynaecology histopathologists, 2 radiologists, and is accredited for RCOG sub specialist training. There are close links and multidisciplinary operating lists with the colorectal and hepatobiliary teams for radical surgery. There is an emphasis on holistic care and in addition to our team of clinical nurse specialists we have a clinical psychologist and a GP specialist with interest in gynaecological cancer and palliative care as part of our MDT. Our service has received award for the best clinical team in the trust and receives high ratings in the National Cancer Patient Surveys.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Closing date for applications is Friday 6 November 2020.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Provisional date for interview will be in the week commencing 16 November 2020.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Informal enquiries to: &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Amit Patel, Lead for Gynaecological Oncology and Colposcopy&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Amit.Patel@UHBW.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Naomi Crouch, Consultant Gynaecologist and Clinical Director for Women’s Services&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Naomi.Crouch@UHBW.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Hospital for Children, Bristol", "postalCode": "BS2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4578", "longitude": "-2.5973"}}, "title": "Locum Consultant in Gynaecological Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239323", "validThrough": "2020-11-06T23:59:59+0000"}