{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-22T14:30:36+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic, flexible, and suitably qualified professional to apply for a full time Band 6 CAMHS Practitioner post within the Calderdale CAMHS team.&lt;/p&gt;\n&lt;p&gt;The successful applicant would work as part of a dynamic and supportive multi-disciplinary team which offers a range of assessment and intervention services to school-aged children. The service includes a number of different pathways, including a core mental health pathway and a neurodevelopmental assessment pathway. The team also works closely with the Crisis Service and the Eating Disorders Service who provide support across the Calderdale and Kirklees CAMHS services.&lt;/p&gt;\n&lt;p&gt;Within the core mental health pathway, the team offers a variety of therapeutic interventions for children, young people, and families who present with a broad range of emotional, social, and behavioural difficulties. The team also provides advice and consultation to professionals in relation to children’s emotional health and wellbeing.&lt;/p&gt;\n&lt;p&gt;Within the neurodevelopmental assessment pathway, diagnostic assessments are undertaken with school-aged children where there are concerns regarding Autism Spectrum Disorder or Attention Deficit Hyperactivity Disorder. Assessments may include direct observations with the child, parent interviews, psychometric assessments, and school observations.&lt;/p&gt;\n&lt;p&gt;The post holder would work autonomously and as part of a team, and may be expected to work into both the core mental health and the neurodevelopmental assessment pathways. Training and regular supervision will be provided. Relevant experience of working clinically with children, young people, and families is essential.&lt;/p&gt;\n&lt;p&gt;The team is based in Calderdale and covers a wide geographical area, therefore the post holder would be expected to have the means to travel independently across the area.&lt;/p&gt;\n&lt;p&gt;Please note the working pattern for this position is 37.5 hours per week.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Halifax", "postalCode": "HX1 1YR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7249", "longitude": "-1.86307"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238896", "validThrough": "2020-11-12T23:59:59+0000"}