{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a."}}, "datePosted": "2020-10-29T12:15:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Theatre Surgery Division (WTWA)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are excited to offer the opportunity to join Manchester Foundation Trust (MFT) as a Band 5 Anaesthetic and Recovery Practitioner to assist in continuing to shape our strategy and Trust objectives. You will be enthusiastic, motivated, flexible, pro-active and willing to learn new skills. We have a comprehensive preceptorship programme established to support you in your new role with the assistance of the dedicated education team.&lt;/p&gt;\n&lt;p&gt;If you want to be part of a multidisciplinary team who are dedicated to delivering high quality care to patients and their carers then take some time to read through what we have to offer.&lt;/p&gt;\n&lt;p&gt;We are a progressive, expanding organisation with great ambition around improving quality integrating pathways and delivering high levels of productivity.&lt;/p&gt;\n&lt;p&gt;We recruit staff that are open, honest and focused in striving for excellence, having built an enviable international reputation on our five unwavering principles for clinical excellence, research and development, teaching, learning and for treating patients with compassion, respect and dignity.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a unique opportunity to join MFT at a time when Manchester is at the forefront of healthcare redesign, developing a model of care that will help the NHS and other care providers in Greater Manchester provide quality services that are safe, accessible and sustainable for future generations. In light of these changes we are looking for a dynamic, innovative and highly motivated registered practitioner (Nurse or ODP) with excellent clinical knowledge in Scrub to join our team and take a leading role.&lt;/p&gt;\n&lt;p&gt;The health care team embraces our nursing strategy for the Trust being part of something special, which means being trustworthy, supported, recognised, respected and rewarded.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Trust Values&lt;/strong&gt;: Working Together, Dignity &amp; Care, Everyone Matters &amp; Open and Honest. Patient care is at the front of the service we deliver.&lt;/p&gt;\n&lt;p&gt;There are 5 theatre suites across Wythenshawe Trafford, Withington &amp; Altrincham (WTWA) with a total of 27 operating theatres across the directorate providing a range of specialist surgery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Acute Theatres&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There are 7 Theatres, undertaking both elective and non-elective work. We specialise in Trauma &amp; Elective Orthopaedics, Emergencies, Colorectal and Emergency Gynaecology. The department provides the hospital with excellent 24/7 cover for elective and emergency patient care.&lt;/p&gt;\n&lt;p&gt;While this position is predominantly be based in Acute Theatres there maybe some opportunity for working across WTWA as the service requires.&lt;/p&gt;\n&lt;p&gt;As we strive to provide excellent standards of care. We recognise the need to be an institute that offers talent management opportunities to develop you in both your career and education.&lt;/p&gt;\n&lt;p&gt;We are committed to training and development and will endeavor to meet individual development needs. Post-holders will also have access to the LEAD Training Programme, a unique and innovative concept to develop skillsets, which brings together all of the education and training activities of the hospital under one umbrella. There is funding for CPD courses to aid in your development in your role as a team leader within the organisation, and the opportunity to access Apprenticeships.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa WarringtonJob titleTheatre Lead Anaesthetics and RecoveryEmail addresslisa.warrington@mft.nhs.ukTelephone number01612916511Additional contact information&lt;/p&gt;\n&lt;p&gt;Matron Jane Perham- jane.perham@mft.nhs.uk 01612916509&lt;/p&gt;\n&lt;p&gt;Theatre Lead Anaesthetics and Recovery Lisa Warrington-&lt;/p&gt;\n&lt;p&gt;lisa.warrington@mft.nhs.uk 01612916511&lt;/p&gt;\n&lt;p&gt;Theatre Lead Scrub- Alexandra Elliott&lt;/p&gt;\n&lt;p&gt;alexandra.elliott@mft.nhs.uk 01612916511&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Acute Theatres, Manchester", "postalCode": "M239LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Anaesthetic and Recovery Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248280", "validThrough": "2020-11-09T23:59:59+0000"}