{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-11-04T15:00:19+0000", "description": "&lt;p&gt;Registered Mental Health Nurse&lt;/p&gt;\n&lt;p&gt;Please refer to the job description and person specification for additional information&lt;/p&gt;\n&lt;p&gt;An exciting opportunity for a current Band 6 (A4C) to join our team at Lincoln and Gainsborough OA CMHT. This post will support the Gainsborough/Lincoln City and surrounding villages.&lt;/p&gt;\n&lt;p&gt;Working 5 days a week undertaking core duty hours 9-5 with one or two allocated duty roles per month to support the service needs. Also supporting the current 7 day working DHTT model that the OA division is supporting due to COVID 19 resources.&lt;/p&gt;\n&lt;p&gt;This role requires a highly skilled practitioner to support an Older Adult Team. The team supports both Lincoln and Gainsborough and is situated at Witham Court. The team is Multidisciplinary working alongside a Bio-Psychosocial framework to deliver clinical and psychological interventions. Also supporting the Memory pathway (MAMS) and working to support those with MCI or support from our Dementia Support Services.&lt;/p&gt;\n&lt;p&gt;Essential to the role is car driver, good IT Skills, knowledge of evidence based practice, team worker, able to manage risk and safeguards and work autonomously. Sound knowledge and CPA and supportive of carers and family involvement and being recovery focused and supporting inclusivity.&lt;/p&gt;\n&lt;p&gt;Supporting and collaborating with Neighbourhood Working and closely aligned working with GP’s and practises. Partnerships working with our \\Home Treatment Teams (HTT) and transformation teams&lt;/p&gt;\n&lt;p&gt;Desirable to the role; good knowledge of physical health outcomes, 5 year forward plan and NICE guidelines for older people.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Witham Court, Fen Lane, North Hykeham", "postalCode": "LN6 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1854", "longitude": "-.575247"}}, "title": "Registered Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256323", "validThrough": "2020-11-27T23:59:59+0000"}