{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-08T13:01:34+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Liaison Psychiatry with Older Adults experience - Part-time/Full-time/ Flexible working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fantastic news - the liaison psychiatry team is expanding!&lt;/p&gt;\n&lt;p&gt;Our Liaison Psychiatry Service needs an enthusiastic and experienced Consultant Psychiatrist with experience in Older Adult Psychiatry to be part of the dynamic Liaison Psychiatry Service. &lt;br /&gt;&lt;br /&gt;You will be part of a multidisciplinary team providing support to patients within the emergency department or inpatient wards. You will be working alongside another Consultant Psychiatrist with specialist experience in Adult or Liaison Psychiatry. &lt;br /&gt;&lt;br /&gt;Our Liaison Psychiatry is undergoing a major expansion in provision and we have excellent opportunities to be part of ongoing service development.&lt;br /&gt;&lt;br /&gt;With a rise in students attending Kings’ College Hospital Medical School, you will have opportunities for medical student teaching with the benefits of Honorary Lecturer status.&lt;/p&gt;\n&lt;p&gt;It’s an exciting time to join us with a new medical school for Kent and Medway due to open and welcome its first student in 2020. The new training and research centre will attract and retain the most talented and aspiring doctors to the region and will work collaboratively with local health organisations to ensure that the programmes are aligned with local needs.&lt;/p&gt;\n&lt;p&gt;We have been rated ‘Outstanding’ by the CQC for Caring and ‘Good’ overall.&lt;/p&gt;\n&lt;p&gt;Our innovative psychiatric services within are recruiting for talented, dynamic and committed consultant psychiatrists across the county of Kent. You will play a key role in helping us deliver an outstanding service through forward thinking, innovation and providing high quality care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why join us? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We offer support for special interests&lt;/li&gt;\n&lt;li&gt;We have a highly commended research team and encourage our staff and patients to become involved in research&lt;/li&gt;\n&lt;li&gt;We encourage staff development and have an internal leadership and mentoring programme&lt;/li&gt;\n&lt;li&gt;We have teaching opportunities available with links to UK Universities and an international medical school&lt;/li&gt;\n&lt;li&gt;We offer all newly appointed consultants mentoring to support their development as leaders.&lt;/li&gt;\n&lt;li&gt;We support those wishing to engage in a role with RCPsych&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We can offer you flexible working opportunities to help you develop your research alongside our fantastic research team. You can also unlock your teaching potential at the brand new Kent Medical School.&lt;/p&gt;\n&lt;p&gt;If that wasn’t enough, we also offer up to £15k towards attracting the most talented staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location, Location, Location &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the ‘Garden of England,’ Kent is one of the best places to live and work in the UK with a rich history and excellent connections to London and Europe. We have beautiful countryside, great schools and much more!&lt;/p&gt;\n&lt;p&gt;Thinking of relocating? We offer up to £8k relocation expenses to support you in making the move to a new career with us and your new home in historic Kent.&lt;/p&gt;\n&lt;p&gt;This is a 10.5 PA + 3 percent (including on call) consultant post however part-time, flexible-working, or job sharing would be considered.&lt;br /&gt;&lt;br /&gt;Applicants should have Specialist Registration with the GMC or working towards this within 6 months of application, as well as Approved Clinician and S12 approval under the Mental Health Act. There is an associated on call commitment.&lt;br /&gt;&lt;br /&gt;The successful applicant will be required to have enhanced clearance from the Disclosure and Barring Service.&lt;/p&gt;\n&lt;p&gt;To deliver an effective service it is essential that you are able to travel between bases in a timely manner.&lt;br /&gt;&lt;br /&gt;Kent and Medway NHS and Social Care Partnership Trust is a smoke free Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;#KMPTproud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Fareedoon Ahmed&lt;br /&gt;Consultant Liaison Psychiatrist and Clinical Lead for Liaison Services&lt;br /&gt;fareedoonahmed@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Tel: 01322 428 100 x8963&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth Queen Mother Hospital, Margate", "postalCode": "CT9 4AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3781", "longitude": "1.38941"}}, "title": "Consultant Liaison Psychiatrist - Thanet", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218409", "validThrough": "2020-11-08T23:59:59+0000"}