{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata per annum"}}, "datePosted": "2020-11-04T12:02:00+0000", "description": "&lt;p&gt;If you are passionate about providing compassionate, evidence based psychological interventions and would like to be part of the exciting developments in secondary care mental health services for working age adults, we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;We are inviting applicants to the post of Senior Clinical Psychologist/ Senior Psychological Therapist with the Adult Community Treatment Team in Central Northumberland, working within the non-psychosis pathway.&lt;/p&gt;\n&lt;p&gt;The post involves providing specialist psychological assessment, individual and group interventions to service users presenting with complex mental health difficulties. You will work as an integrated member of the multi-disciplinary team supporting triage, assessment, formulation and care planning as well as providing supervision and consultation. In addition, you will also contribute to training initiatives and innovative service developments, with the aim of ensuring the delivery of high quality care that promotes recovery and wellbeing.&lt;/p&gt;\n&lt;p&gt;You will join a large, friendly and supportive team with close links to specialist services and external agencies. The team base is within beautiful central Northumberland, which is a comfortable commute from the surrounding towns and cities. The service supports professional development and staff wellbeing and you will be part of a dynamic local network of psychologists in various pathways and services, with links across the Trust and to local Universities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Danna van Niekerk&lt;/p&gt;\n&lt;p&gt;Job title: Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Email address: Danna.vanniekerk@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01670 501848&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Greenacres Centre, Ashington, Northumberland", "postalCode": "NE63 8BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.1776", "longitude": "-1.57221"}}, "title": "Senior Clinical Psychologist/Senior Psychological Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255740", "validThrough": "2020-11-18T23:59:59+0000"}