{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-27T14:47:03+0000", "description": "&lt;p&gt;&lt;span&gt;Do you feel passionate about the care delivery for children and young people with complex behavioural and mental health needs? We are looking for an energetic, highly motivated worker with previous experience of working with young people with complex behavioural and mental health needs. An exciting opportunity has arisen within the Trust to recruit a Paediatric Complex Behavioural Health Practitioner who is a non-medical prescriber at Band 7*. You will be expected to use your skills and experience to contribute to the diagnostic process for children and young people with complex behavioural issues, and to be able to suggest differential diagnoses. The Trust is progressive and innovative and is committed to supporting the needs of children and young people (CYP), listening to feedback and developing a specialist paediatric workforce. We are looking for an experienced forward thinking practitioner with a passion to lead and influence practice and deliver a high quality service. You will need to have excellent leadership skills, be highly motivated, well organised, and flexible with the ability to thrive in a dynamic and extremely busy environment. You will be responsible for demonstrating excellent clinical outcomes, safe and effective delivery of care for CYP. You will be expected to manage your caseload effectively in order to improve the experience for the CYP and their family and carers. In line with Trust’s policies and procedures; you will be able to act promptly on concerns, communicate effectively and share information appropriately within a multi-agency context where collaborative working is key. This will be a challenging and stimulating role in a very supportive team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The National Health Service is going through a period of rapid change and transformation; why not take this invitation to join our team as services move forward?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;*please note applications will be considered for band 6 nurses with experience in the complex and mental health field and wishing to complete the non-medical prescribing course.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJustine GoodwinJob titleHead of Children&#39;s, Neonatal and Young Person&#39;s ServicesEmail addressjustine.goodwin@jpaget.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact Justine Goodwin, Head of Children’s, Neonatal and Young Person’s Services Justine.goodwin@jpaget.nhs.uk, or Jo Scott, Matron – Children’s Outpatient Services joanne.scott@jpaget.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121320.jpg", "name": "James Paget University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121320"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "James Paget University Hospital, Great Yarmouth", "postalCode": "NR31 6LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5617", "longitude": "1.718"}}, "title": "Complex Behavioural Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245050", "validThrough": "2020-11-10T23:59:59+0000"}