{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-05T16:46:09+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Clinical Psychologist to join the team at Marlborough House in Swindon to cover maternity leave.&lt;/p&gt;\n&lt;p&gt;Marlborough House is a 12-bedded inpatient unit for young people experiencing significant mental health difficulties. We would welcome applications from Clinical Psychologists experienced in Child and Adolescent Mental Health Service (CAMHS) work, who are interested to join our dynamic and friendly team.&lt;/p&gt;\n&lt;p&gt;Applicants will be qualified, HCPC registered Clinical Psychologists with a track record of CAMHS work and experience of dealing with complex mental health difficulties in young people, and who demonstrate clinical leadership and supervision skills. The role involves the provision of a high quality Clinical Psychology service within the multi- disciplinary team. The post holder will be expected to provide consultation, supervision and training to team colleagues and to staff from partner agencies and will assist the team with case formulation and treatment planning. They will be expected to provide individual therapeutic interventions to young people on the Unit, and to take an active role in the provision of therapeutic groups.&lt;/p&gt;\n&lt;p&gt;We are particularly interested to hear from applicants with knowledge and experience of working with Eating Disorders, as a number of our young people will experience an Eating Disorder as part of their presentation. Knowledge and experience of using DBT and or previous experience of inpatient work would be an asset.&lt;/p&gt;\n&lt;p&gt;Supervision, training and CPD are high priorities for the Trust and there are regular professional meetings involving Clinical Psychologists working across Swindon, Wiltshire and BANES CAMHS teams. We have good links with the Bath Clinical Psychology programme.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTom WaterfieldJob titleMatronEmail addressThomas.Waterfield@OxfordHealth.NHS.UKTelephone number01865 903480&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Marlborough House Adolescent Unit, Okus Rd, Swindon SN1 4JS, Swindon", "postalCode": "SN1 4JS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5501", "longitude": "-1.79727"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258628", "validThrough": "2020-11-26T23:59:59+0000"}