{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-13T13:58:58+0100", "description": "&lt;p&gt;&lt;span&gt;In Hertfordshire Community NHS Trust (HCT) we know rehabilitation matters.  Join us now to help continue to create opportunities for our patients and staff to excel with their rehabilitation goals. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a large community therapy team across a number of localities within East and North Hertfordshire who work with a variety of different patients. We are looking for an Occupational Therapist to join our forward thinking and innovative team to continue to provide excellent rehabilitation to patients within their home environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have the opportunity to join either the Community Therapy Team working within a locality or to join the Discharge Home to Assess service (DH2A).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Community Therapy Team assess and treat patients within their own homes with the aim to enable those patients to stay at home and prevent an admission to hospital. The Discharge Home to Assess service, assess patients within the first 72 hours of discharge from hospital and provide up to 21 days rehabilitation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will work alongside occupational and physio therapists, therapy assistants, social workers, community nurses, GPs and care staff.  Staff meet regularly for professional development and peer support, you will have the opportunity to supervise and delegate tasks to junior staff and offer placements to therapy students. We have a strong clinical and professional AHP leadership team who will support your clinical development, working closely with the management team who are committed to quality improvement in our services to achieve excellent patient outcomes and patient experience.  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is full time but applicants who wish to work part time or flexibly will also be considered. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service runs 8am to 6pm Monday to Friday and 9am to 5pm at weekends so you will be expected to contribute to the weekend rota. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service covers both East and North Hertfordshire so you may be expected at times to cover across all localities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;It is essential that you hold a full valid driving licence&lt;/strong&gt; and have access to a car to use regularly for business purposes (unless you have a disability as defined by the Equality Act 2010).  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;This is an exciting time at HCT so please don’t miss the chance to join us.  Apply now.  We look forward to hearing from you.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hertfordshire Community NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East and North Herts", "postalCode": "AL6 9PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.828", "longitude": "-.222843"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224581", "validThrough": "2020-11-27T23:59:59+0000"}