{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 to £73,664 pa"}}, "datePosted": "2020-10-29T16:15:17+0000", "description": "&lt;p&gt;A new and exciting opportunity has arisen in our Medical and Surgical business units with the establishment of two new Divisional Manager posts.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working directly to the Director of Operations and within a triumvirate arrangement with the Head of Service and Chief Matron the postholder will be responsible for ensuring the provision of high quality clinical services and the delivery of strategic, financial and operational service objectives as set by the Trust Board and Executive team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working within the senior leadership team within our operational business units the postholder will need to be able to balance strategic thinking with operational delivery. They will be responsible for continually improving the quality of services to patients, redesigning services to meet best practice standards and improving efficiency and effectiveness within available resources. Working as a leading change agent within the Trust’s transformation programme the postholder will be responsible for organisational change and continuous improvement. This is at a unique time given the challenges associated with Covid-19.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Divisional Manager will need to ensure cross department / divisional working to deliver corporate and divisional objectives to ensure a seamless patient pathway is achieved.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In addition to core duties the postholder will deputise for the Director of Operations where necessary and will be accountable for the resources (people, finance and processes), delivering all performance measures and creating the right environment in which our staff can be their best.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants will need to demonstrate strong leadership and decision making skills with a commitment to delivering high quality outputs.&lt;/p&gt;\n&lt;p&gt;Excellent communication and interpersonal skills are fundamental to this post. &lt;/p&gt;\n&lt;p&gt;Successful candidates will be required to participate in an out of hours on-call rota.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Helen Routh, Director of Operations on 0191 4453006.&lt;/p&gt;\n&lt;p&gt;Closing date 12th Novbember 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview / assessment centre date 26th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121054.PNG", "name": "Gateshead Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121054"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gateshead", "postalCode": "NE9 6SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9389", "longitude": "-1.58106"}}, "title": "Surgical Divisional Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249034", "validThrough": "2020-11-12T23:59:59+0000"}