{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Bank Band 5 or 6"}}, "datePosted": "2020-10-29T16:08:32+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Bank Occupational Therapist&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Band 5 or 6&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Isle of Sheppey&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a dedicated, driven and caring Physiotherapist based in the Kent area?&lt;/span&gt;&lt;span&gt;Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every ten 10 of the people who use services would recommend them?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Bank Occupational Therapist you will receivea competitive hourly rate and NHS pension, lots of training and development, great perks including being part of theVirgin Tribe giving access to exclusive offers as well asdiscounts on Virgin products and servicesincluding Experience Days, Holidays, Media and even Gyms!All this, and flexible working patterns to help support your work/life balance. Oh, and did we mention the free tea and coffee?&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Bank Rapid Response Occupational Therapistyou will use previous experience to supply an impeccably high standard of care to local service users and will (but not limited to): &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Work in partnership with other professionals. Supporting staff, patients and carers within the Team and organisation.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Manage and prioritise own caseload, including responding to urgent referrals and occasional unpredictable work patterns, with guidance and support as needed&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Prioritise own workload, and organise and carry out own work in a manner that maintains and promotes quality&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Provide a therapy service to patients with communication and swallowing difficulties, offering assessment, diagnosis, therapeutic intervention, goal setting, review, and discharge planning.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Communicate effectively, reflecting knowledge, throughout the care of patients on your caseload.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Provide a therapy service to patients with medical, surgical and neurological conditions, offering assessment, diagnosis, therapeutic intervention, goal setting, review, and discharge planning&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Select appropriate assessment materials and approaches in line with the patients individual needs and evidence based practice&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To formulate accurate prognosis and best course of interventions, developing comprehensive treatment and discharge plans, to benefit the patient.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;strong&gt;Feel Inspired – We won Team of the Year at FTD&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;Big congratulations to the North Kent CCC team for winning the Team of the Year Award, you deserve it!This just shows what a fantastic team this is to work with! #FTDAwards&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more information, please contact Tom Noonan at Tom.Noonan@virgincare.co.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Minster on Sea", "postalCode": "ME12 3LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4156", "longitude": ".792928"}}, "title": "Bank Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249018", "validThrough": "2020-11-12T23:59:59+0000"}