{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-05T12:46:38+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Consultant in Emergency Medicine&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We don’t believe in long job adverts; instead we offer the following:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An a opportunity for a post of Emergency Medicine consultant to join a team consultant paediatricians and emergency medicine consultants;&lt;/li&gt;\n&lt;li&gt;This post attracts a Recruitment and retention premium;&lt;/li&gt;\n&lt;li&gt;Individualised job plans to ensure work life balance&lt;/li&gt;\n&lt;li&gt;Recognised research site for adult paediatric emergency medicine with paediatrics ED consultants successfully publishing at both national and international platforms;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we are looking for candidates who have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full registration with the general medical council;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;On GMC specialist register (or within 6 months on obtaining) in Emergency Medicine&lt;/li&gt;\n&lt;li&gt;Up to date ATLS, APLS, ALS&lt;/li&gt;\n&lt;li&gt;Applicants who are newly qualified or established Consultants in, Emergency Medicine, Paediatrics or paediatric Emergency Medicine;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Emergency Care at BHRUT is provided in its Emergency Departments (EDs) across two sites, Queen’s Hospital Romford and King George Hospital Ilford. By dint of their geographical locations, the departments see a broad spectrum of pathologies across both urban and rural settings. Combined patient numbers approach 250,000 and reach in excess of 170,000 type 1 patients per annum.&lt;/p&gt;\n&lt;p&gt;The present team of consultants have a keen interest in further developing the following areas of the department: Trauma, Critical Care, Education, Research and Paediatric Emergency Medicine. Our Paediatric unit underwent a transformation in 2014 and our vision is to become one of London’s leading paediatric emergency units&lt;/p&gt;\n&lt;p&gt;We aim to deliver outstanding care for our patients and provide the best working environment for our staff. As a Trust there is a lot to be excited about, we are on a journey of improvement and are extremely proud to be one of only five Trusts in the country selected to take part in the Virginia Mason Institute Programme to transform the care we provide for patients. Uniquely we are also a national Vanguard site, the only one in London, which will help spearhead transformational change in urgent and emergency care.&lt;/p&gt;\n&lt;p&gt;Please refer to our Job description and our Emergency Department “Why you should join us” guide for further information of what you can expect from us as a department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameIgnatius Postma (Naas)Job titleConsultant and Clinical Lead for Emergency MedicineEmail addressGemma.gola@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;For informal enquiries and or visits please email Dr Ignatius Postma (Naas) – Consultant and Clinical Lead for Emergency Medicine VIA Gemma Gola – gemma.gola@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ED Medical Staff, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257725", "validThrough": "2020-12-06T23:59:59+0000"}