{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 - £53,459 per annum inc. High Cost Allowan"}}, "datePosted": "2020-10-23T10:32:19+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 8a Lead Pharmacist to work in Cancer Services specialising in Haematology and Oncology. We are expecting a newly refurbished purpose -built pharmacy cancer services department to be completed in the next few months.&lt;/p&gt;\n&lt;p&gt;We are a friendly and progressive pharmacy department with a strong emphasis on training and development. The Trust is an Associated University Teaching Hospital, linked to Brighton and Sussex Medical School. Additionally we have close links with other Trusts, managing Guy’s and St Thomas’ patients in our Lane Fox Respiratory Unit and working with The Royal Surrey County Hospital in Guildford, to care for our cancer patients. Our pharmacy cancer services department forms part of the regional St Luke’s Cancer Alliance.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be a GPhC registered pharmacist with at least 5 years UK NHS post-registration hospital experience. They will also have completed their Diploma or Pharmacist Foundation Programme or equivalent and ideally be a non-medical prescriber.&lt;/p&gt;\n&lt;p&gt;Our department of 80 staff includes 40 pharmacists, twelve of whom are band 8As. This post offers an exciting opportunity for a hardworking, committed chemotherapy pharmacist to join our busy team in providing a high quality service to our patients receiving treatment for cancer. This post provides an opportunity to be involved in multidisciplinary team meetings. The post-holder will also participate in providing a clinical ward pharmacy service, providing a high level of pharmaceutical care to patients, providing and analysing relevant financial information, undertaking clinical audit and being actively involved in education and training of junior pharmacists, pre-registration pharmacists and other healthcare professionals. Our pharmacy team is committed to personal and professional growth.&lt;/p&gt;\n&lt;p&gt;Participation in weekend working rotas is expected and there is no on-call commitment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held on Wednesday 18th November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are interested in applying and would like further information then please email alice.donaghy@nhs.net or ring 01737 768511 ext 6249 or 2925.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Lead Pharmacist Cancer Services - band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240079", "validThrough": "2020-11-11T23:59:59+0000"}