{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-23T16:35:20+0100", "description": "&lt;p&gt;We are looking to recruit Band 6 Tier 2 Helpline Practitioners as part of the development of a new 24/7 Lincolnshire Mental Health Telephone Helpline for people who are experiencing mental health concerns. The helpline will consist of two tiers - Tier 1 will be staffed by appropriately trained call handlers who are able to provide a listening ear, signpost or directly transfer calls to other services, or escalate calls to tier 2; Tier 2 will be staffed by registered mental health practitioners who are responsible for providing clinical triage and assessment, and onward referral where appropriate to primary care, secondary mental health or social care services.&lt;/p&gt;\n&lt;p&gt;The post holder will also provide information, professional advice, and support to other agencies and clinical teams. You will need to demonstrate a commitment to providing a high quality standard of care, excellent communication, interpersonal and assessment skills and a positive attitude towards change with an ability to contribute to the evolving nature of our service. You will be expected to work shifts including nights&lt;br /&gt;Working base can be at either Lincoln or Grantham.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is an exciting time for LPFT, as we continue on our journey of service improvement, undergoing a range of service transformations and delivering high standards of care for our patients.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;To be successful in this role, we want to hear from Practitioners who really want to ‘make a difference’, with the Trust values at the core of patient care and who have previous experience of working with acute mental illness, or are seeking to develop a career within acute care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be joining a forward thinking Trust, where, at our most recent CQC inspection we were rated overall as ‘Good’ and given ‘outstanding’ for well led.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Lincolnshire is a large county which can offer you whatever you are looking for, in both your personal or your professional life. The county has vibrant towns and the City of Lincoln at its core, as well as idyllic rural villages, offering a high quality of life with affordable living, excellent education and social life facilities – sound interesting? All this with easy access via the A1 and A46 to Newark, Nottingham, Sheffield, Grantham, Grimsby &amp; Hull – all within an hour&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;LPFT offers an excellent benefits package, continued professional development and support, career opportunities and relocation assistance where required.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you would like to be considered for this post we look forward to hearing from you. If you require any further information please contact Hannah Darrant, Acting Team Co-ordinator Lincoln CRHT (hannah.darrant@nhs.net) or Hayley Slater, Interim Service Manager, Crisis Service and SPA (hayley.slater@nhs.net), telephone 01522 573648.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peter Hodgkinson Centre, Lincoln or Sycamore Assessment Unit, Grantham", "postalCode": "LN2 5UA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2324", "longitude": "-.516409"}}, "title": "Tier 2 Helpline Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241335", "validThrough": "2020-11-08T23:59:59+0000"}