{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110, 683 per annum"}}, "datePosted": "2020-10-27T16:45:59+0000", "description": "&lt;p&gt;The Royal Marsden is recognised world-wide for the quality of its cancer services. The Trust’s strategic aim is to achieve excellence in cancer treatment and diagnosis, through partnership and collaboration. The Royal Marsden, with its associated Institute of Cancer Research, constitutes a centre of excellence for research and development, education, treatment and care in cancer. It is acknowledged to be one of the largest comprehensive Cancer Centres in the world. The Royal Marsden serves a local, regional, national and international population from two hospital sites, Chelsea and Sutton.&lt;/p&gt;\n&lt;p&gt;This a replacement post for an existing locum consultant post to support growth in theatres. The Royal Marsden Anaesthetic and Peri-operative service (33 Consultants and 25 SpR’s/fellows/specialist Doctors) provides comprehensive support to the clinical units performing complex major surgery at the Trust. This includes Urology, Upper GI, Colorectal, Hepato-biliary, Sarcoma, Head and Neck, Breast, and Plastic and Reconstructive Surgery; as well as providing a remote service to Endoscopy, Interventional Radiology and Adult pre-assessment. Major surgery is undertaken at the Chelsea Site with paediatrics and less complex surgery occurring at the Sutton branch. The emphasis of this post is major oncology surgery and the successful candidate will be required to work across the 2 sites. They will be also required to cover interventional radiology, endoscopy and the adult pre-assessment service on an ad hoc basis. The post holder will have the opportunity to further develop in areas such as Upper GI, Colorectal, Sarcoma, Head and Neck and other complex major subspecialties.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join the general anaesthetic on call rota, covering both sites for adult emergencies, teenager and paediatric stabilisation prior to transfer to PICU.&lt;/p&gt;\n&lt;p&gt;All applicants are required to upload a copy of their CV alongside their application form.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Nathan Kasivisvanathan, Clinical Lead, via Meg Martin on tel: 020 7808 2727&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden Hospital, Chelsea", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Consultant Anaesthesia and Perioperative Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245472", "validThrough": "2020-11-24T23:59:59+0000"}