{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 per annum, pr"}}, "datePosted": "2020-11-04T16:16:37+0000", "description": "&lt;p&gt;We are currently recruiting &lt;strong&gt;Caremakers to join our WWL family&lt;/strong&gt; to work various shift patterns including evenings, nights, weekends and bank holidays across our 4 hospital and community sites.&lt;/p&gt;\n&lt;p&gt;The Caremaker roles will require you to work in areas which may include those that are designated as positive, asymptomatic and negative COVID wards.&lt;/p&gt;\n&lt;p&gt;To be &lt;strong&gt;part of our team&lt;/strong&gt;, and whilst not essential to the job role, we would welcome applications from candidates who can &lt;strong&gt;demonstrate our Trust behaviours&lt;/strong&gt; and who may have &lt;strong&gt;experience of caring&lt;/strong&gt; for a relative or close friend.&lt;/p&gt;\n&lt;p&gt;To enable your&lt;strong&gt; application to be fast tracked&lt;/strong&gt;, please use the &lt;strong&gt;supporting information&lt;/strong&gt; to demonstrate how you meet the person specification and demonstrate your caring skills and attributes.&lt;/p&gt;\n&lt;p&gt;Following a successful telephone interview and conditional offer, the Trust will&lt;strong&gt; train and support you with a 4 day Caremaker course&lt;/strong&gt; with the first of these taking place week commencing 19 November 2020.&lt;/p&gt;\n&lt;p&gt;Our dedicated Recruitment Team work with you to &lt;strong&gt;complete your identity, criminal record, qualification and work health assessment checks&lt;/strong&gt; to enable you to onboard with us &lt;strong&gt;as soon as practicably possible.&lt;/strong&gt; To do this you will be required to present a range of photographic and other documents e.g. passport, driving licence, bank statements and for you to request full immunisation history obtainable from your G.P.&lt;/p&gt;\n&lt;p&gt;We look forward to receivng your application and &lt;strong&gt;please check your junk/spam folders&lt;/strong&gt; for emails from TRAC regularly and be able to respond to these promptly!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Nichola Monaghan&lt;br /&gt;Job title: Head of Professional Practice&lt;br /&gt;Telephone number: 01942 822238&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wrightington, Wigan and Leigh NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "All Trust Sites, All Trust Sites", "postalCode": "WN1 2NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5576", "longitude": "-2.62953"}}, "title": "Care Maker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256606", "validThrough": "2020-11-08T23:59:59+0000"}