{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-23T14:51:36+0100", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Pathway Project Manager&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;This is an exciting opportunity to join an innovative and dynamic team responsible for transforming cancer services across Surrey and Sussex. The Surrey and Sussex Cancer Alliance is a partnership that brings together leaders from different hospital trusts and other health and social organisation and covers a population of approx. 3.1 million people. Our aim is to improve the diagnosis and treatment and care outcomes for cancer patients in Surrey and Sussex.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and experienced project manager to take forward the Surrey and Sussex cancer transformation programme. Working within the alliance team, you will provide direct support to one of our seven high priority pathway groups. You will develop an excellent relationship with the pathway clinical leadership and multi-disciplinary teams across the region to enable delivery of priority projects specific to your cancer group.&lt;/p&gt;\n&lt;p&gt;The alliance is currently finalising its Rapid Diagnositic Service strategy and Cancer Outcomes improvement approach and you will play an instrumental part in pathway re-design.&lt;/p&gt;\n&lt;p&gt;The successful candidate will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work collaboratively across Surrey and Sussex and other referring regions to deliver safe, effective and timely access to diagnostics and treatments across a tumour site&lt;/li&gt;\n&lt;li&gt;Drive improvements in delivery of the cancer waiting times standard, focusing on those patients who transfer between local hospitals to tertiary hospital services&lt;/li&gt;\n&lt;li&gt;Improve cancer patients&#39; experience and quality of life through the delivery of excellence in clinical care, research, and education&lt;/li&gt;\n&lt;li&gt;Support the Clinical Leads in setting standards and providing quality assurance of cancer services across the Surrey and Sussex system to reduce variation.&lt;/li&gt;\n&lt;li&gt;Support the implementation of integrated services and pathways and pathway specific Rapid Diagnostic Services locally through collaborative work across the Surrey and Sussex system and promote a sense of collective responsibility across partners&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Alliance offices are based in Guildford, with travel when necessary across Surrey and Sussex. Flexible working and secondments will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information or to arrange an informal discussion, please contact Tom Pugh on t.pugh1@nhs.net &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Pathway Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241009", "validThrough": "2020-11-08T23:59:59+0000"}