{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-10-21T14:15:28+0100", "description": "&lt;p&gt;The Service for adults with ADHD &amp; Autism operates across the Trust localities of Wakefield, Kirklees, Barnsley and Calderdale and in addition, on a spot purchasing basis across the North of England.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a secretary who has proven secretarial skills and the ability to work autonomously in prioritising and organising a busy workload. The successful candidate must be fully computer literate in Microsoft Office and be able to communicate both verbally and in writing at a high level. A Typing/Word Processing qualification to RSA III or equivalent is essential.&lt;/p&gt;\n&lt;p&gt;The postholder will provide full administrative and secretarial support to clinicians from multi-disciplinary professions including, audio typing clinical reports, allocating diary appointments and input on electronic record keeping systems. You will also have an essential role in being the first point of contact for service users and others who telephone and attend appointments with our Service. A positive and friendly approach to dealing with members of the public and colleagues is essential.&lt;/p&gt;\n&lt;p&gt;Our Team base is in Wakefield, or other trust locality depending on service need. You will be working alongside experienced secretarial colleagues. A flexible attitude to supporting the work of others and working as part of a team is required.&lt;/p&gt;\n&lt;p&gt;The Service for adults with ADHD &amp; Autism has received the prestigious ACOMHS accreditation awarded by the Royal College of Psychiatrists. Such accreditation assures staff, service users and carers, commissioners and regulators of the quality of the Service provided. We are the first Team working with people with adult neurodevelopmental disorders ever to receive it.&lt;/p&gt;\n&lt;p&gt;In return for your skills and experience, we can offer a friendly and supportive working environment with opportunities for development.&lt;/p&gt;\n&lt;p&gt;The position is 37.5 hours per week Monday to Friday.&lt;/p&gt;\n&lt;p&gt;For further information/informal queries, please contact:&lt;/p&gt;\n&lt;p&gt;Emma Pell, Team Manager or Lynn Loring, Administrative supervisor on 01924 316492&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 5PN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6705", "longitude": "-1.48941"}}, "title": "Administrative Officer/Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236774", "validThrough": "2020-11-12T23:59:59+0000"}