{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32234", "minValue": "21748", "unitText": "YEAR", "value": "£21,748 to £32,234 Per Year"}}, "datePosted": "2020-10-30T15:57:17+0000", "description": "&lt;p&gt;The Financial Assessment and Benefits Team (FAB Team) are looking for enthusiastic individual to join the team and complete financial assessments and offer welfare benefits advice and assistance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an Entitlement and Assessment Officer in the FAB Team, you will be telephoning and visiting Adult Social Care service users to explain our chargingpoliciesand offer welfare benefits advice.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;This will include assisting service users with benefit claims and following-up on benefit applications, working closely with the Department for Work and Pensions.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;You will contribute towards meeting team deadlines and targets and have the opportunity to work closely with other services within the Council and with external organisations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Specific experience isn’t important to us, we’re happy to consider applications from different professional backgrounds.&lt;br /&gt;&lt;br /&gt;You’ll need to have good interpersonal and numeracy skills but most of all we’re looking for someone that can join our team to help make a difference to our service users.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Benefits available to RBC employees include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Generous holiday entitlement - 24 days holiday each year plus bank holidays - rising to 32 days after 10 years&#39; service, with the option to buy additional leave&lt;/li&gt;\n&lt;li&gt;A wide range of flexible working opportunities&lt;/li&gt;\n&lt;li&gt;Access to a range of training and learning opportunities to help you develop&lt;/li&gt;\n&lt;li&gt;Local Government Pension Scheme(LGPS)&lt;/li&gt;\n&lt;li&gt;On-site day nursery (Kennet Day nursery) rated outstanding by Ofsted, and a salary sacrifice scheme to help lower the cost of your nursery fees&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion about this post, please contact Tracey Maskell &lt;strong&gt;or Abigail Moore&lt;/strong&gt; (fab.team@reading.gov.uk).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: Monday 9th November2020&lt;/p&gt;\n&lt;p&gt;Interview date: TBC&lt;strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;Please note that the closing date is given as a guide. We reserve the right to close this vacancy once a sufficient number of applications has been received. Therefore, it is strongly advised that you complete and return your application as soon as possible to avoid disappointment.&lt;br /&gt;&lt;br /&gt;Reading Borough Council is a Disability Confident Employer and is committed to the recruitment and continued employment of people with disabilities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "READING BOROUGH COUNCIL", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129521"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 2LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4528", "longitude": "-.973573"}}, "title": "Entitlement and Assessment Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250847", "validThrough": "2020-11-09T23:59:59+0000"}