{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-26T11:31:13+0000", "description": "&lt;p&gt;The Royal Marsden NHS Foundation Trust has an international reputation for high quality patient care, education and research. Its partnership with the Institute of Cancer Research has created the largest comprehensive cancer centre in Europe and is the only institution to be designated a National Biomedical Research Centre for Cancer.&lt;/p&gt;\n&lt;p&gt;Applications are invited for a Consultant Clinical Oncologist to join the Breast Unit multidisciplinary team at The Royal Marsden NHS Foundation Trust. The Royal Marsden Breast Unit is one of the UK’s most comprehensive breast providers with well-established services at both secondary and tertiary levels.&lt;/p&gt;\n&lt;p&gt;This is a part time 6 PA post with emphasis on the management of patients from the Croydon University Hospital Breast MDT and the delivery of radiotherapy and systemic therapy (along with medical oncology colleagues) at the Royal Marsden, based at the Sutton site. The post holder will make a major contribution to the Unit’s programmes of research including the development and implementation of new radiotherapy techniques as well as support for current and future clinical trials in this area. An additional 1PA is offered to applicants to lead the MSCC pathway and to develop further the spinal SBRT service.&lt;/p&gt;\n&lt;p&gt;Applicants should be eligible for full registration with the General Medical Council and have Fellowship of the Royal College of Radiologists or hold equivalent qualifications. Applicants will have or be within 6 months of obtaining their CCT or equivalent.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Susan Lalondrelle, Lead for Lead for Clinical Oncology, Susan.lalondrelle@rmh.nhs.uk, 0208 661 3272&lt;/p&gt;\n&lt;p&gt;Dr Imogen Locke, Clinical Oncology Consultant (Breast Unit)&lt;/p&gt;\n&lt;p&gt;Tel: 0208 661 3169&lt;/p&gt;\n&lt;p&gt;Email: Imogen.Locke@rmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Heather Spurgeon, Clinical Business Unit Manager, The Royal Marsden,&lt;/p&gt;\n&lt;p&gt;Tel: 0207 808 2023&lt;/p&gt;\n&lt;p&gt;Email: heather.spurgeon@rmh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden NHS Foundation Trust, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Consultant Clinical Oncologist -Breast Cancer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242221", "validThrough": "2020-11-22T23:59:59+0000"}