{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 pro rata per annum"}}, "datePosted": "2020-11-06T15:46:12+0000", "description": "&lt;p&gt;Warwick House Medical Centre&lt;/p&gt;\n&lt;p&gt;Are you looking for a salaried GP position in a well-established, supportive, innovative training practice? Do you enjoy outdoor life, culture, history and value your work-life balance? Here is an excellent opportunity to join our team and discover the beautiful county of Somerset.&lt;/p&gt;\n&lt;p&gt;Warwick House Medical Practice is situated in Taunton, the county town of Somerset. Our practice cares for just over 7,400 patients, covering an urban and semi-rural population. Our size allows us to be flexible and to innovate and adapt whilst valuing a supportive and open culture amongst our staff. We are continually looking to improve the patient experience and place a strong emphasis on high quality &#39;family&#39; practice.&lt;/p&gt;\n&lt;p&gt;In 2017 we entered into partnership with Taunton and Somerset NHS Trust (Now Somerset NHS Foundation Trust). We have an expanding and friendly team of clinical and administrative staff, all of whom are employed by the Trust as part of the Primary Care Service. Our practice is an active participant in the local Primary Care Network.&lt;/p&gt;\n&lt;p&gt;Clinical care is delivered by our 5 salaried GP partners, 1 salaried GP, 1 ANP, 3 Practice Nurses, 1 HCA and 1 phlebotomist. We are ably supported by our team of allied health professionals which includes an Advanced Clinical Pharmacist, Advanced Paramedic, FCP Musculo-Skeletal Practitioner and Mental Health Workers.&lt;/p&gt;\n&lt;p&gt;We are paper-light: EMIS Web, workflow management, digital dictation, e-referrals.&lt;/p&gt;\n&lt;p&gt;With the retirement of one of our GP partners, we are looking for a part-time salaried GP to provide 6 sessions. You will have flexibility in delivering these sessions and potential opportunities to work elsewhere in the Trust. We would welcome dynamic and innovative individuals as there are opportunities to further develop new models of care within the Practice and wider Directorate and to potentially become a GP trainer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About the Trust &lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Somerset NHS Foundation Trust is the first NHS trust on the English mainland to provide community, mental health and acute hospital services. We work with health and social care partners in Somerset to ensure that we deliver outstanding services that meet the needs of our population.&lt;/p&gt;\n&lt;p&gt;Our trust was formed on 1 April 2020 when Somerset Partnership NHS Foundation Trust and Taunton and Somerset NHS Foundation Trust merged. We provide community and mental health services across the whole of Somerset and acute hospital services in the north, west and centre of the county and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Straddled between areas of outstanding natural beauty and the idyllic rolling hills of Exmoor, featuring national hotspots for cycling, surfing, and climbing such as Cheddar Gorge, there’s plenty to keep you occupied alongside the abundance of music festivals and local traditions. Somerset offers you the chance to live near some of the UK’s most desirable locations; from the beaches in North Devon and Cornwall, to the cosmopolitan centres of Bristol, Bath and Exeter, whilst also being less than 2 hours from London. The County town of Taunton has diverse shopping, restaurants, and regularly hosts international music and sporting fixtures.&lt;/p&gt;\n&lt;p&gt;The South West of England is a highly desirable place to live. Compared to other regions, house prices in the area are quite reasonable. Rural properties in many of the pretty villages in South Somerset and North Dorset are within easy commute to the hospital. Many properties have land or large gardens attached.&lt;/p&gt;\n&lt;p&gt;If you’ve got family commitments, or are looking to settle down, Somerset offers some of the best schools in the country ranging from Public institutions such as Millfield, Queens College, Taunton School, Kings College, Wellington, and Blundell’s, to award winning state schools such as Richard Huish College which has been ranked in the top 10 of A-level providers nationally for the last eight years, through to secondary’s ranking in the top 5% nationally such as The Castle school in Taunton.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information:&lt;/p&gt;\n&lt;p&gt;If you are interested in finding out more about us please contact our Operational Manager, Sian Mara, on 01823 447373 or &lt;strong&gt;sian.mara@nhs.net&lt;/strong&gt; . Informal visits are very welcome.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the application process for this role please contact Jordan Pollard, Medical Recruitment Consultant on 07765898212 or Jordan.Pollard@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warwick House Medical Centre, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Salaried General Practitioner - Warwick House Medical Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260431", "validThrough": "2020-12-03T23:59:59+0000"}