{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-30T12:00:41+0000", "description": "&lt;p&gt;The Walton Centre NHS Foundation Trust currently has an exciting opportunity for an experienced and highly motivated Procurement professional to join the team as a fixed term Materials Management Team Leader please note that secondments will be considered.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work closely with the E Procurement &amp; Materials Manager as part of the Procurement team and across the organisation to develop and maintain close working relationships with a wide range of stakeholders to help ensure current processes are adhered to and to drive efficiencies throughout the Trust.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be educated to GCSE level, with good communication &amp; computer skills. The successful candidate would preferably be experienced within a NHS Materials Management role with supervisory experience.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for all aspects of the Materials Management service and Materials Management team and the trusts receipt and distribution of PPE as well as inputs to the national stock systems.&lt;/p&gt;\n&lt;p&gt;The post holder will support in the delivery of the Trust procurement strategy and any current/ upcoming national Procurement agendas, as well as deputising for the E Procurement &amp; Materials Manager as and when required.&lt;/p&gt;\n&lt;p&gt;If you have the relevant skills, abilities and experiences that this post demands and you are ready for a challenge, we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;Please note this position may close when a satisfactory number of applicants have been received. Shortlisting and interviews to be held within 10 days of closing date.&lt;/p&gt;\n&lt;p&gt;For more information or an informal discussion, please contact Peter Barnes, E Procurement &amp; Materials Manager on 07725728329 or e-mail Peter.Barnes@thewaltoncentre.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120725.JPG", "name": "Walton Centre NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120725"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L9 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4665", "longitude": "-2.93093"}}, "title": "Materials Management Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250066", "validThrough": "2020-11-13T23:59:59+0000"}