{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-08T12:30:45+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Medical Microbiology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a Consultant in Medical Microbiology at Mid Cheshire Hospitals NHS Foundation Trust. The Pathology Services for MCHFT and ECT have combined under a single management structure, administered through MCHFT. The successful candidate will join a team of 2 Consultants, an HSST Clinical Scientist and a STP Clinical Scientist trainee and will be based at Macclesfield Hospital within Pathology Services providing a Clinical Microbiology and Infection Control Service to East Cheshire Trust (ECT) and Mid Cheshire Hospitals Foundation Trust (MCHFT), including on call.&lt;/p&gt;\n&lt;p&gt;There are shared rotas in place for clinical calls, laboratory duties / report validation, out of hours on calls and team job planning between the 3 Consultant Microbiologists (this post based at ECT and 2 consultants at MCHFT).&lt;/p&gt;\n&lt;p&gt;The laboratory is UKAS accredited and provides a comprehensive range of Bacteriology, Serology, Mycology and molecular testing for Chlamydia.&lt;/p&gt;\n&lt;p&gt;The University Hospital of North Midlands, Mid Cheshire and East Cheshire NHS Trusts are working collaboratively to form a Pathology network in line with a NHSI directive. The University of North Midlands will be the lead provider of The North Midlands and Cheshire Pathology Services, which will go live on 1st December 2020, and will employ all staff within the service; including this post. Staff employed by MCHFT prior to 1st December will TUPE to UHNM on this date.&lt;/p&gt;\n&lt;p&gt;There are exciting new technological developments already in progress for the new Microbiology laboratory for the North Midlands and Cheshire Pathology service, which will be sited at UHNM. These new developments will bring state-of –the-art Microbiology diagnostic service to the areas covered by the service. The turnaround time for tests will reduce greatly and will positively impact on patient management.&lt;/p&gt;\n&lt;p&gt;The laboratory will be a very modern highly automated laboratory with bioMérieux WASPLab® with most of components such as smart incubators etc, 2 x VITEK® MS for identification, 3 x Vitek 2 instruments for susceptibility testing, 4 x BACT/ALERT® VIRTUO® systems for blood culture incubation and others. The enteric work will primarily move to BD Max PCR machine. Work is also underway for the new LIMS system across the three Trusts which will be upgraded to Winpath Enterprise and will be linked up to the Hub Laboratory.&lt;/p&gt;\n&lt;p&gt;The new laboratory, along with the new LIMS system, will be operational by September 2021.&lt;/p&gt;\n&lt;p&gt;Applicants must have full registration with the GMC including a License to Practice, and be on the Specialist Register (or be within six months of obtaining their Certificate of Completion of Training). Candidates with dual training (ID/ Microbiology) are encouraged to apply.&lt;/p&gt;\n&lt;p&gt;The posts are offered on a full-time basis; however, the Trust would welcome discussion with individuals looking for a more flexible working pattern to support a different work life balance.&lt;/p&gt;\n&lt;p&gt;For an informal discussion and further details please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Stavroula Panagea Consultant Medical Microbiologist, Clinical Lead Microbiology&lt;/p&gt;\n&lt;p&gt;Mid Cheshire hospitals NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;email: Vicky.panagea@mcht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Direct line: 01270 273713&lt;/p&gt;\n&lt;p&gt;Microbiology secretary: 01625 661832&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Elijah Matovu&lt;/p&gt;\n&lt;p&gt;Consultant Medical Microbiologist and Infection Prevention Doctor&lt;/p&gt;\n&lt;p&gt;Mid Cheshire hospitals NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;email: Elijah.matovu@mcht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Direct line: 01270273683&lt;/p&gt;\n&lt;p&gt;Microbiology Secretary: 01625661832&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mrs Sarah Robinson&lt;/p&gt;\n&lt;p&gt;Consultant Clinical Scientist, Clinical Lead for Biochemistry, Clinical Director for Pathology&lt;/p&gt;\n&lt;p&gt;Mid Cheshire Hospitals NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;email: sarah.robinson@mcht.nhs.ukDirect line: 01270 612376&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Shortlisted candidates will be expected to visit the department prior to interview&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mid Cheshire Hospitals NHS Foundation Trust : Medical Resourcing", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133574"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Consultant Medical Microbiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218288", "validThrough": "2020-11-07T23:59:59+0000"}