{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-25T13:00:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 3 Assistant Patient Pathway Coordinator (CAT Team 2 - Ophthalmology)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an Assistant Patient Pathway Coordinator (APPC) to join our Clinical Administration Team in The Ophthalmology Department.&lt;/p&gt;\n&lt;p&gt;We are looking for a candidate who can provide support to clinical and non-clinical staff.&lt;/p&gt;\n&lt;p&gt;You will be a point of contact for administrative issues relating to patients&#39; pathway of care, working as part of a multi-disciplinary team and will provide expertise in the proactive management of the patient pathway from referral to discharge, ensuring the entire pathway is managed smoothly.&lt;/p&gt;\n&lt;p&gt;You will ensure high levels of patient and clinician satisfaction by being an accessible, customer-focused and knowledgeable point of contact. You will provide a consistent approach across the Trust, using Standard Operating Procedures (SOPs) to ensure that functions of the role are carried out correctly within given timescales.&lt;/p&gt;\n&lt;p&gt;You will provide a consistent approach across the Trust, using Standard Operating Procedures (SOPs) to ensure that functions of the role are carried out correctly within given timescales.&lt;/p&gt;\n&lt;p&gt;The Ophthalmology team is committed to providing our colleagues with a positive experience assisting them to build fulfilling and rewarding careers.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the Ophthalmology Department as we move towards more digital ways of working, including virtual clinics and assessment.&lt;/p&gt;\n&lt;p&gt;We are also able to offer flexibility in working from either of the 2 main Ophthalmology hubs at Reading and Windsor, as well as working from home on rotation.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gary Morgan (Patient Pathway Manager) on 0118 322 7884 or 07909 906337 or gary.morgan@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Assistant Patient Pathway Coordinator (CAT 2 - Ophthalmology)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241586", "validThrough": "2020-11-07T23:59:59+0000"}