{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa plus HCAS"}}, "datePosted": "2020-11-04T13:46:15+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Sutton Uplift is a primary care mental health and wellbeing services (IAPT) which aims to provide support to people living within across Sutton or those with a Sutton GP.&lt;/p&gt;\n&lt;p&gt;As a service, we aim to deliver a range of evidence-based psychological interventions to people with common mental health problems within a stepped care model. Sutton Uplift is professionally managed by a Consultant Clinical Psychologist and operationally led by a Clinical Manager. The teams consist of qualified Clinical and Counselling Psychologists, CBT Therapists, IAPT High Intensity Trainees, Graduate Mental Health Worker’s and Psychological Wellbeing Practitioners (PWPs) who provide evidence-based psychological interventions in line with NICE guidance&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit &lt;strong&gt;1&lt;/strong&gt; experienced Employment Adviser who may have worked in an IAPT Service previously or who has worked with people with mental health problems or other disadvantaged groups in supporting them back to work to add to the team of Employment Advisers already in post.&lt;/p&gt;\n&lt;p&gt;The Employment Advisers programme is a 3 year initiative through NHS England which aims to ensure that people get timely access to health support for common mental health problems and integrated employment support so that they avoid long-term unemployment. We are a Wave 2 site. &lt;br /&gt;&lt;br /&gt;The principle aim of the IAPT Employment Advisor Initiative is to create a culture of prevention and early intervention, to make sure that people get timely access to health support and suitable employment support so that they avoid long term unemployment. The integrated Employment Advisor service promotes the link between being in work and achieving improved health outcomes.&lt;/p&gt;\n&lt;p&gt;The post holders will have a manageable caseload and will offer a support service to individuals with common mental health problems to gain, return to or retain their employment based on evidenced based practice.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to undertake the EA in IAPT Training course run by Liverpool John Moore’s University.&lt;/p&gt;\n&lt;p&gt;The successful post holders will be expected to work flexibly in accordance with the extended service hours for Sutton.&lt;/p&gt;\n&lt;p&gt;The role will involve working directly with Jobcentre Plus, employers, trade unions and employment agencies to keep people in employment and secure employment opportunities. You will also support them in making decisions about their current and future career plans.&lt;/p&gt;\n&lt;p&gt;We are seeking to employ highly motivated, dynamic individuals who have significant experience in helping individuals to stay in work or find employment. It is desirable that applicants have experience of working with people who have mental health issues.&lt;/p&gt;\n&lt;p&gt;We are seeking individuals who relish the opportunity to work with diverse communities and contribute to positive community development in mental health. We are particularly excited about the opportunity to develop culturally sensitive services, and have a strong track record in innovative practice.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStephen CharleryJob titleLead Senior Employment AdviserEmail addressStephen.Charlery@swlstg-tr.nhs.ukTelephone number07870 846291Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jubilee East Health Centre, Surrey", "postalCode": "SM60EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3574", "longitude": "-.150294"}}, "title": "Employment Specialist - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256061", "validThrough": "2020-11-11T23:59:59+0000"}