{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-05T14:18:51+0000", "description": "&lt;p&gt;We are looking for motivated, enthusiastic, forward thinking and patient-centred individuals to join our excellent nursing team in Llandrindod Wells Hospital. We are looking for nurses that are able to work well as part of a multi-disciplinary team, are caring and kind and who wish to develop their clinical and leadership skills. You will be expected to work as an autonomous practitioner with the support of the ward manager and senior nursing and therapies staff. We have permanent roles to offer on a full time and part time basis.&lt;br /&gt;&lt;br /&gt;Claerwen Ward is an active 21 bed general medical and rehabilitation ward. We are a motivated team that provide the highest level of nursing care to patients from across Powys. The provision of care can include palliative care, rehabilitation, management of acute illness and day case management such as blood transfusions. We aim to provide pro-active discharge planning in order to aid patient flow from the community setting and District General Hospital transfers. &lt;br /&gt;&lt;br /&gt;We are a forward thinking and innovative health board and as a result we have won awards for innovation. The highest priority for our Health Board is to continue to improve the quality of care we provide for our patients. You will find Powys offers everything you need for true fulfilment, both professionally and personally.&lt;/p&gt;\n&lt;p&gt;To find out more about working for Powys Teaching Health Board please visit our Web site - working for us page, where you will find staff testimonials, benefits, information about the health board and our values framework.&lt;/p&gt;\n&lt;p&gt;Applications from newly qualified staff or staff awaiting registration welcomed.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh applicants are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sister Marie Berriman&lt;br /&gt;Ward manager&lt;br /&gt;Phone: 01597 828 732/731&lt;br /&gt;E-mail: dawn.berriman@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123203.jpg", "name": "Powys Teaching Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123203"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Llandrindod Wells Hospital, Llandrindod Wells", "postalCode": "LD1 5HF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2421", "longitude": "-3.37742"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258097", "validThrough": "2020-11-19T23:59:59+0000"}