{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 Per annum"}}, "datePosted": "2020-10-28T08:16:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Post: Divisional General Manager – Family Health Division &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Remuneration: Band 9&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Full time 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Nottingham University Hospitals NHS Trust (NUH) has an excellent national and international reputation for the quality of our patient care and for our research, education and innovation. As a first wave Integrated Care System, our role in the wider health and social care economy is evolving as we seek to work with partners to meet increasing demands and to effect sustainable system change. We are an ambitious organisation striving to think differently about how we integrate services in order to deliver safe, high quality and effective care that is sustainable for the future health and wellbeing of our populations.&lt;/p&gt;\n&lt;p&gt;We are, by any measure, a large, complex, person-centred organisation. With around 16,000 employees from a wide range of professional backgrounds, we are one of the region’s largest employers. Based on three sites with 90 wards and 1,700 beds we have an annual income of £1.1 billion. Our vision is “to be outstanding in health outcomes and patient and staff experience”. We are a successful and progressive organisation; absolutely committed to our values and to working in partnership with stakeholders in our system to deliver new models of care that meet our populations’ future health and care needs and improve their wellbeing.&lt;/p&gt;\n&lt;p&gt;To support achievement of our objectives, we are looking for a highly performing Divisional General Manager to provide operational and strategic leadership to the Family Health Division to ensure that all operational performance and financial targets are achieved.&lt;/p&gt;\n&lt;p&gt;A senior leader with significant experience within the Healthcare sector, you will work with your Divisional Leadership Team, Trust Senior Management Team and other Divisional teams to ensure optimal performance and service integration. You will contribute to the development of services in your Division and the wider Nottinghamshire health and social care system.&lt;/p&gt;\n&lt;p&gt;You will be future focused, leading the development of the division&#39;s strategic and annual plans, on behalf of the Divisional Director, to support achievement of required local and national performance targets and the delivery of excellent patient care. Drawing on your proven track record of achieving challenging healthcare targets, you will also have accountability for leading service improvement for the Division, encouraging staff contribution to innovation and tracking delivery of efficiency benefits.&lt;/p&gt;\n&lt;p&gt;And it&#39;s not just about what you do; it&#39;s how you do it:&lt;/p&gt;\n&lt;p&gt;You will have highly developed leadership skills, be able to build successful teams and work collaboratively. You will be business focused, sensitive to clinical and political demands with the ability to cut through barriers to change. Able to analyse data you will be confident of articulating business cases and presenting arguments for change.&lt;/p&gt;\n&lt;p&gt;You will be an exemplar for the Trust&#39;s Values and Behaviours.&lt;/p&gt;\n&lt;p&gt;Informal conversation encouraged.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For an informal discussion regarding the role, please contact Lisa Kelly, Chief Operating Officer at Lisa.Kelly@nuh.nhs.uk, or telephone, 07812 268 793 or 0115 9249924 Ext. 80241&lt;/p&gt;\n&lt;p&gt;or Dr Emma Fillmore, Divisional Director of Family Health, at Emma.Fillmore@nuh.nhs.uk or telephone, 07812 268 638&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "QMC Campus, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Divisional General Manager - Family Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245722", "validThrough": "2020-11-15T23:59:59+0000"}