{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum (pro rata)"}}, "datePosted": "2020-10-27T13:16:02+0000", "description": "&lt;p&gt;&lt;strong&gt;Learning Disabilities Highly Specialist Physiotherapist - Band 7 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a qualified highly specialist physiotherapist like you to join our specialist physiotherapy team providing services to the Adult Learning Disability population in Birmingham.&lt;/p&gt;\n&lt;p&gt;You will provide a clinical highly specialist role in the Community Learning Disabilities Team providing a citywide service for adults with learning disabilities registered with Birmingham GP practices. You will act as deputy to the Clinical Lead Physiotherapist and be responsible for clinical support and delivery of the Citywide LD physiotherapy team, including: Leading on clinical diagnosis, assessment and on-going physiotherapeutic management of adults with learning and physical disabilities. Conditions may include complex permanent disabilities, multiple pathologies, neurodevelopmental conditions, life-limiting conditions and challenging and unpredictable behaviours. You will provide physiotherapy support to junior staff in the most appropriate community settings, including college and day centres, residential, nursing and respite homes, family homes and leisure facilities. In some settings this may include periods of lone working.&lt;/p&gt;\n&lt;p&gt;Working within Birmingham Community HealthCare Foundation Trust, the Learning Disabilities Division currently provides a city-wide physiotherapy service from one base situated in the South of the city.&lt;/p&gt;\n&lt;p&gt;You would join an established, friendly and supportive team of staff from Band 7 through to 3, who provide a quality service to adults with a learning disability who have a range of health conditions across spectrums including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Musculo-skeletal&lt;/li&gt;\n&lt;li&gt;Frail and elderly and dementia&lt;/li&gt;\n&lt;li&gt;Orthopaedics/rehabilitation&lt;/li&gt;\n&lt;li&gt;Chronic Respiratory&lt;/li&gt;\n&lt;li&gt;Neurology/deteriorating conditions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will have the opportunity to manage a mixed caseload of patients with a variety of health needs and further develop invaluable skills supporting junior staff working with people who have complex physical and learning disabilities, which will require a multi-disciplinary approach working alongside well established professional teams including Psychiatry, Psychology, Nursing and other Therapies. You will required to support junior staff working alongside other agencies delivering specialist services both within and outside of the Birmingham Community HealthCare trust. You will have the opportunity to be involved in physiotherapy service development and provision.&lt;/p&gt;\n&lt;p&gt;Our team provides opportunities to participate in regular clinical, operational and supervisory meetings within the team and also access/participate in regular in-service training as well as CPD training opportunities. The Learning Disability Division is committed to supporting continuing professional development.&lt;/p&gt;\n&lt;p&gt;Our team supports flexible working and will consider full/part time or job shares to support suitable candidates.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Darren Castle, Senior Physiotherapist&lt;/p&gt;\n&lt;p&gt;Email address:&lt;/p&gt;\n&lt;p&gt;Darren.Castle@bhamcommunity.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0121 466 3900&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;IMPORTANT&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDarren CastleJob titleSenior PhysiotherapistEmail addressDarren.Castle@bhamcommunity.nhs.ukTelephone number0121 466 3900&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Greenfields, Birmingham", "postalCode": "B30 3QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4124", "longitude": "-1.90439"}}, "title": "Band 7 Highly Specialist Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244681", "validThrough": "2020-11-10T23:59:59+0000"}