{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38880", "minValue": "36984", "unitText": "YEAR", "value": "£36,984 - £38,880"}}, "datePosted": "2020-10-29T12:24:27+0000", "description": "&lt;p&gt;The award-winning Adult Community Occupational Therapy Team is seeking a highly skilled, experienced and passionate Senior Occupational Therapist. A ambassador and leader is needed to join this forward-thinking and dynamic service; a service which has undergone significant transformation to move away from the more traditional models of OT service delivery, assessment and intervention to embrace a culture of innovation and positive risk-taking.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to lead in an area of service and contribute to service development.&lt;/p&gt;\n&lt;p&gt;If you share our values and this seems as exciting to you as it does to us then click to apply or email&lt;span&gt;resourcing@buckinghamshire.gov.uk&lt;/span&gt;to find out more about our Try Before You Apply sessions.&lt;/p&gt;\n&lt;p&gt;The purpose of the Senior Occupational Therapist is to be involved in providing a responsive, equitable and high quality community occupational therapy service to adults with a long term condition in Buckinghamshire.&lt;/p&gt;\n&lt;p&gt;Core responsibilities are outlined as follows:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To deputise for the team manager&lt;/li&gt;\n&lt;li&gt;To be part of a responsive countywide OT service, undertaking and providing OT assessments and interventions within the home environment&lt;/li&gt;\n&lt;li&gt;To demonstrate, encourage and support problem-solving, taking positive risks and sharing creative solutions&lt;/li&gt;\n&lt;li&gt;To lead and contribute to staff, team and service development&lt;/li&gt;\n&lt;li&gt;To be a positive ambassador for OT, continuing to raise the profile of OT, internally, externally and in the wider community&lt;/li&gt;\n&lt;li&gt;To support the continued transformation and integration agenda within Adult Social Care&lt;/li&gt;\n&lt;li&gt;To support with supervision, training and continual professional development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate must be able to demonstrate the following qualifications, experience and skills:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Minimum of a 2:1 BSC degree in Occupational Therapy or COT Diploma qualification, or equivalent&lt;/li&gt;\n&lt;li&gt;Significant post-qualifying experience working as an Occupational Therapist&lt;/li&gt;\n&lt;li&gt;Authoritative knowledge of OT practice, best practice frameworks and guidance, relevant legislation, systems and initiatives&lt;/li&gt;\n&lt;li&gt;Experience of multi-disciplinary and partnership working and awareness of the issues involved&lt;/li&gt;\n&lt;li&gt;Planning and caseload management skills&lt;/li&gt;\n&lt;li&gt;Proven assessment and investigation skills appropriate to the scope of the role&lt;/li&gt;\n&lt;li&gt;Ability to carry out complex client assessments&lt;/li&gt;\n&lt;li&gt;Excellent interpersonal and communication skills&lt;/li&gt;\n&lt;li&gt;Proven ability to plan and deliver training&lt;/li&gt;\n&lt;li&gt;Accurate record keeping and report writing&lt;/li&gt;\n&lt;li&gt;Knowledge of financial assessment processes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The award-winning Adult Community Occupational Therapy Team is a highly motivated, skilled and committed team of occupational therapists operating within our forward-thinking and dynamic Adult Social Care service.&lt;/p&gt;\n&lt;p&gt;The majority of Buckinghamshire residents will have contact with our services at some point in their lives. Whether it’s for information and advice, access to a dedicated service or through the work of our trading standards or environmental health teams, we aim to deliver to the highest standard possible.&lt;/p&gt;\n&lt;p&gt;This is a very exciting time to join our Adult Services and Health directorate, as we join together adult social care, public health, housing and regulatory services for the first time in Council history. Our Better Lives Strategy sets out our ambition to enable people to live independently for longer and reduce dependency on services - something we are keen to focus on over the next year. This new directorate gives us the opportunity to develop an integrated approach to services that will better support our residents. After all, our residents are at the heart of everything we do.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131354.jpg", "name": "Buckinghamshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aylesbury", "postalCode": "HP20 1XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8145", "longitude": "-.812314"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248297", "validThrough": "2020-11-12T23:59:59+0000"}