{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a."}}, "datePosted": "2020-10-26T13:46:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Have you considered a career working with the older adult with acute mental and physical health needs? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Melstock House, Forston Clinic are seeking to recruit a Band 6, Clinical Team Leader (RMN) to cover maternity leave full time for a period of 10 months. This will be a secondment opportunity. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Dorset HealthCare we pride ourselves on the services we provide to our patients and their families. This year our Older Peoples Inpatient Services were rated “Outstanding” with the Care Quality Commission. Our In-Patient Ward services operate as Practice Development Units and are also supported by the Kings Fund and Health Education Wessex initiatives and the services have strong links with Bournemouth University.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who is motivated and able to empower others to make a real difference in leading and influencing the team. The wards focus is ensuring the health care we deliver is evidence based, high quality, individualised and recovery focused. Enthusiasm, passion and compassion are essential personal qualities for this role. Along with excellent team-working, communication and assessment skills. The successful candidate must be an excellent role model and thrive on developing others.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we can also offer you: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dedicated career pathways and great opportunities for continuing professional development&lt;/li&gt;\n&lt;li&gt;An excellent preceptorship programme for newly qualified nurses and the chance to further your career in a nurse led environment&lt;/li&gt;\n&lt;li&gt;You will receive a comprehensive and structured induction programme and training&lt;/li&gt;\n&lt;li&gt;Monthly pay plus enhancements for night, weekend and bank holiday working&lt;/li&gt;\n&lt;li&gt;NHS Pension scheme&lt;/li&gt;\n&lt;li&gt;Health &amp; Wellbeing service&lt;/li&gt;\n&lt;li&gt;Holiday pay of up to 33 days, plus bank holidays pro rata, dependent on service&lt;/li&gt;\n&lt;li&gt;NHS discounts&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme including work related learning, childcare vouchers, cars, cycles, home technology equipment and buying and selling of annual leave&lt;/li&gt;\n&lt;li&gt;Not forgetting our unique selling point – our Trust beach huts located along the famous Sandbanks coastline&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be required to undertake a &lt;strong&gt;Prevention and Management of Violence and Aggression&lt;/strong&gt; course and it is a condition of your employment that you successfully complete all aspects of this course; if this is not achieved you will not be able to commence working in the post.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: Thursday 19th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Anticipated start Date: 1st February 2021&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Emma Legg Job title: Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address: emma.legg@nhs.net Telephone number: 01305 361282&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorchester, Dorset", "postalCode": "DT2 9TB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7543", "longitude": "-2.4534"}}, "title": "Clinical Team Leader, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242737", "validThrough": "2020-11-09T23:59:59+0000"}