{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (plus HCAS)"}}, "datePosted": "2020-10-27T13:45:56+0000", "description": "&lt;p&gt;Want to develop your stroke and neurology skills? Looking to take the next step in your career? The Community Rehabilitation Service currently has opportunities for an innovative and enthusiastic Occupational therapist to join their team.&lt;/p&gt;\n&lt;p&gt;The Community Rehabilitation Service is a multi-disciplinary therapy team providing assessment and rehabilitation for housebound clients with a range of progressive or acquired neurological condition in individual’s homes or a community setting. The work is community based and so you must be able to travel throughout the Boroughs of Redbridge efficiently and effectively.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the assessment and treatment planning of those referred to the service and have the opportunity to develop and enhance your existing clinical skills. You will take a role in the leadership of junior staff and rehabilitation assistants, through supervision, training and appraisal whilst also being involved in the on-going development of the service.&lt;/p&gt;\n&lt;p&gt;The service works closely with our colleagues across the Stroke and Neurology pathway, and our team of specialist stroke psychologist and MND nurse to aid us in the holistic management of our patients.&lt;/p&gt;\n&lt;p&gt;Essential Criteria for the post include:&lt;/p&gt;\n&lt;p&gt;- Degree or diploma in Occupational Therapy and current HCPC registration&lt;/p&gt;\n&lt;p&gt;- Experience of acute or community neurology&lt;/p&gt;\n&lt;p&gt;- To be able to travel efficiently throughout the boroughs of Redbridge&lt;/p&gt;\n&lt;p&gt;We are looking for a candidate who is a team player, enthusiastic, flexible and who possess excellent negotiation, communication and interpersonal skills.&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focusing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameArwa ElawadJob titleTherapy Team LeadEmail addressarwa.elawad@nelft.nhs.ukTelephone number0208 708 2350&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cranbrook and Loxford Cluster, Redbridge", "postalCode": "IG1 1HP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.557", "longitude": ".076088"}}, "title": "Stroke Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244785", "validThrough": "2020-11-10T23:59:59+0000"}