{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa pro rata"}}, "datePosted": "2020-10-27T15:16:47+0000", "description": "&lt;p&gt;Are you a Consultant Child and Adolescent Psychiatrist who is dedicated and passionate about improving child and adolescent mental health services?&lt;/p&gt;\n&lt;p&gt;Are you looking for an exciting opportunity to be part of a developing and innovative service?&lt;/p&gt;\n&lt;p&gt;Ready to take a key leadership role in developing and transforming CAMHS?&lt;/p&gt;\n&lt;p&gt;We are looking for a 3.3 wte Child and Adolescent Psychiatrists to join an experienced clinical and management team in Blackpool Child and Adolescent Mental Health Service. We would also be interested to hear from applicants such as specialty doctors who might be interested in a developmental role&lt;/p&gt;\n&lt;p&gt;Our CAMHS services in Blackpool are part of the Families Division within Blackpool Teaching Hospitals NHS Foundation Trust which includes all hospital and community-based children&#39;s healthcare services across the area.&lt;/p&gt;\n&lt;p&gt;Blackpool CAMHS is a multi-disciplinary team comprising of Psychologists, Nurses, Family Therapists, Senior CAMHS Practitioners, Primary Mental Health Workers, Children’s Wellbeing Practitioners and Assistant Practitioners. We are also developing opportunities for trainee’s to be part of the team including FY2 doctors .The team’s caseload is varied with a range of core and specialist pathways for children, young people and families.&lt;/p&gt;\n&lt;p&gt;Successful out of hours CYP MH response over the last 4 years providing community reach out groups alligned with an established psychological therapy service Youtherapy NHS provision .Working closely within a Families Division enables excellent joint working and sound pathway working and development.&lt;/p&gt;\n&lt;p&gt;We are currently in the process of implementing the THRIVE model across CAMHS in order to transform services alongside young people, parents, carers and our partner agencies. This include developing our Single Point of Access ( SPoA) and provides a unique opportunity for you to develop share your special interest and clinical leadership.&lt;/p&gt;\n&lt;p&gt;We are advertising for 3.3 full-time posts within the core CAMHS, creating an exciting opportunity to jointly develop and transform the Blackpool CAMHS service. Part time and job share applications will be considered.&lt;/p&gt;\n&lt;p&gt;Blackpool Teaching Hospitals NHS Foundation Trust has a forward thinking and inclusive medical community and we are committed to your development and helping you to achieve your career aspirations..&lt;/p&gt;\n&lt;p&gt;AAC Date - TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDavid EatonAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Peter Curtis Consultant Paediatrician, Divisional Director Families Division and Divisional Director Clinical Support Division Switchboard; 01253 300000&lt;/p&gt;\n&lt;p&gt;Elaine Walker Integrated Emotional Health and Wellbeing Manager Tel: 07795452781&lt;/p&gt;\n&lt;p&gt;David Eaton Service Manager CAMHS Tel: 01253 957160&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whitegate Drive Health Center, Blackpool", "postalCode": "FY3 9ES"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.813", "longitude": "-3.0346"}}, "title": "Consultant Child and Adolescent Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245166", "validThrough": "2020-11-17T23:59:59+0000"}