{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-10-26T08:30:21+0000", "description": "&lt;p&gt;Brighton and Sussex University Hospitals (BSUH) Trust is the regional teaching hospital working across two sites, the Royal Sussex County Hospital in Brighton and Princess Royal Hospital, Haywards Heath. The Brighton campus includes the Royal Alexandra Children’s Hospital and the Sussex Eye Hospital. You will be based at the Princess Royal Hospital in Haywards Heath but may occasionally be required to work at the Royal Sussex County Hospital, Brighton&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic Materials Management Assistant with great customer service skills to join our team at the Princess Royal Hospital, Haywards Heath.&lt;/p&gt;\n&lt;p&gt;The job holder is required to provide a cost effective materials management service in accordance with agreed procedures. The post holder will ensure replenishment of ward stocks using PDA/bar code technology, to agreed levels to meet the needs of the user. You will also review reorder levels and reorder quantities in line with end user demand and ensure items are receipted on to the Oracle Purchasing System. The post holder will deliver items around the hospital and ensure items are put in agreed stock locations on the agreed day. The post holder will keep storage areas clean and tidy and will ensure goods requiring return to suppliers are dealt with swiftly and in accordance with set procedures. A flexible approach is needed and the post holder may be required to undertake any of the services provided by the department. The role requires lifting and pushing of heavy weights on a daily basis and correct manual handling techniques must be applied at all times using equipment provided where appropriate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAllison BrettJob titleHead of SuppliesEmail addressallison.brett@nhs.netTelephone number01273 523446&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal Hospital, Haywards Heath", "postalCode": "RH16 4EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9912", "longitude": "-.09105"}}, "title": "Materials Management Assistant, Princess Royal Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241760", "validThrough": "2020-11-12T23:59:59+0000"}