{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T10:15:53+0000", "description": "&lt;p&gt;As an Information Governance (IG) Officer, covering the East of England, the post holder will work as part of a dynamic team in delivering an effective service supporting managers and staff across the Midlands and East of England Region to increase awareness of IG and to embed good data protection practice. This will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Developing local subject access request (SAR) procedures and managing the processing and response to requests for information within the Midlands and East of England Region.&lt;/li&gt;\n&lt;li&gt;Providing support and undertaking data protection impact assessments (DPIAs) where required for any new processes.&lt;/li&gt;\n&lt;li&gt;Supporting the management and response to information security incidents.&lt;/li&gt;\n&lt;li&gt;Supporting the IG Managers in maintaining the NHS England and NHS Improvement information asset management system. Assisting asset owners and administrators with undertaking risk assessments.&lt;/li&gt;\n&lt;li&gt;Ensuring staff complete mandatory IG training and providing updates to the relevant groups. This may include working with the Central IG Team to provide alternative IG training as required.&lt;/li&gt;\n&lt;li&gt;Supporting the development and delivery of the Data Security and Protection (DSP) Toolkit action/improvement plans, monitoring progress and collating evidence where required.&lt;/li&gt;\n&lt;li&gt;Undertaking compliance audits in accordance with the DSP Toolkit.&lt;/li&gt;\n&lt;li&gt;Producing reports and presenting these to the East of England Operational IG Groups.&lt;/li&gt;\n&lt;li&gt;Ensuring the organisation&#39;s contractors/support organisations have adequate IG arrangements in place.&lt;/li&gt;\n&lt;li&gt;Supporting the development of local data sharing and data processing agreements as required and undertaking work to embed these within the organisation.&lt;/li&gt;\n&lt;li&gt;Ensuring fair processing notices are adequate for flows of personal confidential information.&lt;/li&gt;\n&lt;li&gt;Undertaking the role of a records and information management co-ordinator (RIMC) and supporting records management audits.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In particular the post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the Midlands and East of England IG Team in promoting information governance within the region and ensuring teams are complying with current data protection legislation.&lt;/li&gt;\n&lt;li&gt;Support and inform the targeting of resources, monitoring, implementation and evaluation of the tasks/projects by providing high quality support including complex information and analysis.&lt;/li&gt;\n&lt;li&gt;Ensure accurate and open communication and co-ordination with a range of organisations and individuals, researching and drafting correspondence and papers and ensuring the management of specific tasks, lead reporting and analysis across a range of specialties, functions and projects.&lt;/li&gt;\n&lt;li&gt;Be a key member of the team as well as supporting effective communication and stakeholder management, both internally and externally.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that you do not have to live within the East of England to apply for this role. The base for this role is likely to be within the East of England region and the postholder will be required to travel to that base as and when appropriate but we are flexible with regard to home working.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Leanne Hadley, Information Governance Manager (Midlands and East of England); leannehadley@nhs.net or 07783816583&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Victoria House (flexible home working), Fulbourn, Cambridge", "postalCode": "CB21 5XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "IG Officer - East of England", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247870", "validThrough": "2020-11-12T23:59:59+0000"}