{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a. pro rata"}}, "datePosted": "2020-11-04T14:15:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Come Nurse with us…&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals NHS Foundation Trust is one of the largest teaching Trusts in the country. It comprises Addenbrooke’s Hospital and the Rosie Hospital. We provide accessible high-quality healthcare for the local people of Cambridge and regional and national specialist services. It’s a great place to nurse, work and live.&lt;br /&gt;&lt;br /&gt;You will work on a vibrant hospital campus with a friendly community feel; we have excellent facilities to practise your skills and abilities to support your career pathway and development. Our values of &lt;strong&gt;Together – Safe, Kind, Excellent&lt;/strong&gt; support the delivery of outstanding care. We have a fully electronic patient record system that is improving health-care quality; this is transforming services, improving patient safety and clinical outcomes.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We are looking for an experienced individual for this exciting new post. You will have the motivation and autonomy to launch &amp; lead delivery of the newly developed University accredited Paediatric High Dependency Course across childrens services. You will find a team of nurses and allied health professionals eager to learn, train and engage with High Dependency Care.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;You will be joining a well-established team within a large teaching hospital. Cambridge University Hospitals has a diverse child admission criteria and is a tertiary centre for oncology, major trauma, neurology and many paediatric surgical &amp; medical subspecialties, with the exception of cardiac surgery. We provide a diverse and stimulating children’s services delivering excellent specialist care to children, young people and their families.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;The high Dependency course will be for the benefit of the PICU/PHDU, Paediatric Emergency Department, Paediatric Recovery and a variety of clinical wards where children requiring high dependency care are treated. You will work closely with the Paediatric Practice Development team, which includes a Paediatric Critical Care level 3 course lead.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Our ethos of child centred care and multi-professional collaboration drives our service, alongside a commitment to family focussed teamwork. As part of your role, you will be responsible for providing a high standard of nursing expertise in relation to the children, young people, families and professional colleagues within the service. You will interface with all relevant professional groups to enhance the care delivered to children, young people and their families providing guidance, support and advice.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;br /&gt;&lt;br /&gt;Please note:- Internal applicants on permanent contracts can only apply for this post as a secondment and must have the approval of your current line manager before applying.&lt;br /&gt;&lt;br /&gt;Closing date: 15 November 2020&lt;br /&gt;&lt;br /&gt;Interviews are due to be held in the week commencing 30 November 2020&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Why choose Cambridge University Hospitals?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our values and reputation for outstanding care&lt;/li&gt;\n&lt;li&gt;Opportunities to experience a range of specialities&lt;/li&gt;\n&lt;li&gt;Career and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship and mentoring programmes delivered by a dedicated clinical education support team&lt;/li&gt;\n&lt;li&gt;Research experience and opportunities&lt;/li&gt;\n&lt;li&gt;Lovely location and quality of life&lt;/li&gt;\n&lt;li&gt;Excellent schools/colleges and transport links (road, rail and air)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Lorraine Highe&lt;br /&gt;Job title: Matron for PICU/PHDU, C3 &amp; Education&lt;br /&gt;Email address:  lorraine.highe@addenbrookes.nhs.uk&lt;br /&gt;Telephone number:  01223 217869&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division E, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Paediatric High Dependency Module Lead &amp; Practice Development Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256179", "validThrough": "2020-11-15T23:59:59+0000"}