{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa in HCA"}}, "datePosted": "2020-11-03T10:31:37+0000", "description": "&lt;p&gt;&lt;strong&gt;The Lane Fox Respiratory Unit is looking for YOU! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are looking for a challenge and have an interest in specialist respiratory medicine, then we are the place for you. Would you like to develop your knowledge and skills within Respiratory Weaning and Rehabilitation? Do you like to be challenged and think autonomously? If so we have vacancies for Band 6 Senior Staff Nurses on Lane Fox Respiratory Unit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About our Service &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Lane Fox Respiratory Unit is the largest weaning and home mechanical ventilation center in the UK. We provide management and long term follow up for patients with chronic respiratory disease such as COPD and neuro-muscular diseases. The Lane Fox Respiratory Unit also offers specialist nurse lead clinics and a home ventilation service for assessing and advising patients with chronic respiratory illness.&lt;/p&gt;\n&lt;p&gt;Our unique, purpose built 14 bedded unit delivers highly quality specialised respiratory care to complex level 2 and level 3 patients including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Tracheostomy management and mechanical ventilation&lt;/li&gt;\n&lt;li&gt;Weaning from invasive mechanical ventilation&lt;/li&gt;\n&lt;li&gt;Acute and chronic non-invasive ventilation&lt;/li&gt;\n&lt;li&gt;High Flow oxygen therapy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you share our vision to help patients with respiratory failure to live independently this is the perfect job for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Here’s what our staff say about us…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“It doesn’t matter how challenging the day is, if you got the team around you, you feel like you can do anything!”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“I love coming to work supporting patients with such specialised needs who come into our unit unable to breathe and leave fully independent.”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“People ask me why I have been here for so long and I say to them I love my job, I love the patients and there is nowhere in the world I would go and be satisfied that would compare to how we work in Lane Fox“&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We welcome applicants with a willingness to learn, that thrive under pressure and have the ability to adapt and refine their skills according to the demands of the unit. You MUST have a post registration critical care qualification (ITU / HDU) and significant experience in an ITU / HDU/Respiratory settings.&lt;/p&gt;\n&lt;p&gt;We can offer you a personalised induction programme with supervision and support from our dedicated practice development team and one to one support from the senior nursing team. We have excellent development programme with protected learning time including support to develop management skills.&lt;/p&gt;\n&lt;p&gt;We welcome you to contact us to find out more about the role and would be happy to show you around the unit and answer any questions you may have.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be advised that all the interviews will be conducted online via Skype for Business, and there will be no phone interviews. Please make sure that the video and audio functions are working.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 29th November 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Dates: Interviews to be conducted online via Skype for Business on the week commencing the 7th of December.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Reegan Puthussery (Ward Manager)&lt;/p&gt;\n&lt;p&gt;Lane Fox Respiratory Unit &lt;br /&gt;Email:reegan.puthussery@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Mobile : 07710984596&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lane Fox Unit, St.Thomas Hospital, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Senior Staff Nurse - Specialist Respiratory Weaning and Rehab Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253471", "validThrough": "2020-11-29T23:59:59+0000"}