{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-26T12:46:18+0000", "description": "&lt;p&gt;This is an exciting opportunity to join the Specialist Support Team (SST) - Greater Manchester; a developing and expanding service within the Specialist Learning Disability Division at Mersey care NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We have developed a model of care and support that provides specialist health services to adults who have a Learning Disability and/or Autism and who present a risk of offending or who have a history of criminal conviction as well as individuals who are described as having complex challenging behaviour. The service is based on the principles that underpin the Transforming Care initiative; that services for people who have Learning Disabilities should be configured around and with local communities, with strengthened support closer to home with a reduction on the reliance of hospital care.&lt;/p&gt;\n&lt;p&gt;The team will also work to enhance the discharge process, ensuring that people who do need in-patient care stay for only for as long as they need it. The SST will provide expert care and wrap around support to individuals and their support teams on discharge from hospital and work with community providers to ensure the correct training and support is available. In addition, the team will provide Intensive Support to prevent crisis and support people to stay at home with the care and support that they need.&lt;/p&gt;\n&lt;p&gt;Working directly with individuals and acting as a resource to locally provided community learning disability teams, the SST will model best practice in personalised care and support planning in addition to supporting local teams to plan creative and flexible supports.&lt;br /&gt;The service will be underpinned by positive behavioural support principles, ensuring that person centered practices provide the foundations of all support.&lt;/p&gt;\n&lt;p&gt;The successful candidate with demonstrate excellent leadership and communication skills and be motivated to developing new ways of working. They will have a clear commitment to person-centred practices and be able to demonstrate this in their work with individuals, families and teams.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to be a car driver and willing to travel across Greater Manchester working with a number of partner agencies including health, social care and the Criminal Justice agencies. Hours are predominantly 9am-5pm Monday to Friday although some flexibility will be required when delivering intensive support which may include some evening or weekend working on a planned/rostered basis&lt;/p&gt;\n&lt;p&gt;Shortlisting is planned for 09.11.20&lt;/p&gt;\n&lt;p&gt;Interviews are planned for 18.11.20&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVicky DunnJob titleOperational ManagerEmail addressvictoria.dunn@merseycare.nhs.ukTelephone number07795841199Additional contact information&lt;/p&gt;\n&lt;p&gt;Vicky Dunn - Victoria.dunn@merseycare.nhs.uk Tel 01254 821112&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "2 City Approach, Albert St, Eccles, Manchester M30 0BL, Eccles Manchester", "postalCode": "M30 0BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4848", "longitude": "-2.33763"}}, "title": "Nurse Practitioner (Greater Manchester)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242487", "validThrough": "2020-11-08T23:59:59+0000"}