{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum (pro rata if part time"}}, "datePosted": "2020-11-06T08:17:07+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced Pharmacist with a passion for education and training to join our senior team at Hywel Dda University Health Board in this newly created post.&lt;/p&gt;\n&lt;p&gt;We are looking for a Pharmacist with drive and enthusiasm to provide strategic leadership for health board wide education and training across sectors within the pharmacy team.&lt;/p&gt;\n&lt;p&gt;The successful applicant will identify opportunities for workforce development and support the development of a highly skilled workforce to ensure the pharmacy service can meet the future needs of the service in line with the health board’s vison for a “&lt;em&gt;A Healthier Mid and West Wales&lt;/em&gt;” and the Pharmacy professions own aligned vision &lt;em&gt;Pharmacy: Delivering a Healthier Wales&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with others across Wales including Health Education and Improvement Wales (HEIW). This is an exciting time to be leading on pharmacy education and training with the creation of new and specialist roles in primary and secondary care, development of multi-sector training of trainees, increasing demand for pharmacy to provide training to other health care professionals and the opportunity to work closely with the new School of Pharmacy in Swansea to develop the teacher practitioner role.&lt;/p&gt;\n&lt;p&gt;Hywel Dda UHB provides services across primary, community and acute sectors to a population of around 375,000. It covers a large geographical area of rural West and Mid Wales with 4 district hospitals, 48 GP practices and 99 Community Pharmacies in addition to a small number of small community hospitals.&lt;/p&gt;\n&lt;p&gt;It is an area of outstanding natural beauty with beautiful beaches and unspoilt countryside, which provide wonderful lifestyle opportunities. There are good rail and road link across most of the region, making it easily accessible to Swansea, Cardiff and beyond.&lt;/p&gt;\n&lt;p&gt;For further details or an informal discussion please contact Stuart Rees, Clinical Pharmacy Lead for Patient Services on 01554 783462 , email stuart.rees2@wales.nhs.uk or Mari Treharne , Pharmacy Site Manager on 01554 783210 or mari.treharne@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Interviews for this post will be held on 24th November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStuart ReesJob titleClinical Pharmacy lead for Patient ServicesEmail addressstuart.rees2@wales.nhs.ukTelephone number01554 783462Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details or an informal discussion please contact Stuart Rees, Clinical Pharmacy Lead for Patient Services on 01554 783462 , email stuart.rees2@wales.nhs.uk or Mari Treharne , Pharmacy Site Manager on 01554 783210 or mari.treharne@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Health Board wide post, TBC", "postalCode": "SA14 8QF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6916", "longitude": "-4.136"}}, "title": "Senior Pharmacist - Strategic Lead for Education and Training", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258891", "validThrough": "2020-11-15T23:59:59+0000"}