{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Salary + Co Benefits + Bonus Scheme"}}, "datePosted": "2020-11-02T19:18:16+0000", "description": "&lt;p&gt;Due to organisational expansion, an opportunity has arisen within Northern Healthcare for a Service Manager to join our team within the Lancashire Area.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the delivery of a service which is both economically viable, managing available resources effectively as well as engaging with and meeting the needs of our tenants and staff.&lt;/p&gt;\n&lt;p&gt;Ideally, you&#39;ll be a Registered Mental Health Nurse or Occupational Therapist with experience in a similar setting. We also welcome candidates who have a qualification in Health &amp; Social Care with proven management experience.&lt;/p&gt;\n&lt;p&gt;Duties will include but not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assessment and management of tenant care&lt;/li&gt;\n&lt;li&gt;Monday to Friday working week&lt;/li&gt;\n&lt;li&gt;Management of care pathway&lt;/li&gt;\n&lt;li&gt;Will provide out of hours cover&lt;/li&gt;\n&lt;li&gt;Ensure regular staff meetings are convened and maintain an atmosphere where staff can contribute their views on practice and development in an open and constructive manner&lt;/li&gt;\n&lt;li&gt;Ensure the support of staff through supervision, appraisals and training in order to allow them to work effectively&lt;/li&gt;\n&lt;li&gt;Ensure staff are compliant with legal and CQC framework&lt;/li&gt;\n&lt;li&gt;Identify and pro-actively address any failure in performance by staff&lt;/li&gt;\n&lt;li&gt;Assume key role in recruitment of staff&lt;/li&gt;\n&lt;li&gt;Supervise and manage sickness and absence of employees&lt;/li&gt;\n&lt;li&gt;Manage and oversee ongoing training internally and externally&lt;/li&gt;\n&lt;li&gt;Ensure incident management is complete to the highest standard&lt;/li&gt;\n&lt;li&gt;Manage and govern overall health and safety , conduct audits and sustain business contingency plans. building and grounds and manage maintenance&lt;/li&gt;\n&lt;li&gt;Uphold maintenance of building through PAT Testing, regular inspections and schedules maintenance and repairs as required&lt;strong&gt;&lt;em&gt;-&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Ensure compliance with tenancy agreements&lt;/li&gt;\n&lt;li&gt;Management of finances of the unit and individuals including petty cash, housing benefit, budget, financial returns, resident finance, procurement, expenses and wages sign off.&lt;/li&gt;\n&lt;li&gt;Promote the aims and objectives of NH through liaison with statutory and voluntary agencies&lt;/li&gt;\n&lt;li&gt;Develop and maintain good working relations with relevant agencies, keeping abreast of developments in local policy and services&lt;/li&gt;\n&lt;li&gt;Develop local community links with a view to identifying opportunities for service enhancement and promoting a better understanding of mental health issues&lt;/li&gt;\n&lt;li&gt;An ability to build a warm rapport with residents and their families&lt;/li&gt;\n&lt;li&gt;Identifying business development potential and acting upon opportunities to secure referrals.&lt;/li&gt;\n&lt;li&gt;Attend regular supervision with line manager&lt;/li&gt;\n&lt;li&gt;Take part in training as required&lt;/li&gt;\n&lt;li&gt;Actively review own performance and development needs to assist personal growth and the development of the service&lt;/li&gt;\n&lt;li&gt;Every member of staff at NH is expected to show respect to their colleagues and residents. You must understand and adhere to NH values at work; they are also expected to work collegially and to support all the teams with which they residents have contact in achieving NH’s objectives.&lt;/li&gt;\n&lt;li&gt;Any other duty as required by the board appropriate to the post.&lt;/li&gt;\n&lt;li&gt;Have knowledge, understanding and experience of CQC requirements and clinical governance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135974.JPG", "name": "Northern Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135974"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lancashire Area", "postalCode": "DY1"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5151", "longitude": "-2.09211"}}, "title": "Service Manager (Lancashire Area)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253061", "validThrough": "2020-12-31T23:59:59+0000"}