{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-20T10:04:19+0100", "description": "&lt;p&gt;&lt;strong&gt;About us &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Fitzwilliam Hospital is a fantastic place to work; our Outpatient team are enthusiastic, experienced and motivated in providing exceptional patient care.&lt;/p&gt;\n&lt;p&gt;We are inviting applications for the position of Outpatient Manager. Reporting directly to the Head of Clinical Services, the successful candidate will be expected to demonstrate high performance leadership of the Outpatient team. The Outpatient Manager will promote and drive a high standard of individualised patient care supporting the clinical team to provide excellent customer experience, whilst facilitating the best possible clinical outcomes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are ready for a positive career change Ramsay Fitzwilliam Peterborough has an exciting opportunity for an experienced senior nurse. Our immaculate hospital has a full multi-disciplinary team onsite, practice advanced treatments and offer everything from screening through to leading-edge surgical procedures in specialist fields such as, orthopaedics and general surgery delivered through our expert and caring clinical teams.&lt;/p&gt;\n&lt;p&gt;We are proud to have been rated as an overall ‘good’ by the CQC and are on a journey to achieving an ‘outstanding’ rating. We are looking for someone to join our team who can bring new ideas as we embark on new evolving projects such as the implementation of electronic paperless records. Experience in the private sector is not a requirement and we have staff to mentor and support you through induction.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will do&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide leadership for Outpatient Department&lt;/li&gt;\n&lt;li&gt;Day to day operational management, electronic rostering, staff appraisals &amp; training, and budgetary accountability&lt;/li&gt;\n&lt;li&gt;Develop excellent working relationships with staff, Consultants, suppliersand key stakeholders&lt;/li&gt;\n&lt;li&gt;Provide effective motivation, monitoring and management of the Outpatient team&lt;/li&gt;\n&lt;li&gt;Build effective controls to ensure the Department’s Key Performance Indicator and financial targets are achieved&lt;/li&gt;\n&lt;li&gt;Ensure there is a robust process for Patient Related Outcome Measures (PROMS)&lt;/li&gt;\n&lt;li&gt;Provide departmental leadership for infection control, health &amp; safety, complaint investigation, central alert process, staff development, risk and clinical audit&lt;/li&gt;\n&lt;li&gt;Undertake interdepartmental investigations&lt;/li&gt;\n&lt;li&gt;Manage staff through HR process&lt;/li&gt;\n&lt;li&gt;Leading on pathway implementation / change in OPD&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll bring with you&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in a managerial role&lt;/li&gt;\n&lt;li&gt;Strong clinical background&lt;/li&gt;\n&lt;li&gt;Comprehensive understanding of relevant clinical standards&lt;/li&gt;\n&lt;li&gt;Knowledge of quality frameworks&lt;/li&gt;\n&lt;li&gt;Coaching, mentoring and staff development skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Ramsay Way&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ramsay Health Care is committed to being a leading provider of health care services by delivering high quality outcomes for patients and ensuring long term profitability.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are caring, progressive, enjoy our work and use a positive spirit to succeed&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;We take pride in our achievements and actively seek new ways of doing better&lt;/li&gt;\n&lt;li&gt;We value integrity, credibility and respect for the individual&lt;/li&gt;\n&lt;li&gt;We build constructive relationships to achieve positive outcomes for all&lt;/li&gt;\n&lt;li&gt;We believe that success comes through recognising and encouraging the value of people and teams&lt;/li&gt;\n&lt;li&gt;We aim to grow our business whiles maintaining sustainable level of profitability, providing a basis for stakeholder loyalty.&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary – depending on skills and experience&lt;/li&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Access to the Ramsay Academy – genuine opportunities to grow, develop and specialise in your career&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus the opportunity to buy/sell more&lt;/li&gt;\n&lt;li&gt;Flexible shift options&lt;/li&gt;\n&lt;li&gt;Private Healthcare and Life Assurance&lt;/li&gt;\n&lt;li&gt;Free onsite parking and a subsidised staff restaurant&lt;/li&gt;\n&lt;li&gt;Free uniform&lt;/li&gt;\n&lt;li&gt;Access to our employee Discount Programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;* Salary based on base plus some enhancements for working some weekends or nights&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;If you would like the opportunity to visit us and see and understand the amazing work, we do please contact The Recruitment Team &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are committed to equality of opportunity for all. This position is subject to an Enhanced DBS check.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE3 9AQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5767", "longitude": "-.297541"}}, "title": "Outpatients Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233737", "validThrough": "2020-11-30T23:59:59+0000"}