{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-09-30T12:20:24+0100", "description": "&lt;p&gt;&lt;strong&gt;Clinical Board&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Acute Hospital Board incorporates the specialties of Critical Care and Theatres, Outpatient and Imaging, Pathology, Emergency Services, Medicine and Therapies, Surgery, lead by the Medical Director&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Lung Cancer Screening Sites &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Lung cancer study is based at four sites across north east London with CT scanners at UCH, King Georges Hospital (TBC), Finchley Memorial Hospital and Mile End Hospital. The post holder will rotate throughout these sites, liaising with radiographers, radiologists, research nurses, assistant practitioners, and staff at other trusts where Trial scanners are based.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Purpose &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The post holder will work as a senior radiographer in Radiology and will contribute to an efficient and patient focused service at the Trial CT sites. They will ensure the provision of the highest standards of patient care, and will be actively involved in daily operation of the Department. This person will be working closely within a multidisciplinary research team.&lt;/li&gt;\n&lt;li&gt;The post holder will supervise, support and assist students and junior radiographers in service delivery and personal development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key Results Areas &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder is required:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To perform low dose CT lung scans as part of the lung screening trial to a high standard.&lt;/li&gt;\n&lt;li&gt;To ensure that all data inputs are accurately recorded in order to maintain the integrity of data for both patients and service.&lt;/li&gt;\n&lt;li&gt;To provide professional support, supervision and assistance to qualified radiographers and other staff in service delivery and personal development.&lt;/li&gt;\n&lt;li&gt;To ensure professional practice, and that of the service, is maintained and extended through participation in Continuous Professional Development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Main Duties and Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Assess a referral or request form, and justify it under radiographic regulations and locally agreed protocols.&lt;/p&gt;\n&lt;p&gt;Prioritise patients to ensure optimum efficiency and service quality.&lt;/p&gt;\n&lt;p&gt;Ensure that the protocol used for an examination is suitably matched to the clinical indications for the procedure.&lt;/p&gt;\n&lt;p&gt;Liaise with referring clinicians to clarify or discuss requests.&lt;/p&gt;\n&lt;p&gt;Act as a point of specialist advice for referrers, other clinical staff, patients and their relatives.&lt;/p&gt;\n&lt;p&gt;Ensure that patients, relatives and staff are appropriately informed and reassured of any discussions relating to patient procedures.&lt;/p&gt;\n&lt;p&gt;Assess the physical, mental and communication abilities and needs of individual patients and respond appropriately.&lt;/p&gt;\n&lt;p&gt;Answer all questions and concerns of the patients, providing them with appropriate responses, putting the patient’s condition into the context of the diagnostic procedure.&lt;/p&gt;\n&lt;p&gt;Document that patients have consented to procedures and to issue and ensure they understand any instructions they need to follow.&lt;/p&gt;\n&lt;p&gt;Enter accurate patient examination data into Imaging Information Systems e.g. ESR and PACS.&lt;/p&gt;\n&lt;p&gt;Accurately position patients for the appropriate examinations, taking into account their abilities, needs and limitations.&lt;/p&gt;\n&lt;p&gt;Appropriately adapt standard techniques to ensure that radiographic procedures are undertaken appropriately for patients with limited capabilities.&lt;/p&gt;\n&lt;p&gt;Undertake the more complex radiological procedures, utilising skills, knowledge and experience, calculating and setting exposure parameters and doses.&lt;/p&gt;\n&lt;p&gt;Participate in patient monitoring or administration of oxygen.&lt;/p&gt;\n&lt;p&gt;Visually be able to discriminate subtle differences between images to ensure there are no artefacts.&lt;/p&gt;\n&lt;p&gt;Assess outcomes following procedures, and ensure that any necessary additional procedures are undertaken within a single patient attendance where possible.&lt;/p&gt;\n&lt;p&gt;Assess and respond to adverse treatment responses.&lt;/p&gt;\n&lt;p&gt;Ensure that unexpected abnormalities seen are brought to the attention of the medical staff of the department, and the referring clinician, and that the patient is managed in an appropriate and supportive manner.&lt;/p&gt;\n&lt;p&gt;Work unsupervised, seeking advice from colleagues and senior radiographic or medical staff when required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Operational Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Operate accurately and safely highly complex radiological equipment, requiring a high degree of manual dexterity.&lt;/li&gt;\n&lt;li&gt;Operate advanced software requiring excellent hand eye coordination as drawing and positioning of region of interest will directly determine the patient’s clinical report.&lt;/li&gt;\n&lt;li&gt;Ensure that all the documentation relating to a procedure is appropriately organised to ensure rapid and accurate transit through the administrative and clerical systems of the CT service.&lt;/li&gt;\n&lt;li&gt;Ensure that all data inputs are accurately recorded in order to maintain the integrity of data for both patients and service.&lt;/li&gt;\n&lt;li&gt;Use the equipment in the department safely and effectively, ensuring adherence to the manual handling regulations at all times.&lt;/li&gt;\n&lt;li&gt;Undertake regular equipment testing, ensuring appropriate recording and documentation of results.&lt;/li&gt;\n&lt;li&gt;Ensure that any equipment faults are brought to the attention of the appropriate senior member of staff in a timely fashion.&lt;/li&gt;\n&lt;li&gt;Clearly label, or remove from circulation, any faulty equipment to mitigate the risk of its continued use.&lt;/li&gt;\n&lt;li&gt;Make initial investigations into equipment failures, and communicate details of the problem effectively to the appropriate senior member of staff.&lt;/li&gt;\n&lt;li&gt;Ensure that any documentation relating to routine servicing or equipment breakdown is correctly filed, and the information disseminated appropriately.&lt;/li&gt;\n&lt;li&gt;Attend and participate in staff meetings, grade meetings and Directorate meetings.&lt;/li&gt;\n&lt;li&gt;Participate in departmental activities such as Health and Safety, Audit, Clinical Governance, and investigation of Adverse Incidents and complaints.&lt;/li&gt;\n&lt;li&gt;Maintain a safe, clean and tidy work environment, ensuring there are adequate supplies of stock in clinical areas.&lt;/li&gt;\n&lt;li&gt;Operate as a Practitioner/Operator under IR (ME)R 2000 and IR(ME)R 2017.&lt;/li&gt;\n&lt;li&gt;Monitor the implementation and observance of radiation protection local rules and systems of work and report any problems to a Radiation Protection Supervisor.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5249", "longitude": "-.136987"}}, "title": "Bank CT Radiographer Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916206404", "validThrough": "2020-11-27T23:59:59+0000"}