{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-02T10:15:55+0000", "description": "&lt;p&gt;The Northern Care Alliance NHS Group was created by bringing together staff and services from two NHS Trusts, Salford Royal NHS Foundation Trust and The Pennine Acute Hospitals NHS Trust. The sheer size, scale and potential of our combined service is huge. Together, we’ve a wealth of skills and resources to share and tap into and, a wide range of career paths for you to develop and explore. If you want to join a team of over 19,000 NHS experts in delivering high-quality, local care across Salford, Oldham, Bury and Rochdale and beyond – &lt;strong&gt;come and take your place with us.  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic and hardworking individual to join the adaptations team within Independent Living Services based at Burrows House.&lt;/span&gt; &lt;span&gt;The adaptations team are part of a suite of services within independent living services of Salford Care Organisation supporting residents by removing environmental barriers within their homes to support independent living.&lt;br /&gt;&lt;br /&gt;As part of a of small team of Lift Surveyors you will have a background within the electrical and mechanical field with evidence of further continuing professional development within the Lift industry. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The role requires the successful applicant to interpret clinical assessments into practical outcomes, together with experience of commissioning and contract managing framework contractors through the installation of a variety of lifting products into domestic properties and their continued maintenance within industry statutory standards.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anthony Saul&lt;br /&gt;Operations Manager - Equipment and Adaptations&lt;br /&gt;anthony.saul@srft.nhs.uk&lt;br /&gt;07795 355197&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Burrows House, Swinton", "postalCode": "M28 2LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5129", "longitude": "-2.35554"}}, "title": "Lift Surveyor - Adaptations", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251523", "validThrough": "2020-11-16T23:59:59+0000"}