{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 -£30,615"}}, "datePosted": "2020-10-23T11:01:42+0100", "description": "&lt;p&gt;We have exciting opportunities for a Band 5 nurse to join our friendly and supportive acute medical and nursing team who are committed to providing and maintaining high standards of patient care, specialising in Gastroenterology nursing.&lt;/p&gt;\n&lt;p&gt;Ward L2 specialises in acute medical nursing. The Unit has 24 beds consisting of 3 teams overseen by a dedicated duty coordinator and a supervisory Ward Manager. You will be looking after patients with hepato-biliary issues, IBS and substance abuse problems.&lt;/p&gt;\n&lt;p&gt;L2 has achieved and maintained SCAPE status as assessed through the Trust Nursing Assessment and Accreditation System.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and energetic nurse who is willing to get stuck in and hit the ground running. You’ll be someone who works well under pressure, is a great team player as well as being self-motivated and able to work independently when needed. A nursing professional you’ll be someone who truly understands the need for care, consideration and respect for our patients but also applies these qualities to your team members.&lt;/p&gt;\n&lt;p&gt;You will also be committed to delivering a high standard of patient care and have interest in the acute nursing care within the gastroenterology field. Excellent communication skills and the ability to work effectively as part of a multidisciplinary team is essential. A flexible approach and the ability to respond appropriately to the demands of a rapidly changing acute clinical environment are also essential.&lt;/p&gt;\n&lt;p&gt;In return we can offer you a structured orientation programme through endoscopy where a high percentage of our patients go for procedures (can we add any more detail about this) and the support of our dedicated Practice development team, Supervisory Ward Sisters, specialist advanced practitioners, hepato-biliary specialist nurses, a dedicated Discharge co-ordinator and 8 dedicated specialist Consultants. You will receive a supernumerary period to enable you to gain the skills and competency required to care for acutely ill patients.&lt;/p&gt;\n&lt;p&gt;Posts are offered on a full time and part time basis. This post requires flexible working patterns to meet the needs of the service to include bank holidays and weekends as required. If you are a newly qualified nurse we will pay your first year&#39;s NMC registration fee as well as paying you at Band 4 until you receive you NMC PIN. &lt;br /&gt;&lt;br /&gt;If you are passionate about Acute Medicine and want to make a difference then this may be then right role for you. We’d love to show you around so you can see for yourself.&lt;/p&gt;\n&lt;p&gt;Salford Royal has teamed up with housing association Salix Homes to provide a 26-apartment complex for doctors, nurses and other clinical staff new to the Trust. Please enquire upon appointment to review availability.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise NuttJob titleLead NurseEmail addressLouise.Nutt@srft.nhs.ukTelephone number0161 2060363Additional contact information&lt;/p&gt;\n&lt;p&gt;Nina Mir &lt;br /&gt;Ward Manager&lt;br /&gt;0161 2060749&lt;/p&gt;\n&lt;p&gt;Louise Nutt&lt;br /&gt;Lead Nurse &lt;br /&gt;0161 2060363&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Qualified Nurse - Gastroenterology Ward L2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240188", "validThrough": "2020-11-08T23:59:59+0000"}