{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58769", "minValue": "48859", "unitText": "YEAR", "value": "£48,859 - £58,769 per annum"}}, "datePosted": "2020-10-27T12:01:16+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Reference Number&lt;/strong&gt;: 919-SA-18077157-EXT&lt;br /&gt;&lt;strong&gt;Job title&lt;/strong&gt;: Quality Assurance Advisor&lt;br /&gt;&lt;strong&gt;Employer : &lt;/strong&gt; Public Health England&lt;br /&gt;&lt;strong&gt;Department&lt;/strong&gt;: Screening QA Service, North&lt;br /&gt;&lt;strong&gt;Locations&lt;/strong&gt;: Manchester&lt;br /&gt;&lt;strong&gt;Salary:&lt;/strong&gt; £45,753-£51,668 per annum&lt;br /&gt;&lt;strong&gt;Hours&lt;/strong&gt;: 37.5 Hours per week&lt;br /&gt;&lt;strong&gt;Job Type&lt;/strong&gt;: Permanent&lt;br /&gt;&lt;strong&gt;Closing Date&lt;/strong&gt;: Tuesday 10 November 2020&lt;br /&gt;&lt;strong&gt;Interview Date&lt;/strong&gt;: Thursday 26 November 2020&lt;/p&gt;\n&lt;p&gt;The Screening Quality Assurance Service (SQAS) is part of the Health&lt;br /&gt;Improvement Directorate within Public Health England. It aims to provide a&lt;br /&gt;world class QA service for NHS screening programmes, providing consistent,&lt;br /&gt;high quality expert advice to providers and commissioners of screening&lt;br /&gt;programmes.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Assuring and driving up the quality of services is essential if screening is to&lt;br /&gt;achieve the intended benefits to population health, while minimising&lt;br /&gt;unintended harms to those taking part.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Applications are invited for a permanent position to the role of QA advisor in&lt;br /&gt;the Screening QA Service (Health Improvement Directorate, North ANNB&lt;br /&gt;team, with line management from the North West Team for the permanent&lt;br /&gt;position) – please see the job descriptions attached for further details. Note –&lt;br /&gt;the post is open to both clinical and non-clinical applicants.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking to appoint a motivated and enthusiastic team member to&lt;br /&gt;undertake a permanent position as a QA Advisor for the antenatal and&lt;br /&gt;newborn screening programme in the North QA Screening Service based at 3&lt;br /&gt;Picadilly Place, Manchester. It may be necessary to travel (expenses paid)&lt;br /&gt;between sites across the North region and nationally.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a QA Advisor, the successful applicant will be required to support the&lt;br /&gt;Senior QA Advisor(s) in the delivery of a comprehensive programme of quality&lt;br /&gt;assurance. They will work collaboratively with colleagues from other regional&lt;br /&gt;SQAS teams and nationally, in order to promote consistency across national&lt;br /&gt;screening programmes and in the delivery of the regional QA function. They&lt;br /&gt;must be able to operate independently with the capability to interpret,&lt;br /&gt;implement and provide specialist advice but recognise when to refer matters&lt;br /&gt;of particular complexity/sensitivity to more senior staff.&lt;/p&gt;\n&lt;p&gt;Evidence of current professional registration is desirable.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Some of the main duties and responsibilities will be to:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- support local antenatal and newborn screening services, providing&lt;br /&gt;advice while building and managing relationships with local, regional&lt;br /&gt;and national stakeholders&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- support the development of policy, methods and tools for quality&lt;br /&gt;assurance, participating in national projects&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- provide support to local antenatal and newborn screening services&lt;br /&gt;through regular communications and meetings, including attending&lt;br /&gt;formal governance meetings and supporting training and networking&lt;br /&gt;opportunities&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- contribute to screening incident identification, management and&lt;br /&gt;resolution for antenatal and newborn screening services&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- manage visits/reviews of local antenatal and newborn screening&lt;br /&gt;services, liaising with professional and clinical advisors, collecting&lt;br /&gt;evidence and writing reports&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- manage team members complete QA reports in accordance with&lt;br /&gt;timescales&lt;br /&gt;&lt;br /&gt;The postholder will be a highly organised, skilled communicator. They will&lt;br /&gt;understand the principles of population-based screening programmes in the&lt;br /&gt;UK with extensive knowledge of specialist areas and experience of working in&lt;br /&gt;screening programmes, in a quality assurance role or in a related field.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for applications: midnight, Tuesday 10 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Interviews will be held on Thursday 26 November 2020 via Teams virtual link&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For further information or an informal discussion about these posts, please&lt;br /&gt;contact Pam Tarn pam.tarn@phe.gov.uk&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Please seek the support of your current line manager before applying. SQAS&lt;br /&gt;staff should follow the SQAS temporary role development process.&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Applicants are strongly advised to use the criteria in the person specification&lt;br /&gt;(available online) as sub-headings in their application to make it clear how&lt;br /&gt;they meet each of the selection criteria. Please also see job description for&lt;br /&gt;competencies&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;When applying for this role, please indicate in the opening line of your&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Supporting Information, “I am a surplus/at risk employee in the civil&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;service”, if applicable.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Public Health England promotes diversity in the workplace and is an equal&lt;br /&gt;opportunities employer&lt;/p&gt;\n&lt;p&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "3 Piccadilly Place, Manchester", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "QA Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244382", "validThrough": "2020-11-10T23:59:59+0000"}