{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 to 37,267"}}, "datePosted": "2020-11-04T15:30:53+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;This is an internal advert for the Kent and Medway CCG. If you are applying for the role outside of K&amp;M CCG your application will be ineligible.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS Kent and Medway Clinical Commissioning Group &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Complaints and Freedom of Information Manager - Band 6&lt;/p&gt;\n&lt;p&gt;Due to a vacancy within our team, we are able to offer the following opportunity for a motivated individual, with expertise and knowledge of Complaint and Freedom of Information (FOI) handling and wishing to develop their career working within a Clinical Commissioning Group. This is a patient-focussed role that will involve leading the corporate Complaints and FOI team and working closely with the Accountable Officer, Executive Directors, Managers and staff across the CCG, to improve the patient experience.&lt;/p&gt;\n&lt;p&gt;The Corporate Services Team plays a pivotal role in managing corporate governance / affairs across the organisation; in short, the team provides the full range of back office functions that enable the other departments within the organisation to focus solely on the commissioning and delivery of high quality, accessible and timely patient care.&lt;/p&gt;\n&lt;p&gt;We are seeking an individual with relevant experience and case management who will, oversee and work as part of a team to co-ordinate complaints, MP enquiries and FOI requests as appropriate. The role will also include quality assurance of draft responses when provided, with the discretion to decide on the issuing of responses. You will provide advice on the best approach to handling complaints and FOI’s to the greater CCG. You will also be responsible for ensuring the CCG Publication Scheme is managed within the relevant legislation.&lt;/p&gt;\n&lt;p&gt;The role will also include line management of the Complaints and FOI Team and supporting the Senior Head of Corporate Governance with the preparation of assessment and reports for the CCG Audit Committee and Executive Management Team.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have excellent interpersonal, communication and influencing skills, with relevant experience and understanding of complaints and FOI standards, preferably in a local health setting. They will also have a proven track record of building relationships and able to gain the trust of senior managers and staff, and use of their own initiative under pressure and to meet deadlines.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Kent and Medway Clinical Commissioning Group (formerly known as NHS Swale CCG)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Medway", "postalCode": "TN23 1PP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1477", "longitude": ".875876"}}, "title": "Complaints and FOI Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256440", "validThrough": "2020-11-18T23:59:59+0000"}