{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-26T10:23:27+0000", "description": "&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having a ‘Outstanding’ rating overall, having being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Community Mental Health Team in our latest CQC inspection, which found that: ‘There was a clear vision, underpinned by a set of values that were well understood by staff across the trust.&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Royal Berkshire Hospital Psychiatric Liaison Team is an established CORE 24 service as outlined by NHS England. The team is also accredited with the Royal College of Psychiatrists. The role of the Advanced Mental Health Practitioner within this service is to provide an assessment service to people who are referred to the psychiatric liaison service from the Emergency Department and from the acute admission wards at Royal Berkshire Hospital.&lt;/p&gt;\n&lt;p&gt;The post holder will assess new service users to the service, who present to the Royal Berkshire Hospital Emergency Department or patients admitted on the General Acute wards within Royal Berkshire Hospital. The inclusive age range is 16 years and above.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for the formulation, execution and evaluation of a care plan, including signposting to other services. The post holder will ensure that each individual plan is developed in consultation/agreement with the service user and informed by the wider multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;The post holder will operate within a multidisciplinary team and will be responsible for the delivery of care, risk management and evaluation of care, emphasising individual service user’s recovery.&lt;/p&gt;\n&lt;p&gt;The post holder will be confident in taking positive risk in accordance with the Trust Policy around Risk Assessment and management.&lt;/p&gt;\n&lt;p&gt;As an experienced mental health practitioner the post holder will direct and supervise senior mental health practitioners and/or students and resources within their area of responsibility and take an active participation in clinical quality assurance and learning programmes.&lt;/p&gt;\n&lt;p&gt;If you should require any further information or to arrange an informal visit you are welcome to contact: Jackie Glenister who is the Service Manager for the team on 07795013928 or Colin O&#96;Brien who is the service lead on 07890607305&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. If you should require any further information or to arrange an informal visit you are welcome to contact: Jackie Glenister who is the Service Manager for the team on 07795013928 or Colin O&#96;Brien who is the service lead on 07890607305&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to a car salary sacrifice scheme (available to all permanent staff over the age of 21), we as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Colin O&#39;Brien&lt;/p&gt;\n&lt;p&gt;Email address Colin.Obrien@berkshire.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 07786705327&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Senior Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242006", "validThrough": "2020-11-09T23:59:59+0000"}