{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-03T10:31:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you looking for a challenge with a breath of fresh air?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you passionate about the NHS, keen to gain a broader skill base and develop your expertise?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hywel Dda University Health Board are looking for an enthusiastic Pharmacist to work in the Hywel Dda Primary Care Medicines Optimisation Team, within the Carmarthenshire locality. You will be responsible for providing prescribing advice to GPs and other health professionals and undertaking medication reviews, with the aim of reducing risk, improving quality and promoting cost effective prescribing. This post will enable you to deepen your knowledge and expertise, and broaden transferable skills under the direction of experienced colleagues. You will build on previous experience, developing greater autonomy and responsibility, whilst gaining an understanding of the whole patient journey.&lt;/p&gt;\n&lt;p&gt;As part of the primary care team you will offer targeted support in areas such as patient safety and medicines optimisation. You will advise and influence various healthcare professionals, including GPs, nurses, prescribing clerks in GP surgeries as well as staff in care homes and colleagues in community pharmacy. You will be supported by a friendly, welcoming team with a vast amount of expertise to help mentor you on your career path.&lt;/p&gt;\n&lt;p&gt;The Medicines Optimisation Team will provide support and training to help you work confidently with practitioners on prescribing projects. The post will be based in one of the primary care offices but will involve travel to GP practices so you must be able to travel between sites in a timely manner. Experience in primary care is not essential, although enthusiasm to work in primary care, the motivation to organise your own work, and the ability to work as part of a team is important.&lt;/p&gt;\n&lt;p&gt;This is a part time post and job sharing or flexible working patterns can be accommodated. The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRhian JohnJob titleCarmarthenshire Cluster Lead PharmacistEmail addressRhian.john4@wales.nhs.ukTelephone number01554 783281Additional contact information&lt;/p&gt;\n&lt;p&gt;Mair Davies&lt;/p&gt;\n&lt;p&gt;07813 780735&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prince Philip Hospital, Llanelli", "postalCode": "SA14 8QF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6916", "longitude": "-4.136"}}, "title": "Specialist Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253460", "validThrough": "2020-11-19T23:59:59+0000"}