{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata per annum"}}, "datePosted": "2020-10-26T15:46:42+0000", "description": "&lt;p&gt;&lt;span&gt;Kent Community Health NHS Foundation Trust has great opportunities for friendly and motivated people who want to work in a busy, caring Musculoskeletal Physiotherapy Department . We have recently been rated Outstanding by the CQC&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our philosophy is to keep the patient at the heart of everything we do. Every person that works for our Service, regardless of their role, comes into contact with our patients and visitors and so is expected to uphold our values of caring with compassion, listening, responding, empowering and striving for excellence at all times. We look for people who are willing to go the extra mile, not because they are asked to, but because they are committed to being part of a healthcare team that delivers an excellent caring service to our patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a receptionist to work in the MSK physiotherapy department at Sevenoaks Hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your main responsibilities will include dealing with face to face and telephone queries and reception duties. Alongside this, you will provide administrative support to the physiotherapists and the team leader. You will be part of a small and friendly administrative team at Sevenoaks and a larger administrative team across West Kent and you will be exptected to travel to all West Kent Sites.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be an ambassador for the service, delivering high quality customer service to service users and visitors and therefore will have excellent communication and people skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will need to be able to work in a very busy environment whilst remaining calm and be able to demonstrate a good understanding of and commitment to delivering excellent customer service. The ability to work independently, proactively and under pressure is important. A positive attitude and a welcoming disposition towards our patients and visitors are essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful applicants are required to have the qualification level specified in the person specification in order to carry out the job, however, we do welcome applicants from individuals wishing to further their knowledge and skills and to gain this recognised qualification, which we will support. So if you do not have the essential qualification for the role, this may not be an automatic barrier to you being offered an interview. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are successful at interview but do not have the essential qualification for the role, we will employ you as trainee and will support you to gain this qualification. You will develop new skills and knowledge whilst working with an established team, gaining valuable work experience and continuing to get paid. Once you receive the qualification you will automatically move into the position advertised.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interviews will be held on 25th November 2020.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of the interview process there will be a literacy and numeracy test. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications for full time, part time and job share will be considered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have to be able to travel across the Trust in a timely manner&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKay Murphy-OReillyJob titleAdmin Team Co-ordinatorEmail addresskay.murphy-oreilly@nhs.netTelephone number0300 123 1951&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sevenoaks Hospital, Sevenoaks", "postalCode": "TN13 3PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2883", "longitude": ".194757"}}, "title": "Receptionist/Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243215", "validThrough": "2020-11-15T23:59:59+0000"}