{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inc"}}, "datePosted": "2020-10-26T10:01:16+0000", "description": "&lt;p&gt;Barts Health is the largest trust in the NHS and one of the leading healthcare providers in the country. The trust’s six hospitals deliver high quality compassionate care to the 2.5 million people of east London and beyond.&lt;br /&gt;&lt;br /&gt;Barts Health NHS Trust: Barts Health’s vision is to become a healthcare organisation that offers urgent specialist and community services tailored to meet the needs of local communities. We are committed to recruiting staff that will help us meet our Vision for Changing Lives, and demonstrate behaviours we believe make Barts Health a great place for patients, their families and friends, the public and staff. Our Barts Health Values which align with our behaviours are:&lt;br /&gt;&lt;br /&gt;• Caring &amp; compassionate with patients, each other and our partners&lt;br /&gt;• Actively listening, understanding and responding to patients, staff and our partners&lt;br /&gt;• Relentlessly improving and innovating for patient safety&lt;br /&gt;• Achieving ambitious results by working together&lt;br /&gt;• Valuing every member of staff and their contribution to the care of our patients&lt;br /&gt;&lt;br /&gt;Barts Health NHS Trust has a safeguarding policy for both adults and children and is committed to all Safeguarding legislation and current standards. Every member of trust staff has a responsibility to safeguard and protect children and adults.&lt;/p&gt;\n&lt;p&gt;Barts Health Nuclear are currently recruiting for a Nuclear Medicine Technologist bands 6 to work at one of the country’s largest NHS Trusts for a permanent contract.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, self motivated professionals to work across all of their main sites at Barts. Sites include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The Royal London Hospital&lt;/li&gt;\n&lt;li&gt;St Bartholomew’s Hospital&lt;/li&gt;\n&lt;li&gt;Whipps Cross University Hospital&lt;/li&gt;\n&lt;li&gt;Newham University hospital&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To be eligible for these positions, you will need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 4 months NHS experience&lt;/li&gt;\n&lt;li&gt;Ability to develop own skills and provide information to others to help their development&lt;/li&gt;\n&lt;li&gt;Ability to plan, prioritise and organise workload&lt;/li&gt;\n&lt;li&gt;Demonstrate ability to work under pressure&lt;/li&gt;\n&lt;li&gt;Experience in Nuclear Medicine and PET-CT clinical enviroment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a Barts Health NHS Trust worker, you will have the opportunity to gain valuable NHS experience as well as benefitting from:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive pay rates according to NHS agenda of change&lt;/li&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;Working with high level equipment and different procedures, including PET and SPECT scanners.&lt;/li&gt;\n&lt;li&gt;Being involved in research projects&lt;/li&gt;\n&lt;li&gt;Possibilities to develop professionally in the field&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are interested in this role, then please apply below and we will be in touch with you for a job interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGiorgio TestaneraJob titleCross-Site Lead RadiographerEmail addressg.testanera@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Bartholomews Hospital, London", "postalCode": "EC1A 7BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.517", "longitude": "-.100858"}}, "title": "Nuclear Medicine Radiographer- Technologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241940", "validThrough": "2020-11-09T23:59:59+0000"}