{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £51,668 pa, pro-rata"}}, "datePosted": "2020-10-23T13:04:18+0100", "description": "&lt;p&gt;&lt;strong&gt;24 hours per week - permanent.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Development opportunity supported by Competency Framework&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;SALARY: ‘Agenda for Change’ Band 7/8a: £38,890 - £51,668 pa, pro-rata (depending on experience)&lt;/p&gt;\n&lt;p&gt;We are seeking a motivated and enthusiastic clinical psychologist or principal clinical psychologist. The post is based on Greenfields Unit Mount Gould Hospital, a 9 bedded Recovery in-patient mental health unit for Women.&lt;/p&gt;\n&lt;p&gt;In this post, your main focus will be the aim of providing psychological consultation and support to our multidisciplinary team. You will also have opportunity to provide direct clinical input, including individual therapeutic work, groups and support to family members. The post is key member of the Greenfields multi-disciplinary team but has associated links within the wider Specialist Adult Mental Health Psychology Team, which has a culture of supporting creative approaches to service delivery, and regular opportunities for supervision, peer support and informal professional development are available within the team.&lt;/p&gt;\n&lt;p&gt;This post would be an excellent for someone looking to develop skills in consultancy and working with systems and gain experience of clinical leadership and working at an increased level of responsibility. Candidates will require knowledge of Women’s Mental Health in-patient services, skills and practice of clinical psychology.&lt;/p&gt;\n&lt;p&gt;Experience of supporting and delivering training to in-patient mental health services is desirable. However the team would be keen to welcome a candidate with a passion and an interest in supporting the needs of women’s mental health and the opportunity to use a competency framework to support a career development pathway with our service.&lt;/p&gt;\n&lt;p&gt;You will need to enjoy working in a challenging environment and responding quickly to a wide range of complex issues.&lt;/p&gt;\n&lt;p&gt;Livewell Southwest values its staff and makes investment in their development a priority. Currently we offer the following development opportunities for staff:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A minimum of three days protected CPD for registered staff&lt;/li&gt;\n&lt;li&gt;Development pathways for unregistered staff from apprentice to bands 2, 3 and 4 and for registered staff in bands 5, 6, 7 and 8&lt;/li&gt;\n&lt;li&gt;Leadership programmes&lt;/li&gt;\n&lt;li&gt;Coaching and mentoring&lt;/li&gt;\n&lt;li&gt;Medicines Management, leg Ulcer Management and Assessment Training&lt;/li&gt;\n&lt;li&gt;Access and funding for training including Care Certificate, Assistant Practitioners Course and Scholarship Into Nurse Training&lt;/li&gt;\n&lt;li&gt;Robust Preceptorship&lt;/li&gt;\n&lt;li&gt;An induction programme tailored to your needs&lt;/li&gt;\n&lt;li&gt;Relocation package may be considered for the right candidate for certain roles&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Rewards and benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Discounts available from retailers, UK hotels and main attractions – often up to 15% savings&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme and competitive Pension Scheme with Scottish Widows and/or Government Pension scheme (conditions apply)&lt;/li&gt;\n&lt;li&gt;Lease car scheme (available after satisfactory completion of probation/conditions apply)&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme (available after satisfactory completion of probation)&lt;/li&gt;\n&lt;li&gt;School holiday childcare subsidies&lt;/li&gt;\n&lt;li&gt;Multiple flexible working options&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Livewell Southwest can allow existing members of the NHS Pension Scheme to continue their membership when they join the organisation.&lt;/p&gt;\n&lt;p&gt;All Livewell Southwest staff are expected to able and willing to work across a 7 day service.&lt;/p&gt;\n&lt;p&gt;Job share(s) considered.&lt;/p&gt;\n&lt;p&gt;Informal enquiries to: Diane Bratt (Ward Manager – Greenfields), on (01752) 434319 or Elina Baker (Consultant Specialist Psychologist), via elina.baker3@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127014.jpg", "name": "Livewell Southwest CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL4 7QD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3785", "longitude": "-4.11514"}}, "title": "Clinical Psychologist – Development Opportunity", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240649", "validThrough": "2020-11-27T23:59:59+0000"}