{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 per annum"}}, "datePosted": "2020-10-06T13:15:44+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse - 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bluebell Ward - Transfer To Assess Unit is seeking hard working and dedicated Registered Nurses to join us. Our team provide an interim period of care for medically optimised patients, who no longer require acute medical treatment. The unit provides an holistic care setting which supports the ethos of care closer to home, promoting a suitable environment for the completion of assessments when discharge home from hospital is not an option.&lt;/p&gt;\n&lt;p&gt;Bluebell is a satellite ward, a community in-patient facility, based at the The Meadows Community Hospital in Offerton, part of Stockport NHS Foundation Trust. The ward has a multi-disciplinary team; Nurses, Occupational Therapists, Physiotherapists and Social Worker input, with medical cover provided by a local GP practice. As the unit currently offers a step-down pathway from Stepping Hill Hospital, transfers take place 7 days per week, working closely with the discharge co-ordination team. Emphasis is placed on the patient and their families, ensuring they are at the centre of all decisions, respecting their knowledge and opinions and working alongside them to get the best possible outcome. The length of stay should be time limited, ideally up to 2 weeks, however, this can be longer in some cases. Robust and thorough MDT discharge planning is essential in ensuring the patient is discharged safely and in a timely manner, therefore knowledge and experience of integrated community working would be an advantage.&lt;/p&gt;\n&lt;p&gt;If you are motivated, enthusiastic and thrive on change to achieve outstanding patient centred care, then you may be the person that we are looking for. Our expectations are high for every person in our care and excellent communication skills, both written and verbal, are essential and your ability to prioritise whilst working under pressure is vital for our fast paced unit. You must be reliable and trustworthy to support the safeguarding and welfare of vulnerable adults. Compassionate and dignified care is paramount for all our care providers.&lt;/p&gt;\n&lt;p&gt;In return, the Trust provides training and development programmes offering diverse opportunities for career progression. Every person in our team is valued, respected and encouraged to achieve their full potential.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary&lt;/p&gt;\n&lt;p&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKirstie DoyleJob titleWard ManagerEmail addressKirstie.doyle@stockport.nhs.ukTelephone number01618356295Additional contact information&lt;/p&gt;\n&lt;p&gt;Kirstie Doyle, Ward Manager&lt;/p&gt;\n&lt;p&gt;Tel: 0161 835 6295&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Meadows Community Hospital, Offerton., Stockport", "postalCode": "SK2 5EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3989", "longitude": "-2.121"}}, "title": "Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214804", "validThrough": "2020-11-08T23:59:59+0000"}