{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19000", "minValue": "19000", "unitText": "YEAR", "value": "£19,000"}}, "datePosted": "2020-11-02T11:38:31+0000", "description": "&lt;p&gt;Everything we do is aimed at providing the very best quality and person-centred support in the right location at the right time, making a real difference for the people and communities we support.&lt;/p&gt;\n&lt;p&gt;We are currently looking for a senior support worker to work as part of a team providing support to individuals with Learning Disabilities within their own home; you will either have previous support worker experience or be currently working as a senior support worker in healthcare, mental health, autism, learning difficulties or people with acquired brain injuries.&lt;/p&gt;\n&lt;p&gt;Everyone is different and so are the people we support: We deliver support around the needs and wishes of individuals and a valued senior support worker, you will assist the Supported Living Manager in maintaining a high quality of support, acting as a role practitioner, coaching and mentoring support workers to ensure the people supported achieve the outcomes identified within their support plans.&lt;/p&gt;\n&lt;p&gt;We are looking for ambitious individuals of a caring nature to work for a company where we promote independence in a supportive environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will I be doing?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Turning Point, we support people with Learning Disabilities across England.&lt;/p&gt;\n&lt;p&gt;As a Senior Support Worker, you will make a real difference to residents&#39; lives as you improve their daily living skills. Passionate about people, you will enjoy the scope and support to enhance your own life and career too, as you gain the experience and training you need to progress with us.&lt;/p&gt;\n&lt;p&gt;The role of the Senior Support Worker is to support the management team in supporting the supervision of the Support Worker team in their day to day activities and that new staff are inducted to their roles, including temporary and agency staff.&lt;/p&gt;\n&lt;p&gt;Taking the responsibility of running the shift as the senior person on duty, supporting people to take their medication, monitoring and recording medication, dealing with individuals’ finances and petty cash, ensuring we are working to compliance and following the organization’s policies and procedures. Senior Support Workers will model their own good practice within the team to ensure a high quality service is provided. It’s a hands-on job so you will also be supporting people with a full range of daily activities, including supporting people with personal care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What skills and qualities do I need to have?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have to have Support Work experience, ideally within Learning Disability setting.&lt;/p&gt;\n&lt;p&gt;You will also be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Passionate, caring and enthusiastic&lt;/li&gt;\n&lt;li&gt;Flexible, patient and non-judgemental&lt;/li&gt;\n&lt;li&gt;A great team player with lots of energy&lt;/li&gt;\n&lt;li&gt;Able to demonstrate good communication skills&lt;/li&gt;\n&lt;li&gt;Able to complete the physical aspects of the role such as manual handling&lt;/li&gt;\n&lt;li&gt;It would be an advantage if you can use a computer, produce documents in word and use emails&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Turning Point?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What benefits will I receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive Learning and Development opportunities - we are Investors in People Silver accredited&lt;/li&gt;\n&lt;li&gt;28 days holiday, increasing with each year of service until 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including, bike to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive Pension and Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme and access to online Health and Wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work/life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts including Cinema, Groceries and Gym&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thurcroft, Rotherham", "postalCode": "S66 9LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3958", "longitude": "-1.25726"}}, "title": "Senior Support Worker - John Street -Learning Disabilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251850", "validThrough": "2020-12-01T23:59:59+0000"}