{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-30T15:31:32+0000", "description": "&lt;p&gt;We are looking for an inspirational, dynamic and experienced leader who can bring enthusiasm and energy to the Matron role within our busy Theatre Complex, to drive the development of services which focus on quality, efficiency and productivity.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be part of the leadership team with responsibility for the strategic direction of the Theatre Complex. They will have experience of driving change to deliver safe and effective patient care in new and innovative ways. As Matron, you will be fully accountable for the Emergency, Trauma and a range of specialty theatres and work alongside a counterpart whose focus will be on day case and elective surgery.&lt;/p&gt;\n&lt;p&gt;Your responsibilities will encompass Human Resources management, cost improvement, service development, training and education and delivery of key performance indicators relating to the quality and safety standards within the theatre complex. You will also contribute to the divisional Matron team who support daily operational activities and affect change across the wider trust; whilst also contributing to the strategic direction for the division and organisation as a whole.&lt;/p&gt;\n&lt;p&gt;Our Theatre complex is a dynamic department with an outstanding team of staff delivering high quality care, 7 days a week. The flexibility, determination and engagement they have shown through these most difficult of times has been truly inspirational and demonstrates the huge potential and opportunity for the successful candidate in this post.&lt;/p&gt;\n&lt;p&gt;Our modern hospital is set just outside the vibrant city of Norwich, in the beautiful county of Norfolk - the land of big skies, stunning beaches and rolling countryside. Our busy and evolving hospital provides care to nearly a million patients each year and our passion for research and development is supported by our close links to the Norwich Research Park and University of East Anglia.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time:&lt;/strong&gt; 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: &lt;/strong&gt; 24th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Open for applications:&lt;/strong&gt; 30th October 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Close for applications:&lt;/strong&gt; 9th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Danny Brewster - Senior Divisional Matron&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel:&lt;/strong&gt; 01603 646671&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email:&lt;/strong&gt; Daniel.brewster@nnuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;OR&lt;/p&gt;\n&lt;p&gt;Heather Watts - Divisional Nurse Director&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email:&lt;/strong&gt; heather.watts2@nnuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Norwich University Hospital, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "In-Patient Theatre Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250757", "validThrough": "2020-11-09T23:59:59+0000"}