{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 per annum, (pro-rata for part-ti"}}, "datePosted": "2020-11-06T13:30:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Calling all neonatal superheroes!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt; &lt;/strong&gt;Would you like to work in a flagship £88m brand new bespoke maternity hospital? Does the thought of working for a service that is developing neonatal unit based ECMO cots excite you? Then Leicester Neonatal Services could be the place for you.&lt;/p&gt;\n&lt;p&gt;There has never been a more exciting time to join UHL. We are now looking to start expanding our superhero team ready for when our brand spanking new maternity hospital opens. The expansion plan for our new hospital includes approximately 70 cots split between Neonatal ECMO, Intensive Care, High Dependency, Special Care and Transitional Care.&lt;/p&gt;\n&lt;p&gt;Attractive opportunities are available for highly motivated registered QIS neonatal nurses to join our forward thinking, compassionate, family focused Neonatal Service.&lt;/p&gt;\n&lt;p&gt;Staff well-being is at the heart of our service and we encourage and support both personal and professional development through education and training opportunities.&lt;/p&gt;\n&lt;p&gt;Initially this post may require cross site working as our service is currently based across 2 sites; the Leicester Royal Infirmary and the Leicester General Hospital. An easy task for a superhero!&lt;/p&gt;\n&lt;p&gt;Our level 3 unit at Leicester Royal Infirmary currently has capacity for 36 cots split between Intensive Care, High Dependency and Special Care. Our level 1 unit at Leicester General Hospital currently has 12 special care cots. We are also proud to host a neonatal transport team, a network wide homecare team, a virtual transitional care service and an active, bespoke neonatal research team. So wherever your neonatal passion lies, we have the place for you to work and the opportunities for you to develop and progress!&lt;/p&gt;\n&lt;p&gt;As a neonatal service we are the lead centre for the South Hub of East Midlands Neonatal Operational Delivery Network (EMNODN) and we can offer you experience in both medical and surgical neonatal care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Capes are optional!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 22-November-2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Marie Hoy, Ward Manager-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;marie.hoy@uhl-tr.nhs.uk&lt;/li&gt;\n&lt;li&gt;0116 2585831&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester Royal Infirmary, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259918", "validThrough": "2020-11-22T23:59:59+0000"}