{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-05T13:00:19+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Paediatric Sister/Charge Nurse - Band 6 - Emergency Department - 37.5 hours per week - Permanent&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Emergency Department at the West Suffolk Hospital Foundation Trust. We are seeking to recruit a Band 6 Paediatric Sister / Charge Nurse into our team. We are looking for an experienced nurse with a minimum of two years’ experience in acute paediatric nursing. The ability to demonstrate experience of shift leading is essential. Our main goal at the WSH Emergency Department is to provide quality patient centred care, whilst striving as a team and as a Trust, to achieve the national ED targets.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants will need to demonstrate a dynamic, hardworking and passionate approach to delivering the highest quality patient care, and role modelling to the junior staff you will be leading. You will have the opportunity to work clinically in the department, as well as actively contributing to the practice development and education of the Emergency Nursing Team and further development of the paediatric area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Following a CQC inspection in 2019, our Emergency Department received an overall rating of ‘Good’. We are passionate supporters of our nursing team at every grade, but recognise the unique skills and experience that our Band 6 staff bring to the team. As our ideal candidate you must have a strong desire to deliver high quality ED nursing care as part of a motivated team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In addition to the team of paediatric ED nurses and allocated support from the medical team (providing 2 doctors per day) we have a dedicated and enthusiastic ED work force that includes Acute Clinical Practitioners (ACPs) and Emergency Nurse Practitioners (ENPs) who can see, treat and discharge their own patients, assisting the medical ED team in delivering excellent care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;No previous ED experience necessary, there is a comprehensive training package as well as on-going training open to all ED staff provided by our dedicated Practice Development Nurse. There are also opportunities for trauma and EPALS training as well as support for on-going education.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Informal visits are welcomed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further enquiries please email our ED children’s lead, Ruth at ruth.hassall@wsh.nhs.uk&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**Relocation package of up to £2000 available for the successful candidate. Please refer to our Removal and Accommodations Expenses’ Policy under ‘Additional Documentation’**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are an overseas applicant and need to complete the IELTS exam to be able to register with the NMC then the Trust will fund 1 attempt at the exam. If required the Trust will fund the cost of one additional IELT / OET from Level 6.5 to Level 7 / OET grade C+ to grade B.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis*&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does&lt;/strong&gt; entitle you to apply to park on the Hospital site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To view the Job Description and Person Specification for this position, please click on the Job Description link (below). You should use the Additional Information section of your application to state how you meet the requirements of the Person Specification.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at &lt;strong&gt;Enhanced&lt;/strong&gt; level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**Recommend a friend or family member and earn cash! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have a friend or family member you would recommend to join us? Or do you know someone who wants to return to practice in the NHS? If you recommend a nurse (band 5 or 6) or operating department practitioner, you could receive a £1,000 thank you. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If the person you refer is appointed into a permanent position you will receive £500 when they commence and a further £500 after their first &lt;/strong&gt;&lt;strong&gt;12 month anniversary.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact the recruitment team if you require further info!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Padiatric Sister/Charge Nurse - Band 6 - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257747", "validThrough": "2020-11-19T23:59:59+0000"}