{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a. inc. HCA"}}, "datePosted": "2020-10-22T10:01:04+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Clinical Research Assistant post to support the delivery of the Atopic eczema Systemic Therapy Register (A-STAR) at Guy’s and St Thomas’ NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated, enthusiastic and quality focused individual with excellent communication and time management skills, who will work well as part of the A-STAR team.&lt;/p&gt;\n&lt;p&gt;A-STAR is a national study supported by the British Association of Dermatologists and has already set up 14 sites across England, Wales and Scotland, with an expansion to other sites planned.&lt;/p&gt;\n&lt;p&gt;The Unit for Population-Based Dermatology Research at St John’s Institute of Dermatology is the A-STAR Coordinating Centre (Chief Investigator: Professor Carsten Flohr, Chair in Dermatology and Population Health Science at King’s College London).&lt;/p&gt;\n&lt;p&gt;The main purpose of the role of the Clinical Research Associate is to maximise patient recruitment and follow-up to A-STAR. This will involve working closely with the local Principal Investigators and the dermatology teams to identify the barriers to recruitment in their centres and to lead in the development of individualised strategies tailored to each centre to help them to overcome these.&lt;/p&gt;\n&lt;p&gt;The post-holder will be expected to advise and set-up individualised working systems and evaluate these systems to work to the local strengths. The successful candidate will be responsible for a number of centres across the UK and will be required to arrange a visit schedule with each of the participating centres. This will therefore require a significant amount of travelling.&lt;/p&gt;\n&lt;p&gt;The Clinical Research Associate will work closely with the A-STAR Study Manager and will attend the Site Initiation Meetings for centres in the UK. The post holder will have considerable contact with NHS Trusts/hospitals, Local Research Networks, universities and other organisations involved in this research project and therefore a successful candidate will need to demonstrate excellent negotiation and interpersonal skills.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have good organisational skills and be able to work both independently and as part of a team, demonstrate a flexible approach to work and meet deadlines using initiative and judgement to prioritise competing demands. In addition, they will have excellent oral and written communication skills.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDorothee BoisferJob titleA-STAR Project ManagerEmail addressA-Star@gstt.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Due to the current situation with COVID, we will only be able to arrange informal conversations with those people who are shortlisted for the post.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Clinical Research Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237805", "validThrough": "2020-11-15T23:59:59+0000"}