{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 p.a."}}, "datePosted": "2020-10-30T09:45:46+0000", "description": "&lt;p&gt;&lt;strong&gt;We have a fantastic opportunity for a Clinical/Counselling Psychologist to work within a highly respected and supportive psychology team here at Milton Keynes Specialist CAMHS (MK Sp CAMHS).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Psychology team is part of a large, well-established and supportive multi-disciplinary team of Psychiatrists, Psychologists, Nurses, Family Therapists, Psychotherapists, Art Therapists and Primary Mental Health Practitioners.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The entire CAMHS service are all housed together within the same which allows for quick and easy access with other colleague and specialties. Strong collaborative working relationships are the norm along with the transfer of knowledge and skills between disciplines.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Management has an open door policy for all staff members which promotes communication.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;MK Sp CAMHS are in the process of moving to the I-Thrive model, this will give you an exciting opportunity to influence service provision across Milton Keynes for young people and their families. There may also be opportunity for training depending on your interest and the needs of the service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There is opportunity for flexible working that is in keeping with the needs of the service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an experienced, skilled and highly motivated Clinical Psychologist for a full-time post on our team. We expect you to have an avid interest as well as experience in working with children, young people and their families.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be responsible for the provision of specialist psychology services to children &amp; young people meeting eligibility criteria for MK Sp CAMHS. You will provide specialist psychological assessment of people referred to the service, and deliver evidenced based individual and group treatment to outpatients.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will support the leadership structure within the team through participation in clinical risk management, audit, service evaluation and research in addition to the supervision of junior staff. It is therefore essential that you can demonstrate both the ability for autonomous thinking and multi-disciplinary team work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name - Dr. Irene Granda-Gage Job title - Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Email address - i.granda-gage@nhs.net Telephone number - 01908 724 544&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eaglestone Health Centre, Milton Keynes", "postalCode": "MK6 5NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0248", "longitude": "-.738428"}}, "title": "Clinical/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249531", "validThrough": "2020-11-13T23:59:59+0000"}