{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 pa inc."}}, "datePosted": "2020-10-16T09:15:38+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the Service and Role:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Greenvale is a 28 bedded Specialist Care Unit situated beside Streatham common. We work with people who have a primary diagnosis of dementia alongside other mental health and physical health conditions. We also provide palliative care and work closely with St Christopher’s and other specialists. We also work with researchers and have had notable visitors from around the world interested in the work we do particularly our Namaste work.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking to recruit Band 5 staff with a passion for working with people with dementia. This is an excellent opportunity to develop your skills in both mental health and physical health care as a basis for your career in nursing.&lt;br /&gt;&lt;br /&gt;We have a large multi-professional team including psychology, occupational therapy, physiotherapy and medical professionals. The team are highly passionate about providing high quality patient centred dementia care.&lt;br /&gt;&lt;br /&gt;We can offer you a robust support package for making the transfer from student nurse to registered nurse. You will receive regular individual and group supervision as well as an appraisal. As a newly registered nurse you will also have access to Preceptorship and Mentorship in order to develop you as a highly skilled and compassionate nurse. There is a strong leadership team on the unit who will guide and support you in your professional development. There is also a nurse council on the unit providing the opportunity to be involved in the development of nursing practice on the unit.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;If successful at shortlisting stage you will be contacted regarding the next stage. &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;**Please note that if you do not state the month and year that you have completed your Nursing qualification you will not be invited to the assessment.**&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Ward Name &amp; Location: Greenvale, Streatham (Lambeth)&lt;br /&gt;Patient Age Range: Over 65&lt;br /&gt;Patient Gender: Mixed&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;South London Partnership&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The South London Mental Health and Community Partnership (SLP) is a collaboration between Oxleas NHS Foundation Trust, South London and Maudsley NHS Foundation Trust, and South West London and St George’s Mental Health NHS Trust, delivering mental health services to a population of more than three million people. The partnership brings together clinical expertise, experience and innovation, aiming to improve quality, use resources most effectively, and deliver best practice consistently to all patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Values&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our values are pivotal - if you can demonstrate that you can uphold the values and ethical practice that is at the heart of all of our organisations, then we will welcome you to join us and will support, train and develop you throughout your nursing and caring journey.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Roy Bhojraz, tel. 0203 228 8031/8020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Greenvale Specialist Care Unit, Voss Court, London, SW16 3BS, London", "postalCode": "SW16 3BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4195", "longitude": "-.126832"}}, "title": "RMN or RGN (NHS) Specialist Care Home Older Adults (Streatham Common)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229401", "validThrough": "2020-11-07T23:59:59+0000"}