{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39000", "minValue": "39000", "unitText": "YEAR", "value": "up to £39,000 per annum DOE"}}, "datePosted": "2020-10-07T14:30:59+0100", "description": "&lt;p&gt;&lt;strong&gt;Break into prison healthcare!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Are you looking for a new challenge in an environment where no two days are the same?&lt;br /&gt; &lt;br /&gt; Are you looking to work for a company that offers support and development opportunities? If so, then this could be the role for you!&lt;br /&gt; &lt;br /&gt; HMP YOI Doncaster is a Cat B Young Offenders and adult male prison based in Doncaster, South Yorkshire.&lt;br /&gt; &lt;br /&gt; Practice Plus Group are the Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;br /&gt; &lt;br /&gt; To ensure the continued quality of care at HMP YOI Doncaster, we’re looking for a Senior Mental Health Nurse to continue providing the best care we can!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; The salary range for this role is up to £39,000 per annum – dependent on experience. We offer a variety of benefits including:&lt;br /&gt; &lt;br /&gt; •Training and development opportunities&lt;br /&gt; •Company contributory pension scheme&lt;br /&gt; •25 days annual leave plus 8 bank holidays&lt;br /&gt; •Staff well-being&lt;br /&gt; •Access to bank hours&lt;br /&gt; •CPD and re-validation support&lt;br /&gt; •Cycle to work scheme as well as online retail discounts, onsite gym and onsite parking&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; As a Senior Mental Health Nurse, you will provide a holistic package of care to patients within the prison system, working with the team to develop and maintain delivery of high quality, individualised, evidence based patient centred nursing care. You’ll manage the assessment of health needs, planning, delivery and evaluation of care for the prison population, including clinical risk assessment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Job Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; You will be a Registered Mental Health Nurse (RMN) and be looking to develop your current skills in a unique and ever changing environment. You will have a passion for learning and development, as well as having the initiative to bring new ideas and opinions on how to improve the healthcare services.&lt;br /&gt; &lt;br /&gt; Prison Healthcare experience is not essential although we do ask that you have experience within primary care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further Job Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; This position is a full time role working 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN5 8UX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5259", "longitude": "-1.14584"}}, "title": "Senior Mental Health Nurse - HMP YOI Doncaster", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216902", "validThrough": "2020-11-29T23:59:59+0000"}