{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-28T09:52:22+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;PLEASE NOTE THIS IS NOT AN ADVERT – APPLICATIONS WILL NOT BE PROCESSED&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;IF INTERESTED IN APPLYING FOR THIS ROLE PLEASE APPLY USING JOB REFERENCE NUMBER:304-A-20-98943&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;At University Hospitals Birmingham we support flexible working and welcome applications from nurses seeking flexible working opportunities and family friendly working hours. &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Newly Registered Staff Nurse, Band 5.&lt;br /&gt; &lt;br /&gt; Are you due to complete your training between &lt;strong&gt;November2020 and March 2021?&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Have you completed in the last 6 months and are looking for your first Staff Nurse post?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Will you have your NMC registration by May 2021?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you enthusiastic about starting your nursing career?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Are you looking for an organisation that will support and invest in your future? if so &lt;br /&gt; University Hospitals Birmingham NHS Foundation Trust can offer you our &lt;strong&gt;PRECEPTORSHIP PROGRAMME.&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a trust we are recruiting newly registered Band 5 nurses to our Preceptorship Programme. We have various posts in a variety of in patient and out patient settings across all of our sites - Queen Elizabeth , Heartlands Good Hope and Solihull Hospitals as well as our community services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are committed to providing the highest standards of care, then we are committed to ensuring you are supported during your transition from student nurse to registered practitioner. &lt;br /&gt; &lt;br /&gt; This is an exciting time to join our Trust, we have an established Preceptorship Programme, designed to support and guide you through the first 12 months post registration. This programme includes: &lt;br /&gt; &lt;br /&gt; A week-long welcome induction programme, covering mandatory training to prepare you for your new role &lt;br /&gt; A formal Preceptorship Development Programme, introducing you to a collaboration of educational departments and clinical services to deliver essential training specifically aimed at newly qualified nurses. &lt;br /&gt; A competency based workbook consolidating skills learnt and providing direction for your first 6 months &lt;br /&gt; A period of supernumerary time in your clinical area &lt;br /&gt; A named preceptor(s) to support you in your clinical area &lt;br /&gt; A named Clinical Educator(s) who offers both pastoral and clinical support &lt;br /&gt; &lt;br /&gt; &lt;br /&gt; As part of our vision to provide the best in care, we are looking for talented and passionate Nurses who share our beliefs and want to grow with our organisation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt; For further information on these exciting opportunities then please contact Sam Ward , Clincal educators for preceptorship on 0121 371 4258 or Kim Davis Sister Workforce and Recruitment - 0121 371 6629/ 07768 463711.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;span&gt;&lt;strong&gt;if you wish to apply please use the above reference number.&lt;/strong&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Staff Nurse Preceptorship", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245911", "validThrough": "2020-11-15T23:59:59+0000"}