{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-10-28T13:18:43+0000", "description": "&lt;p&gt;UCLH are looking for Qualified Registered Dental Nurses to join the bank within our brand new state of the art hospital. We require dental nurses to support and assist in our multi-specialty procedure zone, paediatric dentistry, orthodontics and restorative dentistry. It is essential that you are reliable, punctual and work well within a team environment. You will hold the National Diploma in Dental Nursing or equivalent.&lt;/p&gt;\n&lt;p&gt;In return we will offer you a competitive rate of pay and the opportunity to advance your skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Required Skills &amp; Experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 6 months experience as a Qualified Registered Dental Nurse.&lt;/li&gt;\n&lt;li&gt;Experience in an NHS setting is preferred.&lt;/li&gt;\n&lt;li&gt;GDC qualification&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Our Bank Staff are invaluable to us and in return for their dedication and commitment, we offer the following benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Opportunities to work across sites, gaining invaluable knowledge and experience&lt;/li&gt;\n&lt;li&gt;Priority of shifts over agency workers&lt;/li&gt;\n&lt;li&gt;Onsite Business Bank Partners to offer support&lt;/li&gt;\n&lt;li&gt;Electronic Timesheet submission with weekly pay&lt;/li&gt;\n&lt;li&gt;A dedicated onsite recruitment, compliance and bookings team&lt;/li&gt;\n&lt;li&gt;Access to free Bank Partners Core Skills Training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please apply directly to this advertisement, with full and correct contact details and an up to date CV dating back to&lt;strong&gt; educational history stating the month and year you both started and finished in each educational institution/workplace specified&lt;/strong&gt;. If there are any gaps in your CV due to unemployment, travelling etc, please specify the month and year you were in these circumstances.&lt;/p&gt;\n&lt;p&gt;A member of the Recruitment Team will contact you to discuss your application in more detail and to guide you through registration.&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospital", "postalCode": "NW1 2BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5249", "longitude": "-.136987"}}, "title": "Bank Dental Nurse Band 4/5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246751", "validThrough": "2020-11-28T23:59:59+0000"}