{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-04T14:01:03+0000", "description": "&lt;p&gt;We are delighted to welcome applications for a Matron within Stroke and Neurology to join our expanding department at East Kent Hospitals University NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;East Kent Stroke services strive to be within the highest performing stroke services in England, putting our patients at the core of our service. We are currently undertaking significant improvement work, supported by a Kent and Medway Stroke service reconfiguration, with agreed commissioning in place to implement one of three single site HASU / ASUs. This regional approach to stroke care will enable improved and sustainable quality of care across the patient pathway, bringing staff and resources together to consistently provide excellent care 24 hours a day, seven days a week. Our transformation programme will be supported by a newly developed Integrated Stroke Delivery Network across the county.&lt;/p&gt;\n&lt;p&gt;Our services are currently temporarily co-located upon a single site at Kent and Canterbury Hospital, while we continue with our strategic plans for the future. The post is therefore primarily based at Canterbury but with an expectation the postholder will be required to transfer to an acute site to support the service in its interim and future configuration.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our stroke multidisciplinary team, and to help us to grow our future service. Working with us you will find rewarding role with great scope for professional development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why choose us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a community of great people providing great healthcare, improving health and lives. Here, you can be confident of making a difference to our patients, our incredible healthcare teams and our dedicated medical students and doctors in training.&lt;/p&gt;\n&lt;p&gt;It was recently announced that a new medical school will be opening shortly. The school, which will offer 100 medical school places per year, is a game-changing opportunity and one which the two universities and Kent and Medway trusts have been working towards and hoping for over several years.&lt;/p&gt;\n&lt;p&gt;It isn’t just within work that you will experience great things. There are many areas of unspoilt countryside, expanses of outstanding natural beauty and quiet, secluded beaches all within a few miles of each of our hospital sites. Kent also has an excellent reputation for both public and private schools.&lt;/p&gt;\n&lt;p&gt;Both London and the Continent are on your doorstep, with easy access to the capital, and to the Channel Ports and Channel Tunnel.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your opportunity.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Matron within Stroke and Neurology, you’ll play a vital role in a progressive and forward thinking multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;With a strong learning culture and accreditation for advanced training, our service is well respected for training and teaching.&lt;/p&gt;\n&lt;p&gt;So, if you’re seeking a fresh opportunity in an excellent location with great career building potential, you’re looking in the right place.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise WardJob titleLead NurseEmail addressb.davison1@nhs.netTelephone number01233616217Additional contact information&lt;/p&gt;\n&lt;p&gt;For an informal chat, please contact Bryony Davison, Senor Secretary to arrange.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Matron - Stroke and Neurology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256126", "validThrough": "2020-11-18T23:59:59+0000"}