{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T14:16:19+0000", "description": "&lt;p&gt;Would you like to secure a dietetic post in one of the largest acute teaching Trusts in the UK. Are you an enthusiastic, motivated individual who is an active team player with good communication skills?&lt;/p&gt;\n&lt;p&gt;This post offers an exciting opportunity for a Dietitian to work in one of the largest teaching acute Trusts in the country providing local, specialist and tertiary centre services. You will be part of a large, dynamic and friendly Nutrition and Dietetic Service team based at the Leicester Royal Infirmary with cross site working at the Leicester General Hospital and Glenfield Hospital, University Hospitals of Leicester NHS Trust.&lt;/p&gt;\n&lt;p&gt;This is an ideal post for either a newly qualified graduate or an experienced graduate wanting more experience in a teaching hospital environment as part of your career development pathway. You will develop skills in a wide range of specialities and sub-specialities.&lt;/p&gt;\n&lt;p&gt;The UHL Nutrition and Dietetic Service have a strong commitment to professional and personal development and you will have an opportunity to shadow other clinical specialist Dietitians in many of our specialities e.g. gastroenterology, surgery, critical care, cancer, renal, diabetes, paediatrics which in turn will lead to more senior speciality based positions in our Service.&lt;/p&gt;\n&lt;p&gt;You will have both a line manager and a dedicated caseload manager to support you. You will cover a wide variety of different acute inpatient wards/units, outpatient clinic, structured patient education sessions and healthcare professional training. There will also be the opportunity to develop patient information resources and have involvement in our public and patient involvement programme.&lt;/p&gt;\n&lt;p&gt;There are also well defined CPD and clinical supervision models in place within the service to support you. The service is also involved in the pre-registration clinical programmes for student Dietitians undertaking A, B and C placements and you will play an active part in this after appropriate training. We also have a commitment to training other health professionals, carers and patient groups which will provide the opportunity to develop your presentation skills.&lt;/p&gt;\n&lt;p&gt;The Nutrition and Dietetic Service in University Hospitals of Leicester NHS Trust has a team of over 60 staff including Dietitians, Nutrition Nurses, Dietetic Assistant Practitioners, Dietetic Assistants, and support team staff providing local, specialist and tertiary referral services. We are a progressive Service which actively contributes to the Trusts Quality &amp; Safety agenda and has an established service development and improvement programme which you will be encouraged to contribute to.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Cathy Steele, Clinical Dietetic Manager/Head of Service&lt;/p&gt;\n&lt;p&gt;email cathy.steele@uhl-tr.nhs.uk&lt;/p&gt;\n&lt;p&gt;0116 258 3773&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester Royal Infirmary, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258073", "validThrough": "2020-11-19T23:59:59+0000"}