{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16961", "minValue": "16961", "unitText": "YEAR", "value": "£10.09 per hour"}}, "datePosted": "2020-11-04T17:42:49+0000", "description": "&lt;p&gt;Would you like to be part of a team that is friendly and supportive? If you answered ‘yes’ to the above, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt;NHS Professionals manages the &lt;strong&gt;temporary &lt;/strong&gt;work placement (bank) at Wirral University Teaching Hospital NHS Foundation Trust, and we are looking for an Administrator to support the HR department.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Wirral University Teaching Hospital NHS Foundation Trust is the thriving heart of the local community. Comprising Wirral’s only Emergency Department, it is one of the biggest and busiest acute NHS trusts in the North West. Providing a comprehensive range of high-quality acute care services, serving a population of about 400,000 people across Wirral, Ellesmere Port, Neston, North Wales and the wider North West footprint. Based in 4 locations Arrowe Park Hospital, Clatterbridge Hospital, and Wirral Women and Children&#39;s Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;J&lt;/strong&gt;&lt;strong&gt;ob Title and Grade&lt;/strong&gt;: Administrator (Band 3)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Willow House, Clatterbridge Hospital, CH63 4JY&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; HR Department&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay rate&lt;/strong&gt;: £10.09 per hour&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duration:&lt;/strong&gt; 09/11/2020 to 31/12/2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours of Work&lt;/strong&gt;: Full Time, 37.5hours/week, Monday-Friday, 09.00am -17.00pm&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide administrative, project and diary management support to the Deputy Director of HR and Head of HR, including summarising reports and other documents, ensuring action points are brought to the attention of key HR colleagues and followed up as necessary.&lt;/li&gt;\n&lt;li&gt;Monitoring email and post received, ensuring actions required are identified and flagged.&lt;/li&gt;\n&lt;li&gt;Dealing with routine correspondence, drafting responses as appropriate, and ensuring relevant background information is available as required.&lt;/li&gt;\n&lt;li&gt;Minute meetings as required, monitoring action points and ensuring they are reported on at subsequent meetings&lt;/li&gt;\n&lt;li&gt;Supporting Deputy Director of HR and Head of HR to establish good governance within the division by supporting regular business timetable with regular schedule of departmental meetings, deadline dates for reports, cascading of minutes and actions and shared folders&lt;/li&gt;\n&lt;li&gt;Drafting agendas and ensuring paperwork for meetings is distributed in a timely manner&lt;/li&gt;\n&lt;li&gt;To draft and prepare presentation materials as required&lt;/li&gt;\n&lt;li&gt;To develop and implement effective document retrieval and filing systems to support effective working and efficiency within the department.&lt;/li&gt;\n&lt;li&gt;Managing effective electronic diary systems and working with Deputy Director of HR and Head of HR to ensure effective diary management and scheduling of appointments.&lt;/li&gt;\n&lt;li&gt;Working with other administrators and assistants to provide a comprehensive range of admin support to the directorate, ensuring cross-cover is available as required.&lt;/li&gt;\n&lt;li&gt;To provide admin support to other senior members of staff as required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experience/skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt; &lt;/strong&gt;MS Office technology including Outlook, Teams, Word, and Excel&lt;/li&gt;\n&lt;li&gt;Secretarial and diary management experience.&lt;/li&gt;\n&lt;li&gt;Minute taking&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work this week, get paid next - Get paid the following Friday when you release your timesheets by 23:59 on Sunday.&lt;/li&gt;\n&lt;li&gt;Get paid to take holiday! - Holiday is accrued during every shift you work.&lt;/li&gt;\n&lt;li&gt;Statutory maternity/paternity (subject to qualifying criteria) &lt;/li&gt;\n&lt;li&gt;Access to our very own pension scheme called &#39;NHSP Stakeholder pension&#39; for eligible members&lt;/li&gt;\n&lt;li&gt;Free training and development opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;...and we are part of the NHS family!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to hearing from you soon. &lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wirral", "postalCode": "CH63 4JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3323", "longitude": "-3.02585"}}, "title": "Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256833", "validThrough": "2020-11-18T23:59:59+0000"}