{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum, inc HCA"}}, "datePosted": "2020-10-09T15:46:15+0100", "description": "&lt;p&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/p&gt;\n&lt;p&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the South Sites Ophthalmology team at Queens Mary’s hospital at Sidcup and Orpington Hospital. The post holder should be an experienced nurse manager who is enthusiastic, dynamic and keen to make a positive impact on nurse training, education and continuing professional development.&lt;/p&gt;\n&lt;p&gt;As the Matron of SS Ophthalmology, the post holder will work closely with the Nurse Managers, Head of Nursing, Service Managers, Consultants and DH Ophthalmology Nurse Management team to ensure the consistent high level of performance of the SS Ophthalmology service and so the nursing team has the right skills to deliver the highest standards of patient care and experience.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for a registered nurse with management experience to work strategically within a busy and complex Trust. The successful candidate will function as a valuable member of the Ophthalmology Nurse Management team to lead and assist in the development of the Ophthalmology service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Alex Chipperfield&lt;/p&gt;\n&lt;p&gt;Job title Service Manager, Ophthalmology&lt;/p&gt;\n&lt;p&gt;Email address a.chipperfield@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07947100827&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Mary&#39;s Hospital and Orpington Hospital, Sidcup", "postalCode": "DA8 2HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4706", "longitude": ".187066"}}, "title": "Matron Ophthalmology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916220919", "validThrough": "2020-11-07T23:59:59+0000"}