{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inclusive HCA"}}, "datePosted": "2020-11-05T16:01:41+0000", "description": "&lt;p&gt;An exciting and challenging 6 month maternity cover opportunity has arisen in the Newham Directorate, working alongside the trusts Senior Management Team.&lt;/p&gt;\n&lt;p&gt;We are seeking an Executive Assistant (EA) to provide comprehensive support to the work of the Newham Directorate.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be a self-starter; they must have excellent planning, organisational and analytical skills and have demonstrable experience in providing comprehensive EA support at executive level. Excellent organisational and communication skills and being able to work to tight deadlines are essential. Recent knowledge of Word, Excel, Outlook, PowerPoint with an emphasis on Excel and Outlook, O365, SharePoint, OneNote, One drive and Teams are essential.&lt;/p&gt;\n&lt;p&gt;Key responsibilities will include complex diary management and coordination of meetings in addition to producing high quality minutes, correspondence, reports, presentations and emails.&lt;/p&gt;\n&lt;p&gt;This is an interesting and fast-paced role; the successful applicant will need to demonstrate their ability to manage conflicting priorities and make decisions, meet deadlines and be able to work using their own initiative with minimal supervision.&lt;/p&gt;\n&lt;p&gt;The post is offered as a 1 WTE, 5 days a week Monday to Friday (9.00am-5.00pm) for 6 months.&lt;/p&gt;\n&lt;p&gt;For more information, please see Job Description &amp; Person Specification attached.&lt;/p&gt;\n&lt;p&gt;The interview date will be confirmed in due course.&lt;/p&gt;\n&lt;p&gt;Please note that we reserve the right to bring forward the closing date should we receive an overwhelming response.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LONDON", "postalCode": "E13 8SP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": ".035418"}}, "title": "Executive Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258483", "validThrough": "2020-11-13T23:59:59+0000"}