{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-30T09:45:56+0000", "description": "&lt;p&gt;The post holder will provide a comprehensive administration and information service across the Community and Wellbeing Network, coordinating their activities with other members of the Business Administration Team to ensure an efficient and confidential service is provided.&lt;/p&gt;\n&lt;p&gt;The post holder will primarily be based at the Minerva Health Centre within the Greater Preston Clinical Services Admin Hub but will also be required to provide cover at Ribbleton Clinic during planned and unplanned absence. The post holder will provide secretarial support specifically to the Heart Failure, ECG, COPD, Diabetes Specialist Nursing, DESMOND, Pulmonary Rehab and Community Nutrition and Dietetics Services. The post holder will be required to work flexibly and will be required to provide departmental cover as directed by their administration line manager to ensure continuity of a quality service provision.&lt;/p&gt;\n&lt;p&gt;Post holders will have a range of duties including monitoring of electronic work logs and electronic diary management. However, audio typing of complex medical letters and documents will be the main element of the role therefore excellent typing speed, accuracy and previous experience of audio transcription are essential. An excellent knowledge of Microsoft Office applications including Word, Excel, PowerPoint and Outlook are required.&lt;/p&gt;\n&lt;p&gt;The post holder will provide support and day to day supervision of Clerical Officers and trainees. The post holder will act up on behalf of the Administration Team Lead as required.&lt;/p&gt;\n&lt;p&gt;A standard DBS disclosure will be required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be advised that this advert may close early depending on the number of applicants and you are advised to submit your application as soon as possible.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Paula Sutton-Whalley Administration Team Leader via Paula.Sutton-Whalley@lscft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Minerva Centre, Preston", "postalCode": "PR2 6HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7736", "longitude": "-2.6511"}}, "title": "Mobile Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249539", "validThrough": "2020-11-15T23:59:59+0000"}