{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive of HCAS"}}, "datePosted": "2020-10-08T13:46:16+0100", "description": "The Royal Free London NHS Foundation Trust is offering an exciting opportunity for qualified nurses to specialise in haemodialysis, at our Kidney Care Centre based in Kings Cross St Pancras. \n\nThe Royal Free London provides world class patient focused local care. Our kidney care centres provide excellent development programmes for registered nurses supported by a clear education strategy led by clinical practice educators. This includes a comprehensive induction and preceptorship programme, close collaboration with CNS’ across London and the opportunity to undertake an MSc pathway in Renal Nursing. The post is rotational between the main haemodialysis unit and the supported self-care unit, which are both situated at St Pancras Hospital.\n\nOur Kidney Care Centres function on a Monday-Saturday on a three shift basis. We can offer our staff benefits that include:\nWhat you need to know about the Royal Free NHS Foundation Trust….\n\nOn 1 July 2014 Royal Free London NHS Foundation Trust became one of the largest trusts in the UK by acquiring Barnet and Chase Farm hospitals.\nOur trust has around 10,000 staff serving 1.6 million patients. It comprises Barnet Hospital, Chase Farm Hospital, the Royal Free Hospital and more than 30 services in the community. This larger scale organisation provides an unprecedented opportunity for us to continue our pioneering work, particularly in finding ways to deliver even better care to our patients.\nOur mission is to deliver world class care and expertise in our clinical services, underpinned by world class teaching and research and we will continue to measure our progress against our five governing objectives: excellent outcomes, excellent patient and staff experience, excellent value for taxpayers’ money, being safe and meeting our external duties, and building a strong organisation.\n\nFor further details / informal visits contact\nMrs Ida Rebello - Sister - ida.rebello@nhs.net - 0207 830 2747", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kings Cross, St. Pancras, Kings Cross", "postalCode": "NW1 0PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5365", "longitude": "-.131478"}}, "title": "Band 5 Staff Nurse - Dialysis - Mary Rankin", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218555", "validThrough": "2020-11-08T23:59:59+0000"}