{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum inc HCAs"}}, "datePosted": "2020-11-04T11:02:02+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Midwives&lt;/strong&gt; Case loading team .&lt;/p&gt;\n&lt;p&gt;Exciting opportunities for experienced Band 6 Midwives to join our Case loading teams on Birth Centre, Delivery Suite, Community and Safeguarding has arisen. We are looking for Band 6 midwives who are dynamic, who has ability to influence others, manage change and who wishes to be part of the team and implement the recommendations from Better births for our women and their families.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced midwives with excellent interpersonal and clinical skills willing to embrace a new challenge. You will be a registered midwife with a degree or relevant experience, plus evidence of continuous professional development.&lt;/p&gt;\n&lt;p&gt;We have successfully implemented a number of continuity of carer and progressively increasing our continuity of care model, which have started to show positive outcomes for the mothers and babies, as well as great satisfaction from service users and midwives working under these teams.&lt;/p&gt;\n&lt;p&gt;If you have a strong desire to provide the best birth experience possible here’s the perfect opportunity to rise to that challenge. We are a Baby friendly Unit and we have great education team to support you during your transition into your new role.&lt;/p&gt;\n&lt;p&gt;As a Band 6 midwife that will be joining the case loading teams you will be working alongside multi professional teams providing clinical expertise, leadership, nurturing and supporting midwives and other team members to care for women whilst breaking down barriers that can inhibit women with socially complex lives accessing high quality maternity care.&lt;/p&gt;\n&lt;p&gt;We will be shaking up our maternity services to provide &lt;strong&gt;woman-centred, holistic&lt;/strong&gt; and autonomous models of care in which midwives and obstetricians are supported to provide continuity whilst developing relationships with the women under their care. We would like you to be a part of that journey with us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful candidates will benefit from in house mandatory training, teaching, on-going support from professional Midwifery Advocates (PMA) and professional development to help you deliver the best innovative service and improvements for women and their families throughout their pathway. You will work closely with the Obstetric teams, matrons, existing specialist midwives and other MDT members&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Abiola Jinadu 07825011021&lt;/p&gt;\n&lt;p&gt;Email: Abiola.jinadu@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital, Maternity Unit, Watford Road, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Midwifery Case loading Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255524", "validThrough": "2020-11-18T23:59:59+0000"}