{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa, pro-rata"}}, "datePosted": "2020-10-28T11:46:31+0000", "description": "&lt;p&gt;There has never been a better time to join the NHS for a rewarding career as we celebrate 72 years of the NHS and the nation recognise the care and compassion delivered by the NHS during the recent pandemic .&lt;/p&gt;\n&lt;p&gt;If you are looking to start, maintain and advance your career in a healthcare setting and within a thriving and supportive workplace Derbyshire Community Health Services have a range of opportunities available&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;JOIN OUR OUTSTANDING DCHS FAMILY!&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Derbyshire Community Health Services has been rated as an ‘outstanding’ trust by the Care Quality Commission; we have achieved this by providing high quality patient care within an inclusive organisation that works together and shows care and compassion for each other.&lt;/p&gt;\n&lt;p&gt;There has never been a more exciting time to join us as one of the largest specialist community NHS providers in the country – one that is also among the very best NHS employers as voted by its own staff and by CQC.&lt;/p&gt;\n&lt;p&gt;The way the NHS works is changing; care outside of traditional hospital settings is quickly becoming a much larger part of what the NHS does.&lt;/p&gt;\n&lt;p&gt;As a leading community provider we are at the forefront of this exciting future, joining-up services in local communities to better meet the individual needs of our patients.&lt;/p&gt;\n&lt;p&gt;DCHS is a top performing NHS Trust , we have Community Therapy Support Worker roles available within Derby City where outstanding teamwork and leadership is evident to ensure that we care for our patients in the best possible way.&lt;/p&gt;\n&lt;p&gt;Derby is a lively cosmopolitan university city in the heart of Derbyshire offering a multi-cultural city life on the doorstep of a stunning rural setting and therefore offers varied opportunity .&lt;/p&gt;\n&lt;p&gt;If successful, you will be offered a position closest to you or nearest to your preference within one of our community teams in London Road Hospital, Coleman Street or Village Medical Centre.&lt;/p&gt;\n&lt;p&gt;We also have flexibility for you to rotate between sites within the locality.&lt;/p&gt;\n&lt;p&gt;The role requires day-to-day delivery of patient care in our Integrated Community Teams alongside District Nurses, Facilitating Hospital Discharges, Admission Avoidance Services, Therapists and Social Workers …. together you make the difference.&lt;/p&gt;\n&lt;p&gt;Our integrated teams work together to provide a Rapid Response Therapy service which operates a shift pattern between 8.00am and 6.30pm, and also a Community Therapy service which operates 8.00am to 4.30pm, both services covering 7 days, including Bank Holidays.&lt;/p&gt;\n&lt;p&gt;Various hours are available to support flexible working.&lt;/p&gt;\n&lt;p&gt;The successful candidates will have high levels of personal credibility and the ability to instantly form effective working relationships in a range of work settings.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to really make a difference in ensuring that quality services are delivered both now and into the future based around our patient needs.&lt;/p&gt;\n&lt;p&gt;We will also work with you regarding your on-going development.&lt;/p&gt;\n&lt;p&gt;As a clinical employee it will be your responsibility to ensure that your behaviour and values reflect those set out in the DCHS Way outlined on our website and in the additional information provided.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lauren Williams&lt;/p&gt;\n&lt;p&gt;Integrated Community Team Leader&lt;/p&gt;\n&lt;p&gt;01332 564850&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124692.jpg", "name": "Derbyshire Community Health Services NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124692"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various within Derby City, Derby", "postalCode": "DE1 2QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9142", "longitude": "-1.46857"}}, "title": "Generic Therapy Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246397", "validThrough": "2020-11-11T23:59:59+0000"}