{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive and Negotiable based on experience"}}, "datePosted": "2020-10-29T15:07:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Role:&lt;/strong&gt;&lt;strong&gt;Physician Associate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Thornton Road Surgery, Croydon, CR0 3EW&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working Hours: Full Time / 37.5 hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:Negotiable depending on experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the largest Primary Care Provider in London that boasts a growing portfolio, covering 18 CCG regions, 40 sites and delivering the highest quality care to over 300,000 patients.&lt;/p&gt;\n&lt;p&gt;AT Medics is London’s largest provider of core primary care services, with a strong reputation for quality improvement and investing in people.&lt;/p&gt;\n&lt;p&gt;Your role will require you to participate in all aspects of patient care through knowledge gained from your PA training. You will be working as part of an allied healthcare professional team including Pharmacists and Healthcare Assistants, and will be supported and supervised by a GP.&lt;/p&gt;\n&lt;p&gt;The position is for a substantive Physician Associate post with a fantastic package and is being offered directly by AT Medics. We would love to hear from you to discuss further.&lt;/p&gt;\n&lt;p&gt;Our vacancies suit primary care experienced Physician Associates keen to work in an exciting, rewarding and demanding environment. You will provide safe, clinical decision-making and expert care.&lt;/p&gt;\n&lt;p&gt;By joining AT Medics you will also benefit from:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dedicated and bespoke Physician Associate training and support programme&lt;/li&gt;\n&lt;li&gt;Continuous GP clinical supervision and support&lt;/li&gt;\n&lt;li&gt;Access to our online community training forum for Physician Associates&lt;/li&gt;\n&lt;li&gt;Access to NHS Discounts and NHS Pension&lt;/li&gt;\n&lt;li&gt;A comprehensive induction and orientation programme&lt;/li&gt;\n&lt;li&gt;5 weeks annual leave pro rata&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Applications are welcome from qualified Physician Associates with one to two years’ experience of working in a GP practice. Exceptional candidates who are newly qualified will also be considered for this role. You will have completed the Physician Associate Postgraduate Diploma/Masters from an accredited UK university and passed the Physician Associate National Examination.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please apply now. The vacancy shall end once the appropriate candidate has been recruited.&lt;/p&gt;\n&lt;p&gt;If you do not hear from us within 4 weeks of application, please consider your application as being unsuccessful. We thank you for your interest.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "AT Medics", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon", "postalCode": "CR0 3EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3889", "longitude": "-.120683"}}, "title": "Physician Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248803", "validThrough": "2020-11-12T23:59:59+0000"}