{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa, based on full time hours"}}, "datePosted": "2020-10-28T10:30:45+0000", "description": "&lt;p&gt;Are you a qualified Senior Mental Health Nurse seeking a new exciting and unique role? We have an opportunity for you to work in Primary Care while closely linking in with the Central Community Mental Health Team at College Keep.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be enthusiastic, resourceful and committed to providing client centred, recovery focussed care. You will be working with adults with mental health needs who do not reach the criteria for secondary mental health services. You will be assessing, providing support and therapeutic interventions to service users within a GP Surgery. Within your role you will also be liaising with and signposting to other services and working closely with the CMHT regarding referrals, advice, information sharing and for supervision.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work in Central Southampton: a diverse, multi-cultural area with two large universities on its patch. There are also high levels of social deprivation and homelessness so an interest in these issues would be advantageous.&lt;/p&gt;\n&lt;p&gt;We are happy to discuss flexible working and we welcome practitioners who are looking to develop in their career and have interests in developing their therapeutic skills.&lt;/p&gt;\n&lt;p&gt;This post is for 37.5 hours a week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/p&gt;\n&lt;p&gt;　&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO14 3DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8984", "longitude": "-1.39688"}}, "title": "Senior Mental Health Practitioner - Primary Care Role", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246069", "validThrough": "2020-11-11T23:59:59+0000"}