{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-07T10:47:09+0100", "description": "&lt;p&gt;An exciting opportunity for a highly skilled and motivated individual has arisen at the George Eliot Hospital NHS Trust to join the Palliative Care Department as a Consultant Physician. The successful candidate will play a key role in the continuing development of the Palliative Care Department within the Division of Medicine and the wider organisation as the Trust strives to continue to improve the services available to our local community through the engagement of high quality clinical leadership.&lt;/p&gt;\n&lt;p&gt;The GEH Specialist Palliative Care Team is an innovative and enthusiastic team, and the work the team do is underpinned by the Operational and Strategic End of Life Care Steering Group which is chaired by the Medical Director. The team work to an evolving 18 month Improvement Plan with a number of innovative and exciting improvement projects. Quality assurance and governance is reported monthly to the aforementioned steering Group via a quality dashboard, incident/complaint overviews and education outcomes. The Team also provide a regular education programme of supporting medical students in GEH and potentially this will be extended into community palliative care.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Joanna Clerici, Paliative Care Consultant through switchboard on 02476 351351&lt;/p&gt;\n&lt;p&gt;Kristy Clayton, Lead Nurse for Specialist Paliative Care through switchboard on 02476 351351&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "George Eliot Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120955"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "G13315 Palliative Care, Nuneaton", "postalCode": "CV10 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.512", "longitude": "-1.47512"}}, "title": "Consultant in Palliative Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216063", "validThrough": "2020-11-18T23:59:59+0000"}