{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6 dependent on experience"}}, "datePosted": "2020-10-26T15:22:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Urology Speciality Lead | Theatres | Band 6 dependent on experience | &lt;/strong&gt;&lt;strong&gt;Sutton Coldfield, Birmingham&lt;/strong&gt;&lt;strong&gt;| Full time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Little Aston have an exciting, new opportunity for a Urology Speciality Lead to join their Theatre team on a full-time basis. The successful candidate will have a chance to develop and drive the Urology service forward how they see fit.&lt;/p&gt;\n&lt;p&gt;Spire Little Aston Hospital is a leading private hospital in the Midlands, offering comprehensive hospital care to patients from Birmingham and the surrounding areas of the West Midlands and Staffordshire. The hospital has an exceptional reputation within a variety of specialties including Orthopaedics, Sports &amp; Exercise Medicine, Cosmetics, Ophthalmic, Gynaecology, General Surgery &amp; Physiotherapy.&lt;/p&gt;\n&lt;p&gt;You will be a team a leader and support mechanism for staff, liaising with consultants, attend meetings to develop the speciality and be part of putting through business cases for extra equipment required etc.&lt;/p&gt;\n&lt;p&gt;You will work clinically on Urology cases, manage consultants and take responsibility for the day-to-day running of urology theatre speciality.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be clinical and be required to undertake scrub duties&lt;/li&gt;\n&lt;li&gt;You will lead and manage the Urology Theatre Team and day-to-day running of the theatre, liaising with consultants and forward planning for lists etc.&lt;/li&gt;\n&lt;li&gt;You will be responsible for developing the speciality and putting forward business cases in regards to new requirements for the service and dealing with any issues that may arise&lt;/li&gt;\n&lt;li&gt;Be a support mechanism for staff and support in training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You must be a qualified Nurse or ODP with at least 1 year experience in Urology surgery&lt;/li&gt;\n&lt;li&gt;You hold a valid NMC or HCPC pin with no conditions or restrictions&lt;/li&gt;\n&lt;li&gt;Be able to build and hold relationships with consultants&lt;/li&gt;\n&lt;li&gt;Excellent organisation and communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Rebecca O’Neill on Rebecca.o’neill@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sutton Coldfield", "postalCode": "B74 3UP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5997", "longitude": "-1.87578"}}, "title": "Urology Speciality Lead - Theatres", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243126", "validThrough": "2020-11-26T23:59:59+0000"}