{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata"}}, "datePosted": "2020-11-05T14:01:20+0000", "description": "&lt;p&gt;The Haven is a dedicated, mental health crisis assessment facility located on the Millview Hospital site and available 24 hours a day.&lt;/p&gt;\n&lt;p&gt;Our trained NHS staff provide a crisis assessment for anyone aged over 18 at the Haven.&lt;/p&gt;\n&lt;p&gt;The Haven does not have beds, instead it has comfortable recliner chairs in curtained private areas for people. Lights in the personal spaces can be dimmed and cosy blankets can be provided. There is also an outside garden area.&lt;/p&gt;\n&lt;p&gt;Referrals are accepted from any Sussex Partnership urgent or crisis team across Sussex and neighbouring mental health Trusts for a patient who is registered with a Sussex GP or resident in Sussex.&lt;/p&gt;\n&lt;p&gt;External referrals are accepted from South East Coast Ambulance, Sussex Police, Sussex Community Foundation Trust, Acute hospitals and other partner organisations including primary care where the person would otherwise be directed to A&amp;E.&lt;/p&gt;\n&lt;p&gt;The Haven is the identified Single Point of Contact for Sussex police to confirm availability of Places of Safety and offer assistance should an officer be considering S 136 and there is no local clinical service available.&lt;/p&gt;\n&lt;p&gt;The Haven works closely with adult services across Sussex, especially those teams who respond to referrals for patients in crisis, and partner organisations to ensure that we can offer an effective, safe and accessible alternative to A&amp;E and provide timely crisis interventions for service users in the community.&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint a Clinical Support Worker who will be able to work effectively as a member of this service to ensure the safety for service users in crisis and to contribute to the assessment of the individual&#39;s needs and risks and to ensure that this is accurately recorded and communicated.&lt;/p&gt;\n&lt;p&gt;We are keen to appoint Clinical Support Workers who have had recent experience working in mental health services (or equivalent community based services) and are able to demonstrate excellent professional standards and to demonstrate a comprehensive knowledge of factors which can impact on the safety of the service user experience. The Clinical Support Workers will practice to promote an inclusive, collaborative and empathetic clinical environment and will be able to utilise their skills to optimise clinical outcomes for service users. As a Clinical Support Worker we will expect you to be an individual who develops positive and effective professional relationships and networks and values the contribution and support of your colleagues and is focused on continuous improvement and striving for the very best standards.&lt;/p&gt;\n&lt;p&gt;The Clinical Support Workers will be expected to undertake shifts through internal rotation and to participate in supervision. All members of The Haven clinical staff will be offered the opportunity to participate in reflective practice and professional development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Donna Beard&lt;/p&gt;\n&lt;p&gt;Job title Team Leader&lt;/p&gt;\n&lt;p&gt;Email address donna.beard@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0300 304 0220&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Haven @ Millview hospital, Hove", "postalCode": "BN3 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.842", "longitude": "-.189739"}}, "title": "Clinical Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258024", "validThrough": "2020-11-12T23:59:59+0000"}