{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-03T16:16:35+0000", "description": "&lt;p&gt;Northampton General Hospital NHS Trust is an acute hospital with an enthusiastic, progressive and caring Pharmacy department; we strive to support each other and enjoy work. As a Trust we pledge to provide the best possible care with patient safety and quality at the heart of all we do.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an ATO to support the Pharmacy Homecare team.&lt;/p&gt;\n&lt;p&gt;Homecare duties will include liaising with the relevant medical, nursing and pharmacy staff, processing delivery notes, invoices and issuing medicines using the Ascribe Pharmacy computer system.&lt;/p&gt;\n&lt;p&gt;ATOs have an important role in the Pharmacy, working efficiently and accurately under the supervision of qualified staff. There will also be a commitment to work Saturday or Sunday 1 week in 6 within the dispensary, stores or distribution departments depending on service needs.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have previous Pharmacy experience, good verbal and written communication skills and have a keen eye for detail. Experience of invoicing systems is desirable.&lt;/p&gt;\n&lt;p&gt;The training will be hospital-based and the successful candidate will undertake the relevant units of the NVQ Level 2 in Pharmacy Services or equivalent, to meet General Pharmaceutical Council (GPhC) requirements for Pharmacy support staff.&lt;/p&gt;\n&lt;p&gt;If you are enthusiastic, self-motivated, committed and keen to develop your skills further then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;For more specific information relating to this post please see the attached job description and person specification.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Vivienne Rose, Job title: Principal Technician Medicines Information/Formulary, Email address: vivienne.rose@ngh.nhs.uk, Telephone number: 01604 545697&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton General Hospital NHS Trust, Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "Assistant Technical Officer (ATO) – Homecare Support", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254754", "validThrough": "2020-11-17T23:59:59+0000"}