{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inc HCA"}}, "datePosted": "2020-10-28T17:01:05+0000", "description": "&lt;p&gt;Cotton Ward Band 6 Team Leader opportunit King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/p&gt;\n&lt;p&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/p&gt;\n&lt;p&gt;Cotton ward has an exciting opportunity for a band 6 Team leader position. We are looking for an experienced and enthusiastic nurse to join our friendly and supportive team.&lt;/p&gt;\n&lt;p&gt;The ward comprises 26 beds with a range of primarily Vascular and Cardiac patients. We care for a variety of pre and post –operative patients including coronary artery bypass and valve surgery, revascularisation, amputation and cardiology procedures.&lt;/p&gt;\n&lt;p&gt;We work closely with the wider MDT including the Tissue Viability and Diabetic foot teams, Heart failure Nurse Specialists, Discharge coordinator and therapy teams. We specialise in wound management, VAC and larvae therapy. We deliver complex discharge planning and liaise with community teams for ongoing support and therapy.&lt;/p&gt;\n&lt;p&gt;King’s College Hospital provides tertiary cardiovascular care for patients from across the South East, as part of Kings Health Partners we work closely with partner organisations and together form the Cardiovascular Network, transforming cardiovascular services across the region.&lt;/p&gt;\n&lt;p&gt;We are committed to staff development and education with all staff having access to a wide range of educational and developmental resources. The ward is supported by a team of practice development nurses who offer 1:1 clinical supervision, teaching and study opportunities.&lt;/p&gt;\n&lt;p&gt;We are looking for applicants who would like the opportunity to develop their existing clinical, teaching, management and leadership skills in this demanding but rewarding clinical environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSerena DeansEmail addressserena.deans@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kings College Hospital, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Band 6 Junior Sister - Cardiac Cotton Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247454", "validThrough": "2020-11-10T23:59:59+0000"}