{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18154", "minValue": "18154", "unitText": "YEAR", "value": "Up to £18,154.50 per annum (full time equivalent)"}}, "datePosted": "2020-11-06T15:39:07+0000", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Administrator - Home working / flexible working hours&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Here at Priory Medical Group we can offer you:&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Certainty and security in your employmentwithin one of the UK’s biggest Healthcare Provider.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexibility to work from home, this can be either full time or part time.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working hours, to suit your lifestyle.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Better work life balance overall.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;No more commuting&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;…leaving you with more time in your life to spend doing what you enjoy most!&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Fulfilling and rewarding work that really matters, you really make a difference!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;An environment where we all act with kindness and compassion towards colleagues at all times, whether this is face to face or virtually (via zoom).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;An opportunity to develop strong administrative skills (with an on hand buddy) in your career that will last a lifetime.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What is an Administrator in our clinical coding and data quality team?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Following a practice protocol review communications/letters and assign codes to patients’ electronic records.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Summarising patient records and accurately assigning codes to produce a succinct, electronic record of a patients’ medical history.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To work to team targets and individual KPI’s.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Maintaining high standards of data quality, identifying and resolving any issues.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Performing searches of clinical data on a routine and ad-hoc basis.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Being a great colleague to work with in the team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What we look for in your application:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven background of enjoying working in a dynamic, fast paced, target driven and patient / customer focussed business.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;A proven record that demonstrates you enjoy working autonomously and independently.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;A proven record of being highly organised with your work along with demonstrations of being self-motivated and time conscious, this will be key when working from home.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven Team Player with pride in how you interact with colleagues and contribute to a positive enjoyable working environment which demonstrates your ability to communicate with the team using various virtual platforms.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Professional pride in the quality of your work and relationship with customers / internal colleagues.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven ability to adapt and react positively to change – we are constantly improving and evolving our ways of working.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven track record you enjoy processing and inputting large volumes of data working to deadlines.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven track record of following a process or protocol when inputting information accurately&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The skills you we are looking for you to bring to the team:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Essential&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Sustain high concentration levels for prolonged periods of time&lt;/li&gt;\n&lt;li&gt;Dedication to maintaining high standards&lt;/li&gt;\n&lt;li&gt;Analytical&lt;/li&gt;\n&lt;li&gt;Enjoy working with large volumes of detailed information&lt;/li&gt;\n&lt;li&gt;Follow processes and procedures accurately and efficiently&lt;/li&gt;\n&lt;li&gt;Efficient and accurate typing / data inputting skills&lt;/li&gt;\n&lt;li&gt;Competent in the use of PC based technologies&lt;/li&gt;\n&lt;li&gt;Understanding of the importance of confidentiality in the workplace and able to follow data protection policies and guidelines&lt;/li&gt;\n&lt;li&gt;Great communication skills, face to face, on the phone, via e-mail and virtually&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Desired&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowledge of medical terminology is advantageous&lt;/li&gt;\n&lt;li&gt;A background in clinical coding or Notes Summarising (clinical or non-clinical)&lt;/li&gt;\n&lt;li&gt;Previous experience of SystmOne or EMISWeb clinical systems&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Job title&lt;/strong&gt;&lt;strong&gt;: Administrator – Clinical Coding and Data Quality Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working hours:&lt;/strong&gt;Up to 37.5 hours per week (our office hours are 8.30 am – 4.30 pm – &lt;em&gt;negotiable)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;Up to £18,154.50 per annum (full time equivalent) + Company pension scheme&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Home working (or if preferred and local to the area you could be based in ourAdministration office at Priory Medical Group, Acomb, York&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection for Interview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Practice recognises that discrimination of any kind is both unlawful and would act as a barrier to finding the most talented individuals for our organisation. As such, our recruitment and selection procedures exist to ensure no job applicant, employee or worker is discriminated against either directly or indirectly on the grounds of age, disability, gender reassignment, marriage and civil partnership, pregnancy or maternity, race, religion or belief, sex or sexual orientation.&lt;/p&gt;\n&lt;p&gt;A great deal of careful consideration has been invested in preparing the advert for this post based on the specification for this role and the person we are looking for. &lt;strong&gt;Our selection for interview process is designed to ensure individuals are selected for interview on the merit of their application only&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;If you are applying through NHS Jobs, you will notice you are asked if you would like a guaranteed interview as part of the ‘Two Tick’ disability scheme. Whilst this is an admirable government initiative, please be aware we are not signed up to this scheme. This is a question on the NHS jobs application form which is outside of our own control. Our own process ensures we consider candidates on the merit of their application only and we do not ask any questions regarding a disability as part of our selection process. We only give candidates the opportunity to share information regarding any disability after candidates are invited to interview and only if the candidate feels they require adjustments in the interview process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Medical Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York, Acomb", "postalCode": "YO24 3WX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9495", "longitude": "-1.12943"}}, "title": "Administrator - Home working / flexible working hours", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260416", "validThrough": "2020-12-08T23:59:59+0000"}