{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-05T10:31:29+0000", "description": "&lt;p&gt;Calling all qualified or pre-registration Staff Nurses we are looking to recruit within our Neurosurgical team on Ward 2B at Royal Preston Hospital.&lt;/p&gt;\n&lt;p&gt;Ward 2B is a very busy 27-bedded acute neurosurgical ward treating elective and emergency patients from the North west of England.&lt;/p&gt;\n&lt;p&gt;This includes pre and post-operative care of patients with acute head trauma, brain haemorrhages, acute spinal injuries, tumours, as well as elective patients for surgery of spinal conditions.&lt;/p&gt;\n&lt;p&gt;We offer training and support for newly appointed staff nurses and preceptorship for newly qualified nurses. We have a great team and we embrace the Trust values promoting excellent care with compassion.&lt;/p&gt;\n&lt;p&gt;All experienced staff nurses and newly qualified nurses are welcome to apply. Excellent development opportunities are provided within the Surgical Division.&lt;/p&gt;\n&lt;p&gt;We were the pilot ward for CLiP (Collaborative Learning in Practice) in the North west of England and promote student learning and development during the placement. We have recently been shortlisted as Student placement of the year in the Student Times Nursing awards 2019.&lt;/p&gt;\n&lt;p&gt;We were finalists in the Student Nursing Times Awards in 2018. We are a forward thinking, proactive ward and welcome enthusiastic and motivated nurses to join Ward 2B. Come and join us. This is a great place to work!&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;In addition to the many other benefits of working at Lancashire Teaching Hospitals NHS Foundation Trust, you may also be entitled to apply for our relocation package. As a Trust we recognise the importance of securing the right candidate for a role; and we therefore offer an attractive relocation package of £1,500 for any nurse relocating more than one hour away from their current address.&lt;/p&gt;\n&lt;p&gt;For any further information regarding our relocation package, please contact a member of the Recruitment Team.&lt;/p&gt;\n&lt;p&gt;Interview Date: To be confirmed&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire SpencerJob titleWard ManagerEmail addressclaire.spencer@lthtr.nhs.ukTelephone number01772 528180Additional contact information&lt;/p&gt;\n&lt;p&gt;Claire Spencer, Ward Manager on 01772 522713 or via email claire.spencer@lthtr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Staff Nurse - Neurosurgery Ward 2B", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257239", "validThrough": "2020-11-12T23:59:59+0000"}