{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 p.a."}}, "datePosted": "2020-11-05T13:02:02+0000", "description": "&lt;p&gt;&lt;strong&gt;CAMHS TRANSITION MENTAL HEALTH SUPPORT WORKER - BAND 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit flexible, enthusiastic and motivated staff to join our transitions team. We pride ourselves on the quality of our service and the skills and dedication of our staff, and we are committed to providing opportunities for professional development in order to continue to provide a high quality service.&lt;/p&gt;\n&lt;p&gt;The Transitions team based at pebble lodge is a service aimed to support young people with their transition from inpatient services back into the community. Providing them with opportunities to support and maintain their wellbeing and develop their living skills as they move forward with their recovery, working closely with inpatient and community health professionals. You will also have the opportunity to support and develop skills with family members/carers, healthcare and educational staff.&lt;/p&gt;\n&lt;p&gt;You will carry out assigned tasks involving direct care in support of, and supervised by, a Registered Nurse. The working hours of these posts will be flexible to meet the needs of the service. You will have the opportunity to support young people with their transition from inpatient services to community services and will continue to support them for a period post Pebble Lodge.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to have a driving licence and access to a car as there may be a requirement to transport young people within the community.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake a &lt;strong&gt;Prevention and Management of Violence and Aggression&lt;/strong&gt; course and it is a condition of your employment that you successfully complete all aspects of this course; if this is not achieved you will not be able to commence working in the post.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires a Enhanced Disclosure and Barring Service (DBS) check.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Luke Webb, Transition and Liaison Nurse - Team Lead: Email - luke.webb2@nhs.net Telephone - 01202545400&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bournemouth", "postalCode": "BH4 8EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7168", "longitude": "-1.90326"}}, "title": "CAMHS Transition Mental Health Support Worker, Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257784", "validThrough": "2020-11-15T23:59:59+0000"}