{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-10-29T15:49:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse | Outpatients | Band 5 | Tunbridge Wells | Full Time | Flexible Working Hours | Fully funded training programs and career progression opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Tunbridge Wells Hospital has an exciting opportunity for a Registered Nurse to join our Outpatient department. We will consider applicants with partial outpatient experience, as full training will be provided.&lt;/p&gt;\n&lt;p&gt;Spire Tunbridge Wells is a 40 bedded acute hospital situated in rural Kent, located within five miles of Royal Tunbridge Wells and on the boundaries of West Sussex. The hospital offers a range of services and facilities including two operating theatres, a sterile services department, a dedicated endoscopy suite, and a diagnostic and imaging department with an MRI and CT scanner. There are outpatient and physiotherapy departments providing services six days a week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Run nurse led dressing and phlebotomy clinics and assist in pre-operative minor procedures.&lt;/li&gt;\n&lt;li&gt;Carry out any other duties delegated by the OPD Manager / team leader for the proper and efficient care of the patient&#39;s and the smooth running of the department&lt;/li&gt;\n&lt;li&gt;Chaperone and assist Consultants during examination of the patient&#39;s and minor surgical procedures and assists in arranging investigations requested by Consultants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Current NMC registration with no restrictions&lt;/li&gt;\n&lt;li&gt;Experience of working with minimum supervision&lt;/li&gt;\n&lt;li&gt;Good team player&lt;/li&gt;\n&lt;li&gt;Excellent communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Elena Tsoneva on 07921 065 874 elena.tsoneva@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tunbridge Wells", "postalCode": "TN3 0RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1345", "longitude": ".188187"}}, "title": "Staff Nurse Outpatients", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248930", "validThrough": "2020-11-29T23:59:59+0000"}