{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 pa inc."}}, "datePosted": "2020-11-04T09:46:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Info about the Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Forensic Offender Health pathway provides comprehensive and specialised care and treatment for individuals experiencing mental health issues and have offending histories.&lt;/p&gt;\n&lt;p&gt;Our inpatient secure service supports people who, as a consequence of their mental health needs, have had contact with the legal system and require a safe and secure environment that enables them to receive a wide range of treatments, therapies and care to assist in their recovery.&lt;/p&gt;\n&lt;p&gt;Based on Bethlem Royal Hospital in Beckenham, London, River House is 89 bedded purpose built Medium Secure Unit for patients who need care and treatment in a secure environment. We also provide mental health services at HMP Wandsworth.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Work Here&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You can chose which client group you wish to work with such as:&lt;/p&gt;\n&lt;p&gt;Effra Ward - Forensic Medium Secure treatment for men who are close to recovery and moving towards independence. Effra ward is a 16 bedded rehabilitation ward that caters for male adults. The unit is designed to support people on a pathway to recovery through a series of carefully managed stages and is part of the Croydon Adult and Behavioural &amp; Developmental Psychiatry Operations Directorate. These beds form part of the full 120 forensic estates, including a Medium Secure Unit and Open Rehab.&lt;/p&gt;\n&lt;p&gt;Chaffinch - Low secure pre-discharge ward for men. Chaffinch Ward is a 19-bed low secure pre-discharge ward. We provide inpatient treatment and care for men, aged 18-65, who have mental health problems and a history of offending. A pre-discharge ward is for people who have responded well to treatment and are almost ready to be discharged from hospital.&lt;/p&gt;\n&lt;p&gt;We value our team members and believe that nurses are recognised as essential, core members of the multi-professional team and are in the forefront of developing and delivering holistic and compassionate care. In return we can offer personal, professional and clinical development opportunities, in addition to regular/monthly professional and clinical supervision, a robust preceptorship programme and support for personal development plans and continual professional development programme.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Info on Location:&lt;/span&gt;&lt;/strong&gt;&lt;span&gt; Bethlem Royal Hospital, Beckenham London&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Application Requirements:&lt;/span&gt;&lt;/strong&gt;&lt;span&gt; Registered Mental Health and Learning Disabilities Nurses. We also take Newly Qualified RMNs and RNLDs &lt;span&gt;qualifying in the next 3 months.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Unfortunately due to the nature of this service we unable accept applications from RGNs or RNAs&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If successful at shortlisting stage you will be contacted regarding the next stage. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;**Please note that if you do not state the month and year that you have completed your Nursing qualification you will not be invited to the assessment.**&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;**As featured on Life on the Psych Ward**&lt;br /&gt;&lt;br /&gt;Ward Name &amp; Location: River House, Bethlem Royal Hospital, Beckenham&lt;br /&gt;Patient Age Range: From 18 years&lt;br /&gt;Patient Gender: 4 Wards - Female Only, Male Only and Mixed&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJane ArnoldJob titleClinical Service LeadEmail addressJane.Arnold@slam.nhs.ukTelephone number020 3228 8455&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bethlem Royal Hospital, Monks Orchard Rd, Beckenham BR3 3BX, Beckenham, London", "postalCode": "BR3 3BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3809", "longitude": "-.029726"}}, "title": "RMN or RNLD (NHS), Forensic Rehab Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255227", "validThrough": "2020-11-18T23:59:59+0000"}