{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35750", "minValue": "27500", "unitText": "YEAR", "value": "£27,500 to £35,750"}}, "datePosted": "2020-10-13T14:49:54+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Biomedical Scientist in ourBrentwood Hospital and play your part in building a healthier nation.&lt;br /&gt;&lt;br /&gt;Nuffield Health Brentwood Pathology department is one of the busiest multi-disciplinary laboratorieswithin Nuffield Health,providing pathology results and blood transfusion servicesfor3 Nuffield Health hospitals in the South East of England&lt;br /&gt;&lt;br /&gt;The Role&lt;br /&gt;&lt;br /&gt;As a Biomedical Scientist you will;&lt;br /&gt;&lt;br /&gt;- Deliver quality pathology services and taking a share of covering the on-call out of hours and weekend service.&lt;br /&gt;&lt;br /&gt;- Perform biomedical diagnostic testing, interpretation and reporting, through to quality control.&lt;br /&gt;&lt;br /&gt;- Keep records of specimens, results, reagents and consumables.&lt;br /&gt;&lt;br /&gt;- Support the organisation in validating and assessing new equipment and developing new diagnostic procedures. This is part of our ongoing quest to deliver the very best experience possible for patients.&lt;br /&gt;&lt;br /&gt;The Person&lt;br /&gt;&lt;br /&gt;To succeed as a Biomedical Scientist you will have;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;-Current registration with Health Care Professions Council (HCPC) as a Biomedical Scientist&lt;br /&gt;&lt;br /&gt;- Relevant laboratory experience in blood sciences including Haematology, Biochemistry or Blood transfusion. Previous experience in multi-disciplinary working would be advantageous.&lt;br /&gt;&lt;br /&gt;- Good working knowledge of different analytical equipment in a range of multi-disciplinary techniques.&lt;br /&gt;&lt;br /&gt;- Great communication and team player skills.&lt;br /&gt;&lt;br /&gt;- The ability to understand how vital it is to maintain good customer relationships and provide high levels of service in a modern pathology laboratory.&lt;br /&gt;&lt;br /&gt;The Benefits&lt;br /&gt;&lt;br /&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this but we also offer a range of lifestyle and financial wellbeing benefits.&lt;br /&gt;&lt;br /&gt;Be your best and join us in building a healthier nation.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Location - Brentwood&lt;br /&gt;Weekly Hours - 37.5&lt;br /&gt;Contract Type - Permanent&lt;br /&gt;Salary - £ 27,500 to £35,750&lt;br /&gt;Closing date - 10/11/2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brentwood", "postalCode": "CM15 8EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6236", "longitude": ".312716"}}, "title": "Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224766", "validThrough": "2020-11-10T23:59:59+0000"}