{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 per annum"}}, "datePosted": "2020-10-30T09:33:19+0000", "description": "&lt;p&gt;HMS Seahawk Dental Centre is looking for a Band 5 Civilian Hygienist to join our experienced team. You will take on a key role working alongside the military dental officers to deliver prevention focused dentistry to a wide range of serving personnel. This is an exciting opening to provide care in a unique environment, put patients first and challenge yourself to make a difference in improving patients’ oral health for life.&lt;/p&gt;\n&lt;p&gt;As our successful candidate, you will work as part of the civilian and military team principally providing face to face treatment to patients. However, you will also have the opportunity to deliver group oral hygiene sessions to new recruits, provide training and assistance to other members of the dental centre team and lead with some of the National Oral Health Campaigns delivered within the dental centre.&lt;/p&gt;\n&lt;p&gt;This position is Full Time only and offers 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Successful candidates will be entitled to a Market Skills Supplement of £5,750 per annum.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Duties of the role include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing dental hygiene treatment in line with the approved scope of practice as per General Dental Council (GDC) guidelines and in accordance with any agreed Patient Group Directive (PGD).&lt;/li&gt;\n&lt;li&gt;Maintaining the standard and cleanliness of the surgery and accommodation for which you are responsible, reporting any deficiencies in accordance with local protocols.&lt;/li&gt;\n&lt;li&gt;Demonstrating proficiency in the use of DMICP and other IT systems to ensure patient documentation is available to the clinician during treatment. All records are maintained appropriately and correctly stored or disposed of on completion of treatment.&lt;/li&gt;\n&lt;li&gt;Accurately record treatment on each patient’s electronic health record on Defence Medical Information Capability Program (DMICP).&lt;/li&gt;\n&lt;li&gt;Carrying out dental work under the direction of a registered dentist who has examined the patient and indicated in writing the course of treatment to be provided.&lt;/li&gt;\n&lt;li&gt;Managing dental records (manual and electronic), ensuring the correct hastening, receipt, despatch, registration and storage of records.&lt;/li&gt;\n&lt;li&gt;Undertaking Continuous Personal Development (CPD) in the core subjects of medical emergencies, Infection Prevention Control (IPC), disinfection and decontamination, radiography and radiation protection, legal and ethical issues and handling complaints, as recommended by the GDC.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you see the attached Job Description and Person Specification for further information.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate will be required to provide evidence of the following:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowledge of range of oral health procedures; acquired through a Diploma/ Certificate in Dental Hygiene or a BSC in Dental Hygiene and Therapy.&lt;/li&gt;\n&lt;li&gt;Current full General Dental Council registration.&lt;/li&gt;\n&lt;li&gt;Immunity to Hepatitis B.&lt;/li&gt;\n&lt;li&gt;Professional Indemnity cover.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following NHS competencies and one Civil Service Behaviour:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core – NHS6 – Equality and Diversity&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC1 – Communication&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC2 – Personal &amp; People Development&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC3 – Health, Safety &amp; Security&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC4 – Service Improvement&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC5 – Quality&lt;/li&gt;\n&lt;li&gt;Civil Service Behaviour - Leadership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;There is no requirement to join the military or deploy as this is met by our military personnel. You will form the continuity of care required by our patients when they are based at home.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed -The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;From time to time The Ministry of Defence may advertise per regional Headquarters. To ensure your search yields the best results, search under MoD-Healthcare jobs from the home page or alternatively avoid completing the mileage section when using the search criteria based on your post code.&lt;/p&gt;\n&lt;p&gt;For details of which locations are in each region, please see attached Regional Layout document.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMS Seahawk, RNAS Culdrose, Helston, Cornwall, TR12 7RH", "postalCode": "TR12 7RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.0818", "longitude": "-5.25789"}}, "title": "Band 5 Dental Hygienist (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249511", "validThrough": "2020-12-06T23:59:59+0000"}