{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 Per annum inclusive"}}, "datePosted": "2020-11-02T15:31:31+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Band 6 Systems &amp; Results Lead&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an experienced self-motivated and skilled professional to work collaboratively with the Service Manager, and be responsible for the Integrated Sexual Health &amp; HIV IT system and results management process.&lt;/p&gt;\n&lt;p&gt;The post holder will lead on the implementation of a new web site, on-line booking, online contraception, Personal Health Records and GUMCADv3.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for the results management process by reviewing and developing existing practices. The role is to provide scripted advice, information and education to all patients diagnosed with a sexually transmitted infection and contacts via effective partner notification.&lt;/p&gt;\n&lt;p&gt;To be responsible for reporting, analysing and improving public health outcome indicators. To consult, design and deliver frequent training session to support this with the Integrated Sexual Health &amp; HIV clinical teams and external organisations.&lt;/p&gt;\n&lt;p&gt;To manage, lead, supervise and develop the Results Administrator Coordinator.&lt;/p&gt;\n&lt;p&gt;To support the Lead Health Advisor, Department Manager and Service Manager with the increasing level of external facing contractual commitments, relating to promotion, training, advice, education and clinical services.&lt;/p&gt;\n&lt;p&gt;The Integrated Sexual Health and HIV service provides over 20,000 Genitourinary Medicine appointments and 12,000 contraception appointments each year. The service is interlinked with the HIV service provided from Barking Community Hospital, which as a patient cohort of c.950. Many staff within the ISHS and the HIV service work across all service elements.&lt;/p&gt;\n&lt;p&gt;Pre coronavirus pandemic the service operated from four sites, with Barking Community Hospital as the main hub site operating 6 days per week, a Havering provision at Queen’s Hospital open three days per week and a Redbridge provision at Hainault Health Centre &amp; Loxford Polyclinic open one day per week at each site. This role will be predominantly based at Barking Community Hospital.&lt;/p&gt;\n&lt;p&gt;If you believe you have the skills we require for this dynamic and transformational role, please apply now!&lt;/p&gt;\n&lt;p&gt;For any informal enquires please contact Gary Bradshaw, Service Manager – gary.bradshaw1@nhs.net&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust is subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;br /&gt;&lt;br /&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Nadeem Arif, Recruitment Advisor, on 01708 435000 ext. 2289. Further details regarding the post may be obtained by contacting the manager as per the contact details above.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sexual Health Mngmt., Barking", "postalCode": "IG11 9LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5389", "longitude": ".098696"}}, "title": "Band 6 Results &amp; Systems Lead – Sexual Health &amp; HIV", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252607", "validThrough": "2020-11-06T23:59:59+0000"}