{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-05T11:31:30+0000", "description": "&lt;p&gt;Assistant Psychologist, Edith Rigby PIPE AP and Mentalisation Based Therapy (MBT) programme. Band 4 (AfC)&lt;br /&gt;&lt;br /&gt;An exciting opportunity has arisen within Lancashire and South Cumbria NHS Foundation Trust (LSCFT) for an Assistant Psychologist (Band 4) to join the offender personality disorder pathway service that sits within the Community Business Unit of the Specialist Services Network at Guild Lodge, Preston.&lt;/p&gt;\n&lt;p&gt;Over recent times, LSCFT has been contracted to work with the National Probation Service in Lancashire to deliver elements of the Offender Personality Disorder pathway across a number of Lancashire sites. This work looks toward inter-agency and collaborative work between health and probation services, delivering consultation and formulation, psychologically informed planned environments (PIPEs) and treatment interventions for this client group.&lt;/p&gt;\n&lt;p&gt;The Assistant Psychologist role is envisaged as a split post between two of the OPD pathway projects; Edith Rigby Approved Premise and the Mentalisation-Based Therapy (MBT) programme.&lt;/p&gt;\n&lt;p&gt;Edith Rigby House is an Approved Premise for women in Preston, which is developing practice within a PIPE model. The successful applicant with be part of an enthusiastic clinical team alongside the Clinical Lead, and will work alongside staff from the Approved Premise. The Assistant Psychologist will contribute to the delivery of structured groups within the AP and support the Clinical Lead with formulation of residents’ needs. Data collection and report-writing skills may be utilized in both clinical and service-development contexts.&lt;/p&gt;\n&lt;p&gt;The MBT group is part of a national project aiming to work with men with a history of violence and anti-social personality traits. Project outcome measures relate to re-offending rates and improved psycho-social functioning. The Assistant Psychologist will contribute to the recruitment and assessment of individuals for the programme under the supervision of the Lead Therapist.&lt;/p&gt;\n&lt;p&gt;A one year contract is being offered. A secondment would be considered. Some training opportunities will be available in line with the post’s demands and previous experience. Prior experience in mental health or forensic settings, working with individuals with complex needs and knowledge of risk assessment would be an advantage. We are looking for someone with a positive attitude to supporting individuals with significant clinical and risk-related needs and an ability to work within challenging settings. Both roles involve exposure to sensitive information.&lt;/p&gt;\n&lt;p&gt;Please note that this vacancy will be closed once sufficient applications have been received.&lt;/p&gt;\n&lt;p&gt;If you are not invited to interview within 3 weeks of the closing date, then please assume that on this occasion you have been unsuccessful, as it is not possible to contact all unsuccessful candidates. It is important that applicants log in to the website and check their NHS Jobs account on a regular basis to read and respond to any emails they may have received. If you do not have regular access to email/internet please advise the team of suitable contact details. &lt;br /&gt;&lt;br /&gt;As part of the pre-employment checks, successful candidates will be required to pay for their own DBS check at a cost of £50. Deductions will be taken from the first 3 months’ salary. &lt;br /&gt;&lt;br /&gt;Please note: This post is subject to an Enhanced DBS Clearance &lt;br /&gt;&lt;br /&gt;All posts are subject to the nationally agreed Agenda for Change terms and conditions.&lt;/p&gt;\n&lt;p&gt;Please note that further communication from Lancashire Care NHS Foundation Trust (LCFT) will normally be to the email address given on the application form. You should also ensure that email addresses and telephone numbers are provided for your referees, to enable LCFT to contact them. &lt;br /&gt;&lt;br /&gt;Please ensure that you read the Person Specification attached below as your application will be measured against this document. &lt;br /&gt;&lt;br /&gt;For all posts which require a Disclosure &amp; Barring Service (DBS) check please be aware of the Disclosure &amp; Barring Service Code of Practice. If the post is subject to DBS disclosure, a charge will be made to the successful candidate(s). &lt;br /&gt;&lt;br /&gt;We welcome applications from people regardless of age, disability (especially people who have experience of accessing mental health, or Learning Disability Services or caring for someone who has accessed mental health services or Learning Disability Services), ethnicity, gender, religion or belief or sexual orientation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Louise Swarbrick Clinical Lead  01772 270750&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Lynsey McGann – Service Lead, Offender Personality Disorder Pathways. 01772 406796&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guild Lodge, Preston", "postalCode": "PR3 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8165", "longitude": "-2.65834"}}, "title": "Clinical Psychology Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257471", "validThrough": "2020-11-19T23:59:59+0000"}