{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 to £51,069 pa"}}, "datePosted": "2020-10-27T13:30:12+0000", "description": "&lt;p&gt;We are committed to the delivery of outstanding care for our patients, are you?&lt;/p&gt;\n&lt;p&gt;As a world leader in healthcare and research we have built something amazing – a brand new Alder Hey in the park, a hospital for children, designed and inspired by children. Along with a radical and ambitious vision, the Children’s Health Park is the future design of paediatric care and there’s nothing like it anywhere in Europe.&lt;/p&gt;\n&lt;p&gt;We have already earned our place as one of the world&#39;s leading Children&#39;s hospitals, thanks to innovation and pioneering medical work. We treat 250,000 young patients a year and safely perform over 13,000 surgical procedures. Our catchment area has a population of over 7m, stretching from Cumbria, through Lancashire, Merseyside, most of Cheshire, parts of Shropshire, North Wales and the Isle of Man.&lt;/p&gt;\n&lt;p&gt;This is a clinical fellowship 12 month post commencing in 2021 and 2022 aimed at trainees coming to the end of or having finished their training with Plastics, who have a specific interest in paediatric surgery. The post will be based at Alder Hey Burns &amp; Plastics department and involves working with the paediatric surgeons.&lt;/p&gt;\n&lt;p&gt;This service provides tertiary paediatric Burns &amp; Plastics cover for children from Merseyside, Cheshire, parts of Lancashire, Shropshire, Isle of Man, North Wales and Northern Ireland. The total population base is over 5 million. The department are currently looking for individuals who are able to come and spend time working with our prestigious department in 2021 or 2022. The job description and person specification details the main roles and requirements of the position.&lt;/p&gt;\n&lt;p&gt;The successful candidate must demonstrate an attitude that respects and values service users and also the core values of Alder Hey Children’s NHS Foundation Trust. The successful candidate will share this commitment and demonstrate both our Trust values and our culture of compassionate care.&lt;/p&gt;\n&lt;p&gt;Being part of Alder Hey can provide you with staff benefits including Lease Car Scheme, Staff Gym, Smoking Cessation Services, Childcare and Family Support, Childcare vouchers, Cycle to work schemes and the new Electronics home salary sacrifice scheme.&lt;/p&gt;\n&lt;p&gt;For further details please contact: Hannah Dance, Assistant Service Manager for Surgery. Telephone number: 0151 228 4811 extension 4771. Email: hannah.dance@alderhey.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120727.jpg", "name": "Alder Hey Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120727"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L12 2AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4213", "longitude": "-2.8978"}}, "title": "Senior Clinical Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244723", "validThrough": "2020-11-24T23:59:59+0000"}