{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T15:16:06+0000", "description": "&lt;p&gt;Have you always wanted to work in critical care? We are able to offer an exciting post for a therapist who is passionate about high quality patient care, team working and clinical and professional development. This newly funded post covering critical care is part of a successful service development and the postholder will work alongside a B7 Clinical lead in CRCU.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and resourceful therapist to join our service and support us in further establishing the SLT role. The CRCU at Royal Preston Hospital has recently benefited from refurbishment together with a new build and offers a purpose built environment.&lt;/p&gt;\n&lt;p&gt;The post holder will have experience of working with patients with tracheostomy and ventilatory support respectively. You are required to have specialist dysphagia skills in addition to being able to support the communication needs of patients on the unit. Multidisciplinary team working is integral to patient care and the post holder will support patient assessment and rehabilitation within the context of the MDT.&lt;/p&gt;\n&lt;p&gt;There is potential flexibility to increase the hours to 0.7wte (26.25) hours per week dependent upon discussion.&lt;/p&gt;\n&lt;p&gt;The Speech and Language therapy service has 23.0 wte staff and is part of Integrated Nutrition and Communication Services which includes the Department of Dietetics and The Nutrition Nurse Team. We are a friendly team with a strong commitment to evidence based practice with regular CPD, appraisal and training opportunities. Established support is available at B7 level and from the Head of Service.&lt;/p&gt;\n&lt;p&gt;Interview Date: 1st December 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarmel RichardsonJob titleClinical Lead Speech &amp; Language therapistEmail addresscarmel.richardson@lthtr.nhs.ukTelephone number01772 522426&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Specialist Speech &amp; language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260309", "validThrough": "2020-11-15T23:59:59+0000"}