{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum / pro rata"}}, "datePosted": "2020-11-02T11:01:06+0000", "description": "&lt;p&gt;The North and West Older Adult CMHT provides a service across the North and West of Oxfordshire. The post is based in the market town of Witney (and surrounding areas) which is on the River Windrush, 10 miles from Oxford. It is the largest town in the Oxfordshire Cotswolds and has grown rapidly over the last 50 years but still retains the feel of a charming and bustling market town with an excellent range of shops and services.&lt;/p&gt;\n&lt;p&gt;The CMHT works across 7 days and offers extended hours between 9am and 8pm. &lt;strong&gt;This post is offered at a minimum of 30 hours per week.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a supportive, dynamic and integrated team which, although busy, has many rewards. We care deeply about our patients, their families and carers. We believe in listening and responding as a team, piloting new models, supporting each other and developing and using new care approaches, working closely with research colleagues. We aim to improve patient care as well as provide increased staff satisfaction and sense of achievement.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a qualified Mental Health Nurse to be an integral part of the team which provides specialist mental health care for adults over 65 years and memory clinic services. You will be based in our Witney office, however you will also provide cross cover and duty services from our Banbury and Chipping Norton offices when required.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to deliver and maintain high quality and meaningful care for our patients. You will need to be a highly motivated practitioner who has experience of mental health services and can demonstrate the ability to initiate and manage your work effectively. The team is highly supportive and committed to delivering high quality patient care; where the caseload can be demanding, diverse and frequently complex.&lt;/p&gt;\n&lt;p&gt;Regular supervision will be provided, and you will be encouraged to undertake any training relevant to your professional and personal development.&lt;/p&gt;\n&lt;p&gt;If you are a Registered Mental Health Nurse with these skills, we would be very interested in welcoming you to our team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNatalie HerbertJob titleActing Team ManagerEmail addressnatalie.herbert@oxfordhealth.nhs.ukTelephone number01865 902726Additional contact information&lt;/p&gt;\n&lt;p&gt;Tasmin Irving&lt;/p&gt;\n&lt;p&gt;01865 902726&lt;/p&gt;\n&lt;p&gt;07767 338860&lt;/p&gt;\n&lt;p&gt;Tasmin.irving@oxfordhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nuffield Health Centre, Witney", "postalCode": "OX26 6JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8993", "longitude": "-1.15155"}}, "title": "Community Psychiatric Nurse/Care Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251674", "validThrough": "2020-11-30T23:59:59+0000"}