{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 p.a"}}, "datePosted": "2020-11-05T15:31:34+0000", "description": "&lt;p&gt;Cherrywood Rehabilitation unit is a recovery focused 7 bedded inpatient unit for those individuals with long and enduring mental health needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking enthusiastic and motivated people to join our multi disciplinary team in providing recovery focused support for individuals with mental health problems. The staff team at Cherrywood support service users to engage in a wide range of therapeutic activities so that they can meet their maximum potential on their recovery pathway. The team works closely with other parts of the service and other organisations to facilitate a positive recovery pathway for each person in an individualised and holistic way.&lt;/p&gt;\n&lt;p&gt;The successful candidates will have at demonstrable or equivalent experience working in a mental health setting. The role will require the individual to support service users to gain skills and confidence with daily activities and also support service users to access community resources as part of their recovery pathway. It is important the candidate feels confident to work independently but is also a positive team member. Interventions take the form of both group or individual activities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Virginia Richards&lt;br /&gt;Job title Unit Manager&lt;br /&gt;Email address virginia.richards@nhs.net &lt;br /&gt;Telephone number 01908 282072&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cherrywood, Milton Keynes", "postalCode": "MK7 7HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0213", "longitude": "-.686002"}}, "title": "Activity Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258353", "validThrough": "2020-11-19T23:59:59+0000"}