{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 to £76,751 pa"}}, "datePosted": "2020-11-05T17:16:16+0000", "description": "&lt;p&gt;SPECIALTY DOCTOR IN NEONATAL MEDICINE – MIDDLE GRADE - 10 PAs&lt;/p&gt;\n&lt;p&gt;An exciting opportunity with a very well-remunerated package has arisen for a Neonatal Doctors to join our dynamic team at the Royal Bolton Hospital to help further develop our Neonatal services.&lt;/p&gt;\n&lt;p&gt;This post is for an initial period of 6 months with the option of a permanent position if mutually agreed.&lt;/p&gt;\n&lt;p&gt;The successful applicant would work at Middle Grade level including contributing to the Middle Grade out-of-hours rota. The post is composed of 10 PAs. The job plan can be negotiated to fit in with the needs of the individual.&lt;/p&gt;\n&lt;p&gt;There is excellent scope to develop an area of special interest.&lt;/p&gt;\n&lt;p&gt;The Royal Bolton Hospital is a busy acute hospital with an excellent reputation for teaching and senior support. In 2011 we opened our new purpose-built Neonatal Intensive Care Unit which consists of a total of 36 cots, 9 of which are designated as Intensive Care. We have over 600 admissions per year of which over 100 are of very low birth weight.&lt;/p&gt;\n&lt;p&gt;This Trust is committed to safeguarding children, young people and vulnerable adults and requires all staff and volunteers to share this commitment.&lt;/p&gt;\n&lt;p&gt;Bolton NHS Foundation Trust provide services across the north west side of the Greater Manchester area ranging from hospital services in Bolton to community services across Bolton, Salford, Ashton, Leigh and Wigan. We are a progressive, expanding organisation with great ambition around improving quality, integrating pathways and delivering high levels of productivity. We have recently been given a CQC rating of Good. Over 5,700 people work for the Trust and many of them have been here a long time. People find they don’t need to go elsewhere to find a fulfilling career in healthcare. The Trust offer a range of flexible working patterns to enable our staff to balance their work and personal life.&lt;/p&gt;\n&lt;p&gt;The Family Division aims to deliver the highest standards of care for maternity, sexual health, gynaecology and a range of acute and community children’s services. The Division is a Centre of Excellence for Women’s and Children’s services and has a credible and enviable reputation. We deliver over 6,000 babies and carry around 1500 gynaecological procedures each year, making us a specialist provider of health services for women, babies and their families in the North West Sector of Manchester and beyond.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be subject to appropriate disclosure by the Criminal Records Bureau.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Archana Mishra, Clinical Lead on 01024 390335&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121713.png", "name": "Bolton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121713"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bolton NHS Foundation Trust, Bolton", "postalCode": "BL4 0JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.554", "longitude": "-2.42989"}}, "title": "Speciality Doctor - Neonatolgy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258697", "validThrough": "2020-11-19T23:59:59+0000"}