{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum incl. HCAS"}}, "datePosted": "2020-10-26T16:31:43+0000", "description": "&lt;p&gt;We are seeking a highly experienced HIV Clinical Nurse Specialist for our acute and community services as part of a multidisciplinary community team and in liaison with the acute services at the Chelsea and Westminster NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The post holder will enhance the provision of care to people living with HIV/AIDS currently on or off combination drug therapies, empower individuals to maximise their independence in living as normal a life as possible. By working in partnership with community nursing services, GP practices, the acute providers and local social services, establish the close working relationship that is essential in ensuring that care is coordinated and responsive to individual need.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post requires a high standard of the following:-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To work as an independent practitioner supporting Stable HIV patient and those with highly complex needs across all areas as part of Chelsea and Westminster Healthcare NHS Fdn Trust.&lt;/p&gt;\n&lt;p&gt;To act as an expert and a resource on HIV healthcare issues to Specialist Palliative Care Service, local nursing services, GP’s and social service teams.&lt;/p&gt;\n&lt;p&gt;To promote collaboration between acute and community health and social care providers.&lt;/p&gt;\n&lt;p&gt;Non-medical prescribing&lt;/p&gt;\n&lt;p&gt;Advanced assessment skills&lt;/p&gt;\n&lt;p&gt;Managerial skills&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful candidate will have a flexible approach to duties and the ability to remain calm in a busy environment. An essential requirement of the post is an ability to work as part of a team and without direct supervision including lone working. The post holder will also need to work cross sites so a car driver would be preferred but not essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will join a well-established progressive team. We are committed to staff support and team work and ensuring patients’ needs are put at the forefront of everything you do. If you are friendly and have a patient-centred approach, come and join us!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Chris Higgs&lt;/p&gt;\n&lt;p&gt;Job title: Lead Nurse for HIV&lt;/p&gt;\n&lt;p&gt;Email address: chris.higgs@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0203315 3420&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelsea &amp; Westminster Hospital, London", "postalCode": "SW10 9NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.181435"}}, "title": "Clinical Nurse Specialist HIV Acute and Community", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243440", "validThrough": "2020-11-09T23:59:59+0000"}