{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa prorata plus HCAS"}}, "datePosted": "2020-10-23T17:45:32+0100", "description": "&lt;p&gt;Band 3 Peer Support Worker post in Early Intervention in Psychosis Services in Hammersmith and Fulham, Ealing and Hounslow.&lt;/p&gt;\n&lt;p&gt;Do you have experience of using mental health services? Would you like to use this experience to help others?&lt;/p&gt;\n&lt;p&gt;We have exciting opportunities for peer support workers with lived experience of mental health problems to join our Early Intervention in Psychosis Service (EIP) that are based across the trust.&lt;/p&gt;\n&lt;p&gt;The peer support work service is growing in West London NHS Trust, and it is a really great time to be joining us. We need people who are prepared to use their own experience to support and encourage others to develop an independent and meaningful life. The post can be full or part time depending upon availability and service needs.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have access to relevant training to help to work confidently to support others as well as all mandatory training required for the post. Following the successful completion of relevant training, you will be supported to work towards becoming a senior peer support worker (Band 4).&lt;/p&gt;\n&lt;p&gt;West London NHS Trust prides itself on valuing every member of the workforce and supporting their development. As a Peer Support Worker you will be expected to embrace the Trust values of Excellence, Caring, Responsibility and Togetherness and demonstrate these values within your role.&lt;/p&gt;\n&lt;p&gt;What we can offer you:&lt;/p&gt;\n&lt;p&gt;•The Trust offers a new and unique benefits package which includes lease cars, discount cards for high street stores, supermarkets, holidays and days out.&lt;br /&gt;•As a Trust we will provide you with Supervision, on-going Professional development, a stimulating and challenging working environment and opportunities for career development within West London NHS Trust.&lt;br /&gt;•We can offer bespoke training in relation to community mental health care.&lt;br /&gt;•A unique opportunity to broaden experience and develop skills in our community services&lt;/p&gt;\n&lt;p&gt;For more information, please contact &lt;br /&gt;Candace Dore 07784362126 or email Candace.dore@westlondon.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCandace DoreEmail addressCandace.dore@westlondon.nhs.ukTelephone number07784362126Additional contact information&lt;/p&gt;\n&lt;p&gt;Flu vaccination – what we expect from our staff&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;At West London we look after patients who are vulnerable. Each year, seasonal flu affects thousands of people in the UK. Occurring mainly in winter, it is an infectious respiratory disease capable of producing symptoms ranging from those similar to the common cold, through to the very severe or even fatal disease.&lt;/p&gt;\n&lt;p&gt;The wellbeing of our staff and patients is of the utmost importance to us, and it is the expectation of the Trust that all patient-facing staff have an annual flu vaccination, provided free of charge by the Trust.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "EIS Triborough Service, Southall", "postalCode": "UB1 3EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5067", "longitude": "-.351054"}}, "title": "Peer Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241462", "validThrough": "2020-11-06T23:59:59+0000"}