{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 to £51,393 pa pro rata inclusive of HCAS"}}, "datePosted": "2020-10-29T17:01:04+0000", "description": "&lt;p&gt;&lt;strong&gt;Psychosis services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Clinical or Counselling Psychologists (Band 7) - Recovery and Rehabilitation Division&lt;/p&gt;\n&lt;p&gt;Several exciting full-time or part-time Clinical or Counselling psychology posts have arisen in the Trust’s Recovery and Rehabilitation Division. This Division provides services for people with diagnoses of psychosis or bipolar and associated difficulties.&lt;/p&gt;\n&lt;p&gt;The post holders will provide a psychology service to community Recovery Teams in Camden and/or Islington, or to the Camden Early Intervention Service. These are all multidisciplinary mental health teams that provide care co-ordination, psychiatric and psychological services to a wide range of clients living in the community.&lt;/p&gt;\n&lt;p&gt;The successful candidates will apply assessment, formulation, therapeutic and consultation skills with individuals and families across a wide range of complex referrals. They will also be involved in joint working and consultation with multidisciplinary team members, supervision of relevant staff, staff training, and service audit and development projects. They will be expected to practice as independent clinicians and work autonomously within professional guidelines and the policies and procedures of the service.&lt;/p&gt;\n&lt;p&gt;Regular clinical and management supervision is provided across the R&amp;R psychology service, and there is very good scope for continued professional development within the Trust. Previous experience of working with people with psychosis and an enthusiasm for creative working with this group, are essential for the positions. The posts require Health and Care Professions Council registration as a clinical or counselling psychologist.&lt;/p&gt;\n&lt;p&gt;Candidates coming towards the end of their clinical or counselling psychology training may apply and commence in post after qualification and registration with the HCPC. If there is significant delay in obtaining qualification from a training course as a result of requirements to make major thesis corrections, then initial appointment at Band 6 as a trainee psychologist, with progression to Band 7 on qualification and HCPC registration, will be considered.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGraham PickupJob titlePsychology Lead, Recovery and Rehabilitation DivisionEmail addressgraham.pickup@candi.nhs.ukTelephone number0203 317 6203Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121247.jpg", "name": "Camden and Islington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121247"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various sites across Camden and Islington, London", "postalCode": "NW1 0PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5365", "longitude": "-.131478"}}, "title": "Clinical or Counselling Psychologist - Psychosis Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249174", "validThrough": "2020-11-19T23:59:59+0000"}