{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T11:31:21+0000", "description": "&lt;p&gt;We are a dynamic team of over 80 nurses who are proud to have received a rating of ‘outstanding’ for the care we provide from the CQC with an overall rating of good for our services 2020.&lt;br /&gt;&lt;br /&gt;We are looking to recruit nurses with critical care experience or nurses with a desire to develop a career in critical care. We will commit to provide ongoing developmental support through our friendly team structure and award winning educators! They were named ‘Wessex High Performing Training and Education Team of the Year’ 2016.&lt;/p&gt;\n&lt;p&gt;You will receive a significant supernumerary period and the opportunity to complete our Critical Care Foundation Programme (CCFP). In addition there is a Preceptorship Programme in place within the Trust. The CCFP has associated study days that sit alongside the National Step 1 competencies. Upon successful completion of this you will be able to apply for a position on the Adult Critical Care Course delivered by Bournemouth University and in time, our in-house bespoke Experienced Nurse Program. &lt;br /&gt;&lt;br /&gt;We have a daily teaching program; undertake simulation sessions and monthly M&amp;M meetings where learning through experience is encouraged. Opportunities for other development also exist.&lt;br /&gt;&lt;br /&gt;The unit currently operates 18 beds which flex according to service requirements, accepting emergency and elective work. We specialise in caring for patient’s post operatively following surgery for peritoneal malignancy and are one of only two sites in the UK recommended by NICE for this treatment.&lt;br /&gt;&lt;br /&gt;You will need to be energetic, self-motivated with a genuine passion for nursing and delivering high quality care to the most vulnerable and their families. &lt;br /&gt;&lt;br /&gt;We are flexible employers and offer full and part time opportunities as well as the chance to rotate through other departments and to our sister unit at the Royal Hampshire County Hospital. We encourage and welcome informal visits to the unit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lucy O&#39;Beirne, Lead Educator - Lucy.OBeirne@hhft.nhs.uk or Victoria Taylor, Matron - victoria.taylor@hhft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01256 313560&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke &amp; North Hampshire Hospital, Basingstoke", "postalCode": "RG24 9NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2806", "longitude": "-1.10986"}}, "title": "Critical Care/Intensive Care Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242226", "validThrough": "2020-11-09T23:59:59+0000"}