{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "From £24,907 per annum (pro rata for part time)"}}, "datePosted": "2020-10-27T12:17:18+0000", "description": "&lt;p&gt;Dune Ward, in the grounds of Weston General Hospital, is part of Avon and Wiltshire Mental Health Partnership NHS Trust (AWP). It’s a 14 bed ward caring for those with a dementia illness for a short period of assessment and treatment whilst they are in hospital.&lt;/p&gt;\n&lt;p&gt;We are recruiting Registered Nurses (RMN and RGN) and Healthcare Support Workers to the team and if you have a passion and experience of with working with people with dementia, are committed to delivering a high standard of care and to team working we would really like to meet you.&lt;/p&gt;\n&lt;p&gt;You will be required to work a mixture of shifts including weekends and bank holidays (early shifts 07:00-15:00, late shifts 13:30-21:30 and night shifts 21:00-07:30) and will receive a shift allowance on top of your annual salary.&lt;/p&gt;\n&lt;p&gt;You will be welcomed to AWP with a great induction package. In addition Healthcare Support Workers will receive training to complete the NHS Care Certificate and a Level 2 or 3 Healthcare apprenticeship. Newly qualified nurses will have a strong preceptorship package as they take on their first role and all nurses will have access to learning opportunities.&lt;/p&gt;\n&lt;p&gt;As an NHS employee you will have access to a wide range of benefits and discounts together with access to the NHS pension scheme and generous annual leave.&lt;/p&gt;\n&lt;p&gt;WP offers a great induction, learning opportunities including areas of such as dementia mapping&lt;/p&gt;\n&lt;p&gt;For more information or an informal chat, please call Sarah Pavey, Ward Manager, on 01934 836522 or 01934 836500.&lt;/p&gt;\n&lt;p&gt;Go to jobs/awp.nhs.uk and search &quot;Nursing and Midwifery&quot; to apply on line&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Weston Super Mare", "postalCode": "BS23 4TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3229", "longitude": "-2.97333"}}, "title": "Band 5 Staff Nurse - Dune Ward, Weston Super Mare", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244461", "validThrough": "2020-11-08T23:59:59+0000"}