{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51198", "minValue": "51198", "unitText": "YEAR", "value": "£51,198 per annum, inc London Weighting"}}, "datePosted": "2020-10-08T16:46:43+0100", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust has an enviable track record in research and development and service innovation. In partnership with King’s College London the Trust has recently been awarded a National Research Centre in Patient Safety and Service Quality. It is also a partner in two National Institute for Health Research biomedical research centres. The first is a Comprehensive centre with King’s College London and Guy’s and St Thomas’ NHS&lt;br /&gt;Foundation Trust and the second is a Specialist centre with the South London and Maudsley NHS Foundation Trust and the Institute of Psychiatry. King’s College Hospital NHS Foundation Trust has also recently strengthened its research and development infrastructure in order better to support clinical researchers across the organisation.&lt;br /&gt; &lt;br /&gt;&lt;strong&gt;Overview of the Post:&lt;/strong&gt;&lt;br /&gt;The successful applicant will contribute to the provision of a routine comprehensive diagnostic Cellular Pathology service. The successful candidate will undertake a range of duties under the supervision of the relevant Histopathology Consultants. Candidates will have the opportunity to develop their knowledge of a wide range of histology and cytology specimens. They can also do autopsies if interested. Duties will also include preparing for and attending multi-disciplinary team meetings.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Paul Whitcombe&lt;/p&gt;\n&lt;p&gt;Job title Medical Staffing Coordinator&lt;/p&gt;\n&lt;p&gt;Email address paul.whitcombe@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07809737707&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Meenal Gupta&lt;br /&gt;Consultant Histopathologist&lt;br /&gt;Princess Royal University Hospital&lt;br /&gt;Tel: 01689864289&lt;br /&gt;meenalgupta@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Clinical Fellow in Cellular Pathology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219209", "validThrough": "2020-11-07T23:59:59+0000"}