{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa plus HCA&#39;s"}}, "datePosted": "2020-11-05T12:30:39+0000", "description": "&lt;p&gt;Are you passionate about enabling children to be the best they can? Are you wanting to develop your specialist skills within paediatrics? Then we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;An opportunity has become available within the &lt;em&gt;Barnet Children’s Integrated Therapy Team&lt;/em&gt; for a Band 6 Paediatric Physiotherapist.&lt;/p&gt;\n&lt;p&gt;We are looking for a physiotherapist with experience of working in paediatrics to join our friendly integrated community team, which is made up of Physiotherapists, Occupational Therapists and Speech and Language Therapists.&lt;/p&gt;\n&lt;p&gt;This stimulating post involves assessing and providing advice and intervention for children and young people aged 0-19 years with a variety of developmental and MSK conditions. You will have opportunity to experience and develop skills in different areas within the service and will be working in a variety of settings including clinics, schools, nurseries and family homes.&lt;/p&gt;\n&lt;p&gt;As a large trust we are committed to improving our services and the skills of all our staff. You will have access to regular supervision and training.&lt;/p&gt;\n&lt;p&gt;Therapists are encouraged to work in an agile way and flexible working may be considered. A car driver is not essential.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;****PLEASE NOTE THIS POST ATTRACTS A RECRUITMENT INCENTIVE ******&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is a 10% recruitment incentive for this post. This is made up of 5% of basic salary payable upon successful completion of probation period &amp; a further 5% of basic salary payable after 2 years in post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Probationary Period&lt;br /&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;Assessment/Interview info&lt;br /&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;Starting with NELFT&lt;br /&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focusing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;High Cost Area Supplement – London&lt;br /&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Marion NeumanTelephone number03003001821Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details please contact Marion Neuman Clinical Team Lead, Children&#39;s Integrated Therapies.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Edgware Community Hospital, HA8 0AD, Barnet", "postalCode": "HA8 0AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6058", "longitude": "-.271851"}}, "title": "Specialist Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257664", "validThrough": "2020-11-19T23:59:59+0000"}