{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-19T14:10:37+0100", "description": "&lt;p&gt;Would you like the opportunity to work as an Unscheduled Care Practitioner for Defence Primary Healthcare? Within this role you will lead and develop the medical facility team to deliver effective unscheduled care for Defence Primary Healthcare. In a friendly and exciting environment, you will manage and carry out care programmes directly to patients to meet their care needs.&lt;/p&gt;\n&lt;p&gt;Benefits include free parking.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your primary duties will include but not be limited to:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Clinical Practice&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Co-ordinate care of patients, referring to and liaising with other agencies and disciplines.&lt;/li&gt;\n&lt;li&gt;Identify, assess and diagnose patients with minor injury or illness and refer patients who present ‘red flag’ symptoms in a timely manner to other professionals or agencies.&lt;/li&gt;\n&lt;li&gt;Administer medication for patients with unscheduled health care needs consistent with protocols, standards and legislation in accordance with Patient Group Directions and DPHC policies and guidelines.&lt;/li&gt;\n&lt;li&gt;Initiate diagnostic work up (e.g. ordering X- rays, blood tests, Etc) for individual patients&#39; needs.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Clinical Practice Leadership&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead and develop the multidisciplinary team to deliver effective service.&lt;/li&gt;\n&lt;li&gt;Support the practice management team and regional headquarters in implementing systems and processes to ensure a high quality service.&lt;/li&gt;\n&lt;li&gt;Monitor and evaluate the delivery of care within the medical facility maintaining consistency of professional standards through audit and healthcare governance.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Clinical Practice Development&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop policies, protocols and guidance as required to support the service delivery.&lt;/li&gt;\n&lt;li&gt;Interpretation of regional policy to ensure efficient delivery at local level.&lt;/li&gt;\n&lt;li&gt;Participate with medical centre team members in Clinical Risk Management and the maintenance of this register.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Management and Leadership&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist in the evaluation of the service and implement appropriate change following discussion and agreement with the Senior Medical Officer (SMO) and Advanced Nurse Practitioner (ANP).&lt;/li&gt;\n&lt;li&gt;Participate in the staff appraisal scheme. Responsible for personal development plan in line with the Medical facility Development Plan and meeting competencies.&lt;/li&gt;\n&lt;li&gt;Monitor and supervise the standard of care undertaken by junior staff and to guide, coach and advise appropriately to achieve a first-rate quality of service.&lt;/li&gt;\n&lt;li&gt;Undertake the role of line manager for a small team of staff within the Medical Facility and the management of staff sickness, staff shortages, complaints, discipline and unforeseen problems.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please read the attached Job Description for further information on the role and its requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Criteria&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants must:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be a registered Nurse part 1 with live registration OR Health and Care Professionals Council (HCPC) registration&lt;/li&gt;\n&lt;li&gt;Have a degree or level 6 qualification in Clinical Examination Skills / Minor Injuries / Minor Illness and / or Minor Emergencies&lt;/li&gt;\n&lt;li&gt;Have Adult &amp; Paediatric clinical assessment skills&lt;/li&gt;\n&lt;li&gt;Have a Non-medical prescribing qualification or willingness to undertake it&lt;/li&gt;\n&lt;li&gt;Have experience of working with computerised patient record systems&lt;/li&gt;\n&lt;li&gt;Have broad clinical experience relevant to the post in either primary care / Emergency Dept / unscheduled care settings or Ambulance Service&lt;/li&gt;\n&lt;li&gt;Be a non medical prescriber (or willing to work towards the qualification&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;It is desirable to have a full driving licence.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection Process&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core – NHS6 – Equality and Diversity&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC1 – Communication&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC2 – Personal &amp; People Development&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC4 – Service Improvement&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC5 – Quality&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB2 – Assessment &amp; Care Planning&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt;This post does not offer any assistance with relocation allowances.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ITC Catterick, Vimy Barracks, Catterick Garrison, North Yorkshire DL9 3PS", "postalCode": "DL9 3PS"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3641", "longitude": "-1.71592"}}, "title": "Band 7 Unscheduled Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232621", "validThrough": "2020-11-18T23:59:59+0000"}