{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T09:11:05+0100", "description": "&lt;p&gt;An exciting opportunity has arisen to join our innovative Community Nursing team supporting the community of Macclesfield for a permanent contract&lt;/p&gt;\n&lt;p&gt;The Community Nursing teams of East Cheshire are leading the way in integrated working. Closer working relationships with colleagues in Therapies and Social Services have been formed, as part of working aligned to Care Communities with new programmes and projects being developed with other specialties, supporting multi-professional working.&lt;/p&gt;\n&lt;p&gt;Being part of our friendly and supportive team is an opportunity to take forward the expanding role of community nursing within the multi-disciplinary neighbourhood teams to meet the long term condition agenda and the needs of our elderly population. Our dynamic management team are supportive and open to ideas and innovation. It is expected you will have an understanding and commitment to the modernisation of community nursing.&lt;/p&gt;\n&lt;p&gt;You will have varied exposure to a range of clients with differing needs ranging from wound dressings to end of life and everything in between, no two days are ever the same!&lt;/p&gt;\n&lt;p&gt;You must possess effective communication and negotiation skills, as advocates for our patients we need you to have the ability to inspire at all levels.&lt;/p&gt;\n&lt;p&gt;You will have the guarantee of an annual appraisal. Your personal development will be supported tailored to your individual learning needs which can include access to funded training opportunities. Many of the team are qualified mentors, which allows us to offer excellent preceptorship for newly qualified nurses.&lt;/p&gt;\n&lt;p&gt;The team is based at Waters Green Medical Centre. However, you may be expected to be flexible with your base according to service need.&lt;/p&gt;\n&lt;p&gt;Travel is an essential part of this role; please demonstrate on your application form how you would meet this requirement.&lt;/p&gt;\n&lt;p&gt;The service covers from 8am until 5pm seven days a week.&lt;/p&gt;\n&lt;p&gt;This post is permanent&lt;/p&gt;\n&lt;p&gt;Hours per week: 37.5&lt;/p&gt;\n&lt;p&gt;Closing date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced with Barred list Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Jane Taylor/Rosheen Gillies Job title District Nurse Team leader Email address jane.taylor7@nhs.net Telephone number&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Waters Green Medical Centre, Macclesfield", "postalCode": "SK11 6JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2579", "longitude": "-2.12265"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239759", "validThrough": "2020-11-08T23:59:59+0000"}