{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36862", "minValue": "32752", "unitText": "YEAR", "value": "£32,752 - £36,862 per annum (Pay Award Pending)"}}, "datePosted": "2020-10-14T12:11:53+0100", "description": "&lt;p&gt;&lt;br /&gt;This is a fantastic opportunity for a Registered Nurse with significant recent Occupational Health experience to join our supportive and dynamic, multidisciplinary team (MDT) at Hampshire County Council. If you share our commitment to enhancing the health and well-being of others, then this is the opportunity for you! &lt;br /&gt;About our team &lt;br /&gt;Our team comprises Occupational Health advisers, wellbeing advisers, screening technicians, fitness advisers and an administration team, with a contracted-in Occupational Health Physician provision. We provide a service to a diverse working population including Hampshire County Council and its schools, Hampshire Fire and Rescue Service, Isle of Wight Fire and Rescue Service and Hampshire Constabulary. Working across our partners you will have the opportunity to gain a wide range of experience and develop new skills. &lt;br /&gt;Your role will be case management based, where you will assist in the delivery of a comprehensive occupational health service which assesses, advises and monitors from a medical point of view the fitness to work of employees in line with legislative requirements and good practice. &lt;br /&gt;You will be an RN1 Adult Nurse level 1 or an RN3 Mental Health Nurse Level 1. An enthusiastic team player, with excellent communication skills, you will be motivated and have good IT skills. Knowledge of Cohort software would also be advantageous. Benefits of working here &lt;br /&gt;In return, we offer a welcoming, supportive and professional team environment, good values and a commitment to your learning and development. &lt;br /&gt;You will also benefit from a generous employment package including a competitive annual leave entitlement, local government pension, flexible working opportunities and employee loans for travel costs, amongst our many other benefits.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hampshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129457"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastleigh", "postalCode": "SO53 3AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9749", "longitude": "-1.37552"}}, "title": "Occupational Health Adviser", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226157", "validThrough": "2020-11-12T23:59:59+0000"}