{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24907 - £30615 pa pro rata"}}, "datePosted": "2020-10-23T11:33:01+0100", "description": "&lt;p&gt;We are currently recruiting a full time Band 5 Nurse for the Looked after Children&#39;s team, to support our Looked after Child Programme. This is a great opportunity to support the needs of vulnerable children across Leicester, Leicestershire and Rutland.&lt;/p&gt;\n&lt;p&gt;You will work with children and young people aged 5-18 within the 3 Local Authority&#39;s in conjunction with other professionals, families and care givers, to maximise their health potential and address their health inequalities. You will work closely with a Band 6 SCPHN LAC nurse , who will support and line manage you and also as part of the wider LAC nursing team, assessing the health of this group of children and young people and implementing any necessary care pathways.&lt;/p&gt;\n&lt;p&gt;As the ideal candidate you will need to be able to demonstrate a strong desire to improve the outcomes of children and young people and demonstrate your understanding of the importance of working collaboratively with our multidisciplinary colleagues.&lt;/p&gt;\n&lt;p&gt;You will be responsible for attending or contributing to safeguarding meetings, case conferences, Looked After Children&#39;s reviews, pathway planning meetings, professional meetings and strategy meetings, producing quality reports to support the delivery of needs for this vulnerable group of children.&lt;/p&gt;\n&lt;p&gt;You must understand the importance of safeguarding children and young people. You should have the ability to work on your own initiative, demonstrating a well organised and flexible approach to the management of changing and conflicting priorities is key to success within this role.&lt;/p&gt;\n&lt;p&gt;Embracing our values of compassion, trust, respect and integrity, in return you will you be supported by our FYPC service to develop your skills and knowledge, supported by a comprehensive induction period, preceptorship (if required) and ongoing support.&lt;/p&gt;\n&lt;p&gt;LPT run car leasing and car salary sacrifice schemes subject to meeting the acceptance criteria.&lt;/p&gt;\n&lt;p&gt;If you are interested and would like to find out some more information then please contact:&lt;/p&gt;\n&lt;p&gt;Deborah Hockett Clinical Team leader 07825865809 or Claire Read- named nurse 07880096170&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LLR", "postalCode": "LE4 8PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6765", "longitude": "-1.10301"}}, "title": "Band 5 Looked After Children Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240348", "validThrough": "2020-11-06T23:59:59+0000"}