{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 per annum"}}, "datePosted": "2020-10-22T13:54:02+0100", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a highly motivated and enthusiastic individual to become part of our Oncology Advanced Clinical Practitioner (ACP) team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role is multi-faceted and provides opportunity to work in various areas within Oncology.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Acute Oncology department and Medical Oncology clinics are a large part of the role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;When covering Acute Oncology you will be caring for those who are acutely unwell as a result of their treatment or disease. You will be working alongside the Acute Oncology Clinical Nurse Specialist Team to provide expert advice, diagnostics and treatment. This is a nurse/ACP led service with support/advice should it be required from Medical colleagues.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The team currently provide clinics for Breast, Lung, Lower GI, Urology &amp; Cancer of Unknown Primary tumour sites, the post holder will be given training and fulfil competencies to be able to undertake clinics within 1 or 2 of these specialities with opportunity to rotate in the future. There could also be scope for these to include Gynae and Upper GI. cancers. This is an ideal opportunity to focus on specific interests within Oncology and become expert within a chosen tumour site.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Oncology bed base is predominantly at Leeds Teaching Hospitals, who we have a close working relationship with however we do have Oncology patients in our bed base and it is the ACPs role to review and provide expert advice to the treating team should it be required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Whilst Oncology experience would be advantageous we would actively welcome applications from candidates with Acute Medicine, Haematology or Palliative Care ACP experience. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These are very autonomous roles and would suit a dynamic, forward thinking individual. You will be actively encouraged to be involved in governance, audit, mortality reviews, education and research.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interviews will be held over teams and will include an “Ice breaking” session beforehand to meet the rest of the team, and ask them questions.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Advanced Clinical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238762", "validThrough": "2020-11-27T23:59:59+0000"}