{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T10:46:19+0000", "description": "&lt;p&gt;&lt;strong&gt;*** Applications from students nearing completion of their studies &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;and Return to Practice Nurses are encouraged ***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5 Salary - Plus £2600 (RRP + New Hire Bonus) and Unsocial Hours Enhancements &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The TGU specialises in the assessment and treatment of mentally disordered offenders, serving the community of Kent and a population of approximately 1.6 million. The service now provides a total of 66 beds throughout a range of clinical facilities based on patient need.&lt;/p&gt;\n&lt;p&gt;At the Trevor Gibbens Unit, we are committed to include our patients in all that we do. To us this means ‘Nothing about you, without you’.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit enthusiastic and motivated &lt;strong&gt;Mental Health Nurses/Learning Disability Nurses&lt;/strong&gt;, who have an interest in providing care to our patient group. Our promise to you as a new recruit is that we will provide you with the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Preceptorship (if applicable)&lt;/li&gt;\n&lt;li&gt;A thorough induction to the Trust and Unit&lt;/li&gt;\n&lt;li&gt;Security Training&lt;/li&gt;\n&lt;li&gt;Experience of working with a specialist patient group at Kent’s only NHS Medium Secure Unit&lt;/li&gt;\n&lt;li&gt;Opportunities to progress and develop via the NHS Leadership Academy and our links with local universities and their post-grad and masters courses&lt;/li&gt;\n&lt;li&gt;Opportunities to work in a range of clinical environments, i.e. ECA, Acute, Rehabilitation and Pre-Discharge&lt;/li&gt;\n&lt;li&gt;Experience in both male and female wards&lt;/li&gt;\n&lt;li&gt;Opportunities for progression within our Community and Court Diversion Team&lt;/li&gt;\n&lt;li&gt;Specialist Risk Management Training&lt;/li&gt;\n&lt;li&gt;Opportunities to co-facilitate psychology treatment groups&lt;/li&gt;\n&lt;li&gt;Collaborative Risk Assessment Training&lt;/li&gt;\n&lt;li&gt;Personality Disorder Training&lt;/li&gt;\n&lt;li&gt;Team Away Days&lt;/li&gt;\n&lt;li&gt;Trauma Informed Practice Training&lt;/li&gt;\n&lt;li&gt;Mentorship Training&lt;/li&gt;\n&lt;li&gt;Restorative Justice Training&lt;/li&gt;\n&lt;li&gt;People Management and General Management Skills Training&lt;/li&gt;\n&lt;li&gt;Research Opportunities&lt;/li&gt;\n&lt;li&gt;Standard Mandatory Training&lt;/li&gt;\n&lt;li&gt;Access to our unit facilities, e.g. café and free parking&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Do you feel you could meet our patient’s expectations? Do you want to develop your skills, with the backing of a well-developed team and make a difference to the recovery of our patients? If the answer is yes, we want you to join our team.&lt;/p&gt;\n&lt;p&gt;The role is a key member of the multidisciplinary care team and will have continuing responsibility to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Carry out comprehensive nursing assessments and to be responsible for producing individualised nursing care plans for named patients.&lt;/li&gt;\n&lt;li&gt;Co-ordinate and implement the nursing care plan for individual patients and to inform the multi-disciplinary team of progress in the treatment process.&lt;/li&gt;\n&lt;li&gt;Provide leadership to the healthcare worker using supervision and IPR and to work under the guidance and management of the Clinical Manager.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Ideal candidate for the role will be a Registered Mental Health Nurse (RMN) or Learning Disability Nurse (RNLD) with Strong interpersonal skills and good communication both verbal and written. You will be committed to working with people with severe mental health problems in a secure environment.&lt;/p&gt;\n&lt;p&gt;Your knowledge of forensic services and full driving licence are desirable.&lt;/p&gt;\n&lt;p&gt;We also welcome applications from nurses who are interested to return to Mental Health Nursing. You will commence the role on the band 3 pay scale while we provide you with full 6 months training programme. On successful completion your training you will be promoted to band 5 as a fully qualified nurse. Please state &lt;strong&gt;Return to Nursing&lt;/strong&gt; within your application under Professional qualifications. The new Hire Bonus will not apply to Return to Nursing applications.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Contact Tanya Kierznowski 01622 723150&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trevor Gibbens Unit, Maidstone", "postalCode": "ME16 9PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2722", "longitude": ".488325"}}, "title": "Staff Nurse Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253522", "validThrough": "2020-11-17T23:59:59+0000"}