{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-26T14:01:44+0000", "description": "&lt;p&gt;&lt;strong&gt;Head of Occupational Health &amp; Wellbeing &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We take the health and wellbeing of our employees very seriously, come and join this friendly and dynamic team who are working collaboratively to provide a range of high-quality occupational health services. You will be committed and responsible for the management of the OH and Wellbeing team in the service delivery for all the Trust’s employees and a number of external organisations, achieving a number of performance and financial targets.&lt;/p&gt;\n&lt;p&gt;The Head of Occupational Health &amp; Wellbeing plays a pivotal role within our team and will be based at the Kent and Canterbury hospital in the historic city of Canterbury set in the garden of England. It will involve cross site travel to our other sites at Margate and Ashford to operate clinical and leadership duties. This job role offers a great opportunity to influence strategy and service development, as well as providing clinical and operational leadership as part of our senior OH &amp; Wellbeing team.&lt;/p&gt;\n&lt;p&gt;The multi-disciplinary department is committed to achieving and sustaining high quality services, and has been SEQOHS accredited since 2013. The department consists of occupational health physicians and nurses with the manual handling team and wellbeing service, supported by a business, data and administration team.&lt;/p&gt;\n&lt;p&gt;The successful applicants will have up to date knowledge of best evidence-based practice in occupational health and wellbeing and legal requirements. You will also require effective leadership and organisational skills. If you want to make a real contribution to the health and well-being of staff and work in a supportive environment, then this opportunity could be right for you.&lt;/p&gt;\n&lt;p&gt;Applicants should have established skills in Occupational Health and Wellbeing and should possess relevant experience in the NHS with specialist qualification or equivalent experience.&lt;/p&gt;\n&lt;p&gt;Consideration will be given to applicants who wish to work full time and those wishing to job share.&lt;/p&gt;\n&lt;p&gt;For more information and/ or to arrange an informal visit please contact Andrea Ashman Executive Director of Human Resources and Organisational Development via email: andrea.ashman@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrea AshmanJob titleDirector of HR &amp;ODEmail addressandrea.ashman@nhs.netTelephone numberTel: 01227 868730 Ext: 722 8730 or Ext: 7231962Additional contact information&lt;/p&gt;\n&lt;p&gt;Executive Assistant: Susan Potter&lt;/p&gt;\n&lt;p&gt;(susan.potter16@nhs.net)&lt;/p&gt;\n&lt;p&gt;Tel: 01227 766877 Ext: 7231962&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent &amp; Canterbury Hospital, Canterbury, Kent", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Head of Occupational Health &amp; Wellbeing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242818", "validThrough": "2020-11-09T23:59:59+0000"}