{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51000", "minValue": "42000", "unitText": "YEAR", "value": "£42,000 - £51,000"}}, "datePosted": "2020-11-03T15:47:25+0000", "description": "&lt;p&gt;Are you caring, with a passion for providing high standards of ophthalmic care to patients? If so, then you’re probably a good fit for us at SpaMedica.&lt;/p&gt;\n&lt;p&gt;We are the UK’s largest provider of NHS cataract surgery, with 16 hospitals and we are opening 7 more in the next 12 months. SpaMedica is a great success story and we are looking for individuals that share our enthusiasm and desire to deliver a high-standard of care to each of our patients.&lt;/p&gt;\n&lt;p&gt;The role of our optometrists is so important:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Analysing diagnostics&lt;/li&gt;\n&lt;li&gt;Discussing the surgery process with patients and expected outcomes&lt;/li&gt;\n&lt;li&gt;Ensuring patients understand all the facts and risks&lt;/li&gt;\n&lt;li&gt;Taking time to answer all our patient questions&lt;/li&gt;\n&lt;li&gt;Providing reassurance around the patient journey&lt;/li&gt;\n&lt;li&gt;Letting the patients know the visual outcome of surgery – this is the part of the role our optometrists enjoy the most…&lt;/li&gt;\n&lt;li&gt;Listening to how surgery has improved our patients’ lives and find out all the wonderful things they are able to see (and do) again&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You can see why we only want the very best to fill this important patient-focused role in our clinics…&lt;/p&gt;\n&lt;p&gt;The services we provide, cataract surgery, YAG capsulotomy and AMD treatment programmes, make a huge difference – we have some of the best outcomes in the UK, with very low complication rates. We’re improving, not only vision for our patients, but also their quality of life – take some time to read some of our 900+ 5-star patient reviews on NHS UK to find out more.&lt;/p&gt;\n&lt;p&gt;What we’re offering you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;Up to 5% annual personal performance related bonus&lt;/li&gt;\n&lt;li&gt;Annual company performance related bonus&lt;/li&gt;\n&lt;li&gt;Annual pay reviews and increases&lt;/li&gt;\n&lt;li&gt;37.5 hours working week over 5 days (1 in 4 Saturdays)&lt;/li&gt;\n&lt;li&gt;25 days holiday (33 days including bank holidays)&lt;/li&gt;\n&lt;li&gt;World-class hospitals and facilities&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;Continuous training and development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;A current GOC registration and proven post-registration experience of at least 12 months is essential for this role.&lt;/p&gt;\n&lt;p&gt;This role is based in Gloucester (GL2), but some travel will also be required to train and to cover in the surrounding hospitals at times of unexpected need.&lt;/p&gt;\n&lt;p&gt;Please call us for an informal chat if you’d like to find out more about working at SpaMedica. Or if you’re interested in this role, please apply now.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spa Medica", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134317"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL2"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8234", "longitude": "-2.29457"}}, "title": "Optometrist - Gloucester", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254654", "validThrough": "2020-11-30T23:59:59+0000"}