{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T12:01:30+0100", "description": "&lt;p&gt;Our 6 bed Psychiatric Intensive Care Unit [PICU] at Harplands Hospital, Stoke-on-Trent has been designed to the highest level of specification. This modern purpose built unit includes activity rooms, therapy rooms, individual en-suite facilities and a therapy garden.&lt;/p&gt;\n&lt;p&gt;Our Trust is on an incredible journey of innovation and we’d like you to be part of it. We are looking to appoint to Staff Nurse Band 5 Nurses and if you are an enthusiastic, caring and compassionate qualified nurse, who is looking for the opportunity of working within a challenging and complex environment then we want to hear from you. This will provide an opportunity to work within a Trust that is ambitious to perform well and has been told by the Care Quality Commission that it is the fastest improving Mental Health Trust in the Country.&lt;/p&gt;\n&lt;p&gt;Our vision is ‘To be Outstanding in all we do and how we do it.’ Our teams pride themselves on compassion, team work and resilience. The Trust supports you by offering a flexible shift system including twilight shifts and compressed hours to support working families and our staff parking is free on all our main sites.&lt;/p&gt;\n&lt;p&gt;The Unit opened in October 2019 to 6 beds, our PICU has state of the art facilities that offer the highest level of care. We work alongside a Trauma Informed Model of Care and treat patients individually. All our team members are trained to deliver comprehensive mental state assessment and psychological evidence based interventions as well as de-escalation techniques. Individual personal development will be offered with regular values based supervision.&lt;/p&gt;\n&lt;p&gt;You can expect Continuing Professional Development (CPD) which is tailored to meet your professional development; individual CPD advice is available from our Practice Education Team. The CPD offer includes the option to rotate within the Trust to widen your breadth of experience, skills and knowledge.&lt;/p&gt;\n&lt;p&gt;On joining the Trust you will have access to our Preceptorship Programme to enable a smooth transition into your new role.&lt;/p&gt;\n&lt;p&gt;We are keen to show you the Unit and provide an opportunity to meet some team members, if you would like to arrange an informal visit prior to making an application please call Sandra Wright – details below. Otherwise please submit your application and we guarantee an interview for all Qualified Nurses with relevant mental health experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sandra.wright@combined.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120881.jpg", "name": "North Staffordshire Combined Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120881"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke-on-Trent", "postalCode": "ST4 6TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0007", "longitude": "-2.20991"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240435", "validThrough": "2020-11-08T23:59:59+0000"}