{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa plus HCAS"}}, "datePosted": "2020-10-30T10:30:53+0000", "description": "&lt;p&gt;Job Title: CAMH Practitioner&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;(Clinical/Counselling Psychologist, Child Psychotherapist, Systemic &amp; Family Therapist, Occupational Therapist or Clinical Nurse Specialist or Social Worker with additional therapeutic qualifications or BABCP accredited CBT therapist with relevant experience)&lt;/p&gt;\n&lt;p&gt;Department: WLT Child &amp; Adolescent Mental Health Tier 2 CAMH Service Ealing&lt;/p&gt;\n&lt;p&gt;Base: SAFE West, Greenford Service Centre, Oldfield Lane South, Greenford UB6 9LB&lt;br /&gt;And &lt;br /&gt;SAFE East, Everyone Active Acton Centre, Acton High Street, Acton W3 6NE&lt;/p&gt;\n&lt;p&gt;Band: 7&lt;/p&gt;\n&lt;p&gt;Post: 5 days 1.0 WTE Permanent (2 posts available)&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for 2 skilled and experienced Band 7 CAMH Practitioners to join the Ealing Tier 2 CAMHS Team which works in partnership with the Supportive Action for Families in Ealing (SAFE) Service.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Tier 2 CAMHS Team offers early intervention for children, young people and their families to help them deal with emotional and mental health problems with an aim to prevent difficulties from escalating to a point where specialist services and/or statutory agencies becomes necessary.&lt;/p&gt;\n&lt;p&gt;The team works in partnership and is co-located with the SAFE East and SAFE West Teams and there are vacant post is in both teams. The Tier 2 CAMHS Team is led by a Clinical team Manager and consists of Clinical Psychologists, Systemic Family Psychotherapists, CAMH Practitioners, Clinical Nurse Specialists, Child Wellbeing Practitioners, Assistant Psychologists and is supported by an Administrator.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holders will be expected to carry a clinical caseload. They will work autonomously to provide specialist mental health assessments and interventions to children and young people presenting with emotional and mental health concerns. The post holder will also provide support to families and consultation and advice to professionals.&lt;/p&gt;\n&lt;p&gt;Additionally the post holders will offer training to relevant staff involved in delivery of care to children and young people.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holders will also be part of the 3-borough CAMHS Team for their relevant discipline and they will be offered high quality and consistent supervision from the Clinical team Manager and the relevant Senior Professional. In addition, good opportunities for continuing professional development will be offered, alongside other supports.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for CAMH Practitioners who are able to demonstrate a commitment to creative engagement with a culturally diverse population of young people, show initiative, are team players and are able to communicate ideas clearly to both professionals and young people alike. They will also need to be flexible and have the necessary skills and experience to provide high quality care that is both evidence based and client focussed.&lt;/p&gt;\n&lt;p&gt;The above post is offered on a permanent full time basis. &lt;br /&gt;To arrange a visit or for informal discussions, please contact: Fuad Buraimoh, Clinical Team Manager on 07714397531 or fuad.buraimoh@westlondon.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFuad BuraimohJob titleClinical Team ManagerEmail addressfuad.buraimoh@westlondon.nhs.ukTelephone number07714397531Additional contact information&lt;/p&gt;\n&lt;p&gt;Flu vaccination – what we expect from our staff&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;At West London we look after patients who are vulnerable. Each year, seasonal flu affects thousands of people in the UK. Occurring mainly in winter, it is an infectious respiratory disease capable of producing symptoms ranging from those similar to the common cold, through to the very severe or even fatal disease.&lt;/p&gt;\n&lt;p&gt;The wellbeing of our staff and patients is of the utmost importance to us, and it is the expectation of the Trust that all patient-facing staff have an annual flu vaccination, provided free of charge by the Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tier 2 SAFE East &amp; West, Northolt", "postalCode": "UB5 5QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5371", "longitude": "-.388124"}}, "title": "CAMH Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249737", "validThrough": "2020-11-13T23:59:59+0000"}