{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-11-02T12:30:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Contract Manager (Independent Sector)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time - Fixed Term/Secondment for 6 Months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base: Endeavour House, Ipswich (Main Base), West Suffolk House, Bury St Edmunds and Apsen House, Colchester&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;An exciting fixed term contract management opportunity has arisen within the Suffolk and North East Essex Integrated Care System. &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;The post holder will support the recovery of our elective services by managing a portfolio of contracts with the independent sector (IS) through the NHS England framework and will be supported in all aspects of the role by senior management and will enjoy the opportunity to work within an experienced team. &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;&lt;em&gt;&lt;span&gt;The post holder will play a key role in managing relationships and contracts in the local health care market. The postholder will work in partnership with the Suffolk and North East Essex CCGs, East Suffolk and North Essex FT and West Suffolk FT in securing IS capacity in elective services where the need is greatest. &lt;/span&gt;&lt;/em&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;&lt;em&gt;&lt;span&gt;If you are interested in understanding more about this role, please contact:&lt;/span&gt;&lt;/em&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt; Jon Reynolds &lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span&gt;jon.reynolds@suffolk.nhs.uk&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span&gt; or 01473 770097.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Just over 1 hour by train from London, 1 hour by car to Stansted Airport, 45 minutes from your connection by overnight ferry to Holland; Suffolk inspires everyone, from George Orwell who adopted the name of one of our rivers, to the Suffolk coast and heaths, the inspiration for the composer Sir Benjamin Britten.&lt;br /&gt; &lt;br /&gt; From the east to the west, under impressive skies, the varied landscape of Suffolk changes subtly.&lt;br /&gt; &lt;br /&gt; Stretching north from Ipswich and Felixstowe, the Suffolk Coast, (with five sailing havens), and heaths has miles of Heritage Coast set in an Area of Outstanding Natural Beauty with beautiful beaches, stunning countryside and charming market towns for you to discover. The Ipswich waterfront is a beautiful ‘jewel in the crown’ and seamlessly blends moored yachts, the iconic university building, a working port, modern apartments and the alongside a lively mix of retail, bars and restaurants. Beyond this, Ipswich has three theatres, a thriving retail area and an abundance of independent boutiques and eateries in some of the most historic and architectural buildings in Suffolk.&lt;br /&gt; &lt;br /&gt; Inland are undulating fields, enfolding picturesque villages and slow-flowing streams. Some of the finest ancient woodlands can be found in this part of Suffolk, an area that abounds with ancient market towns, including Bury St Edmunds and Lavenham hardly changed since its heyday as an important Middle Ages wool town.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk and, Ipswich and East Suffolk Clinical Commisioning Groups", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich", "postalCode": "IP1 2BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0542", "longitude": "1.14344"}}, "title": "Senior Contract Manager (Independent Sector) Band 8c", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252039", "validThrough": "2020-11-15T23:59:59+0000"}