{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum inc"}}, "datePosted": "2020-11-04T14:01:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Peri-op, Crical Care and Pain Service Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic and motivated forward thinker to take up the position of &lt;strong&gt;Peri-op, Critical Care and Pain Service Manager &lt;/strong&gt;in our busy Surgery Division. The post-holder will support the Associate General Manager to drive and deliver efficiency and productivity in Peri-op and Pain, and clinical effectiveness in Critical care. Alongside the Service Delivery Managers, the post holder will be expected to lead on improvement projects in the areas under their remit&lt;/p&gt;\n&lt;p&gt;You will be expected to work together with the administrative and clinical teams to provide high quality care for patients within all specialties.&lt;/p&gt;\n&lt;p&gt;The ability to forge close working relationships with Hospital administration staff, Clinical staff and other colleagues is essential to the post. As is the ability to multitask, prioritise, and have excellent communication skills both written and oral. A working knowledge of excel and other Microsoft programmes is essential as is the experience of electronic patient record systems.&lt;/p&gt;\n&lt;p&gt;Barts Health is the largest trust in the NHS and one of the leading healthcare providers in the country. The trust’s six hospitals deliver high quality compassionate care to the 2.5 million people of east London and beyond.&lt;br /&gt;&lt;br /&gt;Barts Health NHS Trust: Barts Health’s vision is to become a healthcare organisation that offers urgent specialist and community services tailored to meet the needs of local communities. We are committed to recruiting staff that will help us meet our Vision for Changing Lives, and demonstrate behaviours we believe make Barts Health a great place for patients, their families and friends, the public and staff. Our Barts Health Values which align with our behaviours are:&lt;br /&gt;&lt;br /&gt;• Caring &amp; compassionate with patients, each other and our partners&lt;br /&gt;• Actively listening, understanding and responding to patients, staff and our partners&lt;br /&gt;• Relentlessly improving and innovating for patient safety&lt;br /&gt;• Achieving ambitious results by working together&lt;br /&gt;• Valuing every member of staff and their contribution to the care of our patients&lt;br /&gt;&lt;br /&gt;Barts Health NHS Trust has a safeguarding policy for both adults and children and is committed to all Safeguarding legislation and current standards. Every member of trust staff has a responsibility to safeguard and protect children and adults.&lt;/p&gt;\n&lt;p&gt;Please see the Job Description for further details.&lt;/p&gt;\n&lt;p&gt;For further information please contact &lt;strong&gt;Innocent Chimhini, Associate General Manager &lt;/strong&gt;on 07715633902 or innocent.chimhini@bartshealth.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whipps Cross Hospital, London", "postalCode": "E11 1NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5788", "longitude": ".002666"}}, "title": "Service Manager for Peri-Op, Critical Care and Pain", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256130", "validThrough": "2020-11-18T23:59:59+0000"}