{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-26T15:01:40+0000", "description": "&lt;p&gt;‘Thank you for helping me grow – I wouldn’t be the psychologist I am today...”&lt;/p&gt;\n&lt;p&gt;“[BCHFT&#125; takes multi-disciplinary working to a whole new level – psychology is so valued by all of the professionals here”&lt;/p&gt;\n&lt;p&gt;“It is clear that a lot of work has taken place to increase the profile of psychology across the organisation, and enable other professionals to understand the way in which thinking psychologically could support and enhance the organisation.”&lt;/p&gt;\n&lt;p&gt;‘My experiences enabled me to develop skills in consultation, which in turn helped me to support the development of psychological thinking in the team in which I was working.... in the development of psychological thinking across team meetings, trust wide discussions and broader forums where clinical decision making was involved.’&lt;/p&gt;\n&lt;p&gt;‘The psychology team provided a number of opportunities for broadening experiences, and the roles are varied in nature. For example, there are opportunities to provide supervision, training, reflective practice, team development and individual client work.’&lt;/p&gt;\n&lt;p&gt;From the quotes from previous staff above, all of whom have gone on to secure significant promotions and career development, it is clear that BCHFT Mental Health Division Psychology is known for its commitment to helping its psychologists be the best they can be. Whatever you see as your future in psychology, BCHFT Mental Health can help you get there. With staff with national reputations in organisational change, skills and service development, and therapy there is no shortage of support for developing your career. In your role as a psychologist here, there are opportunities in leadership, in developing others, in developing advanced therapeutic skills and in organisational development and change.&lt;/p&gt;\n&lt;p&gt;Our Urgent Care psychology service (inpatient, crisis home treatment, PICU and liaison services) has a reputation for its cutting-edge, innovative practice. Having been one of the first Trusts nationally to employ dedicated inpatient psychologists in the late-90s, and in the development of Crisis Home Treatment teams, we strive to maintain and continually improve our excellent service and reputation through our commitment to co-production, integrated multi-disciplinary team working, and our recovery-promoting drive. We are highly regarded by colleagues of all professions within our services and are the ‘go to’ people for complex problems and creative ideas to make a difference to our staff and service users.&lt;/p&gt;\n&lt;p&gt;We are proud of the fact that our staff have secured significant promotions into Consultant and Principal posts across the region. These have provided the opportunity to welcome new staff into our service, staff who are equally committed to making a positive difference to our services, our staff and our service users.&lt;/p&gt;\n&lt;p&gt;So if you are ready for a new challenge and are looking for the opportunity to grow as a psychologist, if you want to be at the cutting-edge of urgent care psychology practice, and if you are committed to co-production, recovery and multi-disciplinary working, there’s a place in BCHFT for you.&lt;/p&gt;\n&lt;p&gt;We have the following opportunities:&lt;/p&gt;\n&lt;p&gt;1.0 WTE Senior Applied Clinical/ Forensic / Counselling Psychologist&lt;/p&gt;\n&lt;p&gt;Working between Wolverhampton and Walsall Mental Health Liaison Services&lt;/p&gt;\n&lt;p&gt;1.0 WTE Senior Applied Clinical/ Forensic / Counselling Psychologist&lt;/p&gt;\n&lt;p&gt;Working between Sandwell and Dudley Mental Health Liaison Services&lt;/p&gt;\n&lt;p&gt;These posts represent an exciting opportunity to be involved in the development of a new role for psychology within the context of Mental Health Liaison teams.&lt;/p&gt;\n&lt;p&gt;The NHS 5 Year Forward View for Mental Health states that “By 2020/2021 no acute hospital should be without all age mental health liaison services in emergency departments and inpatient wards”&lt;/p&gt;\n&lt;p&gt;Liaison psychiatry is concerned with the care of people presenting with both mental and physical health symptoms regardless of presumed cause. Liaison mental health services are designed to operate away from traditional mental health settings, in the main in acute care general hospital emergency departments and wards, and medical and surgical outpatients. There is a growing evidence base for the clinical and cost effectiveness of Mental Health Liaison Services (MHLS). Working within the National CORE24 strategy, BCHFT has been commissioned to provide 4 newly configured, multi-disciplinary, MHLS teams across the Black Country Sustainability and Transformation Partnership (STP).&lt;/p&gt;\n&lt;p&gt;The Black Country STP is currently served by 4 acute hospital Trusts, each providing general hospital inpatient services and emergency departments. The 4 acute hospital Trusts are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The Dudley Group Foundation Trust,&lt;/li&gt;\n&lt;li&gt;Sandwell and West Birmingham Hospitals NHS Trust,&lt;/li&gt;\n&lt;li&gt;The Royal Wolverhampton Trust and&lt;/li&gt;\n&lt;li&gt;Walsall Healthcare NHS Trust.&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Between them these trusts have a total of over 2000 inpatient beds across their sites.&lt;/p&gt;\n&lt;p&gt;We are currently seeking 2.0 WTE Senior Applied Psychologists (Clinical / Counselling / Forensic) to work across our 4 new Mental Health liaison teams within these acute hospital trusts. Each psychologist will be split across two liaison services, working across two separate geographical sites. One post holder will work across the Wolverhampton / Walsall teams (based at New Cross Hospital and Walsall Manor Hospitals respectively) whilst the other post holder will work across the Sandwell and Dudley teams (based at Sandwell District General Hospital and Russell’s Hall Hospital respectively). Although urgent care psychology services have, for some time, supported the work of the liaison teams through offers of regular reflective practice, this will be an exciting new opportunity to expand, develop and consolidate psychology input into these teams.&lt;/p&gt;\n&lt;p&gt;Working with nursing and psychiatry colleagues the successful post holders will work towards ensuring successful outcome&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "General Hospitals in Acute Trusts - varied, Varied", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Applied Senior Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243037", "validThrough": "2020-11-08T23:59:59+0000"}