{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 pa"}}, "datePosted": "2020-10-08T09:00:11+0100", "description": "&lt;p&gt;Applications are invited for this exciting interim replacement post which offers the opportunity to become a key member of NHS Blood and Transplant (NHSBT) and Oxford University NHS Foundation Trust (OUH) teams working in a centre of excellence with the task of providing expert advice and leadership in the practice of stem cell donation and therapeutic apheresis. The post offers a wealth of opportunity to participate in clinical research and is based at OUH and the NHSBT centre in the John Radcliffe in Oxford.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;NHSBT is the sole provider of blood components and organs for transplantation to the NHS as well as supplying tissues, haematopoietic stem cells for transplantation, therapeutic apheresis and immunohaematological diagnostics. NHSBT has a research and development. programme in collaboration with leading academic centres, underpinned by infrastructure for component development, systematic reviews, and clinical trials. This post is designed to build on existing links between NHSBT and OUH. For NHSBT you will be involved in developing and provding medical leadership in stem cell donation and transplantation and developing existing Therapeutic Apheresis Services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Oxford University Hospitals NHS Foundation Trust (OUH) provides a tertiary regional service to a population of ~3million. It includes consultants broadly covering all major specialties in haematology with variable levels of site specialisation. It provides comprehensive treatment of all haematological malignancies (including allogeneic bone marrow transplantation) and non-malignant haematological conditions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The appointee will contribute to teaching and training of StRs in haematology and transfusion medicine. If appropriately experienced, the appointee will participate in the NHSBT on call rota for transfusion medicine in the South West of England 1:7, Category B (medium intensity).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further details may be obtained from: &lt;/strong&gt;Dr James Griffin, Clinical Director for Therapeutics NHSBT, telephone No: 07823351726or Rachel Pawson Medical Director for Stem Cell Donation and Transplantation, NHSBT, telephone No: 01865 387710, and Dr Andy PeniketClinical Director of Haematology and Bone Marrow Transplantation, telephone number: 01865 235259.&lt;/p&gt;\n&lt;p&gt;Applicants should have full and specialist registration (Haematology) (and a licence to practise) with the General Medical Council (GMC) (or eligible for registration within six months of interview) and have a Certificate of Completion of Training (CCT), or within six months of award of CCT or equivalent by date of interview&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3 9BQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7636", "longitude": "-1.2176"}}, "title": "Locum Consultant Haematologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217596", "validThrough": "2020-11-08T23:59:59+0000"}