{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 per annum"}}, "datePosted": "2020-10-29T10:46:07+0000", "description": "&lt;p&gt;We are looking to recruit to our Band 6 Acute In-Patient Rotation at NUH. We have&lt;br /&gt;an opportunity for 1.0WTE working full time. This is a wellestablished Rotation with most rotations at the Queens Medical Centre Campus site, but one rotation is at the City Hospital Campus site. We are looking for experienced and skilled physiotherapists with a passion for acute in-patient work.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will have the opportunity to move through the following rotations: Adult Intensive&lt;br /&gt;Care; Surgical High Dependency; Regional Major Trauma Unit; Trauma Wards,&lt;br /&gt;Health Care of the Older Person (both at the QMC and City Hospital Campus);&lt;br /&gt;Complex Dementia Care; Acute Medical Admissions Unit; Regional Neurosciences&lt;br /&gt;Unit (Neurosurgery and Neurology) and Specialist Spinal Unit.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful candidate will have a broad range of Band 5 experience including inpatient experience as a Band 5 in the core areas of Respiratory, Health Care of the&lt;br /&gt;Older Person, Neurology and Orthopaedics as a minimum requirement.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will have excellent communication and team-working skills, a flexible approach&lt;br /&gt;and the ability to manage your own time and workload. The post has a requirement&lt;br /&gt;that you manage and support Band 5’s, Support Staff and Students on Clinical&lt;br /&gt;Placements allowing you to develop your leadership, management and teaching&lt;br /&gt;skills. You may need to lead the team in the absence of the Band 7.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are a large Acute Teaching Hospital and this post will provide you with the&lt;br /&gt;opportunity to work in Specialist areas with a huge variety of patients and work&lt;br /&gt;alongside experienced Clinicians. NUH Therapy Services is a supportive Department&lt;br /&gt;with a robust appraisal process and many learning opportunities for our staff.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;There is a requirement to participate in weekend and on-call duties.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For more information about our organisation please visit our website and follow us&lt;br /&gt;on Twitter (NUH Therapies @NUHTherapies) and Facebook.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen GradyAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact Helen Grady via email: helen.grady@nuh.nhs.uk.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Medical Centre &amp; City Campus, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Band 6 Physiotherapy In-Patient Rotation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247957", "validThrough": "2020-11-12T23:59:59+0000"}