{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-03T10:17:05+0000", "description": "&lt;p&gt;Permanent post - Various hours available&lt;/p&gt;\n&lt;p&gt;We are seeking an exceptionally motivated individuals to join our friendly dynamic team. In return for your dedication and hard work, we offer well-established, structured mentoring and staff development packages to support you in your role.&lt;/p&gt;\n&lt;p&gt;This is a very busy District Nursing Single Point of Contact, receiving telephone calls from patients and health colleagues based at Swansea Civic Centre. To be successful in the role you will need the following attributes and experience:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You must be patient focused&lt;/li&gt;\n&lt;li&gt;You must have a positive attitude and work well within a team&lt;/li&gt;\n&lt;li&gt;You must be reliable and have excellent time keeping&lt;/li&gt;\n&lt;li&gt;You must enjoy speaking to people on the telephone&lt;/li&gt;\n&lt;li&gt;You must have a very clear and professional telephone manner&lt;/li&gt;\n&lt;li&gt;You must be IT literate, be able to use a keyboard and have extensive computer package experience&lt;/li&gt;\n&lt;li&gt;You must be hard working&lt;/li&gt;\n&lt;li&gt;On occasions, you must be able to handle irate callers, be able to calm them down and help to resolve their issues.&lt;/li&gt;\n&lt;li&gt;Your role would be to receive telephone calls and queries from patients, colleagues and stakeholders.&lt;/li&gt;\n&lt;li&gt;Experience required of working in a Contact Centre, switchboard, customer service environment or the NHS would be a distinct advantage. In return there will be in-house training and on-the-job training with career development opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful applicant will be a proactive team member who can demonstrate efficient organisational and prioritisation skills in order to contribute to the smooth effective operation of the team.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close the post before the stated closing date. Please apply early. We do not contact applicants with the outcome of shortlisting. If you do not hear from us within three weeks’ of the closing date you have probably not been shortlisted. We are sorry we are unable to let you know the outcome of your application.&lt;/p&gt;\n&lt;p&gt;Working hours will be on a rota basis between 08.30 to 17.00 Monday to Friday. Therefore you must be flexible to be able to cover these hours in the future if successful in the role.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Janet HawkinsHub Administrator&lt;/p&gt;\n&lt;p&gt;Janet.Hawkins@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Civic Centre, Swansea", "postalCode": "SA1 3SN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6137", "longitude": "-3.94837"}}, "title": "Clerical Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253415", "validThrough": "2020-11-09T23:59:59+0000"}