{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 Per annum pro rata"}}, "datePosted": "2020-10-30T10:17:16+0000", "description": "&lt;p&gt;Due to the expansion of the Medical Assessment Unit B3 ... We are in a position to increase our established Housekeeping team&lt;/p&gt;\n&lt;p&gt;Applicants must be able to demonstrate excellent communication and organisational skills.&lt;br /&gt;It is essential that you have experience of working in the health care environment and interacting with the general public.&lt;/p&gt;\n&lt;p&gt;You will be responsible for providing a clean and safe environment for families and staff. Your role will involve managing supplies, equipment and general stock. You may also be required to undertake general clerical and receptionist duties. You will be expected to organise your own workload whilst under supervision from the nursing team.&lt;/p&gt;\n&lt;p&gt;You will be expected to be flexible working both weekdays, some weekends and bank holidays to reflect the specific needs of the service, 12 hour days 7am - 730pm working opposite the current post holders.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire ConboyJob titleSisterEmail addressclaire.conboy@nuh.nhs.ukTelephone number0115 924 9924 x 87221Additional contact information&lt;/p&gt;\n&lt;p&gt;SECONDMENT OPPOTUNITY&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a full-time Housekeeper to work within our friendly team within the Medicine division on ward D55 at Queen’s Medical centre. We are looking for an enthusiastic, reliable, hardworking, housekeeper who will work as an integral part of the ward team ensuring a clean, safe and comfortable environment at all times.&lt;/p&gt;\n&lt;p&gt;Applicants must have excellent communication and organisational skills and be able to work under non-direct supervision, prioritising your own workload. It is necessary to have a flexible approach within this role and be able to respond appropriately to the demands of an ever changing workload.&lt;/p&gt;\n&lt;p&gt;You will need excellent interpersonal skills, as you will be liaising with and helping patients throughout the working day. You will also be required to communicate with all levels of staff both face to face and over the telephone.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to take ownership of the stock levels within the ward, to include ordering of stock. You will also be required to maintain a high level of cleanliness within the ward.&lt;/p&gt;\n&lt;p&gt;Recent experience in cleaning duties and use of chemicals and equipment is preferable along with an awareness of health and safety as you will be working in a demanding environment.&lt;/p&gt;\n&lt;p&gt;Applicants with previous experience in a health care setting are desirable, however, you will need to demonstrate commitment to developing yourself to support the nursing team in caring for patients and ensuring the patient experience is positive.&lt;/p&gt;\n&lt;p&gt;For more information, please contact matron Andrew Riley or Sarah Mack&lt;/p&gt;\n&lt;p&gt;Andrw.riley@nuh.nhs.uk or Sarah.mack@nuh.nhs.uk or call 01159 24 99 24 ext 87897.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Medical Centre, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Ward Housekeeper  ****Internal Applicants Only****", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249698", "validThrough": "2020-11-13T23:59:59+0000"}