{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35000", "minValue": "5000", "unitText": "YEAR", "value": "£35,000 per annum plus £5,000 Welcome Bonus"}}, "datePosted": "2020-10-14T09:06:51+0100", "description": "&lt;p&gt;Are you?&lt;/p&gt;\n&lt;p&gt;A driven and dynamic Nurse?&lt;br /&gt;An experienced RMN or RGN wanting to return to the profession after a career break?&lt;br /&gt;Wanting to make a difference to someone’s life?&lt;br /&gt;Ready for a new challenge?&lt;br /&gt;Wanting to work with the best nurses in the UK?&lt;/p&gt;\n&lt;p&gt;Located on the outskirts of the rural village of Broad Oak in East Sussex, Heathfield is a specialist neuro-rehabilitation service that provides person-centred post-acute, neuro-behavioural rehabilitation as well as offering long-term care and support to people with complex needs relating to neurodegenerative disorders.&lt;/p&gt;\n&lt;p&gt;Heathfield also supports those with the lasting effects of an acquired brain injury (ABI) and this is all facilitated across two separate units, catering for 24 male and female adults over the age of 18.&lt;/p&gt;\n&lt;p&gt;The Charge Nurse leads and supervises the clinical team, consisting of nurses and HCAs. The role requires an experienced RMN or RGN who has the skills to assist with evaluation through clinical governance and audit, support and lead on patient feedback mechanisms such as surveys, community meetings etc. The successful candidate will be an effective communicator between the medical and nursing staff and possessexcellent verbal and written communication skills.In essence the Charge Nurse provides leadership to staff to help achieve unit objectives and quality patient care.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broad Oak", "postalCode": "TN21 8UN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9819", "longitude": ".306612"}}, "title": "Charge Nurse with £5,000 Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225415", "validThrough": "2020-11-13T23:59:59+0000"}