{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum plus HCAS"}}, "datePosted": "2020-11-03T11:11:56+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for Band 5 Registered Mental Health Nurses to work within our trust. We are looking for motivated individuals to work full-time and part time within our inpatient and community services.&lt;/p&gt;\n&lt;p&gt;About the teams:&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to come and work in some of our different services at the Trust. We have various opportunities in different services such as;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute Care Pathway&lt;/li&gt;\n&lt;li&gt;CAMHS&lt;/li&gt;\n&lt;li&gt;Forensic, Specialist and National&lt;/li&gt;\n&lt;li&gt;Community&lt;/li&gt;\n&lt;li&gt;Cognition and Mental Health in Ageing&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We also have opportunities across different parts of South London including our sites at Springfield Hospital in Tooting, Queen Marys in Roehampton and Tolworth Hospital.&lt;/p&gt;\n&lt;p&gt;You will be joining a multi-disciplinary team that is committed to the provision of highly quality service user centred care. Our teams are looking for compassionate, extraordinary nurses that want to make an impact on the health and social care for local people with mental health problems in South West London and more specialist mental health services for people throughout the UK.&lt;/p&gt;\n&lt;p&gt;South West London and St George’s Mental Health NHS Trust (SWLSTG) is the leading provider of mental health services across south west London and a beacon of excellence for many of our national mental health services. We are part of the NHS and are regulated by Monitor and the Care Quality Commission. We were recently rate ‘Good’ by the CQC in 2018.&lt;/p&gt;\n&lt;p&gt;Our preceptorship programme has been given the ‘Preceptorship Quality Mark 2018-19’ by Capital Nurse.&lt;/p&gt;\n&lt;p&gt;There are a range of teams and services that you can be a part of providing high quality care to the patients we serve.&lt;/p&gt;\n&lt;p&gt;SWLSTG is proud to offer a unique opportunity for a highly motivated Staff Nurse who will be responsible for supporting the wider MDT provide high quality care in their team. You will be dynamic, motivated, and passionately committed to providing the highest possible quality of mental health care to the patients that we serve. The post is demanding but rewarding, and you will be provided with excellent multi-disciplinary team support, supervision and learning opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Mental Health Nurse - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253630", "validThrough": "2020-11-17T23:59:59+0000"}