{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Negotiable"}}, "datePosted": "2020-10-29T12:47:26+0000", "description": "&lt;p&gt;&lt;strong&gt;CASTLEHEAD MEDICAL CENTRE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NURSE PRACTIONER VACANCY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary Negotiable depending on experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;30 hours per week over 5 days&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a GP Training and Dispensing practice in the heart of the Lake District with a list size of 8400. We have 4 partners, 4 salaried GP’s and a full complement of Nurses, HCA’s managerial and administration staff. We support our local community hospital with inpatient beds and a minor injuries unit with diagnostics. We have links with the Mountain Rescue Service and BASICS. There are excellent schools within the community.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an experienced Registered Nurse Practitioner to work as an autonomous practitioner with proven clinical skills, to work independently and in conjunction with other health and care professionals. To assess, diagnose and treat the acute, non-acute and chronic medical conditions of patients attending within primary care, and initiating direct referrals as appropriate. You will require competences in managing patients with Asthma, COPD, Diabetes and CHD. You will be required to lead and provide clinical support and mentorship to the current nursing team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be able to work autonomously using professional decision making processes and also as a team player within the Clinical Team. The post holder will be responsible for effective management and mentoring of the nursing team. They will deliver patient centred care by triaging and assessing patients, initiate treatment, investigations, and give advice and guidance, and will liaise with other healthcare professionals.&lt;/p&gt;\n&lt;p&gt;The post holder will lead the nursing team in the development and promotion of health and wellbeing for patients as the GMC contract dictates. Evaluate individual treatment plans for chronic disease/ long term conditions for patients. Oversee the provision of chronic disease clinics, delivering patient care &amp; referring patients to secondary/specialist care as required and within own remit. Actively support the practice management team in the reviewing and delivery of clinical policy and procedure. Prescribe medication for patients in accordance NMC code of conduct and maintain registration. Request and action pathology results within own competence. Organise and lead on children and adult vaccination programmes. Involve external services/agencies to ensure the patient is supported appropriately.&lt;/p&gt;\n&lt;p&gt;If you are interested in joining our team and you would like further details please visit our practice website &lt;span&gt;castlehead.org.uk&lt;/span&gt; or email: &lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;carole.bell@gp-a82028.nhs.uk &lt;/span&gt;&lt;/span&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;or Catherine &lt;/span&gt;&lt;/span&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;catherine.penrice@gp-a82028.nhs.uk&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for applications: Wednesday 11th Nov 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "General Practices in W, N,E Cumbria ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133254"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Keswick, Cumbria", "postalCode": "CA12 4DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5977", "longitude": "-3.13458"}}, "title": "Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248394", "validThrough": "2020-11-11T23:59:59+0000"}