{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16778", "minValue": "16778", "unitText": "YEAR", "value": "£16,778"}}, "datePosted": "2020-11-02T11:02:41+0000", "description": "&lt;h2&gt;Job Introduction&lt;/h2&gt;\n&lt;p&gt;Everyone’s Turning Point is unique. It’s the moment when they realise they’ve made a small, but important, step forward. Very often, that small step is the start of something bigger. But only when the right support, advice and services are in place. Passionate about supporting people, you&#39;ll enjoy the opportunity and support to enhance your own life and career too, as you make this role your own as part of our friendly, multidisciplinary team.&lt;br /&gt;No matter how complex someone’s issues are, we can make a real difference to reduce their complex needs and support their recovery in their mental health.&lt;/p&gt;\n&lt;p&gt;This role will involve working over a 12 week rolling Rota with sleep in shifts, early /lateshifts, and every other weekend.&lt;/p&gt;\n&lt;h2&gt;Main Responsibilities&lt;/h2&gt;\n&lt;p&gt;You’ll provide support that helps individuals to decrease isolation, integrate into the community and make the most of every new opportunity. People’s lives will be truly changed by you. So, we’ll offer the chance to thrive on a wide range of challenges as you support their recovery. This will include identifying ways of building their independence, resilience and aspirations, as well as providing informal support to their families too.&lt;/p&gt;\n&lt;p&gt;The day to day duties of a Recovery Support Worker consist of:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Key working service users on a 1:1 basis&lt;/li&gt;\n&lt;li&gt;Development of person centred support plans and risk assessments&lt;/li&gt;\n&lt;li&gt;Support with management of medication&lt;/li&gt;\n&lt;li&gt;Liaison with community based teams including: Mental Health Team, Consultant Psychiatrist, GPs, charities, activity based services, DWP etc&lt;/li&gt;\n&lt;li&gt;Supporting service users with daily living skills: shopping, cooking, prompts with personal care, cleaning and generally maintaining their tenancy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;The Ideal Candidate&lt;/h2&gt;\n&lt;p&gt;We’re ideally looking for a RecoverySupport Worker with experience of working with people with long-term mental health issues and a good understanding of the issues they face and the recovery model. A team player with lots of energy, you’ll also need the strong communication skills, flexible approach and positive attitude needed to achieve targets in a challenging, changeable environment. With empathy, understanding and patience, we’ll not only expect you to like taking to people – but be passionate about helping them too.&lt;/p&gt;\n&lt;p&gt;A calm approach and ability to identify and manage risk will be essential.&lt;/p&gt;\n&lt;h2&gt;About us&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Why Turning Point?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What benefits will I receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive Learning and Development opportunities - we are Investors in People Silver accredited&lt;/li&gt;\n&lt;li&gt;28 days holiday, increasing with each year of service until 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including, bike to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive Pension and Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme and access to online Health and Wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work/life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts including Cinema, Groceries and Gym.&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oldham", "postalCode": "OL8 1PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.529", "longitude": "-2.11085"}}, "title": "Recovery Support Worker - Oldham Dispersed Accommodation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251706", "validThrough": "2020-11-16T23:59:59+0000"}