{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa plus £2,500 Welcome Payment"}}, "datePosted": "2020-10-30T15:42:17+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;We are a very successful Trust and are expanding our acute female inpatient services within Lincolnshire with a newly established 15 bedded unit. For this role we are offering all registered nurses an attractive employment package, including a welcome payment of £2,500 (paid in two instalments during year one) and £4,000 payment in lieu of relocation (to assist with commuting) or full relocation package** In addition there is a whole host of unique staff benefits and educational support as part of a nurse’s CPD. Have a look … &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Who are we?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Trust we employ over 2000 staff in a variety of roles and are proud that in the past 3 years we have been rated by our own staff as one of the best mental health trusts in England and in the top 10% nationally of all Trusts. We firmly believe that the key to high quality patient care is a contented workforce and this is reflected in the Care Quality Commission rating us as ‘outstanding’ for well led and ‘good’ overall. As a Trust we believe that having a diverse workforce and allowing people to be themselves is essential to good employment, we are openly supportive and encourage difference. In partnership with staff, volunteers, patients and carers we have developed our values, behaviours and culture over the past three years; and we live by them. Our leaders are compassionate, supportive and avoid blame. We look at solution focused outcomes, working on a theme of continuous improvement, which benefits the Trust, its employees and of course our patients and services users.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Our new service:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ash Villa is our new 15 bedded inpatient ward, created as part of LPFT’s ambitious plans to expand and develop our services and patient offering. The ward will provide high quality, patient centred and recovery focused care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a great opportunity to join a new multidisciplinary team delivering high quality patient care. Specialising in the management and treatment of mental health problems, our team will deliver personalised treatment programmes and provide the highest standards of care to our patients and carers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;The Role&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking a talented and experienced Mental Health or Learning Disability nurse who is keen to progress their career and feel that they have the potential management and leadership capability demanded by the role of Deputy Ward Manager.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant will assist with the clinical development of the ward through managing staff and monitoring clinical standards and practice. They will work closely with the Ward Manager to achieve ward targets and deliver high quality patient care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As Deputy Ward Manager, your role will be to co-ordinate the quality and management of nursing care, patient care and the clinical environment. Participate fully with the multidisciplinary team and undertake direct patient care. Manage and direct the delivery of clinical services within a ward or unit, ensuring it complies with statutory regulations, current legislation and meets quality standards&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Supporting the ward manager you will provide support, supervision and guidance to members of the Nursing Team and support the the operational management of the ward.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Your offer:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Registered Mental Health or Learning Disability Nurse looking to progress your career&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Passionate about delivering high quality patient care&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Compassionate and non-judgemental approach&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Skilled communicator with excellent&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Ability to work effectively with patients, carers, colleagues and other internal and external stakeholders&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Echo the Trust’s vision and values for the service in all aspects of practice&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Demonstrable experience of developing care packages which are holistic and recovery focused.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Our staff benefits &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please see attached our staff benefits booklet and poster which explains the amazing benefits we offer to our staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal visit or to discuss the role further, please do not hesitate to contact Ali Bartle – Ward Manager – Ash Villa, on &lt;/span&gt;&lt;span&gt;Alison.bartle@nhs.net&lt;/span&gt;&lt;span&gt; or 07583075635.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;** Eligibility criteria applies, for more information contact Ali Bartle or Katherine Brothwell &lt;/span&gt;&lt;span&gt;Katherine.brothwell@nhs.net&lt;/span&gt;&lt;span&gt; or 07773100887&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Willoughby Rd, Greylees, Sleaford", "postalCode": "NG34 8QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9826", "longitude": "-.455546"}}, "title": "Deputy Ward Manager - Ash Villa", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250791", "validThrough": "2020-11-13T23:59:59+0000"}