{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "gross per annum"}}, "datePosted": "2020-10-27T16:15:51+0000", "description": "&lt;p&gt;&lt;span&gt;Are you looking for an exciting post as an 8a Clinical Psychologist? Our multidisciplinary Learning Disability Camhs team based in the Child, Family and Young Persons (CFYP) care group in Suffolk, is seeking a talented Clinical Psychologist. The dedicated team work with young people with moderate- severe learning disabilities and challenging behaviour/mental health problems and comprises administrators, support workers, nurses, a behaviour therapist, psychologists and psychiatry. It works closely with special schools, the community nursing team, and above all, families. It values a systemic approach and is continually developing its ethos and approach to working together for the benefit of the young people and carers it serves. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are someone with a strong interest in this area, who can think creatively, is able to make good working relationships and enjoys collaborative and respectful working, we would love to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The CFYP care group has come together under a new and developing leadership team. In addition, there are transformation plans being developed across all of the Suffolk alliances, with pathways dedicated to specialist mental health services and to neurodevelopmental difficulties. It is a very exciting time to join the team and service. You will be supported by your team, manager and the psychology leadership structure, including the Principal Psychologist within your team. You will have regular supervision. We enjoy good links with the adult LD team and also have good relationships with University of East Anglia and the training course there, and have trainees from the course, which is very much valued. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Benefits included with this role are:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;a comprehensive in house &amp; external training programmes&lt;/li&gt;\n&lt;li&gt;career progression&lt;/li&gt;\n&lt;li&gt;starting annual leave of 27 days per annum increasing to 33 days pa based on length of service (plus paid bank holidays)&lt;/li&gt;\n&lt;li&gt;staff physio service&lt;/li&gt;\n&lt;li&gt;gym membership&lt;/li&gt;\n&lt;li&gt;NHS discounts and many more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interview dates are yet to be set; you will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Tabani Mabvura, Community team manager (&lt;/span&gt;tabani.mabvura@nsft.nhs.uk&lt;span&gt;) or Dr Claire Tyler, Consultant Clinical Psychologist (&lt;/span&gt;Claire.tyler@nsft.nhs.uk&lt;span&gt;)&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mariner House, Ipswich", "postalCode": "IP1 2GA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0633", "longitude": "1.13781"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245378", "validThrough": "2020-11-08T23:59:59+0000"}