{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34353", "minValue": "28106", "unitText": "YEAR", "value": "£28,106 -£34,353 pro rata, per annum"}}, "datePosted": "2020-11-03T11:06:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Wanting a role where you can work from home, with the flexibility to fit working hours around your everyday life and circumstances? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Love working in Nursing or Midwifery but want to use your skills in a different way? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If the answer is yes, then we may have just the role for you…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently looking for Registered Nurses or Midwives who are passionate about women’s health, dedicated to giving exceptional client care and who are able to support women and men through their care journey with BPAS.&lt;/p&gt;\n&lt;p&gt;Based at home, with 1 day per month within BPAS Remote Services in Middlemach, Coventry, you will undertake telephone consultations with BPAS clients to discuss their treatment options and assess their medical needs. Every client is different, and you will need to adapt your style to meet their requirements.&lt;/p&gt;\n&lt;p&gt;This role will require you to build a strong rapport with every client you talk to. Your quick thinking and clinical experience will be essential in determining the next steps for the client.&lt;/p&gt;\n&lt;p&gt;Key Responsibilities;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Establish that the client is sure of her decision to request a termination, and ensure that the reason complies with the terms of the Abortion Act.&lt;/li&gt;\n&lt;li&gt;Discuss, inform and confirm the client’s future choice of contraception, and provide STI results over the phone.&lt;/li&gt;\n&lt;li&gt;Make arrangements for the admission of clients, notifying any specific requirements (medical or physical) where necessary and complete all the referral documentation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You’ll be a self-starter, looking for a role with flexible hours where you can work from home, with the ability to be adaptable and self-motivated to provide an excellent telephone consultation service to BPAS clients. You’ll need to have sound communication and listening skills, whilst also being able to problem solve confidently.&lt;/p&gt;\n&lt;p&gt;Working on your own initiative, you’ll deliver the clients journey of care with empathy and understanding, whilst using your knowledge and skills to provide them with a great understanding of the service that BPAS provides.&lt;/p&gt;\n&lt;p&gt;We are also looking for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Exceptional interpersonal and communication skills with the ability to build good working relationships across an organization&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Good listening skills, with attention to detail when completing all administrative work&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Commitment to a client-led service with a professional and positive attitude towards work and enjoys working as part of a team&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a valued member of our Clinical team you will benefit from both clinical and non-clinical training, supporting you to develop your skills and knowledge. With a variety of different hours and shift patterns available, there is something to suit everyone. You’ll also have access to the BPAS Pension Plan, generous annual leave entitlement, the opportunity to attend in-house conferences, and gain access to the BHSF benefits plan.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: £28,106 to £34,353 per annum &lt;em&gt;pro rata&lt;/em&gt; (please note that this is a BPAS Salary Band and the exact Agenda For Change Band values are not applicable. Please see ‘additional information’ for more details.) &lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shift Pattern&lt;/strong&gt;: We have a number of part-time shift patterns available which can be worked flexibly across the cluster from Monday to Saturday. Please select what days of the week you can work on your application form.&lt;/p&gt;\n&lt;p&gt;Further information can be found on the &quot;Additional Information&quot; tab on the right hand side of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Small Print: &lt;/strong&gt;All applicants must be pro-choice. If you do not hear from us within 2 weeks of the closing date, unfortunately you will not have been shortlisted on this occasion. We do reserve the right to bring forward our closing date, without notice, in the event of high volumes of interest&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129515.jpg", "name": "British Pregnancy Advisory Service (bpas)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129515"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Homebased, Middlemarch, Coventry", "postalCode": "CV3 4FJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3725", "longitude": "-1.46605"}}, "title": "Nurse/Midwife Practitioner Homebased - Middlemarch", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253623", "validThrough": "2020-11-17T23:59:59+0000"}