{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pa"}}, "datePosted": "2020-11-04T10:46:25+0000", "description": "&lt;p&gt;The Cancer Business Unit is looking to appoint an enthusiastic, organised and flexible individual to work across all areas of our business unit. There are posts based at Queens Hospital Burton (QHB) and Royal Derby Hospital (RDH). These posts are full time, 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;You will be part of an Administration Team that covers the Secretarial Team; providing an efficient and professional Medical Secretarial service, within a growing department of Consultants, Registrars Specialty Doctors and Clinical Nurse Specialists. Our aim is to provide high standards of care whilst always ensuring patients are our priority. Within our Outpatients Department; working together as a team to prepare clinical correspondence for an outpatient appointment, dealing with patient’s queries face to face or via telephone as well as the day to day outpatient administrative duties to ensure the flow of patient’s fun smoothly through the department and the patients’ needs are met&lt;/p&gt;\n&lt;p&gt;Responsibilities of this role cover a wide range of administrative duties. These could include typing clinical correspondence, clinic preparation, appointment scheduling, and waiting list management, maintaining accurate patient case notes, diary management and dealing with a wide range of telephone queries therefore a flexible approach to workload is required.&lt;/p&gt;\n&lt;p&gt;You must be a confident communicator with the ability to liaise with staff at all levels, including peers, nurses, consultants and management. You will also need to demonstrate good customer service skills as interaction with patients and relatives will be a daily occurrence and may require a sensitive approach.&lt;/p&gt;\n&lt;p&gt;Essential qualities include strong organisational and time management skills with the ability to multi-task and work under pressure. Flexibility is essential as the post holder will be required to cross cover in different areas of the department in order to meet the service needs.&lt;br /&gt;&lt;br /&gt;You should be able to demonstrate previous experience within an administrative role and also demonstrate the ability to work as part of a team and also with minimal supervision.&lt;br /&gt;&lt;br /&gt;Full training will be given to the right candidate on all hospital based systems along with a structured induction.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development opportunities, including both professional and leadership development, together with an opportunity to work across some or all of our 5 sites depending on specialty&lt;/li&gt;\n&lt;li&gt;Support through every step of the way from recruitment to when you join our team and beyond&lt;/li&gt;\n&lt;li&gt;Friendly, supportive and caring colleagues&lt;/li&gt;\n&lt;li&gt;A variety of other staff benefits including employee assistance programme, discounted gym membership, onsite fitness classes, car schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key facts about our Trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Every day our hospitals see more than 4,000 outpatients&lt;/li&gt;\n&lt;li&gt;We see more Trauma &amp; Orthopaedic outpatients than any other Trust – over 3,300 per week&lt;/li&gt;\n&lt;li&gt;An average 860 patients are seen in A&amp;E every day – the 6th largest in the country&lt;/li&gt;\n&lt;li&gt;Our hospitals admit more than 220 emergency patients every day&lt;/li&gt;\n&lt;li&gt;We carry out more planned surgical operations than any other Trust in England with almost 50,000 operations taking place in our 52 operating theatres&lt;/li&gt;\n&lt;li&gt;We are one of only 5 Trusts nationally with more than 50 operating theatres&lt;/li&gt;\n&lt;li&gt;We carry out more than 300 elective procedures each working day&lt;/li&gt;\n&lt;li&gt;We employ 12,000 staff across our 5 hospital sites&lt;/li&gt;\n&lt;li&gt;We have a Director of Allied Health Professionals who is committed to provide leadership, progression and direction to AHPs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing date of applications: 11 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 25 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises; this includes Covid-19 secure areas. If you have Covid-19 related symptoms or you have been instructed to self-isolate by track and trace and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;/p&gt;\n&lt;p&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Emily Pratt - Operational Coordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tel: 01332 788548&lt;/p&gt;\n&lt;p&gt;Email: emily.pratt1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross Site - Royal Derby Hospital / Queens Hospital Burton, Derby / Burton-on-Trent", "postalCode": "DE22 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9104", "longitude": "-1.51382"}}, "title": "Pathway Support (Waiting List/ Medical Secretary)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255446", "validThrough": "2020-11-11T23:59:59+0000"}