{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-26T03:31:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Social Worker – Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Wotton Lawn Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £31,365 to £37,890 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting opportunity to join the Mental Health Integrated Discharge Hub and become part of a team supporting patients from admission to discharge. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate will be competent in understanding social care processes and be driven by working with personalisation at the core of everything they do. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will work in a variety of settings including acute, PICU (psychiatric intensive care), forensic, and recovery settings. They will develop personalised narrative assessments and support plans with patients, and have the opportunity to develop Personal Health Budgets (PHBs) to effectively shape mental health hospital aftercare. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexible working is encouraged and at times necessary to meet patient needs and the post holder will be able to multi task, prioritise and problem solve in a calm, focussed manner.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Alongside regular supervision and peer meetings you will have the opportunity to attend a variety of training courses and practice enhancement to build on your portfolio of continual professional development.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 8th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 9th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL1 3WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.867", "longitude": "-2.22789"}}, "title": "Social Worker - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241654", "validThrough": "2020-11-08T23:59:59+0000"}