{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14725", "minValue": "14725", "unitText": "YEAR", "value": "£8.76 Per Hour Free DBS check, Flu vaccination and"}}, "datePosted": "2020-10-20T17:01:19+0100", "description": "&lt;p&gt;About the Service: St David&#39;s independent hospital stands by the banks of the River Dee and within walking distance of the small village of Carrog - A picturesque part of North Wales.&lt;/p&gt;\n&lt;p&gt;The service provides open rehabilitation and treatment for males (aged 18 years +) diagnosed with a learning disability and/ or additional complex needs including autism and mental health needs.&lt;/p&gt;\n&lt;p&gt;About MHC: We are committed to delivering the very best care within our health/social care services across England and North Wales. We provide a culture that empowers the people we work with - both individuals and colleagues - to fulfil their potential.&lt;/p&gt;\n&lt;p&gt;By working together, we develop pathways for individuals and colleagues that enable them to achieve positive outcomes. Likewise, we work together with families and carers too, so they are always fully involved in their loved one&#39;s care while they are with us.&lt;/p&gt;\n&lt;p&gt;Salary: £8.76 per hour&lt;/p&gt;\n&lt;p&gt;Requirements: A good knowledge of COSHH, infection control and knowledge of Health &amp; Safety&lt;/p&gt;\n&lt;p&gt;Hours of Work: Flexible hours to suit&lt;/p&gt;\n&lt;p&gt;Contract Type: Bank&lt;/p&gt;\n&lt;p&gt;Benefits of Working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meals Provided&lt;/li&gt;\n&lt;li&gt;On-site parking available&lt;/li&gt;\n&lt;li&gt;Work Place Pension with Legal &amp; General&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Company Funded Benefits: Free DBS check, Flu vaccination and Hepatitis B vaccination.&lt;/p&gt;\n&lt;p&gt;About the role: MHC are seeking a reliable and responsible individual to undertake housekeeping duties on a bank basis.&lt;/p&gt;\n&lt;p&gt;It will be the post holder&#39;s responsibility to maintain a high standard of cleanliness and to keep records of cleaning products and equipment. In addition, the post holder will take responsibility for the maintenance of the equipment.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be working alongside service users, therefore good interpersonal skills will be essential. You will need to be enthusiastic, ambitious and provide flexibility and adaptability.&lt;/p&gt;\n&lt;p&gt;Confidentiality must be maintained at all times.&lt;/p&gt;\n&lt;p&gt;Previous cleaning experience is necessary, being able to work on your own initiative, multitask and have a high degree of organisational skills will be beneficial.&lt;/p&gt;\n&lt;p&gt;Skills: Good knowledge of COSHH as well as environmental Health &amp; Safety. Good communication skills to enable them to interact with the type of clients that we have. Excellent organisation and planning.&lt;/p&gt;\n&lt;p&gt;Equal Opportunities: MHC are an equal opportunities employer and welcome applications from all who believe they fit the essential requirements for this role regardless of their race, sex, disability, religion/belief, sexual orientation or age.&lt;/p&gt;\n&lt;p&gt;How to Apply: Please complete the short application and upload your CV, alternatively for an informal discussion about this role you can contact MHC Workforce Team on 01824 572 020.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest).&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carrog, Corwen", "postalCode": "LL21 9BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9845", "longitude": "-3.30401"}}, "title": "BANK HOUSEKEEPER - ST DAVIDS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235381", "validThrough": "2020-11-19T23:59:59+0000"}