{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 to £35,207 per annum inc"}}, "datePosted": "2020-10-28T09:46:48+0000", "description": "&lt;p&gt;The Medical Division at Newham University Hospital are now recruiting band 5 nurses to join our exciting and evolving new team.&lt;/p&gt;\n&lt;p&gt;Newham Hospital is at the centre of urban health providing acute care tailored to the needs of the people of the London Borough of Newham. We serve one of the most diverse populations in the country. We are looking for enthusiastic, motivated and skilled nurses to join our team of dedicated staff.&lt;/p&gt;\n&lt;p&gt;We are a fast moving acute medical division aiming to provide outstanding care to patients with a variety of health conditions including acute and coronary care, respiratory medicine, gastroenterology and ambulatory care&lt;/p&gt;\n&lt;p&gt;Our staff provide the highest possible standards of care and support to patients ensuring that they and their families remain at the centre of all we do.&lt;/p&gt;\n&lt;p&gt;Your personal development is of upmost importance and we will ensure you have access to our education programmes and leadership opportunities. We will actively encourage your career and professional development by supporting courses that are relevant to your clinical specialty.&lt;/p&gt;\n&lt;p&gt;As a valued member of the team you will have the opportunity to develop both clinical and managerial skills within a supportive and inclusive multi-disciplinary team. Successful candidates will be supported by junior sisters, ward manager, practice development nurse and clinical nurse specialists.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For any enquiries or an informal visit please contact:&lt;/p&gt;\n&lt;p&gt;Richard Clough, Senior Nurse for Medicine; richard.clough@nhs.net&lt;/p&gt;\n&lt;p&gt;Jill Ayres, Matron for Medicine; jill.ayres1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newham University Hospital, London", "postalCode": "E13 8SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": ".035418"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245888", "validThrough": "2020-11-11T23:59:59+0000"}