{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "24,907.00 to 30,615.00"}}, "datePosted": "2020-10-27T09:21:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sittingbourne Memorial Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;    &lt;/p&gt;\n&lt;p&gt;Are you a proactive and thoughtful Registered Nurse based in the Sittingbourne area and passionate about the rehabilitation of the patents in your care? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every ten 10 of the people who use services would recommend them?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are newly qualified – why not let us support you with our forward-thinking Preceptorship scheme. This is a mixture of face to face, eLearning and workshop based learning to support your development in your chosen career pathway.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Band 5 Staff Nurse you’ll be working as part of the NHS system in Kent where we deliver services across Dartford, Gravesend and Swale&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We’ll offer you: &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AfC 20/21 salary and terms and conditions including an NHS pension&lt;/li&gt;\n&lt;li&gt;Flexible working to provide you with that true work / life balance&lt;/li&gt;\n&lt;li&gt;Access to our Strive for Better networks, a national support and professional network made up of NHS professionals like you, giving you the chance to constantly develop industry-leading care and quality&lt;/li&gt;\n&lt;li&gt;We’ll provide you with access to bespoke career pathways and opportunities to continue your professional development, working closely with universities and Health Education England to further your potential and support your progression via in house eLearning, workshops and courses. Access to our free Employee Assistance Programme, a service providing expert advice, 24/7/365 online and by telephone covering a wide range of support options such as; counsellors, post trauma incident support, legal, debt and practical life management helplines&lt;/li&gt;\n&lt;li&gt; Virgin Tribe - this grants you access to premier offers such as&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;discounted experience days, as well as savings on Virgin Products such as holidays, gyms and media!&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plus, the latest equipment to allow you to provide the clinical standards of the highest quality, as we continue to thrive in our environment to excel in the CQC domains.&lt;/li&gt;\n&lt;li&gt;In addition to the above, you could receive an additional one-off payment of up to £2,000 as a welcome to our service – a Golden Hello from us, to you!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At Sittingbourne Memorial Hospital you’ll join a team who are passionate about the rehabilitation of their patients and strive to ensure they gain their independent living back.  &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Staff Nurse you will: &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;work collaboratively alongside our friendly multi-disciplinary teams&lt;/li&gt;\n&lt;li&gt;You be responsible for contributing to the holistic assessment, planning delivery and evaluation of patient care&lt;/li&gt;\n&lt;li&gt;Have strong communication and organisation skills, along with a flexible approach, to ensure you deliver positive experiences to patients at every stage of their healthcare journey.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have a RGN qualification and license to practice, as well as having a passion for rehabilitation to those in your care.&lt;/p&gt;\n&lt;h2&gt;Feel the Difference&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are a Nurse with an Adult nursing degree under your belt we’d love to talk to you about having you join the team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or see a copy of the full job description, please contact Ann Friend on Ann.friend@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; We partner with the NHS to make a real difference to people in Kent and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent", "postalCode": "ME10 4HG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3305", "longitude": ".732571"}}, "title": "Ward Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243808", "validThrough": "2020-11-10T23:59:59+0000"}