{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-11-02T11:26:16+0000", "description": "&lt;p&gt;We’re looking for an Endoscopy Nurse to join our team,with a passion for working to exceptional standards, and a real flair for putting patients at ease. Your empathy sets you apart, and at Nuffield Health you’ll find it is valued like never before. Put simply, this is nursing as it should be. Whether you’re currently in the NHS or a private setting, we’re sure you will find our hospitals to be the best place to grow your career, free from the constraints that prevent you from achieving job satisfaction. This is an excellent opportunity to work with some of the best consultants, making full use of your outstanding technical expertise and ability to connect with patients. Recognising that excellent care includes giving patients the support and reassurance they need, you’ll provide an outstanding patient experience. What’s more, you’ll enjoy opportunities to work with state-of-the-art technology. Supervising, supporting and developing junior staff, you’ll lead by example - delivering high quality care and experiences for patients, which is always clinically effective, evidence based and appropriate.&lt;br /&gt;&lt;br /&gt;As a registered Nurse you’ll have the qualifications and experience relevant to your registration. You’ll also have post-registration experience, be an excellent communicator and team worker – flexible and motivated. As part of the wider hospital team you’ll interact with colleagues on the ward because you understand that continuity in patient care is key. Like us, you believe in putting people first. You understand the clinical and technical aspects of endoscopy work, but also have the warmth and credibility to put our patients and their families at ease when they’re most vulnerable.&lt;/p&gt;\n&lt;p&gt;Nuffield Health is Britain’s largest healthcare charity. We’re balancing our social values with strong business discipline to help the UK get healthy and stay that way. We’re all about great people, too – recruiting and nurturing talent in a supportive, development-led setting.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cardiff Bay", "postalCode": "CF11 0SN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4532", "longitude": "-3.18908"}}, "title": "Endoscopy Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251771", "validThrough": "2020-11-30T23:59:59+0000"}