{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-27T12:46:04+0000", "description": "&lt;p&gt;Would you like to be part of innovative new developments? CPFT has been in the forefront of changes in the way mental health care is delivered across Primary and Secondary Care Adult Community Mental Health. This is an exciting opportunity to be part of shaping the way forward and influencing how things develop now and in the future.&lt;/p&gt;\n&lt;p&gt;Our Primary care mental health service is receiving national interest as a new and innovative way of working in Primary care. Our clinicians are based in GP practices and Neighborhood teams ensuring that people with Mental Health needs are seen at the right time, in the right place, by the right people.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit band 6 Primary Care Mental Health Practitioners to join our new Primary Care Mental Health Service (PCMHS) covering the Peterborough area. Clinicians who are energetic ,enthusiastic and acquire/hold NMC or HCPC registration, With excellent listening, communication, IT and ability to complete robust clinical assessments independently.&lt;/p&gt;\n&lt;p&gt;Having the ability to work autonomously, build and maintain relationships across primary care, secondary care and 3rd sector organisations is paramount.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Band 6 Mental Health Practitioner (Primary Care) (Nurse, OT, SW)&lt;/li&gt;\n&lt;li&gt;Full time&lt;/li&gt;\n&lt;li&gt;Reasonable Flexible working&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We encourage those candidates from out of area and can offer relocation expenses for those wishing to apply, and we are also able to offer temporary accommodation to help those relocate,&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The permanent posts are eligible for a £1500 New Hire Bonus. An initial payment of £500 will be paid in the first 1 month and a final payment of £1000 will be paid 1 year after your start date. This will be pro-rata for part-time posts. Internal applicants are not eligible.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;PCMHS is an award-winning service, recently winning the positive practice award in the Primary and Community Adult MH Services category at the National Positive Practice Awards in Mental Health. We were also ‘highly commended’ in the Innovation in Community MH award category. This was made possible by the highly skilled, committed and motivated staff in every discipline throughout the PCMHS.&lt;/p&gt;\n&lt;p&gt;The Primary Care Mental Health Service is actively working alongside GPs and other surgery staff to support the assessment and effective management of mental health in primary care where this is achievable. Following an assessment, this might include signposting to alternative services, including our third sector partners, and the provision of information for service users regarding what support and service would be best suited for their needs. It might also highlight the need for more intensive support where a referral into secondary services might be appropriate.&lt;/p&gt;\n&lt;p&gt;The service is also looking to develop the interventions it delivers in primary care, which offers successful applicants the opportunity to contribute to these developments. The need to always develop and improve how we can serve our population is high on our agenda.&lt;/p&gt;\n&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) provides integrated community and mental health, learning disability and social care services of the highest standard due to our continued commitment to quality and service improvement. We aim to support people of all ages to achieve the very best they can for their health and well being.&lt;/p&gt;\n&lt;p&gt;To ensure that we achieve this goal we look to recruit candidates of a high calibre that share our passion for delivering excellent service user care, research and education.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a strong team work ethic,excellent assessment skills, sense of accountability, accompanied by an ability to work under considerable pressure at times, with a desire for innovation.&lt;/p&gt;\n&lt;p&gt;We will provide the necessary support to ensure your development within your role. We are keen to support and develop our staff through a clear career pathway and encourage promotional opportunities within the Trust.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference for our community by supporting people with mental health or learning disability needs then we want to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Simon Threlfall - 01733 748 777&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "CB21 5EF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1852", "longitude": ".188204"}}, "title": "Primary Care Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244575", "validThrough": "2020-11-10T23:59:59+0000"}