{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-02T20:15:22+0000", "description": "&lt;p&gt;Band 5 Staff Nurses Short Stay Unit (SSU) Ward 34 LRI&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;We are looking for dynamic enthusiastic nurses on Ward 34 Short Stay Unit (SSU) at the Leicester Royal Infirmary (LRI). We currently have vacancies for band 5 staff nurses. &lt;br /&gt;&lt;br /&gt;The SSU is a fast paced medical environment where a wealth of experience can be gained. The area receives short stay patients from the rapid assessment unit (RAU) and the acute frailty unit (AFU) at the Leicester Royal Infirmary with a length of stay of up to 48 hours. We also accept direct admissions from the Emergency Department.&lt;br /&gt;&lt;br /&gt;SSU are looking for nurses with excellent communication skills who are motivated to provide high standards of quality nursing care in a short stay environment. &lt;br /&gt;&lt;br /&gt;Our aim is to provide a caring compassionate environment for all our patients and families. &lt;br /&gt;&lt;br /&gt;The emphasis on the ward is to provide a quality short stay experience for patients. A keen interest in caring for the acutely unwell medical patient would be desirable. &lt;br /&gt;&lt;br /&gt;We actively encourage training and development for all staff with a variety of opportunities available for band 5 nurses. The area offers excellent opportunities for support and development. &lt;br /&gt;&lt;br /&gt;SSU will be part of the new and exciting emergency floor development at the LRI which will provide future nursing staff with a wealth of opportunity to develop a wide range of emergency assessment and acute nursing skills. &lt;br /&gt;&lt;br /&gt;The area offers internal rotation shift patterns.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Victoria Cartwright victoria.cartwright@uhl-tr.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Staff Nurse - Short Stay Unit (SSU)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253078", "validThrough": "2020-11-08T23:59:59+0000"}