{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25615", "minValue": "24210", "unitText": "YEAR", "value": "£24,210 - £25,615 per annum inclusive"}}, "datePosted": "2020-10-30T14:46:39+0000", "description": "&lt;p&gt;University College London Hospitals NHS Foundation Trust is going through an exciting period of change and development to support delivery of our vision and strategic objectives. The Trust are making major investments in the environment and infrastructure to ensure that we create the best possible premises in which to deliver the best possible care.&lt;/p&gt;\n&lt;p&gt;This exciting opportunity has arisen for a dynamic individual to join University College London Hospitals NHS Foundation Trust as a porter at our Westmoreland Street site.&lt;/p&gt;\n&lt;p&gt;This post offers an excellent opportunity to join our team to help deliver top quality patient care. The porter role is varied. It encompasses all types of patient moves, delivery and collection of post as well as providing a security function to the Westmoreland Street site. Please read the job description for a full list of responsibilities.&lt;/p&gt;\n&lt;p&gt;You will be expected to work closely with a wide range of staff from different disciplines including contractors, managers and clinical staff to deliver a high level service that supports a high standard of patient care.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details or an informal chat please contact:&lt;/p&gt;\n&lt;p&gt;Rod Mackay, Front of House Manager on 020 3456 3036&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH, London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Porter", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250639", "validThrough": "2020-11-06T23:59:59+0000"}