{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28998", "minValue": "26365", "unitText": "YEAR", "value": "£26,365.00- £28,998.40 Inner London included"}}, "datePosted": "2020-10-28T13:28:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Purchasing Support Officer - Denmark Hill&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;KFM Band 4&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Denmark Hill&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;KFM are looking for an effective and efficient individual with P2P (Purchase to Pay) support service experience.&lt;/p&gt;\n&lt;p&gt;The successful candidate should have experience of providing great customer service to end users, obtaining all requisitions, purchase orders and catalogues are processed correctly and usage trends are quickly spotted.Influence end users and help to standardise and rationalise products and services. Assist senior staff to implement change to deliver for clients and continuously improve the service and enhance expertise.&lt;/p&gt;\n&lt;p&gt;You will participate in strong culture of teamwork with other Purchasing support administrators and in assigned cross functional teams (Procurement, Supply Chain, Finance, Systems) and share best practice and collaborate with all.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Identify services that would increase the efficiency of those Depts. or Wards supported and take appropriate action.&lt;/li&gt;\n&lt;li&gt;Participate in development and team building events to enable efficiencies.&lt;/li&gt;\n&lt;li&gt;Train new staff and cross cover for other Purchasing support administrators (i.e. at PRUH) in other teams.&lt;/li&gt;\n&lt;li&gt;Work closely with the Catalogue Team to increase Catalogue compliance and reduce stock variety-improve Standardisation&lt;/li&gt;\n&lt;li&gt;Develop and enhance key supplier relationships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details please refer to the role profile which is attached to this advert.&lt;/p&gt;\n&lt;p&gt;Please be aware we have the right to close the advert prior to the closing date if sufficient applications are made so please apply early to avoid missing out on this opportunity.&lt;/p&gt;\n&lt;p&gt;Interviews will be held online in the first instance with possibility of face to face meetings before any offer is made, this is to comply with social distancing guidance according to government guidelines.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/133314.jpg", "name": "King's IFM", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133314"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill London with travel to PRUH others sites", "postalCode": "SE5 9NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.468", "longitude": "-.096514"}}, "title": "Purchasing Support Officer (Supply Chain)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246764", "validThrough": "2020-11-11T23:59:59+0000"}