{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-19T11:20:40+0100", "description": "&lt;p&gt;Staff Nurse &lt;br /&gt;Ward 12, Pilgrim Hospital&lt;br /&gt;Permanent Post, Full time &lt;br /&gt;Starting salary £24,907 + Eligible for £2500 Welcome Payment&lt;br /&gt;We are currently looking to recruit two staff nurses to join our friendly, wecloming and supportive team who care for adults experiecning acute mental ill health in Lincolnshire. The ward provides assessment and individualised care within the least restrictive environment and with minimal disruption to service users, their families and carers. We are a mixed sex, 20 bedded ward and you would be working as part of a full multi-discipliniary team.&lt;/p&gt;\n&lt;p&gt;We are looking for individuals who are dynamic, passionate and committed to achieving quality outcomes who will ensure, above all else, that the needs of every service user are paramount in all that we do. If you’re seeking an opportunity to join a forward thinking Trust, where you can be challenged but rewarded and provide the standard of care to really make a difference every day – then we would welcome your application.&lt;br /&gt;As a trust, in the past two years we have been voted by our own staff as one of the best mental health trusts in England and achieving the best Mental Health Trust Nationally in the 2018 staff survey. We firmly believe that high quality patient care is provided by a contented work force and this is reflected in the latest CQC report was outstanding for well led and good overall.&lt;/p&gt;\n&lt;p&gt;We can also offer:&lt;/p&gt;\n&lt;p&gt;Recruitment payment: £2,500 pa for all external registered nurse appointments at Band 5 to Band 7 working in inpatients wards. This will be paid in two instalments of £1,250 after 3 months and 9 months. All payments will be non-pensionable.** We also offer a £4,000 payment in lieu of relocation (to assist with commuting) or full relocation package where applicable** In addition there is a whole host of unique staff benefits and educational support as part of a nurse’s CPD. Including:&lt;/p&gt;\n&lt;p&gt;• Regular clinical supervision and annual appraisal &lt;br /&gt;• Early access to our staff wellbeing service and psychology therapies&lt;br /&gt;• Excellent working environment.&lt;br /&gt;• Free car parking&lt;br /&gt;• NHS Pension&lt;/p&gt;\n&lt;p&gt;The hours of duty are 37½ hours per week worked on a shift basis, to provide 24 hour cover, including weekends, nights and bank holidays.&lt;/p&gt;\n&lt;p&gt;For further information please contact the Ward Manager Sarah Robinson on 01205 445166 or sarah.robinson84@nhs.net &lt;br /&gt;Interview date to be confirmed.&lt;br /&gt;** Eligibility criteria and Conditions apply, for more information contact Recruiting Manager.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Department of Psychiatry, Pilgrim Hospital, Sibsey Road, Boston, Lincolnshire", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232022", "validThrough": "2020-11-16T23:59:59+0000"}