{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T12:31:47+0000", "description": "&lt;p&gt;This post offers an opportunity for a values-driven and recovery-focused clinical psychologist to join an established psychological services team in providing services to those in medium and low secure hospital care and to community secure care service users during an exciting period of further service expansion and redesign.&lt;/p&gt;\n&lt;p&gt;Planning is ongoing for the consolidation of secure adult mental health, learning disability and personality disorders services into a purpose built hospital centre of excellence while some aspects of our community services are part of a national pilot aiming to reduce length of hospital stay by providing an increased range of occupational and psychosocial services to aid community reintegration. Other community service developments include an expansion of the innovative offender personality disorder services in Northumberland, Tees Valley and Cumbria.&lt;/p&gt;\n&lt;p&gt;This post is based primarily in the medium secure (mental health) hospital and community/out-patient services in conducting collaborative assessment and formulation of risk and needs and delivering, designing and evaluating individual and group-based interventions. However, as with all of our psychology posts a degree of cross-service input is included. However, The services have a commitment to staff wellbeing and development and there are opportunities to contribute to training and research.&lt;/p&gt;\n&lt;p&gt;The secure care psychological services have research and academic links with both Newcastle and Northumbria Universities and provide teaching and training placements for clinical, forensic and counselling psychology trainees, including those from overseas. Psychology Services within the Trust are highly valued and there is active support for CPD activities for all grades of staff.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Gail McGregor  Job title: Consultant Psychologist&lt;/p&gt;\n&lt;p&gt;Email address: gail.mcgregor@cntw.nhs.uk   Telephone number: 0191 246 7269&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Nicholas Hospital, Gosforth", "postalCode": "NE3 3XT"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0063", "longitude": "-1.63477"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246616", "validThrough": "2020-11-11T23:59:59+0000"}