{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum / pro rata"}}, "datePosted": "2020-10-28T08:05:05+0000", "description": "&lt;p&gt;&lt;strong&gt;(RMN, OT or Social Worker) – OSCA (Nationally Accredited team) Buckinghamshire CAMHS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have an interest in working with young people?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you interested in becoming a DBT therapist?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are delighted at the prospect of recruiting a Senior Mental Health Practitioner to join our innovative, dynamic Outreach Service for Children and Adolescents (OSCA) in the Buckinghamshire Child and Adolescent Mental Health Service. OSCA is part of Buckinghamshire-wide mental health and wellbeing service which is designed to provide young people with expert help from one easy access point and is and run by Oxford Health NHS Foundation Trust, in association with the charity Barnardo’s.&lt;/p&gt;\n&lt;p&gt;OSCA provides specialist emergency mental health assessments and home treatment service to young people with moderate-severe mental health difficulties. They also provide an alternative to admission, providing a step-up to specialist pathways, increasing support to CYP and their families as needed and a step-down from inpatient care to reduce the length of stay. They also work proactively for young people that can be harder to reach and provide a wraparound service working with colleagues in partner agencies and play a key part of developing multiagency risk-management plans for high-risk vulnerable CYP.&lt;/p&gt;\n&lt;p&gt;The service provides a range of therapeutic approaches including Dialectic Behavioural Therapy (DBT) and Brief Solution Focussed Therapy. Clinical supervision and Clinical Professional Development (CPD) are high priorities for the service as are principles of CYP IAPT.&lt;/p&gt;\n&lt;p&gt;Child and Adolescent Mental Health expertise and experience is desirable, but NOT essential as we recognise that expertise and experience in adult mental health is transferable. In addition, we offer opportunities to enhance your existing skills and learn new ones including a foundation course in DBT enabling you to practice as a DBT therapist.&lt;/p&gt;\n&lt;p&gt;The post holder will work as an integral part of this dynamic team working clinically with young people with a range of needs and will be required to participate in a flexible working pattern, including evening, weekends and on call via a rota.&lt;/p&gt;\n&lt;p&gt;If you enjoy a challenge, are enthusiastic and want to make a real difference, we very much look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;The post requires an enthusiastic and self-motivated individual who is willing to make a real change. Do you have a ‘can do’ attitude and are quality focused? Are you enthusiastic, motivated and ready for a challenge, possess excellent communication and organisational skills?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Car Owner / access to alternative transport for business use is essential for this post&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMegan WaleJob titleOperational Lead / Team ManagerEmail addressmegan.wale@oxfordhealth.nhs.ukTelephone number01865 901325&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sue Nichols Centre, Aylesbury", "postalCode": "HP20 1EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8208", "longitude": "-.802517"}}, "title": "Senior Mental Health Practitioner - CAMHS Crisis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245698", "validThrough": "2020-11-11T23:59:59+0000"}