{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £51,668 Pro rata/PA"}}, "datePosted": "2020-11-03T12:16:24+0000", "description": "&lt;p&gt;It’s an exciting time to join our Child and Adolescent Mental Health Services in Cornwall. Where your clinical expertise, training and high level of specialist experience are recognised with a genuine commitment to your career development and continued learning.&lt;/p&gt;\n&lt;p&gt;We are looking for a band or 8a Clinical Psychologists, depending on experience, to join our growing psychology team within Cornwall CAMHS. The CAMHS teams offer a range of services according to the THRIVE model (AFC-Tavistock model) and specialist care pathways. The posts involve offering assessment and intervention for our specialist ‘getting help’ and ‘getting more help’ pathways as well as consultation and support into our newly developed Early Help Network consultation meetings. The post therefore offers a good balance between early help/preventative/consultation work and highly specialist interventions for young people with more acute and complex needs. Training and supervision in a range of interventions to deliver and support our NICE informed care pathways is supported and encouraged.&lt;/p&gt;\n&lt;p&gt;In collaboration with Exeter University we have trained a significant number of Clinical Associate Psychologists to support assessments and deliver CAMHS interventions in school settings. Working alongside these new psychologists, implementing our Psychological Therapies Strategy will be a large part of the role.&lt;/p&gt;\n&lt;p&gt;Here’s what we can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Being part of an innovative and supportive clinical leadership team dedicated to providing high-quality clinical care.&lt;/li&gt;\n&lt;li&gt;Responsibility for the safe and effective running of the psychology services and excellent working relationships with our commissioners, partners and the agencies we work with.&lt;/li&gt;\n&lt;li&gt;Opportunities for audit, research and leading service modernisation and improvements with the support of a dedicated quality lead.&lt;/li&gt;\n&lt;li&gt;Regular reflective practice, clinical supervision, training and professional development opportunities.&lt;/li&gt;\n&lt;li&gt;Flexible working hours to suit you and pay grade depending on your experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We would love to have an informal conversation with you about these posts and our services in beautiful Cornwall which is a fantastic place to live and work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post will be based in the Mid of the County, but there is flexibility in terms of Clinical base and sessions. Full and part time hours considered.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We will consider applicants from newly qualified psychologists for consideration of a developmental post or more experienced candidates for an 8a post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie HunterAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;For further details please contact Debbie Hunter, Lead Clinical Child Psychologist, 07775 823 437.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Debbie.Hunter5@nhs.net&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Jody Hearn. Mid CAMHS Manager. Jody.hearn@nhs.net&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mid Cornwall, St Austell", "postalCode": "PL26 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3271", "longitude": "-4.77309"}}, "title": "Clinical Psychologist - Band 7 or 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253925", "validThrough": "2020-11-17T23:59:59+0000"}