{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888- £36,738 per annum inclusive of HCAS"}}, "datePosted": "2020-10-13T14:15:55+0100", "description": "&lt;p&gt;The Royal Free London Hospital has one of the largest centres in Europe for the treatment of conditions of the liver, pancreas and biliary system. Every year approximately 300 major surgical operations are carried out including liver and pancreatic resections and complex biliary procedures. Tertiary patients are referred from national and international referring hospitals to receive treatment at The Royal Free Hospital.&lt;br /&gt;&lt;br /&gt;9 West is an acute 33 bedded hepatobilary (HPB) ward specialising in liver and pancreatic cancer surgery as well as general surgery.&lt;br /&gt;&lt;br /&gt;We are offering band 5 nurses the opportunity to expand their knowledge and skills in the field of surgical nursing. We are looking for nurses with an interest in hepatobillary surgery to join our experienced and friendly team. You will have excellent communication skills, work well as part of our team and be dedicated to provide a high quality patient experience in line with the Royal Free Values. In return, we will provide you with robust local induction, one to one clinical supervision, teaching and study with our dedicated and supportive Clinical Practice facilitator. You will have access to numerous study days including the Preceptorship programme and continuous training opportunities with the support of Practice Development team. Further education is supported by the Trust offering courses/modules with our two link universities, Middlesex and Kings College.&lt;br /&gt;&lt;br /&gt;We can offer assistance with accommodation, a wide range of benefits including on site leisure facilities, day nurseries and access to great transport system with easy access to airports and rail travel. We also offer Internal Transfer Scheme (after 9 months) and access to Career Clinics.&lt;/p&gt;\n&lt;p&gt;At the Royal Free London NHS Foundation Trust, we believe in providing world-class medical treatment alongside an excellent patient experience. The Royal Free London Hospital has a world-class reputation for research and teaching. If you have the passion to provide kind, safe and excellent care we can offer you a great place to nurse and develop your career. We are focused on improving quality: for our patients, their carers/families and for our staff.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sophia Mawadzi - Senior Sister - sophia.mawadzi@nhs.net - 07951669097&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free Hospital, London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Band 5 Staff Nurse - Liver and Pancreatic Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224647", "validThrough": "2020-11-08T23:59:59+0000"}