{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per annum"}}, "datePosted": "2020-11-02T12:01:43+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Team lead Cardiac Rehabilitation Specialist Nurse to join our small but successful and friendly Cardiac Prevention and Rehabilitation Unit.&lt;/p&gt;\n&lt;p&gt;Accredited by the BACPR, you will be responsible to lead and coordinate the service delivery for patients within Buckinghamshire healthcare NHS Trust with a wide variety of cardiac conditions such as Ischemic Heart Disease (IHD), Coronary Artery Disease (CHD), Heart Failure and Atrial Fibrillation.&lt;/p&gt;\n&lt;p&gt;Working within both National and Local guidelines you will be expected to continue to successfully develop the service to excellence in both the key performance indicators as outlined by the BACPR, as well as providing first class health promotion advice and education. You will also oversee the physical activity program coordinated by our clinical exercise specialists and help to deliver this via online classes, telephone contact or face to face assessment.&lt;/p&gt;\n&lt;p&gt;An experienced background of working within cardiology, cardiac rehabilitation and experience of leading a team, is essential. Achieved an honors degree and maintain a nurse prescribing qualification. Experience of completing competent nurse consultations, advising, prescribing and treating patients after Percutaneous Coronary Intervention (PCI) clinics and have some familiarity with the innovative Health Machine software and or information technology platforms..&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicola Bowers, Senior Cardiac Research Nurse&lt;/p&gt;\n&lt;p&gt;Email address : nicolabowers@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number : 07956645035&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wycombe Hospital, Buckinghamshire", "postalCode": "HP11 2TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6262", "longitude": "-.7534"}}, "title": "Cardiac Rehabilitaion Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251939", "validThrough": "2020-11-10T23:59:59+0000"}