{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T08:45:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Acute Medical Unit Specialist Clinical Pharmacist: Band 7 &lt;/strong&gt;£38,890-£44,503 per annum&lt;/p&gt;\n&lt;p&gt;New Post-Just approved! Come and be part of the new 7 day Clinical Pharmacy Service which is starting Winter 2020.&lt;/p&gt;\n&lt;p&gt;Excitingly, we have had business cases approved and have new posts available on our Acute Medical Unit at William Harvey Hospital in Ashford (WHH).&lt;/p&gt;\n&lt;p&gt;Not only will you be joining the Emergency Floor Team (10+ Pharmacy staff), you will be joining a team of 20+ Band 7 pharmacists developing their skills across the Trust. Our Band 7 staff spend &gt;90% of their time in patient facing / clinical roles. It is going to be an exciting 6 months at EKHUFT Pharmacy department, Electronic prescribing will be implemented and a new 7 day Acute Frailty Pharmacy service (in addition to AMU) will start.&lt;/p&gt;\n&lt;p&gt;The base for this role is the WHH which is our busiest / largest of our 3 acute sites at East Kent Hospitals University Foundation Trust. We also provide a clinical pharmacy service to The Kent and Canterbury Hospital and The Queen Elizabeth the Queen Mother Hospital, Margate. We are Trust in the South East of the Country, all close to the seaside and gorgeous countryside but fast links into London &amp; France.&lt;/p&gt;\n&lt;p&gt;Through our excellent links with regional education, local universities and in-house training programmes, staff will have the opportunity to develop their prescribing, educational supervision and management skills.&lt;/p&gt;\n&lt;p&gt;East Kent Hospital University Foundation Trust is one of the largest hospital trusts in England which delivers a full range of acute services as well as high quality specialist care in renal, cancer and vascular services. At the last NHS Benchmarking, we had the lowest pharmacy vacancy rate in the country. We are also open to flexible / part time working.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested and want to find out further information please contact our Lead Clinical Services Pharmacist, Rebecca Morgan on &lt;span&gt;rebecca.morgan15@nhs.net&lt;/span&gt; or 07973 946586 or the Advanced Pharmacist for Emergency Medicine (WHH) Eno Ente on &lt;span&gt;eno-abasi.ente@nhs.net&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Kent Hospitals University NHS Foundation Trust, Ashford", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "AMU Specialist Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245762", "validThrough": "2020-11-11T23:59:59+0000"}