{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-28T19:00:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Peripatetic Clinical Ward Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:Band7 £38,890 – £44,503 per annum (dependant on experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:Acute Wards &amp; PICU - Michael Carlisle Centre &amp; Longley Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:37.5 hours per week &lt;/strong&gt;&lt;strong&gt;over 7 days (however we welcome flexible working requests)&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Ref: 457-20-102-QN&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will take place on 4th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A career in nursing leadership is one of the most rewarding paths you can choose. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Yes, it’s a tough job… the thing that drives our nurses though is the knowledge that they are making a real difference to people’s lives. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Nurses are the beating heart of SHSC. Day in, day out, they are providing care to people across our services who are often in some of the darkest moments of their lives. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It takes a special person to work in these roles. You’ll be someone who treats others with kindness, compassion and empathy, someone who shows others respect and works as part of a team to provide the very best care to our patients, their carers and family.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an stimulating opportunity for an experienced nurse leader to utilise their skills and knowledge working across our adult acute wards and Psychiatric Intensive Care ward based across the Longley Centre, part of the Northern General Hospital site and Michael Carlisle Centre, at Nether Edge. We are looking for a versatile nurse leader who has the ability to work alongside and in to the family of our inpatient services. You will need to be adaptable, working to understand the intricacies of individual ward teams and at the same time drive consistency of practice across. The post holder will work alongside existing ward managers as well as covering for periods of planned leave and vacancies. The role will require out of hours working across 7 days a week, which will attract enhancement payments.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be able to demonstrate and role model high quality clinical standards and lead multidisciplinary teams to ensure that our patients receive high quality care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It’s an exciting time to be joining team SHSC as we begin our journey to transform our inpatient services. We are making improvements to our existing inpatient environments at the same time as redeveloping the Longley Centre to bring all of our community crisis and acute inpatient ward environments under one roof. It will be a purpose-built using the latest advances and best practice to ensure that patients receive the very best care, in the best possible environments. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;By joining team SHSC, your hard work and dedication will be recognised, valued and rewarded. We are committed to investing in the professional development of all our nurses. You will have access to Nursing Leadership training courses including Mary Seacole, Edward Jenner and the Florence Nightingale programmes. At SHSC we are committed to aiding your professional development and you’ll have the opportunity to further develop your skills and be supported to progress your career. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You’ll also have access to a range of benefits, including our fast-track Physiotherapy service, access to financial support from Neyber and their Financial Wellbeing Hub, salary sacrifice schemes for purchasing a new car and home electronics as well as the opportunity to purchase additional annual leave. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your health and wellbeing is extremely important to us. We have an in-house counselling service who are dedicated to supporting our staff with both work and non-work-related concerns. We all need to ensure we have a good work-life balance. If you are looking for flexible working options –we aim to accommodate all requests wherever possible. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re proud to care for our patients, and if that’s a passion you share, we’d love to hear from you! &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sheffield Health and Social Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120808"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S5 7JT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4107", "longitude": "-1.46044"}}, "title": "Peripatetic Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247544", "validThrough": "2020-11-15T23:59:59+0000"}