{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T13:02:16+0000", "description": "&lt;p&gt;Do you like change? Do you take pride in your work? If so the NHS Continuing Healthcare team in Norfolk and Waveney CCGs would like to hear from you. You will be joining a team on a new journey. The NHS Continuing Healthcare team has recently restructured in order to prepare for the merging of the 5 CCGs in Norfolk and Waveney in April 2020.&lt;/p&gt;\n&lt;p&gt;This has resulted in a number of vacancies for enthusiastic health professionals to come on board and join us as NHS Continuing Healthcare (CHC) Clinicians. Based in Dereham, Beccles and Norwich, Norfolk. This is a brilliant opportunity for individuals looking to develop their existing clinical assessment skills within friendly, supportive teams with opportunities to work in a more integrated way with our Local Authority colleagues&lt;/p&gt;\n&lt;p&gt;We are looking for professionals with a proactive nature and excellent organisational skills to join our hardworking team. You will conduct assessments for NHS Continuing Healthcare and NHS-funded Nursing Care, working to realistic deadlines and proactively case manage individuals who are eligible to receive NHS funding. Our aim is to deliver a consistently excellent client service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Skills, Experience and Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered health professional with current registration&lt;/li&gt;\n&lt;li&gt;Strong person centred attitude to service delivery; you are friendly, personable and confident when liaising with others.&lt;/li&gt;\n&lt;li&gt;Outstanding communication skills, an ambitious attitude and a precise attention to detail, you&#39;re happy to prioritise your own workload and complete tasks without supervision.&lt;/li&gt;\n&lt;li&gt;Previous experience within NHS Continuing Healthcare would be desirable but is not essential. However a willingness to learn new skills and put people first is essential.&lt;/li&gt;\n&lt;li&gt;Proficient in Microsoft Office and eligible to work in the UK.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;In possession of a full driving licence, own transport; you will be required to work across Norfolk and Waveney and further afield if necessary.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;If you believe that you are a good fit with our team ethos,please apply online or contact Jeanette Patterson, Integrated Continuing Healthcare Lead in the first instance for an informal discussion; email: jeanette.patterson@norfolk.gov.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Whilst membership of theHealth care professional – Nursing and Midwifery Council (NMC) or Allied Health Care Professional AHP&lt;span&gt;is desirable, we will consider applications from other suitably qualified applicants, who do not hold membership&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128192.JPG", "name": "The NHS Norfolk and Waveney Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lakeside 400, Old Chapel Way, Broadland Business Park, Thorpe St Andrew, Norwich, NR7 0WG", "postalCode": "NR7 0WG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6294", "longitude": "1.37179"}}, "title": "CHC Nurse Clinician x12", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259808", "validThrough": "2020-11-20T23:59:59+0000"}