{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-05T08:15:39+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for band 5 Mental Health Nurses who are currently or due to register with the NMC to work on our adult acute admission wards, older adult wards, dementia wards and psychiatric intensive care units (PICU) at The Harbour and we currently have several posts to offer.&lt;/p&gt;\n&lt;p&gt;The Harbour is situated on the Fylde Coast in western Lancashire, with the Ribble Valley to the South, the Bowland Hills to the East and not too distant from the Lake District. It also has the benefits of being situated in a quiet area, very close to motorway links, just off the M55.&lt;/p&gt;\n&lt;p&gt;The Harbour consists of a variety of wards, including Adult Acute, Psychiatric Intensive Care Units, Older Adult Wards and Dementia Wards. The teams work very closely to support each other and there is a clear focus on support and professional development of our nurses. This is supported through mentorship, supervision, training, teaching sessions and we also have a Practice Development Matron to support development and teach others. We also offer a very comprehensive preceptorship package for newly qualified nurses.&lt;/p&gt;\n&lt;p&gt;We have a wealth of disciplines based at the Harbour, including Psychologists, Occupational Health Nurses, Health and Wellbeing Workers, Physical Health Nurses, Pharmacists and Psychiatric consultants. This ensures a holistic way of working and enables us to deliver the highest standard of care to our patients.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated Staff nurses who can demonstrate excellent clinical and interpersonal qualities. The successful candidate must be willing to work in fast paced environment, have a positive outlook and ensure that delivering a high quality service, which genuinely engages with service users, carers and other stakeholders, is a key priority.&lt;/p&gt;\n&lt;p&gt;If you are successful in this post, you will be given the opportunity to choose from long days, short shifts or a combination of the two. If you are working long days, this will consist of 13 shifts in 28 days. If you are working short shifts, this will be 5 short shifts a week with a combination of Early and Late shifts. If you choose to combine the two, you will work two long shifts and two short shifts per week. There will also be an expectation to rotate onto night shifts at times.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job share and flexible working arrangements are available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The wards provide assessment and interventions for patients, operates seven days a week and is accessible 24hrs per day.&lt;/p&gt;\n&lt;p&gt;In addition, the successful post holder will be expected to rotate across the The Harbour and be able to work shifts covering 24 hours, seven days a week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You may also be eligible for a Relocation Package or Golden Hello incentives (subject to confirmation). Apply now for further details.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt; This post is subject to an enhanced DBS Clearance. As part of the pre-employment checks, successful candidates will be required to pay for their own DBS check at a cost of £46. Deductions will be taken from the first 3 months salary.&lt;/p&gt;\n&lt;p&gt;If you are not invited to interview within 3 weeks of the closing date, then please assume that on this occasion you have been unsuccessful, as it is not possible to contact all unsuccessful candidates. It is important that applicants log in to the website and check their Trac account on a regular basis to read and respond to any emails they may have received. If you do not have regular access to email/internet please advise the team of suitable contact details.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All posts are subject to the nationally agreed Agenda for Change terms and conditions.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Wolfe by emailing helen.wolfe@lancashirecare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Harbour, Blackpool", "postalCode": "FY4 4FE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8004", "longitude": "-2.98918"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256920", "validThrough": "2020-11-19T23:59:59+0000"}