{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "VSM"}}, "datePosted": "2020-10-13T12:29:00+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;At North Staffordshire Combined Healthcare NHS Trust, we are extremely proud to be one of only two specialist Mental Health Trusts in England which has an overall CQC Outstanding rating. We remain ambitious with further plans for both service and system collaborative transformation over the next five years to improve the health and wellbeing of our local people through high quality care delivered in a sustainable way. We are a Trust that prides itself on having achieved a financial surplus for the past 21 years making us one of the top financial performers in the region. We also recognise the importance of being part of system financial improvement and are leading on a number of aspects of our programme to become an Integrated Care System (ICS) during 2021. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As such, the Executive Director of Finance, Performance and Estates will be the lead for the Trust in the next stage of our financial evolution towards ICS status, working with peers and system leaders to maximise the benefits of collaborative working, shared decision making and effective financial planning. Ensuring system financial transformation principally through the implementation of the local version of the Long Term Plan in its post-Covid form, you will play a part in improving the financial position by creating an environment of collaboration and partnership. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role requires distinctive leadership skills and a unique strategic perspective that may differ significantly from traditional ways of leading health and care organisations.To be successful in the role you will need to beadaptive, comfortable within a dynamic environment and seek to influence. You will be inclusive, co-productive and consensus seeking. Your long-term view will be focused on sustaining the Trust financial balance but also playing a major part in contributing to the financial transformation of the whole system.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These traits will be underpinned by knowledge ofHealth and Social Care and the broader public sector, and specifically of complex public service systems. You will be accustomed to operating at Board level in a complex, medium to large-scale organisational context, either within the NHS or the broader Public Sector.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Above all you will understand the importance of leadership that is compassionate, inclusive and fosters effectiveness.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you believe that you have the strategic leadership, financial vision and passion to become our Executive Director of Finance, Performance and Estates, please visit &lt;/span&gt;&lt;span&gt;opportunityatcombinedhc.com&lt;/span&gt;&lt;span&gt; or get in touch as follows:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;James McLeod Tel: 07523 044455&lt;br /&gt; Email: james.mcleod@badenochandclark.com &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;David Hunter Tel: 07889 202229&lt;br /&gt; Email: david.hunter@badenochandclark.com&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120881.jpg", "name": "North Staffordshire Combined Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120881"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke on Trent", "postalCode": "ST4 8HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9684", "longitude": "-2.16779"}}, "title": "Director of Finance, Performance and Estates", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224260", "validThrough": "2020-11-08T23:59:59+0000"}