{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-28T13:46:18+0000", "description": "&lt;p&gt;On 1st April 2020, North Manchester General Hospital became part of Manchester University NHS Foundation Trust (MFT) under a new management agreement. The Northern Care Alliance NHS Group will continue to support North Manchester with its recruitment and workforce requirements until the service is formally transferred into MFT. All subsequent appointments to North Manchester will hold an employment contract with MFT. North Manchester General Hospital has a vibrant future ahead as it works with MFT to provide better care for patients and their families in the local community and across Greater Manchester.  Plans to create an innovative health campus which will see a new hospital build and the development of a ‘wellbeing hub’ that will bring health and economic benefits to the wider community.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Full and Part Time vacancies available&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Is your passion caring for sick children with a wide variety of surgical and medical conditions? If so, why not consider applying to join the team on the Children’s Unit at North Manchester General Hospital.&lt;/p&gt;\n&lt;p&gt;We are seeking Band 5 Nurses with a wide range of skills and experience to complement our existing nursing team working on our dynamic children’s ward. The successful applicants will join a multidisciplinary team of skilled and highly motivated staff who provide specialist paediatric inpatient care to children and young people in and around Manchester.&lt;/p&gt;\n&lt;p&gt;We are an evolving team, always looking to improve our service delivery and actively promoting the patients’ voice and their experience.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on our close working relationship with the Children’s Emergency Department, Children&#39;s Observation &amp; Assessment Unit and Children’s Community Nursing Teams within Pennine and the wider Manchester area. We have a strong ethos of inter-professional team working, and are keen to develop and progress staff to maintain enthusiasm and passion for their role. The Children&#39;s Unit is a secondary care setting, with 20 beds caring for both medical and surgical patients, as well as having a designated area to care for paediatric critical care patients. We are looking to recruit skilled Paediatric nurses who are competent in IV therapy and medicines management, as well as achieving Paediatric Immediate Life Support, and willing to work towards - if not already achieved - Advanced Paediatric Life Support (APLS).&lt;/p&gt;\n&lt;p&gt;We are committed to the professional development of our staff and provide a variety of educational and training opportunities. You will be supported by a team of Practice Educators who will guide your development. Your development will be tailored to meet your needs and the needs of the service. Our wealth of experience is supported by exciting and innovative education that is classroom and ward based.&lt;/p&gt;\n&lt;p&gt;We follow a blended workforce model and are interested in creatively enhancing our workforce to meet the needs of our children and young people. We are particular keen on hearing from you if you are interested in looking after children nursed in paediatric critical care, and/or focusing on children being cared for in partnership with a surgical speciality.&lt;/p&gt;\n&lt;p&gt;Come and meet us for an informal chat and let’s discuss your future!!&lt;/p&gt;\n&lt;p&gt;In line with the Trust&#39;s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, nationality, religion, marital status, social background or trade union membership.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Laura Greenwood&lt;/p&gt;\n&lt;p&gt;Ward Manager - Children&#39;s Unit&lt;/p&gt;\n&lt;p&gt;0161 604 8248&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Anne Harrop&lt;/p&gt;\n&lt;p&gt;ADNS - Women&#39;s and Children&#39;s&lt;/p&gt;\n&lt;p&gt;07976 582677 / 0161 918 4647&lt;/p&gt;\n&lt;p&gt;anne.harrop@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;All communications to applicants will be via the email address provided on your application form and all further correspondence will be through email, therefore please ensure that you regularly check your emails after the closing date for this post.&lt;/p&gt;\n&lt;p&gt;You are advised to check Spam and Junk folders as emails can sometimes go to these folders. Although references are not requested until a conditional offer is made, we would be grateful if you could provide us with email addresses for your referees when prompted by the application form.&lt;/p&gt;\n&lt;p&gt;Any messages sent via NHS Jobs may not be reviewed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you have any queries please contact the Manager for this vacancy as detailed in the advert.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, North Manchester Care Organisation, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Staff Nurse - Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246814", "validThrough": "2020-11-11T23:59:59+0000"}