{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-28T10:32:08+0000", "description": "&lt;p&gt;Are you looking for a nursing role that gives you exposure to a variety of patient cases and broadens your experiences as a nurse? Then this role could be the one for you!&lt;/p&gt;\n&lt;p&gt;Ward 21 is looking to recruit band 5 Staff Nurses both newly qualified and experienced to join an enthusiastic team committed to delivering the highest standard of care to our patients. This is a mixed gender Diabetic/Endocrinology Ward based on our Fairfield General Hospital site in Bury.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can you expect from us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Becoming a part of this team will allow you the chance to gain a variety of transferable skills linked to caring for a range of patients. Previous nurses who’ve worked here have gained exposure to areas such as Cardiology, Respiratory, Haematology, Rheumatology and Gastroenterology through the chance to go on secondment to other areas or link closely with supporting teams. This has allowed them to go on to roles such as Diabetic link nursing and other nursing specialities along with higher band progression.&lt;/p&gt;\n&lt;p&gt;We understand that the chance to grow and develop your nursing skills may well be important to you so development is fully supported by the management team. There is a strong preceptorship programme in place for newly qualified staff and if you’re a return to practice nurse you will be given the support and skills you need to aid your smooth transition back into nursing.&lt;/p&gt;\n&lt;p&gt;This 24 bedded ward is managed to support you to deliver a high standard of patient care but also gives you the chance to work towards developing your own skills in the best way for you. Having a new management team has meant there has been renewed focus on all aspects of running a safe ward and has made for an organised ward environment that allows all the staff to work well as a team.&lt;/p&gt;\n&lt;p&gt;Our Trust is committed to doing right by our Dementia patients and this is one of few wards across the Trust where there is a dedicated relaxation room to support vulnerable patients and their families. It’s a space that provides calm and reminiscence therapy to aid recovery and an area that the team are extremely proud of.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we expect from you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for dedicated, committed and reliable individuals who are keen to learn, willing to work together as a team but are self-motivated and can work independently when needed. This is a forward thinking team so you will need to be someone who can embrace change and get stuck in when needed.&lt;/p&gt;\n&lt;p&gt;You will be a professional who truly understands the need for care, consideration and respect for our patients but can also apply these qualities to your team members. Our patients and their families require someone with compassion and the ability to empathise with difficult situations and be willing to go the extra mile to do what’s right by them.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We welcome the chance for you to see how the ward team works and encourage you to visit us as part of your application. Please contact Danielle Hesketh on 0161 778 2521to make arrangements.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All positions offered and appointed are in full recognition and acceptance of these requirements.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Danielle Hesketh&lt;/p&gt;\n&lt;p&gt;0161 778 2521&lt;/p&gt;\n&lt;p&gt;danielle.hesketh@pat.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fairfield General Hospital, Bury &amp; Rochdale Care Organisation, Bury", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Staff Nurse - Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246099", "validThrough": "2020-11-11T23:59:59+0000"}