{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890-£44,503 pro rata"}}, "datePosted": "2020-11-02T12:11:42+0000", "description": "&lt;p&gt;We have an exciting new opportunity available for a Band 7 Senior Practice Nurse at the Station Medical Centre, RAF Shawbury, Shrewsbury.&lt;/p&gt;\n&lt;p&gt;The position is part time offering 30 hours per week.&lt;/p&gt;\n&lt;p&gt;As the post holder you will be the lead nurse within in the Medical Facility (MF) and will be expected to be the focal point for Primary Health Care nursing issues within area of practice.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have line management, training and clinical supervision responsibilities for junior nurses and other members of the multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;Main duties of the role include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing a safe, evidence-based, cost-effective and individualised patient care.&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Working autonomously using advanced levels of history taking and examination skills within multi-disciplinary team, guidelines and protocols. Utilising advanced clinical skills in assessment and/or formulating a diagnosis and/or treatment plan.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Demonstrating a high level of knowledge in relation to pattern of disease/disorder, markers of condition progression and ranges of treatment available at each stage of disease or condition.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Organising complex activities or programmes for patients, drawing on an appropriate range of multi-disciplinary and interprofessional resources within the MF and across the wider military services to promote integrated and seamless pathways of care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Taking the lead in developing and delivering specialist services, such as long-term disease management (i.e. diabetes, asthma, chronic obstructive pulmonary disease, hypertension) acting as a regional resource for advice and regional clinics.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Being involved proactively in developing strategies and undertaking activities that monitor and improve the quality of healthcare and the effectiveness of your own and others’ practice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Demonstrating inspirational, innovative and motivational leadership acting as a role model.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Contributing to and at times leading the development of multidisciplinary research and clinical audit.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Working closely with the Senior Medical Officer (SMO) and administrative managers in the setting up and leading practice systems for monitoring/measuring performance against Clinical Governance, risk management and Quality Indicator targets to monitor and improve quality of service delivery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please see attached Job Description &amp; Person Specification for further information on the duties and responsibilities of the role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential criteria:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;As the successful candidate you will require highly developed specialist knowledge, underpinned by theory and experience; and professional knowledge acquired through a degree supplemented by specialist training, experience, short course to master&#39;s level equivalent in relevant field.&lt;/li&gt;\n&lt;li&gt;Current registration with the Nursing and Midwifery Council&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable criteria includes:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Nurse - First Level&lt;/li&gt;\n&lt;li&gt;Registered Non-Medical Prescriber.&lt;/li&gt;\n&lt;li&gt;Learning and Assessing in Practice qualification or equivalent Practice Assessors training.&lt;/li&gt;\n&lt;li&gt;Safeguarding Level 2 trained and in-date.&lt;/li&gt;\n&lt;li&gt;Proficient in the use of relevant IT systems subject to appropriate training being provided.&lt;/li&gt;\n&lt;li&gt;Minimum of 3 years experence of working within Primary Healthcare.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following NHS Key Skills Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB1 – Promotion of Health &amp; Wellbeing&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB2 – Assessment &amp; Care Planning&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB3 – Protect of Health &amp; Wellbeing&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB6 – Assessment &amp; Treatment Planning&lt;/li&gt;\n&lt;li&gt;NHS Information &amp; Knowledge – NHS IK1 – Information Processing&lt;/li&gt;\n&lt;li&gt;NHS Information &amp; Knowledge – NHS IK2 – Information Collection &amp; Analysis&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it in PDF format using your surname then first name prior to submitting your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Station Medical Centre, RAF Shawbury, Shrewsbury, SY4 4DZ", "postalCode": "SY4 4DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7972", "longitude": "-2.66298"}}, "title": "Band 7 Senior Practice Nurse (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251989", "validThrough": "2020-11-25T23:59:59+0000"}