{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 to £30,112 pa"}}, "datePosted": "2020-10-30T14:16:36+0000", "description": "&lt;p&gt;We are looking for an ambitious, dynamic, motivated and enthusiastic Band 5 nurse to join our Community Nursing team in Bedfordshire. This substantive post is for the Mid Beds Community Nursing Team.&lt;/p&gt;\n&lt;p&gt;This highly respected team delivers responsive high quality nursing to patients in their own homes.&lt;/p&gt;\n&lt;p&gt;We are passionate about patient centred care, support our nurses to lead and deliver excellent and compassionate nursing and value our clinical teams as the real heart of the NHS.&lt;/p&gt;\n&lt;p&gt;Our Trust is known for offering excellent training, personal development programmes, supportive coaching and competency frameworks; all to support enhanced skills and career development which meet the goals and aspirations of the individual.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you want a career which brings a new challenge every day, gives you the opportunity to test your ability to think quickly, solve problems, assess and treat patients then Community Nursing could be the team for you.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Experience in the field of adult community  services is desirable but a willingness to learn and contribute is more important. The Community Nursing Service operates between 08.00 to 21.00 hours and successful candidates will work a variety of shifts, including weekends, evenings and bank holidays.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Access to a car in order to carry out service duties is essential.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Position: Community Staff Nurse&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Location: Either Ampthill, Shefford or Biggleswade Health Centre&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For further information, or if you would like to arrange a visit prior to interview, please contact:&lt;br /&gt;Sarah O&#39;Hare Team Lead 07773053918&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedfordshire", "postalCode": "MK45 2SB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0262", "longitude": "-.493342"}}, "title": "Community Practitioner Nurse Band 5 - Mid West Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250513", "validThrough": "2020-11-22T23:59:59+0000"}