{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48000", "minValue": "48000", "unitText": "YEAR", "value": "£48,000 per annum"}}, "datePosted": "2020-10-27T11:21:39+0000", "description": "&lt;p&gt;Our specially built hospital and first-class facilities are home to an integrated and multidisciplinary team. We provide care across four specialist wards, including psychiatric intensive care, Specialist Female Personality Disorder Service and low security wards for women and men. In line with our focus on recovery and reintegration, our hospital is ideally located for access to local community facilities and step down settings within the Cygnet family.&lt;/p&gt;\n&lt;p&gt;We are a quality driven service constantly striving to improve the quality of care we deliver to our service users we do this by having memberships with the following quality initiatives:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;NAPICU &lt;/strong&gt;is committed to developing and promoting the specialty of psychiatric intensive care and low secure services. They are dedicated to improving patient experience and outcome, and to promoting staff support and development. NAPICU promote research, education and practice development using quarterly meetings and annual conferences, their journal, training initiatives and the website and their social media.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;AIMS&lt;/strong&gt; (Accreditation of Inpatient Mental Health Services) peer focused Quality reviews. AIMS is a national project developed to ensure best practice is being achieved in in-patient mental health PICU services. Amongst other things the AIMS peer review team assess standards of care, current facilities, standards of documentation and health records, environmental facilities, and staff training qualifications, support and supervision.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are located within 40 minutes of Leeds, Halifax and Huddersfield which can all be accessed by local transport.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a caring and compassionate, highly motivated &lt;strong&gt;Clinical Quality Compliance Lead (RMN/RNLD)&lt;/strong&gt; to join our dynamic multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;We offer a 37.5 hours contract at &lt;strong&gt;Cygnet Hospital Bierley&lt;/strong&gt;. Normal hours of work would be &lt;strong&gt;Monday to Friday 09:00 -17:00&lt;/strong&gt;, although there will be occasions you may be asked to work outside these hours. In addition to competitive pay rate there are many benefits on offer including but not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS and employee discount scheme&lt;/li&gt;\n&lt;li&gt;50% NMC registration renewal paid by Cygnet&lt;/li&gt;\n&lt;li&gt;Free meals on duty&lt;/li&gt;\n&lt;li&gt;Ongoing support and supervision to aid professional development&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;Employee assistance programme&lt;/li&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;RCNi membership&lt;/li&gt;\n&lt;li&gt;Company paid Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Smart Health Toolkit- Providing you with Fitness Programmes, Nutrition consultation and Health checks&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Within the role you will be expected to:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure the hospital is complaint with all CQC KLOE’S. Via completion of audits. Ensuring effective action plans are in place and actions delivered to rectify non/partial compliance&lt;/li&gt;\n&lt;li&gt;To ensure, with the General Manager, that the OLAP is kept up to date.&lt;/li&gt;\n&lt;li&gt;To ensure good medicines management and compliance with CQC standards and best practice&lt;/li&gt;\n&lt;li&gt;Reporting of incidents and learning lessons from adverse incidents&lt;/li&gt;\n&lt;li&gt;Ensuring CQC notifications are to a high standard and sent in a timely manner, providing narrative/additional information as required by CQC.&lt;/li&gt;\n&lt;li&gt;Ensuring that timescales for commissioner submissions are adhered to and to the correct standard.&lt;/li&gt;\n&lt;li&gt;To escalate quality concerns to the Clinical Manager as required&lt;/li&gt;\n&lt;li&gt;Ensuring that all timescales for SI reporting are adhered to and that SI review meetings are held in a timely manner.&lt;/li&gt;\n&lt;li&gt;To ensure CQUINS (All monthly and quarterly submissions) are completed to the deadlines required.&lt;/li&gt;\n&lt;li&gt;To lead on the Audit and Governance Agenda, chair local meetings and represent the unit at Regional Governance Meetings to ensure all relevant data is reviewed.&lt;/li&gt;\n&lt;li&gt;To develop and deliver bespoke training packages to improve the quality of care provided.&lt;/li&gt;\n&lt;li&gt;Take part in the manager on call rota&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experienced RMN / RNLD with a current Pin Number&lt;/li&gt;\n&lt;li&gt;Knowledge of the Mental Health Act to enable provision of advice and close oversight of this department&lt;/li&gt;\n&lt;li&gt;Evidence of experience in a managerial role to enable clinical credibility and leadership to coach, develop and influence the clinical teams&lt;/li&gt;\n&lt;li&gt;Broad range of experience across a range of clinical specialisms/settings, including significant experience of in-patient care/treatment&lt;/li&gt;\n&lt;li&gt;Evidence of completion of audit with associated action planning to improve standards/quality of care&lt;/li&gt;\n&lt;li&gt;Experience of conducting investigations, identifying lessons learned and evidencing change in practice as a result&lt;/li&gt;\n&lt;li&gt;Excellent interpersonal skills, adapting style to ensure clarity of message and able to convey sensitive information&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to deputise for the Clinical Manager in their absence&lt;/li&gt;\n&lt;li&gt;An interest in leadership, research and assessment&lt;/li&gt;\n&lt;li&gt;Experience working with Female Personality Disorder patients&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?&lt;/strong&gt;&lt;br /&gt;If you care about making a difference – we want to talk to you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are interested, please click the link to apply.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cygnet Hospital Bierley, Bierley Lane, Bradford", "postalCode": "BD4 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7685", "longitude": "-1.73212"}}, "title": "Clinical Quality Compliance Lead (RMN/RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244202", "validThrough": "2020-11-17T23:59:59+0000"}