{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T13:01:12+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 6 RMN Deputy Ward Manager to work as part of our specialist dementia team at Cedar Parc Ward, Ysbyty&#39;r Tri Chwm Ebbw Vale. We are looking for an experienced RMN who is highly motivated, innovative and enthusiastic, who will demonstrate commitment to the ongoing development of our inpatient service. You will need the necessary clinical experience to lead and model excellent care delivery. You will be responsible for ensuring that high standards of care are delivered and maintained to patients admitted to our ward. The ward currently provides 15 in-patient dementia assessment beds treating individuals with cognitive impairment within Aneurin Bevan University Health Board (ABUHB). The successful post holder will in the absence of the Ward Manager oversee the management of the ward and therefore leadership qualities, skills and attributes would be essential for the successful candidate. As a Deputy Ward Manager you will be responsible for the assessment and implementation of high quality care to patients who are admitted to the inpatient environment. A key role is to provide support to patients and their families and loved ones during the admission and facilitate safe discharge.&lt;/p&gt;\n&lt;p&gt;Within this role you will provide expert clinical advice to junior members of staff and support the ward manager and senior nurse in running the ward in a professional, effective and safe manner. You will need to possess good sound knowledge and have experience in the care of older adults with complex needs and be able to demonstrate skills in clinical leadership. The ward ethos is to provide person centered care, drawing on the individual’s strengths, likes and interests, incorporating this into their care and treatment. You will be expected to contribute to the development and shaping of evidenced based care delivery in accordance with local policy and national. An interest in staff training would be required. We are looking for an individual who is passionate about patient care and who is driven to working in collaboration with the patient, families and other services to provide a truly individual, holistic and a person centered approach to nursing. We value personal qualities such as kindness, compassion, warmth and the willingness to go the extra mile for our services users above all else. We are keen to foster, support and importantly invest in our staff and there are excellent opportunities available for any successful candidate.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Amanda Whent, Senior Nurse&lt;br /&gt;amanda.whent@wales.nhs.uk&lt;br /&gt;01495 353212&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty&#39;r Tri Chwm, Ebbw Vale", "postalCode": "NP23 6GT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7893", "longitude": "-3.21752"}}, "title": "Deputy Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252130", "validThrough": "2020-11-16T23:59:59+0000"}