{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24.157 p.a. pro rata"}}, "datePosted": "2020-10-19T12:42:39+0100", "description": "&lt;p&gt;Are you a strong leader, with a passion for improving patient experience and outcomes? If so, this role could be for you.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic and motivated leader with excellent time management skills who can work both independently and as part of a team to lead Business Support in our Physical Health Service. Our Physical Health Service encompasses our Community Medical Paediatrics, Looked After Children, Child Protection, Community Childrens Nursing and Childrens Continence Services. The work in these teams is very wide and varied and you can be subject to some very sensitive and in some cases distressing information. Therefore, ensuring confidentiality at all times is of utmost importance together with being resilient and having a very calm and empathetic nature. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must be able to demonstrate a breadth of leadership experience, with a proven track record in mentoring and motivating a team and have exceptional communication skills which will be essential in liaising with all stakeholders. You will have excellent prioritisation skills, common sense and an understanding of the challenges facing a business during times of change.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are looking for a new challenge and would like to join us in improving health outcomes for children and young people and can demonstrate your suitability for this role, then we look forward to hearing from you. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role is 30 hours per week for a one year fixed period. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please read the attached job description and person specification for more details and should you wish to discuss the role further please contact Diana Harrison on 07795 451 647&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Business Support Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232301", "validThrough": "2020-11-08T23:59:59+0000"}