{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 to £74,661 per annum, pro rata"}}, "datePosted": "2020-10-23T10:59:43+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;strong&gt;10 PAs per week&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Specialty Doctor providing medical input alongside 2 WTE Consultants into the North Derbyshire Mental Health Liaison (MH Liaison) Team. This is a psychiatric liaison service into the Chesterfield Royal Hospital. You will be supported by regular Consultant supervision and appraisal.&lt;/p&gt;\n&lt;p&gt;The post will facilitate dedicated medical time to the MH Liaison Service. This will continue to support the Team in providing a high quality liaison service with the aim of avoiding unnecessary use of inpatient acute, older adult beds.&lt;/p&gt;\n&lt;p&gt;You will be an integral part of the team and will be providing the non-consultant medical input to the MH Liaison team providing assessments, a limited amount of follow up clinical work and participating in multidisciplinary meetings and multiagency meetings supporting discharge arrangements for patients.&lt;/p&gt;\n&lt;p&gt;Derbyshire is a wonderful place to live, situated within the Peak District National Park with stunning countryside, amazing history and, of course, fabulous people. It is an area of great natural beauty with rugged, peat-covered moorlands and magnificent limestone dales, with picturesque towns and villages, historic churches and some grand houses. It is the location of Britain’s first National Park - the Peak District National Park, which is the world’s second most visited National Park.&lt;/p&gt;\n&lt;p&gt;Whether you enjoy your shopping or leisurely sightseeing trips, Derbyshire’s lively towns offer a delightful array of attractions. Derby itself is a lively and cosmopolitan University City in the heart of Derbyshire offering the best of both worlds – multicultural city life on the doorstep of a stunning rural environment.&lt;/p&gt;\n&lt;p&gt;Why not grow your career in a Trust that cares and puts people first; we are able to offer an excellent well supported training package, supervision and an appraisal to support career progression opportunities. This will include exceptional peer support and allocation of a responsible officer for revalidation purposes. We can offer study leave support of £850 personal allowance per annum towards any continuous professional development.&lt;/p&gt;\n&lt;p&gt;We are committed to equal opportunities and improving the working lives of our staff and will consider applications to work flexibly.&lt;/p&gt;\n&lt;p&gt;We would welcome you to contact the Trust to find out more about this post, our services and discuss what is important to you. To find out more about our Trust and Derbyshire as a place to work and live please visit our recruitment site which you will find under further links.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Interested candidates are welcome to contact Dr Sugato Sarkar on 01246 216519.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liaison Team, Hartington Unit, Chesterfield", "postalCode": "S40 1JF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2372", "longitude": "-1.4333"}}, "title": "Specialty Doctor (SAS)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240166", "validThrough": "2020-11-15T23:59:59+0000"}