{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. pro rata"}}, "datePosted": "2020-11-05T09:15:39+0000", "description": "&lt;p&gt;Are you an experienced mental health nurse or suitably qualified allied health professional looking for a new challenge? Sherborne Adult Community Mental Health Team based at Ashley Elm House, Yeatman Hospital are looking for someone to join the team.&lt;/p&gt;\n&lt;p&gt;Dorset HealthCare is all about progress and innovation and ensuring we achieve the best possible patient care and health and wellbeing outcomes for all our communities.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a proven ability to complete assessments, formulations and specialist treatments whilst undertaking the role of care coordinator for adults of working age living within the local area experiencing significant mental health issues&lt;/p&gt;\n&lt;p&gt;Sherborne CMHT is a multi-disciplinary team who proactively work in partnership with a senior peer specialist from Dorset Mental Health Forum and other local organisations promoting recovery and social inclusion.&lt;/p&gt;\n&lt;p&gt;At Dorset Healthcare we believe all our people make a valuable contribution to our patients and service users and we actively support personal development and a culture of inclusion, respect and compassion in all that we do.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;This is a 30 hour per week roleplus 7.5 hrs until 31/03/21 - to be reviewed at that date&lt;/p&gt;\n&lt;p&gt;Interview Date: 25 November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Debbie Baker, Team Leader at debbie.baker1@nhs.net / 01935 816552.&lt;/p&gt;\n&lt;p&gt;Additional contact information Melissa Mitchell, Integrated Service Manager at melissa.mitchell10@nhs.net or 01258 394047&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sherborne", "postalCode": "DT9 3JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.95", "longitude": "-2.51953"}}, "title": "Community Mental Health Practitioner, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257016", "validThrough": "2020-11-19T23:59:59+0000"}