{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-05T16:46:20+0000", "description": "&lt;p&gt;The post holder will be required to provide a confidential secretarial and administrative service to the Early Intervention Team. The post holder is also responsible for managing referrals that come into the team, sending out appointment letters and mailshots, dealing with all telephone calls that come into the service and ensuring they get passed on in a timely manner.&lt;/p&gt;\n&lt;p&gt;The post holder will also be responsible for the requisitioning of stationery, maintenance of meeting rooms and non-stock requisitioning.&lt;/p&gt;\n&lt;p&gt;The Team Administrator will have an overview of the patient pathway with responsibility for ensuring referrals, reviews and appointments are processed and conducted within the required timeframes&lt;/p&gt;\n&lt;p&gt;The post holder is responsible for the provision of a booking appointment service Outpatients using a computerised Patient Administration System (PAS), electronic scanning equipment and fax machines. This will involve formal liaison with Service users and clinicians to ensure that patients are seen within appropriate timeframes.&lt;/p&gt;\n&lt;p&gt;The post holder will ensure an efficient administrative service for the team including minute taking, and other general administrative duties.&lt;/p&gt;\n&lt;p&gt;The post holder will support the evaluation of the Living Well service through the collation of data as per evaluation plan.&lt;/p&gt;\n&lt;p&gt;Please state in supporting information how you meet the requirements of the Person Specification and your preferred working pattern; full-time, part-time or both.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Lisa Gartley&lt;/p&gt;\n&lt;p&gt;Job title Administration Coordinator&lt;/p&gt;\n&lt;p&gt;Email address Lisa.gartley@gmmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0161 357 2500&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brunswick House, Salford", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Living Well Team Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258636", "validThrough": "2020-11-19T23:59:59+0000"}