{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "53733", "unitText": "YEAR", "value": "£53,733 - £74,661 per annum"}}, "datePosted": "2020-11-02T10:31:47+0000", "description": "&lt;p&gt;Greater Manchester Mental Health NHS Foundation Trust (GMMH) is one of the leading mental health trusts in the UK.&lt;/p&gt;\n&lt;p&gt;Serving a population of 1.2million people, the Trust employs around 4750 people who make a difference across 130 locations. GMMH provides community and inpatient mental health care, alongside substance misuse services across the North West.&lt;/p&gt;\n&lt;p&gt;GMMH is one of the most active research trusts in the UK, with one of the highest levels of recruitment to clinical trials for mental health. This puts our staff and service users at the leading edge of new mental health treatments.&lt;/p&gt;\n&lt;p&gt;The Trust provides a range of specialist services including prison in-reach across the North of England, a specialist centre for mental health and deafness and inpatient perinatal mental health care.&lt;/p&gt;\n&lt;p&gt;We have been rated ‘Good’ overall by the Care Quality Commission. Our substance misuse services and leadership were rated as ‘Outstanding’&lt;/p&gt;\n&lt;p&gt;We are seeking a full time Specialty Doctor in substance misuse at Unity in Barrow-in-Furness, Cumbria starting August 2020.&lt;/p&gt;\n&lt;p&gt;This an exciting opportunity for a Specialty Doctor to work with substance misuse services in Cumbria. The main base is at Barrow-in-Furness although there will be clinics in other bases such as in the picturesque town of Kendal. The successful candidate will be working with a multidisciplinary team comprising of a Consultant Psychiatrist, Registered Nurses, a Recovery Occupation Therapist and Recovery Practitioners. The successful applicant will have CPD time built into their job plan and will have access to study leave and a study budget. We will expect the successful candidate to engage with professional development opportunities such as delivering teaching and gaining management experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Patrick HorganJob titleConsultant in Subsatnce MisuseEmail addresspatrick.horgan2@gmmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Unity Alcohol &amp; Drug Recovery Service, Cumbria", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Specialty Doctor in General Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251580", "validThrough": "2020-12-01T23:59:59+0000"}