{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-28T11:31:31+0000", "description": "&lt;p&gt;** Please note this vacancy may close prior to the advertised closing date **&lt;/p&gt;\n&lt;p&gt;The Innovation, Research and Life Sciences group makes it faster and easier to undertake research in the NHS, helps build a pipeline of innovations which meets NHS needs and accelerates the adoption and uptake spread of proven innovation to deliver benefit to patients. We are responsible for implementing the Research and Innovation strategy in the NHS Long Plan, ensuring the NHS plays its full part in implementation of the Life Sciences Sector Deal and delivering the expanded remit of the Accelerated Access Collaborative (AAC).&lt;/p&gt;\n&lt;p&gt;The NHS Long Term Plan highlights the role that research and innovation will play in responding to the challenges that the health service faces. We set the strategy and priorities for a more effective innovation ecosystem and to ensure research and innovation meets the needs of the NHS, and we are working hand-in-hand with patients and the public to accelerate the introduction of proven innovations which can transform care and lives.&lt;/p&gt;\n&lt;p&gt;Our programmes include sponsorship of Academic Health Science Networks, test beds, the National Innovation Accelerator, Clinical Entrepreneurs, SBRI Healthcare, Innovation and Technology Payment programme, Rapid Uptake Products, AI Health and Care award and support to Early Stage Products. We also fulfil NHS England and NHS Improvement&#39;s responsibilities for supporting research, working hand in glove with NIHR, and the research community on programmes such as demand signalling, Excess Treatment Costs, speeding up research set up times and increasing participation in research.&lt;/p&gt;\n&lt;p&gt;The AAC brings together industry, government, regulators, patients and the NHS to remove barriers and accelerate the introduction of ground-breaking new treatments and diagnostics which can transform care. The AAC supports all types of innovations including therapies, diagnostics, devices, digital products, pathway changes and new workforce models. The AAC six priorities are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Innovation Service&lt;/li&gt;\n&lt;li&gt;Horizon Scanning&lt;/li&gt;\n&lt;li&gt;Demand Signalling&lt;/li&gt;\n&lt;li&gt;World-Leading Testing Infrastructure&lt;/li&gt;\n&lt;li&gt;Stronger Adoption and Spread&lt;/li&gt;\n&lt;li&gt;Agreed Funding Strategy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are a large and growing national team sitting within the Commercial Directorate within NHS England and NHS Improvement, and we are continuing to build a diverse, inclusive, compassionate workforce which supports all our colleagues to achieve their potential. You will be joining us during an exciting time as we build on the initial work we’ve already delivered to improving NHS research efficiencies and innovation adoption and we continue to develop best practice guidance and culture to make the NHS one of the most pro-research and innovation systems in the world to deliver improved patient outcomes and quality of life.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLindsey HughesJob titleInterim Deputy Director of Accelerated Access CollaborativeEmail addresslindseyhughes@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Quarry House or Skipton House, London or Leeds", "postalCode": "LS2 7UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Accelerated Access Collaborative Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246360", "validThrough": "2020-11-11T23:59:59+0000"}