{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-30T13:00:56+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST WAS PREVIOUSLY ADVERTISED AS 001-AHP038-0320&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking to develop your skills in a busy and dynamic specialist centre with a view to creating a highly skilled network across a South Wales?&lt;/p&gt;\n&lt;p&gt;The University Hospital of Wales will become the first Major Trauma Centre to launch within Wales in 2020. It will play a key role in leading the way in delivering specialist trauma care. The Major Trauma Centre is part of an inclusive and collaborative South West and Mid Wales Trauma Network spanning 6 health board areas.&lt;/p&gt;\n&lt;p&gt;The development of the Major Trauma Centre and Trauma Network seeks to enhance patient clinical and functional outcomes (across the whole pathway from prevention to rehabilitation and on-going care), in addition to improving the experience of patients, their families and staff across the Network. To achieve this we need dedicated, enthusiastic and experienced health care professionals to join this exciting new network.&lt;/p&gt;\n&lt;p&gt;A rare opportunity has arisen for an innovative and strategically minded individual to clinically lead and develop major trauma rehabilitation within the major trauma centre and across the South West and Mid Wales Trauma Network.&lt;/p&gt;\n&lt;p&gt;The post holder will provide expert clinical leadership to support the delivery of therapy across the major trauma pathway. The role is responsible for ensuring the delivery of high quality, safe care and will support the development of clinical pathways within the health board and across the South West and Mid Wales Trauma Network, through expert knowledge, clinical leadership, research and education.&lt;/p&gt;\n&lt;p&gt;The successful person will have excellent communication and influencing skills, a broad experience of working in major trauma rehabilitation across the pathway, supporting education and development of staff, in leading research and have worked successfully with a range of professionals and patients. You will be able to work on your own as well as within a multi-disciplinary team. You will hold a case load and need to be able to plan, deliver and monitor interventions and to communicate sensitively and effectively.&lt;/p&gt;\n&lt;p&gt;In return, we are highly committed to staff education and development and you will have opportunities to lead research. We welcome enquiries and encourage you to visit to find out more.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 15th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Cooke, Head of Physiotherapy, 029 20742315 emma.cooke@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHB wide, Cardiff", "postalCode": "CF14 4XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5068", "longitude": "-3.18937"}}, "title": "Consultant AHP for Major Trauma", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250282", "validThrough": "2020-11-15T23:59:59+0000"}