{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51198", "minValue": "51198", "unitText": "YEAR", "value": "£51,198 per annum, inc London Weighting"}}, "datePosted": "2020-10-27T10:01:46+0000", "description": "&lt;p&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/p&gt;\n&lt;p&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Want to work in the exciting field of Emergency Medicine in Greater London?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are interested in hearing from individuals with at least 4 years postgraduate experience to work as junior registrars (ST3 level) in our Emergency Department.&lt;/p&gt;\n&lt;p&gt;This is a fantastic time to join an extremely passionate and committed team within the Emergency Department.&lt;/p&gt;\n&lt;p&gt;The post will be based at the Emergency Department of the Princess Royal University Hospital which is a designated Trauma Unit and Hyper-acute Stroke Centre serving one of the largest patient bases in the London Borough of Bromley.&lt;/p&gt;\n&lt;p&gt;Successful candidates will join a dynamic, multi-professional emergency medicine workforce treating a wide spectrum of patients. This is a great opportunity to broaden your experience while working in a friendly, supportive environment with 24/7 senior supervision at all times.&lt;/p&gt;\n&lt;p&gt;The ED consultant team provides clinical supervision and care delivery 16 hours per day, seven days a week. They also have varied special interests including trauma, frailty, disaster medicine, education, public health, global health and pre-hospital care.&lt;/p&gt;\n&lt;p&gt;There is a strong training culture incorporating lecture-room teaching and clinical supervision, opportunities to attend relevant clinics and courses, and full immersion simulation sessions.&lt;/p&gt;\n&lt;p&gt;Regular scheduled academic time is also built into the rota to allow for Audit, QIP and personal learning/development.&lt;/p&gt;\n&lt;p&gt;There are also opportunities for flexible working and career progression to a more senior grade such as the Specialty Doctor role or a formal training post in Emergency Medicine.&lt;/p&gt;\n&lt;p&gt;Individuals will be paid on the junior doctor payscale MS03 (Nodal point 4).&lt;/p&gt;\n&lt;p&gt;Hospital accommodation is limited but may be available for a short period of time upon starting at the Trust. Support is provided to individuals who are relocating into the area who need help finding a more permanent address in the area.&lt;/p&gt;\n&lt;p&gt;Interview dates can be flexible. Whilst face to face interviews are preferred, alternative methods are also acceptable such as Skype.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Mitesh DavdaEmail addressmitesh.davda@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "ST3 Junior Registrar in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243911", "validThrough": "2020-11-06T23:59:59+0000"}