{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-27T13:16:00+0000", "description": "&lt;p&gt;NHS Wales Shared Services Partnership (NWSSP) is looking to recruit two Assistant Heads of PMO to support the on-going development of the NWSSP PMO and continual implementation of a number of projects that support service improvement in line with IMTP (integrated medium term plans) strategic objectives and other key business requirements.&lt;/p&gt;\n&lt;p&gt;The Assistant Head/s will be expected to have a sound understanding of NHS Wales and the relationship NWSSP has with Healthboards and Trusts.&lt;/p&gt;\n&lt;p&gt;The post holder must possess excellent communication, stakeholder management skills, which will help ensure policies, processes, and methodologies are developed and adopted across the organisation and wider boundaries.&lt;/p&gt;\n&lt;p&gt;The post will also seek to support and embed best practice across the organisation, working closely with stakeholders from all services within NWSSP and NHS Wales.&lt;/p&gt;\n&lt;p&gt;In addition, the post holder must also be determined and passionate PPM advocate focused on delivering projects and programmes to the highest standard, following already in use good practice and clearly focused on benefit realisation and successful business change.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join a growing team and help play an active role in continued success for NWSSP. Projects and Programmes will vary between business change, I.T and other business nominated projects offering excellent development opportunities.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh applicants are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date - 09th November, 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ian Rose&lt;/p&gt;\n&lt;p&gt;Head of PMO&lt;/p&gt;\n&lt;p&gt;Email address ian.rose@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127554.jpg", "name": "NHS Wales Shared Services Partnership", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NWSSP Headquarters 4/5 Charnwood Court, Nantgarw", "postalCode": "CF15 7QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5659", "longitude": "-3.27787"}}, "title": "Assistant Head of Project Managers Office", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244680", "validThrough": "2020-11-09T23:59:59+0000"}