{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-30T15:46:03+0000", "description": "&lt;p&gt;East Sussex Healthcare NHS Trust has hospitals in sunny seaside towns that provide radiological services to a large catchment area and we are only a 45 minute train ride to Brighton and 1.5 hour train ride to London.&lt;br /&gt;&lt;br /&gt;The General Radiology Departments provide services for General radiography, A&amp;E, Fluoroscopy and Theatre schedules. Rotation to other specialties within the department can include CT, Ultrasound, Nuclear Medicine, Mammography, Interventional and Cardiac Angiography. &lt;br /&gt;&lt;br /&gt;This is an exciting opportunity for someone with good clinical standards and interpersonal skills, who would like to join our friendly team in the Sussex region. &lt;br /&gt;&lt;br /&gt;As part of our commitment to CPD training, the successful candidate will rotate through the other modalities in order to develop their radiographic knowledge. And we can offer sponsorship opportunities with staff currently undertaking sponsorship in Ultrasound, Mammography, Nuclear Medicine and Reporting.&lt;br /&gt;&lt;br /&gt;We are a training centre for student Radiographers and therefore you will have the opportunity to become a mentor as well as expected to participate fully in their training whilst maintaining professional standards at all times. &lt;br /&gt;&lt;br /&gt;UK Registration with the Health Professions Council as a Diagnostic Radiographer must be obtained prior to commencement of employment.&lt;/p&gt;\n&lt;p&gt;For further details, please contact Mrs Kate Poulter, Clinical Modality Manager, by email at Kate.Poulter@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Conquest, Hastings", "postalCode": "TN37 7RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8854", "longitude": ".567737"}}, "title": "Band 5 Radiographer- Conquest Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250816", "validThrough": "2020-11-13T23:59:59+0000"}