{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42000", "minValue": "42000", "unitText": "YEAR", "value": "£42,000pa"}}, "datePosted": "2020-10-26T19:36:23+0000", "description": "&lt;p&gt;&lt;strong&gt;**Please note this role is a temporary position covering maternity leave - the contract will be 9-12 months**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cygnet Health Care was established in 1988. Since then we have developed a wide range of services for individuals with mental health needs and learning disabilities within the UK. We have built a reputation for delivering pioneering services and outstanding outcomes for the people in our care.&lt;/p&gt;\n&lt;p&gt;Our expert and highly dedicated care team of 8800 employees empower 3000 individuals across 140 services to consistently make a positive difference to their lives, through service-user focused care and rehabilitation.&lt;/p&gt;\n&lt;p&gt;We maintain a good relationship with our quality regulators and undergo regular inspections, with 85% of our services rated ‘Good’ or ‘Outstanding’. We also operate an internal system of quality care, treatment and positive outcomes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Broughton House:&lt;/strong&gt;&lt;br /&gt;Broughton House is a 29 bed specialist residential service for adults with autism and who may present with behaviours that challenge. We aim to provide a safe, comfortable and effective care environment for those in our care.&lt;/p&gt;\n&lt;p&gt;Broughton House is divided into five distinct areas to support people within smaller environments. The main part of the building offers nine beds, with four beds in both the Coach House and The Flat. On site there are two separate properties, Sutton House and Sandbeck House, each with six beds.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you want to make a difference and ensure people can achieve their goals and get the most out of life, then please read on...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will ensure the systematic provision of a high quality psychological service to Cygnet&#39;s Midlands services and work autonomously within professional guidelines while exercising responsibility for the systematic governance of psychological practice within the service/team.&lt;/p&gt;\n&lt;p&gt;A major requirement of the job is to act as a highly specialist resource to the wider professional community and to carry out audit, policy and service development and research activities and/or programs. To propose and implement policy and service development changes within Cygnet as served by the team/service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of this role include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;25days annual leave + bank holidays&lt;/p&gt;\n&lt;p&gt;Fully paid training&lt;/p&gt;\n&lt;p&gt;Paid DBS&lt;/p&gt;\n&lt;p&gt;Freeparking&lt;/p&gt;\n&lt;p&gt;Courtesy meals and refreshments whilst on shift&lt;/p&gt;\n&lt;p&gt;Shopping and entertainment discount scheme(over 800 retailers)&lt;/p&gt;\n&lt;p&gt;Cycle to Work scheme&lt;/p&gt;\n&lt;p&gt;Opportunities to progress and develop&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broughton", "postalCode": "LN5 0SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0753", "longitude": "-.633158"}}, "title": "Clinical/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243622", "validThrough": "2020-11-09T23:59:59+0000"}