{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata"}}, "datePosted": "2020-10-28T14:16:04+0000", "description": "&lt;p&gt;&lt;strong&gt;Our wonderful team is growing! We have been lucky enough to receive new funding to expand our Community Eating Disorder team in Oxford.&lt;/strong&gt; We are looking for a highly specialist Eating Disorder Dietician to work with us in the community across Oxfordshire. This is an exciting time for us due to the current development and transformation of our service.&lt;/p&gt;\n&lt;p&gt;Cotswold House (Oxford) is a specialist adult eating disorders service with a reputation for excellence. Our service provides a stepped-care model tailored to the needs of adults with a primary diagnosis of an eating disorder as well as those with co-morbid mental health problems and their carers. We offer a range of evidence-based treatments for eating disorders. The post is based at Cotswold House (Oxford) but there may be a need to travel to areas across Oxfordshire. The community team is comprised of a multi-disciplinary team including: clinical and counselling psychologists, a CBT psychotherapist, psychiatrists, nursing staff, assistant psychologists, support workers and team administrators. We are moving towards development of a life span service and have very good links with colleagues in the Child and Adolescent Eating Disorders Services and also the adult community eating disorders service in Buckinghamshire.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is ambitious, with a positive attitude and outstanding clinical skills. You should have excellent interpersonal skills, allowing you to thrive within a multi-disciplinary team context and in working with this complex patient group and their families.&lt;/p&gt;\n&lt;p&gt;You will also be expected to provide a dietetic service to a specialist and complex clinical area using a high level of skills and knowledge within the Eating Disorders field, at the level of an independent advanced practitioner. You should be able to provide nutrition and dietary advice suitable for the patient’s medical, social and cultural factors which is evidence based and takes into account patient/carer communication level.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSophie BlackJob titleClinical Team ManagerEmail addresssophie.black@oxfordhealth.nhs.ukTelephone number07920251481&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cotswold House Community Team, Warneford Hospital, Oxford", "postalCode": "OX3 7JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7508", "longitude": "-1.2223"}}, "title": "Specialist Dietician - Eating Disorders", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246936", "validThrough": "2020-11-11T23:59:59+0000"}