{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 pa inc. HCAS"}}, "datePosted": "2020-10-28T14:16:21+0000", "description": "&lt;p&gt;Staff Nurse&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Come and join us to develop our vision in being the lead in Discharge to Assess!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Come to the best and join our excellent team on our journey to National leadership in Discharge to Assess. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;** Experience in &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;Discharge to Assess&lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt; is not essential as we can support your development&lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Adams Ward is located at the Beautiful Finchley Memorial Hospital in North Finchley. Finchley Memorial Hospital has an excellent free ample parking for staff, excellent transport link through Northern Line and Public Buses to London.&lt;/p&gt;\n&lt;p&gt;Discharge to Assess Ward has a Multidisciplinary Teams which is led by the Matron, the Clinical Lead Therapist, Medical Team, Ward Manager, Registered Nurses, Occupational Therapists, Physiotherapists, Dieticians, Speech therapist, Pharmacists, Activities Coordinators, Health care assistants, Rehab Support Workers, and a dedicated social worker. There are a lot of opportunities to learn from the MDT team and opportunities for you to contribute to the learning of the Units.&lt;/p&gt;\n&lt;p&gt;The unit is committed to delivering the best possible patient and staff experience and our vision is to be national leader in Discharge to Assess and we are rapidly moving in that direction. As a Band 5 staff nurse you will find that there is excellent opportunity and support for your personal development, your opinion will count and you will be supported in your progression to be the best you can be.&lt;/p&gt;\n&lt;p&gt;Through CLCH Academy you will be supported to develop required knowledge and skills to progress to advanced practitioner in discharge to assess or other areas in the Trust.&lt;/p&gt;\n&lt;p&gt;It is not essential that you have specific experience as your development will be supported where necessary. The willingness to learn and being opened to new ideas is what we need. The ward manager with the support of the Matron are always in the ward to lead the team and share our vision with our patients.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Aliza Soguilon&lt;/p&gt;\n&lt;p&gt;Telephone number 0208 349 7390/7532&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;David Githinji&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;07506934527&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Finchley Memorial Hospital Marjory Warren Ward, London", "postalCode": "N12 0JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6066", "longitude": "-.177315"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246947", "validThrough": "2020-11-11T23:59:59+0000"}