{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-23T14:15:11+0100", "description": "&lt;h1&gt;Band 6 Senior Clinical Trial Coordinator/ Senior Research Nurse&lt;/h1&gt;\n&lt;p&gt;Royal Papworth Hospital is the UK’s leading heart and lung hospital and an internationally renowned centre offering specialist care for patients with cardio-respiratory conditions. Royal Papworth Hospital has gained a world-class reputation for innovation and excellence.&lt;/p&gt;\n&lt;p&gt;The Senior Clinical Trial Coordinator/ Senior Clinical Research Nurse will be working on Urgent Public Health studies in response to the COVID19 pandemic. We work closely with the multidisciplinary specialist clinicians and clinical teams caring for this group of patients and offer a variety of clinical studies including randomised, controlled trials for potential new therapies and observational studies.&lt;/p&gt;\n&lt;p&gt;The Trial Coordinator/Research Nurse will be responsible for setting up and running Urgent Public Health studies, recruiting patients, coordinating data collection, arranging and conducting assessments and follow up episodes as specified by the protocol. They will ensure that specified milestones are achieved on time, that high quality data is being collected and that the trial is being conducted according to the ethically-approved protocol and ICH-GCP standards.&lt;/p&gt;\n&lt;p&gt;Our focus is always to provide the highest standard of care to our patients and their families. We are looking for a motivated, efficient and enthusiastic individual to help us coordinate some of the exciting COVID research studies. Working closely with the investigators and research staff, the successful candidate will have regular contact with patients as well as being responsible for data collection from medical records and databases and helping in the preparation of reports and publications.&lt;/p&gt;\n&lt;p&gt;There has never been a more exciting time to join us at Royal Papworth Hospital. If you are looking for a new challenge and you are an experienced Senior Clinical Trial Coordinator/Research nurse now is the time to apply. Research staff is required to work across two sites: our off site office on Ermine Business Park, Huntingdon, and Royal Papworth Hospital on the Cambridge Biomedical Campus. Flexible working arrangements will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are ready for the challenge then come and join our team!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information please contact&lt;/p&gt;\n&lt;p&gt;Lucie Garner on 01223 639796 or Sarah Woods 01223 639818&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Cambridge Biomedical Campus, Papworth Road, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Senior Clinical Trial Coordinator / Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240865", "validThrough": "2020-11-20T23:59:59+0000"}