{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per Annum Pro Rata"}}, "datePosted": "2020-10-23T16:46:10+0100", "description": "&lt;p&gt;An exciting opportunity has arisen, for someone to join our team of cancer counsellors, working within the John LeVay centre at Ipswich Hospital, ESNEFT. We are looking to employ a motivated, efficient counsellor with the skills to offer counselling to breast cancer patients, for one morning or afternoon a week amounting to 5.5 hours per week for a fixed term of 1 year.&lt;/p&gt;\n&lt;p&gt;Applicants are required to have previous experience of working as a Counsellor, ideally in a secondary care setting. You will require a BACP accredited or equivalent course or are working towards accreditation with substantial experience of counselling clients and time-limited work. The role requires the post holder to manage and support breast cancer patients and their loved ones who may present with a range of needs and emotions, you will require the knowledge and experience of counselling cancer clients, and the challenges and ethical dilemmas presented in this area of work.&lt;/p&gt;\n&lt;p&gt;The post holder will work as part of an integrated multi-disciplinary team, including counsellors, clinical nurse specialists, and doctors. The service will offer support to the successful applicant in respect of their professional development. Part of the role will be to contribute to the development of the breast counselling service and to raise the awareness of the benefits of counselling to other health professionals.&lt;/p&gt;\n&lt;p&gt;You must be able to work independently and be responsible for the administrative duties and record keeping associated with the role. You will lead on the bookings of the clients referred and liaise with the John LeVay centre staff regarding room bookings. You will be confident in multi-tasking and able to demonstrate excellent IT and telephone skills in addition to your counselling skills. &lt;br /&gt;&lt;br /&gt;You will have the ability to be flexible, have good organisational and problem-solving skills and the ability to prioritise your workload effectively.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information please contact Kathryn Ramsey Macmillan Programme Manager on 07831509049.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich Hospital, Ipswich", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Breast Counsellor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241361", "validThrough": "2020-11-06T23:59:59+0000"}