{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 p.a inclusive of HCA"}}, "datePosted": "2020-10-12T08:16:59+0100", "description": "&lt;p&gt;We have an exciting opportunity for a highly skilled and enthusiastic person to join our team of Band 5 Radiographers at Guy’s and St Thomas’ NHS Foundation Trust. As one of the most successful and highly regarded teaching hospitals in the NHS we are able to provide enviable opportunities for you to develop your career.&lt;/p&gt;\n&lt;p&gt;We offer exposure to a fantastic combination of routine, varied and often highly specialised experiences.&lt;/p&gt;\n&lt;p&gt;Our Radiographers rotate across all of our sites, to include: St Thomas’, Guy’s, Evelina London Children’s Hospital and Guy’s Cancer Centre.&lt;/p&gt;\n&lt;p&gt;We have an impressive array of high tech equipment but our greatest asset is our highly skilled, patient focussed and friendly team.&lt;/p&gt;\n&lt;p&gt;Our ethos is about mutual support and shared achievement, developing our staff and services to provide exemplary levels of care to our patients. Our sites are located in stunning central London locations giving you every opportunity for both social and professional rewards.&lt;/p&gt;\n&lt;p&gt;We are looking for talented and ambitious band 5 Radiographers to support the expansion of our imaging departments and the introduction of additional imaging capacity across our modalities.&lt;/p&gt;\n&lt;p&gt;We invite applications from high achievers who are able to deliver exceptional care and service within our team. The radiology department runs a 24/7 service and operates an out of hours system wherein radiographers are contracted to work out of hours shifts at night, on weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applications are invited from HCPC registered candidates only.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBen PinningtonJob titleSuperintendent RadiographerEmail addressben.pinnington@gstt.nhs.ukTelephone number020 7188 5512&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross-site, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Band 5 Diagnostic Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221521", "validThrough": "2020-12-31T23:59:59+0000"}