{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38649", "minValue": "38649", "unitText": "YEAR", "value": "£38,649"}}, "datePosted": "2020-10-20T11:28:12+0100", "description": "&lt;p&gt;&lt;span&gt;Dental Academic Clinical Fellowship (ACF recruitment) – Health Education England in conjunction with the University of Liverpool&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dental Core Training ACF&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The University of Liverpool, in partnership with Health Education North West and NIHR has developed an exciting pathway of academic clinical training opportunities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are now invited for an Academic Clinical Fellowship in Dental Core Training who are applying to continue with their academic training as well as continue to develop their clinical skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are two post advertised at DCT2 level.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Application Process&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Health Education England (North West Local Office) is coordinating the process for recruiting trainees into Dental Academic Clinical Fellowship posts in the North West for September 2020 recruitment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications must be made through the Oriel system.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are equally open to those who may, either from the outset or subsequently, wish to train less than full time or job share.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that there is a strict application policy that applications cannot be accepted after the deadline.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Clinical benchmarking process: Unless you have already been clinically benchmarked at DCT1 level applicants will need to applyfor Dental Core Training the relevant specialty training programme via Oriel. You must complete all necessary stages of that recruitment process which will vary depending on the specialty, e.g. attend practical skills test, attend interview and/or selection centre as required. If you are found appointable in this process, then your ACF post will be confirmed.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Details regarding dates and timings of clinical benchmarking will be available on theCOPEND website.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Western Deanery", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "Dental Academic Clinical Fellowship - DCT at Liverpool University", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234126", "validThrough": "2020-11-17T23:59:59+0000"}