{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-21T08:16:03+0100", "description": "&lt;p&gt;&lt;strong&gt;East Midlands Congenital Heart Service, University Hospitals of Leicester NHS Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The internationally renowned East Midlands Congenital Heart Centre already has a fantastic team of Nurses who are highly skilled to deliver care to children with Congenital Heart Defects. We now have positions within our &lt;strong&gt;Paediatric Intensive Care Unit, Cardiac Surgical Ward, Catheter Lab &lt;/strong&gt;and &lt;strong&gt;Cardiac Theatres &lt;/strong&gt;and by joining our team, you will have the opportunity to develop specialists skills that will see you advance from a novice to an expert and where you can progress your Nursing career using the range of pathways we have to offer here at EMCHC.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;And it doesn’t stop there…………&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;By joining our team now, you will get the opportunity to work in our brand new facilities as we are set to move from Glenfield Hospital to the Leicester Royal Infirmary in April 2021. We have carefully designed our new building to incorporate state of the art facilities in age appropriate areas to ensure we can continue to deliver the highest quality care to our children and young people.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;And it doesn’t stop there…………..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Leicester hospitals have received £450 million in investment which will include the development of a new standalone Children’s Hospital at the LRI. By joining our team now you will get the opportunity to be part of the reconfiguration of our children’s services and shape the future of our Children’s Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;And it doesn’t stop there………………&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We know that you will have lots of questions to ask us and so we are going to be at one of the largest national Nursing Jobs Fair which was due to be held in Leicester on the 4th November 2020 but due to the current restrictions is going to be held virtually. The event is the Midlands Virtual RCNi Nursing Careers and Jobs Fair and you can register for the event on their website and you will able to talk the teams about our amazing opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There has never been a better time to join the EMCHC Team!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJo Ennis joanne.ennis@uhl-tr.nhs.uk 07921 545963&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glenfield Hospital, Leicester", "postalCode": "LE3 9QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6537", "longitude": "-1.1793"}}, "title": "Staff Nurse - EMCHC", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235532", "validThrough": "2020-11-16T23:59:59+0000"}