{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-27T14:15:29+0000", "description": "&lt;h1&gt;National Ambulance Resilience Unit (NARU) Instructor&lt;/h1&gt;\n&lt;h1&gt;12-month Secondment&lt;/h1&gt;\n&lt;p&gt;Start January 2021  (pending trust release)&lt;/p&gt;\n&lt;p&gt;An exciting and prestigious opportunity has arisen for an individual to become part of the NARU Education team. The dedicated training team provides ongoing support to the UK ambulance service resilience capabilities. The post holder will be responsible for the development and delivery of a variety of NARU training including Hazardous Area Response Teams, USAR, Command and the deliver (on occasions) to other NHS staff and partner agencies.&lt;/p&gt;\n&lt;p&gt;NARU seeks dynamic and enthusiastic instructors with relevant and current training experience.&lt;/p&gt;\n&lt;p&gt;The post holder will work at the NARU Education Centre, located at the Defence CBRN Centre, Winterbourne Gunner, Wiltshire and other locations around the country such as the Fire Service College, Moreton-in-Marsh.&lt;/p&gt;\n&lt;p&gt;The position is a secondment for twelve months with the opportunity to extend following consultation with the individual, NARU and their trust. There will be a three-month probationary period at the beginning of the secondment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;&lt;strong&gt;          &lt;/strong&gt;&lt;strong&gt;NHS Agenda for Change Band 7: plus 13% out of hours where appropriate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful applicant will be able to demonstrate:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Auditable instructor or trainer qualifications&lt;/li&gt;\n&lt;li&gt;Experience of instruction / training at a national level&lt;/li&gt;\n&lt;li&gt;Experience of planning, delivering &amp; assessing practical training sessions / exercises&lt;/li&gt;\n&lt;li&gt;Experience of working within the emergency services, health, military or adult education (further education or vocational) environment&lt;/li&gt;\n&lt;li&gt;Experience of working in a multiagency environment&lt;/li&gt;\n&lt;li&gt;Proven presentational and written skills&lt;/li&gt;\n&lt;li&gt;Computer literacy&lt;/li&gt;\n&lt;li&gt;Excellent interpersonal and communications skills&lt;/li&gt;\n&lt;li&gt;Effective management of time, resources and records&lt;/li&gt;\n&lt;li&gt;Being an effective team member capable of working within challenging environments and an ability to work under pressure and meet deadlines&lt;/li&gt;\n&lt;li&gt;Full driving license.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Much of the training will take place in outside locations in all weather conditions. Applicants will be expected to deliver practical training in such conditions and to work varied hours to suit the role. Uniform and equipment will be provided.  The majority of NARU courses are residential and the successful candidate will be required to reside on site during delivery of the modules.   &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is essential that you should be able to&lt;/strong&gt; &lt;strong&gt;demonstrate: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;That you hold, or are working towards, a recognised and auditable training/ instructing qualification&lt;/li&gt;\n&lt;li&gt;Experience in training and assessing against identified HART competencies&lt;/li&gt;\n&lt;li&gt;Extensive experience in CBRN/HART operations and ambulance operational command (ideally a minimum of two years HART experience)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Evidence of current continuing professional development&lt;/li&gt;\n&lt;li&gt;Experience in Ambulance / NHS pre hospital major incident response&lt;/li&gt;\n&lt;li&gt;Experience of the NHS CBRN capabilities and PRPS/QDPPE/GTS training&lt;/li&gt;\n&lt;li&gt;Experience of Urban Search and Rescue capabilities&lt;/li&gt;\n&lt;li&gt;Demonstrate an ability to undertake professional development towards training qualifications.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If successful, the candidate will be seconded to NARU and current NHS Trust terms and conditions would apply.  For staff outside the NHS a fixed term contract may be offered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your next step: &lt;/strong&gt;Applications should be submitted via the NHS jobs website.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be aware that applicants seeking a secondment opportunity must have their line manager’s approval prior to application for this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information on the role and informal discussion contact Parsyab Khan, NARU training manager on 01980 619562&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date:&lt;/strong&gt; &lt;strong&gt;26th November 2020 - Interviews will take place: 8th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The National Ambulance Resilience Unit is committed to a policy of equal opportunity for all staff.  We will not discriminate on grounds of gender, ethnic origin, disability, sexual orientation, faith or any other factor irrelevant to a person’s work.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "West Midlands Ambulance Service University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122792"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winterbourne Gunner", "postalCode": "SP4 0ES"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1117", "longitude": "-1.73706"}}, "title": "NARU Instructor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244903", "validThrough": "2020-11-26T23:59:59+0000"}