{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pro rata per annum"}}, "datePosted": "2020-10-28T10:32:21+0000", "description": "&lt;p&gt;&lt;span&gt;We are looking to recruit a self-motivated, well organised and highly skilled team secretary, to provide comprehensive and efficient secretarial support for the Learning Disability Health Team. This is a challenging opportunity to support a developing, diverse multidisciplinary team, covering the Scarborough, Whitby and Ryedale team working in the North Yorkshire and York Locality.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder should be able to demonstrate excellent communication, diary management and organisational skills and have experience of working in an office/customer service environment. A commitment to providing a high quality administrative support service to include supporting the multi-disciplinary specialists with co-ordination/organising of training /meetings and the ability to follow up on associated tasks/duties are essential requirements.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking a highly skilled, team player who will be required to have a flexible approach to work and the ability to maintain effective working relationships, whilst at times working remotely from some members of the administration team. The post holder will be required to work with minimal supervision and able to prioritize their own workload A working knowledge of information governance/confidentiality and the ability to deal with complex/sensitive issues are also important aspect of the roles.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be required to have NVQ3/ITQ2 or equivalent qualifications in administration. Knowledge of patient information systems, medical terminology and an understanding of Microsoft Office will also be advantageous. Please see the person specification for more details.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Deborah Slaney, Team Manager deborah.slaney1@nhs.net 01723 580940&lt;/p&gt;\n&lt;p&gt;Diane Burlingham, Admin Lead 01723 580940&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastfield Clinic, Scarborough", "postalCode": "YO11 3EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2407", "longitude": "-.399507"}}, "title": "Clinical Team Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246107", "validThrough": "2020-11-08T23:59:59+0000"}