{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26970", "minValue": "24907", "unitText": "YEAR", "value": "£24,907/£26,970/£27,416/£30,615"}}, "datePosted": "2020-09-29T11:58:39+0100", "description": "&lt;p&gt;&lt;strong&gt;Not all Heroes wear capes. Now more than ever, being a #NHSHero is something to be proud about&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has become available at Hinckley and Bosworth Community Hospital for band 5 Nurses. Full and Part time posts are available for experienced or newly qualified nurses.&lt;/p&gt;\n&lt;p&gt;The HBCH wards have both recently received SILVER awards in the trust quality accreditation. Both wards are predominantly for frail, elderly and medically unwell patients.&lt;/p&gt;\n&lt;p&gt;East Ward currently supports patients who are COVID positive&lt;/p&gt;\n&lt;p&gt;You will need to be a highly motivated nurse with vision, who wants to be part of a multidisciplinary team providing care within medical stepdown, rehabilitation and palliative care.&lt;/p&gt;\n&lt;p&gt;We use electronic systems, including System One for patient records, Nervecentre and EPMA (electronic medication prescribing and administration system). We offer training and personal development within the Wards and at our Learning and Development Centre to ensure you have the knowledge/skills to meet patient needs and complete your revalidation CPD requirements.&lt;/p&gt;\n&lt;p&gt;In addition we offer free parking on all our sites and a shift pattern that is predominantly long days and nights on a rotational basis. We may be able to offer flexible working patterns; we can clarify this at interview.&lt;/p&gt;\n&lt;p&gt;We strongly recommend that you visit one of our wards during the application process so that you understand fully the types of patients on our Wards, our patient management process within the MDT, how we facilitate timely discharges and communicate this to our patients and their families.&lt;/p&gt;\n&lt;p&gt;Please contact the ward sister Anna Ribton 07785708564 anna.ribton@leicspart.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;OR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dona Perkins 07867462295 dona.perkins@leicspart.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hinckley &amp; Bosworth Community Hospital", "postalCode": "LE10 3DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5593", "longitude": "-1.36817"}}, "title": "Band 5 Staff Nurses - Hinckley", "url": "https://www.jobs.nhs.uk/xi/vacancy/916204310", "validThrough": "2020-11-29T23:59:59+0000"}