{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33660", "minValue": "33660", "unitText": "YEAR", "value": "Up to £33,660 per annum FTE - DOE"}}, "datePosted": "2020-10-19T21:53:37+0100", "description": "&lt;h2&gt;&lt;strong&gt;I help to make a difference&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Are you collaborative, caring and compassionate?&lt;br /&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;We can offer training and development in our friendly and supportive teams as well as full-time, part-time and bank opportunities and a range of other employee benefits.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Interested in clinical development?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. ANP, BBV, sexual health, plastering, ILS (intermediate life support), health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Want to know more about HMP Featherstone?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;HMP Featherstone is a Category C closed adult male prison, located on the outskirts of Wolverhampton. It has an operational capacity of 703 offenders who are received from other prisons and rarely direct from court. The prison is operated by Her Majesty’s Prison Service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;HMP Featherstone were finalists in the Health Service Journal&#39;s (HSJ) Patient Safety Awards for Patient Safety Team of the Year!&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;&lt;br /&gt;In return for your hard work you will...&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Receive an annual salary of up to £33,660 FTE - depending on experience. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt;Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;br /&gt;&lt;br /&gt;Onsite benefits at HMP Featherstone include access to an onsite gym, free parking and subsidised café/restaurant.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;As a Primary Care Nurse / Staff Nurse you’ll be an integral part of the healthcare team by bringing your top notch clinical skills and passion for care. With plenty of primary care experience, you could be involved in anything from developing and leading clinics, undertaking examinations and tests as well as answering emergency bells and potentially being the first person to attend an emergency.&lt;br /&gt;&lt;br /&gt;If you have a passion for bringing new ideas to the table then we’re here to listen on how we can improve and continue to develop our healthcare service within the prison environment.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;If you are shortlisted, you will be contacted by the internal recruiter for this role.&lt;/p&gt;\n&lt;p&gt;The recruiter will submit your CV to the hiring manager and in turn they will arrange an interview for you to attend at HMP Featherstone if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt;The full-time role will be working 37.5 hours per week on a rolling rota basis across 7 days including weekends and nights. The salary for this role is up to £33,660 per annum (Pro-Rata for part time) dependent on experience with company benefits and schemes.&lt;/p&gt;\n&lt;p&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wolverhampton", "postalCode": "WV10 7PU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6506", "longitude": "-2.11025"}}, "title": "Primary Care Nurse (RGN) - HMP Featherstone", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233412", "validThrough": "2020-11-10T23:59:59+0000"}