{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-10-15T17:16:26+0100", "description": "&lt;p&gt;“The &lt;strong&gt;right care&lt;/strong&gt;, by the &lt;strong&gt;right person&lt;/strong&gt;, in the &lt;strong&gt;right place&lt;/strong&gt;”&lt;/p&gt;\n&lt;p&gt;Bolton NHS Foundation Trust provide services across the North West side of the Greater Manchester area ranging from hospital services in Bolton to community services across Bolton, Salford, Ashton, Leigh and Wigan. We are a progressive, expanding organisation with great ambition around improving quality, integrating pathways and delivering high levels of productivity. We have recently been given a CQC rating of Good. Over 5,700 people work for the Trust and many of them have been here a long time. People find they don’t need to go elsewhere to find a fulfilling career in healthcare.&lt;/p&gt;\n&lt;p&gt;The Family Division aims to deliver the highest standards of care for maternity, sexual health, gynaecology and a range of acute and community children’s services. The Division is a Centre of Excellence for Women’s and Children’s services and has a credible and enviable reputation. We deliver over 6,000 babies and carry around 1500 gynaecological procedures each year, making us a specialist provider of health services for women, babies and their families in the North West Sector of Manchester and beyond.&lt;/p&gt;\n&lt;p&gt;With births of around 6000 per year, Bolton is the ‘Supercentre’ for the northwest, providing high quality compassionate care to the women of Bolton, Bury, Salford and beyond.&lt;/p&gt;\n&lt;p&gt;Recent improvements have led to a stronger focus on providing safe and compassionate care and this has increased opportunities to learn, develop and expand your career.&lt;/p&gt;\n&lt;p&gt;We want midwives to love working with us and the families we serve. We want YOU to be here, shaping our vision for an outstanding service that gives women, families, our community and our midwives an extraordinary experience.&lt;/p&gt;\n&lt;p&gt;You will join a warm, supportive team of midwives who truly care about women’s experience of pregnancy, birth and early parenthood. We value your experience working with us and acknowledge that fulfilled midwives put women at the center of their work. We want midwives to be part of the women’s family to develop mutually respective and satisfying relationships.&lt;/p&gt;\n&lt;p&gt;What we are currently doing:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Offering 4 choices of birth environment&lt;/li&gt;\n&lt;li&gt;Developing a continuity of carer model&lt;/li&gt;\n&lt;li&gt;Developing a caseloading team&lt;/li&gt;\n&lt;li&gt;Providing high quality care to high risk women&lt;/li&gt;\n&lt;li&gt;Working towards offering a transitional care service&lt;/li&gt;\n&lt;li&gt;Developing our perinatal mental health service to offer a more holistic approach to women with mental health needs.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will have:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Confidence in your midwifery skills&lt;/li&gt;\n&lt;li&gt;Excellent communication and interpersonal skills&lt;/li&gt;\n&lt;li&gt;A zest for holistic care&lt;/li&gt;\n&lt;li&gt;Passion for physiological birth&lt;/li&gt;\n&lt;li&gt;Be prepared to support women through their journey whatever it becomes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSally BasuJob titleDeputy Head of MidwiferyEmail addressSally.Basu@boltonft.nhs.ukTelephone number01204 390228 (5228)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121713.png", "name": "Bolton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121713"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bolton NHS Foundation Trust, Bolton", "postalCode": "BL4 0JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.554", "longitude": "-2.42989"}}, "title": "Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229162", "validThrough": "2020-11-13T23:59:59+0000"}