{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T15:01:37+0000", "description": "&lt;p&gt;&lt;strong&gt;Full-time Band 6 Musculoskeletal Outpatient Physiotherapist - One-year fixed term contract. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Musculoskeletal Physiotherapy Service, Berkshire Healthcare NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare are seeking an organised and motivated person for a Band 6 Musculoskeletal Physiotherapist role in the Physiotherapy Outpatient team. This is a one-year fixed term contract and the successful candidate may be required to work at the Wokingham, Reading or Thatcham MSK Physiotherapy Departments. Site to be confirmed at interview.&lt;/p&gt;\n&lt;p&gt;We receive a wide variety of referrals from GP surgeries, orthopaedic clinics and from the Trusts Specialist Spinal Service and MSK Community Specialist Service. Opportunities can also arise for some work locally within GP practices. We have excellent clinical and administrative teams ranging from Bands 3 – 7 and you will have access to Band 7 Clinical Specialist Physiotherapists for supervision and In-Service Training. We also have the opportunity to work closely with Advanced Physiotherapy Practitioners from the Integrated Pain and Spinal Service and Musculoskeletal Community Specialist Service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to be committed to providing high quality, effective assessment and physiotherapy treatment, promoting self-management and empowerment of your patients. They should demonstrate postgraduate experience for a minimum of 12 months and a passion for musculoskeletal out-patients.&lt;/p&gt;\n&lt;p&gt;The service seeks to maximize accessibility for our patients therefore the post does incorporate some evening work one day a week. Staff will also be expected to participate in a Saturday morning rota working on average 1 in 6 weekends at an enhanced hourly rate of pay.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To work as a senior physiotherapy practitioner to provide a high quality, responsive outpatient physiotherapy service for adults &amp; children with musculoskeletal &amp; orthopaedic conditions&lt;/li&gt;\n&lt;li&gt;To provide a high standard of physiotherapy assessment, treatment and caseload management&lt;/li&gt;\n&lt;li&gt;To undertake all aspects of clinical duties as an autonomous practitioner working without direct supervision.&lt;/li&gt;\n&lt;li&gt;To be involved in supervision and education of junior physiotherapists, physiotherapy assistants, technical instructor, work experience students and physiotherapy students.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of joining our team:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AfC Salary ranging from £31,365 - £ 37,890 per annum&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities and a strong emphasis on your work, life balance&lt;/li&gt;\n&lt;li&gt;Annual leave – 27 days for new starters, plus bank holidays. Increasing to 29 days after 5 years and 33 days after 10 years NHS service. Pro rata for part time staff&lt;/li&gt;\n&lt;li&gt;Excellent learning and development opportunities&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car&lt;/li&gt;\n&lt;li&gt;Generous maternity, paternity and adoption leave for eligible staff&lt;/li&gt;\n&lt;li&gt;Advanced IT enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent support and advice for staff.&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The 3&lt;/strong&gt; &lt;strong&gt;“must haves” for you to be considered for this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;High quality assessment and treatment skills&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Ability to organise and prioritise&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Excellent communication skills&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you recognise yourself in these requirements, we would recommend you apply today!&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call &lt;em&gt;Cathy Godwin &lt;/em&gt;on 0118 955 0415 or email: catherine.godwin@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4475", "longitude": "-1.00172"}}, "title": "Senior Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260266", "validThrough": "2020-11-13T23:59:59+0000"}