{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 PA"}}, "datePosted": "2020-11-06T14:46:20+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a highly motivated and influential professional leader to join our organisation in the role of Deputy Chief Nurse. This is an excellent opportunity for an aspirant Chief Nurse, who is looking to strengthen and consolidate their existing experience, in preparation for their first executive director role. The post of Deputy Chief Nurse provides a great opportunity for a talented senior nurse to work alongside the existing Deputy Chief Nurse and Executive Chief Nurse.&lt;/p&gt;\n&lt;p&gt;This is a critical role in our organisation and we want a leader who is committed to the quality and safety agenda, ensuring it is well executed and becomes everyone’s business. You will have excellent leadership skills and a strong record of success to support the delivery of safe, effective and high-quality services. You will ensure the Trust is fully compliant with all regulatory requirements and provide leadership and advice across all areas in the Trust.&lt;/p&gt;\n&lt;p&gt;The Deputy Chief Nurse portfolio includes the professional standards, workforce and education agenda. Working with higher education institutes, creating an innovative approach to encouraging our local population to consider a career in the NHS. A focused and creative approach to providing a sustainable workforce that provides a continuum of growth and development that encompasses the NHS People Plan.&lt;/p&gt;\n&lt;p&gt;A proven record in improving quality and safety and working within a complex environment with skills in communication and problem solving is essential. You must be comfortable to work at all levels, connecting with the workforce and operating at Director Level, deputising for the Chief Nurse across the full portfolio of the Chief Nurse’s responsibilities as required, and will support the Chief Nurse in delivering objectives across corporate, clinical, professional, and operational areas including attending Trust Board as and when required.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mary Sexton - Chief Nurse&lt;/p&gt;\n&lt;p&gt;Email address: mary.sexton@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Deputy Chief Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260190", "validThrough": "2020-11-20T23:59:59+0000"}