{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36000", "minValue": "36000", "unitText": "YEAR", "value": "£36,000"}}, "datePosted": "2020-10-08T21:00:12+0100", "description": "&lt;p&gt;&lt;strong&gt;The company:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;2gether Support Solutions is a new, wholly owned subsidiary of one of the largest NHS Foundation Trusts in the UK, East Kent Hospitals University NHS Foundation Trust (EKHUFT). The Trust established the company so that core facilities and support services can continue to be operated successfully with the added benefits that a private sector culture and approach can bring to enhancing and developing these services. The company remains 100% publicly owned, with the Trust as the only shareholder.&lt;/p&gt;\n&lt;p&gt;At 2gether Support Solutions we put customer service and quality at the heart of all that we do. We have strong social enterprise principles and the profits we make go back into supporting our staff, improving services for patients and other community activities in east Kent.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The purpose of this role is tobe part of the team that provides Medical Equipment Management services for the East Kent Hospitals University NHS Foundation Trust, and to other NHS and private organisations with whom Service Level Agreements or contracts exist. Further responsibilities will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;The postholder will provide support for the most complex medical devices. They will liaise and work closely with other healthcare professionals, manufacturers’ representatives, engineers and technical staff to provide applications advice, device evaluation, acceptance testing, commissioning, troubleshooting, calibration, and maintenance of a diverse range of diagnostic, therapeutic and point of care testing equipment, ensuring it functions correctly, is within calibration limits, and safe for patient and staff use.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Working to a high standard of safety and accountability, in line with the departmental quality management system, the Trust policy for the management of medical devices, MHRA guidance, Care Quality Commission regulations and Trust employment policies.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Participate in the EME out of hours emergency on-call rota. Organise, prioritise and control work using own initiative, without managerial input, during on-call at night and the weekend &amp; when carrying out work for Community Health Trusts or in patients’.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Use technical and clinical experience to identify potentially hazardous symptoms and faults when in clinical areas or in talking to clinical staff.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Liaise with clinical staff in own specialist area to gain a clear understanding of the nature of problems with equipment and its use, and in order to plan preventative maintenance and rectify problems, minimising impact on patient treatment lists.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Apply advanced analytical troubleshooting techniques to diagnose problems, including those beyond the scope of manufacturer-supplied information. Exercise judgement to determine the causes of faults in devices, which may have a range of various possible causes. Assess the seriousness and implications of the problem and respond to the urgency of the request, following EME procedures, and using own initiative.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support and train clinical staff in the use of medical equipment. Provide technical expertise and support to clinical and other staff groups.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Propose changes to department working practices, policies and procedures in order to improve the service.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Ensure that work records and other documentation is accurate and completed in a timely manner.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Keeping up to date with developments in medical devices and technology and also with clinical and engineering practices.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The candidate:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;The successful candidate will need to to have knowledge and experience of the Medical Devices Management Policy&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To be a member of the Register of Clinical Technologists.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To have a qualification in anatomy and physiology&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a range of excellent benefits including:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;\n&lt;p&gt;The opportunity to buy or sell up to 10 days annual leave each year&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Training and Development opportunities&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Career progression&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Discount in selected high street retailers&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Onsite childcare facilities (QEQM, WHH, KCH)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Cycle to work Scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Heavily Discounted Stagecoach Travel Cards&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Subject to terms and conditions&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;2gether Support Solutions is an equal opportunities employer and welcome applications from all suitably qualified persons regardless of their race, sex, disability, religion / belief, sexual orientation or age.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "2gether Support Solutions", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Specialist Medical Engineering Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219376", "validThrough": "2020-11-27T23:59:59+0000"}