{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-28T10:46:38+0000", "description": "&lt;p&gt;&lt;strong&gt; Gastroenterology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated Physician Associate (PA) to join our Gastroenterology team at the University Hospitals Leicester (UHL). Primary responsibilities will include working with ward-based gastroenterology (hepatology, nutrition or luminal) teams. Duties will include ward rounds, reviewing, interpreting and requesting studies, holding discussions with patients regarding their previous medical histories and potential next steps, and supporting other team members in developing and facilitating patient care plans. In addition there may be opportunities for the PA to be trained in procedures such ascitic drain placement and the opportunity to see patients in the clinic setting.&lt;/p&gt;\n&lt;p&gt;Our department already has one experienced PA who, along with a supportive group of consultants, registrars and other staff to assist you in transitioning into this rewarding position. In addition PAs have been employed in other departments of UHL for many years providing a stable PA network and making the Trust a generally PA-friendly environment.&lt;/p&gt;\n&lt;p&gt;Department-based educational opportunities are available and encouraged including participation in Consultant and Junior Doctor/Registrar-led teachings and journal clubs.&lt;/p&gt;\n&lt;p&gt;You must be a member of the Physician Associate Managed Voluntary Register (PAMVR), and are expected to maintain your membership and CPD requirements.&lt;/p&gt;\n&lt;p&gt;We are one of the biggest and busiest NHS Trusts in the country, serving the one million residents of Leicester, Leicestershire and Rutland – and increasingly specialist services over a much wider area.&lt;/p&gt;\n&lt;p&gt;Set in the heart of England, the vibrant and historic city of Leicester has a wealth of leisure and shopping facilities, is well connected to London and other major cities and it is a great place to live, work and play.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;James Stewart - Head of Service&lt;/p&gt;\n&lt;p&gt;james.stewart@uhl-tr.nhs.uk&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Diane O&#39;Meara, Physicians Associate&lt;/p&gt;\n&lt;p&gt;diane.omeara@uhl-tr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Physician Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246158", "validThrough": "2020-11-11T23:59:59+0000"}