{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-10-29T10:46:32+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Clinical Trials Assistant – Band 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hello! My name is Karolina Joniak and I am the Specialist Clinical Trials Set-Up Technician for the Clinical Trials team in Oxford.&lt;/p&gt;\n&lt;p&gt;As the Senior Technician I am privileged to support our fantastic technical team of Pharmacists, Technicians, Assistants and Apprentices as we provide support services to our clinical trial research teams on all of our trust sites throughout Oxfordshire. As a Senior Clinical Trials Assistant in our team, you will have an extremely varied role – you will be involved in maintaining the supply chain of Clinical Trial medications to research nurses who deliver treatment to patients, maintaining financial records, completing drug accountability activities, closing down and archiving of completed studies, as well as facilitating meetings from sponsors. A successful candidate should possess NVQ Level 2 in Pharmacy Service Skills, equivalent qualification or related degree (i.e. pharmaceutical or science degree). Applicants without these qualifications will still be considered. However, they will be required to undertake the provided relevant level 2 qualification in Pharmacy Services and offered a lower band until this qualification is achieved.&lt;/p&gt;\n&lt;p&gt;I am very keen to hear from you if you have previously worked in a pharmacy environment and/or have some exposure to clinical trials as we have some great opportunities for you to progress your career.&lt;/p&gt;\n&lt;p&gt;If you are interested in an informal discussion about the Pharmacy Assistant role offered within our team then I would be very pleased to chat with you about this. You are more than welcome to call on the numbers below or even better, we can make an appointment for me to show you around and answer your questions. Looking forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;Please make sure that you read the job description and person specification attached below, and that your statement in support reflects this as your application will be judged against these criteria.&lt;/p&gt;\n&lt;p&gt;The majority of correspondence will be via the e-recruitment system; therefore you should check your emails regularly including junk mail folders in web-based email products.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 12th of November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karolina Joniak on 01865 572151 and 01865 223035 (karolina.joniak@ouh.nhs.uk)&lt;/p&gt;\n&lt;p&gt;David Badcock on 01865 572151 and 01865 223035 (david.badcock@ouh.nhs.uk)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital / Churchill Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Senior Clinical Trials Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247973", "validThrough": "2020-11-12T23:59:59+0000"}