{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 per annum"}}, "datePosted": "2020-10-30T11:31:35+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialty Doctor in Early Intervention in Psychosis (Community) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Based at the Eastern and Coastal Area Offices, Canterbury&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It’s an exciting time to join us with a new medical school for Kent and Medway due to open and welcome its first student in 2020. The new training and research centre will attract and retain the most talented and aspiring doctors to the region and will work collaboratively with local health organisations to ensure that the programmes are aligned with local needs.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have been rated ‘Outstanding’ by the CQC for Caring and ‘Good’ overall.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Kent and Medway NHS and Social Care Partnership Trust provides mental health, learning disability, substance misuse and other specialist services for 1.7 million people across Kent and Medway. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We pride ourselves on providing high quality clinical services, innovation and partnership working.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Early Intervention in Psychosis (EIP) Services were first described in the National Service Framework (1999) and in the related Policy Implementation Guide (2013). These services are for young people aged 14 to 65 years experiencing a first episode of psychosis. EIP services work to reduce the Duration of Untreated Psychosis (DUP). By reducing DUP and working intensively and holistically with the young person and their families, the service works towards a goal of recovery.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;EIP services have been shown to be clinically effective and cost effective and are recommended by NICE within a number of guidelines: psychosis &amp; schizophrenia (2014); bipolar disorder (2010) and the psychosis and schizophrenia in children and young people guideline (2013). They are also valued by service users and carers alike (Schizophrenia Commission, 2012). &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an energetic Specialty Doctor to join the team who are keen to support teaching and research and there is the possibility of specialist interest sessions dependent on interests. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our innovative psychiatric services are recruiting for talented, dynamic and committed Doctors across the county of Kent. You will play a key role in helping us deliver an outstanding service through forward thinking, innovation and providing high quality care. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a 10 PA job plus on-call supplement . Part time or job share applications are welcome. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;#KMPTproud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants may wish to visit the teams by arrangement with Dr Ahmed Ismail, Consultant Psychiatrist in EIP - East Kent:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ahmed.ismail3@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01233658100&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Mo Eyeoyibo&lt;/p&gt;\n&lt;p&gt;Associate Medical Director&lt;/p&gt;\n&lt;p&gt;m.eyeoyibo@nhs.net&lt;/p&gt;\n&lt;p&gt;01322 622041&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastern and Coastal Area Offices, Canterbury", "postalCode": "CT1 1AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2778", "longitude": "1.11098"}}, "title": "Specialty Doctor, Early Intervention in Psychosis (Community)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249953", "validThrough": "2020-11-15T23:59:59+0000"}