{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-26T15:16:15+0000", "description": "&lt;p&gt;This is an exciting time to join the Respiratory Department at HDFT. The Trust has committed to a significant investment in the medical workforce through the development of 2 new respiratory consultant posts. These will ensure that we can continue to deliver high quality patient care as well as help drive forward service developments.&lt;br /&gt;&lt;br /&gt;The successful applicant will join the Respiratory Team, consisting of 2 full-time Consultants, 2 Specialist Registrars, a Specialist Respiratory ACP, a Respiratory Nurse Consultant (this post), 5 WTE Respiratory Nurse Specialists, a CSW, a Specialist Respiratory Physiotherapist and Lung Cancer Nurse Specialist. The post holder will join a friendly, well-established and innovative multi-disciplinary team to support the delivery of high quality care to patients with specialist problems in respiratory medicine. We have a successful respiratory outreach team.&lt;/p&gt;\n&lt;p&gt;HDFT is committed to supporting its staff with their health and wellbeing. Staff can access a range of online and over the phone support, wellbeing lounges, Freedom to Speak Up Guardians, Fairness Champions, the Chaplaincy, Staff Networks and Staff Governors.&lt;br /&gt;&lt;br /&gt;For further information or to arrange an informal visit please contact Terry Robinson, Nurse Consultant on 07795 641397 or Tammy Gotts, Matron on 01423 553041. Further enquiries can be made to Dr Claire Taylor, Respiratory Consultant on 01423 553672 or Miss Rachael Stray, General Manager on 01423 553103&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate District Hospital, Harrogate", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Respiratory Nurse Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243094", "validThrough": "2020-11-15T23:59:59+0000"}