{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum, pro rata"}}, "datePosted": "2020-11-03T09:00:49+0000", "description": "&lt;p&gt;We have an exciting opportunity for an Administrative Assistant to join the administrative team of The Somerset Community Pain Management Service. This service supports adults with long-term pain and aims to empower them to develop their understanding, skills and confidence to live a full and meaningful life.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to assist with appointment, outpatient and administrative tasks and generally assist in the co-ordination of the smooth running of the service as a whole. Whilst the service covers the county of Somerset, the post holder will be based at the administrative hub at Dene Barton Community Hospital in Taunton.&lt;/p&gt;\n&lt;p&gt;The successful candidate will primarily support the Senior Booking Clerk with outpatient procedures, including arranging and booking appointments, importing referral letters and clinic notes and taking appropriate action in response to telephone and email enquiries. There will also be an opportunity to support with secretarial duties, including audio typing, general and clinical correspondence.&lt;/p&gt;\n&lt;p&gt;The post holder will demonstrate a level of adaptability and a flexible approach to work. They must be passionate about high quality patient care, committed to team work, be efficient and motivated and able to work to a high standard of accuracy. Effective, empathetic and compassionate communication with patients, their carers/relatives, members of the multidisciplinary team and other health care professionals, whether face-to-face, over the telephone or electronically, is also essential.&lt;/p&gt;\n&lt;p&gt;This role is part time at 22.5 hours per week. Working hours and days to be discussed at interview, but can be flexible to some degree, with the ability to work Mondays and Fridays being an advantage.&lt;/p&gt;\n&lt;p&gt;If you are a “can do” individual, who would like to be part of a busy small, friendly and supportive multidisciplinary team, we would encourage you to get in touch with any queries or questions about the role. Please contact Elizabeth Ford, Medical PA via Elizabeth.Ford@SomersetFT.nhs.uk or Wendy Nicholson, Senior Booking Clerk via Wendy.Nicholson@SomersetFT.nhs.uk .&lt;/p&gt;\n&lt;p&gt;There is potential interview date for this post of 2nd December 2020.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Elizabeth Ford&lt;/p&gt;\n&lt;p&gt;Medical PA&lt;/p&gt;\n&lt;p&gt;Elizabeth.Ford@SomersetFT.nhs.uk / 01823 344147&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dene Barton Community Hospital, Cotford St Luke, Taunton", "postalCode": "TA4 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0376", "longitude": "-3.18224"}}, "title": "Administration Assistant, Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253205", "validThrough": "2020-11-22T23:59:59+0000"}