{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25365", "minValue": "22987", "unitText": "YEAR", "value": "£22,987 to £25,365 pa inc HCAS"}}, "datePosted": "2020-09-28T12:55:22+0100", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Associate Practitioners Band 4 Virology – up to 37.5 hrs per&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Virology Department at &lt;span style=&quot;text-decoration: underline;&quot;&gt;St Peter’s Hospital, Chertsey&lt;/span&gt; (Berkshire Surrey Pathology Services (BSPS), has vacancies for Associate Practitioners to work within the COVID team. The posts are a mixture of bank and fixed term contracts (fixed term for 6 months which may be extended by a further 6 months depending on the ongoing COVID pandemic situation and our response to the testing requirements for this).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The department will be operating three shifts: Early 6.30am - 3.00pm, Late 2.30 – 11.00pm and Nights 10.30-7.30. We can support a mixture of shifts or a fixed shift e.g. nights only, or part-time workers e.g. evenings and weekends, depending on service need.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post also involves preparation of samples for analysis by PCR and antibody assays and you will receive full training to use and maintain automated equipment in the department to perform COVID assays, rotating through sections of the laboratory under the supervision of biomedical scientists.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You must be keen to embrace new ways of working and develop your knowledge and skills in order to fulfil the role. You will be working with the Virology senior team to ensure a co-ordinated and effective service is provided by best use of staff and resources to continue to provide a service to UKAS ISO 15189 standards. We are looking for an energetic, enthusiastic and well-motivated candidate with appropriate qualifications and/or relevant experience including laboratory skills for the accurate and safe use of laboratory equipment and reagents, experience with Hologic Panther or Abbott Architect would be advantageous. To be the successful the candidate, as well as being friendly and reliable, you will need a flexible attitude towards work with good organisational skills, attention to detail and communication. You must have the ability to work under pressure and work well within a team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The department is a large and busy hub laboratory serving the five hospitals that make up Berkshire and Surrey Pathology Services (BSPS). BSPS is formed by St Peter’s Hospital Chertsey, Royal Surrey County Hospital, Frimley Park Hospital, Wexham Park Hospital and Royal Berkshire Hospital an provides diagnostic pathology services for these five hospitals and the surrounding GPs serving a population of over 2 million people. The laboratory is UKAS accredited to ISO 15189 and is well equipped with a number of analysers.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our staff benefit from a strong commitment to training and development, minimum 27 days holiday pro rata, access to a final salary pension scheme, flexible working, subsidised restaurant facilities and childcare facilities (onsite Nursery).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You must demonstrate motivation and interest for joining this busy expanding Virology Department. If you would like further information, please contact Gemma Brahams, Acting Lead BMS, 01932 723049.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Interviews are on-going - you will be notified, within 2 weeks, of the outcome of your application.&lt;/strong&gt;&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Associate Practitioner - Band 4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916202650", "validThrough": "2020-11-30T23:59:59+0000"}