{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46000", "minValue": "46000", "unitText": "YEAR", "value": "Up to £46,000pa DOE"}}, "datePosted": "2020-10-26T19:37:33+0000", "description": "&lt;p&gt;&lt;strong&gt;We are currently looking to employ a full time &lt;/strong&gt;Clinical or Forensic Psychologist &lt;strong&gt;to join our established Therapy Team at &lt;/strong&gt;Cygnet Hospital Stevenage. The successful candidate will join the established Psychology Department comprised of a Principal Forensic Psychologist, Principal Clinical Psychologists, a Consultant Clinical Psychologist and Head of Therapies, as well as assistant psychologists and psychology students.&lt;/p&gt;\n&lt;p&gt;The applicant will be an HCPC registered Clinical or Forensic Psychologist with experience in clinical forensic settings.&lt;/p&gt;\n&lt;p&gt;Cygnet Hospital Stevenage is a 87 bedded hospital with two medium and two low secure wards (male and female); we also offer services for men and women who are experiencing an acute episode of mental illness, requiring assessment and stabilisation. The successful candidate will mainly offer psychology provision to our low secure female ward.&lt;/p&gt;\n&lt;p&gt;Our goal at Cygnet is to deliver effective and evidenced based interventions that improve mental health and reduce risk. We offer an integrated care pathway for service users who are able to successfully move on to independent community living. This is further supported by our broad range of therapies which include: DBT, CBT for psychosis, Substance Misuse, Fire Setters Programme for Mentally Disordered Offenders, Sex Offenders Treatment Programme, Acceptance and Commitment Therapy and Cognitive Analytical Therapy.&lt;/p&gt;\n&lt;p&gt;The successful candidate would work as a team psychologist within a multi-disciplinary team and would also play a role in training, supervision and service development according to skills, experience and areas of interest. As a ward psychologist you will apply skills and expertise in clinical and risk assessments, collaboratively develop formulations and care plans and deliver group and individual psychological interventions, and consult to the MDT.&lt;/p&gt;\n&lt;p&gt;Cygnet Hospital offers excellent opportunities for training and skills development. &lt;strong&gt;Attractive training package is available (i.e CAT, Schema, DBT training)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We also offer a company benefits package which includes contributory pension scheme, free life insurance, share incentive plan, free meals, childcare vouchers. Previous experience in Forensic settings as well as training in complex therapies such as Schema focused, Cognitive Analytical and DBT will be an advantage.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cygnet hospital, Graveley Road, Stevenage, Herts", "postalCode": "SG1 4YS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9276", "longitude": "-.215201"}}, "title": "Clinical/Forensic Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243624", "validThrough": "2020-11-09T23:59:59+0000"}