{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata pa"}}, "datePosted": "2020-10-23T10:15:47+0100", "description": "&lt;p&gt;We are an innovative and expanding Theatre Service at the forefront of patient care. Our service operates 36 Theatres across the Royal Derby Hospital site. We are continually growing and on the lookout for enthusiastic individuals passionate about delivering safe effective care.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced or newly qualified Nurses to work in our Urology Day Case Ward, Flexi Clinic and Theatre working various working hours. We have a team of Clinical Facilitators and Preceptors employed to support you and who design an individualised programme to enable confidence and competence in practice. We support the experience of rotating to a wide range of specialities and provide support to allow you to expand your knowledge, experience and interest. We offer excellent professional development courses and extended roles e.g. Mentorship.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Urology Day Case Unit&lt;/strong&gt; consists of 2 operating theatres, a 4 bedded recovery, 2 outpatient clinic areas, a lithotripsy treatment room and a 15 bedded ward. It is staffed with 31 WTE qualified and unqualified staff. We are developing and expanding this service and are in the process of developing a dedicated Robotic Theatre within the department.&lt;/p&gt;\n&lt;p&gt;This post will involve working on the Urology Day Case Ward preparing patients ready for surgery and looking after them post surgery through to discharge. We also look after TWOC patients, Catheter changes and offer ESWL&#39;s assistance. The post will also offer the opportunity to work in our flexible cystoscopy clinic which involves providing clinical skills assisting the surgeons undertaking diagnostic procedures. There could also be some rotation into the Theatre area.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to work within a multi-professional team, liaising with and providing high quality care for patients. You will need to possess excellent communication and inter-personal skills with the ability to promote a learning environment and be flexible to change. If you have the drive and determination to work in a dynamic department we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development opportunities, including both professional and leadership development, together with an opportunity to work across some or all of our 5 sites depending on specialty&lt;/li&gt;\n&lt;li&gt;Support through every step of the way from recruitment to when you join our team and beyond&lt;/li&gt;\n&lt;li&gt;Friendly, supportive and caring colleagues&lt;/li&gt;\n&lt;li&gt;A variety of other staff benefits including employee assistance programme, discounted gym membership, onsite fitness classes, car schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key facts about our Trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Every day our hospitals see more than 4,000 outpatients&lt;/li&gt;\n&lt;li&gt;We see more Trauma &amp; Orthopaedic outpatients than any other Trust – over 3,300 per week&lt;/li&gt;\n&lt;li&gt;An average 860 patients are seen in A&amp;E every day – the 6th largest in the country&lt;/li&gt;\n&lt;li&gt;Our hospitals admit more than 220 emergency patients every day&lt;/li&gt;\n&lt;li&gt;We carry out more planned surgical operations than any other Trust in England with almost 50,000 operations taking place in our 52 operating theatres&lt;/li&gt;\n&lt;li&gt;We are one of only 5 Trusts nationally with more than 50 operating theatres&lt;/li&gt;\n&lt;li&gt;We carry out more than 300 elective procedures each working day&lt;/li&gt;\n&lt;li&gt;We employ 12,000 staff across our 5 hospital sites&lt;/li&gt;\n&lt;li&gt;We have a Director of Allied Health Professionals who is committed to provide leadership, progression and direction to AHPs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 8 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 20 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises. If you have Covid-19 related symptoms or are shielding and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;/p&gt;\n&lt;p&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tracy Milward - Lead Practitioner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Email: tracy.milward1@nhs.net&lt;/p&gt;\n&lt;p&gt;Phone: 01332 788092&lt;/p&gt;\n&lt;p&gt;Mobile: 07827283068&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Derby Hospital, Derby", "postalCode": "DE22 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9104", "longitude": "-1.51382"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239992", "validThrough": "2020-11-08T23:59:59+0000"}