{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum, inc HCA"}}, "datePosted": "2020-11-05T17:16:23+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a highly motivated Cardiology Nurse? Do you love the challenge of improving quality and making a difference to patients and their families?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Following a restructure, we are looking for an enthusiastic nurse to join our Inherited Cardiac Conditions (Cardiac Genetics) team within the Cardiovascular care group at King’s College Hospital. Candidates must be able to demonstrate their clinical experience in cardiology.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ICC service serves the patient population across South East London through the King’s Health Partners sites of King’s College Hospital, St Thomas’ Hospital and Guy’s Hospitals. This post is mainly based at the King’s College Hospital site of Denmark Hill, but will involve some clinical supervision at the other sites. This post will work within a team of clinical nurse specialists, cardiologists and geneticists working with these patients to provide clinical triage and diagnostics, genetic testing and genetic counselling.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There will be teaching, clinical supervision and opportunities for enhanced clinical learning as well as developing patient assessment skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The s&lt;span&gt;uccessful applicant will need to demonstrate specialist skills in cardiology and/or genetics, have effective communication skills with a multidisciplinary team, as well providing support to patients and families affected by inherited cardiac conditions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s College Hospital is situated in South East London and provides comprehensive health care and emergency services for a diverse community. It is also one of London’s four major trauma centres covering the South East of England. With over 1,400 beds across various sites, KCH is one of the largest and busiest hospital trusts in London, with a well-established national and international reputation for clinical excellence, innovation and achievement.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants are advised to make contact and arrange an informal visit with Tania Massey, Head of Nursing for Cardiovascular.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Tania Massey&lt;/p&gt;\n&lt;p&gt;Job title Head of Nursing, Cardiovascular&lt;/p&gt;\n&lt;p&gt;Email address tania.massey@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0203 299 3987&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Junior CNS for Inherited Cardiac Conditions", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258702", "validThrough": "2020-11-19T23:59:59+0000"}