{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum, pro rata"}}, "datePosted": "2020-10-29T09:15:53+0000", "description": "&lt;p&gt;Are you passionate about IAPT and are looking for a new opportunity to implement positive change to those experiencing mental health difficulties? Somerset Partnership NHS Foundation Trust may be the answer! Our dynamic Talking Therapies Service is currently expanding and have exciting opportunities for &lt;strong&gt;Qualified Psychological Wellbeing Practitioners&lt;/strong&gt; looking to contribute to major developments.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be aware that it is part of the essential criteria for this role that all applicants hold or are nearing completion the PWP Qualification. Please read the job specification and job description for further information. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WE ARE &lt;/strong&gt;a busy IAPT service in one of England’s most desirable counties. Somerset Talking Therapies is a Countywide IAPT Service that is made up of 4 teams across Somerset. We employ over 80 therapists and are passionate about improving access to psychological therapies. We pride ourselves on our clinical model that focuses on delivering high-quality care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WE OFFER &lt;/strong&gt;the opportunity to make a difference to the wellbeing of a diverse population and to work amidst supportive and friendly colleagues and dependable managerial and clinical leaders. Regular managerial support, clinical supervision, CPD opportunities, a generous relocation scheme and a secure pension plan are complemented by a range of additional benefits available under the NHS employment benefits scheme. We operate from and around four bases (Wells, Taunton, Chard/Yeovil and Bridgwater).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THE TEAM&lt;/strong&gt; you will be joining is an innovative and friendly team of PWPS, High Intensity CBT Therapists, Psychological Therapists and Assessment Workers. Many in our team have joined us from other parts of the country, not the least because of the countless advantages life in Somerset can offer. Not far from bustling metropolitan areas, such as Bath, Bristol, and Exeter or the beautiful seaside, the county is rich in stunning and tranquil locations. Many appreciate that the cost of living and housing is considerably lower here than in the city and families value the safety of Somerset as well as the multitude of clubs, centres, and cultural venues where they and their children can get involved. Colleges and a number of excellent schools ensure good educational opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;YOUR ROLE&lt;/strong&gt; as a PWP will be to provide evidence based low-intensity CBT interventions to our patients with low mood and anxiety through a variety of deliveries such as telephone, face to face, online and to support our busy course programme. There are opportunities to be involved in service development initiatives such as Computerised CBT (group webinars &amp; online guided self-help) and expanding Long Term Conditions (LTC) partnerships. We are forming several working partnerships with local hospitals and LTC services such as heart failure, COPD and diabetes.&lt;/p&gt;\n&lt;p&gt;We have a strong supervision model that provides weekly, individual case management supervision, monthly clinical skills supervision and monthly line management. You will be joining a service which values PWP development and wellbeing, there are opportunities to develop your skills and explore areas of specialised interest through various CPD, national IAPT conferences and workshops, supervision training, top up LTC training and opportunities to progress in the service.&lt;/p&gt;\n&lt;p&gt;In order to safeguard the health &amp; wellbeing of our patients and workers, our service is currently offering all interventions remotely by telephone or face to face on video platforms. This allows our clinicians to work from home where appropriate, or they can offer such remote interventions from our office bases. This has been a very successful change for the effectiveness of our work. In the coming months we intend to return to some selected venue-based, face to face work to facilitate patient access to treatment. We will continue to offer flexibility around remote working moving forward so we welcome applicants who reside outside of the Somerset area.&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Emily Hector, Senior Psychological Wellbeing Practitioner (Bridgwater) - emily.hector@somersetFT.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Jasmine Hutton, Senior Psychological Wellbeing Practitioner (Wells) - jasmine.hutton@somersetFT.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Somerset Wide, Teams based in Wells, Chard, Bridgwater or Taunton", "postalCode": "TA6 4RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1479", "longitude": "-2.99453"}}, "title": "Psychological Wellbeing Practitioner, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247708", "validThrough": "2020-11-15T23:59:59+0000"}