{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa inc"}}, "datePosted": "2020-10-20T14:16:27+0100", "description": "&lt;p&gt;The Royal Marsden Hospital is one of Europe’s largest Oncology centre and was the world’s first hospital dedicated to cancer research, diagnosis, treatment and education, with sites in Chelsea and Sutton. The Diagnostic Imaging service provides an essential service to the Trust and includes CT with dual energy, MRI 1.5T and 3T including whole body, biopsies and endo-cavity, Mammography including large field and interventional procedures, Ultrasound as well as general X-Ray, fluoroscopy and theatres.&lt;/p&gt;\n&lt;p&gt;The Royal Marsden on the Sutton Surrey site is located close to Belmont train station and a free staff shuttle operates from Sutton mainline station which has fast links to London. The world renowned Children and Young Peoples Cancer unit is based on this site and offers staff the opportunity to be at the leading edge of Paediatric oncology imaging and care. Our partnership with The Institute of Cancer Research and other key organisations means we offer access to the newest clinical trials and clinical trials of novel anti-cancer agents, all imaging modalities are fundamental to this process and forefront techniques and protocols are constantly being evolved within Radiology. The extended days offer staff variety and run over an 8 week rota as The Royal Marsden is a work / life balance focused trust. There is an OFSTED ‘outstanding’ crèche on site and many opportunities to get involved in Royal Marsden charity activities.&lt;/p&gt;\n&lt;p&gt;We are currently inviting applications from enthusiastic individuals for a fixed term 12 month maternity cover band 6 Diagnostic Radiographer vacancy on the Sutton site. The post will rotate between X-Ray and Mammography. Candidates credentials should include the post graduate mammography certificate and suitable and significant post graduate breast experience, the successful candidate should be an innovative, highly motivated radiographer with good communication skills and participation in the non-residential on call is expected of these posts.&lt;/p&gt;\n&lt;p&gt;The ideal candidates must demonstrate a commitment to professional development and show a keen interest in the future of their profession and the Diagnostic Imaging services. They will be expected to support both the service and its staff in continuing to maintain and develop the highest standards of imaging. In return the successful applicant will be offered a high standard of support towards their career pathway.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJuliette AkersJob titleOperational LeadEmail addressjuliette.akers@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden Hospital, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Band 6 Diagnostic Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234744", "validThrough": "2020-11-17T23:59:59+0000"}