{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T10:46:50+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Senior Occupational Therapist to work within the Vale Royal Adult Community Mental Health Team, providing assessment and intervention to adults aged between 18 to 65 years within the local catchment area.&lt;/p&gt;\n&lt;p&gt;We are a multi-disciplinary team consisting of Consultant Psychiatrists; Clinical Psychologist; nurses; social workers and clinical support staff; utilising the skills of the team and a strengths based approach to provide assessment and intervention to individuals referred to our service.&lt;/p&gt;\n&lt;p&gt;As the only OT within the team, your skills will be highly valued by your colleagues, and directed appropriately to the benefit of service users referred to the service. The role will involve working closely with the Clinical Psychologist in the delivery of therapeutic interventions to a small caseload, based on assessment and formulation. It will also include the supervision of the team Technical Instructor and Clinical Support Worker in carrying out their duties. The post holder should have the ability to work independently and prioritise their own workload, and should be a resource for the team regarding specialist OT assessment and support re care planning, and may include time limited care coordination for a small number of service users who would benefit from the specialist input of an Occupational Therapist as the main intervention in their recovery.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a range of clinical mental health experience and will be enthusiastic about working in this setting. Informal support is available through other members of the MDT, and CPD opportunities are provided.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jackie Taylor Clinical Lead Jackie.Taylor14@nhs.net 01606 555103&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Vale House Resource Centre, Winsford", "postalCode": "CW7 2AS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1926", "longitude": "-2.5287"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249798", "validThrough": "2020-11-13T23:59:59+0000"}