{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80554", "minValue": "70641", "unitText": "YEAR", "value": "£70,641 - £80,554 p.a. inc of HCA"}}, "datePosted": "2020-10-30T08:16:17+0000", "description": "&lt;p&gt;An exciting opportunity has presented itself at Guy’s and St Thomas’ Hospital Trust for a new Production Manager. This post provides strategic direction and leadership for the development of new and continuation existing product lines under the MS and MIA(IMP) licences held by the site.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful candidate will take up the position of production manager as nominated on the MHRA specials and IMP manufacturing licenses (MS/MIA (IMP) 13387/01) for the aseptic, terminally sterilised and non-sterile manufacturing units at Guys Hospital. The units provide a complex and diverse range of pharmaceuticals which have a positive impact in meeting the clinical needs of patients both at Guy’s and St Thomas’ and elsewhere in the NHS and Primary Care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful candidate will demonstrate high level knowledge of injectable products, aseptic processing, terminal sterilisation process for liquids and a wealth of experience in oral solid dosage manufacture (direct compression), liquids, creams and gels as well as the regulations related to the manufacture of these products&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for an individual who has a broad skill set and evidence of leadership qualities to lead production services from the forefront. We expect the individual to evidence expert technical knowledge and advanced level of clinical technical reasoning and judgement. Equally important is the ability to include, engage and motivate a diverse workforce and demonstrate in the way you encourage and support your staff that they are your greatest asset.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Managing a team of around 45 staff members the post holder will working closely with Quality Assurance to ensure operations remain compliant with cGMP and current regulatory requirements. The successful candidate will be a suitably experienced production / technical services professional who is dynamic in the way they work to ensure safety, quality and efficiency of the service&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Beyond the recognised core activities of the Production Manager, the post holder will form part of the product development team and represent the production department at the monthly Pharmacy Quality Committee and quarterly pharmaceutical quality review meetings.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holder will be nationally recognised in the production / manufacturing field and represent the department at the national production committee meetings.&lt;br /&gt;We expect the post holder to show commitment to the role in order to motivate staff and share a positive approach to the demands of the post and commit resources as necessary. The Trust is committed to a series of values and behaviours.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Senior managers must act as a role model and create an inclusive and positive culture where the staff can develop a sense of ownership and an environment where they can speak up, encourage innovation, minimise risks and take pride in their work.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you are looking for that next step in your career progression and have the knowledge and skills we are keen to bring to lead our team, we welcome your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePaul TunstellJob titleAssociate Chief Pharmacist - Technical ServicesEmail addresspaul.tunstell@gstt.nhs.ukTelephone number02071886373Additional contact information&lt;/p&gt;\n&lt;p&gt;Helen Callaby, Head of Pharmaceutical Quality&lt;/p&gt;\n&lt;p&gt;E-mail: helen.callaby@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 0207 188 6373&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Paul Tunstell, Associate Chief Pharmacist: Technical Services&lt;/p&gt;\n&lt;p&gt;E-mail: Paul.Tunstell@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s Hospital, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Production Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249337", "validThrough": "2020-11-17T23:59:59+0000"}