{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa"}}, "datePosted": "2020-10-27T10:16:03+0000", "description": "&lt;p&gt;Medicines Management Pharmacy Assistant (37.5 hours per week)&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced Pharmacy Assistant to join our hardworking Medicine Management Team at the Royal Derby Hospital. The post holder will hold and NVQ level 2 in Pharmacy Services. They will be an excellent communicator, reliable, enthusiastic, and a team player.&lt;/p&gt;\n&lt;p&gt;The Pharmacy Department at University Hospitals of Derby and Burton provides services across five hospitals in Derby, Burton, Lichfield and Tamworth.&lt;/p&gt;\n&lt;p&gt;This new Senior Assistant Technical Officer post will work with our friendly, well established team of Medicines Management Technicians to assist in the provision of a comprehensive Pharmacy Service for the Discharge Assessment Unit at The Royal Derby Hospital. Hours of work will be Monday to Friday 9:30am to 6pm. The successful applicant will participate in the dispensary weekend and bank holiday rota.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key responsibilities will include&lt;/strong&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dispensing&lt;/li&gt;\n&lt;li&gt;Reception duties&lt;/li&gt;\n&lt;li&gt;Assist in stock ordering&lt;/li&gt;\n&lt;li&gt;Stock management&lt;/li&gt;\n&lt;li&gt;Collection and delivery of medication within the hospital.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are a highly motivated, with demonstrable post qualification experience who wants to make a real difference to patient care then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development opportunities, including both professional and leadership development, together with an opportunity to work across some or all of our 5 sites depending on specialty&lt;/li&gt;\n&lt;li&gt;Support through every step of the way from recruitment to when you join our team and beyond&lt;/li&gt;\n&lt;li&gt;Friendly, supportive and caring colleagues&lt;/li&gt;\n&lt;li&gt;A variety of other staff benefits including employee assistance programme, discounted gym membership, car schemes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key facts about our Trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Every day our hospitals see more than 4,000 outpatients&lt;/li&gt;\n&lt;li&gt;We see more Trauma &amp; Orthopaedic outpatients than any other Trust – over 3,300 per week&lt;/li&gt;\n&lt;li&gt;An average 860 patients are seen in A&amp;E every day – the 6th largest in the country&lt;/li&gt;\n&lt;li&gt;Our hospitals admit more than 220 emergency patients every day&lt;/li&gt;\n&lt;li&gt;We carry out more planned surgical operations than any other Trust in England with almost 50,000 operations taking place in our 52 operating theatres&lt;/li&gt;\n&lt;li&gt;We are one of only 5 Trusts nationally with more than 50 operating theatres&lt;/li&gt;\n&lt;li&gt;We carry out more than 300 elective procedures each working day&lt;/li&gt;\n&lt;li&gt;We employ 12,000 staff across our 5 hospital sites&lt;/li&gt;\n&lt;li&gt;We have a Director of Allied Health Professionals who is committed to provide leadership, progression and direction to AHPs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 10 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 24 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises. If you have Covid-19 related symptoms or are shielding and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;/p&gt;\n&lt;p&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Jane Betts - Chief Pharmacy Technician&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tel: 01332 787793&lt;/p&gt;\n&lt;p&gt;Email: jane.betts2@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Seonaidh Packwood - Pharmacy Technician&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tel: 01332 789443&lt;/p&gt;\n&lt;p&gt;Email: seonaidh.packwood@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Derby Hospital, Derby", "postalCode": "DE22 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9104", "longitude": "-1.51382"}}, "title": "Medicine Management Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243966", "validThrough": "2020-11-10T23:59:59+0000"}