{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-11-02T14:01:51+0000", "description": "&lt;p&gt;We have an exciting opportunity for Band 5 Qualified Nurse, Nurse associate, allied health professional or ambulance personnel as we require a Continuing Healthcare (CHC) review nurse/practitioner to carry out ongoing assessments to work within our continuing healthcare department to conduct assessments of individuals in receipt of Funded Nursing Care (CHC) and CHC. The successful candidate would also need to support the Covid 19 Scheme 1 and Scheme 2 review processes as part of the wider CHC work.&lt;/p&gt;\n&lt;p&gt;The successful candidates will provide specialist CHC/FNC nursing assessment and review of adults and older people residing in some acute settings, care homes with nursing, residential care settings and individuals within their own homes in line with the National Framework NHS Continuing Healthcare and the determination of the Funded Nursing Contribution (FNC).&lt;/p&gt;\n&lt;p&gt;The successful candidate will be trained by an existing experienced team and will work closely with local partners, to include health, social care and independent providers in the on-going management and review of patient care needs. They will also provide clinical advice in relation to NHS Continuing Health Care and NHS Funded Nursing Care (FNC).&lt;/p&gt;\n&lt;p&gt;This role will also provide assurance around quality of commissioned care packages, responding to and reporting safeguarding concerns in accordance with agreed inter-agency reporting procedures.If successful, you will be working with a wonderful team and professional development will be an integral aspect of this role. We offer flexible working for anyone who proves themselves to be enthusiastic and motivated to achieve high standards within the role.&lt;/p&gt;\n&lt;p&gt;If you believe this is the role for you please apply without delay.&lt;/p&gt;\n&lt;p&gt;For further details/informal visits contact Debra Forshaw or Laura Capewell&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebra ForshawJob titleClinical Lead for CHCEmail addressdebra.forshaw@nhs.netTelephone number07980 732648Additional contact information&lt;/p&gt;\n&lt;p&gt;Laura Capewell, Senior Commissioning Nurse, 07980 732649 laura.capewell@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oldham Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128387"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Civic Centre, , Oldham", "postalCode": "OL1 1UT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5423", "longitude": "-2.11722"}}, "title": "Continuing Healthcare Review Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252329", "validThrough": "2020-11-16T23:59:59+0000"}