{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-28T09:57:38+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Physician Associate - Band 7 - Haematology/Oncology- 37.5 Hours per week - Permanent&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;There is a new exciting opportunity for a motivated Physician Associate to work within the Macmillan Unit at the West Suffolk Hospital NHS Foundation Trust. The post will be working in conjunction with the Haematology and Oncology Consultants and the Clinical Nurse Specialists to support the care of patients on the Unit. The role will involve initial patient assessment and examination, interpreting results and working with the teams on treatment plans.&lt;/p&gt;\n&lt;p&gt;There will be the opportunity to develop new skills including bone marrow procedures with training provided by the Haematologist, with the potential to develop other clinical skills within the Unit.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join a busy, cohesive, forward-thinking, department of 10 Consultants and 8 Clinical Nurse Specialists. The Macmillan Unit has 11 inpatient beds and a busy Day Unit with 13 chairs and 1 bed. The Unit has an Acute Oncology Service, (AOS), assessment area and has recently started an outreach service within the locality using a mobile chemotherapy unit provided by the charity Hope for Tomorrow. The successful post holder will be expected to work flexibly within the department.&lt;/p&gt;\n&lt;p&gt;For an informal discussion, or to arrange a visit, please contact either, Dr. D. Chitnavis or Dr. M. Karanth. via the Haematology Department secretaries on (01284) 713072.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does&lt;/strong&gt; entitle you to apply to park on the Hospital site.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at Enhanced level.&lt;/p&gt;\n&lt;p&gt;For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Physician Associate - Band 7 - Haematology/Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245927", "validThrough": "2020-11-11T23:59:59+0000"}