{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615"}}, "datePosted": "2020-10-30T11:07:07+0000", "description": "&lt;p&gt;Community Nurse- Primary Care Home Lowestoft&lt;br /&gt;Part Time hours available (22.5 hours per week) with a range of shifts (07.00- 15.00, 08.30 - 16.30, 11.00- 19.00 AND 12.00 -20.00).&lt;/p&gt;\n&lt;p&gt;Become a proud member of the PCH Lowestoft family. We are looking for proud, professional Registered Nurses to join us in the community within the Primary Care Home team to deliver high quality nursing care to the population of the coastal town of Lowestoft.&lt;/p&gt;\n&lt;p&gt;Are you looking for a new challenge? Do you want to develop and grow your professional skills and clinical practice in an encouraging and supportive team? Does delivering nursing care to people in their own home appeal to you? If yes, come and join us. These posts are equally suitable for newly qualified or experienced nurses.&lt;/p&gt;\n&lt;p&gt;You will be working in a supportive multidisciplinary team member- which including other Nurses, Occupational Therapists, Paramedics, Physiotherapist, Assistant Practitioners, Rehab Support Workers, Healthcare Assistants and Phlebotomists. Working closely with GP&#39;s, social services and other specialist services. You will be providing an excellent standard of person centered care to adults in their own homes, residential care or clinic settings, using a health coaching approach to support patients to self manage whenever possible.&lt;/p&gt;\n&lt;p&gt;We provide bespoke support and educational packages to facilitate the transfer or your existing knowledge and clinical skills as a registered nurse working in a different environment to the community. As a newly qualified nurse we will support your transition to your first registered nurse role. We provide a full preceptorship programme.&lt;/p&gt;\n&lt;p&gt;As a PCH nurse you will gain expertise in many clinical skills including wound care; specialist leg ulcer assessment; diagnosis and treatment; supporting patients with long term conditions; acute admission avoidance; delivering palliative and end of life care. You will develop skills as an autonomous practitioner and be supported to increase the confidence required to manage a delegated caseload of patients. Nursing in the community is about holistic care, working in partnership with the patient and the whole household.&lt;/p&gt;\n&lt;p&gt;Our Nurses are highly regarded by the patients, their families, carers and other professionals. Working within the supportive environment of the PCH means we are able to respond to the changing needs of patients and support those who may previously have been admitted to hospital to remain at home.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be able to demonstrate how they embody our values and commitments and a desire for personal and professional development.&lt;/p&gt;\n&lt;p&gt;The PCH is commissioned to provide a 24/7 service. The core shifts are flexible and applicants will be required to participate in working other shifts as part of the role including weekend and bank holiday working on a rotational basis.&lt;/p&gt;\n&lt;p&gt;East Coast Community Healthcare (ECCH) is a social enterprise delivering NHS contracts as part of the NHS family. ECCH follows Agenda for Change terms and conditions and supports the transfer of NHS pension for those already in the scheme. In return for your commitment, we offer a wide range of staff benefits including investment in career development; salary sacrifice lease car scheme; child care vouchers; NHS discounts; pension schemes; flexible working. For a full list of employee benefits please see our website. As a social enterprise we actively encourage employee shareholding and participation in the development of our enterprise.&lt;/p&gt;\n&lt;p&gt;Next steps - If you are interested in this position please contact; Locality Lead Kate Spence on 01502 535122 kate.spence@nhs.net , or Kirsti Williams (PCN Nurse Lead ) to discuss further or arrange an informal visit.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127294.png", "name": "East Coast Community Healthcare CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lowestoft", "postalCode": "NR32 1DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4756", "longitude": "1.75463"}}, "title": "Nurse Primary Care Home", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249876", "validThrough": "2020-11-13T23:59:59+0000"}