{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28988", "minValue": "26365", "unitText": "YEAR", "value": "£26,365 - £28,988 pa inc"}}, "datePosted": "2020-10-30T16:16:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 4 Colposcopy Coordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has come up for an exceptional candidate to join the Directorate of Gynaecology and Reproductive Medicine within Imperial College Healthcare NHS Trust for a fixed-term period of 6 months, in the position of Colposcopy Coordinator.&lt;/p&gt;\n&lt;p&gt;The Gynaecology Service at Imperial College Healthcare Trust is one of the largest services in the UK providing tertiary gynaecology and women’s services across three hospital sites; Hammersmith Hospital, Queen Charlottes and Chelsea Hospital and St Mary’s Hospital. Areas of expertise include; gynaecological cancer, colposcopy, urogynaecology, fibroids, recurrent miscarriage, fertility and IVF and is a centre for the management of congenital abnormalities.&lt;/p&gt;\n&lt;p&gt;The service has two inpatient Gynaecology wards (32 beds) providing acute, specialist and post-surgical care to patients. There are two large dedicated gynaecology outpatient departments, a day surgery unit and diagnostic unit from which gynaecology services are provided. The post holder will work alongside their management colleagues and lead consultants and nurses for the subspecialties they are responsible for.&lt;/p&gt;\n&lt;p&gt;If you are…&lt;/p&gt;\n&lt;p&gt;…Ambitious, with management experience, and can demonstrate that you are creative, innovative, forward thinking and have the skills to deliver change effectively whilst maintaining operational delivery;&lt;/p&gt;\n&lt;p&gt;…Able to respond to what is happening in the moment and work collaboratively with clinical colleagues to develop services;&lt;/p&gt;\n&lt;p&gt;…Adaptable and flexible in your communication and influencing style;&lt;/p&gt;\n&lt;p&gt;…A leader that can understand the organisational context and translate it for everyone in your team to make sense of and understand the part that they play and work with them to make informed decisions;&lt;/p&gt;\n&lt;p&gt;…Able to build strong and sustainable relationships with all stakeholders across departments;&lt;/p&gt;\n&lt;p&gt;…then please get in touch!&lt;/p&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The opportunity to work as part of a multidisciplinary team who provide one of the largest gynaecology services in the UK&lt;/li&gt;\n&lt;li&gt;Development on one of our award winning internal Leadership Programmes;&lt;/li&gt;\n&lt;li&gt;A senior mentor within the Trust;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Proposed interview on week commencing 23rd Nov 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Taqdeer Sidhu at taqdeer.sidhu@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 4 Colposcopy Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250914", "validThrough": "2020-11-12T23:59:59+0000"}