{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44412", "minValue": "44412", "unitText": "YEAR", "value": "£26.42 Monday to Friday"}}, "datePosted": "2020-10-27T13:07:31+0000", "description": "&lt;p&gt;&lt;strong&gt;**PLEASE NOTE THIS IS TO APPLY TO JOIN NHS PROFESSIONALS’ ALLIED HEALTH PROFESSIONALS BANK**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Band 8A Clinical Psychologist Consultant&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Erleigh Road Clinic/Berkshire Healthcare NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Days: £26.42 Saturdays/Nights: £34.35 Sunday/Bank Hols: £42.28&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: J11-NHSP-AHP-34438&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Join the bank for flexibility in how you work. Whatever your availability we value your skills and experience and can provide you with a fantastic opportunity to work with us in a way that suits your lifestyle.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community, in a Trust rated ‘Outstanding’ in a recent CQC report, working in a location with all the benefits of coast and country living with the convenience of big city life?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for Psychologist Consultant available at Berkshire Healthcare NHS Foundation Trust, specifically providing the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;provide specialist psychological assessment for patients under the care of the relevant RBH Services&lt;/li&gt;\n&lt;li&gt;provide specialist psychological intervention to patients under the care of these RBH services, focusing on issues around management, coping and adjustment, with a view to: optimising helpful coping, psychological well-being, self-management and health related quality of life, managing symptoms including pain and fatigue; reducing patient distress and to provide psychological support to family members/carers.&lt;/li&gt;\n&lt;li&gt;provide necessary psychological input into the relevant RBH MDTs on a routine basis including leading on the psychological perspective in and attending MDT meetings&lt;/li&gt;\n&lt;li&gt;provide advice, consultation and teaching to members of the relevant RBH services upon request&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The occupational therapy team has an enviable reputation, great supportive team with a family feel, the post holder here will be pivotal in providing the best level of quality care to varying departments and their patients needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowledge and skills in psychological work with people living with long term physical health conditions&lt;/li&gt;\n&lt;li&gt;Knowledge and skills in systemic practice, and third wave therapies such as compassion focused therapy&lt;/li&gt;\n&lt;li&gt;Post qualification training in health psychology&lt;/li&gt;\n&lt;li&gt;Doctoral level training in clinical/counselling psychology, including specifically models of psychopathology, clinical psychometrics and neuropsychology, two or more distinct psychological therapies (including CBT) and lifespan developmental psychology as accredited by the BPS.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03330 144 370&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with Kim Hurley, Recruitment Consultant on 01442915242 or &lt;span style=&quot;text-decoration: underline;&quot;&gt;Kim.Hurley&lt;/span&gt;@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Erleigh Road Clinic", "postalCode": "RG1 5LR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4507", "longitude": "-.955502"}}, "title": "Band 8A Highly Specialised Clinical Psychologist Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244662", "validThrough": "2021-01-25T23:59:59+0000"}