{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-10-29T10:20:38+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;2 Programme Managers – One Workforce, One Model and Life-Long Learning &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;12-month fixed term contract or secondment.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for two Programme Managers to support the delivery of two creative and innovative system led projects focusing on the delivery of a place-based workforce planning model and life-long learning framework. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This work will form part of the wider transformative Greater Manchester Health and Social Care Workforce Programme, which is working to deliver the fastest and most comprehensive improvements in the capacity and capability of the whole GMHSC Partnership workforce (paid &amp; unpaid).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Both roles will ensure effective programme management principles are embedded so that each programme is delivered to time, quality and cost requirements supporting and influencing others to ensure that both programme outcomes are met.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have highly developed programme management skills, with experience of successfully managing and delivering complex, high value programmes. You will be extremely organised and used to working at a fast pace. You will have experience of working in cross-organisation teams and programmes, with excellent communication, influencing and negotiation skills to support this. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A brief overview of each project is provided below.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;One Workforce One Model&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Building an integrated workforce planning and development system, based on the needs and assets of the community, and supporting multi-disciplinary approaches involves agreeing your workforce objectives, mapping the existing workforce, and developing strategies to achieve patient aims and better outcomes. Delivering workforce reform, re-design, and intelligence where stakeholders work together through local engagement with the workforce across professional groups to shape and define with workforce needed for the future.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Life-Long Learning Framework&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A sustainable integrated learning framework, complementing existing structures, which will identify career pathways to support local solutions that will address the GM workforce priority areas. Collaboration across health and care will be key units to the delivery and spirit of learning environments where Organisations will have the opportunity to promote and encourage individuals to expand learning, explore personal interests, share learning experiences or build confidence to embark on a life-long learning pathway. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;For an informal discussion on the role please contact Michelle Featherstone, Workforce Transformation and Education Lead on michelle.featherstone@hee.nhs.uk&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is a Greater Manchester Health and Social Care Partnership post. Manchester CCG or Greater Manchester Combined Authority will host the employment of this post on behalf of the Greater Manchester Health &amp; Social Care Partnership (GMHSCP).&lt;/p&gt;\n&lt;p&gt;If you require the application in an alternative format please contact Hrtransactions.manchester@nhs.net&lt;/p&gt;\n&lt;p&gt;MCCG welcome applicants from all backgrounds and communities, and we particularly welcome applicants who are currently under represented in our workforce. This includes but is not limited to Black, Asian and Minority Ethnic (BAME) candidates and disabled candidates.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Manchester CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Greater Manchester Health &amp; Social Care Partnership, Piccadilly Place, Manchester", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "Programme Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247883", "validThrough": "2020-11-16T23:59:59+0000"}