{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-03T10:01:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 4 Assistant Clinical Research Practitioner - National Institute for Health Research Clinical Research Network Greater Manchester &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fixed term position for 12 months&lt;/p&gt;\n&lt;p&gt;Are you dynamic, enthusiastic, dedicated &amp; looking for a new and exciting challenge?? Why not consider joining the National Institute for Health Research (NIHR) Clinical Research Network (CRN) Greater Manchester’s Core Delivery Team.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a full time, highly motivated and enthusiastic Band 4 assistant clinical research practitioner to work within this team. The role is interesting, variable and totally different from many other research roles, in that, whilst the post is employed by and based at Manchester University NHS Foundation Trust (Oxford Road campus), you will be assigned to support any of the research teams across our network in delivering research, both covid and specialty specific, including secondary, Primary care and non-nhs settings across the CRN: Greater Manchester region. You must, therefore, be willing and able to travel independently between sites.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join the core research delivery team, led by the Delivery Team/Research Nurse manager. This role, having admin/clerical duties and also clinical will provide an opportunity for the post holder among other duties, to assist with the delivery of allocated NIHR CRN portfolio research projects and provide support and assistance to the core CRN team and partner sites throughout CRN: GM network.&lt;/p&gt;\n&lt;p&gt;A comprehensive induction, orientation and clinical research training program will be provided, as well as ongoing support.&lt;/p&gt;\n&lt;p&gt;We stress that shortlisting will be carried out according to the person specification, so please construct your personal statement accordingly when applying.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise Woodhead Gillian Cummings-FosongJob titleSenior Research NursesEmail addressLouise.woodhead@mft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Louise Woodhead Senior Research Nurse louise.woodhead@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Gillian Cummings-Fosong Senior Research Nurse gillian.cummings-fosong@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford Road Site, Greater Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Assistant Clinical Research Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253368", "validThrough": "2020-11-23T23:59:59+0000"}