{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pro rata, per annum"}}, "datePosted": "2020-11-02T14:45:38+0000", "description": "&lt;p&gt;‘Thank you for helping me grow – I wouldn’t be the psychologist I am today...”&lt;/p&gt;\n&lt;p&gt;“[BCHFT&#125; takes multi-disciplinary working to a whole new level – psychology is so valued by all of the professionals here”&lt;/p&gt;\n&lt;p&gt;“It is clear that a lot of work has taken place to increase the profile of psychology across the organisation, and enable other professionals to understand the way in which thinking psychologically could support and enhance the organisation.”&lt;/p&gt;\n&lt;p&gt;‘My experiences enabled me to develop skills in consultation, which in turn helped me to support the development of psychological thinking in the team in which I was working.... in the development of psychological thinking across team meetings, trust wide discussions and broader forums where clinical decision making was involved.’&lt;/p&gt;\n&lt;p&gt;‘The psychology team provided a number of opportunities for broadening experiences, and the roles are varied in nature. For example, there are opportunities to provide supervision, training, reflective practice, team development and individual client work.’&lt;/p&gt;\n&lt;p&gt;From the quotes from previous staff above, all of whom have gone on to secure significant promotions and career development, it is clear that BCHFT Mental Health Division Psychology is known for its commitment to helping its psychologists be the best they can be. Whatever you see as your future in psychology, BCHFT Mental Health can help you get there. With staff with national reputations in organisational change, skills and service development, and therapy there is no shortage of support for developing your career. In your role as a psychologist here, there are opportunities in leadership, in developing others, in developing advanced therapeutic skills and in organisational development and change.&lt;/p&gt;\n&lt;p&gt;Our Urgent Care psychology service (inpatient, liaison and crisis home treatment services) has a reputation for its cutting-edge, innovative practice. Having been one of the first Trusts nationally to employ dedicated inpatient psychologists in the late-90s, and in the development of Crisis Home Treatment teams, we strive to maintain and continually improve our excellent service and reputation through our commitment to co-production, integrated multi-disciplinary team working, and our recovery-promoting drive. We are highly regarded by colleagues of all professions within our services and are the ‘go to’ people for complex problems and creative ideas to make a difference to our staff and service users.&lt;/p&gt;\n&lt;p&gt;We are proud of the fact that our staff have secured significant promotions into Consultant and Principal posts across the region. These have provided the opportunity to welcome new staff into our service, staff who are equally committed to making a positive difference to our services, our staff and our service users.&lt;/p&gt;\n&lt;p&gt;So if you are ready for a new challenge and are looking for the opportunity to grow as a psychologist, if you want to be at the cutting-edge of urgent care psychology practice, and if you are committed to co-production, recovery and multi-disciplinary working, there’s a place in BCHFT for you.&lt;/p&gt;\n&lt;p&gt;We have the following vacancy:&lt;/p&gt;\n&lt;p&gt;0.8 WTE Principal Applied Psychologist (Clinical / Forensic / Counselling)&lt;/p&gt;\n&lt;p&gt;Crisis Resolution Home Treatment Team, Penn Hospital, Wolverhampton, WV 4 5HN.&lt;/p&gt;\n&lt;p&gt;This post is within a well established Crisis resolution / Home Treatment team based at Penn Hospital in Wolverhampton. Working closely with multidisciplinary colleagues the successful post holder will play a key role in direct clinical assessment , formulation and brief interventions with team clients as well as supporting the team in developing its&#39; psychological mindedness and psychologically informed practice. Supporting team members via regular reflective practice and supervision is key to the role. Strategic roles, as appropriate to the grade, will also be available to the successful applicant, allowing them to gather experience and knowledge of Divisional based project work and interventions as well as those within the Crisis team itself. This post would be well suited to someone who is flexible in their approach to psychological work and who strives to adapt and embed psychological thinking in their approach to team work. It would also be of interest to those who wish to expand their experience into strategic work aiming to support service development and governance initiatives at a wider organisational level.&lt;/p&gt;\n&lt;p&gt;For informal discussions about this post please contact:&lt;/p&gt;\n&lt;p&gt;Dr Carolyn Hurcom, Consultant Clinical Psychologist on 01902 442992 / 07816 075467&lt;/p&gt;\n&lt;p&gt;or e mail at: Carolyn.hurcom@nhs.net&lt;/p&gt;\n&lt;p&gt;or contact&lt;/p&gt;\n&lt;p&gt;Elaine Coulson, Crisis Team manager Tel: 01902 &lt;strong&gt;442970&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Elainecoulson@nhs.net&lt;/p&gt;\n&lt;p&gt;Closing date: 15th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews for this post will take place on November 24th via MS Teams.&lt;/p&gt;\n&lt;p&gt;Candidates will be asked to do a short presentation as part of their interview. The presentation topic will be shared with those candidates who are shortlisted for interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarolyn HurcomJob titleConsultant Clinical PsychologistEmail addresscarolyn.hurcom@nhs.netTelephone number07816 075467 / 01902 442992Additional contact information&lt;/p&gt;\n&lt;p&gt;Elaine Coulson, Crisis Team Manager Tel: 01902 442970&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Elainecoulson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Penn Hospital, Wolverhampton", "postalCode": "WV4 5HN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5586", "longitude": "-2.15917"}}, "title": "Applied Principal Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252481", "validThrough": "2020-11-15T23:59:59+0000"}