{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13448", "minValue": "13448", "unitText": "YEAR", "value": "Bank Level 8a"}}, "datePosted": "2020-10-13T21:00:21+0100", "description": "&lt;h2&gt;&lt;strong&gt;The World doesn’t need Superheroes, it needs Incredible People!&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Birmingham Community Healthcare NHS Foundation Trust Bank NEEDS YOU!&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Do you want to support the NHS in these unprecedented times?&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Are you passionate about care and looking for flexible working with weekly pay and NHS pension scheme membership?&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Do you want the opportunity to work in a large, diverse organisation that promotes values of being Caring, Open, Respectful, Responsible and Inclusive?&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If this appeals to you then apply now! Birmingham Community Healthcare NHS Foundation Trust (BCHC) would love to hear from you, as we are actively seeking to recruit Specialist Clinical Psychologists for a range of flexible working opportunities within Birmingham through the Trust Bank.&lt;/p&gt;\n&lt;p&gt;In Birmingham, we have about 24,000 people who have a learning disability. In our fast-paced day-to-day lives, many of them face challenges with daily living and being an active member in society. At Learning Disabilities, we are looking for Specialist Clinical Psychologists to partner with us and make a difference for our patients.&lt;/p&gt;\n&lt;p&gt;As a service, our community focus coupled with expansion of established community forensic and intensive support teams leave us well placed to meet the challenges arising from the Transforming Care agenda. We welcome applications from clinical leaders who are motivated to support the multidisciplinary team in the delivery of excellent and innovative care for the population that we serve. The Trust has recently launched Leadership programmes to support employees to realise their potential.&lt;/p&gt;\n&lt;p&gt;Come and join our Learning Disabilities Team providing services to the Adult Learning Disability population in Birmingham. Let’s partner together and make a difference for our patients.&lt;/p&gt;\n&lt;p&gt;The Trust Bank is an internal workforce solution within BCHC, providing a range of temporary staffing roles to support the Trust in delivering safe high-quality care. Temporary staffing also offers Bank Workers the flexibility to provide care with locations and shift times suitable to individual, as well as service needs with weekly competitive rates of pay.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Temporary Staffing is your solution to flexible working&lt;/strong&gt; &lt;strong&gt;in healthcare.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare Foundation Trust (BCHC) provides high quality community and specialist services within Birmingham and the West Midlands. We deliver over 100 clinical services, out in people’s homes and in over 200 healthcare settings for adults, children, people with learning disabilities, those with rehabilitation needs and also dental services. One of our key objectives is to be ‘&lt;strong&gt;a great place to work’ &lt;/strong&gt;enabling everyone within the organisation to be the best that they can be. &lt;strong&gt;‘Caring’ is at the heart of everything we do; here at BCHC we care for our colleagues and our team!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to receiving your application now!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust is committed to providing a safe working environment for all staff.&lt;/p&gt;\n&lt;p&gt;As part of the Trust’s on-going response to the management of COVID-19 secure workplaces, strict health and safety measures and infection prevention and control has been put into place. As with any healthcare setting that cares for patients, we are and remain committed to ensure that we adhere to nationally mandated infection prevention and control policies and practices, alongside the appropriate training to ensure we protect all our staff, visitors and patients and minimise/eliminate risk in line with NHS Health Governance standards. The Recruitment programmes we are undertaking are in accordance with these measures to ensure the safety of all candidates. We are committed to protecting our staff and services users from infection and encourage our staff to uptake their annual flu vaccination.&lt;/p&gt;\n&lt;p&gt;As a Trust, we offer and encourage staff to complete either a Black and Minority Ethnic (BME) risk assessments, regular COVID-19 risk assessments and/or working at home risk assessments to identify additional support measures or reasonable adjustments that may be required as appropriate. We encourage all staff to ensure they benefit from the various support measures which have been put into place which help us to support and protect our staff, visitors and patients to provide the Best Care in Healthy Communities.&lt;/p&gt;\n&lt;p&gt;These measures are within the provisions of Health and Safety and are in line with the Trust’s expectation that all staff will comply with the measures put in place and to ensure social distancing is adhered to&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B7 4BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4873", "longitude": "-1.88581"}}, "title": "Bank Level 8a Specialist Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225304", "validThrough": "2021-10-01T23:59:59+0100"}