{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa (dependent on experience)"}}, "datePosted": "2020-10-30T14:15:23+0000", "description": "&lt;p&gt;&lt;strong&gt;HR Directorate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HR Workforce Systems and Information Teams&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Workforce Information Assistant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Band 3 £19,737 - £21,142 (dependent on experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Sheffield – currently at Fulwood House &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term: 6 Months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post reference: 457-20-065-CR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Workforce Information Assistant, to support the team and a wide range of staff with HR systems. This is a key role within the workforce information team. You will mostly be working on the Electronic Staff Records (ESR) and the ID badge software (ImageBase).&lt;/p&gt;\n&lt;p&gt;You will act as a first point of contact to support staff with HR processes. You will ensure high quality workforce information is updated on ESR, communicate with staff about routine queries, inform staff at all levels about processes and policies, create ID badges and smartcards. You will work as part of a team of 4, collaboratively working with colleagues within the team and across the trust.&lt;/p&gt;\n&lt;p&gt;You will also support the workforce information team in the development of the existing systems and documenting processes.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have experience working on ESR or similar HR system, the ability to work independently and as part of a team. Strong communication, IT, numeracy and interpersonal skills are essential as you will be working closely with various stakeholders. The post holder will need the ability to build collaborative working relationships with others.&lt;/p&gt;\n&lt;p&gt;This role requires the successful candidate to be confident and experienced in dealing with data and information both in spreadsheets and large databases in addition to providing a professional customer service to staff at all levels.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities and requirements of the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for updating staff records on ESR.&lt;/p&gt;\n&lt;p&gt;Build and maintain good working relationships with a range of stakeholders&lt;/p&gt;\n&lt;p&gt;Working collaboratively as part of a team.&lt;/p&gt;\n&lt;p&gt;You must be organized, efficient and able to work using your own initiative as well as within tight time schedules. You will be responsible for providing support in line with best practice, policies and procedures. Intermediate IT skills – Microsoft Word, Outlook and Excel are required as well as excellent time management and multi-tasking skills. It is essential that the post holder is educated GCSE level (or has equivalent experience) and can demonstrate experience of working with the ESR system or similar HR systems.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sheffield Health and Social Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120808"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S10 3TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3645", "longitude": "-1.53748"}}, "title": "Workforce Information Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250494", "validThrough": "2020-11-06T23:59:59+0000"}