{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-11-02T11:01:47+0000", "description": "&lt;p&gt;&lt;strong&gt;CALLING ALL NURSES AND MIDWIVES&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;30 - 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you currently a nurse or midwife and wish to work in the community with children and their families?&lt;/p&gt;\n&lt;p&gt;Do you like the idea of learning a new role that builds on your knowledge of nursing or midwifery?&lt;/p&gt;\n&lt;p&gt;Are you passionate about supporting parents during the transition to parenthood?&lt;/p&gt;\n&lt;p&gt;Are you interested in developing skills in assessment of child development and seeing a range of families from antenatal period to children starting school?&lt;/p&gt;\n&lt;p&gt;We are looking for a enthusiastic individuals to join us in the Tunbridge Wells Health Visiting Team .&lt;/p&gt;\n&lt;p&gt;The successful candidates will work as members of the corporate Health Visiting team - working collaboratively with Children&#39;s Centres, Midwives and GP&#39;s.&lt;/p&gt;\n&lt;p&gt;We welcome candidates who are qualified midwives, mental health nurses, paediatric nurses, adult nurses. You will be well supported and offered specific training for this role, which involves attending a University course in public health as well as a mentor in practice to shadow and learn from.&lt;/p&gt;\n&lt;p&gt;Kent Community Health NHS Foundation Trust is one of the largest healthcare providers in the country and we know how important it is to make sure our children and families are getting the right support and care.&lt;/p&gt;\n&lt;p&gt;Here are 10 great reasons to come and work for us:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;We are committed to providing the best care for our clients and their families.&lt;/li&gt;\n&lt;li&gt;We listen to you, value you and embrace new ideas - we want all colleagues to contribute to the direction of the service.&lt;/li&gt;\n&lt;li&gt;We value our colleagues and are committed to your professional development - we want you, and your career, to flourish.&lt;/li&gt;\n&lt;li&gt;We offer excellent training and support further education. This role requires you to complete 2 bespoke modules at Canterbury Christchurch University to support your transition into your new post.&lt;/li&gt;\n&lt;li&gt;We operate a flexible working policy and would welcome applications for both part-time and full-time hours.&lt;/li&gt;\n&lt;li&gt;We offer amazing benefits to our colleagues, such as: Salary sacrifice schemes for bikes, cars and home electronics – our very own fitness programme, childcare vouchers, discounts at a number of high street retailers and a fast-track physiotherapy service.&lt;/li&gt;\n&lt;li&gt;We pledge to change the way we think and act about mental health and have invested in our time to change champions.&lt;/li&gt;\n&lt;li&gt;We believe in using quality improvement tools to &#39;cut the red tape&#39;, implement news ideas and reduce bureaucracy.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We are rated &#39;Outstanding&#39; by the Care Quality Commission&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;We CARE.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;If you are motivated, dedicated and compassionate, and are ready for a new challenge - Apply!&lt;/p&gt;\n&lt;p&gt;Please take a look at this document, note page 32 which explains the Universal Service that a successful Community Public Health Nurse will deliver, once trained...&lt;/p&gt;\n&lt;p&gt;assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/167998/Health_Child_Programme.pdf&lt;/p&gt;\n&lt;p&gt;We look forward to reading your application!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews will be held on the&lt;strong&gt; 8th December 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please do not hesitate to contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Sharon Le Pere -District Manager / Tunbridge Wells Health Visiting Team&lt;/p&gt;\n&lt;p&gt;Mobile: 07880 054 513&lt;/p&gt;\n&lt;p&gt;Email: sharon.lepere@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tunbridge Wells &amp; Gravesend, Tunbridge Wells District covering Paddock Wood &amp; Cranbrook", "postalCode": "TN2 5HU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1149", "longitude": ".268031"}}, "title": "Community Public Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251701", "validThrough": "2020-11-26T23:59:59+0000"}