{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16778", "minValue": "16778", "unitText": "YEAR", "value": "£16,778"}}, "datePosted": "2020-10-26T16:33:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Turning Point, we support people across the UK with substance misuse problems. As a Support Worker, you’ll make a real difference to their lives as you provide support and advice to help each and every one of our service users achieve their potential. Passionate about people, you’ll enjoy the scope and support to enhance your own life too, as you make this role your own as part of a hard-working and friendly team.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of our Support Workers, you’ll be 100% committed to making sure that people with substance misuse problems have the best start at the very outset of their journey to independent living. So, in this hands-on role, you’ll support people to perform a wide range of day-to-day activities through one-to-one key work, NEX / harm reduction advice/interventions and working with treatment providers and other partners to support involvement in the local community.&lt;/p&gt;\n\n\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You’ll need a good knowledge of issues related to substance misuse, as well as a genuine passion for the field. Although previous relevant experience, on either a voluntary basis or as a paid employee is preferable, most important is that you’re flexible, patient and able to view situations from a service user’s perspective. As you’d expect, good moral values will be key. Situations can sometimes be difficult and challenging, so you’ll need to be non-judgemental, with a sensitive approach and a good understanding of how to meet complex needs related to substance misuse.&lt;/p&gt;\n&lt;p&gt;At a practical level, you’ll need good IT and communication skills.  On top of our regular 9-5 service hours, you must also be prepared to work one late evening and Saturday mornings on a rota basis.&lt;/p&gt;\n&lt;p&gt;Running services on a not-for-profit basis, we invest every penny back into our care – and our people. So, if you’re ambitious and focused on helping people with substance misuse issues, progress a Support Worker role with real value.&lt;/p&gt;\n\n\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from &lt;em&gt;Investors in People&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;28 days’ paid holiday a year, increasing with each year of service up to 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 3AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6844", "longitude": "-1.4971"}}, "title": "Support Worker - Wakefield Inspiring Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243453", "validThrough": "2020-11-09T23:59:59+0000"}