{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-06T14:46:07+0000", "description": "&lt;p&gt;Band 5 Advert PACU 2&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are currently seeking enthusiastic and highly motivated Registered Nurse/ODP to join our busy Admission and Discharge team at the Lister Treatment Center, Lister Hospital, Stevenage. The successful post holder will need to be an experienced Band 5 Nurse or Practitioner with previous theater/surgical ward experience.&lt;/p&gt;\n&lt;p&gt;Lister Treatment Center is a modern state of the art building and has 6 theaters, 2 recovery areas and a Discharge Lounge. We undertake various specialities including Orthopaedic, General Surgery, Urology, Plastic Surgery, Gynaecology, Plastics and Ophthalmology. The Treatment Centre cares for a range of day surgery and in-patient cases across all of our specialities.&lt;/p&gt;\n&lt;p&gt;The ward is known as the Post Anaesthetic Care Unit Two (PACU2). The unit is attached to a six theater department, admitting and discharging patients post surgery. PACU2 opens at 07:00am and closes at 21:30pm once all the patients have been discharged from the unit. Successful post holder will be expected to work within these hours to include weekends and be committed to an on-call service.&lt;/p&gt;\n&lt;p&gt;The Treatment Center is fast paced department our Team members are expected to be well organised and have the ability to manage time effectively.&lt;/p&gt;\n&lt;p&gt;At East and North Hertfordshire NHS Trust we are looking to be amongst the best. The Trust has embarked upon a period of significant change enabled by a £150m investment; one of the biggest transformation and improvement programmes in the country.&lt;/p&gt;\n&lt;p&gt;In the autumn of 2014 all acute services were centralized at the Lister Hospital in Stevenage, Hertfordshire, placing the Trust in a position to deliver clinical services that are amongst the very best.&lt;/p&gt;\n&lt;p&gt;We pride ourselves in our determination to go that extra mile for our patients and we are keen to continue this excellent level of care.&lt;/p&gt;\n&lt;p&gt;This role offers huge potential to further develop up Nursing/ODP career. We provide support to our Nurses/ODPs so they can build upon their existing clinical, leadership and management skills.&lt;/p&gt;\n&lt;p&gt;Additional benefits provided by the Trust include excellent annual leave entitlement, the NHS Pension Scheme, Accommodation, Shopping Discounts and Employee friendly benefits. The Turst also offers further career development opportunities like our Trusts’ Organizational Development Programme (LEND).&lt;/p&gt;\n&lt;p&gt;If you are interested in the role, we would encourage you to make an appointment to come and visit the unit and see our bright, spacious facilities for yourself. You can contact Dawn Woods - dawn.woods2@nhs.net to arrange an informal visit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Note - Interview is scheduled for 16-Dec-2020 from 9.30am.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dawn Woods, Theatre Team Manager&lt;/p&gt;\n&lt;p&gt;Email address : dawn.woods2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number : 01438288130&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lister Hospital, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Theatre Practitoner - Treatment Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260180", "validThrough": "2020-11-20T23:59:59+0000"}