{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-03T13:45:17+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Pharmacy Technician&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Band 5 - £24,907 - £30,615 per annum pro rata [Bank]&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Royal Papworth Hospital is looking for Pharmacy Technicians to join us on a flexible basis to support our dispensary and ward-based clinical pharmacy teams.&lt;/p&gt;\n&lt;p&gt;We are looking for pharmacy technicians with experience of working in the hospital environment to help us provide patient-focused pharmaceutical care in our specialist cardiology and cardiac surgery wards. Typical activities include review of medicines on discharge, counselling patients on their new medicines and supporting the medicines reconciliation process. Candidates would also be expected to support out dispensary service, dispensing and checking items against inpatient, discharge and outpatient prescriptions.&lt;/p&gt;\n&lt;p&gt;The pharmacy department at Royal Papworth is a small, friendly team working in a new, purpose-built hospital. We are a digitally enabled department, with electronic prescribing in place in all areas and a robot to support a safe and timely dispensing process. We are keen to support all of our team to expand their roles and provide the highest quality of pharmaceutical care and provide in-house training and competency frameworks to support this.&lt;/p&gt;\n&lt;p&gt;If you are a registered Pharmacy Technician with experience in hospital pharmacy who is keen to join our friendly team on a flexible basis, then we very much look forward to discussing opportunities with you.&lt;/p&gt;\n&lt;p&gt;If you would like any further information please contact: Christopher McCorquodale (Deputy Chief Pharmacist) christopher.mccorquodale@nhs.net  or 01223 638179.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Papworth Road, Cambridge Biomedical Campus, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Pharmacy Technician - Bank", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254180", "validThrough": "2020-11-19T23:59:59+0000"}