{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 £45,780 - 51,393 pa inc HCAS"}}, "datePosted": "2020-11-02T15:46:03+0000", "description": "&lt;p&gt;Employer: St George’s University Hospitals NHS Foundation Trust Department: Speech and Language Therapy&lt;/p&gt;\n&lt;p&gt;Grade: Band 7&lt;/p&gt;\n&lt;p&gt;Full time: 1.0 WTE&lt;/p&gt;\n&lt;p&gt;6 Months Contract ________________________________________ St. George’s University Hospitals NHS Foundation Trust is one of the UK’s largest healthcare organisations and is integrated with Community Services Wandsworth. The Trust shares its main hospital site in south west London with St George’s University of London, and is linked to Kingston Faculty of Health and Social Care Sciences. St George’s has an established national and international reputation as a leading hospital for specialist care including neurosciences, cardiac care, stroke and cancer. We also provide excellent local care to the residents of Wandsworth, and regional care as both an acute, hyper acute stroke unit and trauma centre. As well as acute hospital services, St George’s Healthcare provides a wide variety of specialist and community hospital based care and a full range of community services to children, adults, older people and people with learning disabilities. These services are provided from Queen Mary’s Hospital, Roehampton, 11 health centres and clinics, schools and nurseries, patients’ homes and Wandsworth Prison. We employ 8,000 staff, have an annual income of c£620m, around 1,100 beds and we serve a population of 1.3 million across south west London. ________________________________________&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has become available for a highly skilled Speech and Language Therapist (SLT) specialising in critical Care and medicine to join the team at St George’s Hospital. The post holder will have experience working in acute medicine, critical care and managing dysphagia and communication in patients with a tracheostomy. The post holder will have advanced communication and negotiation skills and be a strong team player.&lt;/p&gt;\n&lt;p&gt;The post holder will collaborate closely with the multidisciplinary team, supported by the SLT Team Leads in conjunction with the wider SLT team. The post holder will provide and receive regular clinical supervision and support to enhance specialist clinical skills. They will be joining a highly proficient, professional, patient centred and innovative Speech and Language Therapy team offering excellent support and well established CPD opportunities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise BarrettJob titlePrincipal Speech and Language TherapistEmail addresslouise.barrett0@stgeorges.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;For more information regarding this post please contact &lt;strong&gt;Louise Barrett – Principle Speech and Language Therapist, Acute and Community &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;louise.barrett0@stgeorges.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Highly Specialised Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252695", "validThrough": "2020-11-16T23:59:59+0000"}