{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 - £53,459 pro rata per annum"}}, "datePosted": "2020-11-06T15:16:10+0000", "description": "&lt;p&gt;Due to the retirement of our existing Lead Diabetes Specialist Nurse an exciting opportunity has arisen for a highly driven, motivated and passionate diabetes Clinical Nurse Specialist to Lead the Diabetes Service at Darent Valley Hospital.&lt;/p&gt;\n&lt;p&gt;You will join a dedicated team who carry nursing responsibility for both the inpatient and outpatient caseload. You will be required to work as a highly skilled practitioner having responsibility for your own clinical case load whilst working closely with the Consultant Endocrine/Dialectologists to develop and deliver high quality diabetes services across the Trust.&lt;/p&gt;\n&lt;p&gt;The service provides a number of routine and specialist clinics including, preconception, antenatal, renal, insulin pump, young adult and transition. The team also hold responsibility for managing routine and urgent ward referrals and providing both opportunistic and organised education to ward staff and the MDT.&lt;/p&gt;\n&lt;p&gt;As a team, we are very driven and are extremely supportive of each other; we understand the challenges that we collectively face and work together to provide high quality care to all our patients. There is no doubt that this is a demanding role working in a very fast-paced environment; however, for the right individual it would be a very rewarding role and one which you could really make your own.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCaroline BatesJob titleAssociate Director of Nursing and TherapiesEmail addresscaroline.bates1@nhs.netTelephone number01322 428824&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121400.png", "name": "Dartford and Gravesham NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darent Valley Hospital, Dartford", "postalCode": "DA2 8DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4351", "longitude": ".25819"}}, "title": "Lead Diabetes Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260311", "validThrough": "2020-11-15T23:59:59+0000"}