{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33779", "minValue": "31365", "unitText": "YEAR", "value": "£31,365/£33,779/£37,890"}}, "datePosted": "2020-10-14T14:03:35+0100", "description": "&lt;p&gt;An exciting opportunity to work across the County and develop partnerships with Adult Social Care and 3rd Sector services.  We are looking to fill 2 positions in the Community Learning Disability Team in the City Locality.&lt;/p&gt;\n&lt;p&gt; &lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Whilst a full Job and Person Spec is attached to this vacancy, key elements include (but aren’t limited to):&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contribute to care quality performance and clinical activity by providing professional nursing leadership and guidance, clinical advice and management in relation to the key dimensions of health care quality:\n&lt;ul&gt;\n&lt;li&gt;Patient safety&lt;/li&gt;\n&lt;li&gt;The effectiveness of all health care interventions&lt;/li&gt;\n&lt;li&gt;Patient experience&lt;/li&gt;\n&lt;li&gt;The environment in which care is delivered&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;Participate in the effective clinical leadership and management of the team.&lt;/li&gt;\n&lt;li&gt;Act as role model, mentoring, teaching, assessing and supporting students and learners on placement and participate in the education, development and mentorship of other staff.&lt;/li&gt;\n&lt;li&gt;Work collaboratively with other senior nurses across LPT as appropriate and promote the role of their speciality nursing to all stakeholders.&lt;/li&gt;\n&lt;li&gt;Foster a culture of networking in an open and transparent approach with internal and external partnership’s and between all stakeholders.&lt;/li&gt;\n&lt;li&gt;Responsible for the assessment, planning, implementation and evaluation of programmes of evidenced based care to a group of patients according to changing healthcare needs and varying levels of complexity.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Successful applicants will have&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualifications and experience as highlighted in the Person specification&lt;/li&gt;\n&lt;li&gt;Demonstrable motivation and enthusiasm,  with experience of working with people with a learning disability&lt;/li&gt;\n&lt;li&gt;Demonstrable experience of assessment of needs, development, implementation and evaluation of programmes of care for people with learning disabilities who may also experience associated conditions such as mental health issues, profound and multiple disabilities, dementia, and challenging behaviour&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;strong&gt;The Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Community Learning Disability Teams are Multi-Disciplinary Team working alongside OT’s, Physiotherapists, Speech and Language Therapists, Psychologists and Psychiatrists.&lt;/p&gt;\n&lt;p&gt; These positions provide the opportunity to develop skills in specialist Learning Disability nursing, mentoring students, pathway working and multi-disciplinary work whilst being part of a supportive team.&lt;/p&gt;\n&lt;p&gt; We will provide regular clinical supervision and you will be supported to continue your professional development.&lt;/p&gt;\n&lt;p&gt; Both posts are full time and the usual working pattern is Mon-Fri 8.30-4.30&lt;/p&gt;\n&lt;p&gt; If you require any further information or would like to discuss anything, please contact Kay Iliffe, on 07774170393 or Heather Crozier on 07808130469&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE4 8PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6765", "longitude": "-1.10301"}}, "title": "Band 6 Community Learning Disability Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226600", "validThrough": "2020-11-08T23:59:59+0000"}