{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110667", "minValue": "82096", "unitText": "YEAR", "value": "£82,096-110,667 per annum"}}, "datePosted": "2020-10-16T13:16:26+0100", "description": "&lt;p&gt;Applicants are invited to apply for a substantive consultant post in Urology at Barking Havering and Redbridge University Hospitals. We are looking for a highly motivated person with specialist interest in Endourology and Stone Surgery.&lt;/p&gt;\n&lt;p&gt;BHRUT is one of the largest Associate Teaching Hospitals, providing acute care for over 700,000 people from across 2 main sites – Queens and King George Hospitals, as well as peripheral sites at Barking, Dagenham and Brentwood. We are a major Neurosciences centre, and are undergoing significant further development as a tertiary referral centre for North East London and Essex, including additional critical care capacity.&lt;/p&gt;\n&lt;p&gt;In addition, our Trust is in an excellent location, close to Central London and well situated in the South East of the UK. As well as all the advantages of being close to the city, you will discover that Essex has beautiful countryside as well as excellent schools, transport links, amenities and residential areas. The Trust has on-site nursery facilities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Mr Shailesh Kulkarni Job title Consultant Urologist and Clinical Lead Email address Shailesh.kulkarni@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens, London", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Consultant Urologist with interest in Endourology &amp; Stone Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230372", "validThrough": "2020-11-15T23:59:59+0000"}