{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata for part time"}}, "datePosted": "2020-10-23T10:02:01+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Clinical Nurse Specialist to join our developing nurse led Inflammatory Bowel Disease (IBD) service at Sheffield Teaching Hospitals. The post holder will be part of a team delivering key directorate targets for IBD patients.&lt;/p&gt;\n&lt;p&gt;The Sheffield IBD service is a tertiary referral centre providing specialist IBD care to people with Ulcerative Colitis or Crohn’s disease from the Yorkshire region and surrounding areas.&lt;/p&gt;\n&lt;p&gt;The IBD team works across inpatient and day-case settings with the majority of our patients being managed in outpatient clinics and via the telephone advice service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have the opportunity to develop their knowledge and skills in caring for patients with IBD working with an experienced team and within a competency framework.&lt;/p&gt;\n&lt;p&gt;Applicants will need to demonstrate excellent organisational and communication skills and a real desire to contribute to the long term development of the service. The applicant must also demonstrate commitment to their continued personal/professional development.&lt;/p&gt;\n&lt;p&gt;This role is exempt from the Rehabilitation of Offenders Act and/or a regulated activity. Therefore the Trust legally requires any successful candidates entering into this role to complete a Disclosure &amp; Barring Service (DBS) check. Therefore, successful candidates will be required to complete a DBS application form. On completion of this process you will be required to present your DBS certificate to the Human Resources Department to evidence that you can satisfactorily comply with this clearance.&lt;/p&gt;\n&lt;p&gt;Please ensure you read the DBS Employee Guidance Document at the foot of the NHS Jobs page, which provides further guidance on the requirements for this check and your responsibilities in complying with this check should you be successful at interview.&lt;/p&gt;\n&lt;p&gt;This vacancy is advertised as one permanent post and one on a fixed term contract basis for a period of a maximum of twelve months due to maternity leave of the substantive post holder. The fixed term contract status of the post holder will be reviewed in accordance with the Trust&#39;s legal obligations regarding fixed term contracts and statutory maternity provisions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Kerry Robinson&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Email: kerry.robinson6@nhs.net&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Telephone: 0114 271 13177&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Janice Dalgarno &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Endoscopy Matron &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;janice.dalgarno@nhs.net&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Telephone: 0114 271 14473 or 27 11753.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As part of the recruitment process at application stage, Sheffield Teaching Hospitals will assess applicants’ individual values and behaviours to ensure that these behaviours align with our PROUD values: Patient First, Respectful, Ownership, Unity and Deliver.&lt;/p&gt;\n&lt;p&gt;Our values are what help to make us different and ‘a Brilliant Place to Work’. We expect all our employees to share our values and demonstrate them in every aspect of their role.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake an online values assessment at application stage and the results of this assessment will be used as part of the on-going selection process to assess your suitability for the post.&lt;/p&gt;\n&lt;p&gt;The deadline for completing the online assessment is midnight 21/11/2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The link to the assessment can be found below, the address can be copied and pasted into a search engine e.g. google:&lt;/p&gt;\n&lt;p&gt; login.talentqgroup.com/Login/SelfService/VGQPTXZWXL&lt;/p&gt;\n&lt;p&gt;If you have any queries, require any assistance to complete this assessment or have already completed it within the past 12 months, please contact the Trust Recruitment Team at &lt;strong&gt;sth.centralrecruitment@nhs.net&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Hallamshire Hospital, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Clinical Nurse Specialist (Inflammatory Bowel Disease)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239947", "validThrough": "2020-11-08T23:59:59+0000"}