{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-06T13:30:18+0000", "description": "&lt;p&gt;We are looking to recruit a Dietitian to join our friendly and pro-active department.&lt;/p&gt;\n&lt;p&gt;You will work in partnership with South Tyneside Clinical Commissioning Group and work collaboratively with Dietetic services, GP practices, patients and carers to improve the quality and cost effectiveness of prescribing by promoting food first and appropriate use of ONS.&lt;/p&gt;\n&lt;p&gt;A large part of this Post will be engagement with care homes across South Tyneside to include training and supporting patients and staff in these settings. You will work alongside a Dietetic Support Worker and with this, you will get the opportunity to line-manage this member of staff. You will work alongside colleagues who support care homes &amp; Community. The nature of this Post will result in you being encouraged to attend conferences and to network with medicines management Dietitians within the UK.&lt;/p&gt;\n&lt;p&gt;The Dietetic Department of more than 55 staff is managed as one team, but is structured into smaller teams led by Senior Specialist Dietitians. We are actively involved in the training of Trainee Dietitians and offer A, B and C placements.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121061.jpg", "name": "South Tyneside and Sunderland NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121061"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Shields", "postalCode": "NE34 0PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9719", "longitude": "-1.42994"}}, "title": "Specialist Dietitian - Care Homes / Community", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259913", "validThrough": "2020-11-20T23:59:59+0000"}