{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pro rata per annum"}}, "datePosted": "2020-11-06T13:31:30+0000", "description": "&lt;p&gt;Kent Community Health NHS Foundation Trust has great opportunities for friendly and motivated people who want to work in a busy, caring Children&#39;s Therapies Department. Children&#39;s Therapies comprises of clinicians of different disciplines - physiotherapists, speech and language therapists, occupational assistants, therapy assistants and care co-ordinators with close links with our dietitian, paediatricians and colleagues from acute settings. We have recently been rated Outstanding by the CQC and are proud of the services we offer.&lt;/p&gt;\n&lt;p&gt;Our philosophy is to keep the patient at the heart of everything we do. Every person that works for our Service, regardless of their role, comes into contact with our patients and visitors and so is expected to uphold our values of caring with compassion, listening, responding, empowering and striving for excellence at all times. We look for people who are willing to go the extra mile, not because they are asked to, but because they are committed to being part of a healthcare team that delivers an excellent caring service to our patients.&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated and flexible administrator to work within the Children&#39;s Therapies in West Kent (Maidstone, Malling, Tonbridge, Tunbridge Wells and Sevenoaks) - primarily based in Maidstone but also from other venues and/or home if the service requires it.&lt;/p&gt;\n&lt;p&gt;The role will encompass a variety of administration skills to deliver a comprehensive administration service within a busy office environment.&lt;/p&gt;\n&lt;p&gt;It is essential that you are highly proficient in IT skills including Word, Excel and email, with excellent communication and interpersonal skills and have previous experience with an EPR (Electronic Patients Record) system. The role is interesting and varied but extremely busy and includes answering the telephone, booking appointments, managing waiting lists and maintaining a patient database, data collecting and reporting to senior managers. You must be able to work flexibly to meet the needs of the team and the service, produce accurate work, meet deadlines and be able to work on your own as well as part of a team.&lt;/p&gt;\n&lt;p&gt;Successful applicants are required to have the qualification level specified in the person specification in order to carry out the job, however, we do welcome applicants from individuals wishing to further their knowledge and skills and to gain this recognised qualification, which we will support. So if you do not have the essential qualification for the role, this will not be an barrier to you being offered an interview.&lt;/p&gt;\n&lt;p&gt;If you are successful at interview but do not have the essential qualification for the role, we will employ you as trainee and will support you to gain this qualification. You will develop new skills and knowledge whilst working with an established team, gaining valuable work experience and continuing to get paid. Once you receive the qualification you will automatically move into the position advertised&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews will be held on &lt;strong&gt;Thursday 3rd December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of the interview process there will be a literacy and numeracy test if you are successful.&lt;/p&gt;\n&lt;p&gt;Applications for full time, part time and job share will be considered.&lt;/p&gt;\n&lt;p&gt;You will have to be able to travel across the Trust in a timely manner.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ellie Macdonald - Administrative Operations Manager&lt;/p&gt;\n&lt;p&gt;Email: elliemacdonald@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone: 07870 375245&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Maria-Loukia Bratsou - Locality Manager&lt;/p&gt;\n&lt;p&gt;Telephone: 01622 742333&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heathside Centre, Coxheath, Maidstone", "postalCode": "ME17 4AH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.232", "longitude": ".497974"}}, "title": "Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259937", "validThrough": "2020-11-24T23:59:59+0000"}