{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-14T11:32:10+0100", "description": "&lt;p&gt;&lt;strong&gt;KINGSTON HOSPITAL NHS FOUNDATION TRUST&lt;br /&gt;Division of Specialist Services&lt;br /&gt;Service Line – Surgery and Urology&lt;br /&gt;Consultant Urological Surgeon&lt;br /&gt;Full-Time (10 PAs) 1 Year Fixed Term Contract &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Kingston Hospital is in an attractive part of Surrey and is within easy reach of Central London, Richmond Park, the river Thames, the historic Royal Borough of Kingston-upon-Thames, and open countryside. The Hospital was the first hospital to become a Foundation Trust in South West London and is currently rated Outstanding by the CQC. &lt;br /&gt;&lt;br /&gt;The urology department at Kingston Hospital NHS Foundation Trust is a cohesive forward thinking department. It consists of six consultants with special interests including stones, laparoscopic renal surgery; urological cancer; paediatric urology and female urology. This 7th consultant post will be supplement the existing team and the successful candidate will be expected to develop a subspecialty interest.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Kingston Hospital NHS Foundation Trust provides a full range of diagnostic and treatment services supporting some 320,000 people in the surrounding areas including the Boroughs of Kingston, Richmond, Roehampton and other parts of South West London. We have a national reputation for innovative developments in healthcare, particularly in patient-focused emergency care and maternity services.&lt;br /&gt;&lt;br /&gt;For further information, including the job description and person specification, please use the online application system via NHS Jobs and BMJ Careers to include the names and contact details of referees (that should cover your last 5 years of employment), one of whom should be from your current or last employer.&lt;/p&gt;\n&lt;p&gt;It is anticipated that the interview will be in November 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alternatively please contact Sarb Sandhu, (sarbjinder.sandhu@ nhs.net), Nadine Coull (nadine.coull@nhs.net) or Rob Jeffries, General Manager, Cluster 6 (r.jeffries@nhs.net) or Joanne Dowse, Deputy General Manager (joanne.dowse@nhs.net) for informal discussions about the role.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston Hospital NHS Foundation Trust, Kingston", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Locum Consultant Urological Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226010", "validThrough": "2020-11-08T23:59:59+0000"}