{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18185", "unitText": "YEAR", "value": "£18,185 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-05T13:16:25+0000", "description": "&lt;p&gt;Applications are invited from enthusiastic, innovative, motivated and suitably qualified individuals for the post of Band 2 Healthcare Assistant to assist in the delivery of person centred care, undertaking swab testing of the local population. The roles will be based in the Liberty Stadium, Plasmarl, Swansea, SA1 2FA and Longlands Lane Playing Fields, Margam, Neath Port Talbot, SA13 2NR, with the requirement to travel between sites across the Health Board.&lt;/p&gt;\n&lt;p&gt;Several posts are available and may be on a full or part time basis, with hours to be agreed with the appointing manager, in line with service delivery requirements. Please note that the service currently runs over 7 days per week.&lt;/p&gt;\n&lt;p&gt;An understanding of confidentiality is essential. Experience of working within the NHS as well as knowledge of Health Systems is desirable, but an enthusiastic attitude and willingness to learn is also very important.&lt;/p&gt;\n&lt;p&gt;The applicants must possess a Qualification Credit Framework - QCF Level 2 (formally NVQ Level 2) in Health or have the equivalent knowledge, skills and experience acquired through induction and on the job training, and be willing to complete QCF qualification within an agreed timeframe. Applicants must also have knowledge and understanding of the Code of Conduct for Healthcare Support Workers in Wales, and of the fundamental aspects of care and the importance of the promotion of health and wellbeing. Applicants must also understand the principles of confidentiality, consent prior to undertaking care and of Safeguarding adults/children.&lt;/p&gt;\n&lt;p&gt;The successful individual will need to be a hard working, team player with good verbal and written communication skills. The applicant will be required to have a flexible approach towards the needs of the service and be able to travel between sites in a timely manner.&lt;/p&gt;\n&lt;p&gt;The ability to prioritise work to meet deadlines and the ability to work without supervision is essential for this post.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and / or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;This post is fixed term until 31/03/2021 and the start date is as soon as possible.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Ruth Gates&lt;/p&gt;\n&lt;p&gt;Job title: Learning and Development Project Manager&lt;/p&gt;\n&lt;p&gt;Email address: ruth.gates@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01792 530631&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community, Neath Port Talbot", "postalCode": "SA12 7BR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6134", "longitude": "-3.81599"}}, "title": "Healthcare Assistant - Testing Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257837", "validThrough": "2020-11-12T23:59:59+0000"}