{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 gross per annum"}}, "datePosted": "2020-11-03T11:46:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Help us care for the people who care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Norfolk and Suffolk Foundation Trust is on an improvement journey with a new Board and a refocused sense of direction. Our ambition is to be in the top quartile of Mental Health Trusts by 2023. This is where you come in….Great ambitions require great staff!&lt;/p&gt;\n&lt;p&gt;We are a large multi-site NHS mental health and learning disabilities service provider with over 4,000 staff, based across Norfolk and Suffolk.&lt;/p&gt;\n&lt;p&gt;We’re looking for an inspiring professional HR leader to join our established HR team who is excited about the role HR can play in improving clinical services.&lt;/p&gt;\n&lt;p&gt;As part of the senior HR team, you will be responsible for leading our HR Business Partnering Team as specialist strategic partners within our geographically based clinical Care Groups. The Business Partners will work with local leadership teams to identify workforce and culture issues and develop and implement impactful plans. You will need a good breadth of HR knowledge, including expertise in organisational change.&lt;/p&gt;\n&lt;p&gt;You will also support the Employee Relations Manager and team in developing and delivering great people processes. We are working hard to embed compassionate leadership within the Trust and need someone who is appropriately people focused and is able to embed robust governance without being a ‘slave’ to process.&lt;/p&gt;\n&lt;p&gt;In addition to the above, you will also lead on the development and delivery of aspects of our People Plan and will have regular exposure to working with senior managers, including Executive Directors.&lt;/p&gt;\n&lt;p&gt;We need someone who is a great HR generalist and pragmatist, ideally with experience in a large complex organisation. In keeping with our trust values of Positively, Respectfully and Together, we are looking for someone who has exceptional people skills. You will need to be able to effectively work with, and influence, a diverse range of people at all levels of the organisation, as well as being comfortable with change and doing things differently.&lt;/p&gt;\n&lt;p&gt;If you want to make a difference in people’s experience at work by putting people before process, we want you to be part of our fantastic team!&lt;/p&gt;\n&lt;p&gt;It is important that our HR team reflects the diversity of our local communities. We welcome applications from all talented individuals with the relevant qualifications, skills, knowledge and experience and encourage applications from men, BAME and disabled candidates.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Interviews will be on the 23rd November 2020, candidates may only be given a minimum of 3 days’ notice, please note this date is provisional and may be subject to change. You will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please visit out Facebook and Twitter page @NSFTjobs&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah GoldieJob titleHead of Human ResourcesEmail addresssarah.goldie@nsft.nhs.ukTelephone number01603 421233&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hellesdon Hospital, Norwich", "postalCode": "NR6 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6596", "longitude": "1.25089"}}, "title": "Head of Human Resources Business Partnering", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253801", "validThrough": "2020-11-15T23:59:59+0000"}