{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa pro-rata"}}, "datePosted": "2020-10-26T15:16:01+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Paediatric and or/adult critical care band 5 nurse&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;2020 is the Year of the Nurse – so why not make it your year by kick-starting it with a career in critical care nursing where a fantastic journey and exciting opportunities await you.&lt;/p&gt;\n&lt;p&gt;If you are an interested, motivated and enthusiastic nurse then why not come and join our existing Critical Care Team.&lt;/p&gt;\n&lt;p&gt;We don’t just want you to come here and work, we want you to stay here long term. So, if you are hardworking, ambitious, motivated, compassionate and really care about excellence for patients and staff, come and join our team, develop yourself, and make a real difference.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have 4 established Paediatric high dependency beds on Birmingham heartlands site and a Paediatric holding bed on the established children’s assessment unit on Good Hope site.&lt;/p&gt;\n&lt;p&gt;We admit patients from our busy emergency departments across sites, following surgery and from the inpatient wards, as well as tertiary referrals from neighboring PICU’s.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work with us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We recognize that our staff are our most precious resource and we are committed to you reaching your potential by offering a structured development and education pathway. We have an experienced, well-resourced practice development and education team and your development and learning will be supported by your allocated team of mentors, team leaders and line manager.&lt;/p&gt;\n&lt;p&gt;We can offer successful candidates:&lt;/p&gt;\n&lt;p&gt;• An excellent structured preceptorship programe supported by a period of supernumerary practice.&lt;br /&gt; • Regular study and learning opportunities working with our education team and support in the clinical area&lt;br /&gt; • Flexibility in shift patterns&lt;br /&gt; • Friendly and supportive workplace &lt;br /&gt; • Extensive and varied clinical experience and development of Critical Care skills &lt;br /&gt; &lt;br /&gt; You should be a Registered Paediatric Nurse or a registered nurse with critical care experience. You should have good interpersonal, communication and organizational skills and be able to work effectively as a member of our critical care team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Laura Cook or Sally Scott Senior Sister on 0121 424 3389&lt;/p&gt;\n&lt;p&gt;Closing date 8th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews will be held on 20th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;At University Hospitals Birmingham we support flexible working and welcome applications from nurses seeking flexible working opportunities and family friendly working hours&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 5 Staff Nurse - Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243086", "validThrough": "2020-11-08T23:59:59+0000"}