{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T17:15:34+0000", "description": "&lt;p&gt;We are curently recruiting to a number of vacancies within our multi site, physiotherapy rotation which we have recently expanded to include a number of additional community settings.&lt;/p&gt;\n&lt;p&gt;The rotation currently comprises of multi-site provisions for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Stroke and Neuro Rehabilitation in both in-patient and community based settings: Acute Stroke Unit, Stroke Rehabilitation and Early Supported Discharge Teams&lt;/li&gt;\n&lt;li&gt;In-patient Respiratory, including ICU ( childrens and adult services)&lt;/li&gt;\n&lt;li&gt;Acute In-patient Therapies including Orthopaedics (elective and trauma - including a fractured neck of femur ward), elderly medicine, general medicine, respiratory and cardiology.&lt;/li&gt;\n&lt;li&gt;General Surgery&lt;/li&gt;\n&lt;li&gt;Community Reablement Services&lt;/li&gt;\n&lt;li&gt;Early Supported Discharge&lt;/li&gt;\n&lt;li&gt;Intermediate Care Beds&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a Band 5 Physiotherapist, you will be supported through local preceptorship and induction, clinical and day-to-day supervision from a dedicted supervisor and fellow colleagues of same and senior grades in physiotherapy. Other professions may also contribute to your teaching and learning in the role.&lt;/p&gt;\n&lt;p&gt;We encourage and faciliate CPD activities and support staff to be involved in service development with senior colleagues.&lt;/p&gt;\n&lt;p&gt;All physiotherapists are expected to undertake on call respiratory duties, following a period of supported learning and completion of a series of supported and budied on call sessions until they are confident and competent in this aspect of the role. Training and development in this area is comprehensive and robust, delivered and supported by a number of highly skilled and experienced clinicians specialising in the respiratory field.&lt;/p&gt;\n&lt;p&gt;Regardless of rotation speciality, you will work as part of a wider MDT and will in time, manage your own caseload with appropriate support, including that provided by our highly experienced and skilled support staff.&lt;/p&gt;\n&lt;p&gt;Many of our services operate across a 7 day working roster and applicants will be expected to participate in weekend working for which days off in the week will be provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnthony DawsonJob titleIn Patient Therapy Team LeaderEmail addressanthony.dawson@cht.nhs.ukTelephone number01484 342403Additional contact information&lt;/p&gt;\n&lt;p&gt;Jenny Lydon at jenny.lydon@cht.nhs.uk or&lt;/p&gt;\n&lt;p&gt;Sally Robertshaw at Sally.Robertshaw@cht.nhs.uk 01484 342535&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HRI/CRH, Halifax/Huddersfield", "postalCode": "HD3 3EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6557", "longitude": "-1.82159"}}, "title": "Rotational Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256785", "validThrough": "2020-11-15T23:59:59+0000"}