{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £37,890 per annum"}}, "datePosted": "2020-10-27T10:01:52+0000", "description": "&lt;p&gt;BREAST TEST WALES&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post is exempt under Section 7(2) (b) of the Sex Discrimination Act 1975 and due to the nature of the role only females should apply.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Opportunities exist in our North Wales Division, (a division of the NHS breast screening programme for Wales)&lt;/p&gt;\n&lt;p&gt;RADIOGRAPHER (full/ part time) Band 5/6 (depending on experience)&lt;/p&gt;\n&lt;p&gt;Public Health Wales is the national public health agency in Wales employing 1800 people. Please take a moment to read our additional documents to find out more about what we do and how we are working to achieve a healthier future for Wales.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Each part of our organisation plays a huge part in contributing to the seven priorities of our Strategic Plan, and as part of our contribution, Breast Test Wales, the Breast Screening team, is looking for a Radiographer with drive and ambition to join its experienced, longstanding team in North Wales.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The North Wales region has static centres at both Llandudno and Wrexham, both of which have screening and assessment clinic facilities. The post will involve travelling to and working on mobile units and there will be some requirement for overnight stays. North Wales operate 3 Mobile Screening Units which provide breast screening to eligible women in their local area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will join the team based in Llandudno or Wrexham. We offer some great benefits which include 27 days holiday, rising as your service grows and a competitive Pension options scheme. To see a comprehensive list of benefits, please refer to the additional Benefits document attached to this vacancy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are a highly motivated Radiographer with a strong demonstrable background in screening mammography, then we are keen to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Depending on experience and qualifications the successful candidate will be appointed to Band 6 or Band 5. The post will be based at either our centre in Llandudno or Wrexham. As an organisation BTW positively supports advanced practice, with established routes for Radiographers to become Advanced Practitioners/ Consultant and specialist Radiographers according to service need.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be expected to either have or be prepared to study for the post graduate MSc module in Mammography. Newly qualified radiographers will be required to work at least 24 months before commencing the post graduate module (exceptions might apply), after which they will be upgraded to Band 6. &lt;br /&gt;&lt;br /&gt;The post is exempt under Section 7(2) (b) of the Sex Discrimination Act 1975 and due to the nature of the role only females should apply.&lt;br /&gt;&lt;br /&gt;The ability to speak Welsh is desirable for this post.&lt;/p&gt;\n&lt;p&gt;For further information please contact the Regional Radiography Manager Mrs Eiriann Jones on 01492 863534/860888, or Deputy Regional Radiography Manager Mrs Christina Summers on 01492 863535/860888.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEiriann JonesJob titleRegional Radiography ManagerEmail addresseiriann.jones@wales.nhs.ukTelephone number01492 863534/860888Additional contact information&lt;/p&gt;\n&lt;p&gt;Deputy Regional Radiography Manager Mrs Christina Summers on 01492 863535.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124752.jpg", "name": "Public Health Wales NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124752"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Breast Test Wales, Llandudno", "postalCode": "LL30 1QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3133", "longitude": "-3.83082"}}, "title": "Radiographer (Band 5)/Senior Radiographer (Band 6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243915", "validThrough": "2020-11-08T23:59:59+0000"}