{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Pro Rata Per Annum"}}, "datePosted": "2020-11-06T13:16:52+0000", "description": "&lt;p&gt;Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust is building a new and exciting future for its Imaging services, with recent expansion of CT Service at Doncaster Royal Infirmary.&lt;/p&gt;\n&lt;p&gt;With an improved staff structure and career development opportunities, we are offering exciting and challenging opportunities for hard working and dynamic radiographers to join our friendly and dynamic CT Team.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiasm, excellent communication skills and a genuine desire to support the CT service. You must provide exceptional clinical and professional standards, consistently deliver the highest quality patient-focused care to our patients, and demonstrate evidence of ongoing CPD. A comprehensive training programme will be offered to radiographers wishing to specialise in this field.&lt;/p&gt;\n&lt;p&gt;The CT service is split over two main hospital sites currently provided by a Siemens Edge, Siemens Go All and Siemens Sensation scanner.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to learn new techniques and to broaden existing skills, with the support of a highly motivated and professional team. A comprehensive range of CT examinations are undertaken, including cardiac CT, CT angiography, CT colonography and CT reporting. The department is keen to support career progression.&lt;/p&gt;\n&lt;p&gt;Candidates should be HCPC registered and hold an appropriate qualification in Radiography. Training will be offered to applicants who demonstrate the requisite level of interest, motivation and commitment but have limited or no experience in CT. You will be expected to participate in all aspects of the service, including an out of hour’s commitment.&lt;/p&gt;\n&lt;p&gt;A flexible approach is essential in line with promoting the extended working day / week to benefit patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Sarah Gibson - Clinical Lead for CT scanning, sarah.gibson1@nhs.net, 01302644536&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN2 5LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5308", "longitude": "-1.10926"}}, "title": "Radiographer - CT Scanning", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259869", "validThrough": "2020-11-22T23:59:59+0000"}