{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on qualification and experience"}}, "datePosted": "2020-10-29T10:19:56+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;PCN Care Co-ordinator&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Contract&lt;/strong&gt;: Part Time, Fixed Term (24 months)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Hours and Shifts&lt;/strong&gt;: 28 hours per week, between 8.00am and 6.30pm, Mon-Fri &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Salary: &lt;/strong&gt;Dependent on qualifications and experience &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting time for the Walsall West 1 Primary Care Network. As a result of several practices working collaboratively to provide improved healthcare interventions to our local patient population we are recruiting for exciting opportunities across our network. You will be an integral part of the integrated team helping to provide an effective service to our patients as well as developing a forward thinking primary care network in a stimulating environment ……Does this sound like the opportunity for you? Are you up for the challenge? If so read on………?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are excited to be recruiting a Care Co-ordinator to work as part of a multi-disciplinary team within general practice, across Walsall West One Primary Care Network (PCN).&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Care Coordinator you will be the key link to the people whose care you are supporting, operating as a go to person to ensure that their care is seamless, they are active decision makers in their own care, and that everyone involved is working together. Care coordinators provide extra time, capacity and expertise to support patients in preparing for or in following-up clinical conversations they have with primary care professionals. As the role evolves the care coordinator will undertake direct work with patients and families to develop personalised care plans. An ethos of promotion of independence, shared decision making, personalisation and partnership-working is integral to this role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is a new and developing role. You will work in partnership with your clinical and non-clinical colleagues, management support and the wider PCN to ensure the role delivers the best possible outcomes for our patients.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Candidates will be contacted only if the application is taken forward.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;The advert may close early at any particular time if sufficient applications are received.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Modality Partnership Walsall", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136214"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walsall", "postalCode": "WS2 0BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5888", "longitude": "-2.02422"}}, "title": "PCN Care Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247882", "validThrough": "2020-11-12T23:59:59+0000"}