{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inclusive HCA"}}, "datePosted": "2020-10-26T11:01:50+0000", "description": "&lt;p&gt;Tower Hamlets Psychological Therapy Service is looking to recruit a highly motivated psychological therapist - clinical or counselling psychologists or cognitive behavioural therapists at Band 7. This is a 1 x WTE permanent position.&lt;/p&gt;\n&lt;p&gt;You will be joining the team at a time when we continue to develop our group programme to ensure our service is accessible to all who might benefit from a secondary-care psychological intervention. You will be able to contribute to the shaping of the service, through the development of group interventions and a growing emphasis on co-production, in addition to the provision of individual therapy. Wed like to recruit clinicians who are able to offer therapy in more than one modality, in addition to CBT, as well as demonstrate a robust capacity for assessment and formulation.&lt;/p&gt;\n&lt;p&gt;While the post is suitable for new or recently qualified staff, its likely to suit anyone who enjoys challenges, is flexible and committed to continuous improvement through co-production with service users and carers. We are a team that welcomes innovation and a readiness to try out new ideas as part of our commitment to continuous service improvement and the development of our staff.&lt;/p&gt;\n&lt;p&gt;As the PTS is part of a wider psychology and psychological therapy provision in Tower Hamlets, you will be joining a community of psychologists and psychotherapists working across CMHTs, inpatients, EI, perinatal, art therapies, personalities disorder services, drug and alcohol services, homelessness, learning difficulties, older adults, psychiatric liaison, community health, community access services, and primary care. We support and encourage CPD opportunities across these specialities as part of the Trusts annual appraisal and personal development planning. We are also committed to professional development to ensure high standards of provision.&lt;/p&gt;\n&lt;p&gt;The service has good links with the local Recovery College and People Participation, with an enthusiastic Active Participation group of experts by experience. We also regularly provide training placements and have good links with local training establishments.&lt;/p&gt;\n&lt;p&gt;We welcome interested applicants contacting us to find out more about this opportunity.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LONDON", "postalCode": "E1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5245", "longitude": "-.04262"}}, "title": "Specialist Clinical/Counselling Psychologist/CBT Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242131", "validThrough": "2020-11-11T23:59:59+0000"}