{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-02T03:46:22+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 7 – Applied Psychologist/Psychological Therapist – North Hampshire Acute Mental Health Team&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title: Applied Psychologist  or Psychological Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary band: &lt;/strong&gt;Band 7 £38,890-££44,503 per annum ??&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Permanent, Full time Time 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Parklands Hospital, Basingstoke&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic, motivated Applied Psychologist / Psychological Therapist to join the North Acute Mental Health Team. The administration base for this post will be Parklands Hospital, Basingstoke, but the clinical work will be with clients across the North and Mid area of Hampshire and will include some remote working with all the required equipment and support provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will join a dynamic, supportive, skilled and psychologically minded multidisciplinary team. The team are dedicated to the recovery of people in crisis and committed to delivering high quality, evidence-based interventions including CBT and DBT-informed approaches both individually and in groups.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will also be embedded within a friendly and welcoming North Hampshire Acute Psychology Team consisting of Band 8B Principal Clinical Psychologist, 2 Band 8A Psychologists, 1 Band 7 Psychological Therapist and 3 Assistant Psychologists.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for someone with an interest in working with people with mental health problems during periods of acute distress within a recovery-oriented framework, including in hospital and in the person’s home, who enjoys working closely and flexibly, day-to-day, with multi-disciplinary colleagues.  North Hampshire has adopted an innovative model in providing psychological therapies within acute and crisis care based on Comprehend Cope and Connect Model by Isabel Clarke. This involves the delivery of groups and individual work within the recovery model, focusing on skills acquisition and self-management. The CCC is aimed at those who are in the midst of an acute crisis and/or suffer from a severe mental health problem, including those with personality disorders and psychosis. The North Hampshire services are taking a lead in developing the evidence-base for this novel approach and the service is attracting national and international attention.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Multi-disciplinary team working is central to the role, and you will be involved in providing teaching, supervision, reflective practice, clinical formulation and consultation to other team members to support the ongoing development of this psychologically-aware multi-disciplinary team. We are committed to our aim of providing high quality psychological interventions and the role will also involve working directly with service users to deliver evidence based psychological therapies to the users of our service.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Applicants should have previous experience of working in mental health teams in the NHS and knowledge and skills in working with people who present with severe and enduring mental health difficulties.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be part of the wider North Area Psychological Therapies Team, a thriving active team of psychologists and psychological therapists working across the Acute Care, Community and EIP pathways. We are dedicated to delivering superb quality, evidence-based interventions. We pride ourselves on contributing to the development and implementation of innovative interventions. The range of psychologically focused therapies we deliver include Dialectical Behaviour Therapy (DBT), Cognitive Behavioural Therapy (CBT), Acceptance and Commitment Therapy (ACT), Mindfulness Based Cognitive Therapy (MBCT), Cognitive Analytic Therapy (CAT), Compassion Focused Therapy (CFT), and EMDR. &lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Trust has strong links with Southampton University, particularly with the Doctoral Programme in Clinical Psychology, the MSc/Diploma in Cognitive-Behavioural Therapy for Severe Mental Health Problems and training courses for IAPT. Opportunities for research and development within the post will be actively encouraged. We are keen to support training to increase your therapeutic skills and develop your leadership skills. This will be incorporated within your appraisal and supervision.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Perks of joining Southern Health:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Being part of an organisation with a wealth of experience and support systems already in place to enable you to concentrate on delivering care to our patients and their families&lt;/li&gt;\n&lt;li&gt;27 to 33 days annual leave depending on previous NHS employment&lt;/li&gt;\n&lt;li&gt;Competitive pay rates&lt;/li&gt;\n&lt;li&gt;Contributions towards a competitive pension scheme&lt;/li&gt;\n&lt;li&gt;Engagement with service user and carer feedback and participation&lt;/li&gt;\n&lt;li&gt;Engagement and commitment to improving the care we give&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Eligible applicants must be registered with the Health and Care Professions Council (HCPC) or eligible for registration at the point of taking up the post if successful.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like to find out more about the post please contact:&lt;/p&gt;\n&lt;p&gt;Dr Justyna Fila, Acute Psychology Team Lead on 01256 376403 (email: justyna.fila@southernhealth.nhs.uk) or you can also contact Dr Laura Dannahy, North Area Lead Consultant Psychologist, on 01256 376403 (or email l.dannahy@nhs.net).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Informal enquiries and visits are welcome. &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke/Parklands", "postalCode": "RG24 9RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2827", "longitude": "-1.11187"}}, "title": "Clinical/Counselling Psychologist/Psychological Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251250", "validThrough": "2020-11-16T23:59:59+0000"}