{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45753", "minValue": "45753", "unitText": "YEAR", "value": "£45,753/£45,753/£45,753/£45,753/£45,753/£51,668"}}, "datePosted": "2020-10-28T16:24:40+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Fixed Term Band 8a Clinical Psychologist&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Department of Medical Psychology –Band 8A (0.5 / 0.6 wte)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and highly motivated clinical psychologist to join our well established Department of Medical Psychology for between two and a half and three days a week, until the end of March 2021. The post holder will mainly offer assessments and interventions with people referred to our General Medical Service, but there will also be opportunities to work closely with local ITU teams and offer support to patients experiencing difficulties following COVID-19.&lt;/p&gt;\n&lt;p&gt;We are linked to one of the largest acute trusts in the country (University Hospitals of Leicester NHS Trust) and this provides us with excellent opportunities for collaborative clinical work, teaching and personal development.&lt;/p&gt;\n&lt;p&gt;The Department receives referrals from any of the Directorates within UHL and this post involves offering assessment and treatment (both individual and group) to patients referred to the department. There are also opportunities to become involved in specialist areas and potentially in working within specialist clinics/MDTs. There is some flexibility as to the hours worked and how the role is developed.&lt;/p&gt;\n&lt;p&gt;This post will be based at the Leicester General Hospital with other psychologists and admin/clerical support. The Department currently comprises thirteen clinical psychologists (8 wte). We have good admin and clerical support. We have excellent links with the Leicester D.Clin.Psy.Course and regularly attract trainees on placement.&lt;/p&gt;\n&lt;p&gt;This post provides a great opportunity to work in a supportive environment with an interesting and rewarding client group. The department is friendly, supportive and flexible. We take supervision and professional support seriously and meet regularly for case presentations, clinical governance and business meetings. We also have a monthly peer group meeting and regular time-out to enable reflection and service development.&lt;/p&gt;\n&lt;p&gt;Leicester is a thriving multi-cultural city with good arts and sporting facilities that enjoys excellent motorway links to other major cities and easy access to the surrounding countryside.&lt;/p&gt;\n&lt;p&gt;For an informal discussion or to arrange a visit, please contact Laura Ambrose (Consultant Clinical Psychologist) on 0116 295 4555.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE4 8PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6765", "longitude": "-1.10301"}}, "title": "Band 8a Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247365", "validThrough": "2020-11-11T23:59:59+0000"}