{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16625", "minValue": "16625", "unitText": "YEAR", "value": "£9.89"}}, "datePosted": "2020-10-20T13:06:56+0100", "description": "&lt;p&gt;&lt;strong&gt;NHS Professionals in partnership with Worcestershire Health and Care NHS Trust are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bank Admin and Clerical staff to cover 3 month Block Booking placements within Worcestershire Health and Care NHS Trust.&lt;/p&gt;\n&lt;p&gt;Location(s) – Worcester, Malvern&lt;/p&gt;\n&lt;p&gt;Pay rate - Band 2 - £9.89ph; Band 3 - £10.81ph&lt;/p&gt;\n&lt;p&gt;Working Pattern can vary although are generally: Monday to Friday 08:00-16:00 or 09:00-17:00&lt;/p&gt;\n&lt;p&gt;Full and Part Time opportunities available, but we are looking for people to start within 2 weeks.&lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional and reliable service you will have access to the following benefits: -&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive, weekly pay&lt;/li&gt;\n&lt;li&gt;Paid annual leave&lt;/li&gt;\n&lt;li&gt;Training and development opportunities&lt;/li&gt;\n&lt;li&gt;Access to our very own pension’s scheme called ‘NHSP Stakeholder pension’&lt;/li&gt;\n&lt;li&gt;Access to a wealth of Health Service Discounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;NHS Professionals is the leading provider of managed flexible workforce services to the NHS with approximately 140,000 nurses, doctors, administration and clerical and other healthcare professionals signed to its bank. We help our50 NHS Trust clients implement tactical measures to improve workforce efficiency and productivity as part of an overall workforce strategy.&lt;/p&gt;\n&lt;p&gt;We are seeking Bank Admin and Clerical staff who are motivated and enthusiastic with excellent communication and team working skills to join our bank.&lt;/p&gt;\n&lt;p&gt;Experience required: 3 month’s experience within the last two years in a similar admin based role Key responsibilities and duties for the roles may include (although not exhaustive):&lt;/p&gt;\n&lt;p&gt;• To deal with all queries in an efficient and courteous manner using judgement and prioritisation skills.&lt;/p&gt;\n&lt;p&gt;• Dealing with patients and internal customers/ hospital staff face to face, on the telephone and via email.&lt;/p&gt;\n&lt;p&gt;• Working with patient files and medical records – this may include lifting/ movement of documents as well as filing and preparing documents for clinics.&lt;/p&gt;\n&lt;p&gt;• Working to deadlines in a fast paced, demanding environment whilst maintaining accuracy and attention to detail.&lt;/p&gt;\n&lt;p&gt;• Use of Microsoft office programmes including Outlook, Word, Excel as well as internal NHS systems.&lt;/p&gt;\n&lt;p&gt;* Typing Letters and other forms.&lt;/p&gt;\n&lt;p&gt;*Arranging Meetings as and when required&lt;/p&gt;\n&lt;p&gt;• Ability to work both as part of a team and also independently.&lt;/p&gt;\n&lt;p&gt;• Respecting the confidentiality of all matters relating to patient, their employment and other members of staff.&lt;/p&gt;\n&lt;p&gt;* Excellent attention to detail.&lt;/p&gt;\n&lt;p&gt;* All members of staff are required to comply with the requirements of the Data Protection Act 1998.&lt;/p&gt;\n&lt;p&gt;• Attend statutory, essential and mandatory training as required.&lt;/p&gt;\n&lt;p&gt;Key working relationships within the role: Internal: Working across the organisation as a whole including nursing, medical, administrative/ clerical staff and other flexible workers. External: Working with NHS Trusts, patients, GPs and external healthcare organisations.&lt;/p&gt;\n&lt;p&gt;Please note that you will be contacted via email throughout the recruitment process, so please check your emails (junk mail) regularly.&lt;/p&gt;\n&lt;p&gt;We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire", "postalCode": "WR5 1JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1917", "longitude": "-2.17905"}}, "title": "Bank Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234508", "validThrough": "2020-11-06T23:59:59+0000"}