{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum Pro Rata"}}, "datePosted": "2020-10-27T15:01:02+0000", "description": "&lt;p&gt;6 month secondment/fixed term ending 27th March 2021&lt;/p&gt;\n&lt;p&gt;Full time 37.5 hours per week (part time will be considered)&lt;/p&gt;\n&lt;p&gt;You must be flexible in your approach to meet the demands of our 7 day service. You will join our rota and will work 5 days a week over the 7 days that the service is provided. The team hours cover an extended service 8am to 8pm. Shifts are 8am – 4pm and 12pm – 8pm.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced Physiotherapist to join the Accident and Emergency Department / Frailty Team.&lt;/p&gt;\n&lt;p&gt;In house daily rotations provide opportunity for the highly motivated therapist to develop their skills in a number of very different specialist areas. Working in a diverse environment offers scope to build on skills in a high paced AED setting as well as a specialist service within our Bevan Court Frailty and Reablement Unit.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work alongside highly experienced therapists, nurses and medics within an AED and Frailty MDT. Additionally you will be part of the newly developed Ambulatory Frailty Unit and Community Frailty. This is an opportunity to work with Frailty patients throughout their journey and make a real difference to people’s lives on their path from hospital to home.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide high quality, responsive care to patients attending the Accident and Emergency Department and those admitted to the Frailty Unit. In AED you will provide a first response and initial assessment that will support and help determine patient flow through the hospital. You will need to demonstrate confidence and clarity with your clinical reasoning and make informed decisions that may assist in turning people around safely and effectively in a shorter period of time. You must be adaptable to increasing demand often in a high pressured setting.&lt;/p&gt;\n&lt;p&gt;Working in Frailty you will be familiar with the frailty pathway. You will be part of a team that aims to comprehensively and holistically assess and treat our patients incorporating home assessments and thorough follow up. Our aims are to provide a reactive and proactive service to care for the frail older adult, preventing crisis, avoiding hospital attendance and maximising independence in a patient’s own home where possible.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate effective communication skills, be highly committed to the delivery of quality care as part of our MDT and provide thorough holistic patient intervention at all times. A sound understanding of Frailty, our patient demographic and the Frailty Pathway is desirable. With this you should have a broad knowledge base to assess a variety of conditions that may present in AED.&lt;/p&gt;\n&lt;p&gt;In return for your hard work and dedication we can offer a friendly and welcoming team. We encourage ongoing continuing professional development and enable regular peer support and In Service Training. Service development, Clinical Governance, Research and audit activities are key and you will have a number of opportunities to contribute to our ever developing and expanding service. We have an innovative service and diverse team of AHP’s with an excellent staff supervision system. Becoming a member of AED/Frailty you will be committed to developing both our service and as an individual.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have require an enhanced DBS with barred list for vulnerable adults.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa WorsleyJob titleClinical Lead PhysiotherapistEmail addresslisa.worsley@sthk.nhs.ukTelephone number7734Additional contact information&lt;/p&gt;\n&lt;p&gt;Dave Thompson, Physiotherapist, 0151 478 7532&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121089.jpg", "name": "St Helens and Knowsley Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121089"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whiston", "postalCode": "L35 5DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4201", "longitude": "-2.78641"}}, "title": "Specialist Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245109", "validThrough": "2020-11-13T23:59:59+0000"}