{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-03T16:00:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Cardiology 3 South/4 North West&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 3 - £18,005 - £19,337 per annum - Healthcare Support Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time 37.5 hours – Part time welcomed 30 hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a Band 3 Healthcare Support Worker to join cardiology team.&lt;/p&gt;\n&lt;p&gt;Our focus is our patients, their needs, ensuring their comfort and providing quality care. This is at the forefront of our thinking and we are constantly working to develop the service we offer to the people we treat. 3 South is a busy 41 single bedded room ward including a 4 single bedded Coronary Care Unit and 4 North West is a busy 21 bedded ward. Cardiology is on the cutting edge of technology, providing excellent cardiology experience for staff caring for patients undergoing cardiology procedures: angiograms, angioplasty, ablations, cardiac devices and various cardiac valve related procedures.&lt;/p&gt;\n&lt;p&gt;The nursing dependency of the patients is diverse and as such is dependent on the clinical skills of trained nurses and the successful candidate will be responsible for complementing the role of these registered nurses through the delivery of supervised /direct care. You will assist in the smooth running of the area by delivery and meeting patients care needs and the needs of the service which will include preparing patients for their procedures and delivering post procedure care. We have a superb team of dedicated nurses and support staff. Our staffs are focused on providing the highest standards of patient care and we are keen to recruit staff to join our team who will share our vision, enthusiasm and pride in the care we deliver.&lt;/p&gt;\n&lt;p&gt;We would welcome applications from individuals with experience within the healthcare setting and cardiology experience is desirable. Previous experience of enhanced practices such as 12 lead ECG, venepuncture and TR band removal are an advantage although full training will be provided.&lt;/p&gt;\n&lt;p&gt;For further information, or to arrange an informal visit, please contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Charge Nurse Steven Thurston 01223 638263 or 07775548250&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sister Rebecca Thomas 01223 638306 or 07775548254&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 7th December 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Papworth Road, Cambridge Biomedical Campus, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Healthcare Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254694", "validThrough": "2020-11-16T23:59:59+0000"}