{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-26T16:45:51+0000", "description": "&lt;p&gt;The new single strategic commissioner for Cheshire aims to strengthen integration and collaboration, allowing commissioning at scale with a more powerful national and regional voice, supporting the development of Integrated Care Partnerships in Cheshire West and Cheshire East to deliver more joined- up care closer to home. Placing patients at the heart of all we do a single Cheshire commissioner will ensure that services commissioned will support better outcomes and experiences for our local patients.&lt;/p&gt;\n&lt;p&gt;The Cheshire finance team now has an opportunity for an ambitious and committed Assistant Contract Accountant to join its Finance Team.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who is highly numerate, who can demonstrate excellent technical skills and who can become an integral part of the finance team providing support to the Finance and Contracting team.&lt;/p&gt;\n&lt;p&gt;• To have an up-to-date, expert level of knowledge and understanding of the National Tariff and to understand and highlight the impact of this on a portfolio of contracts.&lt;/p&gt;\n&lt;p&gt;• To participate in the accurate and timely production of the CCGs accounts.&lt;/p&gt;\n&lt;p&gt;• The post will support the process of developing and maintaining appropriate systems to monitor/validate commissioned activity under both National Tariff and local tariff arrangements reporting to the Senior Contract Accountant&lt;/p&gt;\n&lt;p&gt;As we currently have several locations, staff may be based in Chester, Macclesfield or Nantwich and will be required to work flexibly across all sites to meet the needs of the service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Toni Hancock&lt;/p&gt;\n&lt;p&gt;Senior Contract Accountant&lt;/p&gt;\n&lt;p&gt;Email address:   Toni.Hancock@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127234.png", "name": "NHS Cheshire Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across Cheshire CCG footprint, cheshire", "postalCode": "CH2 1BQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2118", "longitude": "-2.89903"}}, "title": "Assistant Contract Accountant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243489", "validThrough": "2020-11-08T23:59:59+0000"}