{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-28T15:31:27+0000", "description": "&lt;p&gt;An exciting opportunity has arisen in the Hastings Assessment and Treatment Service for a registered nurse, qualified social worker or registered occupational therapist with experience of working with people in a community mental health setting.&lt;/p&gt;\n&lt;p&gt;You would be a key part of our multi-disciplinary service for adults with mental health problems. This is challenging work but we receive very positive feedback from our service users and carers and Sussex Partnership NHS Foundation Trust has recently achieved Outstanding for the care it provides.&lt;/p&gt;\n&lt;p&gt;This post will involve working with adults with complex mental health needs as well as physical care needs. You will be expected to support both the client and their carers. You will also need to be able to work cohesively with other services both within our Trust, and with other partner agencies.&lt;/p&gt;\n&lt;p&gt;You will need to be caring, compassionate and a good communicator, with a commitment to improving the lives of our service users through creative, evidence based practice. As a Lead Practitioner, you will be responsible for working collaboratively with service users and their carers on your caseload to create care plans that meet their needs and maximise their independence.&lt;/p&gt;\n&lt;p&gt;You will need to be keen to embrace new ways of working and enthusiastic about improving clinical practice in line with the latest research and organisational learning.&lt;/p&gt;\n&lt;p&gt;You will be expected to work across the Hastings and Rother area. Although the job specification cites the hours as ranging from 9am – 8pm, these posts are currently 9am – 5pm.&lt;/p&gt;\n&lt;p&gt;All our clinicians are given opportunities to develop and grow as professionals in the organisation. We provide regular supervision, a supportive working environment and access to training opportunities to assist you to realise your potential.&lt;/p&gt;\n&lt;p&gt;The town is right by the sea, and the office has amazing sea views, with the prom across the road. Art, theatre, poetry, writing and music are a large part of the town’s culture. It is a vibrant and quirky area, with some beautiful countryside around the more deprived urban areas. There is the acclaimed Jerwood Gallery next to a working fishing beach; an old town; castle; pier and of course the Guinness work record for the largest gathering of pirates is held by Hastings!&lt;/p&gt;\n&lt;p&gt;Job share or part time working applications will be considered.&lt;/p&gt;\n&lt;p&gt;The Trust offers the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent starting salary&lt;/li&gt;\n&lt;li&gt;NHS Pension contributions&lt;/li&gt;\n&lt;li&gt;27 days holiday allowance plus bank holidays&lt;/li&gt;\n&lt;li&gt;Flexible Working patterns&lt;/li&gt;\n&lt;li&gt;Child care vouchers&lt;/li&gt;\n&lt;li&gt;Excellent training and development opportunities&lt;/li&gt;\n&lt;li&gt;NHS Discounts&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post offers a Golden Hello, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name John Allsopp&lt;/p&gt;\n&lt;p&gt;Job title Senior Nurse Practitioner&lt;/p&gt;\n&lt;p&gt;Email address john.allsopp@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01424 726553&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cavendish House, Hastings", "postalCode": "TN34 3AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8553", "longitude": ".583789"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247191", "validThrough": "2020-11-11T23:59:59+0000"}