{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-05T18:15:21+0000", "description": "&lt;p&gt;St. George’s University Hospitals NHS Foundation Trust is the regional specialist care provider for south west London, Surrey and beyond. The trust provides a high quality, comprehensive range of health services from leading edge tertiary and trauma care to community services.&lt;/p&gt;\n&lt;p&gt;With national and regional referrals added to our local 3.5m catchment, we serve a population of around 5m.&lt;/p&gt;\n&lt;p&gt;Co-located with St George’s, University of London and with both organisations now in a formal strategic alliance with King’s Health Partners, the trust delivers with its partners high quality research and education both of which contribute to the healthcare provision of tomorrow.&lt;/p&gt;\n&lt;p&gt;Acute and tertiary health services are delivered from over 1,000 beds across two sites, by around 8,000 staff.&lt;/p&gt;\n&lt;p&gt;St. George’s University Hospitals NHS Foundation Trust is a major acute hospital that offers very specialist care for complex injuries and illnesses, including trauma, neurology, cardiac care, renal transplantation, cancer care and stroke. It has a helipad which opened in spring 2014 and the work of its emergency department can currently be seen on Channel 4’s ‘24 Hours in A&amp;E’ programme. The hospital also provides all the usual care you would expect from a local NHS district general hospital.&lt;/p&gt;\n&lt;p&gt;We also provide services at Queen Mary’s Hospital in Roehampton. These include outpatient rapid diagnostic and treatment facilities, a minor injuries unit, limb fitting services and 70 elderly, intermediate care and rehabilitation beds.&lt;/p&gt;\n&lt;p&gt;As well as hospital services, we provide a wide variety of specialist, maternity and community services to children, adults, older people and people with learning disabilities. These services are provided from St John’s Therapy Centre, 11 health centres and clinics, schools, nursing homes and people’s own homes. The trust also manages the healthcare service at HMP Wandsworth.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant General Surgeon&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Special interest in Colorectal and Emergency Surgery (10 PA)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post has been created to join the colorectal team at St. George’s University Hospitals NHS Foundation Trust. This post has been developed to provide delivery of clinical care for colorectal, general and emergency surgery.&lt;/p&gt;\n&lt;p&gt;The Colorectal Team currently employs five Consultant Surgeons providing surgical management for colorectal cancers, inflammatory bowel disease and other anorectal conditions.&lt;/p&gt;\n&lt;p&gt;St George’s is one of the four major trauma centres within London. As part of this designation, and the requirement to meet the London Emergency Standards in general surgery, this appointee will be required to play an important role in the delivery of both trauma surgery and emergency surgery at this Trust. We will therefore be looking for an appointee with a specialist interest in colorectal surgery plus an interest in emergency and trauma surgery.&lt;/p&gt;\n&lt;p&gt;The post represents an exciting opportunity to join a dynamic surgical team in general surgery with the potential to contribute to the on-going development of the colorectal and emergency surgical services.&lt;/p&gt;\n&lt;p&gt;The appointee is expected to develop the clinical services offered by the colorectal surgical team, undertake teaching duties, to participate in research activities and to play a full part in the clinical governance of general surgery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Enquiries may be directed to Mr Andrew Wan, General Surgery Care Group Lead via Andrew.Wan@stgeorges.nhs.uk or Mr Robert Hagger, Consultant Colorectal Surgeon via Robert.Hagger@stgeorges.nhs.uk .&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We expect all our staff to share the values that are important to the trust – being excellent, kind, responsible and respectful – and behave in a way that reflects these. More information on the vision and values of St. George’s University Hospitals NHS Foundation Trust is attached below. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr Robert HaggerJob titleConsultant Colorectal SurgeonEmail addressRobert.Hagger@stgeorges.nhs.ukTelephone number0208 725 2358&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George&#39;s University Hospitals NHS Foundation Trust, London, Tooting", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Colorectal Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258764", "validThrough": "2020-12-03T23:59:59+0000"}