{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa+ 5% HCAS + Welcome benefit"}}, "datePosted": "2020-11-03T12:15:46+0000", "description": "&lt;p&gt;Are you an enthusiastic and motivated occupational therapist looking for a new challenge? Would you like to become an integral part of an innovative team dedicated to providing high quality clinical care to children and young people across Surrey? If so, we might have the job for you!&lt;/p&gt;\n&lt;p&gt;First Community Health and Care based in Redhill, is seeking paediatric occupational therapists to join its forward thinking, innovative organisation which puts children at the heart of its care.&lt;/p&gt;\n&lt;p&gt;Experience of working with children, young people and families with or without disabilities is desirable but not essential, as we recognise you may possess a variety of other transferable skills that could be a valuable asset to the team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join our supportive team of experienced therapists and assistants delivering high quality community based care to children aged 0-19, with a range of conditions including Cerebral Palsy, Autistic Spectrum Disorders and learning difficulties.&lt;/p&gt;\n&lt;p&gt;Working in the community means you will see children within their occupational environment, including nurseries and schools, where you will carry out essential duties within the occupational therapy process, including meeting with parents to address needs pre-referral, conducting assessments, recommending equipment, providing advice and training, facilitating group workshops and individual therapy sessions.&lt;/p&gt;\n&lt;p&gt;As part of this role we can offer an interested and dedicated clinician an exciting opportunity to support high quality Occupational Therapy service provision to children aged 2-11 years in a specialist school setting in Reigate. This is a unique chance for an occupational therapist to work collaboratively with school staff (alongside a multidisciplinary team) to enhance the whole school approach to better integrate Occupational Therapy provision in the education setting.&lt;/p&gt;\n&lt;p&gt;Preferences will be discussed at interview. Full time or part time considered.&lt;/p&gt;\n&lt;p&gt;If you possess excellent interpersonal skills, have experience of independent working but are also able to work as part of a multidisciplinary team, and possess the supervision skills to support junior team members, we’d like to hear from you. Please note due to the nature of the role it is essential you are a car driver.&lt;/p&gt;\n&lt;p&gt;In return First Community Health and Care can offer the successful candidate a £2,000 welcome bonus (terms and conditions apply), flexible working, high quality training and development opportunities, a supportive supervision structure; as well as an NHS pension and high cost area allowance.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126974.jpg", "name": "First Community Health and Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126974"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Horley", "postalCode": "RH6 7AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1726", "longitude": "-.165622"}}, "title": "Paediatric Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253907", "validThrough": "2020-11-17T23:59:59+0000"}