{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142"}}, "datePosted": "2020-10-27T09:08:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Vacancies are available at various locations across Staffordshire including&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Seisdon&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Hours are negotiable - part-time or full-time work available - Please ask us for more details!&lt;/p&gt;\n&lt;p&gt;Shifts are between the hours of 7am and 10pm to include weekends.&lt;/p&gt;\n&lt;p&gt;Salary: £19,737 - £21,142 pro-rata. Pay enhancements for Bank Holidays, weekends and late shifts, generous holidays and access to the NHS pension scheme.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting caring people who are passionate about providing personal and enabling care to our service users to help them remain safe and well in their own home. As a Home First Support Worker your role will include enabling/supporting our service users to regain and maintain their independence, helping them to manage their personal care such as washing and dressing, to prepare meals, manage their medication safely and achieve their therapeutic goals as set by the therapy team and as per their care plan. It is important that you can complete health records accurately after each visit and be confident in assessing any changes in the service user&#39;s health, communicating these changes back to the health professionals involved in their care plan.&lt;/p&gt;\n&lt;p&gt;You will need to be able to demonstrate your previous experience of working in a caring role in either a formal or informal care setting and be able to bring this experience with you. If you do not already hold a qualification in Health and Social Care, we will support your training to achieve an NVQ Level 3 qualification.&lt;/p&gt;\n&lt;p&gt;Take a look at the benefits leaflet to see what else you can expect as a valued Trust employee.&lt;/p&gt;\n&lt;p&gt;As this is a community based post it is essential that you are able to travel to various locations across the geographical area of the service, therefor you must have access to your own vehicle.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**All interviews will be conducted online due to COVID-19**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Seisdon", "postalCode": "WV7 3AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6174", "longitude": "-2.24431"}}, "title": "Home First Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243781", "validThrough": "2020-11-20T23:59:59+0000"}