{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum including HCAS"}}, "datePosted": "2020-10-27T17:30:37+0000", "description": "&lt;p&gt;This is an excellent opportunity for an enthusiastic and experienced dietitian with a passion for parenteral nutrition support and gastroenterology to work as part of the Northwick Park Nutrition Support Team. The successful applicant will have a varied and interesting caseload and work as part of a well-established multidisciplinary team. You will be based at Northwick Park Hospital but will develop a close working relationship and the opportunity for training and development alongside the St Marks dietetic team at Central Middlesex Hospital. St Marks is a national centre for intestinal failure and gastroenterology. The dietetic team is spread across Northwick Park, Central Middlesex, Ealing Hospitals and Harrow Community. You will have opportunities of a close working relationship, including development and training with the wider St. Mark’s service, which is a.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post will cover a caseload of patients requiring parenteral nutrition across the hospital, including complex colorectal surgery. You will also cover a weekly Gastroenterology Clinic and be supported by a Band 6 nutrition support specialist dietitian. We are looking for a dietitian with strong communication, organisational, team working and leadership skills. They should be focused on providing a high quality dietetic service which is responsive to the changing needs of the NHS and this patient group. You will be encouraged to actively participate in developing the service both clinically and strategically. The ideal candidate would have strong gastroenterology and parenteral nutrition experience. A proactive approach and good time management skills are also key is in this busy team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Northwick Park Hospital has a large, dynamic and friendly department of acute dietitians, community dietitians, dietetic assistants and good clerical support. This large department offers many opportunities for learning and development due to the range of specialities. The department is committed to Continuing Professional Development, and we have an established clinical governance programme including evidence based clinical groups, audit, clinical supervision and critical appraisal. We are a well-established student trainer and the post will involve supervision of students in the clinical area for placements 1, 2 and 3.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMina BharalJob titleDietetic Team LeadEmail addressm.bharal@nhs.netTelephone number0208 869 2683&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Band 7 Nutrition Support Team Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245579", "validThrough": "2020-11-10T23:59:59+0000"}