{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T14:31:04+0000", "description": "&lt;p&gt;Community CAMHS Non-Medical Prescriber&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work within an innovative and dynamic CAMHS service.&lt;/p&gt;\n&lt;p&gt;Community CAMHS South serves the Rushcliffe, Broxtowe and Gedling areas and offers a specialist CAMHS provision to Nottingham City.&lt;/p&gt;\n&lt;p&gt;Clinical bases include the newly built Hopewood Site, Stapleford Care Centre and Keyworth Primary Care Centre.&lt;/p&gt;\n&lt;p&gt;The Community CAMHS Service supports Children, Young People and their families/carers with their emotional and mental health needs on a continuum of mild to severe.&lt;/p&gt;\n&lt;p&gt;You will be be part of an established and supportive team (including working alongside an NMP within the team) open to innovative ways of working, collaboratively with young people to improve the service we deliver.&lt;/p&gt;\n&lt;p&gt;The Community CAMHS Non-Medical Prescriber will work as an integral member of the multidisciplinary team, offering assessment and evidence-based interventions to children and young people presenting with emotional and mental health difficulties.&lt;/p&gt;\n&lt;p&gt;The post holder will be experienced in the assessment of children and young people presenting with emotional and mental health needs and in the formulation and delivery of appropriate evidence based interventions. The post holder will be responsible for an agreed caseload and &lt;span&gt;will exercise advanced clinical expertise, a prescribing service, and work alongside the Team Leaders, NMP and Consultant Psychiatrists in coordinating the team in the delivery of high quality multidisciplinary care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will need to demonstrate evidence of extensive knowledge, experience and skills of working within Mental Health services and as an independent prescriber. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role requires effective interpersonal skills and the ability to manage complex issues arising from the delivery of a service in a busy team, including achieving all required performance targets.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must have a relevant core profession and be registered with the relevant professional body; and hold an independent non-medical prescriber certificate.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will work with a variety of agencies including social care, acute hospitals and adult mental health services to ensure a quality service is provided.&lt;/p&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah BonneyJob titleClinical Team LeadEmail addresssarah.bonney@nottshc.nhs.ukTelephone number0115 8440500Additional contact information&lt;/p&gt;\n&lt;p&gt;Rebecca Stevenson&lt;/p&gt;\n&lt;p&gt;Operational Team Lead&lt;/p&gt;\n&lt;p&gt;rebecca.stevenson@nottshc.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pebble Bridge, Hopewood, Nottingham", "postalCode": "NG5 3FL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9905", "longitude": "-1.14201"}}, "title": "CAMHS Specialist Non-Medical Prescriber", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246985", "validThrough": "2020-11-11T23:59:59+0000"}