{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45000", "minValue": "31000", "unitText": "YEAR", "value": "£31,000 - £45,000 per annum (DOE)"}}, "datePosted": "2020-10-26T13:04:36+0000", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Pharmacist in our Newcastle Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nuffield Health Newcastle Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Join our team at Newcastle upon Tyne Hospital, located in Jesmond; you will be working at one of the north easts leading private hospitals, with a Good CQC rating, we have 27 en-suite private bedrooms, 3 state-of-the-art operating theatres, a dedicated breast care unit.  We offer on-site pathology services and diagnostic imaging including CT and MRI, to help patients after surgery we have on-site physiotherapy specialists.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a special focus in the areas of orthopaedics, spinal surgery, ophthalmology, weight loss surgery and cosmetic treatment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We pride ourselves on delivering patient care of the highest standard. That’s why we are looking for the very best healthcare professionals to join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be part of the wider multi-disciplinary team at Nuffield Health and you will feel the benefit from processes that fully integrate medicines into the personalised pathway of care for our patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for you to develop your career and gain a wide range of skills. As a Pharmacist you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Deliver high quality clinical care and advice to our customers.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be the Medicines Management Lead for the hospital.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Offer services to a range of departments including the pre-assessment clinic, outpatient department, ward and theatres.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To succeed as a Pharmacist you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Be a Registered Pharmacist with the General Pharmaceutical Council.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Proven post qualification experience as a Pharmacist.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have excellent communication and people skills. This is essential as you will be working closely with patients as well as a variety of clinical staff.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this, but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - £31,000 - £45,000 per annum (Dependant On Experience)&lt;br /&gt;Closing date - 01/12/2020&lt;br /&gt;Location - Newcastle Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type - Permanent&lt;br /&gt;Weekly Hours - 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle", "postalCode": "NE2 1JP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9874", "longitude": "-1.60492"}}, "title": "Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242579", "validThrough": "2020-12-01T23:59:59+0000"}