{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 pro rata"}}, "datePosted": "2020-11-06T10:00:40+0000", "description": "&lt;p&gt;&lt;strong&gt;Quality Support Administrator Band 5 – Job Share 18.75 Hours per week. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is part of a job share and will be required to work Wednesday pm - Friday&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Health Education England (HEE) provides leadership for the education and training system. It ensures that the shape and skills of the future health and public health workforce evolve to sustain high quality outcomes for patients in the face of demographic and technological change.&lt;/p&gt;\n&lt;p&gt;HEE ensures that the workforce has the right skills, behaviors and training, and is available in the right numbers, to support the delivery of excellent healthcare and drive improvements through supporting healthcare providers and clinicians to take greater responsibility for planning and commissioning education and training.&lt;/p&gt;\n&lt;p&gt;The South West local office quality team are responsible for the quality of education and training of healthcare learners across the South West. Based in Plymouth we are seeking an enthusiastic and highly motivated individual who can demonstrate the key values of the NHS Constitution to provide comprehensive administrative and analytical support within the team. During the current COVID pandemic you will be required to work from home and will be supported by the team during this period.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will you doing?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will be supporting the administrative functions of the department and will be central to its operations. This is a role with a lot of variety and tasks range from arranging meetings and events, administering quality processes, analysing data and producing reports and going out and visiting those involved in the education to a range of healthcare learners.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What do you need?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Key skills and abilities you will need to evidence on your application and at interview include excellent organisation and oral and written communication skills, with demonstrable experience of liaising at a senior level.&lt;/p&gt;\n&lt;p&gt;You need to be able to evidence how you have worked well in a team as well as managing your own workload and you should be able to provide examples of how you have worked autonomously in previous roles. We are looking for someone who will be able to work effectively in a job share, providing a seamless service whilst supporting your job share counterpart.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate attention to detail and the ability to manage a varied and busy workload. Sound diary management skills and proficiency in the use of IT and Microsoft Office packages, especially Outlook, Word and Excel are also essential to this role.&lt;/p&gt;\n&lt;p&gt;Knowledge of working within a healthcare environment will be advantageous and successful candidates will be educated to degree level (or equivalent experience).&lt;/p&gt;\n&lt;p&gt;We offer a friendly and supportive working environment &amp; there are a variety of benefits that are available to you when you join HEE including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lease Car Scheme&lt;/li&gt;\n&lt;li&gt;Cycle Scheme&lt;/li&gt;\n&lt;li&gt;Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Health Service Discounts&lt;/li&gt;\n&lt;li&gt;27 days annual leave rising with length of service&lt;/li&gt;\n&lt;li&gt;Flexible benefits to support your wellbeing&lt;/li&gt;\n&lt;li&gt;Competitive NHS Pension Scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 5 with a full-time starting salary of £24,907, with pay step increases after 2 years’ service and 4 years’ service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details contact: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Sharon Hooper, Quality Manager – sharon.hooper@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sharon Hooper&lt;/p&gt;\n&lt;p&gt;Quality Manager&lt;/p&gt;\n&lt;p&gt;sharon.hooper@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;01752 590678&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plumer House, Plymouth", "postalCode": "PL6 5DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4081", "longitude": "-4.12717"}}, "title": "Quality Support Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259131", "validThrough": "2020-11-22T23:59:59+0000"}