{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-31T08:15:24+0000", "description": "&lt;p&gt;Blackpool Teaching Hospitals are looking for highly motivated and committed Band 5 Staff Nurses to work within the Endocrinology ward which has strong links to the wider Unscheduled Care team, and we welcome applicants with an interest within this specialty. This is a 30 bedded ward were the staff pride themselves on their commitment to providing a high quality of care from their existing motivated and passionate team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We require enthusiastic individuals with a can do attitude who have the ability to work within our friendly ward teams. They must be as passionate as we are in getting things right first time every time.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Commitment to undertake ongoing in-service training and development is essential. You should be motivated, keen to learn and ready to embrace change. Our commitment to you is to provide the environment for this to happen and ensure that you are part of our defined preceptorship programme.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you are motivated to deliver high standards of care and have the personal qualities and characteristics as outlined in the Blackpool person then this could be the post for you.&lt;br /&gt;An enhanced DBS check will be required for this post.&lt;br /&gt;Please note that if you are successful in your application you agree that the Occupational Health Department can access your occupational health records from your current or previous employer (in order to check the status of your inoculations and screening tests). This is an automated process and the information will only be used for these purposes prior to your taking up the position with us. &lt;br /&gt;&lt;br /&gt;&lt;br /&gt;ANY INVITATION TO INTERVIEW WILL BE SENT TO YOU VIA EMAIL USING THE EMAIL ACCOUNT STATED ON YOUR APPLICATION FORM. IF YOU HAVE NOT RECEIVED A RESPONSE WITHIN 3 WEEKS, YOU SHOULD ASSUME THAT ON THIS OCCASION YOUR APPLICATION HAS BEEN UNSUCCESSFUL. NOTIFICATIONS OF INTERVIEW WILL ALSO BE SENT VIA SMS TEXT MESSAGING. MOBILE NUMBERS ARE REQUIRED TO PROVIDE THIS SERVICE.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These positions are available to Student Nurses, we would also welcome applicants who are interested in a Secondment Opportunity.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexible Working Patterns may also be available upon discussion, such as Night Shifts or Part-time hours, please discuss at Interview stage&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMaxine StansfieldJob titleWard ManagerEmail addressmaxine.stansfield@nhs.netTelephone number01253 953411Additional contact information&lt;/p&gt;\n&lt;p&gt;Maxine Stansfield&lt;br /&gt;Ward Manager &lt;br /&gt;Tel: 01253 953411&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Staff Nurse Endocrinology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251122", "validThrough": "2020-11-15T23:59:59+0000"}