{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18055", "unitText": "YEAR", "value": "£18,055-£19,337"}}, "datePosted": "2020-10-23T16:28:44+0100", "description": "&lt;p&gt;Rehabilitation Support Worker - Primary Care Homes- South Waveney, Lowestoft, Gorleston,Great Yarmouth and Northern Villages&lt;br /&gt;over 17 positions up to full time hours.&lt;br /&gt;Hours of work 11.5 hour and 12 hour shift&lt;/p&gt;\n&lt;p&gt;Worked between core hours of 07.00- 20.30 hours&lt;/p&gt;\n&lt;p&gt;Are you looking for a new challenge? Do you have excellent communication skills, consider yourself to be caring and compassionate and want to make a difference to the patient’s experience on a daily basis?&lt;/p&gt;\n&lt;p&gt;We are looking for community rehabilitations workers to join our primary care homes which are multidisciplinary team of nurses, occupational therapists, physiotherapists, assistant practitioners, paramedics, phlebtomists, health care assistants working closely with GP&#39;s, social services and other community providers to provide an excellent standard of person centered care to adults in their own homes, residential care or &#39;beds with care&#39;, supporting people to self manage whenever possible.&lt;/p&gt;\n&lt;p&gt;The service uses SystmOne as a clinical IT system to support mobile working. As a support worker within the team you will be delivering rehabilitation under supervision providing care and support to ensure the patients needs and goals are met, regularly liaising with team members to identify and report any changes in the patients condition. The purpose of the team is to support people to stay at home and will include hospital admission prevention and end of life care. The Primary Care Home provides a 24/7 service and successful applicants will be required to work a variety of shifts including weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;Previous experience of a caring role or community work would be an advantage however consideration will be given to the right candidate. The Care Certificate is required. If you do not already hold this certificate, you will be supported to complete the Care Certificate programme on commencing employment with East Coast.&lt;/p&gt;\n&lt;p&gt;In order to achieve our purpose to deliver high quality services East Coast Community Healthcare is building an &#39;intentional culture&#39;. The EVOLVE culture programme is for all employees.&lt;/p&gt;\n&lt;p&gt;Work Together, Achieve Together&lt;br /&gt;My Accountability, My Responsibility&lt;br /&gt;Be Cost Conscious, Respect our Resources&lt;br /&gt;Listen, Learn and Lead&lt;/p&gt;\n&lt;p&gt;All employees will be able to relate to these behaviours and are expected to positively demonstrate them in the workplace. Successful candidates will be able to demonstrate how they embody our values and commitments and a desire for personal development&lt;/p&gt;\n&lt;p&gt;East Coast Community Healthcare follows Agenda for Change terms and conditions and supports the transfer of NHS pension for those already in the scheme. In return for your commitment, we offer a wide range of employee benefits including investment in career development; salary sacrifice lease car scheme; child care vouchers; NHS discounts; pension schemes. For a full list of employee benefits please see our website. As a social enterprise we actively encourage employee shareholding and participation in the development of our enterprise.&lt;/p&gt;\n&lt;p&gt;If you are interested in this position please contact Alice Bellamy on 07790366983 for an informal discussion or to arrange a visit.&lt;/p&gt;\n&lt;p&gt;This post will close when sufficient applications have been received.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127294.png", "name": "East Coast Community Healthcare CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various", "postalCode": "NR31 6LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5617", "longitude": "1.718"}}, "title": "Rehabilitation Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241304", "validThrough": "2021-03-31T23:59:59+0100"}