{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31618", "minValue": "25425", "unitText": "YEAR", "value": "£25,425 - £31,618 per annum inclusive of HCAS"}}, "datePosted": "2020-11-03T11:32:08+0000", "description": "&lt;p&gt;Our aim as a Trust at Frimley Health is to provide the highest quality care possible and being part of our team you can look forward to a career where staff are actively supported to develop their skills and knowledge. An opportunity has arisen for enthusiastic band 5 nurses to join our team.&lt;/p&gt;\n&lt;p&gt;The endoscopy unit at Wexham Park Hospital in slough currently operates a 7 day service, Monday to Sunday, 8am to 6pm. We also have an &lt;span&gt;emergency&lt;/span&gt;&lt;span&gt;out of hour’s Upper GI bleed service which is covered by our&lt;/span&gt;&lt;span&gt; nurses. Once competent you will be expected to be part of the on call GI bleed rota.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are JAG accredited which currently has 2 procedure rooms and an 8 bay endoscopy recovery area. We provide a full range of diagnostic and therapeutic endoscopy procedures including ERCP, oesophageal dilatation and stenting. Our nurses are at the forefront of influencing the patient’s experience and have excellent acute care skills, communication and organisational skills along with a supportive manner. The unit enjoys a robust nursing management structure and strong clinical leadership. The unit carries out colonoscopy as part of the National Bowel Cancer Screening Programme. &lt;br /&gt;&lt;br /&gt;In this role you will have the opportunity to develop your skills in Endoscopy working closely with your allocated mentor and supported by senior staff and the practice development team. This will enable you to work in all aspects of the endoscopy pathway. &lt;br /&gt;&lt;br /&gt;We support flexible working and applicants are invited to discuss options around this to enable you to balance work with personal commitments.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoseph RubisJob titleSenior Charge NurseEmail addressjoseph.rubis@nhs.netTelephone number0300 615 3372Additional contact information&lt;/p&gt;\n&lt;p&gt;To arrange an informal visit please contact Joseph Rubis - Senior Charge Nurse/Richel Oliver Matron on 0300 615 3372 or 0300 615 4163.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wexham Park Hospital, Slough", "postalCode": "SL2 4HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5331", "longitude": "-.575106"}}, "title": "Staff Nurse - Endoscopy Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253762", "validThrough": "2020-11-17T23:59:59+0000"}