{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-27T12:01:12+0000", "description": "&lt;p&gt;Iechyd Cyhoeddus Cymru yw asiantaeth iechyd cyhoeddus genedlaethol Cymru sy&#39;n cyflogi 1,400 o staff a’i gwaith yw diogelu a gwella iechyd a llesiant a lleihau anghydraddoldebau iechyd i bobl yng Nghymru.&lt;/p&gt;\n&lt;p&gt;Mae Bron Brawf Cymru wedi&#39;i rannu&#39;n dair rhanbarth ddaearyddol ac mae ganddo ganolfannau yng Nghaerdydd, Abertawe, Llandudno a Wrecsam. Mae un ar ddeg o unedau symudol yn gweithio ledled Cymru i ddarparu gwasanaethau sgrinio lleol i fenywod sy&#39;n byw yn bell o ganolfannau, gan ymweld â dros 100 o safleoedd ym mhob cylch sgrinio tair blynedd.&lt;/p&gt;\n&lt;p&gt;Mae tîm Bron Brawf Cymru yn chwilio am unigolyn sydd ag egni ac uchelgais i ymuno â&#39;i dîm. Os byddwch yn llwyddiannus, byddwch yn gyfrifol am reolaeth weithredol Rhanbarth De-ddwyrain Cymru Bron Brawf Cymru, gan gefnogi cyflwyno pob agwedd ar y Gwasanaeth Sgrinio’r Fron a rhoi arweinyddiaeth glinigol a rheolaethol. Bydd hyn yn cynnwys pob agwedd ar gynllunio darpariaeth ranbarthol gwasanaeth sgrinio&#39;r fron, rheoli staff a sicrhau bod defnyddwyr y gwasanaeth yn cael profiad rhagorol.&lt;/p&gt;\n&lt;p&gt;Bydd yr ymgeisydd llwyddiannus wedi&#39;i leoli yng nghanolfan Bron Brawf Cymru yng Nghaerdydd.&lt;/p&gt;\n&lt;p&gt;Os ydych chi&#39;n llawn cymhelliant, yn weithiwr delweddu proffesiynol profiadol a chymwys sydd â chefndir amlwg mewn rheolaeth glinigol a gweithredol, yna rydym yn awyddus i glywed gennych.&lt;/p&gt;\n&lt;p&gt;Am ragor o wybodaeth, cysylltwch â Mr Dean Phillips - Pennaeth Rhaglen Bron Brawf Cymru &lt;strong&gt;Dean.phillips@wales.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Public Health Wales is the national public health agency in Wales employing 1400 staff and exists to protect and improve health and wellbeing and reduce health inequalities for people in Wales.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Breast Test Wales is divided into three geographical divisions with centres in Cardiff, Swansea, Llandudno and Wrexham. Eleven mobile units work across Wales to provide local screening to women who live some distance from a centre, visiting over 100 sites in every three year round of screening&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Breast Test Wales team is looking for an individual with drive and ambition to join its team. If successful you will be responsible for the operational management of the South East Wales Region of Breast Test Wales, supporting the delivery of all aspects of the Breast Screening Service and providing clinical and managerial leadership; which will include all aspects of planning the regional delivery of the breast screening service, staff management and delivering an excellent service user experience.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful candidate will be based at the Breast Test Wales centre in Cardiff.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you are highly motivated, an experienced and qualified imaging professional with a strong demonstrable background in clinical and operational management, then we are keen to hear from you.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;For further information please contact Mr Dean Phillips – Head of Programme for Breast Test Wales &lt;/span&gt;&lt;/span&gt;&lt;span&gt;Dean.phillips@wales.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDean PhillipsJob titleHead of ProgrammeEmail addressdean.phillips@wales.nhs.ukTelephone number01792 453148&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124752.jpg", "name": "Public Health Wales NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124752"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Breast Test Wales, Cardiff", "postalCode": "CF11 9LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.483", "longitude": "-3.19021"}}, "title": "Regional Radiography Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244380", "validThrough": "2020-11-10T23:59:59+0000"}