{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-26T16:00:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Adult Specialist Speech and Language Therapist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location – Countywide&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £31,365 - £37,890 pro rata&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – Full time, part time, flexible working available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sessions are available in – Community, Acute Hospitals and the Brain Injury Team. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity available for a specialist speech and language therapist wishing to develop and expand their clinical skills to work within Gloucestershire.&lt;/p&gt;\n&lt;p&gt;We are a well-established, dedicated and friendly team providing a countywide service within a number of specialist areas. We are offering a range of sessions which include –&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute Hospitals – inpatients, including Critical Care, Neurology, Respiratory, Care of the Elderly and Oncology.&lt;/li&gt;\n&lt;li&gt;Community Hospital – inpatients, Care of the Elderly Rehabilitation&lt;/li&gt;\n&lt;li&gt;Outpatients – including Progressive Neurological Disorders, Voice Disorders and Care Homes&lt;/li&gt;\n&lt;li&gt;Brain Injury Team – inpatients, early discharge service and community service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A combination of any of these sessions can be offered dependent on personal interest.&lt;/p&gt;\n&lt;p&gt;Specialist support within the team is available to help develop your skills and knowledge. There are opportunities to work as part of a multi-disciplinary team to optimise patient care.&lt;/p&gt;\n&lt;p&gt;You will be supported to work independently on a day to day basis, as required, and to use your skills to make decisions about caseload management.&lt;/p&gt;\n&lt;p&gt;The team are proactive in ongoing service development initiatives. The service offers regular clinical and line management supervision. We have a strong CPD ethos, access to training is available and career development is encouraged through your regular personal development reviews.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details on this vacancy please contact –&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Che Ming Leung (Principal SLT) for Brain Injury Tel 0300 422 5138&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Jane Cantwell (Principal SLT) for Acute / Community Tel 0300 422 4120 / 8105&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Emma Bufton (Principal SLT) for Acute / Community Tel 0300 422 8105&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: Week commencing 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: Week commencing 30th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL1 3NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8664", "longitude": "-2.23104"}}, "title": "Specialist Speech &amp; Language Therapist - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243270", "validThrough": "2020-11-09T23:59:59+0000"}