{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-02T03:46:08+0000", "description": "&lt;p&gt;Are you an enthusiastic, motivated and dynamic registered Nurse looking for a new challenge?  Then we have the job for you!  An exciting opportunity is available to join the Clinical Support Team as a Band 6 Sister/Charge Nurse at Leeds Teaching Hospitals NHS Trust (LTHT).  We have a substantive post and a 12 month secondment opportunity.   LTHT is oneof the largest Trusts in England and rated GOOD by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an experienced nurse, the successful candidate will work with a team of staff to provide time limited support to clinical teams, as part of the wider Professional Practice Standards and Safety Team, to ensure consistent high quality care is delivered. This will involve the provision of education, leadership support, change management and clinical support. The successful candidate will encourage effective communication to be maintained at all times and provide support to registered and unregistered nurses within the ward/department.  The successful candidate will assist with the on-going development of the ward Healthcheck Metrics programme to measure nursing outcomes. You will be expected to undertake scheduled and reactive assurance visits to clinical areas in line with the CQC key lines of enquiry framework to provide assurance of patient safety and quality of care.    The successful candidate will support and undertake project work, both independently and as part of Corporate Nursing, delivering on Nursing, Midwifery and LTHT strategies and agendas.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for an experienced registered nurse who acts as a positive role model, promoting quality evidence-based practice with an innovative and can do attitude.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will possess excellent communication skills, time management and organisational skills as well as being an effective leader.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Laura Omand Senior Sister Clinical Support Team (0113) 2067020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Louise Clarkson Lead Nurse (013) 2066405&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122916.jpg", "name": "Chief Nurse", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122916"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Sister/Charge Nurse (XR06)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251235", "validThrough": "2020-11-16T23:59:59+0000"}