{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T10:31:54+0000", "description": "&lt;p&gt;Do you aspire to make a real positive contribution to nursing in the community?&lt;/p&gt;\n&lt;p&gt;Are you a Registered Nurse, or just about to qualify? Do you want an exciting and interesting job with great career potential? We are a team of highly skilled individuals who are committed to the delivery of high quality, progressive and safe care in a variety of settings in the community. We are looking forward to welcoming, supporting and helping you with your future career development.&lt;/p&gt;\n&lt;p&gt;We have an opportunity for a Registered Nurse who is ambitious and looking for exciting new challenges. If you are keen to enhance your personal and professional development whilst making a real difference to patients, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;There are extensive learning and development opportunities for all nurses within the service, including specialist community nursing qualifications, wound and palliative care qualifications and training up to and including masters level.&lt;/p&gt;\n&lt;p&gt;The role of the District Nurse is to deliver highly skilled care to patients in their own home and other community settings The District Nursing Service operates in Locality Teams working closely with GP clusters delivering varied and diverse care including palliative care, coordination of complex continuing health care and wound care to the patients living within this area.&lt;/p&gt;\n&lt;p&gt;As a service we work closely with other community services and our colleagues in University Hospital of Wales, University Hospital Llandough and Locality based community hospitals, the local authority and voluntary sector, to ensure that our patients receive the best possible care.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;We would recommend and suggest you work a shadow shift with the District Nurse Team to get a sense of what the role involves. You could either do this voluntary or be paid as a nurse bank shift. Please contact the team sister to arrange a visit.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Hayley Mico&lt;/p&gt;\n&lt;p&gt;Deputy District Nurse Sister&lt;/p&gt;\n&lt;p&gt;07976 050226&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cardiff North &amp; West Locality, Cardiff", "postalCode": "CF14 7XB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5172", "longitude": "-3.23176"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251585", "validThrough": "2020-11-16T23:59:59+0000"}