{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860-£107,668"}}, "datePosted": "2020-10-16T12:04:49+0100", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Consultant Anaesthetist&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Trauma Lead&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;This is a full-time post and an exciting opportunity for an ambitious doctor wanting to get involved in the role of trauma lead. It will involve working closely with the orthopaedic and care of the elderly multidisciplinary teams to further develop patient pathways for this group of often frail and vulnerable patients. Demonstrating experience in this field or other similar quality improvement projects would be advantageous.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The department welcomes applicants with other sub specialty interests and will facilitate the development and implementation of these skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The department provides services for general, ophthalmic, maxilla-facial, ENT, urological, orthopaedic and gynaecological surgery. We also provide anaesthetic services to obstetrics, paediatrics, radiology, ECT and the ED. The relative geographical isolation means that all anaesthetists must maintain a wide range. The main theatre complex consists of 4 operating theatres and 2 separate day case operating theatres. There is a dedicated obstetric theatre. All the standard modern equipment and drugs are available.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Isle of Wight is a beautiful Island located four miles from the south coast of England. It’s the perfect place to bring up a family and ideal for those who enjoy the outdoors and especially water sports. There are regular efficient links to Southampton and Portsmouth on the south coast of England, and London can be reached within two hours.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion please contact Dr Mariam Rice on 01983 552262 or email: mariam.rice@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isle of Wight NHS Trust - Medical Recruitment", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Consultant Anaesthetist Trauma Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230089", "validThrough": "2020-11-30T23:59:59+0000"}