{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20371", "minValue": "19039", "unitText": "YEAR", "value": "£19,039 - £20,371 per annum including high cost al"}}, "datePosted": "2020-11-04T14:46:12+0000", "description": "&lt;h1&gt;Nursery Nurse&lt;/h1&gt;\n&lt;h2&gt;Sunshine Day Nursery&lt;/h2&gt;\n&lt;p&gt;We are currently recruiting for a full time Level 2 or 3 Nursery Nurse.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a bubbly and happy personality with experience of working with children and have a passion for the role. You must have confidence in being able to interact with and supervise children between 0-5 years, ensuring their safety at all times. You must be self-motivated, confident, reliable, as well as showing initiative. You will be working under the direction of the room manager and alongside other members of the team.&lt;/p&gt;\n&lt;p&gt;The nursery is split into three age groups: Babies, Toddlers and Pre-school. The role will involve you being a key person to a group of children, and being responsible to carry out observations, summaries of development and development trackers, therefore you will need to have strong knowledge of the EYFS. You will be required to build relationships with parents/carers and have the skills to communicate with them effectively. You will be supporting children whilst they play and extend their learning, for example reading stories, role play in the home corner, and whilst outside. It will also involve intimate care (nappy changing, toileting) and meal times.&lt;/p&gt;\n&lt;p&gt;You will be joining a professional but extremely friendly nursery that thrives on delivering the best possible childcare to our families.&lt;/p&gt;\n&lt;p&gt;Applicants will be required to complete various clearance including an Enhanced DBS.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Shelley Hooper on shelley.hooper@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Nursery Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256274", "validThrough": "2020-11-13T23:59:59+0000"}