{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 (pro rata)"}}, "datePosted": "2020-10-21T13:50:18+0100", "description": "&lt;p&gt;The Community Heart Failure service is a well-established experienced team of specialist nurses, consultant cardiologists and sonographers supporting the delivery of heart failure care across the interface. We provide timely access to diagnostics, early treatment intervention and seamless transition from hospital to long term management. The post is integral to the multidisciplinary team, working closely with our partners in Primary and secondary care, underpinned by a solid clinical governance structure.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity to work with a highly specialist heart failure team. We are looking to recruit a part time (30 hours) heart failure specialist nurse to support the BNSSG team. &lt;br /&gt;&lt;br /&gt;You will be supported to manage a caseload of patients working in a nurse led clinic environment; visiting patients at home where necessary.&lt;/p&gt;\n&lt;p&gt;We offer a rewarding experience of managing complex patient’s; provide training in heart failure management. We will support the development of expert clinical skills and provide close mentorship within a highly performing dynamic team.&lt;/p&gt;\n&lt;p&gt;You will work with an experienced heart failure team of specialist nurses, consultant cardiologists and sonographers supporting the delivery of care across the BNSSG interface. We provide timely access to diagnostics, early treatment intervention and seamless transition from hospital to long term management. The post is integral to the multidisciplinary team, working closely with our partners in Primary and secondary care, underpinned by a solid clinical governance structure.&lt;/p&gt;\n&lt;p&gt;The role is currently based at&lt;strong&gt; New Friends Hall, Stapleton Bristol&lt;/strong&gt; - There is a requirement for the post-holder to &lt;strong&gt;travel&lt;/strong&gt; to other clinical bases and meetings across BNSSG as required to fully support the Heart Failure Service.The post holder is therefore required to hold a valid UK driving licence and independent means of transport.The post holder will spend time in offices, clinical and hospital environments&lt;/p&gt;\n&lt;p&gt;Hours of work: &lt;strong&gt;30 hours per week&lt;/strong&gt;. The service currently operates Monday-Friday (operational hours 0800-1830)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be an NMC Registered 1st level nurse; previous recent cardiology experience essential.&lt;/li&gt;\n&lt;li&gt;Non- medical prescribing qualification desirable for the role or a willingness to undertake.&lt;/li&gt;\n&lt;li&gt;Glasgow Caledonian Heart failure course or related course desirable; or willingness to undertake&lt;/li&gt;\n&lt;li&gt;Advanced ECG interpretation skills an advantage.&lt;/li&gt;\n&lt;li&gt;You will be able to evidence continuing professional development and take responsibility for your ongoing development, ensuring professional standards are maintained; statutory and mandatory training is in date.&lt;/li&gt;\n&lt;li&gt;You will work well as part of a strong committed team, and have an understanding of successful team dynamics. The ability to relate well to people and show genuine warmth, kindness and understanding towards individuals who need our care and support is essential. Excellent communication skills are key to the role.&lt;/li&gt;\n&lt;li&gt;You will be expected to engage in clinical supervision, attend regular cardiology multi-disciplinary meetings and performance reviews. Attend any training as requested.&lt;/li&gt;\n&lt;li&gt;A teaching and assessing qualification is desirable; there will be an expectation to support the team with the wider training and up-skilling needs of staff across the community and primary care interface.&lt;/li&gt;\n&lt;li&gt;Able to demonstrate and understanding of the implications of cultural differences within the healthcare setting. You will be committed to shared decision making.&lt;/li&gt;\n&lt;li&gt;You will be a great communicator, team player, enthusiastic and flexible to the changing demands of the service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information please contact Louise Carter on 0117 9617153 or Louise.carter6 @nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS16 1EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4797", "longitude": "-2.56677"}}, "title": "Heart Failure Nurse (Part-Time)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236703", "validThrough": "2020-11-08T23:59:59+0000"}