{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 pa (+ Out of Hours Enhancements)"}}, "datePosted": "2020-11-05T15:15:21+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Job Title: &lt;/strong&gt;Clinical Fellowship (Trust Specialty Registrar)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Specialty/Department: &lt;/strong&gt;Department of Hepatology&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Location: &lt;/strong&gt;Leeds Liver Unit, St James’s University Hospital&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are invited for a Clinical Fellowship at Registrar level available from March 2021 for 12 Months (6 months renewable for a further 6 months) in the Department of Hepatology at St James’s University Hospital in Leeds.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic well-motivated trainee who wants the opportunity to gain experience in the management of liver disease. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;With a growing need for doctors to understand and be able to manage patients with liver disease, this is an exciting opportunity to train in one of the leading UK Hepatology centres and contribute to the Leeds Liver Unit’s international reputation for transplantation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will gain experience in all aspects of hepatology including the assessment of patients with acute and sub-acute liver failure, assessment of patients for treatments such as liver transplantation and TIPSS, patients with a wide variety of complex general hepatological conditions and with viral hepatitis. This is a clinical post and the fellow will join the out of hours rota and have the opportunity to undertake audit and contribute to ongoing projects in the department. It is suitable for all higher stages of training including out-of-programme training and post-CCT training. Candidates must hold full MRCP or equivalent and be wanting to pursue a career in gastroenterology and ideally, hepatology.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates with experience in gastroenterology would be particularly welcome to apply as would those who are post CCT looking to gain further tertiary care experience. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Department is affiliated to the University of Leeds with the MRC funded Centre for Bioinformatics, the Leeds Institute of Data Analysis and the NIHR funded Diagnostic Evaluation Co-operative.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates should hold full licence to practise with the UK General Medical Council, have experience in gastroenterology or hepatology and be a member of one of the UK’s Royal Colleges of Physicians. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Basic salary scale - £49,036 per annum, pro rata, which will be payable based on relevant experience. An out of hours banding supplement will also apply.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interested applicants are welcome to contact Dr Mark Aldersley, Consultant Hepatologist and Lead Clinician by e-mail &lt;/span&gt;&lt;span&gt;markaldersley@nhs.net&lt;/span&gt;&lt;span&gt;and are welcome to the department for an informal visit.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122472.jpg", "name": "Abdominal Medicine and Surgery", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Trust Doctor in Hepatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258279", "validThrough": "2020-11-20T23:59:59+0000"}