{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-27T11:30:55+0000", "description": "&lt;p&gt;We are changing the way we deliver our adult community services across East and North Hertfordshire to create a single, integrated model of care. Our aim is to make healthcare more preventative rather than reactive, and to empower local teams to tailor services to the needs of their local communities.&lt;/p&gt;\n&lt;p&gt;Commissioned by East and North Hertfordshire CCG, the service is provided by Hertfordshire Community NHS Trust, Hertfordshire Partnership University Foundation Trust and Hertfordshire County Council’s Adult Care Services. The partnership organisations are working collaboratively across nursing, therapy, mental health and social care to deliver better care for our population&lt;/p&gt;\n&lt;p&gt;Exciting opportunities have arisen in our East and North Herts Overnight Service within our Community Integrated Care Teams for Nurses.&lt;/p&gt;\n&lt;p&gt;The HCT Integrated Community Care Teams are committed to delivering high quality, evidence- based nursing care to patients within their own homes and offer an integrated multidisciplinary approach in helping to support patient discharge and prevention of admission to hospital. &lt;br /&gt;&lt;br /&gt;We offer a comprehensive induction programme and the opportunity to work in a friendly, dynamic, professional and caring team.&lt;br /&gt;&lt;br /&gt;Successful candidates will need to have an ability to creatively problem solve and work on their own initiative and will need to demonstrate an understanding of current professional and community issues. Community nursing experience is preferred but there will be opportunities for training and development for the right applicants.&lt;/p&gt;\n&lt;p&gt;A full valid driving licence and access to a car to use regularly for business purposes is essential (unless you have a disability as defined by the Equality Act 2010).&lt;/p&gt;\n&lt;p&gt;In return, we can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5% on top of basic salary high cost allowance supplement (subject to a minimum and a maximum payment pro rata)&lt;/li&gt;\n&lt;li&gt;27 days holiday rising to 33 days (depending on NHS Trust service) plus bank holidays (pro rata where applicable)&lt;/li&gt;\n&lt;li&gt;One of the UK&#39;s best pension schemes&lt;/li&gt;\n&lt;li&gt;Special Leave for family and personal reasons&lt;/li&gt;\n&lt;li&gt;NHS Car Lease Scheme&lt;/li&gt;\n&lt;li&gt;Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;NHS Discounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Hertfordshire Community NHS Trust is voted as one of the &#39;Top 100 Best Places to Work&#39; (Health Service Journal). Our CQC rating is of &#39;Good&#39;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Pauline Minagh&lt;/p&gt;\n&lt;p&gt;Job title: Locality Manager&lt;/p&gt;\n&lt;p&gt;Email address: paulineminagh@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07768 368 715&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hertfordshire Community NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "QVM, Castle Ward, Welwyn", "postalCode": "AL6 9PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.828", "longitude": "-.222843"}}, "title": "Overnight Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244231", "validThrough": "2020-11-08T23:59:59+0000"}