{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-11-02T14:15:27+0000", "description": "&lt;p&gt;Hawthorns 2 is an acute ward with friendly staff and aphilosophy to provide the best possible care for people who use our services.&lt;/p&gt;\n&lt;p&gt;We provide forward thinking services to people with a wide range of mental health needs, all of whom are detained under the Mental Health Act. Our emphasis is on providing the patient with safe, personal-centred high quality care and treatment to manage their complex and longer term needs within a safe and secure environment.&lt;/p&gt;\n&lt;p&gt;We are looking for Health Care Support Workers to join our friendly team. You will be working with a supportive, motivated, friendly and dedicated team of staff whilst actively supporting the implementation of a recovery focused service We are keen for our Healthcare Support Workers to bring new ideas to the ward promoting the health and wellbeing of our service users by actively promoting and supporting the running of a group programme which includes therapeutic and social groups.&lt;/p&gt;\n&lt;p&gt;If you are looking for an exciting and challenging opportunity and have good communication skills together with a caring compassionate manner then please apply for this post. We offer excellent training and development opportunities within the Trust and provide regular supervision and support within the role.&lt;/p&gt;\n&lt;p&gt;To discuss the role please contact&lt;/p&gt;\n&lt;p&gt;Jessamy Vincent on 01256 817718&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke / Parklands Hospital", "postalCode": "RG24 9RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2827", "longitude": "-1.11187"}}, "title": "Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252369", "validThrough": "2020-11-23T23:59:59+0000"}