{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-02T14:01:48+0000", "description": "&lt;p&gt;Dudley Improvement Practice – Data Analytics Coach&lt;/p&gt;\n&lt;p&gt;An exciting opportunity to join our continuous quality improvement programme.&lt;/p&gt;\n&lt;p&gt;The Dudley Group NHS Foundation Trust is seeking to appoint an enthusiastic data analyst to join the Dudley Improvement Practice programme which has been created to develop a trust-wide culture of continuous improvement.&lt;/p&gt;\n&lt;p&gt;The Data Analytics Coach is responsible for helping staff at all levels, and in all departments, understand relevant data and use it to show improvement across four domains; delivery, quality, cost and morale. You will help produce improvement dashboards to support both clinical and operational teams in identifying opportunities to continually improve clinical workflows, process efficiency and provide analytical support.&lt;/p&gt;\n&lt;p&gt;The role is not a traditional data analyst role as it involves developing and delivering training on how to use data to tell the story and focus our curiosity. There will also be opportunity to co-facilitate improvement and team development workshops.&lt;/p&gt;\n&lt;p&gt;Using benchmarking sources such as Model Hospital and GIRFT, you will help staff become confident with the data relevant to their own service or department and allow them to use data to communicate improvement opportunity and celebrate success.&lt;/p&gt;\n&lt;p&gt;Key Skills / Experience:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Determine measures to demonstrate improvements in process design and clinical workflows.&lt;/li&gt;\n&lt;li&gt;Experience of data analytics and reporting using SQL, Excel and Microsoft Power BI.&lt;/li&gt;\n&lt;li&gt;Requirements gathering - determine reporting requirements through a consultative process.&lt;/li&gt;\n&lt;li&gt;Coaching – experience of coaching staff in the use of data and teaching non-technical staff to produce and understand data reporting tools such as SPC charts.&lt;/li&gt;\n&lt;li&gt;Patience in explaining basic data reporting methods to staff who are not confident in using data and to help staff produce well-formed report requirements.&lt;/li&gt;\n&lt;li&gt;An interest and understanding of population health analytics&lt;/li&gt;\n&lt;li&gt;Very good documentation skills for a variety of audiences&lt;/li&gt;\n&lt;li&gt;A flair for communicating information in an accessible and engaging format.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will work with the IT and Information teams to use data available from the EPR, PAS, Model Hospital, Clinical Audit databases and national surveys to help quantity improvements in operational efficiency in the Trust.&lt;/p&gt;\n&lt;p&gt;The role will bring great opportunity to build on your existing skills in a large Acute and Community NHS Trust. This is an ideal platform to enhance your information analytics experience and build your portfolio of health sector experience. There will also be a development opportunity in this role to facilitate improvement workshops using the Improvement Practice methods.&lt;/p&gt;\n&lt;p&gt;You are highly motivated, with excellent communication, administration, presentation and customer service skills. You are someone who enjoys delivering exceptional projects the department can be proud of.&lt;/p&gt;\n&lt;p&gt;Due to the need to interact with, support and build relationships with staff and teams within the trust, you will be working onsite at Russells Hall hospital for the majority of the time with only the occasional home working days. Our office area has been assessed by all relevant bodies and infection control, and measures have been put into place to ensure we are compliant with the trust policy and national guidance on social distancing which includes wearing face coverings.&lt;/p&gt;\n&lt;p&gt;If this sounds like the perfect next step in your career, I would very much like to discuss the role with you, please contact Peter Lowe, 01384 456111 Ext: 3114&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Peter Lowe - Director of Improvement&lt;/p&gt;\n&lt;p&gt;Email address: emma.hughes36@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01384 456111 ext 3114&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Data Analytics Coach", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252327", "validThrough": "2020-11-15T23:59:59+0000"}