{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T13:46:41+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to work in the Cardiology Day Unit &amp; Cardiac Catheter Laboratory within the Princess of Wales hospital, Bridgend.&lt;/p&gt;\n&lt;p&gt;Our Cardiac Catheter Laboratory provides both a diagnostic cardiac catheterisation service as well as a pacing service - both bradycardic and complex device implant.&lt;/p&gt;\n&lt;p&gt;Our Unit is where we pre-assess patients prior to their cardiac procedures, admit and recover patients attending for procedures. We also perform iron infusions, run a monthly GUCH clinic as well as a DCCV list. The unit also helps to support the wider Cardiology department by supporting DSE, TOE &amp; CT coronary angiogram lists. We also help to support the heart failure team.&lt;/p&gt;\n&lt;p&gt;We currently have an opportunity for a Band 5 staff nurse and are looking to recruit a registered nurse ideally with Cardiology experience. Whilst Cardiology experience is desirable it is not essential, however the applicant should have an interest in Cardiology.&lt;/p&gt;\n&lt;p&gt;If you are motivated, driven and would like to be part of a caring team who are dedicated to delivering high quality care to cardiology patients then please take time to consider the position.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be passionate about the profession and have a keen interest in cardiology. Training will be provided to support your career within cardiology including specific competencies for your professional development within the cardiac catheter lab and cardiology day unit.&lt;/p&gt;\n&lt;p&gt;Please contact the department if you are interested in applying for the post or want to seek further information. An informal visit is both welcomed and encouraged.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 9th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Daniel Strong - Unit Manager&lt;/p&gt;\n&lt;p&gt;Benjamin Rees - Clinical Leader&lt;/p&gt;\n&lt;p&gt;Ellen Cacanando - Clinical Leader&lt;/p&gt;\n&lt;p&gt;Tel: 01656 752932 or 01656 753352&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess of Wales Hospital, Bridgend, Bridgend", "postalCode": "CF31 1RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5177", "longitude": "-3.57165"}}, "title": "Staff Nurse Cardiac Catheter Lab &amp; Cardiology Day Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242739", "validThrough": "2020-11-09T23:59:59+0000"}