{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum pro rata"}}, "datePosted": "2020-11-05T10:31:57+0000", "description": "&lt;p&gt;We are currently recruiting a Lead Cardio-Respiratory Physiologist to lead our Cardio-Respiratory departments at both Maidstone and Tunbridge Wells hospitals. The successful candidate will be required to lead the department as we develop the service towards our strategic goals. There will also be an expectation that the candidate supports and develops the team, reviewing recruitment and retention and expand current services offered.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, dynamic leader who will be involved in many projects, including a program of service improvement and reconfiguration. Candidates must have a minimum of least 2 years’ experience at a band 8a level, within a deputy manager role or equivalent, ideally with BSE accreditation or IBHRE. Experience of EP is essential for this role.&lt;/p&gt;\n&lt;p&gt;This is an opportunity for a Physiologist with substantial experience and exceptional leadership skills looking for greater responsibility and career development to join us at a pivotal time for the MTW Cardiology department whilst we look to develop expand and reconfigure the services we provide to our patients. Continued professional development is important to our team and post graduate training is actively encouraged. This is a cross site post; therefore you will be expected to travel between Maidstone and Tunbridge Wells hospitals as required.&lt;/p&gt;\n&lt;p&gt;Maidstone &amp; Tunbridge Wells NHS Trust is located in the heart of Kent the garden of England and is a derisible location for those looking for the perfect work life balance.&lt;/p&gt;\n&lt;p&gt;The cardiorespiratory departments support invasive cardiac procedures (angioplasty, complex pacing, complex electrophysiology); pacemaker clinic (including follow up of complex devices); physiologist-led valve clinic; nurse-led rapid access chest pain clinic; BSE-accredited echocardiography department (including contrast, bubble, stress and transoesophageal echocardiography); standard non-invasive cardiac physiology (ECG, holter, exercise testing, tilt testing); pulmonary function testing. We have close link to tertiary centres.&lt;/p&gt;\n&lt;p&gt;This role will qualify for a long term payment of Recruitment and Retention Premium (RRP).&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Wednesday 18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Katie Holmes, Deputy General Manager, katie.holmes7@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone Hospital", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Lead Cardio Respiratory Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257255", "validThrough": "2020-11-18T23:59:59+0000"}