{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 Incl Fringe HCAS"}}, "datePosted": "2020-10-30T12:40:29+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for you to join the fast-paced Single Point of Access for Mindsight Surrey’s Child and Adolescent Mental Health Services (CAMHS).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Based in Guildford town centre, the team of 18 skill mix staff work together to process and clinically triage referrals for a wide variety of mental health partners, community teams and specialist CAMHS services across Surrey.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be a registered mental health professional with a clinical background in working with children and young people. They will be motivated and inspired to help increase the access to the appropriate support, guidance and services by providing high quality and accurate clinical triaging. Triages involve telephone contact with young people, families and referrers.As an experienced clinician, they will be expected to provide line management of junior clinicians and Assistant Psychologists as well as working with other senior staff to contribute to service development and leadership support. Leadership is provided by a Team Lead, a Clinical Lead and a General Manager.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service is based in a modern office block environment and is in close walking distance to town centre amenities and has excellent transport links via train, bus and Park and Ride services.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford", "postalCode": "KT22 7AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2976", "longitude": "-.335577"}}, "title": "Triage/Assessment Clinician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250203", "validThrough": "2020-11-19T23:59:59+0000"}