{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-04T11:16:27+0000", "description": "&lt;p&gt;This underpins our values as set out in the NHS Constitution, supports us to be an Employer of Choice and ultimately enables our employees to support the effective care of our patients.&lt;br /&gt;The seven integrated regions of our joint enterprise will work with local systems to support and improve how care is provided to patients and communities. These regions will be supported by the corporate centre providing expertise and developing policy. The focus will be on guiding and managing the delivery of services through local integrated health systems, sustainability and transformation partnerships, and devolution areas.&lt;br /&gt;________________________________________&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;An exciting opportunity has arisen for four new posts as Senior Digital Primary Care Manager Band 8a , within the Medical Directorate North and East Yorkshire Region, one post per area. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;• North East and North Cumbria&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• West Yorkshire and Harrogate&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Humber Coast and Vale&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• South Yorkshire and Bassetlaw&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; Each post will be aligned to a single ICS &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Note: your preferred area will be discussed during the interview.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Senior Primary Care Digital Manager, the post holder will work as part of a dynamic team in delivering an effective service supporting colleagues across the North East and Yorkshire Region.&lt;/p&gt;\n&lt;p&gt;Each post will be aligned to a single ICS&lt;/p&gt;\n&lt;p&gt;The post holder will work as part of a matrix with NHSx, NHS Digital, local CCG, Provider Trusts, CSU’s and other Digital/Informatics delivery colleagues, providing support to the regional Heads of Digital Transformation with delivery of the Digital Primary Care Transformation agenda.&lt;/p&gt;\n&lt;p&gt;They will support the delivery of strategic advice to senior&lt;br /&gt;leaders across the region to coordinate a variety of approaches to planning and investment in digitally enabled services for Primary Care.&lt;/p&gt;\n&lt;p&gt;They will apply appropriate project and programme management methodologies and will ensure the development of appropriate documents, plans, reports and controls in accordance with corporate standards.&lt;/p&gt;\n&lt;p&gt;The post holder will define current processes, facilitate discussions and advise colleagues as to how best practice might be adopted in the definition of future processes, document those processes as they are agreed and oversee their delivery and:&lt;/p&gt;\n&lt;p&gt;• Ensure information is properly managed and best practice is shared across the team, through shared working areas.&lt;br /&gt;• Liaise with appropriate functions within the National directorate, other regions and local Director of Commissioning Operations (DCO) teams. &lt;br /&gt;For further information about the role please refer to the attached Job Description &amp; Specifications&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information about the role please refer to the attached Job Description &amp; Specifications.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Kerry Wheeler&lt;/p&gt;\n&lt;p&gt;Job title: Senior Manager&lt;/p&gt;\n&lt;p&gt;Email address: kerry.wheeler@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Quarry House, Leeds", "postalCode": "LS2 7UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Senior Digital Primary Care Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255580", "validThrough": "2020-11-08T23:59:59+0000"}