{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "Band 8a £52,643 - £58,558  pa Inc. HCAS"}}, "datePosted": "2020-10-29T09:53:09+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;London is the hub for all cardiac services across the UK. Based in the heart of the city, the Royal Brompton Hospital is one of two hospitals comprising The Royal Brompton &amp; Harefield NHS Foundation Trust which is known throughout the world for their expertise, high standard of care and research. Our vision is to be a leading national and international centre for treating heart and lung disease, developing services through research and clinical practice to improve the health of people across the world.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The Royal Brompton Hospital aims to provide specialist expertise and clinical care for our patients and as such provides a complete range of cardiac services to neonatal, infant, GUCH and adult patients. As well as providing standard and advanced cardiopulmonary bypass techniques, the perfusion department is also responsible for intra-aortic balloon counter pulsation, intra-operative cell salvage, and a variety of coagulation monitoring in our point of care testing room.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Our transcatheter aortic valve implantation (TAVI) programme is well established and the Trust has recently undertaken a number of transcatheter mitral valve implantations (TMVI). We have recently completed work on our new Hybrid Theatre which combines a traditional operating theatre with state of the art imaging facilities making it possible to carry out a combination of medical procedures at the same time, rather than multiple admissions to either catheter laboratory or theatres over several weeks. Our role in this area is constantly evolving and we are often required to provide circulatory support particularly for complex aortic procedures in high risk patients.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;In addition, the Royal Brompton Hospital is one of only five centres in England commissioned to provide veno-venous Extra Corporeal Membrane Oxygenation (ECMO) for severe acute respiratory failure in adults. We also provide veno-arterial ECMO for severe cardiac failure both in children and adults, and implant ventricular assist devices. We have an active retrieval team with patients being referred from all over the South West of England and Wales. We work closely with our colleagues in Harefield Hospital who offer thriving transplant, ventricular assist, and total artificial heart programmes.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Our congenital heart disease (CHD) programme has recently been recommissioned by NHS England to continue the world class standard of care we provide for our patients. Having worked closely with Guy’s and St. Thomas’ Hospital over the past year advancing our renowned VV-ECMO programme we are continuing our collaboration with the development of a strategic partnership with King’s Health Partners. This innovative venture would see the creation of a new standardised model healthcare system for a large population delivering world class care unsurpassed by any other congenital heart disease centre in the UK.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;As a nationally accredited training unit, we place emphasis on training and education and the continual professional development of all our staff. We provide regular seminars and wet lab sessions for the wider theatre team and staff from other departments. We promote attendance and participation at all relevant scientific meetings and our practice is constantly evolving based on best scientific evidence. The opportunity for research is also available.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;This is an exciting opportunity for a Clinical Perfusionist at any stage of their career to be part of the extensive range of highly &lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;specialised&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt; services that we provide for our patients. We are searching for a highly motivated and enthusiastic individual to join our existing team of Clinical Perfusion Scientists at the Royal Brompton site in South Kensington, London. This position is for either a Band 7 Senior Clinical Perfusionist or Band 8a Lead Clinical Perfusionist (dependent on experience) and applicants should be competent in a wide range of perfusion techniques used in adult cardiac surgery and be familiar with associated therapies such as intra-aortic balloon counter pulsation, intra-operative cell salvage and coagulation monitoring with thromboelastography. Applicants should have good communication skills and be able to work well within a multi-disciplinary team.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;This role would be ideally suited to candidates seeking exposure to perfusion techniques beyond those encountered during routine adult cardiac surgery. Although experience of paediatric perfusion and ECMO techniques is desirable, it is not essential and further training in these areas will be given to the successful candidate.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Accreditation with the Society of Clinical Perfusion Scientists of Great Britain and Ireland and registration with the College of Clinical Perfusion Scientists of Great Britain and Ireland are essential requirements for this post.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The successful candidate will be required to fully participate in the 24-hour On-Call service. We currently offer a 37.5 hour week, spread over 4 days.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;For further information or to arrange an informal visit, please contact Tim Jackson, Head of Perfusion (RBH), on 020 7351 8741 or email t.jackson2@rbht.nhs.uk&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Staff benefits include: subsidised childcare facilities, occupational pension scheme, personal development and training opportunities and flexible working. Subsidised accommodation is available.&lt;br /&gt;&lt;br /&gt;To ensure that our workforce is representative of the population we serve, we welcome applications from all sections of the community.&lt;br /&gt;&lt;br /&gt;Due to the popularity of some positions, we reserve the right to close the vacancies early on receipt of sufficient applicants.&lt;br /&gt;&lt;br /&gt; In an effort to reduce the Trusts carbon footprint all correspondence regarding this vacancy will be by electronic means i.e. email or text message please ensure you check your emails regularly.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Please be aware that messages may go in to your junk/spam mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121402.jpg", "name": "Royal Brompton and Harefield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121402"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Brompton Hospital  London  SW3 6NP", "postalCode": "SW3 6NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4897", "longitude": "-.170831"}}, "title": "Lead Clinical Perfusion Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247787", "validThrough": "2020-11-12T23:59:59+0000"}