{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 p.a. pro rata"}}, "datePosted": "2020-10-26T10:34:05+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic, highly motivated and forward thinking Healthcare Support Workers to join our Special School Nursing team. As part of Solent NHS Trust’s integrated Community Children’s Nursing Service within the West locality, we now provide Specialist School Nursing to six Special Schools across the Southampton and Hampshire area and we are looking to recruit two Healthcare Support Workers across our Southampton City Special Need Schools, one to be based at Cedar and one at Rosewood Free School.&lt;/p&gt;\n&lt;p&gt;You will be part of a close knit collaborative team who pride themselves in providing the highest standard of care to our patients and their families. To work in partnership with the special school nurses (SSNs) to provide health care and support to children with complex health care need and to work alongside carers, school staff and the wider multi-disciplinary team within the education setting to ensure a supportive and caring learning environment. This will include emotional and physical support to the children and their families, undertake assigned nursing tasks for children, such as medication administration, tracheostomy care, enteral feeding and seizure management (this is not exhaustive) as delegated by the registered nurse. Undertake other delegated tasks required to support the children to remain at school and avoid unnecessary hospital admissions and to complete administrative duties to support the role as and when required.&lt;/p&gt;\n&lt;p&gt;If you have excellent communication and interpersonal skills, the ability to work as a team player, as well as the initiative to work autonomously, we would like to hear from you. You should have good organisational skills.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It would be desirable for the candidates to have recent experience of working with children, especially with learning disabilities and previous experience of special school nursing would be desirable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At Solent NHS Trust, we are committed to putting patients at the forefront of care and are always looking for dedicated professionals who share our HEART values and passion for delivering high quality care. As a valued member of Solent NHS Trust, we’ll offer you a competitive salary, NHS pension, on-going training and development and good quality working conditions. Solent NHS Trust is a well-regarded and established provider of community services in Southampton. Join us and be part of a truly compassionate and caring team working to make a real difference within our trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If our Special School Healthcare Support Worker role appeals to you, and you have the qualities we are looking for, share our values and feel excited by the prospect of how we can complement your professional career then we would love to hear from you. We welcome you to contact us prior to interview to discuss this post further and to arrange a suitable time to come along for an informal visit.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This vacancy is for 22.5 hours working 10am - 2pm Monday to Friday Term Time only, on a fixed term contract until July 2021, with a view to extension.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Healthcare Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242029", "validThrough": "2020-11-19T23:59:59+0000"}