{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 pa inc"}}, "datePosted": "2020-11-04T09:46:09+0000", "description": "&lt;h1&gt;Practice Development Nurse (Nurse Trainer), Band 8a&lt;/h1&gt;\n&lt;p&gt;Full time, Fixed Term, 12 months.&lt;/p&gt;\n&lt;p&gt;Do you have an interest in working within a complex, challenging and rewarding environment? We are looking practice development who can drive training and development for nursing staff. Experience in A+E will be essential including prison experience.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Practice Development Nurse working within the primary care service within the Greenwich Cluster prison (HMP Thameside, Belmarsh and Isis). This is a 12 months fixed term position with possibility of becoming permanent.&lt;/p&gt;\n&lt;p&gt;HMP Thameside is a public sector, category B remand prison holding approximately 1250 men aged 18 years upwards who are serving prison sentences. The prison was built approximately 8 years ago so is a modern prison boasting modern facilities.&lt;/p&gt;\n&lt;p&gt;HMP Belmarsh is cat A ( High Secure) with population capacity of 900.&lt;/p&gt;\n&lt;p&gt;HMP Isis is a young offender prison with a capacity of 600 prisoners.&lt;/p&gt;\n&lt;p&gt;The prisons boasts a state of the art gym facility which can be accessed by staff free of charge. There is also a staff canteen. There are free staff parking facilities available at all the prisons and the prisons are local to Plummeted and Woolwich Arsenal, so has close access to several bus routes and train stations.&lt;/p&gt;\n&lt;p&gt;The post holder will provide training and development for primary care nurses and HCAs. The post holder will be expected to attend emergency to identify training needs and supporting staff in managing emergency incidents. The post holders will work within the team of multidisciplinary staff to assist &amp; support senior staff to deliver a nurse-led integrated primary care services and develop a specialist practice-based clinical model within the prisons.&lt;/p&gt;\n&lt;p&gt;Services include primary care support to Reception, First Night Centers, long-term conditions management and enhanced diagnostic, assessment and treatment as part of the integrated service, as well as providing a range of quality services and interventions within a larger multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;The successful candidate/s will be qualified and experienced practitioners.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameModou BarrowJob titleOperational ManagerEmail addressmodoulaminbarrow@nhs.netTelephone number02083317450&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120829.png", "name": "Oxleas NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120829"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Thameside (Greenwich Cluster prisons) in cluding Belmarsh and HMP Isis, Thamesmead, London", "postalCode": "SE15 6FZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.478", "longitude": "-.071085"}}, "title": "Practice Development Nurse (Nurse Trainer)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255229", "validThrough": "2020-11-19T23:59:59+0000"}