{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 per annum pro"}}, "datePosted": "2020-11-04T14:30:11+0000", "description": "&lt;p&gt;We are inviting applications for a highly motivated and dynamic staff nurse to join North Tees &amp; Hartlepool Community Nursing Service. This service will provide care to patients within a range of settings including patients own homes and residential care homes . The post holder will have a level of knowledge in the field of community care and will have a specific interest in areas such as palliative care, long term conditions and wound care. You will be required to work autonomously to provide a whole person approach to the care and management for patients within this setting.&lt;/p&gt;\n&lt;p&gt;The post involves liaising with a variety of health and social care providers and other agencies to ensure the provision of high quality care management to this group of patients and their carers.&lt;/p&gt;\n&lt;p&gt;We require a first level nurse who has excellent communication skills and who is confident working across professional boundaries. You will need to be flexible, adaptable &amp; a good team player with the ability to work independently within a community setting. Candidates are expected to have recent community nursing experience.&lt;/p&gt;\n&lt;p&gt;** &lt;strong&gt;A&lt;span&gt;pplicants must have 12 months post registration experience **&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMel CambageJob titleCare Group Head of NursingEmail addressmelanie.cambage@nhs.netTelephone number07824896078Additional contact information&lt;/p&gt;\n&lt;p&gt;Mel Cambage, Care Group Head of Nursing 07824 896078&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Tees and Hartlepool NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120670"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockton (Community based), Stockton on Tees", "postalCode": "TS19 8PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5829", "longitude": "-1.34677"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256217", "validThrough": "2020-11-14T23:59:59+0000"}