{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "57596", "minValue": "51383", "unitText": "YEAR", "value": "£51,383 - £57,596 p.a inc. HCA"}}, "datePosted": "2020-10-22T14:46:01+0100", "description": "&lt;p&gt;The Rapid Diagnostic Clinic (RDC) at GSTT was established in 2016 as a referral route for GP’s where cancer is in the differential diagnosis but the patient does not fit a traditional 2 week wait pathway. RDC’s have also been adopted by NHS England as a key part of earlier diagnosis of cancer and other serious conditions and rolled out nationally as part of the long term plan with an aim of all 75% of cancers being diagnosed at stage 1 or 2 by 2028.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At GSTT we offer patients a holistic, systematic review of their symptoms with a view to an established diagnosis before onward secondary care referral or discharge to primary care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an innovative and rapidly expanding service available across all South East London Clinical Commissioning Groups, covering all patients 18 years and over. The service has well established and close working links between primary and secondary care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for an experienced nurse with considerable advanced nursing skills to join the Rapid Diagnostic Service at Guy’s and St Thomas NHS Foundation Trust. The post holder has a distinct level of responsibility to patients with concerning non site-specific symptoms. The post holder will become a valued member of the Rapid Diagnostic Clinic at GSTT. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be enthusiastic and experienced, who enjoys patient contact and working in a multi-disciplinary environment to support the delivery of a quality service. You must be able to demonstrate good communication skills, flexibility, and reliability and have an organised approach to work. The successful candidate will be responsible for the day to day management of the RDC as well as engagement with the South East London Cancer alliance, third sector organisations and appropriate local stakeholders when required. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to the nature of the role, we are looking for a dependable and highly adaptable individual who works independently and has the ability to fit in quickly as part of a team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note we have two vacancies for this post:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;2 x Full time 37.5 hours per week - Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date 16th November 2020&lt;/p&gt;\n&lt;p&gt;Interview date: 1st December 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Saoirse Dolly - Consultant in Rapid Access Clinic&lt;/p&gt;\n&lt;p&gt;saoirse.dolly@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;OR&lt;/p&gt;\n&lt;p&gt;Laura Dopson - Head of Nursing - Oncology&lt;/p&gt;\n&lt;p&gt;Laura.Dopson@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s site, London Bridge, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Advanced Nurse Practitioner - Rapid Diagnostic Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238969", "validThrough": "2020-11-16T23:59:59+0000"}