{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T12:31:26+0000", "description": "&lt;p&gt;*Previous applicants need not apply*&lt;/p&gt;\n&lt;p&gt;Ainderby ward at the Friarage Hospital is looking for a registered nurse to join our team.&lt;/p&gt;\n&lt;p&gt;We are recruiting to fill a full-time post in one of our 20 bedded medical wards at the Friarage Hospital in Northallerton, North Yorkshire.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, motivated and dedicated staff nurse who is committed to delivering a high quality of nursing care and putting the patient at the core of everything we do. We care for medical patients with varied needs ranging from acute illness management (predominately respiratory) through to the complexities of discharge processes. To achieve this we have strong links to the extended multi-disciplinary team and community services in the area.&lt;/p&gt;\n&lt;p&gt;It is essential that you can demonstrate your commitment to maintaining evidence based practice, professional standards and your own personal development to enable you to provide the highest of safe, dignified and quality care. We want staff that can make a positive difference to people’s lives. We are passionate about providing the best service we can and working with our patients and their families to achieve this.&lt;/p&gt;\n&lt;p&gt;If you are a newly qualified nurse you will benefit from our highly regarded preceptorship programme.&lt;/p&gt;\n&lt;p&gt;We have a strengthened leadership team at the Friarage with an operational service manager and a clinical matron on site.&lt;/p&gt;\n&lt;p&gt;The Friarage Hospital is within easy reach of Teesside from the North via the A19 or York is 50 minutes south. There’s also great train links to Northallerton centre which is a lovely traditional market town. Car Parking facilities at the Friarage are also very good.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCharlotte PybusJob titleWard ManagerEmail addresscharlotte.pybus@nhs.netTelephone number01609 762076Additional contact information&lt;/p&gt;\n&lt;p&gt;or Steph Aitken (Ward Sister) on the same number&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120671.jpg", "name": "South Tees Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120671"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Friarage Hospital", "postalCode": "DL6 1JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3426", "longitude": "-1.43039"}}, "title": "Staff Nurse (Ainderby Ward)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246602", "validThrough": "2020-11-11T23:59:59+0000"}