{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-05T13:17:05+0000", "description": "&lt;p&gt;East Coast Community Healthcare CIC is an exciting social enterprise providing a range of NHS community health and social care services across the Suffolk / Norfolk border area.&lt;br /&gt;Are you a registered nurse passionate about the delivery of effective person centered care? Are you committed to delivering care closer to home? Do you relish the opportunity to provide nursing care to people in their own homes?&lt;br /&gt;Have you considered community nursing?&lt;br /&gt;You should be motivated to deliver high quality evidence based skilled nursing care within the community setting and you will have good communication skills and be able to work autonomously.&lt;br /&gt;The Great Yarmouth and Northern Villages PCH are looking for an enthusiastic nurse to join their busy team, which covers Great Yarmouth and the surrounding villages.&lt;br /&gt;Community nursing offers a different experience to traditional ward based nursing; it does provide the opportunity to deliver a wide range of nursing interventions to people in their own home and within residential care. As a community nurse you will develop confidence and become expert in clinical skills including wound care and have the opportunity to deliver end of life care for people in their preferred place.&lt;br /&gt;The community nursing service is commissioned to provide a 24/7 service. The core shift is 08.30 -16.30 hours, however the applicant will be required to participate in working other shifts as part of the role including weekend and bank holidays working on a rotational basis.&lt;br /&gt;We welcome applications from experienced staff wishing for a change in direction and from new registrants who we offer a supportive environment to complete a robust preceptorship programme.&lt;/p&gt;\n&lt;p&gt;The team describes working in the community .&lt;br /&gt;“ You get to know your patient’s really well and give continuity of care because of caseload management.”&lt;br /&gt;“Able to manage own time which gives you longer with the patients and their family”&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127294.png", "name": "East Coast Community Healthcare CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Yarmouth", "postalCode": "NR30 1BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6176", "longitude": "1.7286"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257846", "validThrough": "2020-11-19T23:59:59+0000"}