{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42000", "minValue": "42000", "unitText": "YEAR", "value": "£42,000 pro rata"}}, "datePosted": "2020-11-06T14:55:16+0000", "description": "&lt;h2&gt;Job Introduction&lt;/h2&gt;\n&lt;p&gt;At Turning Point, we support people across England with mental health issues. We make a real difference to their lives as we introduce them to the personal, flexible and realistic support they need to improve the quality of their lives in their communities. Passionate about people, you&#39;ll enjoy the scope and support to enhance your own life and career too, asyou gain the experience, training and education you need to progress in your career with us.&lt;/p&gt;\n&lt;p&gt;Nottingham Personality Disorder Pathway is a new community based service that offers innovative and proactive support to individuals with a diagnosis of a Personality Disorder. The service delivers strengths-based and psychologically informed support using a blended method of both face to face and digital technology. A Core Therapeutic Programme involving elements of Dialectical Behaviour Therapy and Mood Management is offered alongside evidence-based Mindfulness and Relapse Prevention Skills. Individuals will be supported by a team consisting of Psychology Practitioners and Peer Support Workers.&lt;/p&gt;\n&lt;p&gt;This is a part-time role - 22.5 hours per week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are open to candidates from across the UK as the work will be done mainly remotely with visits to the servicewhen required.&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;Main Responsibilities&lt;/h2&gt;\n&lt;p&gt;As a Clinical Psychologist, you will be responsible for having clinical oversight on a community based Personality Disorder service. You will manage the implementation of the Core Therapeutic Programme based on Psycho Social Interventions for group settings and on an individual basis.&lt;/p&gt;\n&lt;p&gt;The Clinical Psychologist will provide clinical guidance and training for the teams of Assistant Psychologists and Peer Support Workers, to ensure high quality interventions are provided.&lt;/p&gt;\n&lt;p&gt;You will provide regular clinical supervision that encourages reflective practice and will inspire your team members in an inclusive manner.&lt;/p&gt;\n&lt;p&gt;Working in line with regulatory and professional body guidance and policy, you will undertake specialist psychological assessments of service users, including clinical risk assessments, based upon a variety of sources including self-reporting measures, rating scales, observations and liaising with wider colleagues within the local NHS Trust.&lt;/p&gt;\n&lt;p&gt;You will be required to take a leading role in monitoring and evaluating the service by initiating, designing and undertaking/supervising service-related research and evaluation projects.&lt;/p&gt;\n&lt;h2&gt;The Ideal Candidate&lt;/h2&gt;\n&lt;p&gt;Along with up to date registration through the Health and Social Professions Council (HCPC) as a Clinical Psychologist, you will have proven ability to deliver psychological services. Your experience of leading and supervising clinical staff will be supported by experience of working with services users with a diagnosis of Personality Disorder. Formal training in supervision, whilst not essential, would be desirable. Excellent communication skills, adaptability and commitment to the service, will all contribute to you becoming a vital member of our clinical leadership team.&lt;/p&gt;\n&lt;h2&gt;About us&lt;/h2&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What benefits will I receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive Learning and Development opportunities - we are Investors in People Silver accredited&lt;/li&gt;\n&lt;li&gt;33 days holiday, increasing with each year of service until 35days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including, bike to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive Pension and Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme and access to online Health and Wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work/life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts including Cinema, Groceries and Gym.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closing date.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nationwide", "postalCode": "NG7 1FL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9482", "longitude": "-1.15654"}}, "title": "Clinical Psychologist - Personality Disorder Pathway", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260226", "validThrough": "2020-11-30T23:59:59+0000"}