{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "66590", "minValue": "60587", "unitText": "YEAR", "value": "60587  - 66590  GBP per year"}}, "datePosted": "2020-10-26T11:18:16+0000", "description": "&lt;p&gt;Job summary&lt;/p&gt;\n&lt;p&gt;Sonographer Manager&lt;/p&gt;\n&lt;p&gt;Jersey General Hospital&lt;/p&gt;\n&lt;p&gt;Grade 12&lt;/p&gt;\n&lt;p&gt;Salary £60,587&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a sonographer to join and manage the general ultrasound team in Jersey. The clinical work is interesting and varied but does not include any obstetric scanning. The management part of the role is focused on Ultrasound and also includes a contribution to the overall Radiology service. We are a lively group and strive to be the best we can.&lt;/p&gt;\n&lt;p&gt;Jersey is situated in the English Channel and it boasts many local Heritage sites and some of the world’s finest beaches. Due to the mild climate walking, cycling, numerous water sports and many other outdoor pursuits are all on your doorstep. It is a very safe island for families.&lt;/p&gt;\n&lt;p&gt;The successful applicant must have experience in a wide range of ultrasound examinations and management of an ultrasound service. Participation in the sonographer on call service is required. We are QSI accredited which brings many opportunities and we aim to deliver excellent patient care. A relocation package is available to successful off island applicants. If you would like an informal discussion about the role, please send your telephone number by email to John Bayford at j.bayford@health.gov.je and tell us when it is best for us to call you back.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health and Community Services Jersey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135055"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jersey", "postalCode": "JE1 3QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "49.1833", "longitude": "-2.1"}}, "title": "Ultrasound Modality Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242186", "validThrough": "2020-12-04T23:59:59+0000"}