{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 per annum"}}, "datePosted": "2020-10-23T11:31:07+0100", "description": "&lt;p&gt;Enthusiastic newly qualified midwives are invited to join our fantastic multi disciplinary maternity team. &lt;br /&gt;&lt;br /&gt;Band 5 Midwives will undertake a robust preceptorship programme over 18 months which will provide you with the support and professional development you require to ensure you have the skills and qualities embedded to enable progression to a competent and confident band 6 midwife.&lt;/p&gt;\n&lt;p&gt;Band 6 Midwives will be required to assess, plan and deliver total midwifery care for a caseload of women within the community, prioritising workload and management of time.&lt;/p&gt;\n&lt;p&gt;We are extremely proud of the maternity service provided by the team at Southend, advocating high quality care and a positive experience for women and their families is a key philosophy alongside continually striving to support professional development and innovation.&lt;/p&gt;\n&lt;p&gt;Our passion for midwifery led care is demonstrated in the success of our homebirth rate and midwifery led birthing unit.&lt;/p&gt;\n&lt;p&gt;Working alongside Professor Nikolides from Kings College Hospital Southend&#39;s Fetal Medicine Centre provides care for women following the fetal Medicine foundation model.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Trust and Local Area&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Southend-On-Sea is an exciting place to live, work and enjoy life. Just under an hour from London and Europe (either by rail or air), Southend and the surrounding area is vibrant and cosmopolitan. Local schools have an excellent reputation and the nearby seaside provides a pleasant backdrop as well as opportunities for fun or relaxation. The attractive nearby town of popular Leigh-On-Sea voted the happiest place to live in the UK provides an alternative location for many professionals to settle and wind down after work and is only 3 miles away.&lt;/p&gt;\n&lt;p&gt;Looking for Outstanding schools? We have 4 of the country&#39;s leading grammar schools and multiple Outstanding [Ofsted rated] primary schools in the immediate vicinity&lt;/p&gt;\n&lt;p&gt;Want a great place to work with big potential? Southend Hospital is the leading specialist cancer hospital in the region. The planned merger of the 3 local hospitals will serve more than 1.1 million people across Essex, employing more than 14,000 staff&lt;/p&gt;\n&lt;p&gt;Please note this role will close should we receive sufficient applications&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnne Marie CheeseboroughJob titleMaternity MatronEmail addressanna.cheeseborough@southend.nhs.ukTelephone number01702 435555 ext 7016Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact:&lt;/p&gt;\n&lt;p&gt;Anne Marie Cheeseborough - maternity manager - Anna.cheeseborough@southend.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend University Hospital NHS Trust, Southend on Sea", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Band 5 or Band 6 Midwife depending on experience", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240322", "validThrough": "2020-11-06T23:59:59+0000"}