{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "National Payscales Apply"}}, "datePosted": "2020-11-06T09:00:29+0000", "description": "&lt;p&gt;&lt;strong&gt; “AT SOUTH TEES, OUR PATIENTS CONSISTENTLY ACKNOWLEDGE THE HIGH QUALITY OF CARE WE PROVIDE” &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hospitals The James Cook University Hospital, Middlesbrough &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Friarage Hospital Northallerton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONSULTANT IN COMMUNITY PAEDIATRICS-1 post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;10 PA contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Current NHS Consultant Terms and Conditions&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting opportunity to join an experienced and motivated child and young people service team at South Tees Hospitals NHS Foundation Trust. The Department of Paediatrics at South Tees is a dynamic department working across two sites, Middlesbrough and Northallerton. This is a substantive post of Community Paediatrician. All consultants work cross site and a variety of opportunities are available for this. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a large secondary care centre in Tees Valley area providing acute, Community and specialist as well as planned services for children in Middlesbrough, Redcar and Northallerton. We provide a broad range of specialist treatments including diabetes, epilepsy, cystic fibrosis, asthma, paediatric endocrine, allergies, Gastroenterology and the full range of Community Paediatric Services. We have 6 commissioned level 2 HDU bed and we are part of North East Paediatric Critical Care Network.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a large number of trainees in the department at all levels of training covering Tier 1 and 2 rota including foundation doctors, general practice training, military GP trainee and specialist trainees rotating across the Northern Deanery. The department is actively involved in the delivery of the undergraduate education programme for medical students of Newcastle and Hull University.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust is one of the largest Foundation Trusts in England. Working in the North East offers an excellent quality of life. This area boasts great transport links with easy access to a beautiful coastline/countryside and a great range of local amenities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants should possess full GMC registration, MRCPCH (or equivalent) and either already be on the Specialist Register or be within 6 months of receiving their Certificate of Completion of Training (CCT) for paediatrics at the time of interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates will be appointed under the current terms and conditions of service for NHS Consultants. Full consideration will be given to applicants who wish to apply for a reduced/part time contract.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job Description, further details and applications to be made online at NHS Jobs. For further information about the post or to arrange an informal visit, please contact Dr Ramesh Kumar, Clinical Director, The James Cook University Hospital on 01642 282753&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRamesh KumarJob titleConsultantEmail addressramesh.kumar@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120671.jpg", "name": "South Tees Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120671"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Middlesbrough/Northallerton", "postalCode": "TS4 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5518", "longitude": "-1.21482"}}, "title": "Consultant in Community Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258951", "validThrough": "2020-12-06T23:59:59+0000"}