{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T15:06:09+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;&lt;strong&gt;**PLEASE NOTE, IF YOU HAVE RECENTLY APPLIED FOR THIS VACANCY AND NOT BEEN SHORTLISTED, PLEASE DO NOT RE-APPLY UNTIL A MINIMUM PERIOD OF 6 MONTHS HAS LAPSED. THANK YOU**&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Surgical Services Band 5 Nurse Recruitment Campaign&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Help us with our ambition and we’ll help you to achieve yours.&lt;/p&gt;\n&lt;p&gt;Are you looking to be part of a dynamic organisation, with an overall aim to deliver outstanding patient care? Do you have excellent clinical skills and a desire to further develop your knowledge and skill base?&lt;/p&gt;\n&lt;p&gt;SWB is hosting a recruitment month for all Qualified Nursing staff..&lt;/p&gt;\n&lt;p&gt;We will be offering interviews throughout October with an unconditional job offer. Upon making an application we will find an interview date and time convenient for you. This interview will be undertaken online via WebEx.&lt;/p&gt;\n&lt;p&gt;Surgery is a diverse and expanding service at SWB. Over the last twelve months the Trust has made significant investment across our wards, theatres and specialist services. The surgical service is an innovative and progressive group within the Trust, which will support you in expanding and growing your career pathways as well as creating opportunity for you in your clinical practice, leadership and management portfolio.&lt;/p&gt;\n&lt;p&gt;We are seeking  experienced and newly qualified registered nurses who are passionate about delivering person centered care, enhancing the patient experience and improving outcomes.&lt;/p&gt;\n&lt;p&gt;The services we are recruiting to across City and Sandwell sites include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Colorectal Surgery&lt;/li&gt;\n&lt;li&gt;Trauma&lt;/li&gt;\n&lt;li&gt;Orthopaedics&lt;/li&gt;\n&lt;li&gt;ENT&lt;/li&gt;\n&lt;li&gt;Urology&lt;/li&gt;\n&lt;li&gt;Critical Care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Future opportunities within surgical services will lie at the Midland Metropolitan University Hospital, a purpose built acute hospital due to be completed in 2022, which on opening will become not just a major healthcare hub within the local region but within Europe as a whole.&lt;/p&gt;\n&lt;p&gt;We promise to provide you with exciting opportunities across the patient journey, which will include a 6 week induction in one of our outstanding critical care units, pre-assessment, theatre and ward experience as well as the opportunity to visit our community services that form part of our integrated care for patients. We have dedicated practice development nursing teams who will support you through your nursing career and help you become the healthcare worker what you want to be. We can offer a range of flexible working times to provide a commitment to you in regard to work life balance and wellbeing.&lt;/p&gt;\n&lt;p&gt;We recognise that outstanding nursing is fundamental to the delivery of the safest and highest quality patient care and therefore your commitment to us will be nurtured and reflected through your career journey at the Trust.&lt;/p&gt;\n&lt;p&gt;Staff benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Onsite free gym on both hospital sites&lt;/li&gt;\n&lt;li&gt;Childcare facilities&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Savings with local supermarkets / national and local discounts&lt;/li&gt;\n&lt;li&gt;Financial advice through Neyber&lt;/li&gt;\n&lt;li&gt;Subsidised purchase schemes for new technology&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a really exciting time for our organisation, with the opening of a brand new hospital in the future and the continued evolution of the way we perform cutting edge medicine. We look forward to meeting you and inviting you to &lt;strong&gt;#bepartofsomethingamazing.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details:&lt;/p&gt;\n&lt;p&gt;Name: Angie Smith&lt;/p&gt;\n&lt;p&gt;Email address: angie.smith4@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0121 507 2713&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell and West Birmingham NHS Trust, Sandwell and West Birmingham", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Staff Nurse- Surgical Services Open Day", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256360", "validThrough": "2020-11-15T23:59:59+0000"}