{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa pro rata"}}, "datePosted": "2020-11-05T11:01:24+0000", "description": "&lt;p&gt;Maidstone and Tunbridge Wells NHS Trust is a dynamic and successful organisation with a strong focus on delivering quality care to our population of around 560,000 people. We provide a comprehensive range of secondary care services from 2 hospitals based in Maidstone and Tunbridge Wells.&lt;br /&gt;&lt;br /&gt;An exciting opportunity has arisen to appoint an enthusiastic and highly motivated person to undertake the role of a Nursery Nurse within the Children’s Emergency Department at Tunbridge Wells Hospital.&lt;br /&gt;&lt;br /&gt;We are looking for a member of staff to join our very busy Paediatric team in providing the highest quality family-centred care to infants, children and young people aged 0-16 years.&lt;br /&gt;&lt;br /&gt;You will become part of a dedicated team of experienced and motivated nurses, carrying&lt;br /&gt;out a variety of duties, both clinical and non-clinical. These include skills such as wound care, clinical observations, assisting in procedures and providing distraction and play whilst children are in the Paediatric Emergency Department. The role will also have a&lt;br /&gt;housekeeping element requiring good organisational skills.&lt;br /&gt;&lt;br /&gt;Effective communication skills with children of all ages, their families and other members of the multidisciplinary team and the ability to organise allocated work are essential&lt;br /&gt;components for this post.&lt;br /&gt;&lt;br /&gt;You will be expected to maintain confidentiality and adopt a positive attitude towards staff, children and families at all times, in accordance with Trust policies and procedures, referring issues to the Line Manager as appropriate.&lt;br /&gt;&lt;br /&gt;The role will be within the Acute Medicine Directorate located in Children’s Emergency&lt;br /&gt;Department at the Trust’s Tunbridge Wells site and at Maidstone Hospital site. Currently,&lt;br /&gt;due to COVID segregation, Children’s ED is relocated to the Paediatric day assessment units, returning to the separate children’s ED within A&amp;E in the future&lt;br /&gt;&lt;br /&gt;The post-holders will be supported to achieve a diverse range of clinical competencies to fulfil the requirements of the role and we pride ourselves on a proactive learning&lt;br /&gt;environment with excellent opportunities for further personal and professional&lt;br /&gt;development. This will include a minor injury study day, mental health “We can talk”&lt;br /&gt;training and other bespoke team days.&lt;/p&gt;\n&lt;p&gt;Please do not hesitate to call for an informal discussion, leave a contact number and we will call you back.&lt;br /&gt;&lt;br /&gt;Should we receive a high volume of applications for this vacancy, the advert may be closed earlier than stated.&lt;br /&gt;&lt;br /&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp;&lt;br /&gt;Barring Service Check at enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;br /&gt;&lt;br /&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to  embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Closing Date: Friday 13th November 2020&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Interviews: Thursday 19th November 2020&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt;For further details / informal visits contact:&lt;br /&gt;&lt;br /&gt;Mags Trend – Paediatric Senior Sister, Children’s Emergency Department 01892 63174&lt;br /&gt;margaret.trend@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tunbridge Wells with cross site working", "postalCode": "TN2 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1491", "longitude": ".307289"}}, "title": "Nursery Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257350", "validThrough": "2020-11-13T23:59:59+0000"}