{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-22T09:31:19+0100", "description": "&lt;p&gt;An opportunity has arisen for an enthusiastic and motivated individual to join the Point Of Care Testing (POCT) team within Blackpool NHS Foundation Trust. Although this post is primarily based at Blackpool Victoria Hospital the successful candidate may be expected to carry out work at other Trust sites when required.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to take on a role as POCT Practitioner in a small but very busy team looking after the Trust&#39;s point of care devices. The successful candidate will be instrumental in assisting the department to continue to provide support to clinical staff with existing POCT devices and aid in the implementation of new POCT projects.&lt;/p&gt;\n&lt;p&gt;Suitable candidates will require a relevant professional/scientific qualification to degree level or higher. They should have current registration with the HCPC or NMC or equivalent&lt;/p&gt;\n&lt;p&gt;The successful candidate will be involved in the day to day running of the POCT service and assist in areas of staff training, POCT device Governance and project implementation including device verification and change control procedures. The successful candidate should have a sound knowledge of ISO 15189 and should also have knowledge of ISO 22870 and as such will be expected to assist the department in compliance to these standards.&lt;/p&gt;\n&lt;p&gt;Other duties will include monitoring of devices / users and results using multiple data management systems, device installations and troubleshooting, writing and review of controlled documents and audit. The post holder will be required to handle and test patient samples when required during their duties.&lt;/p&gt;\n&lt;p&gt;For further details please contact Bev Straker-Bennett or Michelle Carter on 01253 957511&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBev Straker-Bennett / Michelle CarterJob titleJoint POCT LeadsEmail addressbeverley.straker-bennett@nhs.netTelephone number01253 957511Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details please contact Bev Straker-Bennett or Michelle Carter on 01253 957511&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospital, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "POCT Specialist Healthcare Science Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237710", "validThrough": "2020-11-09T23:59:59+0000"}