{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 £19,039 - £20,371 inc HCAS"}}, "datePosted": "2020-11-05T10:31:35+0000", "description": "&lt;p&gt;Due to the continued development of the ophthalmology department, we are seeking a dynamic and motivated care assistant to become part of a well-established and progressive ophthalmology team.&lt;/p&gt;\n&lt;p&gt;We are a busy outpatients department undertaking the assessment and care of Ophthalmic patients, by continually adapting the service to meet and enhance the care we provide to our patients and are therefore seeking a motivated and enthusiastic team player who is highly motivated with a flexible approach and the ability to show initiative and demonstrate excellent communications skills.&lt;/p&gt;\n&lt;p&gt;You will be an integral member of the team, providing nursing support in the provision of high quality patient care. You will carry out a wide range of duties including dilating and assessing patient’s eye sight for a number of ophthalmic clinics. A range of non-nursing duties will also be required to assist in the smooth running of the unit.&lt;/p&gt;\n&lt;p&gt;You must have a good level of education and be keen to learn.&lt;/p&gt;\n&lt;p&gt;The role will involve you working in the outpatient department at the Frimley Park Hospital and on a rotational basis in our Mobile Macular Unit. Our service runs 7 days a week and you will be allocated to a rota.&lt;/p&gt;\n&lt;p&gt;This vacancy is linked to a level 2 apprenticeship. This will support you to gain relevant knowledge, skills and experience that will help you achieve your potential in this role. Working alongside the Trust’s experienced staff you will be supported to gain the apprenticeship qualification and functional skills in maths and English if required. This is a great opportunity to gain a national recognised qualification while you are working and earning, which will support you in both this role and in your future career at Frimley Health.&lt;/p&gt;\n&lt;p&gt;You will not be required to undertake an apprenticeship if you have previously completed a relevant apprenticeship, NVQ or similar qualification.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "FPH, Frimley", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257243", "validThrough": "2020-11-19T23:59:59+0000"}