{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-14T16:20:28+0100", "description": "&lt;p&gt;Are you a qualified Band 5 Occupational Therapist, dedicated to changing lives for the better? If so, join themultidisciplinary team at Wellesley Hospital and help people build a brighter future.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is an exciting time to join Wellesley as it is opens its doors to a new purpose-built learning disability service alongside an established mental health hospital in Wellington. You will providing care to men with mental health needs or learningdisabilitiesin a medium-low secureenvironment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working alongside Activity Coordinators and Occupational assistant, you will provideoccupationally-focused assessments, interventions and outcomes that are needs-led and evidence-based to deliver recovery focused activities to support and prepareservice users to return to community life.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With a new service due to open in 2021 in Exeter and Wellesley Hospital expanding their service, you will have an abundanceof opportunitiesto developyour clinical and leadership skills as you enjoysupport from a regional network of healthcare professionals and enjoy access to a variety of training courses to support you reach your career goals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role involves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Completing assessments, planning sessions and implementing intervention.&lt;/li&gt;\n&lt;li&gt;Evaluating outcomes aligned to care plans.&lt;/li&gt;\n&lt;li&gt;Supervise Occupational Therapy Assistants.&lt;/li&gt;\n&lt;li&gt;Implement and develop evidence-based therapeutic activities to aid mental health recovery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Current HPC registration and BAOT membership with evidence of Continuing Professional Development.&lt;/li&gt;\n&lt;li&gt;Knowledge and use of a range of OT assessments and outcome measures.&lt;/li&gt;\n&lt;li&gt;Experience of working within a similar setting or having had a clinical placement in a mental health setting.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive annual salary £24,907 - £30,615 dependent on experience.&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellesley Hospital", "postalCode": "TA21"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9724", "longitude": "-3.2706"}}, "title": "Band 5 Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227077", "validThrough": "2020-11-14T23:59:59+0000"}