{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33176", "minValue": "33176", "unitText": "YEAR", "value": "£33,176"}}, "datePosted": "2020-10-26T12:30:42+0000", "description": "&lt;p&gt;Are you a Qualified Paramedic who has been working for an NHS Trust or a private provider? Are you looking to work on a flexible basis where you can choose your shifts and balance work and personal commitments?&lt;/p&gt;\n&lt;p&gt;If the answer is &lt;strong&gt;yes&lt;/strong&gt;, then this is your opportunity to work for a progressive, innovative and caring Trust which has been rated ‘good’ by the Care Quality Commissioning group (CQC).&lt;/p&gt;\n&lt;p&gt;A SCAS bank agreement offers a flexible way of working, whereby you can do as few as one shift in three months or as many as you want (ensuring compliance with the Working Time Directive). Bank working could be your main method of working or a secondary role. As one of our bank workers, you will be able to pick shifts from an online system which will automatically allocate you work without the need to call us, making the process quick and easy.&lt;/p&gt;\n&lt;p&gt;We are looking for applicants who are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;highly motivated&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;passionate about high quality patient care&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;professional&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;trained to drive under blue-light conditions&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;compassionate and able to remain calm under pressure&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;emotionally and physically resilient and a good communicator&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All we need you to have is:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Current registration with the HCPC&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Qualified Paramedic status in the UK (must have completed the NQP portfolio at the point of application)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Full valid UK driving licence including Category C1, with no more than 3 points. &lt;em&gt;The Trust motor insurers would not entertain inclusion of any applicants who had had their driving licence removed following a Dangerous Driving or Drink or Drugs offence for a minimum period of 5 years from when their licence is reinstated. Each case would need to be passed to Trust brokers / insurers in order for the individual circumstances to be taken into account.&lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Emergency Ambulance Driving Level 3 qualification (IHCD or FutureQuals).&lt;/p&gt;\n&lt;p&gt;In return we can offer…&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Five days of clinical updates training and SCAS familiarisation&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A two- day driver training update delivered by our specialist driver training team in Newbury&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Regular clinical updates&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to continuing professional development (CPD)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Occupational Health support along with an Employee Assistance Programme&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The finer details:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;If successful at application, you will be invited to an online interview.&lt;/li&gt;\n&lt;li&gt;The 5-day clinical training programme starting on 25th January is not residential so you will need to be able to get to the venue and back on your own, at your own cost. The clinical part of the course will be run from our Education Centre in Bicester and the driver training from Newbury.&lt;/li&gt;\n&lt;li&gt;All successful candidates who are offered a job with us will have to obtain clearance from the DBS (Disclosure and Baring Service) and our Occupational Health provider as well as satisfactory references covering at least the last 3 years.&lt;/li&gt;\n&lt;li&gt;Our vacancies are in Milton Keynes, Stoke Mandeville and High Wycombe, therefore as part of your application you will be asked to advise us of your base station preferences. We will then do our best to match your preferences to available vacancies at the time. We can’t guarantee placing you in your first preference but we will do our best.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more details of the role please look at the job description and person specification attached.&lt;/p&gt;\n&lt;p&gt;Note: you will need to meet the essential criteria as a minimum in order for your application to be shortlisted. &lt;strong&gt;You must also have completed your Consolidation of Learning portfolio and have demonstrable experience of working as a Paramedic.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For more information visit our website link under the contact section or find us on YouTube – SCAS999films&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122412.jpg", "name": "South Central Ambulance Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122412"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Milton Keynes, Stoke Mandeville, High Wycombe", "postalCode": "HP11 2JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.629", "longitude": "-.762384"}}, "title": "Qualified Paramedic (bank)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242433", "validThrough": "2020-11-08T23:59:59+0000"}