{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 PA plus HCAS"}}, "datePosted": "2020-10-28T15:31:33+0000", "description": "&lt;p&gt;Associate OD Business Partner&lt;/p&gt;\n&lt;p&gt;Fulfil your potential and make a difference at Central London Community Healthcare NHS Trust. Help us overcome the greatest challenge the NHS has seen in a generation by joining our HR team.&lt;/p&gt;\n&lt;p&gt;Our HR team underpins all of our Trust’s activities and enables our staff to perform at their best. We know that to provide the best care to our patients, we must look after our staff. We understand the moments that matter to our staff – every day, every week, every year – and we work hard to ensure all our staff are supported. By caring for our staff and making CLCH a great place to work, we contribute to the health of our patients and our overall success.&lt;/p&gt;\n&lt;p&gt;CLCH is at the forefront of HR innovation, and we want to create a new team with the right skills to make CLCH one of the leading employers in the country. Building on our new People Strategy, we are starting to implement a large HR transformation programme that will enact our vision for HR and people engagement. This is an opportunity for an excellent HR professional to be an integral part of taking a well-performing Trust to ‘Outstanding’ by driving strategic and operational excellence.&lt;/p&gt;\n&lt;p&gt;We have developed this programme in partnership with our key users, trade union / staff side representatives, line managers and staff, who are all excited for our new operating model. The transformation focuses on new ways to support line managers in building and managing effective teams and to enable staff to be at their best, improving the quality of care they can deliver. Overall, we are working to better help our staff at every point in their employee journey through improvements in recruitment, onboarding, learning and development, understanding of benefits and rewards, and individual and team performance management.&lt;/p&gt;\n&lt;p&gt;Our vision for the HR department is to ‘provide great care’ to our staff ‘closer to home’ through greater accessibility to HR functions. We want to ensure staff have the tools, information, and support they need on the frontlines with them.&lt;/p&gt;\n&lt;p&gt;The OD and culture team will be responsible for developing approaches to support CLCH to deliver on its broad People agenda, continuously improve the working environment, and build a supportive and inclusive culture through employee engagement and supporting change within the organisation. Importantly, you will have the unique and exciting opportunity to develop and run a Trust-wide culture change programmes to underpin HR transformation programme roll-out. You will support the OD Business Partner Developing business cases and implementation plans for developed OD and culture change programmes and leading on staff engagement on all related issues (working with other teams across the Trust extensively)&lt;/p&gt;\n&lt;p&gt;Our new HR structure provides excellent career opportunities: with clear paths for career progression within our team, with rotational schemes available to HR team members to allow them to expand their skill-sets, all supported by a new learning and people development programme for HR staff as well as line managers, to be rolled out in the next year. You could additionally be supported by education and training opportunities offered by the CLCH Academy.&lt;/p&gt;\n&lt;p&gt;We are dedicated to treating our staff the way we treat our patients. To foster and care for relationships throughout employees’ time with CLCH. To build an organisation where everyone cares about the moments that matter to staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Parsons Green Health Centre, London", "postalCode": "SW6 4UL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4738", "longitude": "-.199117"}}, "title": "Associate OD Business Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247195", "validThrough": "2020-11-08T23:59:59+0000"}