{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "In line with current salary"}}, "datePosted": "2020-10-23T12:16:05+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Deputy Dean for Postgraduate Medical Education and Training&lt;/em&gt;&lt;/strong&gt;&lt;em&gt; &lt;br /&gt;&lt;br /&gt;An exciting opportunity has arisen for an experienced and dynamic individual to join Health Education England, South London local office in the role of Deputy Postgraduate Dean. The post holder will work as an integral member of the senior leadership team supporting the Postgraduate Dean in leading the commissioning and delivery of multi-professional healthcare education and training.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The post holder needs to have an excellent understanding of multi-professional medical and healthcare education and have the personal drive, credibility, ambition and emotional intelligence to work across the wider health system; with senior colleagues to lead and embed developments in healthcare education. &lt;br /&gt;&lt;br /&gt;The role will involve supporting Postgraduate Dean in the full range of activities including curriculum, educational governance, quality assurance, supporting trainees and maintaining the quality of the learning environment and culture. The post holder will work closely with colleagues within Health Education England and liaise with the Royal Colleges, General Medical Council, Local Education Providers, Higher Educational Institutions and other system stakeholders (including STPs) developing frameworks to support and quality assure the commissioning, delivery and assessment of high quality education and training.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications are welcomed from doctors, registered nurses and allied health professional qualified candidates with an established track record of delivering and/ or commissioning effective health education programmes at a senior management level.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Appointments will be made for a three-year period with the option of renewing the contract for a further three years by mutual consent.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interview date: 18th November 2020&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Prof Geeta Menon&lt;/p&gt;\n&lt;p&gt;Job title: Postgraduate Dean&lt;/p&gt;\n&lt;p&gt;Email address: geeta.menon@hee.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stewart House, Russell Square, London", "postalCode": "WC1B 5DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5211", "longitude": "-.127467"}}, "title": "Deputy Postgraduate Dean", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240474", "validThrough": "2020-11-08T23:59:59+0000"}