{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa inc plus Outer London HCAS"}}, "datePosted": "2020-11-02T16:16:31+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a Child &amp; Adolescent Mental Health Services (CAMHS) Specialist to offer supervision and support the leadership of an exciting expansion Children&#39;s Wellbeing Practitioners (CWP) Service based in Croydon CAMHS.&lt;/p&gt;\n&lt;p&gt;You will work alongside a more experienced supervisor and service development lead to support and supervise Children&#39;s Wellbeing Practitioners (CWPs) who will offer mental health/emotional wellbeing support to children and young people who would not normally reach threshold for CAMHs services.&lt;/p&gt;\n&lt;p&gt;This is part of a broader government initiative to increase mental health and emotional well-being support to children and young people, and set up as part of the Children and Young People&#39; Improving Access to Psychological Therapies (CYP IAPT) programme.&lt;/p&gt;\n&lt;p&gt;The post-holder will be contribute to the management and supervision of a team of trainee CWPs and qualified CWPs, who will be trained to offer high-quality, brief outcome focused evidence-based interventions for children and young people experiencing mild to moderate mental health difficulties.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post-holder will support the CWPs in their professional development through clinical supervision, and will themselves participate in a CYP-IAPT CWP supervisor&#39;s course throughout the first year of the programme.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to develop supervision and leadership skills and gain experience in developing and evaluating a growing service under the guidance of senior staff. The post-holder will be clinically supervised and managed by the CWP service lead and will be working as part of a wider CYP-IAPT/CWP programme across SLAM CAMHS.&lt;/p&gt;\n&lt;p&gt;This post will suit a CAMHS clinician with a strong interest and some experience in clinical supervision who is trained in Mental Health Nursing, Clinical Psychology, Child Psychotherapy, Family Therapy or Social Work&lt;/p&gt;\n&lt;p&gt;The post holder will be required to hold professional registration with one of the following statutory bodies; NMC (Nurses); GSCC (Social workers) BACP (Child Psychotherapists) UKCP (Counsellors/psychotherapists/Family Therapists&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role requires the post holder to &lt;/strong&gt;&lt;strong&gt;submit an application form to Kings College London for a place on the Postgraduate Certificate in Child and Young Person IAPT Supervision in addition to the job application that you make to the relevant Service&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;University applications close on &lt;strong&gt;2nd December at 23.59 pm&lt;/strong&gt;. However, it is strongly advised to submit an early application to prevent the delay of a decision. Applications take approximately 4-6 weeks to assess.&lt;/p&gt;\n&lt;p&gt;Please refer to the following attachments as part of your application process:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;KCL Supervision Brochure&lt;/li&gt;\n&lt;li&gt;KCL Supervision Application Guidance January 2021&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Croydon CAMHS&lt;/strong&gt; based at Christopher Wren House, 113 High Street | Croydon | CR0 1QG&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCharlotte FeakinsJob titleCWP Supervisor and Service Development LeadEmail addressCharlotte.Feakins@slam.nhs.ukTelephone number02032280000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Christopher Wren House, Croydon", "postalCode": "CR0 1QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3702", "longitude": "-.099639"}}, "title": "Children&#39;s Wellbeing Practitioners Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252793", "validThrough": "2020-11-11T23:59:59+0000"}