{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 p.a inc. HCA"}}, "datePosted": "2020-11-06T15:46:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Anaesthetic Staff Nurse/ODP - Theatres, Anaesthesia and Perioperative Medicine (TAP)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Based in two of London’s most sort after locations, Guy&#39;s and St Thomas’ TAP (Theatres Anaesthesia and Perioperative Medicine) Directorate is looking for Band 5 Anaesthetic Nurses/ODPs to join our highly skilled team.&lt;/p&gt;\n&lt;p&gt;The Directorate consist of 46 Operating theatres that are supported by state of the art Recovery, SAL (Surgical Admissions Lounge) and Central Preoperative Assessment Service.&lt;/p&gt;\n&lt;p&gt;If you are looking to further your career or, the opportunity to expand your skills in a variety of settings, then this may be the area for you. You must have completed an Anaesthetic course and have acquired experience in the field.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to develop skills through the whole of the patient’s perioperative journey, gaining exposure to a range of elective and non-elective procedures in theatres across Guy’s and St Thomas’.&lt;/p&gt;\n&lt;p&gt;We offer a diverse range of clinical specialties from ENT, thoracic, renal transplants, ophthalmic to robotics, orthopedics, complex vascular, cardiac and more.&lt;/p&gt;\n&lt;p&gt;As a tertiary referral centre we offer a wealth of experience spanning many specialties. Our long history of cutting edge surgery means that you could be involved in some of the worlds most advanced procedures.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be and promise to support you in achieving your goals through our in-house training programs and tertiary study at our affiliated universities.&lt;/p&gt;\n&lt;p&gt;Training and support is provided whilst we develop your existing skills and knowledge in each aspect of the Perioperative environment.&lt;/p&gt;\n&lt;p&gt;Personal and professional growth is encouraged through work based learning programs. These programs cover a broad range of clinical and non-clinical skills that aid you in building your professional portfolio in advanced nursing, leadership, research and more.&lt;/p&gt;\n&lt;p&gt;Our Academy aims to develop a team of practitioners, with knowledge and skills to care for patients within Theatres, Anaesthesia and Perioperative Medicine (TAP), recognizing the commitments of our staff and rewarding achievements.&lt;/p&gt;\n&lt;p&gt;Further information on the directorate and TAP academy can be found in the Fact sheet and booklet attached.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be advised that all the interviews will be conducted online via Skype for Business or Microsoft Teams, and there will be no phone interviews. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews to be conducted online via Skype for Business or Microsoft Teams on the week commencing the 14th of December 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;monica.slabu@gstt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "GSTT, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Band 5 Anaesthetic Staff Nurse/ODP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260457", "validThrough": "2020-12-06T23:59:59+0000"}