{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inc pro rata"}}, "datePosted": "2020-11-02T13:41:03+0000", "description": "&lt;p&gt;&lt;span&gt;We are looking for an experienced and enthusiastic clinical psychologist to join our growing team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have an exciting, permanent, opportunity for a half time (0.5 wte) Band 8a clinical psychologist to join a clinical psychology team for adults who receive a range of specialist cardio-thoracic and critical care services at the Bart’s Heart Centre at St Bartholomew’s Hospital (which is part of Bartshealth NHS Trust). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Bart’s Heart Centre (BHC) Clinical Psychology Service works with adult patients and their families who live with an acute or chronic cardiac condition and those who require a critical care admission (predominantly cardio-thoracic and cancer related). It also provides a range of support structures for staff who look after these patients. Specifically these patients are under the care of specialist multidisciplinary teams within the Bart’s Heart Centre, including the adult congenital heart service (GUCH), The Heart Attack Centre (HAC); The Adult Critical Care Unit (ACCU); Heart Failure, Electrophysiology, Inherited Cardiovascular Conditions and the Chest Wall Service. The post holder will be working with adults who have life limiting and life-threatening conditions. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will work under the line management and clinical supervision of a consultant clinical psychologist (BHC Psychology Service Lead) and their role will include developing a new clinical psychology service to specialist teams within the BHC including Inherited Cardiovascular Conditions, Heart Failure and Electrophysiology for which he/she will take on speciality team psychology lead responsibility for. They will be joining a supportive group of clinical psychologists who lead the psychology provision for the other BHC specialties and wider professionals within these specialties, who also work with these patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is also a wider team of clinical psychologists, on the St Bartholomew’s site, working in cancer and palliative care and respiratory services with lots of opportunity for peer support, joint case working when a specialty overlap exists and shared service development on common themes across the hospital, for example, staff support.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Heart Centre Psychology service is managed by a consultant clinical psychologist who is responsible for leading and developing the clinical psychology provision for cardiac and critical care patients at the BHC, and the staff who look after those patients at St Bartholomew’s Hospital. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We operate within a mixed model, i.e. specialty attached psychologists embedded within their respective medical teams with centralised referral allocation and discussion so that workload can be shared evenly between psychologists and allocated according to skill mix and case complexity. This post is varied and exciting with lots of opportunity for leadership, service development and research as well as providing specialist clinical psychology input through direct work (with inpatients and outpatients), indirect work through consultation to medical and nursing teams, and staff support. The Bart’s Heart Centre Teams are very welcoming, and they really value psychology input for their patients and staff.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The clinical psychology service which started as a 12 month project for congenital heart patients in 2017 has been extended and developed over the past three years and now provides an established service to the Barts Heart Centre with a structure that allows for appropriate supervision, line management, leadership and career development. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interested applicants are strongly advised to contact Dr Vicky Kelly (Consultant Clinical Psychologist) to arrange a time to discuss the post by emailing her on: vicky.kelly3@nhs.net.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Bartholomew’s Hospital, London", "postalCode": "EC1A 7BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.517", "longitude": "-.100858"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252257", "validThrough": "2020-11-15T23:59:59+0000"}