{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T10:31:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Occupational Therapist - Frailty Service 37.5 hours per week (part time hours considered) to provide a seven day service 08:00 – 20:00. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base site Pilgrim Hospital, Boston, with occasional working at Lincoln County Hospital. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;United Lincolnshire Hospitals NHS Trust has developed a Frailty service across two acute hospital sites, Lincoln and Boston. This is a fantastic opportunity to be part are a newly created team to provide expertise in the Frailty element of same day Emergency Care within the acute area of Accident &amp; Emergency and Medical Assessment areas of the Trust.&lt;/p&gt;\n&lt;p&gt;The successful candidate must be flexible, innovative, highly motivated and above all be committed to improving the care and assessment of frail older people within setting. The successful applicant will work alongside apprentice Therapy Assistant Practitioners, ACP’s, a Consultant nurse &amp; Consultants and will be well supported within by Occupational Therapy service. The successful candidate will have a base site (Pilgrim) but the post will involve Trust wide working with flexibility as required&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join us as you will be part of a team that continues to deliver excellent services for our patients. The service requires an Occupational Therapist with a passion for working with older people/frailty and demonstrates compassion and understanding of the occupational performance needs of the client group.&lt;/p&gt;\n&lt;p&gt;United Lincolnshire Hospitals NHS Trust is one of the largest trusts in the country providing services from 3 acute hospitals in Lincolnshire - Lincoln County Hospital, Pilgrim Hospital, Boston, and Grantham and District Hospital. The Trust also provides a wide variety of outpatient, day case and inpatient services from a range of other community hospitals operated by Lincolnshire Community Health Services or local GP clusters. These include: Louth County Hospital, John Coupland Hospital (Gainsborough), Johnson Community Hospital (Spalding) and Skegness and District General Hospital.&lt;/p&gt;\n&lt;p&gt;We provide a wide range of healthcare services delivered by over 7,500 highly trained staff to over 757,000 residents of Lincolnshire, which is one of the fastest growing populations in England. Our services cost more than £390 million each year to provide. In an average year, we treat more than 180,000 accident and emergency patients, over 600,000 outpatients and almost 100,000 inpatients, and deliver over 5,000 babies,&lt;/p&gt;\n&lt;p&gt;In addition, the Trust provides a broad range of other clinical services including community services, population screening services, a comprehensive range of planned and unscheduled secondary care services together with research and development.&lt;/p&gt;\n&lt;p&gt;Each year we receive £399 million to provide patient services, most of which is delivered to patients in Lincolnshire. We invest around £12 million each year in improving our clinical services by replacing and upgrading our medical equipment, modernising our estate and facilities and improving our information and technology infrastructure.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What We Offer in Return&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return from us you can expect a clear commitment to your professional development. We have a good track record of developing our talent and supporting promotional and developmental opportunities, clinical supervision &amp; appraisal along with the opportunity to support Occupational Therapy students.&lt;/p&gt;\n&lt;p&gt;There are many benefits of working United Lincolnshire Hospital NHS Trusts that include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;NHS Pension:&lt;/strong&gt; A generous and flexible pension scheme with contributions from us as your employer.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Annual Leave:&lt;/strong&gt; Starting at 27 days a year, rising to 33 days after 10 years plus eight bank holidays (for staff covered by Agenda for Change) or starting at 6 weeks, rising to 6 weeks and 2 days after 7 years’ service (for medical staff).&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working &amp; career breaks:&lt;/strong&gt; Helping you match work and home life – ask about reduced hours, compressed hours, flexible working, term-time only working, job sharing and unpaid leave.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Relocation packages:&lt;/strong&gt; If a relocation package is offered for the role, you could qualify for expenses of up to 25% of your starting salary.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Family &amp; Childcare&lt;/strong&gt; including on-site nurseries at Lincoln County Hospital and Pilgrim Hospital Boston, childcare vouchers and maternity, paternity, adoption &amp; shared parental leave.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health &amp; Wellbeing&lt;/strong&gt; including mindfulness, counselling, mental health first aid, health check MOTs, physiotherapy, eye tests.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Learning &amp; Development&lt;/strong&gt; including Lincolnshire Talent Academy, leadership training, medical education, clinical education, Lincolnshire clinical research and GP speciality training programme.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Discounts &amp; Salary Sacrifice&lt;/strong&gt; including Cycle2Work, car lease scheme, home electronics and wider wallet.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Rewards &amp; Recognition&lt;/strong&gt; including staff awards, long service awards, retirement awards, examples of excellence and staff lottery&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sara Blackbourn, Site Lead Occupational Therapist &lt;/strong&gt; Sara.Blackbourn@ulh.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sara Blackbourn&lt;/p&gt;\n&lt;p&gt;Head Occupational Therapist&lt;/p&gt;\n&lt;p&gt;01205 446683&lt;/p&gt;\n&lt;p&gt;sara.blackbourn@ulh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pilgrim Hospital, Sibsey Road, Boston, Lincolnshire, PE21 9QS, Boston", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Senior Occupational Therapist - Frailty Team - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253465", "validThrough": "2020-11-17T23:59:59+0000"}