{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27800", "minValue": "27800", "unitText": "YEAR", "value": "Up to £27,800"}}, "datePosted": "2020-10-29T16:15:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You’ve just qualified as a Mental Health or Learning Disability Nurse. Congrats. Now you need to choose your first job; one that will give your career the best start; that won’t drop you in the deep end.&lt;/p&gt;\n&lt;p&gt;When you join Elysium as a newly qualified nurse, you are automatically enrolled onto the RCN-accredited Preceptorship Academy. That’s 12 months of expert support, training and supervision to help you apply your academic knowledge in real life situations.&lt;/p&gt;\n&lt;p&gt;You will be developed to grow into a confident, autonomous professional with refined skills, values and behaviours. That’s on top of your new role helping to change the lives of others and making a difference.&lt;/p&gt;\n&lt;p&gt;As a qualified nurse you will ensure patients diagnosed with a mental health conditions receive high-quality care, while supporting your colleagues and promote good teamwork.&lt;/p&gt;\n&lt;p&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine.  &lt;/p&gt;\n&lt;p&gt;Your personal development matters, after all, a better you means better care. So expect plenty of opportunities to continually develop yourself throughout your career with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Relevant nursing qualification and registration&lt;/li&gt;\n&lt;li&gt;Strong team-working skills&lt;/li&gt;\n&lt;li&gt;High level of self-motivation and a flexible approach&lt;/li&gt;\n&lt;li&gt;Positive attitude and be naturally caring and compassionate&lt;/li&gt;\n&lt;li&gt;Commitment to high-quality care and to values and evidence-based practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Site Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: Rhodes Wood Hospital. Shepherds Way, Hatfield AL9 6NN&lt;/p&gt;\n&lt;p&gt;Join the vibrant team at Rhodes Wood Hospital, a specialist CAMHS Eating Disorder service with 3 wards, which empowers recovery in a fast-paced, challenging and fun environment for children and young people aged 8-18 years with eating disorders.&lt;/p&gt;\n&lt;p&gt;With a new Hospital Director appointed, Rhodes Wood is working through a programme to continually innovate, improve and deliver excellent care to our young people and a rewarding experience for employees.&lt;/p&gt;\n&lt;p&gt;You will support a warm and nurturing environment, allowing for the understanding of symptoms, patterns and origins of psychological distress, and will actively encourage children to personalise bedroom spaces to make these feel like a home from home.&lt;/p&gt;\n&lt;p&gt;You will be working alongside a multidisciplinary team that have previously been recognised by the Association of Psychological Therapies (APT) for their ability to reinforce positive behaviour, prevention of challenging behaviour and successful interventions in a secure care setting.&lt;/p&gt;\n&lt;p&gt;The service operates 24/7. You will work shift patterns including weekends, bank holidays and nights. Standard shifts are 12 hours a day, working 3 days one week, 4 days the next.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits &amp; About Elysium&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will get:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An excellent salary of up to £27,800&lt;/li&gt;\n&lt;li&gt;A variety of flexible working options&lt;/li&gt;\n&lt;li&gt;Career development&lt;/li&gt;\n&lt;li&gt;Support with your re-validation&lt;/li&gt;\n&lt;li&gt;Working with a dedicated multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Enhanced maternity pay&lt;/li&gt;\n&lt;li&gt;Flexible benefits&lt;/li&gt;\n&lt;li&gt;Access to CPD&lt;/li&gt;\n&lt;li&gt;25 days annual leave, plus bank holidays and your birthday off&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hatfield", "postalCode": "AL9 6NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.719", "longitude": "-.170991"}}, "title": "Preceptee Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249029", "validThrough": "2020-11-12T23:59:59+0000"}