{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-29T09:30:57+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to recruit a motivated and committed individual to take a senior psychologist role within the Blackpool Community Mental Health Team.&lt;/p&gt;\n&lt;p&gt;The post will be based in the heart of Blackpool and provide assessment and psychological therapy to service users. The role will also encompass service development, training, supervision, and consultation work with other professionals, as well as working in collaboration with the band 7 psychological practitioner within the team.&lt;/p&gt;\n&lt;p&gt;The CMHTs provide services to people with complex mental health needs. Strong professional leadership sits alongside practitioners being core team members. Psychological therapies and psychologically informed care is valued within the teams and network.&lt;/p&gt;\n&lt;p&gt;The service is also developing a phased model of care, through which we are aiming to offer interventions attuned to service users’ readiness to use psychological approaches. Changes to the nature of Adult Mental Health Services are being made in line with the NHS Long Term plan, resulting in more CMHT investment and opportunity. It is hoped that the postholder will be instrumental in helping represent psychological services in these changes.&lt;/p&gt;\n&lt;p&gt;An interest in working with individuals with complex presentations and personality difficulties will be essential, as are skills in working within a multidisciplinary framework. The post will also sit as part of a team of psychologists working within The Fylde Coast area, and the successful applicant will be welcomed as part of a service which will encourage the development of specific interests and will value further career development. It is hoped that the applicant would be keen to undergo further clinical training to develop the therapeutic portfolio of the wider service, in line with their own preferred models.&lt;/p&gt;\n&lt;p&gt;Blackpool is an exciting and unique place to work, with it’s own set of challenges and opportunities which change according to the seasonal nature of the town, and this post would suit an applicant who would be able to develop links between mental health services and the wider community.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Christiaan Morgan AMH Consultant Lead for the Fylde Coast: christiaan.morgan@lscft.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Gateway, Blackpool", "postalCode": "FY1 6JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8054", "longitude": "-3.04898"}}, "title": "Senior Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247737", "validThrough": "2020-11-12T23:59:59+0000"}