{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-02T16:46:15+0000", "description": "&lt;p&gt;Deputy Ward Manager, Delamere Day Case Unit, CCC-W&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Working hours - Monday -Friday 37.5 hrs per week over 4 days&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The Clatterbridge Cancer Centre NHS Foundation Trust is one of the UK’s leading providers of non-surgical cancer treatment, caring for a population of 2.4 million people across Cheshire &amp; Merseyside, North Wales, the Isle of Man and parts of Lancashire.&lt;/p&gt;\n&lt;p&gt;Our flagship specialist cancer hospital opening in central Liverpool in June 2020, supported by our hospital on the Clatterbridge Health Park in Wirral providing outpatient cancer treatment and supportive care and our radiotherapy treatment centre on the Aintree Hospital site. &lt;br /&gt;&lt;br /&gt;Together, working across three sites and operating specialist chemotherapy clinics in four of Merseyside’s district hospitals, we are able to deliver a comprehensive range of inpatient care, advanced radiotherapy, chemotherapy and other systemic anti-cancer therapies including gene therapies and immunotherapies. We also deliver a pioneering Treatment at Home and Work service; are the only facility in the UK providing low-energy proton beam therapy to treat rare eye cancers and host the region’s Teenage and Young Adult Unit, (supported by the Teenage Cancer Trust).&lt;/p&gt;\n&lt;p&gt;Working with leading experts from The University of Liverpool and the Cancer Research UK Liverpool Cancer Trials Unit we strive to stay at the forefront of novel treatments and techniques to deliver more effective and personalised treatments than ever before.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic and motivated deputy ward manager for our Delamere Day Case Unit, CCC-Wirral , to commence post in Spring 2021.. The individual should have extensive Chemotherapy experience, and be able to demonstrate good leadership skills. The successful post holder will provide clinical leadership to the multi disciplinary team ensuring that appropriate support and professional frameworks are in place. &lt;br /&gt;&lt;br /&gt;The successful applicant will have a proven track record of change management, and a passion for developing a culture of continuous improvement with particular emphasis on patient experience.&lt;br /&gt;&lt;br /&gt;We’re here to deliver the best cancer care to the people we serve and we’re looking for applications from those who share that commitment and our values: Putting people first; Achieving excellence; Passionate about what we do; Always improving our care; and Looking to the future.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Clatterbridge Cancer Centre NHS Foundation Trust &lt;/em&gt;&lt;em&gt;is committed to safeguarding and promoting the welfare of children, young people and adults and expects all staff and volunteers to share this commitment.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We take an active responsibility for &lt;/em&gt;&lt;em&gt;ensuring systems, policies and processes are in place to safeguard children, young people and adults. We support the national and local safeguarding agenda, including local arrangements for the protection of children young person and adults at risk.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This job is unlikely to attract a Tier 2 Certificate of Sponsorship (formerly a work permit). Applications from candidates who require Tier 2 immigration status to work in the UK may not be considered if there are a sufficient number of other suitable candidates. To apply for a Tier 2 Certificate of Sponsorship, employers need to demonstrate that they are unable to recruit a resident worker before recruiting an individual overseas. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire BennettJob titleMatron-chemotherapy and outpatientsEmail addressclaire.bennett19@nhs.netTelephone number0151 556 5886Additional contact information&lt;/p&gt;\n&lt;p&gt;Claire Bennett&lt;/p&gt;\n&lt;p&gt;Chemotherapy Matron - Wirral&lt;/p&gt;\n&lt;p&gt;0151 556 5886&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Jennifer Gleave&lt;/p&gt;\n&lt;p&gt;Deputy Ward Manager&lt;/p&gt;\n&lt;p&gt;DDCU, CCCW&lt;/p&gt;\n&lt;p&gt;0151 556 5167&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121459.png", "name": "The Clatterbridge Cancer Centre NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121459"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Clatterbridge Cancer Centre - Wirral, Wirral", "postalCode": "CH63 4JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3323", "longitude": "-3.02585"}}, "title": "Deputy Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252928", "validThrough": "2020-11-16T23:59:59+0000"}