{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T08:16:19+0000", "description": "&lt;p&gt;This is a great opportunity for an individual who is passionate about ensuring the delivery of excellent and high quality care. We are looking for a compassionate nurse who has experience looking after complex patients living with HIV. The focus of this role is on the day to day delivery of excellence in quality care provision, ensuring all clinical governance and compliance targets are met. The post holder will also be expected to encourage and promote a team culture of enquiry and learning that enables individuals to openly question, reflect and learn from their practice.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work across the whole of the Community HIV Specialist Service, covering a wide geographical area and offering expert advice and guidance. They will act as a role model and promote excellence in clinical practice, demonstrating knowledge and skills in caring for complex patients living with HIV. They will assist in ensuring clinical audit becomes part of everyday practice, and continuously seek out ways of developing the service we provide to our caseload of complex patients.&lt;/p&gt;\n&lt;p&gt;A driving licence and car are essential, as the post will involve a lot of travel across the three teams within the Community HIV Specialist Service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Liz Foote&lt;/p&gt;\n&lt;p&gt;Clinical Services Manager&lt;/p&gt;\n&lt;p&gt;liz.foote@nhs.net&lt;/p&gt;\n&lt;p&gt;07467 115484&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "School Clinic, Brighton", "postalCode": "BN2 9DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8259", "longitude": "-.134163"}}, "title": "HIV Clinical Nurse Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251294", "validThrough": "2020-11-12T23:59:59+0000"}