{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25615", "minValue": "24210", "unitText": "YEAR", "value": "£24,210 - £25,615 per annum inclusive"}}, "datePosted": "2020-10-26T14:46:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Catering Supervisor&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role is based at a prestigious hospital, in the London area. Business is open Monday to Sunday, including evenings. You will be working in a team of 50 to provide staff &amp; patient ward dining and hospitality services for our client over the restaurant and meeting rooms. We offer a range of catering services including tea &amp; coffee, breakfast, lunches, canapés events and drinks receptions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your main duties and responsibilities will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensure that the client expectations of hospitality food and food service are consistently delivered in line with business brand and ethos.&lt;/li&gt;\n&lt;li&gt;Conduct full briefings to all staff regarding events, detailing food and food service standards to ensure that the staff are fully aware of the client requirements and their role in delivery&lt;/li&gt;\n&lt;li&gt;Ensure all staff carry out tasks in accordance with company health, hygiene, quality and safety standards as set out in the appropriate manuals, specific to the task&lt;/li&gt;\n&lt;li&gt;Work closely with hospitality team to deliver daily bookings and managing booking system&lt;/li&gt;\n&lt;li&gt;Where necessary contribute to the team’s efforts to ensure the service is provided in a professional and timely manner&lt;/li&gt;\n&lt;li&gt;As directed by the Head of Catering Services and the Assistant Manager, provide induction, initial skills and on the job training for all Hospitality staff to ensure the service is delivered in line with the business expectations&lt;/li&gt;\n&lt;li&gt;Provide feedback and coaching to any member of staff ensuring that all team members are aware of business standards and requirements, and carry out their jobs to the best of their ability in a timely and efficient manner&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The ideal candidate:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Is an excellent face to face communicator with a confident approach and an ability to communicate direction clearly and openly.&lt;/li&gt;\n&lt;li&gt;Is up to date with current developments and trends in food and food service and able to integrate that knowledge into the service offering.&lt;/li&gt;\n&lt;li&gt;Is experienced in managing and maximising table sales in restaurant environment.&lt;/li&gt;\n&lt;li&gt;Is committed to delivering excellence in customer service.&lt;/li&gt;\n&lt;li&gt;Has evidence of managing time effectively in similar role.&lt;/li&gt;\n&lt;li&gt;Has a minimum of 1 years previous experience as a Restaurant Supervisor in prestigious and comparable restaurant.&lt;/li&gt;\n&lt;li&gt;Has a strong understanding of food.&lt;/li&gt;\n&lt;li&gt;Is passionate and innovative in matters of food and food service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If this sounds like you, then please apply immediately as this position is to be filled ASAP.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**All Applicants must be eligible to live and work in the UK** &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that due to high level of applications received; only successful candidates will be contacted&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anne Kiragu, Catering Manager - Anne.Kiragu@gosh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Catering Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242950", "validThrough": "2020-11-09T23:59:59+0000"}