{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-26T18:00:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Executive Director of Finance&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North Wales; Attractive Salary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Betsi Cadwaladr University Health Board is the largest health organisation in Wales. With the stunning Snowdonia National Park at the centre of our area, we provide a full range of primary, community, mental health and acute hospital services for a population of around 678,000 people across the six counties of North Wales. The Health Board has a budget of £1.4 billion and a workforce of approximately 17,000 serving three main hospitals along with a network of community hospitals, health centres, clinics, mental health units and community team bases. The Health Board also coordinates the work of over 100 GP practices and NHS services provided by dentists, opticians and pharmacists in North Wales.&lt;/p&gt;\n&lt;p&gt;We are seeking a new Executive Director of Finance to join our ambitious Board, support our exciting development journey and ensure we have strong, effective performance and risk management systems in place with robust financial plans supporting the delivery of our high quality services. We are operating in a dynamic and changing environment and our new Director of Finance will be critical to creating a climate that enables delivery of our clinical strategy as we seek to utilise the opportunity of our integrated structure and provide more services closer to our patients’ homes.&lt;/p&gt;\n&lt;p&gt;You will be a successful Director of Finance who thrives at board level in complex, dynamic and financially challenging healthcare environments. Highly visible, you will inspire and motivate teams, creating a culture in which we can both recognise and deliver our huge potential. This is an opportunity to bring your strong track record of improvement to establish effective financial accountability systems across the Health Board. By quickly building credibility with our dedicated staff, patients, partners and with Welsh Government, you will share our commitment to improve health and deliver excellent care to our populations. This is a rewarding and unique opportunity for an experienced Director of Finance to influence change in a complex and truly integrated healthcare environment. It reports to, and will work closely with, our incoming CEO Jo Whitehead who returns from Australia to join us in January, and who will be on the interview panel.&lt;/p&gt;\n&lt;p&gt;For further information about the UHB, our culture and our aspirations, please click on the button below or for a confidential conversation contact Robin Staveley of GatenbySanderson on 0113 205 6090.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 9AM Monday 9th November; preliminary interviews mid-November; Final interviews early-December &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Betsi Cadwaladr University Health Board is committed to promoting equality and diversity. The Health Board operates a bilingual policy. Applicants under the “two tick” scheme are guaranteed an interview if the minimum criteria is met.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRobin Staveley of GatenbySandersonTelephone number0113 205 6090Additional contact information&lt;/p&gt;\n&lt;p&gt;Robin Staveley of GatenbySanderson on 0113 205 6090.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlton Court, St Asaph", "postalCode": "LL17 0JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2563", "longitude": "-3.47783"}}, "title": "Executive Director of Finance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243590", "validThrough": "2020-11-09T23:59:59+0000"}