{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860-£107,668 Per annum (Pro-rata if part time)"}}, "datePosted": "2020-10-19T10:05:30+0100", "description": "&lt;p&gt;The Ministry of Defence is seeking a number of Regional Rehabilitation Unit (RRU) Consultants to work in a variety of locations across the UK.&lt;/p&gt;\n&lt;p&gt;As a Regional Rehabilitation Unit (RRU) Consultant you will deliver a consultant-led specialist Musculoskeletal (MSK) and Sport &amp; Exercise Medicine (SEM) service for Defence Rehabilitation, utilising the multi-disciplinary team (MDT) where appropriate, in order to deliver a world class level of rehabilitation for service personnel.&lt;/p&gt;\n&lt;p&gt;As the successful applicant, you will be joining a dynamic MDT of clinicians supporting the Defence Rehabilitation Service, which includes Primary Care Rehabilitation Facilities (PCRFs), Regional Rehabilitation Units (RRUs) and the Defence Medical Rehabilitation Centre, Stanford Hall. These posts are to support the RRU’s intermediate care MSK service.&lt;/p&gt;\n&lt;p&gt;The aim is to return, where possible, service personnel to active duty and where not, to ensure they are able to achieve the maximum level of independence and function as they continue their clinical pathway to secondary care at DMRC or on discharge from the services.&lt;/p&gt;\n&lt;p&gt;This role is part time at 24 hours a week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate will meet the following essential criteria:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Medical Degree recognised in the UK&lt;/li&gt;\n&lt;li&gt;Member or Fellow of Faculty Sport and Exercise Medicine (UK)&lt;/li&gt;\n&lt;li&gt;General Medical Council (GMC) registered as a doctor with a licence to practice AND entry on the General Medical Council (GMC) Specialist Register via one of the following:\n&lt;ul&gt;\n&lt;li&gt;Certificate of Completion of Training (CCT) (the proposed CCT date must be within 6 months of the interview). SEM is the preferred specialty, but others will be considered.&lt;/li&gt;\n&lt;li&gt;Certificate of Eligibility for Specialist Registration (CESR)&lt;/li&gt;\n&lt;li&gt;European Community Rights&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Additional information relating to these roles can be found on the attached Job Description and Person Specification.&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following Civil Service Behaviours:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leadership (Mandatory)&lt;/li&gt;\n&lt;li&gt;Making Effective Decisions&lt;/li&gt;\n&lt;li&gt;Working Together&lt;/li&gt;\n&lt;li&gt;Changing and Improving&lt;/li&gt;\n&lt;li&gt;Communicating and Influencing&lt;/li&gt;\n&lt;li&gt;Developing Self and Others&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will also be tested against the following at interview.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Diagnostic Ultrasound Competence&lt;/li&gt;\n&lt;li&gt;Injection Therapy Competence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Further Information&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;Please note the salary will be pro-rata where part time hours are undertaken.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Catterick Leisure Centre, Gough Road, Catterick Garrison", "postalCode": "DL9 3EL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3767", "longitude": "-1.72643"}}, "title": "Regional Rehabilitation Unit (RRU) Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231717", "validThrough": "2020-11-23T23:59:59+0000"}