{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110000", "minValue": "100000", "unitText": "YEAR", "value": "£100,000 to £110,000"}}, "datePosted": "2020-10-30T14:30:58+0000", "description": "&lt;p&gt;DHU Urgent Care (LLR) CIC is a non-profit making provider of urgent care and out of hour’s services within Leicester, Leicestershire and Rutland (LLR), a population of just over one million. We are looking for GPs who are interested in a salaried position in our services. We can offer you a unique opportunity to have a portfolio career working across our different services including but not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;24/7 Home Visiting Service&lt;/li&gt;\n&lt;li&gt;Telephone assessment in the Clinical Navigation Hub&lt;/li&gt;\n&lt;li&gt;Loughborough Urgent Care Centre&lt;/li&gt;\n&lt;li&gt;Various Primary Care Centres in Leicester city, Leicestershire and Rutland&lt;/li&gt;\n&lt;li&gt;Leicester Royal Infirmary&lt;/li&gt;\n&lt;li&gt;GP Surgeries in Leicester City&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In general the post holder will be expected to undertake all the normal duties and responsibilities associated with a GP working in Primary / Urgent Care, such as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Keep contemporaneous, accurate and legible records of all patient contacts and contribute to electronic data recording and audit as directed by the service&lt;/li&gt;\n&lt;li&gt;Prescribe, issue prescription and treatments according to agreed protocols and local guidance, within scope of competence.&lt;/li&gt;\n&lt;li&gt;Contribute to evaluation / audit, significant event reporting and clinical standard setting within the service&lt;/li&gt;\n&lt;li&gt;Develop and encourage positive working relationships with local GP Practices, housing, social work, voluntary services, drug and alcohol, mental health, dental, secondary care and other appropriate services&lt;/li&gt;\n&lt;li&gt;Pursue continuing professional and personal development. Eight days study leave per year will be provided, pro rata, for CPD following discussion with the Clinical Director during the appraisal process. The post holder’s line manager must approve all study leave.&lt;/li&gt;\n&lt;li&gt;Significant event analysis will be undertaken with the Clinical Director or nominated deputy. The Clinical / Medical Director or nominated deputy will provide the appropriate clinical support as requested /required.&lt;/li&gt;\n&lt;li&gt;Participate in operational and strategic planning for the development of DHU Urgent Care (LLR) CIC division and / or Leicester City Health where appropriate&lt;/li&gt;\n&lt;li&gt;Participate in development activity and projects within the DHU Urgent Care (LLR) CIC division and / or Leicester City Health including development / review of protocols, documentation, clinical governance, audit activity, training and research&lt;/li&gt;\n&lt;li&gt;Maintains GMC registration and license to practice&lt;/li&gt;\n&lt;li&gt;Ensure inclusion on a local Performer’s List&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Person Specification&lt;/p&gt;\n&lt;p&gt;The job holder will have;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;MRCGP or equivalent&lt;/li&gt;\n&lt;li&gt;Must be currently registered on a performers List&lt;/li&gt;\n&lt;li&gt;Valid registration with the GMC&lt;/li&gt;\n&lt;li&gt;License to Practice&lt;/li&gt;\n&lt;li&gt;Recent evidence of continued academic and professional development&lt;/li&gt;\n&lt;li&gt;Experience in Primary Care with a good understanding of issues surrounding Urgent Care Service&lt;/li&gt;\n&lt;li&gt;Previous experience of working in an Urgent Care &amp; GP setting dependent on area looking to work&lt;/li&gt;\n&lt;li&gt;Experience of dealing with challenging behaviour&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information please contact careers@dhuhealthcare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130356.PNG", "name": "DHU Health Care CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130356"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE19 1SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5941", "longitude": "-1.18872"}}, "title": "Salaried GP - LLR", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250587", "validThrough": "2020-12-31T23:59:59+0000"}