{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum/pro rata"}}, "datePosted": "2020-10-30T16:17:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Pharmacy Technician - High Cost Drugs (HCD) &amp; Cancer Clinical Services &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Division: Unplanned &amp; Integrated Care&lt;/p&gt;\n&lt;p&gt;Care Group: Diagnostics &amp; Clinical Support Services&lt;/p&gt;\n&lt;p&gt;Band: 6&lt;/p&gt;\n&lt;p&gt;Salary: £31,365 - £37,890 per annum/pro rata&lt;/p&gt;\n&lt;p&gt;Interview Date: Monday 23rd November 2020&lt;/p&gt;\n&lt;p&gt;We are recruiting for a &lt;strong&gt;Senior Pharmacy Technician - High Cost Drugs (HCD) &amp; Cancer Clinical Services&lt;/strong&gt; who shares our ambition and vision to deliver the &lt;strong&gt;&lt;em&gt;Best of Care by the Best People&lt;/em&gt;&lt;/strong&gt; and have the drive to take us forward, by ensuring that the Trust continues to be the first choice for patients and our staff.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a new role within High Cost Drugs management &amp; Cancer Clinical Services in pharmacy at Medway Hospital.&lt;/p&gt;\n&lt;p&gt;Medway Hospital spends over £20million annually on High Cost Drugs (HCDs) with an increasing portfolio of HCD being added. This is increasing rapidly in our cancer services with more complex regimens being added through NHSE &amp; Cancer Drug Fund commissioners which require prior approval funding.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work closely with the Specialist cancer pharmacist and other senior pharmacy staff to ensure there are robust processes in place to manage HCDs and to minimise commissioner challenges, improve our communication pathways with our commissioners and maximise the cost effective use of all HCDs prescribed at Medway NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;They will also work closely with the pharmacy cancer team to support and develop clinical services on the haematology ward and chemotherapy day unit and support in the development of pharmacy led cancer clinics&lt;/p&gt;\n&lt;p&gt;The successful candidate must be self-motivated, be competent in Microsoft applications, and have an understanding of the commissioner funding streams for HCDs and knowledge of drugs used in cancer treatment.&lt;/p&gt;\n&lt;p&gt;The Trust and its employees are all committed to creating and maintaining a fair and supportive working environment and culture.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to you, we will give you the opportunity to utilise and enhance your talents to assist us in the development of shaping the future of Medway NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Trust offers a number of apprenticeships and training opportunities in Leadership and Management, Business Services, Finance, Accounting, Human Resources, Clinical Support Work, Research and Innovation, Nursing Associate and Assistant Practitioner alongside our in-house comprehensive clinical pathways.&lt;/p&gt;\n&lt;p&gt;Our hope is that our education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the protection of children, young people, their families and vulnerable adults accessing its services. Promoting the message that “safeguarding is everyone’s business” is vital to ensure our patients are protected and safe from abuse. To this end you must comply with Trust’s and the Kent and Medway Safeguarding Board’s policies on safeguarding children, young people and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Agne Sadauskaite - Specialist Cancer Pharmacist&lt;/p&gt;\n&lt;p&gt;agne.sadauskaite@nhs.net / 01634 830000 Ext: 3020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Senior Pharmacy Technician - High Cost Drugs (HCD) &amp; Cancer Clinical", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250925", "validThrough": "2020-11-15T23:59:59+0000"}