{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-30T10:01:27+0000", "description": "&lt;p&gt;Are you an experienced Dietitian looking to lead a dynamic, community based team of Specialist Nutrition Support Dietitians?&lt;/p&gt;\n&lt;p&gt;We are looking for a dietitian with a strong interest in the area of nutrition support and enteral feeding, and wanting to gain experience in a diverse city. Birmingham Community Nutrition delivers a range of services, including home enteral feeding and oral nutrition support to patients in their own homes across the city. Our award-winning team is made up of Dietitians, Nutrition Nurses, Assistant Practitioners, and Administrators. You will work closely with the Team Leaders for the Community Hospitals, Prescribing Support and Nutrition Nursing to provide a co-ordinated response to malnutrition in Birmingham.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who possesses excellent communication skills and have significant experience in managing teams, developing services and monitoring quality. You will also be experienced in audit and report writing, in order to demonstrate the effectiveness of the service.&lt;/p&gt;\n&lt;p&gt;Birmingham Community Nutrition provides a comprehensive community citywide service for the Birmingham CCG and employs over 70 staff. We also support the training of dietetic students from two higher education institutions (A, B &amp; C placements).&lt;/p&gt;\n&lt;p&gt;Benefits of working for Birmingham Community Nutrition include free parking at all community venues, excellent access to IT equipment to work remotely, up to date Covid-secure office facilities and comprehensive admin support dedicated to the service.&lt;/p&gt;\n&lt;p&gt;The department has a structured approach to Clinical Governance and your personal development via preceptorship, annual appraisals, clinical supervision and training opportunities. Career development, flexible working and staff support are given high priority in the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSusan MeredithJob titleClinical Lead/Deputy Head of ServiceEmail addresssusan.meredith@bhamcommunity.nhs.ukTelephone number0121 683 2300Additional contact information&lt;/p&gt;\n&lt;p&gt;We encourage you to contact us for an informal discussion about the role; please contact Sue Meredith, Clinical Lead/Deputy Head of Service on 0121 683 2300/07816 135287 or susan.meredith@bhamcommunity.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Priestley Wharf, Birmingham", "postalCode": "B7 4BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4873", "longitude": "-1.88581"}}, "title": "Band 7 Nutrition Support Dietitian - Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249588", "validThrough": "2020-11-08T23:59:59+0000"}