{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum plus Fringe HCAS"}}, "datePosted": "2020-11-02T11:47:47+0000", "description": "&lt;p&gt;Surrey Heartlands CCG are looking for an Occupational Therapist to support the Continuing Healthcare team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•Are you a highly motivated and skilled Clinician with an interest in Continuing Healthcare?&lt;/p&gt;\n&lt;p&gt;•Are you looking for 9- 5 working hours and no weekend work?&lt;/p&gt;\n&lt;p&gt;•Do you need flexible working arrangements to suit your lifestyle?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If so, we have a vacancy for Band 6 Occupational Therapist within the Surrey Continuing Healthcare Team. The NHS Continuing Healthcare team in Surrey works across three CCGs – NHS Surrey Heartlands CCG, NHS North East Hampshire and Farnham CCG and NHS Surrey Heath CCG. We are hosted by NHS Surrey Heartlands CCG and based out of the Leatherhead office with mobile working conditions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an Occupational Therapist you will be responsible for the assessment and review of Continuing Healthcare patients. You will use your knowledge and clinical skills to ensure that outcomes are determined in a consistent manner to ensure effective application and interpretation of the National Framework for NHS Continuing Health Care and NHS Funded Nursing Care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be:&lt;/p&gt;\n&lt;p&gt;• A credible practitioner within your chosen field&lt;/p&gt;\n&lt;p&gt;• Experienced working within a team&lt;/p&gt;\n&lt;p&gt;• A car owner and driver&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Training and support will be given to the successful candidates&lt;/p&gt;\n&lt;p&gt;This post requires you to have excellent verbal and written communication skills. The team has strong links with community services and collaborative working within the multi-disciplinary team and with our community colleagues in health and social care is essential. We encourage opportunities for professional training and development to increase knowledge and skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to gain a wide range of experience working with individuals who have a broad range of both complex social and health care needs and to work in a service that is constantly committed to improving patient care and experience.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey Heartlands CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128537"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "To be agreed. Home working during Covid", "postalCode": "KT22 9AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2931", "longitude": "-.335021"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251902", "validThrough": "2020-11-16T23:59:59+0000"}