{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 London Allowance £2,162"}}, "datePosted": "2020-11-04T16:16:09+0000", "description": "&lt;p&gt;Camden &amp; Islington mental health and social care trust are seeking to appoint a bright and enthusiastic clinician to this fixed term locum Consultant post in the Camden Assertive Outreach Team (5PAs) and North Camden Recovery &amp; Rehabilitation Team (5 PAs). This post is from January 2021 to October 2021 to cover maternity leave with potential to be extended.&lt;/p&gt;\n&lt;p&gt;The Assertive Outreach Team (AOT) in Camden works with adults with severe and enduring mental illness who have difficulty engaging with mental health services and/or dual diagnosis (HoNOS care clusters 16 and 17). This service is part of the Rehabilitation and Recovery Services division in the Trust.&lt;/p&gt;\n&lt;p&gt;North Camden Recovery &amp; Rehabilitation Team (NCRRT) is part of the care pathway for patients in care clusters 11, 12 and 13, i.e. patients with psychotic illnesses. The care pathway applies the recovery model of care. It delivers evidence-based treatments to patients living in the northern part of Camden.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to hold up to date Section 12 approval and Approved Clinician status. As part of their duties they will participate in the Trust-wide office hours Section 12 rota. They will have 4-5 duty days a year when they will clear their diary and be available to do Mental Health Act assessments. If they are not called for assessments, they can use the time for administration.&lt;/p&gt;\n&lt;p&gt;The post-holder will be supported by a dedicated administrative support provided by a full-time administrator. The post-holder will have an office at the Greenland Road Resource Centre, where the team is based.&lt;/p&gt;\n&lt;p&gt;The Trust became a Foundation Trust in February 2008 and continues as a mental health/social care organisation. It has well established links with the United Royal Free and University college London medical schools and the North London Junior and higher Psychiatric training schemes. Camden and Islington are exciting multicultural inner-city boroughs just on the edge of the City of London and Highgate mental health centre is based close to the varied shops, cafes and cultural amenities in the Highgate area as well as Archway. The Trust is a small and friendly organisation and mentoring is potentially available for first time Consultants.&lt;/p&gt;\n&lt;p&gt;Applicants are expected to have MRCPsych or equivalent and substantial approved training experience in psychiatry, ideally up to CCT level, fulfilling criteria for the Consultant contract. Full GMC registration and a current GMC license to practise are essential. Possession of Section 12(2) approval is essential.&lt;/p&gt;\n&lt;p&gt;Applications should be made through NHSJobs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews are currently likely to be conducted via virtual videoconferencing media at a date to be confirmed .&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameIan PrenelleAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact Dr Ian Prenelle clinical Director at ian.prenelle@candi.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121247.jpg", "name": "Camden and Islington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121247"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Camden AOT and Camden Recovery Team, LONDON", "postalCode": "NW3 5NU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5521", "longitude": "-.172094"}}, "title": "Locum Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256586", "validThrough": "2020-11-24T23:59:59+0000"}