{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-29T19:15:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a motivated, dedicated and innovative Physiotherapist to join the Stroke Therapy Team at Salford Royal Hospital.&lt;/p&gt;\n&lt;p&gt;Salford Royal NHS Foundation Trust is the largest Comprehensive Stroke Centre in the country, achieving a SSNAP score &#39;A&#39; rating. with a strong track record in providing excellent patient care services and staff satisfaction.&lt;/p&gt;\n&lt;p&gt;We are looking for a dedicated clinician with experience and knowledge throughout the whole stroke pathway. The role will include clinical commitments on the Hyperacute Stroke, Acute Stroke and Stroke Rehabilitation Units.&lt;/p&gt;\n&lt;p&gt;You will need to be able to demonstrate your specialist knowledge in the assessment and treatment of stroke patients and have an in-depth understanding of the necessary National Guidelines / Standards, as well as evidence of post-graduate training in this field.&lt;/p&gt;\n&lt;p&gt;You will be expected to support the wider team and assist in the development of your colleagues within this environment. Therefore, the ability to work as part of a team, leadership skills and experience of supervising staff/students are essential . Highly developed communication skills, flexibility, good organisational and time management skills are all essential criteria, alongside sound IT skills. In return, you will be supported by a well established and highly experienced team.&lt;/p&gt;\n&lt;p&gt;We are committed to the delivery of high quality patient-centred care and proactive engagement in supervision, CPD and quality improvement activities are highly valued. You will be expected to be open to change and keen to be part of this drive for service development.&lt;/p&gt;\n&lt;p&gt;You will be expected to contribute to the weekend working service at Salford Royal NHS Foundation Trust and our on-call rota.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jenny Harrison&lt;br /&gt;Clinical Lead Physiotherapist - Stroke Therapy&lt;br /&gt;jennifer.harrison@srft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Royal Hospital, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Static Physiotherapist - Stroke", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249280", "validThrough": "2020-11-12T23:59:59+0000"}