{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-27T13:16:25+0000", "description": "&lt;p&gt;Assertive In-reach Practitioner – Band 6 (Registered Nurse/Physiotherapist /Occupational Therapist)&lt;/p&gt;\n&lt;p&gt;Base: Lincoln County Hospital or Pilgrim Hospital Boston&lt;/p&gt;\n&lt;p&gt;37.5 hours per week, 7.5 hour shifts&lt;/p&gt;\n&lt;p&gt;--------------------------------------------------------------------------------------&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to join our expanding patient flow team who work at both the front and back doors of Lincoln County Hospital or Pilgrim Hospital Boston. We have recently secured funding to pilot this increase in service provision and will be adding to our already well established flow team.&lt;/p&gt;\n&lt;p&gt;Modern pressures on health and social care mean that patient flow is an integral aspect of patient care; the role of Assertive In-reach Practitioner is a fundamental part of ensuring that each person receives the right care, at the right time, and - crucially - in the right place.&lt;/p&gt;\n&lt;p&gt;As an ever expanding aspect of patient care, securing a role in patient flow will provide an excellent opportunity to gain a comprehensive insight into partnership and neighbourhood working. A focus on preventative, personalised care is key: we work to promote the principles of &#39;Home First&#39;, acknowledging that, for most of our patients, engaging in meaningful activities in their home environment if the best way to promote self-care and a sense of well-being.&lt;/p&gt;\n&lt;p&gt;Our LCHS in-reach teams are embedded within the acute hospital; our role is to work alongside our acute colleagues (and other key stakeholders) to facilitate safe, timely discharges from hospital. The ideal candidate will demonstrate a passion for excellent quality, person-centred care, be driven to work dynamically, creatively and passionately with other key partner organisations in order to achieve the best possible outcomes for our patients. Collaborative working, making decisions based upon sound clinical reasoning and having the ability to adapt and flex your way of thinking and approach is essential.&lt;/p&gt;\n&lt;p&gt;With reference to this role, we truly value applicants both with an AHP or nursing background. Within our teams and broader within LCHS we champion the unique skills that each profession has to offer: it is difficult to summarise the opportunities afforded within this role in so few words and so please do not hesitate to contact Liana (Clinical Service Lead) to further discuss how your experience and skills could complement and enhance our offer to the people of Lincolnshire.&lt;/p&gt;\n&lt;p&gt;If you relish working under pressure, have an eye for service improvement and always put the person at the heart of everything you do then we look forward to hearing from you. Within LCHS we are driven to make healthcare fit for the future, if you feel the same then this role is not to be missed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSally WadeJob titleClinical Team LeadEmail addresssally.wade8@nhs.netTelephone number07583110865Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information, or to arrange an insight visit then please contact Sally Wade at 07583110865&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln or Boston, Lincoln/Boston", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Assertive In-Reach Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244697", "validThrough": "2020-11-10T23:59:59+0000"}