{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-11-03T14:01:10+0000", "description": "&lt;p&gt;5 x full time permanent posts, 2 x 12 month secondments, 3 x 6 month secondments - various locations across the City.&lt;/p&gt;\n&lt;p&gt;Exciting opportunities have arisen across Mersey Care Community Services Division within Sefton and Liverpool District Nursing Services. We are looking for dynamic, high skilled nurses with a passion for Community Nursing, who relish the opportunity to work within a truly progressive and established organisation driven towards an integrated model of healthcare.&lt;/p&gt;\n&lt;p&gt;We are looking for Band 6 District Nursing Caseload Holders who would relish the challenge of working within primary care and caring for patients with complex needs whilst working towards an integrated healthcare structure. We are looking for candidate’s who are self-motivated, keen to work in a progressive division and to develop their skills and knowledge in supporting patients who are housebound with long term conditions and complex needs.&lt;/p&gt;\n&lt;p&gt;The successful candidates should be able to work autonomously while demonstrating a team approach, and have strong clinical leadership firmly embedded within their role. We will also require excellent communication skills, clinical decision making skills and a problem solving approach. Successful candidates will be well supported, developed, and have the opportunity to work in an organisation that demonstrated inclusive and supportive leadership.&lt;/p&gt;\n&lt;p&gt;As per NMC guidance for ‘Standards for student supervision and assessment,’ applications will be considered for those without mentorship qualification; the candidate must be able to demonstrate the following within their application:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Interpersonal communication skills, relevant to student learning and assessment&lt;/li&gt;\n&lt;li&gt;Conducting objective, evidence based assessments of students&lt;/li&gt;\n&lt;li&gt;Providing constructive feedback to facilitate professional development in others, and&lt;/li&gt;\n&lt;li&gt;Knowledge of the assessment process and their role within it.&lt;/li&gt;\n&lt;li&gt;Have an understanding of the proficiencies and programme outcomes that he student they assess is aiming to achieve.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Shortlisting is planned for 17th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are planned for 24th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKirsten CollinsJob titleOperational ManagerEmail addresskirsten.collins@merseycare.nhs.ukTelephone number07825723430Additional contact information&lt;/p&gt;\n&lt;p&gt;Kelleigh Hoy 07775009074 or email kelleigh.hoy@merseycare.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Services, Liverpool", "postalCode": "L7 9NJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4083", "longitude": "-2.93346"}}, "title": "Caseload Holder", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254233", "validThrough": "2020-11-16T23:59:59+0000"}