{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907.00 - £30,615.00"}}, "datePosted": "2020-10-28T12:00:43+0000", "description": "&lt;p&gt;Forest Holme Hospice is a 12 bedded specialist palliative care unit providing advanced symptom control and end of life care for patients with complex physical, psychological, social, spiritual needs, with cancer and non cancer diseases.&lt;br /&gt;&lt;br /&gt;We are seeking an experienced registered nurse or a registered nurse who aspires to develop and improve their knowledge, skills and understanding of caring for specialist palliative care patients and their loved ones, joining our caring, friendly, innovative, professional multi-disciplinary team.&lt;br /&gt;&lt;br /&gt;The successful applicant will have excellent interpersonal and communication skills, a desire to learn and a good sense of humour. He or she must be able to demonstrate their passion to deliver the highest standards of holistic, patient centred, nursing care.&lt;/p&gt;\n&lt;p&gt;Evidence of experience palliative care, post registration education and the Teaching and Mentorship Course is desirable, but not essential.&lt;br /&gt;&lt;br /&gt;We have a permanent full time position 37.5 hours, Band 5 position available, a job share would be considered for part time hours. The shift pattern includes a mixture of long day shifts and night shifts, along with some weekend working.&lt;br /&gt;&lt;br /&gt;If you think this post may be of interest to you, please do not hesitate to come and meet us we encourage informal visits to find out more about the post, meet the team and have a look at the lovely environment we work in.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: 11/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional Interview date: 19/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGill MorrisAdditional contact information&lt;/p&gt;\n&lt;p&gt;Please contact ward sister Gill Morris for further details,&lt;/p&gt;\n&lt;p&gt;gillian.morris@uhd.nhs.uk&lt;/p&gt;\n&lt;p&gt;0300 019 8147&lt;/p&gt;\n&lt;p&gt;informal visits are welcomed.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Staff Nurse - Forest Holme Hospice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246457", "validThrough": "2020-11-11T23:59:59+0000"}