{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-21T15:01:00+0100", "description": "&lt;p&gt;The Early Intervention in Psychosis Service (EIP) in Nottinghamshire Healthcare NHS Foundation Trust has secured significant investment to expand the service. Consequently, an exciting opportunity has arisen for a passionate and highly motivated &lt;strong&gt;Care Coordinator&lt;/strong&gt;&lt;strong&gt; (Band 6)&lt;/strong&gt; from either a nursing, occupational therapy or social work background to join our team, working in Nottingham City.&lt;/p&gt;\n&lt;p&gt;The EIP service in Nottinghamshire is delivered through a multidisciplinary team of practitioners who provide comprehensive assessments and evidence-based treatments for people aged 14-65 who are experiencing a First Episode Psychosis (FEP) or an At Risk Mental State (ARMS) for the development of psychosis.&lt;/p&gt;\n&lt;p&gt;You will join a dedicated, enthusiastic and supportive team to ensure the timely assessment of service users referred and formulate recovery focused care plans and relapse prevention plans in collaboration with the person. You will also provide specialist evidence-based interventions, including Family Interventions, to those supported by the service and you will use standard outcome measures to monitor recovery and adjust your care / treatment plans accordingly.&lt;/p&gt;\n&lt;p&gt;You will have a keen interest in working with the client groups served by EIP and a desire to effectively support their families. A good understanding of the principles, ethos, assessments and interventions associated with working within an Early Intervention in Psychosis team will be key and you will be willing to undertake specific training, including Behavioural Family Therapy, to contribute to the successful delivery of a high quality NICE concordant service.&lt;/p&gt;\n&lt;p&gt;If you choose to join us, we will offer you a high level of continuing support, professional development and supervision. You will benefit from joining a highly supportive and motivated team in which your enthusiasm and dedication to providing a high-quality service will be valued as much as the experience you bring to us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Robinson - Team Manager EIP Nottingham South&lt;/p&gt;\n&lt;p&gt;Email address: emma.robinson@nottshc.nhs.uk / Telephone number: 0115 8440525&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Stephen Laird - Team Manager&lt;/p&gt;\n&lt;p&gt;Email address: stephen.laird@nottshc.nhs.uk / Telephone number:0115 8440525&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment.&lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email. Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG3 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9796", "longitude": "-1.12644"}}, "title": "Care Co-ordinator - Early Intervention in Psychosis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237002", "validThrough": "2020-11-15T23:59:59+0000"}