{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-11-04T15:16:14+0000", "description": "&lt;p&gt;Are you looking for a new challenge? Are you passionate about community partnerships? Do you have experience in engaging with various communities? If so, we have an exciting opportunity for you to join our team as a Community Partnerships Officer.&lt;/p&gt;\n&lt;p&gt;This role will be a part of the Strategy, Transformation &amp; Partnerships team, working across the Jameson Division within Central and North West London NHS Foundation Trust (CNWL) which provides adult mental health and learning disability services.&lt;/p&gt;\n&lt;p&gt;Community Partnerships and engagement is an integral part of all transformation initiatives that have been established or will soon be developed to deliver the vision and commitments set out in the NHS Long Term Plan for people with mental health, learning disabilities and autism. It will be integral to advancing mental health equalities, a critical element of the divisional strategy and of the Long Term Plan.&lt;/p&gt;\n&lt;p&gt;The post holder will support in developing and co-ordinating community partnership and community connection projects and communications across the division. This will involve the post holder developing an excellent understanding of the needs of the specific populations in the boroughs and contributing to strategies, alongside the Community Partnership and Engagement Lead.&lt;/p&gt;\n&lt;p&gt;The post holder will have great communication skills enabling them to develop and manage relationships and connections to community groups, faith groups and organisations across the division in order to build strong working relationships with other healthcare providers, voluntary and community groups, small businesses and community pillars.&lt;/p&gt;\n&lt;p&gt;As a compassionate approachable person you will support to engage with diverse partners, ensuring inclusion of disadvantaged community groups, with a particular focus on reaching diverse groups of people including people from a BAME background, people who do not speak English as a first language, older people, young people, LGBT+ people, people with disabilities and people from other less advantaged social backgrounds.&lt;/p&gt;\n&lt;p&gt;Being a part of the Divisional Strategy, Transformation &amp; Partnerships team, the post will also support and help deliver other critical programmes for the key system-wide transformational initiatives for mental health as outlined in the national LTP mental health implementation plan 2019/20 – 2023/24.&lt;/p&gt;\n&lt;p&gt;This post is for an individual who enjoys working with the community, is a multi-tasker with an ability to work under pressure, producing and maintaining robust project documentation, have strong interpersonal skills and a can-do attitude.&lt;/p&gt;\n&lt;p&gt;We believe strongly in providing equal opportunities to all. If you are looking for a new challenge, and wish to be part of a dynamic team which aims to strive towards making a difference to mental health, learning disabilities and autism in our communities then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Interview date:30th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTariro GumboJob titleCommunity Partnerships and Engagement LeadEmail addresstariro.gumbo@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gordon Hospital, Central North West London Trust Headquarters, Central London (subject to change), London", "postalCode": "SW1V 2RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4922", "longitude": "-.136089"}}, "title": "Community Partnerships Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256382", "validThrough": "2020-11-18T23:59:59+0000"}