{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa inc plus Inner London HCAS"}}, "datePosted": "2020-11-03T14:17:00+0000", "description": "&lt;p&gt;This is an exciting opportunity to join a new personality disorders service as it is forming. The service aims to help people with a moderate or severe personality disorder. The aims are to improve patients’ mental well-being, increase their possibility for a settled and stable lifestyle, improve their social and occupational functioning, and reduced use of emergency services and in-patient admissions. This Tier 3 service consisting of 9 wte clinicians, will provide intensive psychotherapy using Mentalization Based Treatment (MBT) and Transference-Focused Psychotherapy (TFP). We will also provide interventions to patients or support to staff at Tiers 1 and 2.&lt;/p&gt;\n&lt;p&gt;The post holder will be involved in delivering a new Service User Network project (SUN). This is an open-access coping skills development group which involves crisis-planning. The post holder will facilitate two or three groups each week. In addition, the post holder will be involved in other types of work including delivering MBT. The post-holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Facilitate SUN groups&lt;/li&gt;\n&lt;li&gt;Deliver MBT individually and in groups.&lt;/li&gt;\n&lt;li&gt;May jointly run groups and consult to or supervise staff in a Lewisham multidisciplinary neighbourhood team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Applicant requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We welcome applicants with broad mental health experience, not necessarily a psychotherapy qualification, but experience of working with this patient group and with groups. We welcome applicants with lived experience and those from a BME background.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work here?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;SLaM has highly skilled and experienced staff. We will provide training and help clinicians learn and become skilled in delivering therapies. Lewisham is a multi-ethnic London borough with good transport links including fast trains to central London. This service is part of the Lewisham adult mental health directorate. The directorate is reorganising its primary and secondary-care services into four neighbourhood teams.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: we are working to identify a base for the new personality disorders service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Patient age group&lt;/strong&gt;: working age adults&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits: &lt;/strong&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of benefits for you and your family. We want you to feel like you are part of a close-knit team at SLaM. It’s important to us that you feel valued and appreciated and that is why we have a comprehensive benefits package on offer. Some of our benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and supporting a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;opportunities to progress your career with a number of programmes such as mentoring, coaching and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;keyworker housing on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;up to 10% from well-known retail brands through Health Service Discounts website.&lt;/li&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Jonathan Radcliffe Job title Consultant clinical psychologist and head of service Email address jonathan.radcliffe@slam.nhs.uk Telephone number 02032286064 or 07794594413&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "TBA, Lewisham, London", "postalCode": "SE13 6LW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4536", "longitude": "-.016997"}}, "title": "Specialist Community Practitioner - Personality Disorder Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254315", "validThrough": "2020-11-15T23:59:59+0000"}