{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T10:51:35+0000", "description": "&lt;p&gt;&lt;span&gt;These posts are being advertised to address a temporary need of 12 months however the Trust has made the commitment to offer Registered Nurses a permanent contract with the Trust. In the event that the need for this post ends, a suitable alternative post will be offered (this does not apply to other registered professions). Applicants should be aware that alternatives may require some flexibility on role and/or location.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for two Community Senior Practitioners (Registered Mental Health Nurse, Occupational Therapist, Social Worker) to join the Harrogate Older Peoples Community Mental Health Team. These posts have become available following the previous post holders being successful in other secondments locally.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit enthusiastic, motivated and experienced clinicians to deliver a Care Co-ordination role in the team. The successful candidates will be able to demonstrate strong clinical skills, daily team leadership and be a role model to others. At all times ensuring high quality care is delivered to individuals living with complex mental health problems over a variety of environments across the geographical area.&lt;/p&gt;\n&lt;p&gt;The post holders will be joining at a time of service transformation. They are expected to demonstrate a flexible and adaptable approach, required with the advent of COVID-19 using technology and being innovative in their support of our patients and carers. This is a fantastic opportunity for both individuals looking to gain experience at a Band 6 level, as well as those with existing experience.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must ensure that prior to applying they have agreement from their current line manager that they can be released on a secondment basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In the event that permanent funding is secured for this post the successful applicant will be confirmed in post on a permanent basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Hargreaves, Community Team Manager&lt;/p&gt;\n&lt;p&gt;rachel.hargreaves@nhs.net&lt;/p&gt;\n&lt;p&gt;01423 795150&lt;/p&gt;\n&lt;p&gt;Paul Hughes / Jane Groome Advanced Nurse Practitioners&lt;/p&gt;\n&lt;p&gt;01423 795150&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Alexander House, Knaresborough", "postalCode": "HG5 0UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0108", "longitude": "-1.46588"}}, "title": "Senior Community Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246184", "validThrough": "2020-11-15T23:59:59+0000"}