{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-29T09:15:38+0000", "description": "&lt;p&gt;This position is part of a dynamic IT Service Desk Team, supporting 8,500 users and over 6,000 PCs, across a network covering Health Service locations, throughout the York and Scarborough local health communities.&lt;/p&gt;\n&lt;p&gt;In addition to this post we have an opportunity for an IT technician to join our team for a 6 months fixed term/secondment  contract to assist with our IT projects&lt;/p&gt;\n&lt;p&gt;The main duties are providing a first line helpdesk service to NHS staff, via telephone and e-mail, receiving new faults and work requests, recording the details in the helpdesk database, and attempting to provide resolutions to a wide variety of technical faults. The posts will be based at our offices in York.&lt;br /&gt;&lt;br /&gt;User support calls will range from simple requests for password changes, through to more complex and novel incidents that cover multiple internal and external IT systems. &lt;br /&gt;&lt;br /&gt;Established procedures must be followed for handling routine faults/work requests, but there will often be a need to investigate novel problems and identify possible solutions to these.&lt;br /&gt;&lt;br /&gt;The post holder will be in regular contact with users of varying levels of IT literacy, and also with technical colleagues within the department, and other IT helpdesks elsewhere.&lt;br /&gt;&lt;br /&gt;Please read carefully the attached Person Specification, and explain in your application how you meet the criteria. Candidates will be shortlisted based upon how they demonstrate and meet the criteria.&lt;br /&gt;&lt;br /&gt;Successful candidates will have at least 1 year experience in an IT Support or Customer Service environment, where they are primarily dealing with people via telephone and e-mail.&lt;br /&gt;&lt;br /&gt;The ability to keep calm and work under pressure is essential in order to efficiently handle peaks in demand, and reassures users their problem will be dealt with.&lt;br /&gt;&lt;br /&gt;A good understanding of IT (i.e. supporting desktop PCs and software for 1 year) and the ability to quickly learn new systems and concepts are essential. &lt;br /&gt;&lt;br /&gt;They will have good listening and questioning skills, and be able to clearly communicate with users and technical colleagues, via telephone and e-mail.&lt;br /&gt;&lt;br /&gt;Candidates will have a good standard of education (i.e. diploma level), and be able to demonstrate competency in the use of Microsoft Office applications.&lt;br /&gt;&lt;br /&gt;Experience of working in the NHS, and using Helpdesk call logging systems will be an advantage, but is not essential.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you wish to apply for this role on a secondment basis please seek permission from your current line manager before applying for the position.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNick SalisburyJob titleSNS Operational ManagerEmail addressnicholas.salisbury@york.nhs.ukTelephone number01904 721673&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "1st Line IM&amp;T Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247699", "validThrough": "2020-11-11T23:59:59+0000"}