{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18540", "minValue": "18540", "unitText": "YEAR", "value": "£18,540"}}, "datePosted": "2020-10-30T14:28:35+0000", "description": "&lt;p&gt;Dorset Clinical Commissioning Group is the third largest in England, with a population approaching 800,000 and more than 80 member practices. We have a committed group of clinicians working to improve health locally.&lt;/p&gt;\n&lt;p&gt;In 2018, Dorset was officially recognised as one of England’s first wave of Integrated Care Systems (ICS). All partners (including primary care, hospitals, community care, local authorities and the community and voluntary sector) agreed to work together to address our health, wellbeing, quality and financial challenges.&lt;/p&gt;\n&lt;p&gt;We have a successful track record and a strong commitment to collaborative working across all of our organisations. There is a lot to be proud of in Dorset, as an ICS we have achieved a great deal over the last three years.&lt;/p&gt;\n&lt;p&gt;We have a national reputation for change, established through our clinical services review, acute hospital reconfigurations, services built around integrated communities and the best technology and workforce innovation. We are committed as partners to see that Dorset continues to benefit from safe, high quality and sustainable services in the future.&lt;/p&gt;\n&lt;p&gt;We are seeking applications from individuals who come with a rich career background drawn from a range of sectors and/or organisations, with substantial experience operating at a senior level. We are looking for individuals who bring a passion to improve healthcare provision in Dorset, and who may draw on relevant healthcare experience to provide innovative leadership to the organisation and actively challenge and bring objectivity to the decisions we make.&lt;/p&gt;\n&lt;p&gt;The Lay Member will also chair the Primary Care Commissioning Committee of the Governing Body.  The Committee aims to make a positive difference to the lives of local people, through the development of primary care and its commissioning strategy. The lay chair will play a pivotal role in guiding the Committee to inform Dorset’s transformational programmes while maintaining probity and robust business scrutiny.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Dorset Clinical Commissioning Group is committed to diversity and we therefore encourage applications from underrepresented groups.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The notional time commitment for the role is 2.5 days per month.  An allowance will be provided for the role.  You will be asked to complete a short application form to express your interest in this role. The closing date for expressions of interest is 30 November 2020 with interviews scheduled for the afternoons of 15 or 16 December 2020.&lt;/p&gt;\n&lt;p&gt;To discuss your informal interest please arrange a telephone call with Dr. Forbes Watson, Chair of NHS Dorset CCG.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128199.png", "name": "Dorset Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128199"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorchester", "postalCode": "DT1 1TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7146", "longitude": "-2.44439"}}, "title": "Governing Body Lay Member", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250567", "validThrough": "2020-11-30T23:59:59+0000"}