{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-27T18:15:20+0000", "description": "&lt;p&gt;Join us at the cutting edge of new care models and systems, and deliver innovative mental health care to children and young people across Kent and Medway. Having recently acquired three new services, we also have fantastic opportunities for a Crisis Consultant, NDLD Consultant, Medical Lead and part-time Adult Psychiatrist and Paediatrician roles.&lt;/p&gt;\n&lt;p&gt;Due to the hard to recruit nature of this post, it has been identified by NELFT as being eligible for a welcome payment subject to the terms set out within the NELFT Recruitment Policy. The welcome payment will be a payment equivalent to 10% of annual basic salary, subject to a minimum payment of £4,000 and maximum of £10,000.&lt;/p&gt;\n&lt;p&gt;We’ll support your professional and personal development, with protected time dedicated to your growth. With a high profile R&amp;D Department, a great QI programme, an excellent CPD and various training opportunities NELFT has lots to offer. We also offer flexible and part-time working arrangements and a generous relocation package if you need to relocate. You’ll not only benefit from the renowned beauty and great heritage of Kent, but also from its affordable housing opportunities, incredible schools and connections to Central London and continental Europe.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you are interested in discussing the opportunities that are available, have professional registration and speak fluent English, please contact Dr Geetha Gandluru Consultant Psychiatrist, Associate Medical Director Kent, NELFT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Highlands House Clinic, Calverley Park Gdns, Tunbridge Wells, Tunbridge Wells", "postalCode": "RM13 8GQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5218", "longitude": ".172052"}}, "title": "CYPMHS Consultant Psychiatrist Tunbridge Wells", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245619", "validThrough": "2020-11-27T23:59:59+0000"}