{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-22T12:16:42+0100", "description": "&lt;p&gt;&lt;strong&gt;Executive Medical Director &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North Wales; Attractive Salary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Betsi Cadwaladr University Health Board is the largest health organisation in Wales. With the stunning Snowdonia National Park at the centre of our area, we provide a full range of primary, community, mental health and acute hospital services for a population of around 678,000 people across the six counties of North Wales. The Health Board has a budget of £1.4 billion and a workforce of approximately 17,000 serving three main hospitals along with a network of community hospitals, health centres, clinics, mental health units and community team bases. The Health Board also coordinates the work of over 100 GP practices and NHS services provided by dentists, opticians and pharmacists in North Wales.&lt;/p&gt;\n&lt;p&gt;We are seeking a new Executive Medical Director to join our Board, provide professional leadership to our doctors and dentists and lead the strategic design of transformational clinical services that improve the health outcomes of our population and meet regulatory requirements. In partnership with our Director of Nursing and Midwifery this role leads the clinical governance agenda and works closely with our University partners to ensure that research evidence informs our improvement work. Operating with a growing and experienced team, our Executive Medical Director has oversight across the Health Board and facilitates collaboration between our clinical networks in primary, secondary and mental health care services. The role will be influential in building relationships internally and externally ensuring that our people, our patients, the media and wider stakeholders are engaged in our future development.&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint an experienced medical leader with a background in Primary, Secondary or Mental Health Care leadership. You will bring a track record of delivery with demonstrable ability in the effective engagement of clinicians across specialties as well as with a wide range of external stakeholders. Highly visible, you will inspire and motivate teams, creating a culture in which we can both recognise and deliver our huge potential. This is an opportunity to bring your strong track record of improvement to build on effective clinical pathways across the care spectrum. Bringing a strong strategic focus, you will quickly build strong relationships with our experienced Board as well as working closely with Welsh Government. With a drive for reducing health inequalities you will win the hearts and minds of our dedicated medical and dental professionals across our integrated organisation. This is an exciting, rewarding and unique opportunity for an experienced Medical Leader to influence change in a complex and truly integrated healthcare environment. It reports to, and will work closely with, our incoming CEO Jo Whitehead who returns from Australia to join us in January, and who will be on the interview panel.&lt;/p&gt;\n&lt;p&gt;For further information about the UHB, our culture and our aspirations, or for a confidential conversation please contact Emma Pickup of GatenbySanderson on 0113 205 6090.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 9AM Monday 9h November; preliminary interviews mid-November; final interviews Early-December &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Betsi Cadwaladr University Health Board is committed to promoting equality and diversity. The Health Board operates a bilingual policy. Applicants under the “two tick” scheme are guaranteed an interview if the minimum criteria is met.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Pickup of GatenbySanderson om 0113 205 6090&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlton Court, St Asaph", "postalCode": "LL17 0JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2563", "longitude": "-3.47783"}}, "title": "Medical Director", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238399", "validThrough": "2020-11-09T23:59:59+0000"}