{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "TBC"}}, "datePosted": "2020-11-06T13:13:10+0000", "description": "&lt;p&gt;Cambria Primary Care is a GP federation which includes the four GP practices in North Ceredigion. It has been established to enable the surgeries to work together to develop services for patients, share skills between the surgeries, jointly employ staff and provide strengthened primary care services in Mid Wales.&lt;/p&gt;\n&lt;p&gt;Our vision is to improving patient outcomes by promoting the sustainability and resilience of the GP Practices in North Ceredigion. Cambria Primary Care is also working with Aberystwyth, Birmingham, Cardiff and Swansea Universities to increase the availability of education and training opportunities for all healthcare professionals in general practice in Mid Wales. This is an exciting time and we are working with Hywel Dda University Health Board to develop primary and community services in North Ceredigion as part of their Transforming Clinical Services Programme.&lt;/p&gt;\n&lt;p&gt;Cambria Primary Care is implementing an immunisation service for babies and children across North Ceredigion. The service is delivered through 4 GP Practices offering all childhood vaccinations.&lt;/p&gt;\n&lt;p&gt;We are looking for a band 5/6 registered nurse/health visitor who is enthusiastic, energetic and has a passion for delivering the best care possible care to patients of North Ceredigion. Knowledge of the childhood immunisation schedule is desirable for this role. You will work as part of a team to organise, plan, deliver and evaluate vaccination programmes and be expected to attend immunisation sessions at the 4 GP Practices in Aberaeron, Borth, Llanilar and Tregaron.&lt;/p&gt;\n&lt;p&gt;In return for your commitment we will make sure you receive the support and development you need to prepare yourself for future challenges. We also make it easy for you to access continuing professional development according to the needs of the Service. CPC is recognised locally for providing high quality, innovative healthcare. We aim to employ only the best people, and our experts are frequently called upon to contribute to national health strategy and policy, and models of our care have been adapted for use in other countries.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Ceredigion", "postalCode": "SY234PA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3568", "longitude": "-4.02107"}}, "title": "Immuniser and Vaccine coordinatror", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259839", "validThrough": "2020-11-10T23:59:59+0000"}