{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-02T10:16:00+0000", "description": "&lt;p&gt;The MCS Division of Gynaecology at Manchester Foundation Trust provides a wide range of secondary and tertiary level gynaecology services across 3 sites; Saint Mary’s Oxford Road Campus (ORC) Hospital, Wythenshawe Hospital and Withington Community Hospital. Gynaecology services are divided into 4 subspecialty fields; Benign Specialist Gynaecology, Gynaecological Oncology, Reproductive Medicine and Urogynaecology.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic and motivated individual to work within the Gynaecology Division, working across the MCS but based at the Oxford Road Campus. As an Assistant Medical Secretary you will be responsible for the typing of clinic letters and resulting administration such as management of results and booking follow-up appointments, aiding our Clinicians in providing quality care to our patients. Often you will be interacting with patients over the phone and providing exemplary customer service to our patients as well as liaising with other departments to facilitate patient’s care.&lt;/p&gt;\n&lt;p&gt;This is a fast paced role and excellent communication and organisation skills are essential along with the ability to work as part of a team and under the pressure of deadlines. Adaptability is also a key requirement with the successful candidate being required to cover a number of sub-specialities within the department.&lt;/p&gt;\n&lt;p&gt;Previous knowledge of working in a similar role and/or in a clerical role is essential. Experience working in a similar role within the NHS is desirable. An understanding of National NHS waiting time targets would be desirable. In return we offer a rewarding role that offers challenge but also support from your team manager with training opportunities identified and offered in order to support your ongoing development. You will be joining a team who are passionate about providing great patient care and who face challenges head on to achieve this.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStella WellingsJob titleService ManagerEmail addressStella.Wellings@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Saint Mary&#39;s Hospital Oxford Road, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Gynaecology Assistant Medical Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251526", "validThrough": "2020-11-09T23:59:59+0000"}