{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Salary will be dependent on experience"}}, "datePosted": "2020-11-02T14:31:42+0000", "description": "&lt;p&gt;&lt;strong&gt;WE ARE LOOKING FOR&lt;br /&gt;&lt;/strong&gt;A technical individual to join the Medical Physics Computer Science team in a full time, permanent role. The successful candidate will be customer facing and expected to demonstrate excellent technical skills and have a practical approach to problem solving with very good written and verbal communication skills, and be confident using the telephone. They ideally will hold a formal IT qualification or have relevant experience. The successful applicant will have a flexible approach to their duties, the ability to work as part of a team but also have sufficient confidence and skills to work independently. There is a requirement for occasional cross site working to meet service needs, so own transport is advantageous.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT YOU WILL BE DOING&lt;br /&gt;&lt;/strong&gt;“Our team plays a vital part in maintaining business as usual services, managing the Oncology desktop/server/network estate including Trust-wide and Kent-wide systems. This role is instrumental in ensuring continuity of service and availability of clinical and non-clinical systems within the Trust. IT support experience within a corporate or public sector organisation would be desirable”&lt;/p&gt;\n&lt;p&gt;Working as part of a busy Computer Science team providing a first line I.T. support role. This will involve receiving calls by phone or the Service Desk system and responding appropriately; resolving issues remotely, occasionally in person and sometimes by just giving guidance and advice. Tasks will include things like helping staff with computer issues; dealing with application queries; moves and changes to equipment; supporting the various clinical systems across our sites, installation and configuration of computer hardware and software.&lt;/p&gt;\n&lt;p&gt;You should possess good troubleshooting skills and be able to work through issues logically to provide appropriate resolutions in a timely manner. You will be working closely with 2nd and 3rd line staff, and must accurately record and disseminate relevant information to members of the team, ensuring that all systems have appropriate support documentation updated accordingly.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;INTERNAL APPLICANTS&lt;br /&gt;&lt;/strong&gt;Internal applicants who wish to be considered for a secondment opportunity should discuss with their line manager the suitability of a possible secondment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;REQUIRED SKILLS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Formal IT qualification and/or relevant experience would be advantageous however the successful candidate will have :-&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;* An ability to understand and prioritise requests.&lt;/p&gt;\n&lt;p&gt;* An ability to manage people’s expectations.&lt;/p&gt;\n&lt;p&gt;* A flexible approach.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;* Experience of supporting NHS information systems will be an advantage.&lt;/p&gt;\n&lt;p&gt;* Ability to work well alone or as part of a team.&lt;/p&gt;\n&lt;p&gt;* Ability to organise and plan their workload.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BENEFITS&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;* Flexible working options &lt;br /&gt;* Membership of the NHS pension scheme&lt;br /&gt;* Generous paid leave allocation.&lt;br /&gt;* Childcare vouchers&lt;/p&gt;\n&lt;p&gt;Applicants with less experience should feel free to apply because appropriate training will be provided. You will be appointed at a lower band with an amended job description.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;If you get satisfaction from fixing complex issues, want to make a difference in the National Health Service and are interested in job security tied to a good salary and pension bundle then The COMPUTER SCIENCE service within Medical Physics could be the place for you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Monday 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMark PriceJob titleHead of OperationsEmail addressmark.price@nhs.netTelephone number07841 422776&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone Hospital", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Computer Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252452", "validThrough": "2020-11-16T23:59:59+0000"}