{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "52111", "minValue": "32577", "unitText": "YEAR", "value": "19.38ph - £31.00ph"}}, "datePosted": "2020-11-06T13:14:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Bank Community PsychiatricNurse Band 6&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Days: £19.38 Saturdays/Nights: £25.19 Sunday/Bank Hols: £31.00&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Trust:&lt;/strong&gt; Worcestershire Health and Care NHS Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location Covered:&lt;/strong&gt; Hereford&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to work within a trust where they are dedicated with ensuring that all employees have the right values to provide the best service to patients? Would you like to be part of a team at a Trust rated ‘good’ in a recent CQC report? Would you like your work to be flexible to fit your lifestyle and circumstances?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Worcestershire Health and Care NHS Trust is a leading provider of community nursing, therapy, and mental health services to people of all ages throughout our county.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We believe our staff are our biggest asset. We want to develop a positive, inclusive, and caring culture that engages and inspires all our staff, with a clear focus on improvement and advancing equality of opportunity.&lt;/p&gt;\n&lt;p&gt;We are recruiting highly motivated and committed Band 6 Community Psychiatric Nurses to join the bank to support our long-term placements across the county and providing anopportunity to work in a busy and varied environment, alongside clinical and other non-clinical colleagues to make a positive contribution to our patients and staff experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Maintain high standards of care, working with service users to ensure their individuality and dignity is always maintained , while promoting independence.&lt;/li&gt;\n&lt;li&gt;Ensure that each patient in his/her care receives an individual assessment and regularly updated care plan which is formulated with the service user. This will be in line with the Trust’s CPA Care Coordination Policy.&lt;/li&gt;\n&lt;li&gt;Ensure that information regarding the service user’s needs and progress are communicated promptly and accurately to other people involved in their care, having due regard for confidentiality.&lt;/li&gt;\n&lt;li&gt;Use a Behavioural Family Therapy approach to care for service users, where appropriate.&lt;/li&gt;\n&lt;li&gt;Ensure that the requirements of the Mental Health Act 1983 and Mental Capacity Act 2006 are met and that service users’ rights under the Acts are upheld.&lt;/li&gt;\n&lt;li&gt;Facilitate open and harmonious communication amongst staff within the team, as well as other teams and agencies, with the aim of promoting multi-disciplinary approaches to care.&lt;/li&gt;\n&lt;li&gt;Work as CPA Care Coordinator to service users, where required.&lt;/li&gt;\n&lt;li&gt;Provide information and support for service users and families.&lt;/li&gt;\n&lt;li&gt;Encourage positive mental health in consumers of the service.&lt;/li&gt;\n&lt;li&gt;Give extensive psychiatric nursing intervention and psychological care and advice.&lt;/li&gt;\n&lt;li&gt;Participate in a duty system on a regular basis.&lt;/li&gt;\n&lt;li&gt;Ensure recovery focused approach for patient intervention.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In order to apply for a post, you&lt;strong&gt;must&lt;/strong&gt;have a minimum of 6 months experience in a similar role held within the last 2 years and have a Valid NMC Pin.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of working Bank&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates -&lt;/strong&gt; work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of shifts at your Trust –&lt;/strong&gt; Access to shifts before they are available to agency&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working to suit your lifestyle –&lt;/strong&gt; Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance for every shift you work &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book and manage your shifts on the go –&lt;/strong&gt; Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it –&lt;/strong&gt; 24/7 365 days – Call us anytime on 03332 407 552&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades, and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with Stephanie Phillips, Trust Recruitment Coordinator on 01905 681781 or email Stephanie.phillips@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR4"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1229", "longitude": "-2.82901"}}, "title": "Bank Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259844", "validThrough": "2020-11-20T23:59:59+0000"}