{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-30T17:01:26+0000", "description": "&lt;p&gt;Band 8a Clinical Psychologist – CORE-OM (is a consultation service delivered to the National Probation Service, NPS) &amp; Rebuilding Lives (is an intervention service delivered to offenders managed by the NPS)&lt;/p&gt;\n&lt;p&gt;We are looking for a suitably experienced Clinical Psychologist to deliver both the CORE-OM and the intervention (ReBuilding Lives) aspects of the Offender Personality Disorder Pathway (OPDP); the post is a 50:50 time split. This post is part of the remodelling of the National OPD services, which are a partnership between NHS England and Her Majesty’s Prison and Probation Services (HMPPS). Whilst this service has been operational for some time, this change of delivery model will give the post holder the opportunity to contribute to the development of the provision in line with our recent service evaluation and be involved with future research and evaluation, (both at local and national levels). It will be desirable that the post holder has experience working with the Forensic population and specifically with people with Personality difficulties. They must be able to demonstrate experience/competence and leadership around psychosocial formulation and evidence competence/experience in psychological interventions using a relational model.&lt;/p&gt;\n&lt;p&gt;Within Cumbria this service operates across the 4 probation areas of Barrow, Kendal, Workington and Carlisle and includes input into the Approved Premises in Carlisle, and as such will involve some travel around these areas, with occasional travel to meetings in Leeds and London. The service is part of a larger team that covers both the Northumbria and Durham/Cleveland probation areas and ‘sits’ within CNTW’s Secure Care community services.&lt;/p&gt;\n&lt;p&gt;This post is within an area team that consists of an OPDP Offender Manager, within the CORE-OM service, and within the ReBuilding Lives team there is an Occupational therapist and Support worker. In the Cumbria area there is a particular emphasis on an accommodation /housing strategy and this post will work with Housing support workers to understand the particular relational/behavioural presentations that cause difficulties within this arena. As it is a new direction for the service, the post will also involve leading on service development, with particular emphasis on partnership working with local agencies to develop a pathway that supports community integration. There is a strong research culture both at local and national level and it is expected that all staff within the service are engaged with this.&lt;/p&gt;\n&lt;p&gt;The post holder will provide professional supervision to the OPDP OM and any Assistant Psychologists in their service and will be part of the Forensic Psychology Team that are located within CNTW.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namejackie miltonJob titlePrincipal TherapistEmail addressjacqueline.milton@cntw.nhs.ukTelephone number0191 2467274Additional contact information&lt;/p&gt;\n&lt;p&gt;The OPD Pathway involves working with offenders who are assessed as High Risk of Violence/Sexual Violence and as such it may be helpful to applicants to have a discussion about the service prior to an application.&lt;/p&gt;\n&lt;p&gt;For further details please contact&lt;/p&gt;\n&lt;p&gt;Jackie Milton - Principal Psychological Therapist 0191 2467274 or&lt;/p&gt;\n&lt;p&gt;Gail McGregor - Lead Consultant Psychologist 0191 2467269&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cumbria", "postalCode": "NE3 3XT"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0063", "longitude": "-1.63477"}}, "title": "Senior Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251024", "validThrough": "2020-11-22T23:59:59+0000"}