{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata, per annum"}}, "datePosted": "2020-11-03T16:30:44+0000", "description": "&lt;p&gt;Are you looking for a new challenge? Are you ready for the move from a Band 5 to a Band 6? Ready to learn new skills? Please read on.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for an enthusiastic Part-time Audiologist to work within the Centre for Hearing and Balance Disorders here at University Hospitals Coventry and Warwickshire NHS Trust. The role could be worked over 4 half days or 2 full days depending on the preference of the successful applicant.&lt;/p&gt;\n&lt;p&gt;Experience in Tinnitus management is desirable for this role however we will train you if you have wish to specialise in this area but don&#39;t yet have the relevant experience.&lt;/p&gt;\n&lt;p&gt;Please be advised that you must have NHS experience to apply for this role.&lt;/p&gt;\n&lt;p&gt;As this post involves carrying out home visits candidates must hold a valid UK driving licence and have access to a vehicle.&lt;/p&gt;\n&lt;p&gt;Our department, which has maintained its UKAS accreditation for 7 years, offers the following services:&lt;/p&gt;\n&lt;p&gt;Adult Services include hearing aid fitting including complex services, diagnostic services, tinnitus rehabilitation and balance testing and rehabilitation. We liaise with a variety of services such as ENT, neurology and physiotherapy.&lt;/p&gt;\n&lt;p&gt;Paediatric Services include a Newborn Hearing Screening Programme, diagnostic services and hearing aid clinics. We have excellent links with education and community services alongside an established Children’s Hearing Services Working Group.&lt;/p&gt;\n&lt;p&gt;Although this is predominantly an adult based role there will be an opportunity for you to be involved in paediatric assessment clinics in the community or at the hospital.&lt;/p&gt;\n&lt;p&gt;We are an established training site for PTP and STP students from Aston University. We serve a population of about 500,000 across Coventry and Rugby providing full adult and paediatric services. There are excellent road and good rail links for commuting.&lt;br /&gt;&lt;br /&gt;We provide a monthly dedicated training session for all staff to provide opportunities to ensure your CPD is maintained.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name - Ann-Marie Hawkins&lt;/p&gt;\n&lt;p&gt;Job title- Principal Adult Audiologist&lt;/p&gt;\n&lt;p&gt;Email address- ann-marie.hawkins@uhcw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 02476 966444&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHCW, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Senior Audiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254790", "validThrough": "2020-11-17T23:59:59+0000"}