{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata pa (conditions apply)"}}, "datePosted": "2020-11-06T10:16:29+0000", "description": "&lt;p&gt;&lt;strong&gt;Nursing Assistant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job type: &lt;/strong&gt;Permanent (conditions apply)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working pattern: &lt;/strong&gt;Part Time 22.5 hours&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay scheme:&lt;/strong&gt; Agenda for change&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Band: &lt;/strong&gt;Band 2 (£18,005 - £19,337 pro rata pa) (conditions apply)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff Group:&lt;/strong&gt; Nursing/Midwifery&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialty/Function: &lt;/strong&gt;Obs &amp; Gynae&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Note: Suitable for people new to Healthcare (with no experience)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note - previous applicants need not apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The University Hospital of North Midlands NHS Trust is one of the largest Hospital Trusts in the country. Its 10,000 workforce provide a full range of emergency treatment, planned operations and medical care from the two hospitals in Stafford and Stoke on Trent.&lt;/p&gt;\n&lt;p&gt;Both the Royal Stoke University Hospital in Stoke and the County Hospital in Stafford are going through exciting positive development and change, at the moment.&lt;/p&gt;\n&lt;p&gt;Children’s Women’s and Diagnostics encompasses the following Directorates Children’s Women’s (Obstetrics and Gynaecology) Outpatients Pharmacy Imaging Pathology Clinical Technology Bereavement Services.&lt;/p&gt;\n&lt;p&gt;Child Health&lt;/p&gt;\n&lt;p&gt;Child Health has a workforce of 500 staff&lt;/p&gt;\n&lt;p&gt;Child Health have the following services: Children’s Outpatients, Children’s Emergency Department, Children’s Assessment Unit, Paediatric Intensive Care Unit, High Dependency Unit, Oncology Unit (inpatient and Day -case services) Acute Medicine and Surgical Daycase services and a level 3 Neonatal Unit. UNHM has a Children’s hospital Board which focussed on strategic developments such as the CAMHS profile, Surgical Transformation, one stop MRI, ward reconfiguration and transition agenda. The offer of parity of service and quality of care is paramount for all Children accessing care on the UHNM site inclusive of areas outside the remit of child health such as fracture clinic.&lt;/p&gt;\n&lt;p&gt;The Children’s workforces are passionate about the quality of care delivered and seek to enhance this at every opportunity. The team approach has led to improvements such as music and art therapy in conjunction with partners in education and hospice care. There are numerous opportunities in specialist services such as cystic fibrosis, gastroenterology, oncology and long term ventilation. Our teams are supported with a robust education programme co-ordinated with the education nurses. Children’s services are innovative, compassionate and forward thinking we welcome new members of the team who get support and care to deliver the quality and compassion we come to expect.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you interested in becoming a Nursing Assistant and deliver first class patient care?&lt;/li&gt;\n&lt;li&gt;Are you compassionate, reliable, motivated and ready for a challenge?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If so, we are looking to recruit motivated and enthusiastic Nursing Assistants to join our dynamic and friendly teams and provide safe and supportive care to patients, relatives and their loved ones. In this post you would be responsible for providing fundamental elements of patient care as directed by the qualified nursing/midwifery team to ensure our patients receive the highest standard of dignified and respectful care, in accordance with their care plans. We are looking for people who are compassionate and feel passionately about providing a level of care they would wish for their family and friends.&lt;/p&gt;\n&lt;p&gt;These posts are linked to the Career Development Pathway.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Successful applicants who fulfil the essential qualifications/skills on the person specification/job description will be offered a Band 2 Nursing Assistant substantive post.&lt;/li&gt;\n&lt;li&gt;Successful applicants who do not fulfil the essential qualifications/skills on the person specification will be offered a role as a Nursing Assistant on the Apprentice Pathway (On successful completion of training you will move to Band 2). Both posts will be subject to terms and conditions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful applicants will either be based at Royal Stoke University Hospital or County Hospital, Staffordshire (maybe required to work at either Hospital). As provision of care is a 24 hours, 7 days a week career, you will be required to work shifts, including nights, weekends and bank holidays. Enhancements will be paid for unsocial hours.&lt;/p&gt;\n&lt;p&gt;The successful candidates on the Apprentice Pathway will be required to complete a training competency package, which involves completion of the Care Certificate and enrolment onto the CQF/NVQ Level 2 qualification in care, of which you will receive 1 day/week study leave and peer mentorship during this period, all whilst being paid a competitive salary. Pay increase to Band 2 is subject to completion of Care Certificate, specific competencies and subject to satisfactory sign off from the Ward manager.&lt;/p&gt;\n&lt;p&gt;Appointments to the post will commence at the lowest salary point, respectively, unless confirmed otherwise by HR Employment Services.&lt;/p&gt;\n&lt;p&gt;Please note that the application process for these posts will close when sufficient applications are received.&lt;/p&gt;\n&lt;p&gt;For informal visits and any other queries, please email: Jan Fieldhouse janet.fieldhouse@uhnm.nhs.uk Tel: 01782 672110&lt;/p&gt;\n&lt;p&gt;Matron/Ward manager from Division recruiting: Jan Fieldhouse janet.fieldhouse@uhnm.nhs.uk Tel: 01782 672110&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJan FieldhouseJob titleDepartment ManagerEmail addressjanet.fieldhouse@uhnm.nhs.ukTelephone number01782 672110&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHNM, Stoke on Trent", "postalCode": "ST6 4QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0718", "longitude": "-2.23124"}}, "title": "Nursing Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259171", "validThrough": "2020-11-08T23:59:59+0000"}