{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25615", "minValue": "24210", "unitText": "YEAR", "value": "£24,210 - £25,615 p.a inc HCA"}}, "datePosted": "2020-11-02T08:17:04+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;The Urology Decontamination Unit is responsible for the full decontamination of medical devices and the disinfection of endoscopes and other non-invasive products. The Decontamination unit is a small but very busy unit supplying endoscopes to the one stop clinic as well as various other clinics that require scopes within the department. Recently the decontamination unit replaced its washers with state of the art equipment which has resulted in quicker turnaround times and higher throughput.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic and proactive team player to take on the post of Decontamination Supervisor. Based at Guy’s Hospital, the post holder will act as the lead for a particular line or clinical speciality providing supervision to a small team of Endoscopy Technicians ensuring adherence to procedures, production targets (KPIs), quality standards, and health and safety legislation whilst striving for optimum turnaround times.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;As a decontamination supervisor the role holder responds to workload demands requiring urgent action to address any part of the unit as guided by the Decontamination Lead.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;Supervising a team of Decontamination Technicians, the post holder must have good leadership skills, sound knowledge in Endoscopy Decontamination processes, legislation and protocols.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJohn FrancisJob titleMedical Equipment and Decontamination LeadEmail addressjohn.francis@gstt.nhs.ukTelephone number02071880862Additional contact information&lt;/p&gt;\n&lt;p&gt;For an informal chat or walk around please contact John Francis Tel 02071880862&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s Hospital, Southwark", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Decontamination Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251324", "validThrough": "2020-11-13T23:59:59+0000"}