{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681"}}, "datePosted": "2020-10-30T09:16:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Community nursing sister or Community charge nurse – Slough&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re reading this ad, you’re very likely to already be on your community nursing career journey; if that is the case there is no better stop to make on that journey than to join the community nursing family at Berkshire Healthcare NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;As the largest provider of community services within the county of Berkshire we have grown a workforce that delivers excellence when responding to that demand. This was evident within our most recent CQC report, Berkshire Healthcare NHS Foundation Trust were awarded “Excellent”, the first community and mental health trust in the south to be awarded this rating, we aim to continue these standards and exceed through the development of our workforce.&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Community nursing sister/change nurse&lt;/strong&gt;, you will be integral in maintaining those standards as you manage a team of community nurses whilst being accountable for the care of the team. We understand that supporting, developing and nurturing our staff leads to outstanding patient care. We have a variety of opportunities to help you develop both your skills and your career, introduce and implement innovations within your service and make a true difference to the lives of our service users.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will &lt;strong&gt;line manage a team&lt;/strong&gt; of band 5 community staff nurses and healthcare practitioners with support from a district nurse.&lt;/li&gt;\n&lt;li&gt;You will &lt;strong&gt;support and nurture&lt;/strong&gt; your team to be autonomous, skilled practitioners&lt;/li&gt;\n&lt;li&gt;You will &lt;strong&gt;visit patients&lt;/strong&gt; on a daily basis in their own homes&lt;/li&gt;\n&lt;li&gt;You will assess for and provide &lt;strong&gt;high quality nursing care&lt;/strong&gt; to a range of patients with varying healthcare needs&lt;/li&gt;\n&lt;li&gt;Some of the healthcare you will be expected to provide include; &lt;strong&gt;end of life care&lt;/strong&gt;, &lt;strong&gt;wound management&lt;/strong&gt;, and much more.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Full time (37.5 hours per week) and part time opportunities available&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Are you familiar with Slough?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Slough is the second largest town in Berkshire and is within the Greater London Urban Area. There is good shopping in the c within the Observatory and the Queensmere malls. There is also a leisure centre and a sports centre, a 10-screen cinema and an ice-rink, plus two grammar schools which do particularly well. Links to the centre of London are excellent with four trains an hour to Paddington, fast trains taking only 18 mins. The A4, M4, M40 and M25 are all easily accessible making travel to and from very straightforward.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of joining our team:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AfC Salary ranging from &lt;strong&gt;£31,365 to £37,890&lt;/strong&gt; per annum (plus up to 5% HCAS)&lt;/li&gt;\n&lt;li&gt;Up to 5%&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working&lt;/strong&gt; opportunities and a strong emphasis on your &lt;strong&gt;work life balance&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;Annual leave – &lt;strong&gt;27 days for new starters&lt;/strong&gt;, 29 days after 5 years and 33 days after 10 years NHS service plus &lt;strong&gt;bank holidays&lt;/strong&gt;. Pro rata for part time staff&lt;/li&gt;\n&lt;li&gt;Excellent &lt;strong&gt;learning and development opportunities&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Lease car&lt;/strong&gt; scheme&lt;/li&gt;\n&lt;li&gt;Generous maternity, paternity and adoption leave for eligible staff&lt;/li&gt;\n&lt;li&gt;Advanced IT enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent staff support and advice.&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The 4 “must haves” for you to be considered for this role&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;A desire to develop leadership and management skills&lt;/li&gt;\n&lt;li&gt;A &lt;strong&gt;passion&lt;/strong&gt; for community nursing, that matches our passion to provide &lt;strong&gt;excellent healthcare&lt;/strong&gt; for our patients within their own home&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Adult nursing qualification&lt;/strong&gt; along with &lt;strong&gt;NMC registration&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;A full &lt;strong&gt;UK Driving Licence &lt;/strong&gt;and have &lt;strong&gt;use of a car&lt;/strong&gt; for work purposes&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Should you match up to the 4 points listed above, then we would recommend you make your application to work at Berkshire Healthcare NHS Foundation Trust!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details about this role or questions in general about working for Berkshire Healthcare please contact: Kerry Wilson, Community Nursing Manager, via email at Kerry.Wilson@berkshire.nhs.uk or give Kerry a call on: 07919 691857&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Upton Hospital Slough, Slough", "postalCode": "SL1 2BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5054", "longitude": "-.59374"}}, "title": "Community nursing sister or Community charge nurse – Slough", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249452", "validThrough": "2020-11-29T23:59:59+0000"}