{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-10-28T14:48:05+0000", "description": "&lt;p&gt;Are you interested in being a part of a small and friendly team in the South Cotswolds Network? We are looking for a full-time band 4 Wellbeing Coordinator to join the South Cotswold Frailty Service. The service works with people with frailty to understand what is important to them, to improve quality of life, functional capability and independence. Personalising the care of people with frailty helps to avoid unnecessary hospital admissions, maximises independence, and proactively supports people to manage the symptoms of their long term conditions.&lt;/p&gt;\n&lt;p&gt;The post holder will be linked to GP practices identified within the South Cotswolds Network. They will work closely with colleagues across health, social care and third sector organisations to support holistic and person centred care at home. &lt;strong&gt;The role involves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Undertaking screening assessments to determine the referral into the service.&lt;/li&gt;\n&lt;li&gt;Providing a timely assessment to those patients who have symptoms of frailty and who have been identified as benefitting from the service.&lt;/li&gt;\n&lt;li&gt;Supporting those living with frailty to achieve prolonged quality of life, improved functional capability and independence, and help keep patients living with frailty from slipping into the more severe frail (2%) cohort of patients&lt;/li&gt;\n&lt;li&gt;Supporting patients with an opportunity to attend and participate in social activities within the locality or, in the current environment to minimise the impact of social isolation and the new world we live in.&lt;/li&gt;\n&lt;li&gt;Supporting patients to identify and achieve their goals and improve quality of life.&lt;/li&gt;\n&lt;li&gt;Acting as a single point of contact for patients on caseload.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a permanent role, and the hours of work will be between 8.00am and 6.00pm (Monday-Friday) although in the future expansion of hours may be considered to include 7 day working&lt;/p&gt;\n&lt;p&gt;For further information please contactSally-Anne Bauer email s.bauer@nhs.net.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128636.png", "name": "Gloucestershire Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128636"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucestershire", "postalCode": "GL7 1US"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7148", "longitude": "-1.97234"}}, "title": "Wellbeing Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247051", "validThrough": "2020-11-08T23:59:59+0000"}