{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-10-23T10:01:30+0100", "description": "&lt;p&gt;We have a great opportunity for a responsible, logical and methodical individual to join our well established and experienced team of Ward Clerks.&lt;/p&gt;\n&lt;p&gt;This is &lt;strong&gt;Part Time &lt;/strong&gt;position where the candidate will &lt;strong&gt;be based on one of our inpatient wards &lt;/strong&gt; providing a focused ward administration service within the Clinical Administration Inpatients department .&lt;/p&gt;\n&lt;p&gt;Your working days and hours will be 15 hours per week, working Monday &amp; Friday . Please ensure that you are available to work for these dates and times before applying as flexibility is limited given the demands of the service.&lt;/p&gt;\n&lt;p&gt;You will be working in direct or semi direct contact with inpatients, relatives and a multidisciplinary team of nurses, doctors, physiotherapists or pharmacists amongst other professionals. You will be one of the first faces our patients and relatives will see when they first walk into our hospital, and you will be dealing with queries face-to-face, on the phone and via email. For this reason the post holder will have excellent communication and spelling skills alongside the ability to multi task and remain calm under pressure.&lt;/p&gt;\n&lt;p&gt;Your main focus will be Data Entry: capturing patient’s demographics, ensuring the efficient and timely admission, transfer and discharge of patients into ourPAS System C Medway, dealing with patients’ medical notes and being responsible for the accurate and timely input of information into our PAS system for the purposes of patient care and data quality.&lt;/p&gt;\n&lt;p&gt;The role includes a wide range of general administration tasks including working with PAS System C Medway , Outlook, Excel, Word, Spine Portal, Bloodhound or Panda. Previous experience on our systems is not required as training will be provided, however computer literacy and good knowledge of Microsoft Office is a must.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be honest, confident and successful when prioritising their workload.&lt;/p&gt;\n&lt;p&gt;You will be required to have a good level of education and have experience in administration and clerical duties with good customer service. Previous experience within a hospital setting is not a must but it is an advantage.&lt;/p&gt;\n&lt;p&gt;You will need to be able to work as part of a team, but also be able to work unsupervised, using your own initiative and reporting skills. You will have excellent organisational and time keeping skills, which are essential for this position.&lt;/p&gt;\n&lt;p&gt;We encourage candidates to contact us prior to applying to this position to clarify doubts (e.g. working times) and go through the person specification and informal discussion.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Joanne Delaney&lt;/p&gt;\n&lt;p&gt;Job title Ward Clerk Team Leader&lt;/p&gt;\n&lt;p&gt;Email address Joanne.delaney2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01273 696955 ext 62921&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Ward Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239927", "validThrough": "2020-11-09T23:59:59+0000"}