{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 per annum/pro"}}, "datePosted": "2020-11-05T15:01:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Overseas Pre-Registration Nursing Opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Division: Planned Care and Unplanned &amp; Integrated Care&lt;/p&gt;\n&lt;p&gt;Band: 5&lt;/p&gt;\n&lt;p&gt;Salary: £24,907 - £30,615 per annum/pro rata&lt;/p&gt;\n&lt;p&gt;Are you a registered international Nurse looking for comprehensive OSCE support to complete your NMC registration?&lt;/p&gt;\n&lt;p&gt;Here at Medway, we pride ourselves on working together as one to ensure that our shared vision of Better, Best, Brilliant is achieved.&lt;/p&gt;\n&lt;p&gt;Our Trust is a great choice for people who want to develop their career in an ambitious and dynamic environment; we also offer an excellent benefits package which includes onsite childcare facilities, various salary sacrifice schemes and a generous annual leave entitlement.&lt;/p&gt;\n&lt;p&gt;We are less than an hour from London and just a few minutes away from the Kent countryside, The Trust is a fantastic choice for nurses who want to develop their career in an ambitious and dynamic environment – whether you want to commute to your new role or relocate to the rapidly regenerating local area.&lt;/p&gt;\n&lt;p&gt;We are actively recruiting overseas trained nurses who have achieved their IELTS (Level 7) or OET (Grade 8) and who have successfully completed the NMC competency based test (CBT) to join us as a Pre-Registration Nurse.&lt;/p&gt;\n&lt;p&gt;If successful at interview, you will be offered a contract as a Pre-Registration Nurse (Band 4) progressing to a Qualified Nurse once registered with the NMC. You must be committed to undertaking additional study and taking your OCSE within six months of arriving within the Trust.&lt;/p&gt;\n&lt;p&gt;As a Trust we are able to offer you a comprehensive OSCE training package lasting four weeks and boasting an above 90% pass success rate. Our course covers all aspects of the OSCE including APIE and Clinical Skills, with practical sessions. After training, mock exams are conducted with full feedback. We have experienced OSCE trainers, who are also long-time NHS nurses.&lt;/p&gt;\n&lt;p&gt;We are recruiting across a large range of specialities and departments, these include: Acute Medicine, Acute Specialist Medicine, Cancer and Clinical Support Services, Critical Care and Peri-Operative, and Co-ordinated Surgical Services.&lt;/p&gt;\n&lt;p&gt;Our culture and values are what drives Medway NHS Foundation Trust and is the heartbeat of who we are as an organisation. It is important that you understand and to refer to our values when you are completing your application and always reflect our values throughout your employment with the Trust.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether. We are inspiring and ambitious, respectful and supportive, open and we speak up, we are inclusive and responsible.&lt;/p&gt;\n&lt;p&gt;If you think you have what it takes to positively contribute to our exciting future by being part of our amazing team please come along and meet our teams.&lt;/p&gt;\n&lt;p&gt;Please be aware that we will only accept applications from candidates that clearly state that they have passed the IELTS or OET and CBT in the last two years.&lt;/p&gt;\n&lt;p&gt;The local airport is just under an hour away from the Hospital and has flights to 230 destinations in over 70 countries, and their long-haul network has extended to over 60 routes, which makes it easy for you to travel around in your spare time.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Amber ShelleyAdditional contact information&lt;/p&gt;\n&lt;p&gt;Amber Shelley - Resourcing Team Leader&lt;/p&gt;\n&lt;p&gt;ambershelley@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Overseas Pre-Registration Nursing Opportunities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258222", "validThrough": "2020-11-24T23:59:59+0000"}