{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "68891", "minValue": "60058", "unitText": "YEAR", "value": "£60,058 - £68,891 per annum Inc. HCAS"}}, "datePosted": "2020-10-27T17:45:20+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Senior Data Analyst&lt;/strong&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;18 months Fixed termdue to funding&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a passionate and experienced Senior Information Analyst (Extraction SME / Lead) who will take responsibility for overseeing and managing a range of population health data analytics projects, taking a lead role in extracting and analyzing the linked longitudinal dataset in North West London, helping Imperial College Health Partners find valuable and actionable insights.&lt;/p&gt;\n&lt;p&gt;Imperial College Health Partners (ICHP) is seeking candidates with a passion for population health and data analytics to join our growing Information Directorate.&lt;/p&gt;\n&lt;p&gt;ICHP is a partnership organisation bringing together NHS providers of healthcare services, clinical commissioning groups and leading universities across North West London. We have been designated by NHS England as the Academic Health Science Network (AHSN) for North West London, and we are one of 15 AHSNs across England which make up The AHSN Network.&lt;/p&gt;\n&lt;p&gt;At ICHP we believe that innovation can be a powerful trigger to create new ways of working. &lt;br /&gt;Through working with world leading hospitals, community providers, commissioners and universities, we match health challenges with new innovations. This helps our partners provide the best possible health and care outcomes for North West London’s 2.3 million residents.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our strategic priorities are to:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Innovate and collaborate for a healthier population making a real measurable impact; and&lt;/li&gt;\n&lt;li&gt;Diversify our customer base in order to broaden our income sources and work where we can have the largest impact.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our organisation has a range of talents and experiences, bringing knowledge, skills and experience to the way we connect with our stakeholders.&lt;/p&gt;\n&lt;p&gt;At a time where collaboration and innovation are crucial to help meet some of healthcare’s most pressing challenges, there has never been a better time to join us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Senior Information Analyst (Extraction SME / Lead) will take responsibility for overseeing and managing a range of population health data analytics projects, taking a lead role in extracting and analyzing the linked longitudinal dataset in North West London. This Whole Systems Integrated Care (WSIC) dataset includes Secondary Users Services (SUS), Service Level Agreement Monitoring (SLAM), Primary Care, Mental Health, Community and High Cost Drugs for North West London.&lt;/p&gt;\n&lt;p&gt;The role focuses on the data extraction and complex quantitative analysis required to help a stakeholder’s characterise the issues they face, the options they have, or to evaluate the impact of changes made. This requires the postholder to understand why analysis is being undertaken, how the outputs are intended to be used, as well as helping to define how we should undertake the particular method of analysis.&lt;/p&gt;\n&lt;p&gt;The job holder will be involved in managing other colleagues, business development, including the development of the team strategy and required to contribute to components of other projects as needed, depending on skills required, priorities and capacity.&lt;/p&gt;\n&lt;p&gt;The role also interfaces with others who play key roles in helping to design projects and products for stakeholders and clients – including those with expertise in innovation &amp; design, safety &amp; quality improvement, transformation support, data infrastructure development, and data analysis (including extraction, processing, and visualisation).&lt;/p&gt;\n&lt;p&gt;The successful candidate will actively participate in the development and culture of ICHP as an organisation, sharing responsibility for making ICHP a great place to work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key responsibilities include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supporting client-facing responsibilities, leading on data modelling and analysis for several concurrent projects.&lt;/li&gt;\n&lt;li&gt;Supporting the writing of proposals to meet client project briefs, including resource requirements, cost estimates and timescales and the development of new business opportunities and services.&lt;/li&gt;\n&lt;li&gt;Collecting, interpreting, and writing a wide range of technical specifications to support clinical and operational research and contracts for services.&lt;/li&gt;\n&lt;li&gt;Leading on the data quality, information governance, data processing and information assurance for the portfolio of projects within ICHP&lt;/li&gt;\n&lt;li&gt;Using visualization applications such as Tableau and Excel to present information and share findings in a creative and appealing manner&lt;/li&gt;\n&lt;li&gt;Managing the overall workload and capacity across a team of senior data extractors and analysts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Interview will be held in the week commencing 23 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Amanda Lucas, Associate Director of Partnerships &amp; Data Infrastructure&lt;/p&gt;\n&lt;p&gt;Amanda.Lucas@imperialcollegehealthpartners.com&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Imperial College Health Partners, London", "postalCode": "NW1 2FB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5265", "longitude": "-.13467"}}, "title": "Senior Data Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245598", "validThrough": "2020-11-10T23:59:59+0000"}