{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-11-04T10:31:33+0000", "description": "&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post would suit an Occupational Therapist/Mental Health Practitioner looking to expand their skills and experience. We are offering a 6 months temporary post/secondment with opportunity to extend beyond the initial 6 months.&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support vulnerable, older people with complex physical and mental health care needs, including dementia. The successful candidate will work with the older people’s services team, which was rated ‘Outstanding’ in our latest CQC report, taking responsibility for the assessment and implementation of intensive care and treatment in the home, ensuring the correct application of Mental Health Clinical Risk policies and procedures.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. We will provide you with an excellent working environment that has just been recognised with a ‘Good’ rating overall, and as an ‘Outstanding’, well-led, organisation in our latest CQC inspection, which found that: ‘Staff were proud of the organisation as a place to work and spoke highly of the culture.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth with opportunities to attend interest groups and forums within the locality, helping you to build your Continuing Professional Development portfolio, extending your skills and ensuring that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An enthusiastic and experienced, registered Occupational Therapist/Mental Health Practitioner, you will have specialist knowledge of the care of older people with mental health conditions. You will have excellent communication and people skills, a warm personality and the resilience to help us transform our patients’ lives. With a good understanding of Mental Health Clinical Risk policies and procedures, you will work in our Home Treatment team and be experienced in providing intensive mental health care treatment and be knowledgeable about mental health crises. Your energy and drive will be rewarded with the support of a dedicated team that strives to create a progressive, friendly and compassionate environment.&lt;/p&gt;\n&lt;p&gt;Caring for patients in the community, you will work across multiple sites in the West Berkshire area and must have access to your own car.&lt;/p&gt;\n&lt;p&gt;Due to the current covid pandemic, the Trust is utilizing mobile working and working from home in the main and all face to face visits are risk assessed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call Sara Johnson on 01635 292070 or email: sara.johnson@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to our salary car scheme, support with childcare and as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "OPMH Services Newbury, Thatcham", "postalCode": "RG18 3HR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4074", "longitude": "-1.29255"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255383", "validThrough": "2020-11-18T23:59:59+0000"}