{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-28T14:01:13+0000", "description": "&lt;p&gt;We have an exciting opportunity for a motivated Mental Health Nurse to join our adult inpatient wards as a modern matron - leading on the provision of high quality mental health nursing care, excellent patient experience and developing outstanding nursing practice.&lt;/p&gt;\n&lt;p&gt;This role provides clinical leadership for nurses and other health professionals providing care in an inpatient setting. You will be available to ward staff, patients and carers and be responsive to their experiences of care and concerns about the ward environment.&lt;/p&gt;\n&lt;p&gt;The matron holds a key role as a member of the leadership team for the unit/units they are responsible for, alongside psychiatry and allied health professionals.&lt;/p&gt;\n&lt;p&gt;The matron will demonstrate a level of healthy curiosity about care delivery and become actively engaged in care planning and risk management as required. In addition to this they will contribute to the governance of care and lead on the improvement and development of nursing care with a strong focus on quality improvement, including ensuring that Care Quality Commission (CQC) essential standards are met and exceeded.&lt;/p&gt;\n&lt;p&gt;Our inpatient services provide high quality care and are currently assessed as ‘Good’ by the CQC and are. We want to work with highly skilled, highly motivated matrons that will support and inspire teams within our inpatient services to meet CQC standards of ‘Excellent’.&lt;/p&gt;\n&lt;p&gt;It is essential that any applicant demonstrates their ability to work collaboratively and with compassion for service users, carers and staff.&lt;/p&gt;\n&lt;p&gt;The matron will take a lead role on developing aspects of the service across inpatient services working closely with matron colleagues within the directorate in addition to working across the wider Trust as necessary, providing an opportunity for networking and shared learning across the organisation.&lt;/p&gt;\n&lt;p&gt;In addition to recruiting into this post we are working with inpatient leadership staff to establish quality focussed goals and targets, developing actions to support us in achieving and maintaining excellence within CQC ratings. The role will be developed in line with the matron handbook published by NHS Improvement February 2020. In light of the impact that COVID-19 has had on healthcare services this role will also include leading on infection control across services.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have the opportunity to develop Quality improvement skills, work with innovative digital health technology and research.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNoki NdimandeJob titleSenior MatronEmail addressNokuthula.Ndimande@oxfordhealth.nhs.ukTelephone number01865 901000Additional contact information&lt;/p&gt;\n&lt;p&gt;Or, Natalie Cleveland - Head of Nursing, Natalie.cleveland@oxfordhealth.nhs.uk, 01865 901000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Littlemore/Warneford, Oxford", "postalCode": "OX3 7JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7508", "longitude": "-1.2223"}}, "title": "Modern Matron - Mental Health Inpatient", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246877", "validThrough": "2020-11-11T23:59:59+0000"}