{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "8114", "minValue": "8114", "unitText": "YEAR", "value": "£8,114.75 National apprentice wage"}}, "datePosted": "2020-11-03T09:46:11+0000", "description": "&lt;p&gt;&lt;strong&gt;Apprentice Advert&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want a fantastic opportunity to learn new skills and kick start your career in NHS Administration? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NHS employs more than 1.5 million people, putting it in the top five of the world’s largest workforces. The NHS is a very unique place to work, and if successful, you will become part of a talented, passionate team of people, committed to providing the best care and treatment to patients.&lt;/p&gt;\n&lt;p&gt;Whether you’ve just completed your GSCEs or are looking for a change in your career, our Business Administration apprenticeship offers you the chance to earn a salary, gain valuable work experience and new skills, whilst being supported to achieve a professional qualification.&lt;br /&gt;&lt;br /&gt;This is an opportunity not only to build your skills and confidence, but open up a wealth of possibilities for your future career within the NHS and its unique workforce.&lt;/p&gt;\n&lt;p&gt;The Dudley Group NHS Foundation Trust is looking for individuals who are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Pro-active&lt;/li&gt;\n&lt;li&gt;Enthusiastic&lt;/li&gt;\n&lt;li&gt;Self-motivated&lt;/li&gt;\n&lt;li&gt;Caring and Respectful&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;They will also be keen to learn and develop new skills and willing to be flexible to meet the changing demands of the service. Please refer to the attached Job Description and Person Specification for more details.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a Medical Administration Apprentice at The Dudley Group NHS Foundation Trust to work across the Diabetes, Endocrinology and Renal departments.&lt;/p&gt;\n&lt;p&gt;Specific duties include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Audio typing of clinical correspondence for consultants and the clinical team&lt;/li&gt;\n&lt;li&gt;Booking patient appointments as required&lt;/li&gt;\n&lt;li&gt;Assisting with clinic management with any changes/cancellations&lt;/li&gt;\n&lt;li&gt;Dealing with telephone enquiries ensuring all messages are passed to staff in a timely manner&lt;/li&gt;\n&lt;li&gt;Maintaining up to date filing systems both manual and computerised&lt;/li&gt;\n&lt;li&gt;Dealing with all incoming/outgoing post&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The applicant must be well organised and able to work to deadlines and targets. Working in a busy office, the successful applicant will be able to demonstrate good communication skills in order to work towards communicating with colleagues at all levels and to function efficiently using own initiative as needed. Candidates will be expected to work flexibly, safely and be friendly as working as part of a team is a central focus.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apprenticeship Programme details:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Apprenticeship standard - Business Administration, Level 3;&lt;/li&gt;\n&lt;li&gt;The AMSPAR Level 3 Certificate in Medical Terminology&lt;/li&gt;\n&lt;li&gt;Training provider will be Dudley College;&lt;/li&gt;\n&lt;li&gt;The programme will be on a fixed term contract for 18 months;&lt;/li&gt;\n&lt;li&gt;Salary will be paid at National Apprentice wage, £4.15 per hour with a yearly salary of £8114.75 for the first 12 months. For the final 6 months, this will change to minimum wage for age.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Eligibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Candidates must have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Maths and English - GCSE grade C or above, grade 4 to 9, or equivalent in Functional Skills at level 2.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please Note:&lt;/strong&gt; you will need to provide original certificates as proof of these qualifications.&lt;/p&gt;\n&lt;p&gt;Candidates who hold the following qualifications are &lt;strong&gt;not&lt;/strong&gt; eligible:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A degree / degree level qualification or higher in Business Administration or similar related subject&lt;/li&gt;\n&lt;li&gt;NVQ/QCF / Apprenticeship Standard Level 3 or higher in Business Administration&lt;/li&gt;\n&lt;li&gt;The AMSPAR level 3 Certificate in Medical Terminology&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Candidates who have previously started or part completed a Business Administration Level 3 Apprenticeship or the AMSPAR certificate, must declare this on their application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Richard Wilkes - Assistant Directorate Manager&lt;/p&gt;\n&lt;p&gt;Email address: r.wilkes@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01384 456111 ext. 2589&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Medical Administration Apprentice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253309", "validThrough": "2020-11-15T23:59:59+0000"}