{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-02T14:45:22+0000", "description": "&lt;p&gt;We have an exciting opportunity available for a highly motivated, responsible and caring individual to join The Walton Centre therapy service on a full-time permanent basis.&lt;/p&gt;\n&lt;p&gt;As an occupational therapy (OT) assistant you will work alongside qualified occupational therapy staff as part of the multidisciplinary team within the acute inpatient service at The Walton Centre. The role requires a high level of commitment, responsibility and team work. Working as part of the MDT you will assist qualified OT staff in delivering complex and challenging treatment sessions for patients who have undergone life changing brain and/or spinal injuries and illnesses, resulting in physical and cognitive impairments.&lt;/p&gt;\n&lt;p&gt;Following a work-based framework for development, and under the direction of a senior OT, you will carry a delegated caseload to provide occupational therapy intervention.&lt;/p&gt;\n&lt;p&gt;Joining our team of OT assistants, you will contribute to the smooth running of the therapy department which includes caring for equipment, wheelchairs, ordering of stock plus housekeeping and administration duties.&lt;/p&gt;\n&lt;p&gt;The OT service currently runs Monday to Friday 8am to 4pm however applicants will need to work flexibly to meet future changing service demands.&lt;/p&gt;\n&lt;p&gt;The selected candidate will be able to demonstrate a good understanding of occupational therapy and the role of the OT assistant within the acute hospital setting. You will have excellent communication and interpersonal skills, be well organised and able to respond well under pressure.&lt;/p&gt;\n&lt;p&gt;Applicants must be able to demonstrate relevant clinical experience of working within a health care setting and have evidence of personal development equivalent to NVQ level 2 or 3 in health care or social care. The supporting information of the application must demonstrate an understanding of occupational therapy and the role of the occupational therapy assistant to be considered for short-listing.&lt;/p&gt;\n&lt;p&gt;OT assistants have access to structured training, supervision and appraisal.&lt;/p&gt;\n&lt;p&gt;You are welcome to contact the department to discuss the post or your application. Short-listed applicants are encouraged to telephone the department prior to interview as a preparatory visit may be possible and is encouraged (infection control restrictions allowing). Due to the high volume of applications we receive for assistant posts, visits may only be offered to short-listed applicants, unless under exceptional circumstances.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120725.JPG", "name": "Walton Centre NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120725"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L9 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4665", "longitude": "-2.93093"}}, "title": "Occupational Therapy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252471", "validThrough": "2020-11-30T23:59:59+0000"}