{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33000", "minValue": "30000", "unitText": "YEAR", "value": "£30,000 - £33,000"}}, "datePosted": "2020-10-30T10:13:37+0000", "description": "&lt;p&gt;As a Qualified Nurse - you will ensure adults with mental health conditions receive high-quality care, while also supporting your colleagues and promote good teamwork.&lt;/p&gt;\n&lt;p&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine.&lt;/p&gt;\n&lt;p&gt;You will have access to the Elysium Wellbeing team, which is on hand to keep you feeling great; be it a chat, massage or group activities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who doesn&#39;t like a free massage at work?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There are also career development opportunities, with a huge range of courses that will help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Things that you will have:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be used to delivering high-quality person-centred care, with the ability to work on your own initiative and as part of a team.&lt;/p&gt;\n&lt;p&gt;With flexibility and self-motivation, you will have excellent communication skills and an understanding of the importance of the therapeutic social environment, while enjoying the satisfaction that comes with seeing people in your care improve.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A relevant nursing qualification and registration&lt;/li&gt;\n&lt;li&gt;Strong team-working skills&lt;/li&gt;\n&lt;li&gt;A high level of self-motivation and a flexible approach&lt;/li&gt;\n&lt;li&gt;A positive attitude and be naturally caring and compassionate&lt;/li&gt;\n&lt;li&gt;A commitment to high-quality care and to values and evidence-based practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The service operates 24/7. You will work shift patterns including weekends, bank holidays and nights. Standard shifts are 12 hours a day, working 3 days one week, 4 days the next.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: Lower Henley Road, Caversham, Reading, Berkshire, RG4 5LE&lt;/p&gt;\n&lt;p&gt;You will be working at Rosebank House, a 24 hour specialist care and support service for people with severe and enduring mental health needs. People who come to Rosebank House have normally come from a hospital environment or have been sectioned under the Mental Health Act (1983).&lt;/p&gt;\n&lt;p&gt;You will be working at the modern, purpose-built home with 13 en-suite bedrooms, it is specifically designed with facilities to fully prepare patients for independence in the community. The focus of the service is on independent living skills as well as social inclusion, education and employment engagement. There are close links with the local community for residents to access local college, work placements and amenities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £30,000 - £33,000&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave - plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; You will be working for an established, stable and agile company with a unique approach to the delivery of care. Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium. With flexibility and self-motivation, you will have excellent communication skills and an understanding of the importance of the therapeutic social environment, while enjoying the satisfaction that comes with seeing people in your care improve.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Caversham", "postalCode": "RG4 5LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4692", "longitude": "-.956103"}}, "title": "Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249651", "validThrough": "2020-12-31T23:59:59+0000"}