{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-04T14:42:05+0000", "description": "&lt;p&gt;&lt;em&gt;&lt;strong&gt;Previous applicants for Incident Control Centre Administrator need not apply.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Dorset CCG is recruiting a full-time (37.5hrs) Incident Control Centre Administrator on a 1 year fixed term contract. This is an exciting opportunity for the successful candidate to have an opportunity to work in a fast-paced environment dealing with administrative tasks relating to all aspects of the Incident Control Centre, such as the Covid-19 response, Emergency Preparedness, Resilience &amp; Response, and the EU Exit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to the nature of the role, there will be a requirement to work flexibly to meet the needs of the Incident Control Centre, which will include evening and weekend support on a rota-basis.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role involves:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;- undertaking general office duties, as required, e.g. typing, data processing, scanning/copying, in line with Trust Policies and Procedures; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;- taking overall responsibility for the provision of comprehensive, efficient and high-quality administration services to enable the ICC team to deliver an effective timely response to requests;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;- managing high-level co-ordination and communication between staff at all levels of the CCG in order to produce papers and reports for meetings and key stakeholders;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;- developing and maintaining effective working relationships at all levels, internal and external to the CCG, including NHS and non-NHS organisations across the Dorset health community, locally and regionally;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;- maintaining timely and accurate outputs for all work.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will need:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;- extensive administrative experience working within set procedures and of using their own initiative;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;- experience of working in a fast-paced environment and being able to prioritise effectively;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;- excellent communication skills in order to effectively communicate with colleagues at all levels;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;- the ability to be able to cope under pressure.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please see the Job Description and Person Specification for further information, or make contact with us to discuss this role further.&lt;/p&gt;\n&lt;p&gt;The Incident Control Centre team is part of the wider Urgent &amp; Emergency Care Team. The position will require the sucessful candidate to work from home, and all IT equipment will be supplied to enable you to do this effectively.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128199.png", "name": "Dorset Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128199"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Vespasian House, Dorchester", "postalCode": "DT1 1TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7146", "longitude": "-2.44439"}}, "title": "Incident Control Centre Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256262", "validThrough": "2020-11-18T23:59:59+0000"}