{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum"}}, "datePosted": "2020-11-03T16:16:54+0000", "description": "&lt;p&gt;BAND 6 ADVERT Day Surgery Unit&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you an enthusiastic and inspirational nurse looking for a new challenge?&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has become available for a motivated and experienced nurse within the Day Surgery Unit at the Queen Elizabeth Hospital in Woolwich.&lt;/p&gt;\n&lt;p&gt;The ward is looking for a Band 6 Senior Staff Nurse who believes that high quality patient experience is central to the care they deliver and who possesses a passion to embrace new and innovative ways of managing change&lt;/p&gt;\n&lt;p&gt;The Day Surgery Unit is a busy surgical service admitting, treating and supporting a variety of patients who have had surgery.&lt;/p&gt;\n&lt;p&gt;You will work closely with the Consultants, nursing and theatre teams and be committed to the development and delivery of high standards of nursing practice. We have a strong focus on multidisciplinary team working, which helps to ensure a complete approach to patient centered care. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to lead the ongoing development of the nursing team, supporting and teaching both qualified and unqualified staff, contributing to the enhancement of evidence based nursing and the delivery of safe kind and effective care through a truly collaborative multi-disciplinary approach to patient care.&lt;/p&gt;\n&lt;p&gt;You will have strong clinical skills, a wide knowledge base especially within surgical specialties and be prepared to take a leading role in developing staff and service provision.&lt;/p&gt;\n&lt;p&gt;Leading by example you will possess the confidence to make decisions, solve problems and initiate change.&lt;/p&gt;\n&lt;p&gt;You should demonstrate evidence of ongoing clinical and professional development.&lt;/p&gt;\n&lt;p&gt;Applicants must have at least 2 years significant post registration experience at Band 5.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to work internal rotation with days and nights. There will be a requirement to work some weekend shifts.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTania SilvesterJob titleSenior SisterEmail addresstania.silvester@nhs.netTelephone number020 8836 4134&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "QEH, London", "postalCode": "SE18 4QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4791", "longitude": ".051174"}}, "title": "Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254768", "validThrough": "2020-11-13T23:59:59+0000"}