{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-30T12:16:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Ward Tracker - 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Integrated Transfer Team are looking for highly motivated and enthusiastic staff to join our new team. This is a really exciting time to join our team to become part of our integrated service as we have many new and exciting initiatives to challenge and develop our staff .&lt;/p&gt;\n&lt;p&gt;The candidate should demonstrate strong communication/negotiating skills and be able to work closely with members of the MDT and other stake holders to facilitate timely and safe discharges to aid patient flow within the hospital.&lt;/p&gt;\n&lt;p&gt;you will support the ward staff and discharge coordinators to facilitate a safe timely discharge for our patients&lt;/p&gt;\n&lt;p&gt;The key aims are as follows :&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Delivering a consistent, co-ordinated approach to assist patients to identify potential needs at the point of discharge to avoid unnecessary delays in transfer of care&lt;/li&gt;\n&lt;li&gt;Working collaboratively with external and internal partners for the benefit of the patients to ensure smooth transition from hospital and reduce risk of readmission&lt;/li&gt;\n&lt;li&gt;Transparently providing information and expert advice to patients, carers and other professionals&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for someone who is driven to provide the best possible care for patients in the later stages of their stay in hospital and act in a professional manner at all times in line with Trust values.&lt;/p&gt;\n&lt;p&gt;The Integrated Team operates 08:00-20:00 seven days a week&lt;/p&gt;\n&lt;p&gt;e Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require a Standard DBS check at a cost of £26.50. This cost will be deducted from your first Trust salary&lt;/p&gt;\n&lt;p&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRuth McNallyAdditional contact information&lt;/p&gt;\n&lt;p&gt;Ruth McNally – Lead Nurse Integrated Transfer Team&lt;/p&gt;\n&lt;p&gt;0161 419 5997&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Ward Tracker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250111", "validThrough": "2020-11-06T23:59:59+0000"}