{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 per annum"}}, "datePosted": "2020-11-05T14:01:13+0000", "description": "&lt;p&gt;In October 2019, the government announced its Health Infrastructure Plan, a long-term, rolling five-year programme of investment in health infrastructure, including capital to build new hospitals, modernise primary care estate, invest in new diagnostics and technology, and help eradicate critical safety issues in the NHS estate. Hampshire Hospitals NHS Foundation Trust (HHFT) is part of phase 2 of this plan and the Hampshire Together: Modernising our Hospitals and Health Services (MOHHS) programme has been given the green light to go to the next stage of developing its plans (with the aim of being ready to deliver between 2025-2030).&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be part of the reconfiguration of health services with system partners and developing a new state of the art hospital and health service provision for the population of North and Mid Hampshire. The programme is at the stage of imminently delivering the Pre-Consultation Business Case and Strategic Outline Case.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced Head of PMO to lead the ongoing evolution of the Programme Management Office to meet the needs of the different stages of the MoHHS programme development, ensuring best practice governance and oversight of the programme at all times and provide quality assurance reporting to ensure the programme is delivered to agreed metrics.&lt;/p&gt;\n&lt;p&gt;Primarily based in Basingstoke you will be required to liaise with, support and advise the Programme Director, Technical Lead, Programme Manager, Programme Workstream Leads and developer/contractors on all matters relating to the programme structure and governance.&lt;/p&gt;\n&lt;p&gt;You will be an excellent communicator creating and maintaining collaborative working relationships both internally within HHFT’s corporate, clinical and operational functions and with system wide partners, to support successful delivery of the programme.&lt;/p&gt;\n&lt;p&gt;So if you are looking to join a dynamic team to help deliver the long held vision of the Trust to provide a new hospital to support the population of North &amp; Mid Hampshire, this is the role for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Natasha Kerrigan - Programme Director&lt;/p&gt;\n&lt;p&gt;natasha.kerrigan@hhft.nhs.uk / 07584 155180&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke Hospital, Basingstoke", "postalCode": "RG249NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2806", "longitude": "-1.10986"}}, "title": "Head of Programme Management Office", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258019", "validThrough": "2020-12-03T23:59:59+0000"}