{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "37267", "unitText": "YEAR", "value": "Up to £37,267 per annum DOE"}}, "datePosted": "2020-11-03T16:15:14+0000", "description": "&lt;h1&gt;&lt;strong&gt;Make a difference!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt; &lt;br /&gt; Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;Two Placements, One Job...&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;HMP Portland and HMP The Verne... You Decide...&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; Practice Plus Group are looking to appoint a skilled and motived, substantive, full time Mental Health nurse for the prisons on the Isle of Portland, Dorset. There are two prisons on the Isle of Portland, HMP Portland and HMP The Verne. The successful candidate will work as part of both prison healthcare teams for six months and then decide the location they want to make their permanent work base once the 12 month programme has been completed.&lt;br /&gt; &lt;br /&gt; HMPs The Verne and Portland are both Category ‘C’ prisons on the Isle of Portland, on the Jurassic coast. A full range of primary care and mental health services are provided by Practice Plus Group in both prisons which provides this unique opportunity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;More about the role...&lt;/h1&gt;\n&lt;p&gt;The two prisons offer very different experiences for an enthusiastic and motivated Mental Health Nurse. HMP The Verne is a 580 place prison for people on longer sentences who have been convicted of sexual offences. The population reflects the offender group with an older age of patient compared with other prisons. Patients are more likely to have longer term healthcare needs and many have experienced childhood trauma. At HMP/YOI Portland the population of 505 males reflects a younger population whose index offences are extremely varied and often complex and acute.&lt;br /&gt; &lt;br /&gt; In each of the prisons you will become part of a small, dedicated team of healthcare practitioners with expertise in their own populations, a chance to make a difference to individual patients with a high level of autonomy in a multi-disciplinary team context.&lt;br /&gt; &lt;br /&gt; You will gain skills and knowledge that are transferable to other service settings. You will be a key contributor to the design and function of future services. You will belong to an important service working with a challenging and vulnerable patient group, able to make full use of the skills and knowledge you have developed over your career.&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;What we can offer you…&lt;/strong&gt;&lt;/h1&gt;\n&lt;ul&gt;\n&lt;li&gt;Clinical development opportunities in specialist roles of your interest , such as CBT, ANP, BBV, sexual health, ILS/ALS (intermediate life support and advanced life support), health promotion, RCGP and long term condition courses.&lt;/li&gt;\n&lt;li&gt;A salary of up to £30,600 per annum FTE - dependent on experience.&lt;/li&gt;\n&lt;li&gt;Free DBS check, free uniform, free mandatory training, indemnity cover, CPD and re-validation support.&lt;/li&gt;\n&lt;li&gt;25 days annual leave plus 8 public bank holidays (pro-rata for part-time), plus other benefits including cycle to work scheme and clinical development opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;What we need from you...&lt;/h1&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;If you are the successful candidate, you will:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be part of a committed and dedicated healthcare team&lt;/li&gt;\n&lt;li&gt;Engage in varied and challenging work&lt;/li&gt;\n&lt;li&gt;Work with supportive colleagues&lt;/li&gt;\n&lt;li&gt;Preceptorship for newly qualified nurses&lt;/li&gt;\n&lt;li&gt;Receive a full and detailed induction programme in each prison&lt;/li&gt;\n&lt;li&gt;Have links to local universities&lt;/li&gt;\n&lt;li&gt;Work in a spectacular location&lt;/li&gt;\n&lt;li&gt;Have family friendly hours&lt;/li&gt;\n&lt;li&gt;choose which location you want to be based in after the 12 months programme is completed&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;Next Steps..&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role.&lt;br /&gt; The recruiter will submit your CV to the hiring manager and in turn will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;More Information...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to references, an enhanced DBS check and prison vetting.&lt;/strong&gt;&lt;/em&gt;&lt;br /&gt;&lt;br /&gt; &lt;em&gt;&lt;strong&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portland", "postalCode": "DT5 1DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5499", "longitude": "-2.42177"}}, "title": "Mental Health Nurse - HMP YOI Portland/ HMP The Verne", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254732", "validThrough": "2020-11-17T23:59:59+0000"}