{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "TBC"}}, "datePosted": "2020-09-30T12:58:06+0100", "description": "\n\n\n\n&lt;p&gt;Due to the retirement at the end of January 2021 of our salaried GP we are looking for an enthusiastic Partner or Salaried GP to join our friendly and well organised practice.  Underwood Health Centre sits between Newport and Monmouthshire and only 2 miles (6 minutes) from the M4 junction at Magor and 3 miles (8 minutes) from the M4 junction at the Coldra Roundabout so we have the benefit of being semi rural but very near to good motorway links. As we are just along the M4 corridor we are very accessible from both Bristol and Cardiff.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; We welcome applicants from newly qualified as well as experienced GPs who have an interest in actively contributing to decision making and developing our services. Our list size is circa 4,800 and is growing rapidly. We operate from a modern purpose built premises which was extended and refurbished only a few years ago.  &lt;/p&gt;\n&lt;p&gt; The practice are very forward thinking and undertake services such as coil fitting and extended minor surgery not only for our own patients but also for other practices in our cluster.  Last year we reached the final of the South Wales Argus Practice of the Year Awards for Gwent. We were the top achiever for flu activity every year since 2017 in our cluster of 7 practices and the second highest in Newport.  We are a very high QAIF performer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Current partners have interests outside of the practice and one partner works part time in the hospital as a Neurologist.  Other activities are encouraged and supported to enable flexible working and work life balance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; We have an excellent nursing team who undertake our chronic disease management and they are highly qualified with specialism in Minor Illness, Asthma, COPD, Diabetes and Sexual Health. The practice nurse fits coils and implants.  We have a Practice Pharmacist several sessions per week.  Our Practice Manager is also highly qualified and has many years experience and undertakes all business and financial management.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; Salaried GPs will receive a competitive rate of pay dependent on experience plus reimbursement of indemnity fees and GP Partners receive equitable shares.&lt;/p&gt;\n\n\n\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132694.png", "name": "GP Practices - Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport", "postalCode": "NP18 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5975", "longitude": "-2.88839"}}, "title": "General Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916206525", "validThrough": "2020-12-31T23:59:59+0000"}