{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pr"}}, "datePosted": "2020-11-06T13:31:16+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for experienced nurses to join our friendly forward thinking unit. Our nurses work closely alongside our multidisciplinary team and we encourage autonomous practice within the role. &lt;br /&gt;&lt;br /&gt;The children’s unit includes a busy assessment unit, 2 in patient wards, a 4 bed HDU and a surgical/medical day unit. We offer a rotation throughout the unit that can also include NICU and ED for those nurses that want to gain experience in these areas. This enables development in a variety of skills including assessment and triage skills as well as the early detection/treatment of the deteriorating child including care of those requiring the high dependency unit. We offer a comprehensive education &lt;/strong&gt;&lt;strong&gt;programme&lt;/strong&gt;&lt;strong&gt; which includes a regional child health preceptorship &lt;/strong&gt;&lt;strong&gt;programme &lt;/strong&gt;&lt;strong&gt;for newly qualified nurses, a clinical skills passport with regional study days and support for all nurses through EPALS and mentorship course. There is also opportunity to undertake the Critical Care Level 2 Passport competency framework. We have a Practice Educator who supports student and staff learning who will be able to assist in accessing other educational opportunities available to you. Shifts are 12 hours rotation days/nights/weekends.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Future plans include a move to our new children’s unit at the Bournemouth site alongside a new major Children&#39;s Emergency Department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What our staff say about us-&lt;br /&gt;&lt;br /&gt;Jess- “As a newly qualified nurse the unit has offered me a supportive environment to enable me to start my journey as a staff nurse. After training in London Hospitals it was daunting to start working at a new hospital, however the nursing and multidisciplinary team have made me feel welcome and confident. Although Poole is a DGH it is very busy with great opportunity to learn. I would recommend this unit to any nurse looking to start their first job in a busy friendly unit”.&lt;br /&gt;&lt;br /&gt;Chloe –“I trained out of area but upon starting at the children&#39;s unit at Poole straight away the team were all welcoming, kind and helpful. It was also clear that the unit is not just a general ward; there are four different types of wards including the assessment unit, the high dependency unit, and two separate inpatient wards. You care for patients with a range of conditions including oncology, diabetes, surgical and complex needs. Therefore each shift you continue to broaden your knowledge of different conditions and equipment. You are also then given many opportunities to attend different study days and courses to aid you on the wards. Furthermore I am glad I chose to work at Poole due to the variety of patients which you care for each shift alongside a hardworking, friendly team”.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: 19/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date week commencing: 07/12/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alison Green (Sister) - alison.green@uhd.nhs.uk / 0300 019 20209&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "University Hospitals Dorset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole Hospital, Poole, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Staff Nurse - Child Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259928", "validThrough": "2020-11-19T23:59:59+0000"}