{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "52036", "minValue": "38693", "unitText": "YEAR", "value": "£38,693 - £52,036 per annum pro rata"}}, "datePosted": "2020-10-30T10:46:35+0000", "description": "&lt;p&gt;&lt;span&gt;Contract – Fixed term for 3 years - Secondment. Part time – Existing terms &amp; conditions, subject to approval (payment for Clinical Excellence Awards will remain with current employer). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;The role is fixed 3 year secondment to cover the scope of the programme and due to funding restrictions.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Team&lt;/em&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;span&gt;NHSX is leading the largest digital health and social care transformation programme in the world. With investment of more than £1 billion pounds a year nationally and a significant additional spend locally, NHSX has been created to give staff and citizens the technology they need.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;NHSX brings together the Department of Health and Social Care, NHS England and NHS Improvement who will deliver the Health Secretary’s Tech Vision, building on the NHS Long Term Plan. We will speed up the digital transformation of the NHS and social care. We have set ourselves five missions, which are focused on how we can make things better for patients and staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These are:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Reducing the burden on clinicians and staff, so they can focus on patients&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Giving people the tools to access information and services directly&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Ensuring clinical information can be safely accessed, wherever it is needed&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Improving patient safety across the NHS&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Improving NHS productivity with digital technology&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Role Description&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The work programmes within NHSX are in the process of being formed. Over the coming months, each work programme will establish a strategy and conduct business planning for work in 2020/21 and beyond. The purpose of this role is to provide clinical input and oversight to this process and support the development of an emerging work programme. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be an experienced clinician with professional credibility and have a strong track record in understanding strategic and operational delivery across the NHS and social care with knowledge, skills and experience in the sharing of information and digital transformation through business change.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;They will also have experience of effective clinical engagement with major projects / initiatives that have delivered substantial service improvements.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In this role, the person should expect to:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Help to shape and establish the strategy of an emerging national work programme&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Provide clinical leadership across a number of projects&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Contribute to national policy development and implementation&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Ensure the directorate and project team are compliant with all corporate requirements e.g. business planning, corporate performance reporting, risk management, health and safety, information governance and compliance with organisational policies.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;Through their clinical experience, they will bring:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;An in-depth understanding of clinical systems, the experience of clinicians and service users, especially in relation to the use of digital technology&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Experience of managing patient safety and clinical risk with an understanding of how digital technology systems may influence this&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Insights into the benefits and challenges of leading transformation using digital technology&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Next steps&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;span&gt;For more information on this role please contact x by emailing &lt;/span&gt;&lt;span&gt;jane.town@nhsx.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House, London / Leeds", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Clinical Lead NHSX", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249788", "validThrough": "2020-11-15T23:59:59+0000"}