{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-11-05T14:15:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Deputy Medical Director &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Rotherham NHS Foundation Trust (TRFT) is at the forefront of developing innovative integrated services with our partners across Rotherham and South Yorkshire. As Deputy Medical Director you will have a key role in not just helping to run the hospital and community services, but also shaping the future of how the Trust operates and delivers these pioneering services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As Deputy Medical Director you will be responsible for supporting the Executive Medical Director in leading the clinical approach, strategy and standards across the organisation, prioritising the clinical and care needs of the Trust’s patients and their families. You will help to provide effective professional leadership for all medical staff and contribute to corporate leadership and strategy development across the whole of the organisation, influencing the wider health community and organisational agenda.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be someone who has an outstanding track record of delivery in addition to being a successful and skilled clinician in your chosen specialty. You will be someone who can lead, motivate and engage our staff as they strive to provide exceptional standards of patient care. As someone who is capable of working closely with colleagues and professional leaders, you will promote an organisational culture that facilitates teamwork in the design, management and delivery of clinical services. You will bring proven experience of service innovation and the commitment to patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You may already be an Associate Medical Director or Clinical Director who is ready to take the next step. In either case, you will have an excellent clinical reputation and highly credible medical leadership experience, gained with ambition and aptitude to make a major contribution to the Trust’s future success.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews will be held week commencing 14th December 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information, please contact Dr Callum Gardner, Executive Medical Director (callum.gardner1@nhs.net) on 01709 424500 in the first instance.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Deputy Medical Director", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258053", "validThrough": "2020-11-29T23:59:59+0000"}