{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 pa"}}, "datePosted": "2020-10-27T12:31:47+0000", "description": "&lt;p&gt;We have an exciting opportunity for an experienced senior operational leader to join our team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for the strategic, operational, performance and business management of NHFT’s Ambulatory Services and will work under the direction and line management of the Director of Community Healthcare, with a secondary reporting line to the Deputy Medical Director.&lt;/p&gt;\n&lt;p&gt;You will have an excellent track record for delivering high quality innovative services and you will demonstrate an ability to influence, engage and lead others to maintain delivery of services through an ambitious programme of transformational change.&lt;/p&gt;\n&lt;p&gt;You will have demonstrable experience of managing and leading multiple teams and ensuring that the highest standards of people management, clinical quality and financial performance are delivered across operational services. You will be the Ambulatory Services’ key link to commissioners and partners in the system.&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;health and wellbeing organisation&lt;/strong&gt; here at &lt;strong&gt;team NHFT&lt;/strong&gt; we are dedicated to continually &lt;strong&gt;innovate&lt;/strong&gt; and &lt;strong&gt;strive to make a difference&lt;/strong&gt; to our community and those working for our Trust, we aim to serve the people of Northamptonshire and surrounding areas with &lt;strong&gt;safe, quality care&lt;/strong&gt;. We deliver this from an understanding of our local healthcare needs, economy and the changing demands of our community.&lt;/p&gt;\n&lt;p&gt;Interviews will be held week commencing 07.12.20&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJenn SawyerJob titleManagement Assistant to Director of Community HealthcareEmail addressJennifer.sawyer@nhft.nhs.ukTelephone number07562 430593&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, Kettering", "postalCode": "NN15 7PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3941", "longitude": "-.722184"}}, "title": "Assistant Director Ambulatory Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244510", "validThrough": "2020-11-10T23:59:59+0000"}