{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "28588", "unitText": "YEAR", "value": "£28,588 - £37,890 pro rata depen"}}, "datePosted": "2020-10-20T13:01:22+0100", "description": "&lt;p&gt;We are pleased to invite applications for an Assistant Screening &amp; Immunisation Coordinator to join the screening and immunisation teams across the North West. The Currently we are predominantly working remotely although this may change as service needs develop. The postholder can be contractually based at any of our North West sites in Liverpool, Manchester or Preston. Several posts are available for a twelve-month period from taking up the position in the first instance. Preference for geographical area will be discussed at interview. Secondments are welcome in line with your current employers’ processes and with their agreement prior to application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Purpose / Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Assistant Screening &amp; Immunisation Coordinator role provides an opportunity to develop skills and knowledge in quality assurance, performance improvement, governance and commissioning of NHS screening and immunisation programmes, which:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meet the needs of all eligible people;&lt;/li&gt;\n&lt;li&gt;Are provided to the highest levels of quality, safety and efficiency;&lt;/li&gt;\n&lt;li&gt;Meet minimum standards and strive for excellence;&lt;/li&gt;\n&lt;li&gt;Ensure quality of access and uptake.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role is to support the commissioning of resilient, high quality national programmes. The role will support the Screening &amp; Immunisation Team across the full range of priority activities, as specified in the NHS England Section 7a agreement screening and immunisation programmes, which Include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Screening:\n&lt;ul&gt;\n&lt;li&gt;Cancer programmes, cervical, breast and bowel&lt;/li&gt;\n&lt;li&gt;Non-cancer programmes, Abdominal Aortic Aneurysm, (AAA), Ante-natal new-born (ANNB) Diabetic eye Screening.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;Immunisation programmes:\n&lt;ul&gt;\n&lt;li&gt;Routine baby and young children school age, adult&lt;/li&gt;\n&lt;li&gt;Non-routine for at risk groups as per national guidance.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post-holder will support portfolios of work, which will include: programmes as listed above and bespoke pieces of work or projects.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be employed by PHE and receive their professional leadership through this route.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We invite applications from individuals with a suitable background and an interest in screening, immunisation and wider public health, to express interest in this post.&lt;/p&gt;\n&lt;p&gt;An important requirement of this post is to have excellent team working skills as well as confidence and competence to work independently when required.&lt;/p&gt;\n&lt;p&gt;The post-holder may come from a variety of backgrounds including clinical e.g. nursing/midwifery/health visiting, or non-clinical with relevant experience in a health related field.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see job description for competencies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note there are two job descriptions attached, one clinical and one non-clinical. Refer to the Job description and person specification for competencies.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;For further information / informal discussion about the post, please contact :&lt;/p&gt;\n&lt;p&gt;Kerry Crooks m;07918368423 kerrycrooks@nhs.net&lt;/p&gt;\n&lt;p&gt;Helen Beynon m: &lt;strong&gt;07730 379352 helen.beynon@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Audrey Howarth m:07568431826 audrey.howarth@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester, Liverpool or Preston, Manchester, Liverpool or Preston", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "Assistant Screening and Immunisation Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234493", "validThrough": "2020-11-08T23:59:59+0000"}