{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30500", "minValue": "25000", "unitText": "YEAR", "value": "£25,000 - £30,500"}}, "datePosted": "2020-10-05T14:52:54+0100", "description": "&lt;h2&gt;Would you like:&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;To work for an award-winning specialist healthcare company that is dedicated on improving and delivering services rather than delivering the same for less?&lt;/li&gt;\n&lt;li&gt;Outstanding personal development and CPD opportunities?&lt;/li&gt;\n&lt;li&gt;Flexibility that enables you to balance your work life and personal commitments?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you answered yes to the above Vita Health Group is your perfect next employer!&lt;/p&gt;\n&lt;h2&gt;The Role:&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;The role of the Wellbeing Navigator Lead will be to provide a vital link between our mental health focused IAPT services, and the wider Voluntary, Community and Social Enterprise (VCSE) Sector.&lt;/li&gt;\n&lt;li&gt;You will be responsible for a team of wellbeing navigators who will guide service users into support services to help them to feel more connected to their community and improve their wellbeing.&lt;/li&gt;\n&lt;li&gt;Managing this team, you will need to stay up to date with the latest developments in the VCSE sector with the support of the Partnership Liaison Officers. You will also need to provide line management and supervision to your team who will be working with individuals reporting a variety of mental health needs&lt;/li&gt;\n&lt;li&gt;You will be expected to maintain a small case load yourself, to support your team and keep your working knowledge relevant&lt;/li&gt;\n&lt;li&gt;The ideal candidate will have a strong knowledge and understanding of mental health services in the BNSSG area, as well as previous experience working with the voluntary and community sector. You will be self-motivated but equally able to work in a team setting and have experience of line management.&lt;/li&gt;\n&lt;li&gt;This is a great opportunity for someone who wants to improve mental health services in the Bristol area, and strengthen the links between NSH commissioned services and the voluntary sector.&lt;/li&gt;\n&lt;li&gt;Your role will support the wider VitaMinds team by redirecting appropriate referrals to a non-IAPT pathway, allowing the Psychological Wellbeing Practitioners to focus on those in need of more therapeutic interventions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;The Company:&lt;/h2&gt;\n&lt;p&gt;Vita Health Group is a leading UK healthcare provider with over 30 years’ experience delivering best in class physical and mental health services across corporates, NHS and private patients.&lt;/p&gt;\n&lt;p&gt;We comprise of three leading UK healthcare providers, each with their own great reputation within the healthcare industry; RehabWorks, Workplace Wellness and Crystal Palace Physio Group.&lt;/p&gt;\n&lt;h2&gt;Skills and Experience:&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ability to undertake assessment of needs&lt;/li&gt;\n&lt;li&gt;IT literate – intermediate level minimum&lt;/li&gt;\n&lt;li&gt;Understanding and awareness of Psychological Therapies within IAPT&lt;/li&gt;\n&lt;li&gt;Good knowledge of local services in BNSSG&lt;/li&gt;\n&lt;li&gt;An awareness of and commitment to supporting and facilitating diversity and inclusion&lt;/li&gt;\n&lt;li&gt;Willingness to travel, which may include overnight stays on occasion, as and when required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ability to undertake research and produce reports&lt;/li&gt;\n&lt;li&gt;Public Health and Prevention Agenda&lt;/li&gt;\n&lt;li&gt;Knowledge of the Voluntary Sector in BNSSG&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;Why Vita Health Group?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Our company purpose is “to make people better” which is inclusive of everyone we treat. In order to achieve this, we strongly believe in our company values:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leadership&lt;/li&gt;\n&lt;li&gt;Customer Focussed&lt;/li&gt;\n&lt;li&gt;People Centred&lt;/li&gt;\n&lt;li&gt;Quality&lt;/li&gt;\n&lt;li&gt;Integrity&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our values provide the building blocks for us to achieve the Vita Health Group vision to be the UKs Leading Healthcare Provider of best in class Physical and Mental Health Solutions.&lt;/p&gt;\n&lt;p&gt;We are proud to be an inclusive, equal opportunities employer and value excellence in everything we do. We have a strong focus on supporting and developing our employees and are keen to bring on board candidates that share our vision to be a workplace of choice.&lt;/p&gt;\n&lt;p&gt;We continually look at attracting the very best people from the widest talent pool. As a Disability Confident Committed Employer, we are dedicated to ensuring that all candidates are treated fairly throughout the recruitment process.&lt;/p&gt;\n&lt;p&gt;Should you wish to discuss any adjustment that you might need in the applications process,you can do so by visiting our website and clicking on “contact us” button located at the top right of the page or please dial the number for our head office in Bury St Edmunds and ask to speak to a member of our recruitment team who will be happy to discuss your requirements.&lt;/p&gt;\n&lt;h2&gt;Benefit Package&lt;/h2&gt;\n&lt;p&gt;The role offers a comprehensive benefits package including but not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Enhanced annual leave&lt;/li&gt;\n&lt;li&gt;Enhanced maternity, paternity and adoption leave&lt;/li&gt;\n&lt;li&gt;Ability to work from home when required and where possible (min 5mb download speed required)&lt;/li&gt;\n&lt;li&gt;Benenden health cover including access to an Employee Assistance Program&lt;/li&gt;\n&lt;li&gt;Online benefits portal, including high street discounts and a wellbeing zone&lt;/li&gt;\n&lt;li&gt;Continued Professional Development opportunities and comprehensive training provided&lt;/li&gt;\n&lt;li&gt;Life Assurance insurance&lt;/li&gt;\n&lt;li&gt;Access to internal Equality and Diversity Networks/Groups&lt;/li&gt;\n&lt;li&gt;Length of service awards&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;How to Apply&lt;/h2&gt;\n&lt;p&gt;Please submit a copy of your CV for review via the NHS jobs apply section&lt;/p&gt;\n&lt;p&gt;Any data which you share with us throughout the hiring process will be stored securely within the UK and is accessible only by staff who require it. Should your application be unsuccessful, your data will be securely destroyed after 6 months.&lt;/p&gt;\n&lt;p&gt;Vita Health Group is an equal opportunities and Disability Confident Committed Employer. We positively encourage applications from suitably qualified and eligible candidates regardless of sex, race, disability, age, sexual orientation, gender reassignment, religion or belief, marital status, or pregnancy and maternity.&lt;/p&gt;\n&lt;p&gt;We are committed to supporting wellbeing for all employees and are associated with the MINDFUL EMPLOYER Charter for Employers who are Positive About Mental Health.&lt;/p&gt;\n&lt;p&gt;Please note, all applicants must be legally entitled to accept and perform work in the UK and all positions are subject to a DBS check.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Gloucestershire", "postalCode": "BS37"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5375", "longitude": "-2.40736"}}, "title": "IAPT Wellbeing Navigator Lead (731)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213219", "validThrough": "2020-11-09T23:59:59+0000"}