{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34680", "minValue": "34680", "unitText": "YEAR", "value": "£34,680 Pro Rata"}}, "datePosted": "2020-10-29T19:10:46+0000", "description": "&lt;p&gt;Join our brand new service in Exeter as a Part-Time Social Worker working 18.75 hours per week, and be part of changing lives for the better as you experience what delivering great healthcare should feel like. &lt;/p&gt;\n&lt;p&gt;Pinhoe View is a new purpose-built facility where a range of mental health services are provided for adults with acute mental health conditions across two wards and eight individual flats. The service is due to open in March 2021, you will be working at Wellesley Hospital in Wellington as an interim. &lt;/p&gt;\n&lt;p&gt;As a Social Worker, you will have previous experience from the NHS or private care as you manage a complex caseload. You will be responsible for social care assessments, risk assessments, facilitate group activities and completing pre-admission for discharging service users.&lt;/p&gt;\nYou will participate in the MDT care planning process and lead with safeguarding referrals and the subsequent liaison with the Local Authority safeguarding team and LADO.\n \nA range of training opportunities are available that can see your career grow and you achieve your career aspirations.\n \n&lt;p&gt;&lt;strong&gt;Your responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contribute towards completion of patients CPA documents providing comprehensive assessment reports when required. &lt;/li&gt;\n&lt;li&gt;Maintain contact with families, carers and/or significant others offering support and information. &lt;/li&gt;\n&lt;li&gt;To liaise with Social Services Departments to ensure that reports and attendance by a representative are available for Mental Health Review Tribunals. &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you&#39;ll need:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HCP registered&lt;/li&gt;\n&lt;li&gt;4 years post qualification experience&lt;/li&gt;\n&lt;li&gt;Experience within similar environment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you will get:  &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £34,680 Pro Rata&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX1"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7328", "longitude": "-3.4944"}}, "title": "Part-Time Social Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249277", "validThrough": "2020-11-29T23:59:59+0000"}