{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competative"}}, "datePosted": "2020-10-16T19:50:11+0100", "description": "&lt;p&gt;If you are looking to join an energetic and vibrant organisation that truly makes a difference to people’s lives on a daily basis we would like to hear from you. We are looking for an experienced Recovery Practitioner to join our team. As part of our professional, friendly and compassionate team you will do everything you can to ensure the patient’s treatment is of the highest standard.&lt;br /&gt;Our focus at all times is on ensuring that our patients receive high quality treatment quickly, in clean and comfortable surroundings.&lt;/p&gt;\n&lt;p&gt;If you are a practitioner outside of the local area we would welcome your application and there is a very generous relocation package available to support you.&lt;/p&gt;\n&lt;p&gt;About the role&lt;br /&gt;You will be working as part of a friendly, welcoming and expert multidisciplinary Theatre Team supported by our experienced Theatre Manager, Jessee Lim.&lt;/p&gt;\n&lt;p&gt;You will be a part 1 registered NMC Nurse with experience of being a Recovery practitioner in a theatre, or an HCPC registered Operating Department Practitioner. As well as being up to date with current research and developments in theatre practise you will have a sound knowledge of Health and Safety/Risk management within the operating department. You will be responsible for ensuring the continual cleanliness of the theatre and equipment. &lt;br /&gt;It goes without saying privacy and confidentiality are key throughout the team and you will act as an advocate for the patient in the intra-operative phase and be responsible for “total patient” care in the perioperative phase.&lt;/p&gt;\n&lt;p&gt;Working at Practice Plus Group&lt;br /&gt;When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. If you want to move up the ladder, we’ll support you. If you just want to stay in your role, that’s fine too. We’ll help you be the best you can be.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life. This position has no routine scheduled evenings beyond 17.00 or weekends and there is virtually no on-call commitment.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contact martyn.kingsbury@practiceplusgroup.com in our friendly resourcing team, or call 01189 521 921. Martyn will also be happy to arrange an informal call with Jessee, our Theatre Manager should you wish to speak with her ahead of making a formal application.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidates but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME8 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3808", "longitude": ".57658"}}, "title": "Recovery Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231330", "validThrough": "2020-11-06T23:59:59+0000"}