{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-27T13:36:10+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Senior clinical practitioner –Rehabilitation services – Band 6 nurse&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In Rehab and recovery services in Kirklees and Calderdale BDU we provide care &amp; treatment to individuals suffering from psychosis who have a specific rehab need. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We currently have two inpatient facilities: &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Lyndhurst is a 14 bedded unit in Elland, Halifax, for people with serious mental health problems, primarily with a diagnosis of psychosis, often with substance misuse problems-care clusters 12,13,16,17 and less commonly cluster 10.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Enfield Down is a 27 bedded unit in Honley, Holmfirth, serving the population of Kirklees with a similar remit and also has a slow stream rehabilitation function.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This vacancy is in the unit currently based at Honley.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Units are led by a multi-disciplinary management team, including occupational therapy, medical input, psychology and band 6 nurses taking a clinical leadership role. We work closely with the community teams within Calderdale and Kirklees, to co-ordinate the individuals care. Referrals are analyzed by the MDT to establish outcomes for admission and there is a robust care review process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service is currently under transformation, which aims to establish the future model of care for rehabilitation and recovery in Kirklees and Calderdale.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are now seeking a band 6 nurse to strengthen our service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must have a nursing qualification and registration, and you must have experience of working with individuals with complex mental health needs in patient setting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must have an understanding of, and show commitment to, rehabilitation and recovery principles when working with this service user group.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role will be to provide clinical leadership to the team, undertaking supervision to junior staff and contributing to group supervisions and team meetings. You will be part of the multidisciplinary management team; this involves management and assessment of referrals, risk and incident management, service user involvement, quality initiatives, patient safety and practice development.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an excellent opportunity for someone with post qualifying experience to develop your skills in a specialist area to enhance your career development. We are looking for someone who is committed to working collaboratively with individuals who suffer from psychosis in order to aid their recovery. Experience in using person centred assessments, for example Recovery Star is essential, as is evidence of CPD since qualifying, PSI, CBT, family therapy, substance misuse. You should be a mentor or preparing to undertake the mentor course, and be willing to contribute to the learning environment. Continual professional development will be expected, completion of mentorship course will need to be undertaken if required, development of skills in PSI or other therapeutic approaches will be encouraged. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We work a long day shift pattern, this post will be flexible to meet service user need and support and manage staff to provide 24 hour care; you must be able to commit to these requirements. The future model of community rehab service will also work extended hours to meet service user need.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are happy to tell you more about our service and invite informal discussions about the roles, please contact Chris Nolan on 01484 347716.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield", "postalCode": "HD9 6LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6065", "longitude": "-1.78353"}}, "title": "Senior Clinical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244752", "validThrough": "2020-11-10T23:59:59+0000"}