{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-10-29T12:46:44+0000", "description": "&lt;p&gt;University Hospital Southampton NHS Foundation Trust (UHS) is looking for experienced Band 2 Health Care Assistants to support the on-going Covid-19 testing programme to help ensure we can provide the safest care for both our staff and patients moving forward and help to manage the Covid-19 disease across the Trust and community.&lt;/p&gt;\n&lt;p&gt;This role will require you to be based across Adanac Park or UHS swabbing sites providing tests to staff and members of the public who have a booked appointment. For this role you will be expected to work across a seven day rota, working long days. There will be no night shifts.&lt;/p&gt;\n&lt;p&gt;Once the swabbing hubs are no longer required you will be absorbed into vacancies across UHS where working the full work patterns may be required.&lt;/p&gt;\n&lt;p&gt;You will be fully supported in the role and will be issued with the necessary PPE to carry out the role safely.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;You will be working in a team that consists of qualified and unqualified staff working across UHS, Adanac park and out in the community.&lt;/p&gt;\n&lt;p&gt;There is a requirement that you will need to cover long shift, and will require a full driving license.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;As part of the Covid hub, you will be required to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Meet and greet patients and staff that require testing, ensuring you have checked their personal details against the information provided and adhered to all trust data protection policies and procedures.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Using the safety equipment and PPE provided ensure all tests are carried out effectively.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Ensure all equipment is set up and ready for the day ahead.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Make sure tests are appropriately sealed and labelled sending them in accordance with Trust guidance in a timely manner.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Follow all infection control protocols ensuring the safety of yourself, colleagues and patients at all times.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Use Trust IT systems as required to ensure all appointments and patient information is up to date.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;We are looking for experienced HCA’s in healthcare and experience working in an acute healthcare environment and who would be willing to work as part of a team supporting the community testing requirements on a rota basis and who are confident to carry out the swab testing process.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on 10th December 2020.&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Victor Taylor&lt;/p&gt;\n&lt;p&gt;Matron – Children’s Hospital&lt;/p&gt;\n&lt;p&gt;Victor.taylor@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Sarah Chittock&lt;/p&gt;\n&lt;p&gt;Senior Sister – JADW/Swab hub&lt;/p&gt;\n&lt;p&gt;Sarah.chittock@uhs.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Adanac Park and UHS, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Healthcare Assistant – Covid Swab Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248393", "validThrough": "2020-11-12T23:59:59+0000"}