{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40627", "minValue": "35521", "unitText": "YEAR", "value": "£35521.01 - £40627.73"}}, "datePosted": "2020-10-30T11:09:51+0000", "description": "&lt;h2&gt;To be considered for this role please apply on our website only careers-changegrowlive.icims.com/jobs/2480/lead-nurse--nmp/job?mobile=false&amp;width=1216&amp;height=500&amp;bga=true&amp;needsRedirect=false&amp;jan1offset=0&amp;jun1offset=60&lt;/h2&gt;\n&lt;h2&gt;Overview&lt;/h2&gt;\n&lt;p&gt;An exciting opportunity has arisen within our St Helens Integrated Recovery Service for an NMP and Lead Nurse combined role.&lt;/p&gt;\n&lt;h2&gt;Responsibilities&lt;/h2&gt;\n&lt;p&gt;An exciting opportunity has arisen within our St Helens Integrated Recovery Service for an NMP and Lead Nurse combined role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Change, Grow, Live are the lead provider of St Helens, the Integrated Drug and Alcohol Treatment Services in St Helens. We are recruiting for a Nurse or Pharmacist qualified Non-Medical Prescriber to be based in St Helens and to lead our excellent nursing team.&lt;/p&gt;\n&lt;p&gt;You will be an integral part of a multidisciplinary team and lead on initiating and reviewing prescribing for a wide range of clients, working within our clear formulary and your own competencies. Your diary will be structured with 3-way clinic appointments with our recovery workers and clients, emergency slots for same day prescribing, new client slots to give longer for initial diagnosis, structured admin time (to give support to document your diagnosis and recommendations effectively and inform our prescribing admin team to manage the prescription process) and clinical discussion time programmed in. The successful applicants will also act as a point of contact for other workers and partner agencies around prescribing issues.&lt;/p&gt;\n&lt;p&gt;The role will include working flexibly as part of a team to maintain the most appropriate level of service provision; this will include some evening working on a rota (we are open on Wednesday evenings and you are likely to work these evenings until 7.30pm).&lt;/p&gt;\n&lt;p&gt;We are keen to support our NMP team and every colleague in our team of NMP’s receives:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;½ day CPD time allocated each month to support your professional development&lt;/li&gt;\n&lt;li&gt;Monthly supervision with our Service Doctor, a GP with a special interest in substance misuse&lt;/li&gt;\n&lt;li&gt;Monthly team clinical supervision&lt;/li&gt;\n&lt;li&gt;Monthly team meeting&lt;/li&gt;\n&lt;li&gt;Monthly attendance (alternate) to the CGL NMP Forum / Lead Nurse Forum to meet with colleagues from other services and share experience and discuss best practice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will join an established and dynamic service which aims to help people improve their lives. We are already a high performing service, and having remodelled to enhance the service further, its not only a fun and supportive place to work, but somewhere you can really utilise your clinical skills and provide maximum benefit to our varied client groups.&lt;/p&gt;\n&lt;p&gt;We’d really encourage innovation and want to hear how you can help us to develop even further. As well as providing direct interventions with service users, the successful applicant will contribute to the ongoing development of the clinical team in the service.&lt;/p&gt;\n&lt;p&gt;The post holder will be a First level registered nurse with a current PIN and three years post qualification experience or a qualified pharmacist with current GPhC registration and two years’ post-qualification experience. The post holder will be a Qualified Non-Medical Prescriber with experience of prescribing in a community service.&lt;/p&gt;\n&lt;p&gt;The successful post holder will need to undertake a DBS check at Enhanced Level&lt;/p&gt;\n&lt;p&gt;Please note we shortlist based on the Essential Criteria in the job description attached. Please ensure your application details how you meet all criteria in order to progress through the recruitment process.&lt;/p&gt;\n&lt;p&gt;Change, Grow, Live are committed to creating an inclusive environment, and we recruit from a wide range of backgrounds, ensuring service user’s benefit from diverse skills and expertise. We always work to the principles of fairness and equality of opportunity in all our recruitment processes. We expect an assertive approach to ensuring the safety and well-being of all children, young people and adults, and applicants to these posts will need to demonstrate an understanding of and commitment to best safeguarding practice.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132514.png", "name": "change, grow, live (CGL)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Helens", "postalCode": "WA10 1UQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4554", "longitude": "-2.73747"}}, "title": "Lead Nurse/NMP - St Helens - 2480", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249884", "validThrough": "2020-11-13T23:59:59+0000"}