{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-03T14:01:41+0000", "description": "&lt;p&gt;Wrightington, Wigan and Leigh Teaching Hospitals NHS Foundation Trust are an innovative and forward thinking organisation. We are committed to placing the patient at the heart of everything we do, and in the provision of safe, effective care. &lt;br /&gt;&lt;br /&gt;Employing over 6,000 people across five different sites, our incredibly low staff turnover is a testament to our belief in looking after employees just as well as we care for patients. Central to this is our Staff Engagement Strategy &#39;The WWL Way&#39; for which the Trust has gone from strength to strength, reaching the top 10% of Trusts that staff would recommend as a place to work.&lt;br /&gt;&lt;br /&gt;We are looking to recruit Band 5 Theatre Recovery Practitioners. &lt;br /&gt;Here at Wigan Hospital you will be rewarded with real job satisfaction. Our employee surveys confirm that our staff get real personal satisfaction from the work they do. This satisfaction comes from working in a team that puts patient’s interests at the heart of everything they do.&lt;br /&gt;&lt;br /&gt;Here on the acute site we undertake both adult and paediatric surgery. Our theatre teams also work closely with some of the region&#39;s leading consultants and are exposed to the latest innovative, evidence -based clinical techniques. Our real driving force is our ability to invest in our people, as we support our Theatre Nurses and ODPs to build their skills through mentoring and formal training such as ALS or PLS. &lt;br /&gt;&lt;br /&gt;We are keen to promote from within Wigan Hospital, so if you are looking for a long term career with advancement opportunities you will find them at Wigan. A number of our Theatre Nurses/ODPs have gone on to secure Theatre Team Leader and Theatre Manager posts and we are very keen to encourage these ambitions.&lt;br /&gt;&lt;br /&gt;We commit to our employees well-being through training, support and reward. We offer employees a competitive basic salary as well as a comprehensive benefits package which includes contributory pension scheme, childcare vouchers, cycle to work &amp; car lease scheme, the opportunity to purchase additional annual leave and a motivating workplace environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please Note: Candidates will be asked to provide original qualifications at interview stage.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This vacancy may close earlier than the given closing date is a high volume of applications are received.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCatherine McSorley-ReadJob titleTheatre recovery acting team leaderEmail addresscatherine.mcsorley-read@wwl.nhs.ukTelephone number01942822202&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wrightington, Wigan and Leigh NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wigan, Wigan", "postalCode": "WN1 2NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5576", "longitude": "-2.62953"}}, "title": "Recovery Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254252", "validThrough": "2020-11-17T23:59:59+0000"}