{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum pro rata"}}, "datePosted": "2020-11-02T13:16:58+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Do you want to advance your nursing skills within a specialist Stroke Rehabilitation Unit?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Oxfordshire Stroke Rehabilitation Unit at Abingdon Community Hospital provides specialist rehabilitation for patients in Oxfordshire who have had an acute stroke. We welcome Nurses who wish to move and progress into this specialist area, or newly qualified nurses looking to be part of a great team at the beginning of their career.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for team members who are highly motivated, with an enthusiastic and caring attitude, and possess great communication skills and a commitment to learn. As part of our service you will work within an integrated Nursing and Allied Health Professional team, who aim to provide high quality specialist rehabilitation. We work closely as a team and share training opportunities/supervision between professions. All staff are encouraged to actively participate in service development work, and we always have a number of projects running within the service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We understand the importance of your career development and welcome new ideas to help you achieve your objectives. We offer an excellent induction, clinical and managerial supervision, inhouse and external training opportunities, whilst working in a supportive friendly environment. We are a research active unit, collaborating with teams from the University of Oxford, and encourage all our staff to get involved with these projects.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our ward is based within the lovely historic town of Abingdon where there is a great local community spirit. There are plenty of local amenities and easy access transport links to the hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please feel welcome to contact us if you are interested in this post, so we can tell you more about our wonderful service!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Garratt (Interim Ward Manager) 01865 904922 / emma.garratt@oxfordhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dawn Roberts (Matron) 07920 470463 / dawn.roberts@oxfordhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Abingdon", "postalCode": "OX14 1AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6701", "longitude": "-1.3018"}}, "title": "Registered Nurse - Stroke Rehabilitation Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252219", "validThrough": "2020-11-23T23:59:59+0000"}