{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-06T13:03:58+0000", "description": "&lt;p&gt;NHS Nottingham and Nottinghamshire Clinical Commissioning Group (CCG) is a strategic component of the Integrated Care System (ICS) across Nottingham and Nottinghamshire delivering the commitments set out in the NHS Long Term Plan.&lt;/p&gt;\n&lt;p&gt;As a strategic commissioner we are responsible for meeting the needs of our population through commissioning high quality services. We seek to improve patient experience and are committed at looking at innovative ways we can improve care and offer more choice. Patients are at the heart of everything we do and it’s important that they are involved not just in decisions about their individual care, but also in the decisions that shape the health services delivered locally.&lt;/p&gt;\n&lt;p&gt;In conjunction, with patient experience and the growing demands of our population; we are facing increasing financial challenge. We are required to reduce expenditure to sustainable levels (in alignment to the ICS 5 year strategic plan) which broadly fall into three types of scheme; system wide transformation, system wide efficiency, CCG only efficiency.&lt;br /&gt;Within the CCG, we are seeking a System Resilience Manager as part of our urgent and proactive care directorate to support this overarching aim.&lt;br /&gt;&lt;br /&gt;This post is responsible for providing the support that will help ensure system resilience in urgent care, as well as supporting urgent and proactive care transformation, planning, commissioning and service development. The post holder will work closely with secondary care providers, EMAS, community service providers, GP practices and other health and social care providers/commissioners to support implementation of service change and ensure a robust response to system pressure.&lt;/p&gt;\n&lt;p&gt;In addition, the post holder will support the processes in place that effectively monitor, challenge and report urgent and emergency care performance in support of operational and strategic plans. The post holder will be required to know the performance against key national and local standards at all times, in order to support any need for timely interventions being made and action taken, where organisations are at risk of not meeting these standards.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual preferably, with a background in commissioning or resilience management. The individual will also need to demonstrate strong project management and IT skills along with good analytical skills.&lt;/p&gt;\n&lt;p&gt;For an informal conversation regarding the post, please contact David Fasham on 07852 350049.&lt;/p&gt;\n&lt;p&gt;Closing date: Midnight 22nd November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Nottingham and Nottinghamshire Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128368"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mansfield, NG18 4LE", "postalCode": "NG18 4LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1289", "longitude": "-1.15178"}}, "title": "System Resilience Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259817", "validThrough": "2020-11-22T23:59:59+0000"}