{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35573", "minValue": "31469", "unitText": "YEAR", "value": "£31469.00 - £35573.00 Per Annum"}}, "datePosted": "2020-11-06T12:16:31+0000", "description": "&lt;p&gt;Ty Coch, Cardiff&lt;br /&gt;&lt;br /&gt;We offer full time, part time and bank positions.&lt;br /&gt;&lt;br /&gt;From £31,469.00pa (£15.31ph) to £35573.00pa (£17.31ph) - depending on the T&amp;C package chosen by the successful applicant&lt;br /&gt;&lt;br /&gt;Looking for a Nurse position where you can make a real difference every day?&lt;br /&gt;&lt;br /&gt;We&#39;re pleased to announce the acquisition of Ty Coch Nursing Home in Llanishen, Cardiff as the latest addition to our expanding portfolio of care services in South Wales, with Linc Cymru currently operating Penylan House in Cardiff and Capel Grange in Newport.&lt;br /&gt;&lt;br /&gt;As we expand our range of services, we are looking for dedicated individuals who want to deliver the highest standards of person centered care in the not for profit sector.&lt;br /&gt;&lt;br /&gt;This sounds great, tell me more...!&lt;br /&gt;&lt;br /&gt;Ty Coch is a part of Linc Care and operates in the not-for-profit sector.&lt;br /&gt;&lt;br /&gt;Situated in the peaceful, leafy suburb of Llanishen in the north of Cardiff, Ty Coch has been providing nursing for more than 20 years. The modern, purpose-built home has 63 ensuite bedrooms, two well-furnished lounges, a dining room and a dedicated entertainment lounge all of which provide a place to come together to socialise, participate in group activities, or entertain visitors.&lt;br /&gt;&lt;br /&gt;Working alongside a well trained staff team of Care Assistants, our nurses lead by example on a daily basis to support elders who have a range of complex care needs, allowing you to enhance your experience of working in Nursing care.&lt;br /&gt;&lt;br /&gt;Taking responsibility and acting as &#39;named nurse&#39; gives our nurses the opportunity to build effective professional relationships, and ensure that the care we deliver always meets the changing circumstances and personal wishes of each individual.&lt;br /&gt;&lt;br /&gt;Did you know...?&lt;br /&gt;&lt;br /&gt;•Linc offer a flexible benefit system for our Nurses where you can pick from two benefit packages to suit your needs. Would you prefer an enhanced hourly rate or enhanced annual leave? You decide!&lt;br /&gt;•You will be working 39.38 hours per week for a full time position, which includes a paid 15-minute handover, on a fixed rolling two-week rota. You&#39;ll have every other weekend off which is great to balance your work and home life.&lt;br /&gt;•We recognise the importance of Continuous Professional Development, and you will benefit from a full, tailored induction programme when you start with us. You&#39;ll then be provided with significant opportunities to enhance your specialist clinical and management skills and be provided with full support with PIN revalidation.&lt;/p&gt;\n&lt;p&gt;So what are you waiting for?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Come and take the first steps towards your career with an organisation that is passionate about people, homes and their communities!&lt;br /&gt;&lt;br /&gt;We look forward to hearing from you!&lt;br /&gt;&lt;br /&gt;If you would like an informal chat about nursing with Linc or would like to arrange an informal look around our Nursing homes, please give the recruitment team a call on 02920 474 715. We look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Linc Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cardiff", "postalCode": "CF23 5YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5015", "longitude": "-3.16073"}}, "title": "Registered Nurse (£31,003.00+)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259629", "validThrough": "2020-12-06T23:59:59+0000"}