{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Per annum"}}, "datePosted": "2020-11-03T12:46:11+0000", "description": "&lt;p&gt;Location: Blackpool CMHT (1 post), Fylde CMHT and Wyre CMHT (1 post)&lt;/p&gt;\n&lt;p&gt;As part of the mental health improvement plan we are delighted to be able to offer two posts for experienced mental health pharmacists to work with the community mental health teams on the Fylde Coast. The posts will be aligned either to Blackpool CMHT or the Fylde and Wyre CMHTs and will also involve close liaison with primary care and the urgent care pathways.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be expected to work closely with clinical teams as part of a multi-disciplinary approach to addressing the care needs of patients and service users. There will also be a requirement ensure safe and effective medicines management processes within the service. This will include compliance with regulatory medicines management standards and implementation of medicines safety alerts. As a senior member of the pharmacy team, you will also support Trust initiatives such as the quality strategy and innovation programme.&lt;/p&gt;\n&lt;p&gt;The post will provide an opportunity for the following: -&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development of a non-medical prescribing role&lt;/li&gt;\n&lt;li&gt;Pharmaceutical care planning and clinical review of prescriptions&lt;/li&gt;\n&lt;li&gt;Involvement of service users in decisions about their medicines to optimise treatment, support adherence and improve outcomes&lt;/li&gt;\n&lt;li&gt;Provision of specialist pharmaceutical advice to the multi-disciplinary team&lt;/li&gt;\n&lt;li&gt;Provision of clinical supervision and professional leadership to other members of the team&lt;/li&gt;\n&lt;li&gt;Provision of expert medicines management advice and support and ensuring appropriate governance arrangements are in place for the management of medicines, including the monitoring of prescribing and medicines use.&lt;/li&gt;\n&lt;li&gt;Attendance at strategic network meetings e.g. locality governance meetings&lt;/li&gt;\n&lt;li&gt;Actively working to contribute to and deliver the Trust medicines optimisation strategy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will have current registration with the General Pharmaceutical Council, a postgraduate qualification or equivalent experience, and significant post registration experience in a mental health setting.&lt;/p&gt;\n&lt;p&gt;Due to the location of various units, an ability and willingness to travel around Trust locations is required.&lt;/p&gt;\n&lt;p&gt;These posts present a great opportunity for an enthusiastic and experienced pharmacist motivated by the desire to improve patient care to establish this key position within the MDT. The role demands an organised, flexible individual with excellent communication and interpersonal skills and an ability to work on their own initiative.&lt;/p&gt;\n&lt;p&gt;The Clinical Pharmacy service is highly regarded within the organisation and should you wish to join our team you will become one of a large team of Clinical Pharmacists, Clinical Medicines Management Technicians, Medicines Management Nurses and Pharmacy Assistants working across the Trust. There is no current requirement to work Bank Holidays or weekends.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mohammed Ahmad Deputy Lead Pharmacist North Lancashire mohammed.ahmad@lscft.nhs.uk   07507 847641&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Gateway, Mountcroft of The Woodlands, Blackpool, Fleetwood or Lytham  St Annes", "postalCode": "FY1 6JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8054", "longitude": "-3.04898"}}, "title": "Mental Health Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254018", "validThrough": "2020-11-17T23:59:59+0000"}