{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £51,668 pa"}}, "datePosted": "2020-10-15T10:00:28+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic Senior Clinical Psychologist interested in delivering high quality and innovative services to adults with ADHD. The pathway is part of a larger adult neurodevelopmental Team that also covers adult Autism.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a Senior Clinical Psychologist Band 8a post however we are welcoming applications from those who are keen to develop into a Band 8a role.&lt;/p&gt;\n&lt;p&gt;Appointment will be to a Band 7 role, moving to a Band 8a upon completion of required competencies within a mutually agreed timescale.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Service for adults with ADHD &amp; Autism operates across the Trust localities of Wakefield, Kirklees, Barnsley and Calderdale and in addition, on a spot purchasing basis across the North of England. Clinicians operate an agile working framework using clinical bases and hot desk facilities across the localities of the Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post involves contributing towards the delivery of psychological therapies. It is anticipated that the successful candidate will be competent in the delivery of CBT. Experience of supporting adults with ADHD is beneficial but not essential as training will be provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will hold a relevant professional qualification and registration in the field of Clinical Psychology. The successful candidate will demonstrate a willingness to undergo additional training and a genuine interest in working with adults with ADHD is required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your experience and commitment, we can offer you a friendly working environment, clinical supervision from our Consultant Clinical Psychologist, continuous professional development opportunities and support within an experienced Specialist Multidisciplinary Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Service for Adults with ADHD &amp; Autism has received the prestigious ACOMHS accreditation awarded by the Royal College of Psychiatrists. Such accreditation assures staff, service users and carers, commissioners and regulators of the quality of the Service provided. We are the first Team working with people with adult neurodevelopmental disorders ever to receive it.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Candidates should ensure they are able to demonstrate all essential requirements for the post identified in the person specification and note duties on the job description are as applicable to current requirements of the post and future development of the pathway.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The position is 37.5 hours per week Monday to Friday.&lt;/p&gt;\n&lt;p&gt;For further information/informal queries, please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Tim Fullen, Consultant Clinical Psychologist or Emma Pell, Team Manager on 01924 316492&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 5PN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6705", "longitude": "-1.48941"}}, "title": "Senior Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227607", "validThrough": "2020-11-09T23:59:59+0000"}