{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "27000", "unitText": "YEAR", "value": "£27,000pa - £30,000pa pro rota, DoE, FTE"}}, "datePosted": "2020-10-06T11:26:56+0100", "description": "&lt;p&gt;&lt;strong&gt;Social Worker – part time, fixed term temp contract until July 2021 (covering Maternity leave).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a skilled and enthusiastic Social Worker seeking a new challenge where you can make a positive difference?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has become available for a Social Worker to join our team. The role is a part time (19 hours) position on a fixed term temp contract until July 2021, covering maternity leave at Cygnet Hospital Bierley, working Monday to Friday 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;Cygnet Hospital Bierley is a 63-bed hospital with 3 specialized service lines across four wards. Our specially built hospital and first-class facilities are home to an integrated and multidisciplinary team. We provide care across four specialist wards, Female psychiatric intensive care, Specialist Female Personality Disorder Service and two low security wards, one for men and one for women.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Day-to-Day…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You’ll be working 19 hours a week alongside a team of experienced Social Workers with an emphasis on patient contact and face-to-face work with individuals.&lt;/p&gt;\n&lt;p&gt;•Work in partnership with service users, their families and other stakeholders to support patient’s progress through their treatment pathway&lt;/p&gt;\n&lt;p&gt;•Ensure that patients and their families/carers are aware of their legal rights&lt;/p&gt;\n&lt;p&gt;•Take an active role in safeguarding within the multidisciplinary team&lt;/p&gt;\n&lt;p&gt;•Forge links and maintain contact with external agencies&lt;/p&gt;\n&lt;p&gt;•Lead on assessing and supporting the social care needs of patients&lt;/p&gt;\n&lt;p&gt;•Provide written reports to the Mental Health Review Tribunal, Hospital Managers, and other key professionals&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You are…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•Registered as a Social Worker with Social Work England and have a relevant Social Work qualification&lt;/p&gt;\n&lt;p&gt;•Experienced in working in a mental health setting, or passionate about working in this field&lt;/p&gt;\n&lt;p&gt;•Highly knowledgeable of the Care Act, Mental Health Act and Mental Capacity Act, as well as GDPR and patient confidentiality&lt;/p&gt;\n&lt;p&gt;•Able to confidently apply the principles of safeguarding adults in practise&lt;/p&gt;\n&lt;p&gt;•One years’ experience working as a Social Worker (less than a year maybe consider for directly applicable experience to the setting)&lt;/p&gt;\n&lt;p&gt;•An excellent communicator with exceptional interpersonal skills&lt;/p&gt;\n&lt;p&gt;•Able to work as part of a multidisciplinary team&lt;/p&gt;\n&lt;p&gt;•Skilled in report writing with excellent literacy skills and attention to detail&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bierley Ln, Bradford", "postalCode": "BD4 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7685", "longitude": "-1.73212"}}, "title": "Social Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214442", "validThrough": "2020-11-13T23:59:59+0000"}