{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-28T10:30:38+0000", "description": "&lt;h1&gt;&lt;span&gt;Worcestershire Early Intervention in Psychosis Team &lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nurse Associate &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 4 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hrs per week (full time) Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Worcestershire’s Early Intervention Service addresses the needs of young people (aged 14-35) who have recently experienced a first episode of psychosis.  We are a countywide service helping individuals and their families to cope with psychosis, promoting recovery, reducing trauma and tackling stigma. The service is now in an exciting position to be expanding our age range up to 64.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking a Nurse Associate with the skills and knowledge to help us achieve a gold standard in physical health monitoring and interventions for our patients. The position is within the North EI team based at New Brook (Princess of Wales hospital site), however due to COVID-19, staff are able to also work from home as appropriate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You would be responsible for ensuring full, accurate and timely availability of physical health checks to patient and ensuring patients are referred to and access suitable follow up monitoring and interventions for any physical health concerns. You will be required to work countywide and in both Trust and community settings including patients own homes. You will assist qualified staff in ensuring patients received medications and will also administer medications including injections. You will be required to undertake phlebotomy training and ensure patients receive appropriate blood testing. You will also work with colleagues by running or contributing to groups and family work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Worcestershire’s Early Intervention Service is an award-winning service with an excellent reputation. If you are newly qualified you will have a well thought out induction plan and a member of qualified staff as a mentor.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will work flexibly in a clinical role. You should have experience and confidence in working independently in an adult mental health setting and will have skills in engagement, assessment, therapeutic approaches and physical health monitoring. You must have excellent communication and multi-disciplinary/multi-agency team working skills, underpinned by a sound knowledge of the principles of recovery.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Based in Worcestershire, the post involves a significant amount of travel, therefore it is essential applicants can meet the travel requirements of the post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information, or an informal discussion, please contact:&lt;/p&gt;\n&lt;p&gt;Julia Wittering – (Clinical Team Leader Early Intervention Psychosis Service) or&lt;/p&gt;\n&lt;p&gt;Sian Westaway (Service Lead for Specialist Services) on 01905 734 536 or email on juliawittering@nhs.net .&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;All staff whatever their role, level or responsibility will be encouraged and supported to do their job well and to improve their job.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt; &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Making Every Day Better for patients, staff, service users and carers is the responsibility of all of us and we want to embed a culture within the organisation that encourages and supports the drive to improve what we do.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120795.jpg", "name": "Worcestershire Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire", "postalCode": "B61"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3479", "longitude": "-2.08809"}}, "title": "Registered Nursing Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246058", "validThrough": "2020-11-11T23:59:59+0000"}