{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata)"}}, "datePosted": "2020-10-29T17:01:30+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Health Facilitation Nurse, Band 6, Fixed Term for six months&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a creative and innovative person who possess excellent communication skills to join the city wide Health Facilitation Team, you will be based in the north of the city working to improve access to mainstream primary and acute services. You will promote health enhancing activities to improve the outcomes for people with learning disabilities and will within the framework of level one and level two Health Facilitation.&lt;/p&gt;\n&lt;p&gt;You will work within the framework of a multi-disciplinary team to provide specialist guidance to actively promote the delivery of health facilitation.&lt;/p&gt;\n&lt;p&gt;Contribute to the facilitation of the planning, delivery and evaluation of care pathways for people with learning disabilities.&lt;/p&gt;\n&lt;p&gt;Contribute and facilitate in training and education to the wider health economy.&lt;/p&gt;\n&lt;p&gt;Maintain effective links with primary health care partners to support interventions to reduce health inequalities and supporting the implementation of health screening and health action plans.&lt;/p&gt;\n&lt;p&gt;To work in collaboration between primary and secondary services to adults with learning disabilities when accessing services.&lt;/p&gt;\n&lt;p&gt;To work within the framework of a multi-disciplinary team to provide support and guidance to adults with learning disabilities and their carers. To work within the framework of health facilitation (level one and two) and the framework of Transition. To co-ordinate a clinical service under the supervision of the Specialist Nurse – Health Facilitation&lt;/p&gt;\n&lt;p&gt;You will ensure effective communication between General Practitioners, Consultants and other members of the multi-disciplinary team and co-ordinate the assessment, planning, intervention and evaluation of care interventions for individuals.&lt;/p&gt;\n&lt;p&gt;Liaising with all appropriate professionals, carers and Service User with regard to pre and post admission support to Primary Care and Acute services you will co-ordinate the assessment, planning, intervention and evaluation of care interventions for individuals with learning disabilities requiring palliative care services.&lt;/p&gt;\n&lt;p&gt;You will manage a caseload under the supervision of the Specialist Nurse – Health Facilitation; and complete and facilitate Health Action Plans in conjunction with the Service User, MDT and relevant stakeholders.&lt;/p&gt;\n&lt;p&gt;Facilitate the early identification of school leavers and communicate this information in a timely manner to the Multidisciplinary Team and focus on individual health outcomes for people with learning disabilities and offer support to access health services.&lt;/p&gt;\n&lt;p&gt;You will assess, plan, implement, evaluate and review programmes of care and ensure measurable outcomes and discharges are efficiently and effectively carried out.&lt;/p&gt;\n&lt;p&gt;IMPORTANT&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Maureen Hobbis&lt;/p&gt;\n&lt;p&gt;Maureen.Hobbis@bhamcommunity.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Riverside Lodge, Birmingham", "postalCode": "B10 9JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4733", "longitude": "-1.83514"}}, "title": "Band 6 Health Facilitation Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249189", "validThrough": "2020-11-12T23:59:59+0000"}