{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860-£107,668 per annum"}}, "datePosted": "2020-10-20T16:31:25+0100", "description": "&lt;p&gt;Applications are invited for two replacement whole-time consultant posts in Cellular Pathology based at Queen Elizabeth Hospital (QEH), Woolwich, South East London. Although these are full-time posts, applications for candidates wishing to work less than full time will be considered.&lt;/p&gt;\n&lt;p&gt;The Trust takes great pride in its place at the heart of the community. We are an organisation with a firm focus on the future. We will continue to run services on both sites and are committed to ensuring staff are supported in their roles.&lt;/p&gt;\n&lt;p&gt;Staff will be fully involved in planning any future changes to services. By joining us now you can play a role in shaping a new organisation that continues to put patient care first. Whatever the challenges ahead we are prepared to face them as one team.&lt;/p&gt;\n&lt;p&gt;This is your chance to join a team dedicated to the highest standards of patient care, at a Trust that continues to offer fulfilling careers and enviable development potential.&lt;/p&gt;\n&lt;p&gt;The Cellular Pathology laboratories are based at both hospital sites. We are currently looking at forming a single cellular pathology service, in line with the Trust merger indicated above, although details are yet to be finalised. The Trust provides a wide range of services which generates a broad and varied cellular pathology workload including specimens from dermatology, gynaecology, urology, lung, breast and gastroenterology.&lt;/p&gt;\n&lt;p&gt;The department at QEH has full UKAS accreditation and has well-staffed laboratory and administrative services. The laboratory performance in the regular NEQAS assessments is of a consistently high standard and there is an extensive immunohistochemical panel of antibodies available using the Roche Ventana system. The department is a dedicated training centre for biomedical science students from the University of Greenwich and monthly teaching sessions are provided by consultants for both laboratory staff and university students within the department; participation in this teaching and training would be desirable.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be based at the QEH site and will join a team of four consultants to provide a comprehensive service to this large Trust. They will participate in both general and breast EQA schemes (both funded by the Trust) but other specialist EQA schemes will also be considered. An interest in breast and/or gynaecological pathology is desirable but not essential; however, the appointees will be encouraged to develop a specialty interest and lead one of the specialty multidisciplinary team (MDT) meetings to complement the interests of existing consultants. The appointees will benefit from spacious, well-appointed offices with excellent microscopes and facilities for photomicrography; full secretarial support is also provided. Up-to-date reporting modalities such as digital dictation and voice recognition are available for use if desired.&lt;/p&gt;\n&lt;p&gt;Woolwich is part of the borough of Greenwich in South-East London and is undergoing rapid redevelopment into a sought-after location to work and live. It is just 8 miles from central London and benefits from excellent transport links, with a National Rail station (Southeastern), Docklands Light Rail (DLR) station and the new Elizabeth Line (Crossrail) station as well as close proximity to the Blackwall Tunnel, A12, M20 and M25.&lt;/p&gt;\n&lt;p&gt;Applicants should be in possession of the FRCPath (or equivalent) and must be fully registered with the GMC including entry on the GMC Specialist Register or within six months of obtaining their CCT at the time of interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Dr Damian Collins, Head of Department - 0208 836 5657; damian.collins@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth Hospital, London", "postalCode": "SE18 4QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4791", "longitude": ".051174"}}, "title": "Consultant Cellular Pathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235286", "validThrough": "2020-11-11T23:59:59+0000"}