{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T10:31:07+0000", "description": "&lt;p&gt;Are you a highly motivated, caring and dedicated mental health nurse who enjoys community working? Do you believe in keeping service users and carers at the heart of everything you do? Are you interested in developing your skills and knowledge in a supportive and friendly environment?&lt;/p&gt;\n&lt;p&gt;North Sefton Adult Community Mental Health Team are looking to recruit a full time band 6 Mental Health Nurse. The applicant will join a committed, enthusiastic and recovery focused multi-disciplinary team. In order to deliver high quality services you will be supported and developed to deliver evidence-based interventions to a wide range of service users with complex care needs and their carers who are experiencing a range of mental health issues.&lt;/p&gt;\n&lt;p&gt;You will be expected to deliver high quality, recovery-focused mental health interventions to a caseload of service users. At times this may include brief or crisis interventions for your own caseload but also supporting the team by being part of a duty rota for those service users who need urgent input or assessment. You need to be able to work independently and as part of a team. You will be supported with an MDT approach to the care that is provided.&lt;/p&gt;\n&lt;p&gt;Although the post will start out being based within the Hesketh Centre the Community Mental Health Team will be moving to the new state of the art Hartley Hospital which would become your base in the coming months.&lt;/p&gt;\n&lt;p&gt;As part of the team you will receive regular supervision, take part in reflective practice, attend regular training updates and have the chance to be part of the change within CMHTs.&lt;/p&gt;\n&lt;p&gt;Shortlisting is planned for 11th November 2020.&lt;/p&gt;\n&lt;p&gt;Interviews are planned for 16th November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKerry AdamsonJob titleDeputy Team ManagerEmail addresskerry.adamson@merseycare.nhs.ukTelephone number07717347861&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hesketh Centre, Southport", "postalCode": "PR9 0LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6561", "longitude": "-2.99243"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253451", "validThrough": "2020-11-10T23:59:59+0000"}