{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 per annum"}}, "datePosted": "2020-10-27T11:31:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Tobacco, Alcohol and Drugs Prevention Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Principal Public Health Practitioner Tobacco Control (Band 8b)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for experienced Principal Public Health Practitioners to join our Health Improvement Division to work at a national level, with a specific focus on substance misuse prevention and tobacco control within our newly established Tobacco, Alcohol and Drugs Prevention Group. The group is led by Consultants in Public Health and supported by practitioners from our Public Health Development Team.&lt;/p&gt;\n&lt;p&gt;You will be expected to provide specialised advice and expertise on the development of public health strategy, policy and practice; linking with other programmes of work across divisions in Public Health Wales. You will contribute to national level advisory groups as required.&lt;/p&gt;\n&lt;p&gt;The role involves developing and maintaining strong partnerships at a national and local level particularly with Local Public Health Teams. The post-holder will facilitate knowledge mobilisation across the specialist public health system and seek opportunities to develop shared and integrated approaches with Local Public Health Teams.&lt;/p&gt;\n&lt;p&gt;The post presents opportunities to work within a team dedicated to systems-working and a multi-agency approaches to health improvement. We have a strong focus on evidence based practice, research and evaluation and the application of behavioural science.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Grŵp Atal Tybaco, Alcohol a Chyffuriau&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Prif Ymarferydd Iechyd y Cyhoedd, Rheoli Tybaco (Band 8b)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 awr yr wythnos&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mae gennym gyfle cyffrous i Brif Ymarferwyr Iechyd y Cyhoedd profiadol ymuno â&#39;n His-adran Gwella Iechyd i weithio ar lefel genedlaethol, gyda ffocws penodol ar atal camddefnyddio sylweddau a rheoli tybaco yn ein Grŵp Atal Tybaco, Alcohol a Chyffuriau sydd newydd ei sefydlu. Ymgynghorwyr Iechyd y Cyhoedd sy&#39;n arwain y grŵp ac fe&#39;u cefnogir gan ymarferwyr o&#39;n Tîm Datblygu Iechyd y Cyhoedd.&lt;/p&gt;\n&lt;p&gt;Disgwylir i chi roi cyngor arbenigol a chynnig arbenigedd wrth ddatblygu strategaethau, polisïau ac arferion iechyd y cfcyhoedd; gan gysylltu â rhaglenni gwaith eraill ar draws is-adrannau yn Iechyd Cyhoeddus Cymru. Byddwch yn cyfrannu at grwpiau cynghori ar lefel genedlaethol yn ôl yr angen.&lt;/p&gt;\n&lt;p&gt;Mae&#39;r rôl yn cynnwys datblygu a chynnal partneriaethau cryf ar lefel genedlaethol a lleol, yn enwedig gyda Thimau Iechyd y Cyhoedd Lleol. Bydd deiliad y swydd yn hwyluso dod â gwybodaeth ynghyd ar draws y system iechyd y cyhoedd arbenigol ac yn chwilio am gyfleoedd i ddatblygu dulliau integredig ac ar y cyd â Thimau Iechyd y Cyhoedd Lleol.&lt;/p&gt;\n&lt;p&gt;Mae&#39;r swydd yn gyfle i weithio o fewn strwythur staff sy&#39;n ymroddedig i weithio drwy systemau a dulliau amlasiantaeth o wella iechyd. Mae gennym ffocws cryf ar ymarfer, ymchwil a gwerthuso ar sail tystiolaeth a chymhwyso gwyddorau ymddygiad.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAshley GouldJob titleConsultant in Public Health, Health Improvement TeamEmail addressAshley.Gould@wales.nhs.ukTelephone number029 2010 4608&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124752.jpg", "name": "Public Health Wales NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124752"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "2 Capital Quarter, Cardiff", "postalCode": "CF10 4BZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.476", "longitude": "-3.17017"}}, "title": "Principal Public Health Practitioner - Tobacco Control", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244244", "validThrough": "2020-11-10T23:59:59+0000"}