{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum, inc HCA"}}, "datePosted": "2020-10-26T15:16:12+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s College hospital is investing in the expansion of the medicines management service. As a result of this we have an exciting opportunity to become a part of the medicines management pharmacy team based at our Denmark Hill site. The team delivers a high quality service to our patients on the wards at one of London&#39;s largest and busiest teaching hospitals. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant will be involved in medicines reconciliation, supporting stock management, counselling patients and working with the pharmacists to provide an efficient and accurate clinical pharmacy service to patients at ward level. In addition, you will participate in general dispensary duties, including dispensing and accuracy checking. &lt;br /&gt; &lt;br /&gt;In order to be successful in this role, you will need to be organised, motivated, have excellent communication skills and be able to adapt quickly to new situations. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Registration as a pharmacy technician with the General Pharmaceutical Council (GPhC) is essential as well as holding ACPT accreditation or be willing to work towards it. Previous experience of medicines management at ward level would be a significant advantage. &lt;br /&gt;In return we can offer a professionally rewarding career with the opportunity for personal development along the way. If successful, you will also have the opportunity to be enrolled on a nationally recognised medicines management accreditation course. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;PREVIOUS APPLICANTS NEED NOT APPLY. Interviews to be held on Wednesday 18th of November.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKiran ChhokarJob titleSpecialist Pharmacist, Clinical servicesEmail addressKiran.chhokar@nhs.netTelephone number02032990355&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Medicines Management Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243092", "validThrough": "2020-11-09T23:59:59+0000"}