{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-04T11:26:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Do you want to make a difference’ to the lives of people with dementia in Lincolnshire?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Band 5 staff nurse at Langworth ward Witham Court.&lt;/p&gt;\n&lt;p&gt;We are offering all registered nurses for this position an attractive employment package, including a welcome payment of £2,500 (paid in two instalments during year one) and £4,000 payment in lieu of relocation (to assist with commuting) or full relocation package** if appropriate. In addition there is a whole host of unique staff benefits and educational support as part of a nurse’s CPD.&lt;/p&gt;\n&lt;p&gt;** Eligibility criteria applies, more information can be provided&lt;/p&gt;\n&lt;p&gt;Langworth ward is an 18 bedded acute assessment ward for older adults experiencing mental health problems associated with dementia (we do take younger individuals dependent upon diagnosis). The ward is challenging, fast paced and offers excellent opportunities for professional development. The Older People and Frailty Division have recently embarked upon extensive service re-modelling and are due to start the new Dementia Home Treatment Team in the New Year. The ward will be an integral part of this Dementia Care Pathway across the county and rotational posts may be considered if preferred with flexible working.&lt;/p&gt;\n&lt;p&gt;The focus of our care is to provide assessment and treatment for our patients in a safe and compassionate environment. We are committed to delivering person centred care around the values of the 6 C’s and the band 5 role is pivotal to this.&lt;/p&gt;\n&lt;p&gt;The staff nurse would be expected to work closely with the team in the delivery, evaluation and development of the care programme approach and be forward thinking and innovative in the on-going development of service provision. The candidate must be genuinely patient and carer focussed in their approach to all they do.&lt;/p&gt;\n&lt;p&gt;The successful candidate will ideally possess excellent communication skills, determination, drive and an ability to manage their workloads in a challenging ever changing environment. This will work towards providing a quality of care that achieves confidence and effective outcomes to all those who come into contact with the ward.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will need to demonstrate an understanding of the complexities and challenges that can present for patients with dementia and for their carers.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work flexibly across a variety of shifts in order to meet the needs of the 24 hour service.&lt;/p&gt;\n&lt;p&gt;This is a great development opportunity for the right candidate. Full time positions are preferred, but part time would be considered. A full induction package will be offered, access to training, regular supervision, annual appraisal and a commitment to developing staff to their full potential.&lt;/p&gt;\n&lt;p&gt;The salary for this post, depending upon relevant experience, is A4C band 5-£24,907-30,615. The hours are 37.5 per week worked on a shift basis to cover 24hour period to include nights and weekends.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact Diane Harvey, ward manager on 01522 508318 or e-mail diane.harvey2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln", "postalCode": "LN6 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1854", "longitude": "-.575247"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255590", "validThrough": "2020-12-16T23:59:59+0000"}