{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18185", "unitText": "YEAR", "value": "£18,185 - £19,337 per annum"}}, "datePosted": "2020-11-04T11:46:06+0000", "description": "&lt;p&gt;Opportunities have arisen within the Porter Services department based at Prince Charles Hospital for three full time Porters to be recruited on a six month fixed term contract basis to support the team during the COVID-19 pandemic. While these roles are not permanent, successful candidates will be best placed to apply for any permanent vacancies that will arise in the department.&lt;/p&gt;\n&lt;p&gt;The role covers the full range of hospital Porter duties and typically this will involve:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Patient transfers.&lt;/li&gt;\n&lt;li&gt;The collection and delivery of specimens.&lt;/li&gt;\n&lt;li&gt;Medical gas cylinder delivery and collection.&lt;/li&gt;\n&lt;li&gt;Medical device transfers.&lt;/li&gt;\n&lt;li&gt;Waste management duties.&lt;/li&gt;\n&lt;li&gt;Post Room duties.&lt;/li&gt;\n&lt;li&gt;Driving duties.&lt;/li&gt;\n&lt;li&gt;Mortuary transfers.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that the above is representative of the expected duties, but the list is not meant to be exhaustive.&lt;/p&gt;\n&lt;p&gt;The Porter Services department at Prince Charles Hospital provides a 24/7 service, and successful candidates will be required to work nights, weekends, and Bank Holidays to support this. Shift patterns will be discussed with candidates during the interview process and some degree of flexibility will be required to be successful for these vacancies. There may also be a requirement to support Porter Services departments at other hospitals.&lt;/p&gt;\n&lt;p&gt;In this role the successful applicant will be expected to use a variety of equipment, communication devices, and software systems supplied by the Facilities department. This will include the use of PCs, telephones, radios, and pagers.&lt;/p&gt;\n&lt;p&gt;Training will be provided in all aspects of the job, and successful candidates will be expected to complete their vocational and mandatory training within the first two months of their employment.&lt;/p&gt;\n&lt;p&gt;In the event of a major incident or to support the department in adverse weather conditions, the successful applicant will be required to be called into work to support the hospital outside of normal working hours.&lt;/p&gt;\n&lt;p&gt;Ideally the successful candidates will be able to demonstrate previous experience of working in a hospital environment, or of having had similar roles outside of the NHS.&lt;/p&gt;\n&lt;p&gt;All posts will be paid monthly by electronic cash transfer on the 21st of each month. This organisation uses the Disclosure Barring Service system and will apply for an appropriate disclosure on all successful applicants.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for these posts.&lt;/p&gt;\n&lt;p&gt;Closing date: 09th October, 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Brian Jones, Facilities Manager, on 01685 721721 ext. 23123&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prince Charles Hospital, Merthyr Tydfil", "postalCode": "CF47 9DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.764", "longitude": "-3.38552"}}, "title": "Porter - Prince Charles Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255664", "validThrough": "2020-11-09T23:59:59+0000"}