{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-02T03:46:26+0000", "description": "&lt;p&gt;Occupational Therapist Band 5 - full time permanent post&lt;/p&gt;\n&lt;p&gt;Rotherham’s Mental Health Services for Older People provides inpatient, and community services to people usually over the age of 65 who present with a range of later life mental health difficulties. We also offer specialist services, such as Memory Services, Care Home Liaison and young onset dementia services.&lt;/p&gt;\n&lt;p&gt;An excellent opportunity has arisen for an occupational therapist wishing to develop their knowledge and skills within older people’s mental health services and provide evidence based occupational therapy assessment and treatment enabling service users to work towards recovery and well-being.&lt;/p&gt;\n&lt;p&gt;The service is based at The Woodlands Inpatient Unit in Rotherham where with the support of a Senior Occupational Therapist you will work as part of the multidisciplinary inpatient team. You will assess occupational needs of patients, working directly with them and their families/ carers to support, maintain and optimise independence, health and well-being and to regain or develop independent living skills, working towards individual occupational and recovery goals as part of a safe and effective discharge process. You will be joining a supportive service team and have an opportunity to contribute to service quality and developments.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You should have experience of placements/working in mental health services.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;You will work as a member of a multi-disciplinary team supervising support staff and working in partnership with a range of external agencies.&lt;/li&gt;\n&lt;li&gt;You should be a team player, and a confident and effective communicator with patients/ service users, carers and staff of all professional groups as well as with external partner agencies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The OT team within the Rotherham service is well established and supportive and there is an Allied Health Professionals and occupational therapy network within the organisation providing opportunities for collaboration and support related to development of occupational therapy practice and services.&lt;/p&gt;\n&lt;p&gt;We have strong links with local universities and provide regular practice placements for occupational therapy students.&lt;/p&gt;\n&lt;p&gt;Support will be offered through regular clinical and managerial supervision, in-house and external training and an individual approach to your future developmental needs. For further information contact Kerry Aston, Senior Occupational Therapist. k.aston2@nhs.net telephone 01709 447001&lt;/p&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/p&gt;\n&lt;p&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Occupational Therapist (Band 5)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251257", "validThrough": "2020-11-16T23:59:59+0000"}