{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-14T12:01:42+0100", "description": "&lt;p&gt;Ward 14 is usually a surgical colorectal unit caring for elective, emergency, and intestinal failure patients. Due to the covid-19 pandemic, we are currently working differently and now comprise of a 19 bed elective surgical unit and a 14 bed acute colorectal unit. The elective unit cares for all surgical specialities, such as colorectal, urology, UGI, ENT, ophthalmology and maxillofacial patients, whereas the acute colorectal unit cares for emergency, critical care step-down and intestinal failure patients.&lt;/p&gt;\n&lt;p&gt;We are a fast-paced busy unit but we are a very supportive and caring team, we regularly receive positive patient feedback on our care given and standards. We offer an extended supernumerary period for new starters with learning opportunities with the nutrition, stoma and enhanced recovery nurses. You will get the opportunity to develop your clinical skills and competencies, as we are a very skill based hands on speciality. We regularly manage wounds, invasive devices, central lines and TPN (total parenteral nutrition) administration, enteral feeds and specialise in care for the post-operative and complex colorectal/intestinal failure patients.&lt;/p&gt;\n&lt;p&gt;Join our compassionate and caring team and you will have the opportunity to develop your nursing career within surgery, specialising within colorectal care. There is a chance to join our expanding team and we welcome both newly qualified and experienced nurses, no prior colorectal experience is required as full training will be offered during your supernumerary settling in period. We welcome those interested to visit our ward and team (socially distanced) to get a feel of our team ethics and how we work together to care for our patients, please do not hesitate to contact Ward Sister Ellie to arrange.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arrowe Park Hospital, Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226118", "validThrough": "2020-11-11T23:59:59+0000"}