{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 to £73,664 pa"}}, "datePosted": "2020-10-26T03:31:06+0000", "description": "&lt;p&gt;Saving and enhancing as many lives as possible, the work of NHS Blood and Transplant (NHSBT) is vital to the wellbeing of the nation. That’s a large statement to make, but nearly everyone knows someone who has had a blood transfusion or is in need of a new organ – so quite simply, we must not fail to meet our bold targets. In the last seven months alone, 1683 people have received a transplant, and with 4924 people still on the waiting list for an organ, these goals are more pressing than ever. Join us as Head of Operations in our Organ Donation team, and you could play a vital role in elevating our work even further – all while developing your own skills and capabilities in a truly cutting-edge environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At the heart of this challenge, is the need to manage high-quality organ donation services, identifying where improvements need to made, and setting the direction that will allow us to meet our goals. As one of two Head of Operations, you will be a member of the senior leadership team, collaboratively overseeing the work of seven Regional Managers, and seeing to it that the service is meeting all compliance standards. As a trusted subject matter expert, you will take ownership of the day-to-day delivery of the service, leading the organ donation teams and managing nursing managerial and operational problems as they arise. Determining what we could do better, you will proactively identify and convert potential donors, acting as an ambassador for organ donation, and allocating resources to meet demographic needs. Using your exceptional people management skills to develop the capabilities of the Regional Management team, you will be an inspirational leader who is committed to helping us achieve our ambitious donation and transplant goals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a valuable opportunity to use your extensive knowledge to inspire and motivate a progressive team who are passionate about the work that they are doing. You will therefore excel in this role if you are an experienced Nurse with current Nursing and Midwifery Council registration, with either a masters-level qualification or extensive experience. You will also:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have substantial experience of the operational delivery of services, including setting direction and holding people accountable to what they have promised.&lt;/li&gt;\n&lt;li&gt;Be a confident leader with a background in managing and improving services at a senior level. This will include evaluating the safety and effectiveness of clinical practice within a clinical governance framework.&lt;/li&gt;\n&lt;li&gt;Have a comprehensive knowledge of the issues and developments within organ donation, nursing and the NHS. As such, you will be comfortable working within a budget.&lt;/li&gt;\n&lt;li&gt;Have well-developed verbal and written communication skills. You will also have well-developed skills in writing reports and building business cases.&lt;/li&gt;\n&lt;li&gt;Enjoy solving problems, and with good analytical and risk assessment skills, you will use evidence to underpin your recommendations.&lt;/li&gt;\n&lt;li&gt;Be a team-player with exceptional motivational skills. You will also enjoy working autonomously, and you will have plenty of tenacity.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a role that combines the best of everything. As a member of an organisation that quite rightly garners worldwide acclaim, you will have the chance to work with the most forward-thinking healthcare professionals, plus access to unparalleled development and learning opportunities. Encouraged to grow your career within NHSBT, we will support your ongoing ambitions. And while your professional satisfaction is important, it’s also vital to us that you feel appreciated and supported in your work. As such, we will help you achieve a great work/life balance, enhanced by generous annual leave, multiple staff discounts and a competitive pension scheme. With all of this available within a friendly workplace in which people truly value your contribution, we are confident that you will never want to leave our visionary team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To find out more about this exciting role, please contact Tracey Jones at &lt;/strong&gt;&lt;strong&gt;tracey.jones@nhsbt.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date 23:59 on Wednesday 18th November 20&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews are expected to be held week commencing 7th December 20&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National by agreement", "postalCode": "B15 2SG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4528", "longitude": "-1.93523"}}, "title": "Head of Operations (Nurse) - Organ Donation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241611", "validThrough": "2020-11-18T23:59:59+0000"}