{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-10-28T14:30:57+0000", "description": "&lt;p&gt;This is an opportunity for you to join the excellent integrated health and education team at Ysgol y Deri. As recently showcased on BBC Wales, this is an innovative and forward thinking school which puts children and young people at the centre. The Occupational Therapy Team support all learners by providing universal and targeted input to bespoke curriculum design and provide individualised and tailored assessment and treatment to learners. If you are enthusiastic, hardworking and a team player, with experience of working with children and young people with disabilities and additional learning needs, we&#39;d be excited to see your application.&lt;br /&gt;&lt;br /&gt;The team is based at Ysgol y Deri Special School, where children and young people aged 3-to-19yrs, access specialist education provision. The occupational therapy service provide an integrated model, working closely with school staff and parents to ensure the child&#39;s needs are central to service delivery. You will also take a wider role within the extended occupational therapy service, being a link with leisure and Disabilities Sports services in the Vale of Glamorgan. &lt;br /&gt;&lt;br /&gt;We encourage and support learning and development within the job role. You will have regular supervision and an annual performance review. You will be able to access in-service training, formal training and will be expected to carry-out healthcare support worker training within AGORED&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Closing Date: 10th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Colette Shapley Job title Advanced Paediatric occupational therapist&lt;/p&gt;\n&lt;p&gt;Email address colette.shapley@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 02921836910&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysgol y Deri Special School, Cardiff and Vale", "postalCode": "CF64 2TP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4358", "longitude": "-3.19797"}}, "title": "Children&#39;s Occupational Therapy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246980", "validThrough": "2020-11-10T23:59:59+0000"}