{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-03T16:16:12+0000", "description": "&lt;p&gt;&lt;strong&gt;SENIOR&lt;/strong&gt;&lt;strong&gt; THEATRE PERIOPERATIVE PRACTITIONER &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;OPERATING DEPARTMENT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Churchill Theatres&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6, Senior Scrub Practitioners - Nurses and ODP’s &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We currently have opportunities for Band 6 Senior Scrub Nurses and ODP’s to join our caring and dynamic team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our ideal candidates will also be highly motivated and a pro-active team player. Excellent communication skills and a flexible approach are essential as an on-call commitment and full internal rotation is required for this post as well as participation in programmes of additional surgical activity.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Churchill Hospital is a specialist centre for cancer and transplant services.&lt;/p&gt;\n&lt;p&gt;Our ten theatre suite specialises in urology, hepatobiliary, endocrine, gastrointestinal, breast and gynaecology oncology, plastic, oral maxillofacial surgery, kidney, pancreas and small bowel transplantation. We have 10 theatres and we provide 24 hour emergency and transplant services 7 days a week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is in one of the largest NHS teaching trusts in the UK, Oxford University Hospitals group. Our collaboration with the University of Oxford underpins the quality of the care and pioneering surgical techniques that are provided to our patients&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our core values are excellence, compassion, respect, delivery, learning and improvement. Collaboration and partnership are also central to our approach in delivering our fundamental activities of patient care teaching and research&lt;/p&gt;\n&lt;p&gt;-----&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an experienced, enthusiastic, self-motivated, hardworking and patient focused Band 6 senior scrub practitioner.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will need to have a flexible approach to work pattern which will include shifts and weekend working.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be required to have good interpersonal skills, a willingness to learn and you will need to show evidence of personal and professional development. Working in a specialist team, your role will be to give direct patient care. In return we can offer excellent opportunities for further training both in house and through the post graduate.&lt;/p&gt;\n&lt;p&gt;You should have at least two years’ experience, possess good communication skills and be a good team player. You should also be able to utilise resources efficiently with a commitment to providing a quality service to both patients and service users.&lt;/p&gt;\n&lt;p&gt;---&lt;/p&gt;\n&lt;p&gt;Oxford isn&#39;t just a good place to work; it&#39;s also a great place to live. The compact easy-to navigate city boasts a rich architectural history, with plenty of green spaces, riverside walks and it is surrounded by beautiful countryside. From Oxford there is easy access to London, and major transport links. Blenheim Palace, Windsor Castle and the Cotswolds are all within easy reach. Our location is conveniently situated for public transport. The bus and mainline train stations are both within a short bus journey or bike ride.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Band 6: £31,365 - 37890&lt;/p&gt;\n&lt;p&gt;Hours: Full time / Part time&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date: 22-Nov-2020&lt;/p&gt;\n&lt;p&gt;Planned Interview Date: TBC&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCaroline BakerJob titleTheatre SisterAdditional contact information&lt;/p&gt;\n&lt;p&gt;Joanna.Nawrocka@ouh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Caroline.baker2@ouh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Churchill Hospital Theatres, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Senior Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254740", "validThrough": "2020-11-22T23:59:59+0000"}