{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata + 5% of basic"}}, "datePosted": "2020-10-28T10:01:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Dialectical Behaviour Therapist (DBT) band 6 (Based in community teams across Hertfordshire – see locations below) - please state preferred location on application.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Delivering great care, achieving great outcomes – together&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hertfordshire Partnership University NHS Foundation Trust (HPFT) is a successful provider of mental health and learning disability services delivering services, rated Outstanding by CQC. We are a Values Based organisation and our aim is to ensure that we deliver an experience that is consistent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are welcoming, kind, positive, respectful and professional, because these are the Values that our service users, Carers and staff told us meant the most to them.&lt;br /&gt;&lt;br /&gt;We are proud to have an established Dialectical Behaviour Therapy Programme and with a recent new investment. We have also been developing additional Structured Clinical Management in our Community Teams this year across Hertfordshire.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We currently have a new vacancy for a band 6 DBT therapist to join our established DBT programmes in Hertfordshire. This offers an exciting opportunity to join an established group of therapists to offer a quadrant wide therapy service within the community mental health team who provide a local DBT service, as well as joining the wider network of therapists across the trust. The service works to meet the needs of service users who are experiencing significant difficulties with emotional instability and risk to themselves, working within the local multi-disciplinary community teams. We pride ourselves on the quality of the service that we offer and place importance on supporting all our therapists to provide great care, with an emphasis placed on maintaining and developing therapist skills and regular supervision.&lt;br /&gt;&lt;br /&gt;This post would suit someone with a core mental health qualification and registration (including nursing, social work, occupational therapy, or other appropriately registered therapists - see person spec for details) and with an interest of working collaboratively with service users (and their families) to develop their skills to improve their ability to tolerate and manage strong emotion. Also it would suit someone who loves working as part of a therapy team and alongside multidisciplinary colleagues, supporting their practice . We are looking for someone who has experience of working with this service user group in community settings. Ideally they will have experience, or training in DBT or SCM, however we are happy to consider to individuals able to commit to completing these trainings - which will be provided. The post will be based as described, but the ability to work flexibly as the needs of the service demands will be essential. The post holder would expect some travel within their working week.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;This is a full-time post based in South West Hertfordshire - Watford and Borehamwood&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Sarah TarziJob titleConsultant Clinical Psychologist, clinical lead, Personality Disorders PathwayEmail addresss.tarzi@nhs.netTelephone number07979 946372Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Sarah Tarzi, Consultant Clinical Psychologist and Clinical Lead for Community Personality Disorder pathway (tel: 01923 837143/ 07979 946372&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Fiona Roberts, Consultant Psychologist &amp; Head of AMH Psychological therapies (tel: 01707 364183 ) &lt;/strong&gt;&lt;strong&gt;Fiona.roberts14@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community, Watford and Borehamwood", "postalCode": "WD18 0JP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6567", "longitude": "-.40142"}}, "title": "Psychological Therapist (Personality Disorders)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245935", "validThrough": "2020-11-11T23:59:59+0000"}