{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata, per annum"}}, "datePosted": "2020-11-02T13:45:44+0000", "description": "&lt;p&gt;We are looking for Experienced Nurse Practitioners who want to work for an aspiring World-Class provider of healthcare to the patients, visitors and communities that we serve. In exchange for your motivation, experience, positive attitude and commitment to our Trust, we can offer you a nursing position with exciting career opportunities.&lt;br /&gt;&lt;br /&gt;UHCW currently have vacancies available across numerous specialties (listed below), please identify which specialty you are interested in when prompted on your application form. More information on these specialty areas are provided in the additional information links on the right side of this page.&lt;br /&gt;&lt;br /&gt;Areas of Opportunity&lt;br /&gt;&lt;br /&gt;Cardiac Services:&lt;br /&gt;&lt;br /&gt;Cardiac Catheter Suite&lt;br /&gt;Cardiothoracic Critical Care&lt;br /&gt;Cardiology&lt;br /&gt;Cardiothoracic Surgery&lt;br /&gt;Respiratory&lt;br /&gt;&lt;br /&gt;Emergency Medicine&lt;br /&gt;&lt;br /&gt;Ward 12 Observation&lt;br /&gt;Emergency Department&lt;br /&gt;Acute Medical Unit&lt;br /&gt;Neurosciences:&lt;br /&gt;&lt;br /&gt;Stroke – part time flexible evening hours available&lt;br /&gt;Neurology&lt;br /&gt;Neurosurgery&lt;br /&gt;Oncology and Haematology:&lt;br /&gt;&lt;br /&gt;Chemotherapy Suite&lt;br /&gt;Ward 34 Haematology&lt;br /&gt;Ward 35 Oncology&lt;br /&gt;Surgery:&lt;br /&gt;&lt;br /&gt;Gastroenterology&lt;br /&gt;ECU/SAU&lt;br /&gt;Vascular&lt;br /&gt;Head and Neck Surgery&lt;br /&gt;General Surgery&lt;br /&gt;Trauma and Orthopaedics&lt;br /&gt;Gynaecology&lt;br /&gt;Specialist Medicine &amp; Ophthalmology:&lt;br /&gt;Diabetes&lt;br /&gt;Endocrinology&lt;br /&gt;Rheumatology&lt;br /&gt;Dermatology&lt;br /&gt;Ophthalomology&lt;br /&gt;General Critical Care&lt;br /&gt;Care of the Elderly - Ward 20 and Ward 40&lt;br /&gt;Radiology&lt;br /&gt;Outpatients&lt;/p&gt;\n&lt;p&gt;Fracture Clinic&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Recruitment Centre&lt;br /&gt;&lt;br /&gt;If your application is shortlisted, you will be invited to attend an Recruitment Centre. This Recruitment Centre is intended to provide you with the opportunity to demonstrate how you would treat our patients and staff for whom we care, with the compassion, courtesy, dignity and respect they deserve.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Recruiting to Values&lt;br /&gt;&lt;br /&gt;To ensure that we provide world-class patient care, UHCW recruits people that can demonstrate the Trust’s Values and Behaviours in their everyday life. Therefore, if you are invited to interview, you will be undertaking a Values Based Interview, which explores not only what you do but how and why you do it.&lt;br /&gt;&lt;br /&gt;Before applying, we encourage you to review the Trust’s Values and Behaviours Framework and Values Based Recruitment Factsheet which can be accessed on the right side of this page under the job description.&lt;br /&gt;&lt;br /&gt;The Supporting Information Section in your application should therefore reflect your understanding of the Trust’s Values and associated Behaviours. You will be expected to provide us with examples from work experience and/or personal life which demonstrate these values through your behaviour.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Registered Nurse - All Departments", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252272", "validThrough": "2020-11-16T23:59:59+0000"}