{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inc"}}, "datePosted": "2020-11-05T08:15:44+0000", "description": "&lt;p&gt;The Royal London Emergency Department is looking to recruit an enthusiastic and motivated individual to our team in the role of Advanced Clinical Practitioner (ACP). The Royal London is part of Barts Health NHS Trust, one of Britain’s leading healthcare providers and the largest trust in the NHS. It was created on 1 April 2012 by bringing together three trusts: Barts and The London NHS Trust, Newham University Hospital NHS Trust and Whipps Cross University Hospital NHS Trust. The new trust has a turnover of approximately £1.1 billion and approximately 15,000 employees.&lt;/p&gt;\n&lt;p&gt;The Emergency Department at the Royal London saw over 500 patients daily in 2019/20 from East London and beyond. It is the home to the London Air Ambulance helicopter emergency medical service (HEMS) and Physician Response Unit (PRU). In response to Covid-19, the department has undertaken new initiatives with our partners at London Ambulance Service and NHS111 to provide the right care to patients at the right time. This involves rapid assessment of patients arriving to the department as well as virtual consultants prior to patients arrival.&lt;/p&gt;\n&lt;p&gt;The role of the Advanced Clinical Practitioner (ACP) is integral to the medical assessment, management and referral of patients presenting to the emergency department at the Royal London Hospital. The Royal London Emergency Department’s ACPs are embedded as an integral part of the emergency medical team, working alongside physician associates, doctors in training, clinical fellows and consultants to form a multidisciplinary medical team. The ACP shares the same responsibilities and opportunities as the equivalent clinical fellow.&lt;/p&gt;\n&lt;p&gt;Find out more about us you can follow us on Twitter @RoyalLondonHosp&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Matt Webb -&lt;strong&gt; Lead ACP&lt;/strong&gt; - matthew.webber@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal London Hospital, London", "postalCode": "E1 1FR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.059802"}}, "title": "Advanced Clinical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256923", "validThrough": "2020-11-19T23:59:59+0000"}