{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-30T16:00:42+0000", "description": "&lt;p&gt;12 month fixed term opportunity; Full time (37.5 hours) over 24/7 shift pattern.&lt;/p&gt;\n&lt;p&gt;Proposed Shift Patterns: 7am-3pm, 3pm-11pm, 11pm-7am to be confirmed&lt;/p&gt;\n&lt;p&gt;The University Hospitals of North Midlands NHS Trust (UHNM) is one of the largest and most modern in the country. We serve around three million people and we’re highly regarded for our facilities, teaching and research. Our mission to provide the very best health care includes recruiting the best people. Our goal is to be a world-class centre of achievement, where patients receive the highest standards of care and the best people come to learn, work and research.&lt;/p&gt;\n&lt;p&gt;Following an NHSI initiative to establish 29 Pathology networks across England the University Hospital of North Midlands is now working closely with Mid and East Cheshire NHS Trust to establish a North Midlands and Cheshire Pathology Service across Staffordshire, Mid and East Cheshire. We are looking to establish a new team to deliver Rapid Covid-19 testing to support our emergency admission pathways and other critical services across our pathology network.&lt;/p&gt;\n&lt;p&gt;Applications for 1-year fixed term positions are invited from hardworking, self-motivated and enthusiastic individuals to join our Microbiology diagnostic service. Our Rapid Covid testing team will receive full training on new analytical equipment and will be responsible for providing a 24/7 shift service to the four hospitals served by the pathology network. Staff will be expected to work across all four hospital sites: Royal Stoke, County Hospital, Leighton Hospital and Macclesfield. Candidates must therefore hold a full driving licence and be willing to drive to any of the 4 hospital sites as requested.&lt;/p&gt;\n&lt;p&gt;This role will involve working as part of the microbiology team to perform a range of tasks that contribute to the operation of the rapid molecular testing systems: routine operation of equipment, reagent management, device maintenance and operator training. The successful candidate will be able to develop excellent work relationships with the laboratory scientific team and service users. Applicants should work equally well within a team or independently and have good problem-solving skills.&lt;/p&gt;\n&lt;p&gt;Applicants will be expected to have a minimum of NVQ Level 3 in Clinical Laboratory Support or equivalent. You will also be able to demonstrate significant additional theoretical science knowledge or applied experience of working in a clinical laboratory.&lt;/p&gt;\n&lt;p&gt;The hours of work for this post will be 37.5 hours per week on a 24/7 hour shift basis.&lt;/p&gt;\n&lt;p&gt;Shifts will include early, late and overnight shifts and will include weekends and bank holidays on a rotational basis.&lt;/p&gt;\n&lt;p&gt;Please include in your supporting statement an explanation of what your understanding is of the role of an Associate Practitioner within a Microbiology Laboratory and why you would be suitable for this role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information/ please contact Kerry Rawlin, Lead Biomedical Scientist, on 01782 674274 or Kerry.rawlin@uhnm.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information/ informal visits please contact Kerry Rawlin, Lead Biomedical Scientist, on 01782 674274 or Kerry.rawlin@uhnm.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of North Midlands, Stoke-on-Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Microbiology Associate Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250850", "validThrough": "2020-11-15T23:59:59+0000"}