{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60058", "minValue": "60058", "unitText": "YEAR", "value": "£60,058 per annum inclusive of HCAS"}}, "datePosted": "2020-10-26T13:16:25+0000", "description": "&lt;p&gt;&lt;span&gt;Health Education England (HEE) London aims to improve the health of our population, outcomes for patients and people’s experiences of care delivery through our leadership of workforce planning and development locally. We fully support excellence in health and social care through excellence in education and training. We are committed to being an exemplar of inclusive and authentic engagement, enabling innovative and productive partnership working through all of our Directorates.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Workforce Transformation Lead, you will be responsible for leading a portfolio of activities which delivers against HEE and local STP workforce transformation ambitions. The focus of the portfolio of the postholder will be Medical Workforce Transformation, working closely with the Postgraduate Deans on a variety of programmes including SAS doctors, clinical leadership and pathway-based programmes, for example urgent and emergency care; critical care; planned care; cancer. The portfolios of the Workforce Transformation Leads may change over time in response to HEE mandates, regional priority programmes and local priorities of our Integrated Care System People Boards. The post holder will work alongside a team of project and workforce specialists. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The nature of our workforce programmes necessitates the formation of strong relationships with external stakeholders across our ICSs; to help them determine their workforce needs and to harness their support in embedding workforce transformation programmes. The post holder will also work collaboratively with other Arms-length Bodies, education providers and other key partners to drive the delivery of strategies across the region, and to ensure the delivery of the agreed outcomes within set timescales. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be a workforce subject matter expert with project/programme management experience or a highly experienced programme manager with experience in workforce transformation, have experience of partnership working across a wide range of stakeholders and be an excellent communicator. You will have experience in leading and managing teams and a detailed understanding of the NHS environment and its challenges. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants will commence at the bottom of Band 8b with a full-time starting salary of £60,058, with a pay step increase after 5 years’ service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;&lt;span&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/span&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Hughes, Interim Deputy Head of Workforce Transformation&lt;/p&gt;\n&lt;p&gt;Email: Lisa.Hughes2@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 020 7125 7149&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stewart House, London", "postalCode": "WC1B 5DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5211", "longitude": "-.127467"}}, "title": "Workforce Transformation Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242608", "validThrough": "2020-11-09T23:59:59+0000"}