{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "66590", "minValue": "60587", "unitText": "YEAR", "value": "60587  - 66590  GBP per year"}}, "datePosted": "2020-11-06T15:08:20+0000", "description": "&lt;p&gt;As a key member of our CAMHS team you will help to deliver psychological support to young people and their families. This is a Tier 3 CAMHS team so you will see young people with a wide range of presenting concerns. Whatever the challenge, you’s be ready and willing to tackle it. Offering assessmenting and formulating intervention plans, making skilled evaluations and decision in partnership with other therapists, providing consultant and supervision to professionals within a specialist multi-disciplinary CAMHS team- all, and more, are part of this highly rewarding role.&lt;/p&gt;\n&lt;p&gt;To succeed you will need a good honours degree in psychology and a postgraduate Doctorate in Clinical Psychology, or equivalent as accredited by the BPS/HPC. Well also be looking for experience gained working in a CAMHS service and a commitment to developing advanced training in skills relevant to this specialty. Bring us all that, coupled with real enthusiasm and passion for what you do, and together we’ll thrive.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Dr Laura Birtwistle on 01534 445030.&lt;/p&gt;\n&lt;p&gt;In making an application for this role, you should note that the Government of Jersey is in the process of restructuring to modernise how we deliver public services. As we work to ensure we have the right structure for the future, we will also be reviewing our (HR) people policies and total reward structures (pay and other terms and conditions) to provide parity across all pay groups.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health and Community Services Jersey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135055"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Helier", "postalCode": "JE1 3QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "49.1833", "longitude": "-2.1"}}, "title": "Clinical Psychologist CAMHS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260283", "validThrough": "2020-11-27T23:59:59+0000"}