{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42481", "minValue": "36329", "unitText": "YEAR", "value": "£36,329 - £42,481 per annum (pro rata)"}}, "datePosted": "2020-11-03T11:32:06+0000", "description": "&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Public Health England (PHE) is an executive agency of the Department of Health and Social Care providing; strategic leadership, research, advice and support for Government, local authorities and the NHS in protecting and improving the nation’s health.&lt;/p&gt;\n&lt;p&gt;This vacancy exists within the Emergency Response Department of Public Health England (PHE), working in the Behavioural Science Team of the Emergency Response Department Science and Technology Group (ERD S&amp;T).&lt;/p&gt;\n&lt;p&gt;The Emergency Response Department is a multidisciplinary environment that includes: infectious disease biologists and epidemiologists, mathematical modellers, behavioural scientists, specialists in geographic information systems, scientific computing, exercise and training managers, medical intelligence specialists and public health emergency response professionals. In partnership with others both within PHE and from outside, we collate data and information from across the world on new and emerging infectious disease threats including potential bioterrorist threats. This information is integrated with a wide range of other UK specific data in order to develop risk assessments and mathematical models and other IT/computer-based applications to assist in the design and delivery of emergency planning, training, exercising and response functions.&lt;/p&gt;\n&lt;p&gt;The post-holder will work across various ongoing projects within the Behavioural Science Team, in particular within our National Institute for Health Research (NIHR) Health Protection Research Units (HPRU) in Behavioural Science and Evaluation at the University of Bristol, and the Emergency Preparedness and Response (EPR) HPRU at King’s College London, in partnership with Public Health England. Working as part of an integrated multidisciplinary team and with external collaborators within and outside PHE, the post-holder will manage the day to day running of the projects and will ensure that scientific outcomes of the research programme are delivered to a high standard. They will work closely with other staff working on related projects and will be a key point of contact for project partners. They will join a multidisciplinary team conducting operational and behavioural research and will be expected to contribute to a range of other ongoing activities, including contributing to the public health emergency response functions of PHE.&lt;/p&gt;\n&lt;p&gt;The post will suit a post-doctoral behavioural scientist or psychologist with research experience in public health, health protection, emergency preparedness and response, or a related applied field. The post will involve working as part of an integrated multidisciplinary team and with external collaborators within and outside PHE. You will be a team player with a strong background in the behavioural and/ or social sciences, will have experience working within public health, health protection and/ or emergency response, will have experience in both qualitative and quantitative research methods, and will have experience of report writing and academic publication.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRichard AmlotJob titleHead of Behavioural ScienceEmail addressrichard.amlot@phe.gov.ukTelephone number01980 612 917&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Flexible, National", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "Research Fellow - Behavioural Science", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253761", "validThrough": "2020-11-17T23:59:59+0000"}