{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 per annum pro rata"}}, "datePosted": "2020-11-03T17:00:46+0000", "description": "&lt;p&gt;Homerton University Hospital NHS Trust is a provider of acute and community healthcare services to a relatively young and culturally diverse population in Hackney in East London.&lt;br /&gt;&lt;br /&gt;We are seeking to recruit a Junior Clinical Fellow (SHO level) doctors in Bariatric surgery and Emergency General Surgery at Homerton University Hospital. This role would be ideal for candidates who are not currently in training posts, but who nevertheless are planning a surgical career and are planning to sit the MRCS exam. It would also suit candidates who have recently passed the exam, but require further experience prior to moving to registrar level.&lt;br /&gt;&lt;br /&gt;Homerton University Hospital is a third of a mile from the 2012 London Olympic park. There is a variety of housing in the area, good state schools and a range of private schools. Hackney is one of London’s greenest boroughs, with beautiful parks and open spaces.&lt;br /&gt;&lt;br /&gt;These will be 6 month fixed term posts with a view to becoming permanent.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Informal enquiries are welcome. For further details / informal visits contact:&lt;br /&gt;&lt;br /&gt;Ms Rachel Aguilo, Consultant Surgeon by email (rachel.aguilo@nhs.net)&lt;/p&gt;\n&lt;p&gt;OR&lt;/p&gt;\n&lt;p&gt;Charlotte Rowe, Service Manager - General Surgery by email (charlotterowe@nhs.net)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Homerton University Hospital NHS Foundation Trust, London", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Junior Clinical Fellow in Bariatric and Emergency General Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254872", "validThrough": "2020-11-11T23:59:59+0000"}