{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-06T15:28:42+0000", "description": "&lt;p&gt; NHS Northamptonshire CCG is looking for two new leaders, to become part of the Quality and Safeguarding Directorate. This is an exciting time to join us and manage the transition of All Age Adult Continuing Health Care (CHC) , Children and Young People’s( CYP)  Continuing Care ( CC), Individual Funding requests and Prior Approvals into the CCG.  The anticipated go live date for the new in-house CCG services is April 2021.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for promoting a culture of clinical excellence and service improvement, and will be pivotal in ensuring the safe and effective delivery of a high quality continuing care process for children, young people and their families within Northamptonshire.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for developing new and innovative practices and systems responding to emerging knowledge and techniques by interpreting and implementing national and local drivers for Children and Young People’s Continuing Care.&lt;/p&gt;\n&lt;p&gt;As we move into an All Age Adult CHC and Children and Young People’s CC service, this is an exciting time to for a children and young people’s clinical lead to be able to provide strong clinical oversight, leadership and management for the children and young people continuing care team to improve service performance, enhance child and family experience and improve clinical outcomes.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with senior clinical and safeguarding leads to contribute to the wider children’s health and care system, working with partners within education and children’s social care to ensure there is a multi-agency understanding and approach across the partnership. The post holder will ensure there is  collaborative working with the Local Authority Children’s Trust partners to deliver safe, personalised packages of care for children and young people with complex needs, and their families.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an innovative, dynamic and creative person with experience working in children’s health services, and who is ready for a new challenge.&lt;/p&gt;\n&lt;p&gt;As this is a varied role; the post holder will need to be flexible in working across different organisations and travelling across the county as required.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128417.png", "name": "NHS Northamptonshire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128417"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Francis Crick House, 6 Summerhouse Rd, Moulton Park Industrial Estate, Moulton Park, Northampton NN3 6BF", "postalCode": "NN3 6BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2768", "longitude": "-.872766"}}, "title": "Children &amp; Young People’s Continuing Care Clinical &amp; Operational Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260368", "validThrough": "2020-11-20T23:59:59+0000"}