{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum"}}, "datePosted": "2020-10-29T09:30:51+0000", "description": "&lt;p&gt;Applications are invited for the position of Specialty Doctor within our thriving Ear, Nose &amp; Throat Department at Kingston Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to work within the department where our multidisciplinary team (medical consultants, specialty doctors, registrars, audiologists, speech and language therapists in voice and a team of nurses) see around 15, 000 patients per year. We offer a full range of specialist care services including outpatient clinics, admitted care and an acute referral service for ENT emergencies.&lt;/p&gt;\n&lt;p&gt;This is a substantive appointment based in the ENT &amp; Audiology Department at Kingston Hospital. The post is full time, 10 PA’s per week with no additional on-call rota participation.&lt;/p&gt;\n&lt;p&gt;The weekly timetable includes responsibility for the day to day management of ENT patients, carrying out assessment and treatment of patients in the urgent SOS clinics and specialist out-patient clinics. In addition the post holder may contribute to the management of in patients admitted to the hospital, with the opportunity to support delivery of surgical lists, cover for the emergency tracheostomy surgical list and clinical supervision for extended scope audiology practitioners.&lt;/p&gt;\n&lt;p&gt;The service-line has regular educational meetings and actively supports opportunities for personal development of appointed staff. The post holder will be expected to participate in the postgraduate teaching of medical staff and undergraduates attached to the Trust and in the training of all grades of staff.&lt;/p&gt;\n&lt;p&gt;Candidates must hold full registration and license with the GMC.&lt;/p&gt;\n&lt;p&gt;This post is open to applicants who do not require a certificate or sponsorship to take up employment in the UK. Applicants who do require a certificate of sponsorship will be considered if no suitable UK, EEA National or those with verifiable permission to work in the UK are identified for the post.&lt;/p&gt;\n&lt;p&gt;Applications from those unable, for personal reasons, to work on a whole time basis or a job share basis will be considered.&lt;/p&gt;\n&lt;p&gt;Kingston Hospital provides a full range of diagnostic and treatment services. The hospital supports some 320,000 people in the surrounding area including the boroughs of Kingston, Richmond, Roehampton, Putney and East Elmbridge. Kingston Hospital is one of the largest employers in the region and employs over 3,700 staff across the widest range of careers. We are proud of our reputation as the largest single site District General Hospital in London and our Maternity Unit is the second biggest in London. In a National survey, we were rated as the Best Maternity Service in London by, the National Health Watchdog, the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Abbad Toma, Consultant Otolaryngologist and Clinical Lead for ENT, abbad.toma@nhs.net 020 8934 2088&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston Hospital NHS Foundation Trust, Kingston upon thames", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Speciality Doctor in ENT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247733", "validThrough": "2020-11-08T23:59:59+0000"}