{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19373", "minValue": "18005", "unitText": "YEAR", "value": "£18,005-£19,373 per annum"}}, "datePosted": "2020-10-28T19:52:32+0000", "description": "&lt;p&gt;Applications are invited from well-motivated individuals to work in a busy clinical microbiology laboratory based in a large NHS Trust. Well-equipped, with ISO: 15189:2012 accreditation and we have training status with the Health Care Professions Council (HCPC). We have a workload in excess of 700,000 tests per annum and offer a comprehensive range of tests in bacteriology, serology and virology, including molecular. In addition the department is testing around 3600 samples per week for Molecular CoVID19 and 1000 serology specimens.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be working in a modern, well-equiped facility performing a wide range of tasks providing support to Biomedical Scientists and Associate Practitioners in the provision of a high quality and efficient diagnostic Microbiology service. This will require you to have good hand to eye co-ordination, attention to detail and manual dexterity. Duties include assisting with the receipt and processing of clinical specimens, computer data entry and occasional use of autoclaves for the disposal of waste.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A sound general education (GCSE or equivalent in five subjects including English Language, Maths and preferably a Science subject) and experience with electronic handling of data are required. The post would suit someone who is a team player with good organisational skills. There is an element of manual handling involved.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Previous laboratory experience or an interest in biology is desirable and full training will be provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working hours: 37.5 per week – the department operates core shifts (09:00-17:00) early shifts (08:00-16:00) and late shifts (12:00-20:00) as well as covering weekends and bank holidays. The post will rotate across all of these shift patterns.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Closing Date: 11th November 2020&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Medical Laboratory Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247555", "validThrough": "2020-11-11T23:59:59+0000"}