{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pa pro rata"}}, "datePosted": "2020-10-26T12:46:50+0000", "description": "&lt;p&gt;We are looking for a dynamic, enthusiastic and highly motivated Pharmacy Assistant to be join our Pharmacy team .&lt;/p&gt;\n&lt;p&gt;The role comprises of 2 days at St Michaels Hospital in Hayle and 3 days at Royal Cornwall Hospital and to cover West Cornwall Hospital when needed.&lt;/p&gt;\n&lt;p&gt;Duties are varied and will include visiting wards and departments to review and order their ward stock.&lt;/p&gt;\n&lt;p&gt;You will provide customer care at the Pharmacy hatch and carry out dispensing for inpatients and outpatients across a wide range of specialties, putting the patient first and delivering the best possible service.&lt;/p&gt;\n&lt;p&gt;Applicants should have great communication and interpersonal skills; be motivated, flexible, and adaptable and be able to work well in an environment of change and transition. You will also be expected to develop good working relationships with other staff within the Pharmacy and the Hospital.&lt;/p&gt;\n&lt;p&gt;The post-holder will need to have an eye for detail and produce work to the required standard whilst meeting deadlines. You will need to have the ability to adapt to new situations, be hard working, reliable and keen to learn.&lt;/p&gt;\n&lt;p&gt;You will need to have a good standard of education and GCSEs at Grade C or above in Maths and English and a full NVQ 2 in Pharmacy Services.&lt;/p&gt;\n&lt;p&gt;This is a full time post working 37.5 hours before week. You will work 8.30 till 5 for 4 days of the week and 10.30-7 for 1 day of the week.&lt;/p&gt;\n&lt;p&gt;We actively support the development and training of all our staff, to achieve and succeed&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kimberley Olds, Chief Technician, on 01872 255997&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Pharmacy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242510", "validThrough": "2020-11-08T23:59:59+0000"}