{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-29T14:15:31+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for an Occupational Therapist to join us!!!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you an enthusiastic, motivated and hard-working individual? Are you looking for a new challenge and an opportunity to be involved in a dynamic, forward-thinking, and exciting team?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If the answers are yes, then we would love to hear from you!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;** We are offering £2,500 Golden Hello Payment to external candidates from outside of Hampshire and Isle of Wight! **&lt;/strong&gt;&lt;span&gt; &lt;/span&gt;&lt;strong&gt;- Relocation package is also available!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Southern Health NHS is one of the largest mental health trusts in England, and we are constantly expanding our teams!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Right now, our Community Mental Health Team (CMHT) at the Bridge Centre in Basingstoke is looking for occupational therapists to join them!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The CMHT is a lively, dynamic and busy multi-disciplinary team which provides care coordination and recovery focused care for individuals with complex and challenging mental illness.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and enthusiastic Occupational Therapist Band 6 to join our Adult Community Mental Health Team. The post involves providing professional support to working age adults with severe, complex, and enduring mental illness. The clinical skills needed for success could have been gained in a wide variety of settings and there is the scope to use a wide breadth of core OT skills for assessment, therapeutic intervention and rehabilitation to maintain people living at home, offering advice and guidance to support and empower natural support networks. Expertise and understanding of the presentation of mental health conditions and co-morbidity in adults is essential. We are looking for someone who have a genuine interest in working with adults with severe, complex, and enduring mental illness including Schizophrenia, Bipolar, Depression, Personality Disorder, and Anxiety. You should be able to demonstrate a real commitment to providing high quality and compassionate care to patients and their families/carers.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will play an important role in delivering excellent care for our service users, and working as part of the team to provide the right support and assistance to our service users in their recovery.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         Leading the process of planning and coordinating service user care and undertaking interventions in line with agreed care plan.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         Delivering higher level intensity community interventions as part of the integrated Shared Care model&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         Working in a manner which is helpful to the service user and the referrer, based on principles of recovery, personalisation and choice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         Working with individuals in the least restrictive manner possible.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         Working in a service which may include some weekends and bank holidays.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;·         You will have previous experience in working with people with mental illness, and will be able to evidence effective team working.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;Ability to drive and use of a car for work purpose is essential in this role.&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our Trust offers continuous development for all of our staff, as well as regular supervision and annual appraisal, to ensure you achieve your personal goals and assist you in personal and professional development. Regular support from your line manager is also provided to ensure you have the opportunity to develop your skills further.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information on this role, please contact Ian Whaites - Nursing Team Leader on 01256 316300&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke", "postalCode": "RG21 7PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2615", "longitude": "-1.08474"}}, "title": "Occupational Therapy Specialist Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248650", "validThrough": "2020-11-26T23:59:59+0000"}