{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T15:31:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Hepatobiliary (HPB) Theatres at the Leicester General Hospital (LGH) are recruiting! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to be part of the team who will be one of the first services to reconfigure as part of our 450 million pound investment to improve our services across UHL? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you hard working and patient focused? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have experience in theatres and enjoy major surgery, take pride in delivering gold standard life saving care? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If so apply now!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;University hospitals of Leicester (UHL) are going through an exciting period of change. We are reconfiguring our services to improve our patient experience; as well as providing better working environments for our exceptional and hardworking staff. HPB relocating to the Glenfield site (GGH) is one of the first elements of reconfiguration for our Theatre Services. This is a unique chance to experience both the LGH and the GGH and be part of the pioneering team that will lead the way during the initial stages of LGH Theatre’s relocation to the Glenfield. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently seeking highly motivated registered Nurses and Operating Department Practitioners; with excellent communication skills to join our theatre teams, in providing outstanding care. You will be a registered nurse or ODP with interest in a career within the peri-operative care setting. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;UHL is one of the UK’s biggest teaching hospitals, employing over 12,000 staff, and performing over 56,000 operations per year. At present we have over 46 Theatres across the 3 hospital sites; delivering elective and emergency surgery. We cover a variety of surgical specialities including Paediatrics, General surgery, Breast Surgery, Cardiac, Thoracic, Max Fax, Plastics, ENT, Orthopaedics, Vascular, Colorectal, HPB, Renal and Urology, Gynaecology, Obstetrics, ophthalmology, Day Case and dedicated Emergency Teams.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate must be able to demonstrate that they are empathetic, strong willed, professional and caring with a friendly bedside manner; and should be committed to developing within the HPB Service and being part of the planned move over the Glenfield Hospital in 2021.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;UHL offers an exciting and supportive environment to Registered Nurses or Registered Operating Department Practitioners and we are invested in developing your career as a theatre practitioner!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We offer a supportive learning environment which includes supernumerary status while achieving competencies. We also provide a 6 week supernumerary preceptorship package available for newly qualified staff. Dedicated clinical skills and practice development staff are available for bespoke clinical and theoretical training to enhance knowledge and skills enabling you to be the best theatre practitioner you can be!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additionally we offer an in-house anaesthetic course, access to learning beyond registration degree modules, and support for re-validation and leadership development; furthermore, we pride ourselves in being the flagship department for the band 5/6 and 6/7 development pathway course; which empowers&lt;/strong&gt; &lt;strong&gt;you to develop the skills needed to progress to higher bandings with more varied roles within UHL.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 16-November-2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Joanna Nikolic, Recruitment Lead:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt; joanna.nikolic@uhl-tr.nhs.uk&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;0116 258 3487&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester Royal Infirmary, Leicester General Hospital &amp; Glenfield Hospital, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Theatre Practitioner/Nurse (Various Teams)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252625", "validThrough": "2020-11-16T23:59:59+0000"}