{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-26T12:46:49+0000", "description": "&lt;p&gt;&lt;span&gt;Pain services and Anaesthetics in EKHUFT have an exciting opportunity to offer one post of 10 PA sessions for Consultant in Chronic Pain +/- anaesthetics. We are a progressive, forward thinking and dynamic team who continuously strives to ensure we are providing a safe, effective and person-centred service. These sessions are open for discussion for interested candidates who would wish to either work either as a full time Consultant in Chronic pain or to have these combined with Anaesthetic sessions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would also be interested in candidates with specialty interests in Paediatrics, cancer pain or other subspecialty interests including neuromodulation, though this is not an essential requirement. We have opportunities to be involved in research, teaching and simulation. We encourage and accommodate any other special skills that you may bring to the department to benefit the individuals and the trust professionally.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Pain Team carries out clinics and theatre lists across all the main hospital sites – the William Harvey Hospital at Ashford, the Queen Elizabeth the Queen Mother Hospital at Margate, the Kent and Canterbury Hospital at Canterbury and also at the newly built Buckland Hospital at Dover. The successful candidate will have one year advanced pain training or equivalent. FFPMRCA or equivalent exam qualification is desirable and be on the Specialist Register or within six months of a Certificate of Completion of Training at the time if interview.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;EKHUFT boasts active post-graduate medical centres with fully stocked libraries, and a comprehensive teaching programme. Personal development is encouraged, as we are keen for individuals to pursue and develop special interests.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Kent is ideally suited for access into London and as a gateway to Europe. There are many areas of unspoilt countryside and some quiet secluded beaches as well as the main centres of population. Regular, high speed, train services and the M2 and M20 motorways provide easy access to London. The Continent is within immediate reach through the Channel Ports and Channel Tunnel. East Kent also boasts an excellent variety of schools – private, state and grammar.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Neil Collighan, Trust Lead Clinician for Pain neil.collighan@nhs.net or Dr Vanessa Purday, Clinical Director for Surgery and Anaesthetic Care Group (vpurday@nhs.net) on 01227 783007.&lt;/p&gt;\n&lt;p&gt;Secretary - Dawn Martindale on 01227 783007 (e- mail dawnmartindale@nhs.net )&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent &amp; Canterbury Hospital/William Harvey Hospital/Queen Elizabeth the Queen Mother Hospital, Canterbury/Ashford/Margate", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Consultant in Chronic Pain", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242509", "validThrough": "2020-11-23T23:59:59+0000"}