{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43857", "minValue": "28593", "unitText": "YEAR", "value": "£17.01 - £26.09 per hour"}}, "datePosted": "2020-11-05T17:00:55+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;So, you’re eager to learn more about bank Anaesthetic, Scrub and Recovery Nursing opportunities at North Bristol NHS Trust. Here are some of the reasons we’re unique…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our Theatre department is the Major Trauma centre for the South West Region and a specialist regional centre for a number of services, including neurosurgery, renal, plastics, burns and orthopaedics. We host 34 Theatres, delivering both elective and emergency surgery, supported by 72 Medirooms.&lt;/li&gt;\n&lt;li&gt;An innovative concept in healthcare, our Medirooms combine the traditional recovery, day-case, same day and admission areas into a single patient room environment, specifically designed to enhance patient experience by improving the level of privacy and dignity that these areas were traditionally able to offer. Patients also benefit from continuity of case as they are admitted, recovered and discharged/transferred by the same Mediroom team.&lt;/li&gt;\n&lt;li&gt;We are based within the award-winning Brunel building at Southmead Hospital. Our state-of-the-art facilities have led us to obtain multiple awards, including the best designed large hospital internationally at the European Healthcare Design Awards.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;But it’s not just our Theatre department which is exciting; our Trust bank, NBTeXtra, is innovative, impressive and inclusive. Let us tell you a little more about it…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;As an NBTeXtra Nurse, you can work flexibly to suit your individual circumstances.&lt;/li&gt;\n&lt;li&gt;Our NBTeXtra Nurses’ are valued members of our team and have access to exceptional benefits; access to the NHS Pension scheme, free DBS and full training, induction and revalidation support. We also have competitive rates available:\n&lt;ul&gt;\n&lt;li&gt;£17.01* per hour – Weekdays&lt;/li&gt;\n&lt;li&gt;£21.55* per hour- Nights and Saturdays&lt;/li&gt;\n&lt;li&gt;£26.09* per hour- Sundays and Bank Holidays&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;For NBTeXtra staff working bank only, we can offer weekly pay. If you are working substantively within our Trust, you will be paid bi-weekly for shifts worked through bank.&lt;/li&gt;\n&lt;li&gt;You will increase your skill set by working within our multidisciplinary team to deliver the highest standards of care to patients. You will receive a paid induction to our Trust also, which includes two days on-site induction (social distancing observed) and e-learning accessible from home.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Right, that’s enough about us… let’s focus on you. Do you…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hold NMC registration with current license to practice&lt;/li&gt;\n&lt;li&gt;Have experience working in Anaesthetics, Scrub or Recovery within the last 18-24 months&lt;/li&gt;\n&lt;li&gt;Have a drive to work hard, enthusiasm and the ability to commit to a 2 week induction programme if successful&lt;/li&gt;\n&lt;li&gt;Have Right to Work in the UK.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role is also suitable for Operating Department Practitioners looking for work within Theatres. Please search (339-NBTX-RN-TH-07) to apply.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;So, are we right for each other? Here are your next steps…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Submit your application via this advert&lt;/li&gt;\n&lt;li&gt;Follow us on Twitter to join in the conversation and gain an insight into our Theatre teams:\n&lt;ul&gt;\n&lt;li&gt;@NBTAnaesthesia – North Bristol Trust Dept Anaesthesia&lt;/li&gt;\n&lt;li&gt;@TeamTheatresNBT – Team Theatres and Medirooms&lt;/li&gt;\n&lt;li&gt;@NBTNursing - Nursing, Midwifery and ODP Careers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;Contact us to find out more: nursing@nbt.nhs.uk&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Contact us to find out more: nurseavailability@nbt.nhs.uk or 0117 414 6000&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Bank - Theatre Nurse- Anaesthetics, Scrub, Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258665", "validThrough": "2020-12-14T23:59:59+0000"}