{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6 equivalent"}}, "datePosted": "2020-10-15T14:06:48+0100", "description": "&lt;p&gt;The Berkshire Healthcare Foundation Trust is urgently recruiting for a band 6 Senior Mental Health Practitioner to provide support to the Bracknell Community Mental Health Team for a minimum of six months for maternity leave cover.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;The post holder will be a member of the Bracknell Community Mental Health Team and as such will be mainly based at the CMHT and work within its hours of operation as set out in its operational policy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shifts/Hours:&lt;/strong&gt; Monday to Friday, 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 – example rate:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Day Rate - £20.35 per hour&lt;/li&gt;\n&lt;li&gt;Night/Sat Rate - £26.16 per hour&lt;/li&gt;\n&lt;li&gt;Sun/Bank Holiday Rate - £31.97 per hour&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key functions of the postholder:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The post holder will be responsible for the formulation, execution and evaluation of a care plan for a designated number of patients who may present with significant complexity within a multidisciplinary team&lt;/li&gt;\n&lt;li&gt;The post holder will ensure that each individual plan is developed in consultation/agreement with the patient and informed by the wider multidisciplinary team&lt;/li&gt;\n&lt;li&gt;The post holder will be responsible for identifying the specific interventions and skills required from the multidisciplinary team to deliver the plan of care and expected health/social outcomes which are evidence based and lead to recovery and minimise risk&lt;/li&gt;\n&lt;li&gt;The post holder will be responsible for devising a crisis plan with each individual patient and alerting the Urgent Care services as required&lt;/li&gt;\n&lt;li&gt;The post holder will operate within the principles of recovery and as such support each patient to develop a Wellness Recovery Action Plan/Recovery Star and reduce dependence on Secondary Mental Health Services enabling a planned integration into local community facilities and then discharge as part of the patient’s recovery plan&lt;/li&gt;\n&lt;li&gt;As an experienced mental health practitioner the post holder will direct and supervise junior staff and/or students and resources within their area of responsibility and take an active participation in clinical quality assurance and learning programmes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants should have a Degree in Mental Health Nursing or equivalent qualification/experience and previous knowledge and experience of working in a care environment and with service users who have complex mental health needs.&lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional, caring and reliable service you will have access to the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive, weekly pay&lt;/li&gt;\n&lt;li&gt;Access to the NHSP Stakeholder Pension&lt;/li&gt;\n&lt;li&gt;Paid annual leave and statutory maternity pay&lt;/li&gt;\n&lt;li&gt;Training and development opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Registration with NHS Professionals is subject to employment history and reference checking and offers of registration are therefore conditional upon the receipt of satisfactory references.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;For further information about the role, please contact &lt;/strong&gt;&lt;strong&gt;BerkshireHealthcare@NHSProfessionals.nhs.uk&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Church Hill House, Bracknell", "postalCode": "RG12 7FR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4007", "longitude": "-.759828"}}, "title": "Senior Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228520", "validThrough": "2020-11-30T23:59:59+0000"}