{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661"}}, "datePosted": "2020-10-27T14:46:24+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting new opportunity to work in the Anaesthetics Department has become available. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Blackpool Teaching Hospitals NHS Foundation Trust is a forward looking and innovative place to work and is committed to Values Based Collaborative Leadership and being a ‘Great Place to Work’. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Blackpool Teaching Hospitals NHS Foundation Trust was established on 1st December 2007. The Trust gained Teaching Hospital status and became Blackpool Teaching Hospitals NHS Foundation Trust in 2010. In April 2012 the Trust merged with community health services from NHS Blackpool and NHS North Lancashire as part of the Transformation of Patient Pathways Programme. We are now a Vanguard site with Extensive Care Services provided for the complex elderly population within Blackpool, Fylde and Wyre.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust serves a population of approximately 440,000 residents across Blackpool, Fylde, Wyre, Lancashire and South Cumbria and the North of England. It comprises Blackpool Victoria Hospital which is a large busy acute hospital and two smaller community hospitals – Clifton Hospital and Fleetwood Hospital and the National Artificial Eye Service. The Trust is also responsible for the provision of Community services such as District Nursing and Midwifery to a large geographical area, extending from Lytham St Annes in the South to Morecambe and Carnforth in the North. The Trust provides Tertiary haematology services for Lancashire and South Cumbria and is the site of the Lancashire Cardiac Centre which provides comprehensive cardiology and cardiothoracic surgical services for the adult population of Lancashire and South Cumbria (around 1.6 million people). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa LindsayAdditional contact information&lt;/p&gt;\n&lt;p&gt;Lisa Lindsay - Surgical Rota &amp; Theatre Coordinator - Anaesthetics on 01253 953499&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BVH, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Specialty Doctor Anaesthetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245024", "validThrough": "2020-11-17T23:59:59+0000"}