{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "40000", "unitText": "YEAR", "value": "up to £40,000 per annum DOE"}}, "datePosted": "2020-11-03T16:13:38+0000", "description": "&lt;h1&gt;&lt;strong&gt;Looking for something different?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Are you a self-starter who enjoys challenges where no two days are the same?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A unique opportunity has arisen for an experienced nurse to work within our Substance Misuse Team at HMP YOI Portland. As a creative team player you&#39;ll become part of a multidisciplinary service. This is an exciting time to support and motivate individuals to take control of their lives and make changes to overcome dependence on substances and move onto a life free of offending.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group, we are proud to support our employees with continued professional development opportunities and further education (subject to service needs). Staff are encouraged to develop skills and learning to contribute to the dynamic care needs of our specific client groups. Other benefits include cycle to work scheme, on-site gym facilities and free onsite parking at some locations&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About the job&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As a Senior Substance Misuse Nurse you will work as part of a multi-disciplinary team, whilst being a support and resource to less experienced members of staff. You must be able to carry out comprehensive assessments, initiate and review individual recovery plans and confidently communicate the full range of treatment options available to service users. You will work with individuals, on a 1-1 basis, providing advice and information. You will support in group work delivery and liaise with prescribers and Recovery Practitioners on clinical interventions. You will occasionally be required to support dispensing. You must have an understanding and commitment to recovery and a person centred approach.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;To be successful in this role, you will have:&lt;/p&gt;\n&lt;p&gt;• Experience of work with Substance Misusers&lt;br /&gt; • Experience of working autonomously&lt;br /&gt; • Ability to gain the appropriate level of service user consent&lt;br /&gt; • Sound clinical/substance misuse knowledge.&lt;br /&gt; • Assessment skills, including an understanding of risk assessments.&lt;br /&gt; • Awareness of health issues relating to substance misuse.&lt;br /&gt; • Ability to treat service users with respect and dignity at all times, adopting a culturally sensitive approach, which considers the needs of the whole person.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Qualifications&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;• 1st Level Registered nurse with current registration within the UK Nursing and Midwifery Council (NMC) - RGN/RMN&lt;br /&gt; • Evidence of Continuous Professional Development (CPD).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This is a full-time role, working 37.5 hours per week on a rota basis. The salary for this role is up to £40,000 per annum - dependent on experience.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/em&gt;&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portland", "postalCode": "DT5 1DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5499", "longitude": "-2.42177"}}, "title": "Senior Substance Misuse Nurse - HMP Portland", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254729", "validThrough": "2020-11-17T23:59:59+0000"}