{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 - £37,267 p.a."}}, "datePosted": "2020-11-02T14:45:46+0000", "description": "&lt;p&gt;Band 6 Ward Sister/Charge Nurse: Ward A9 Gastroenterology&lt;/p&gt;\n&lt;p&gt;This job is offering something completely different to others, you will be supported to develop both the gastroenterology unit and yourself while embracing an innovative inter-professional approach to patient centred care.&lt;/p&gt;\n&lt;p&gt;This is a 28 bedded mix sexed unit, with daily medical support. Nurses, physiotherapists and Occupational Therapists work within the team to provide holistic assessment of patients to enable us to help facilitate the assessment and liaison with service providers to ensure the safe discharge of our patients.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a Ward Sister/Charge Nurse to provide lead by example in delivering excellent patient centred care and ensure the safe and productive running of the ward. You will be vital in delivery of high quality, safe and effective care. This is a fantastic opportunity for an enthusiastic and dynamic individual who would like the opportunity to really make a difference.&lt;/p&gt;\n&lt;p&gt;The successful candidate will require a minimum of 2 years experience at a band 5 and have a passion for supporting a team to provide the highest standards of patient care. The post holder will be required to work a shift pattern covering days, nights and weekends.&lt;/p&gt;\n&lt;p&gt;To be a health care professional at MFT is about being part of something special, this is why we need amazing people like you – people who stand out from the crowd. We are looking for real professionals who are adaptable to new roles, responsive to change and always looking to improve and develop innovative practice. We can offer training, flexibility, friendliness and a caring environment in which to work and provide a large number of staff benefits.&lt;/p&gt;\n&lt;p&gt;Post-holders will also have access to the MFT Academy and LEAD Training Programmes, a unique and innovative concept to develop skillsets, which brings together all of the education and training activities of the Manchester University NHS Foundation Trust under one umbrella. Our commitment is further reinforced by our robust Trust Nurse Revalidation Programme – offering an e-portfolio and dedicated individual support.&lt;/p&gt;\n&lt;p&gt;MFT is a major acute teaching Trust recognised as a Centre of Clinical Excellence and provides a wide range of health services to the areas of South Manchester, South Trafford, North East Cheshire and West Stockport. We recruit staff that are open, honest and focused on striving for excellence, having built an enviable international reputation on five unwavering principles for clinical excellence, research and development, teaching, learning and for treating patients with compassion, respect and dignity.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namelian hodgesJob titleMatronEmail addresslian.hodges@mft.nhs.ukTelephone number0161 291 2146&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Ward Sister/Charge Nurse - Gastroenterology (Ward A9)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252486", "validThrough": "2020-11-17T23:59:59+0000"}