{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum, inc HCA"}}, "datePosted": "2020-11-04T10:46:02+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The NIHR / Wellcome, King’s Clinical Research Facility (CRF) on the Denmark Hill Campus of King’s College Hospital seeks to appoint a Research Technician. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an experienced Research Technician for our purpose built CRF that encompasses an Experimental, Commercial Clinical Trials Facility and a Cell Therapy Unit.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This exciting post reflect NHS and academic research collaborations between King’s College London, King’s College Hospital, the Institute of Psychiatry and the South London and Maudsley Hospitals NHS Trust which come together under the Academic Health Sciences Centre (King’s Health Partners); a centre of academic excellence. The appointee will be working under the direction of the Lead Nurse and CRF Manager. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This position is to cover Monday to Friday and some weekends and occasional nights. Flexibility to accommodate trials will be required. Excellent communication skills, both written and verbal are essential. Enthusiasm and commitment to work within a multidisciplinary team with patients and healthy volunteers in a dedicated research setting are necessary, whilst maintaining a high level of attention to detail.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You should be educated to ‘A’ Level within a science subject or have equivalent experience, along with working knowledge of ICH GCP guidelines and the ability to follow and translate your learning. Venepuncture and cannulation skills are essential.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Noah Yogo&lt;/p&gt;\n&lt;p&gt;Job title CRF Lead Nurse&lt;/p&gt;\n&lt;p&gt;Email address nyogo@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 020 3299 1851&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Clinical Research Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255429", "validThrough": "2020-11-18T23:59:59+0000"}