{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51000", "minValue": "51000", "unitText": "YEAR", "value": "Up to £51,000 DOE"}}, "datePosted": "2020-10-30T14:30:26+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Looking for a job opportunity within prison healthcare?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you looking for a new and rewarding role and want to develop your management skills in an environment where no two days are the same then this could be the new job for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;HMP Wormwood Scrubs is a category B men&#39;s prison, located within the London Borough of Hammersmith and Fulham, in West London.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About the Job...&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nursing in prison is never dull or predictable. On any given day the skills you use may be similar to those you need working in health promotion or A&amp;E, alternatively you may be supporting people to manage their mental health or substance misuse. It’s this variety that keeps things fresh and stimulating. Every day will bring new challenges and new experiences. But at the same time, you’ll have all the support you need to deliver the best care possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role will be an experience like no other, requiring a diverse and mixed nursing skills and background. One minute you could be delivering a nurse led clinic and the next you are attending an emergency response.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be expected to work alongside the Deputy Head of Healthcare in the development and delivery of high quality responsive services to service users who require access to health services within HMP Wormwood Scrubs ensuring compliance with statutory and mandatory requirements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Requirements...&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be a qualified Registered General Nurse with a real passion for developing your clinical skills in an environment that is ever changing. You’ll have a flexible approach working within a team that encourage new ideas and opinions on how to improve the service. Management experience is a necessary requirement for the role.&lt;/p&gt;\n&lt;p&gt;If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Salary and Benefits…&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The salary range is up to £48,500 per annum - dependent on experience. This is a full-time vacancy, working 37.5 hour per week. We welcome informal visits to the prison but these must be booked in advance, please contact Wendy for more information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Practice Plus Group benefits include training &amp; development opportunities, 2-5% company contributory pension scheme, 25 days annual leave plus 8 public bank holidays, staff well-being, access to bank hours, CPD, re-validation, cycle to work scheme, on-site gym facilities and free onsite parking at some locations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are also proud to support our employees with continued professional development opportunities and further education subject to service needs...&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About Practice Plus Group…&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Practice Plus Group is the Health in Justice market leader, providing healthcare services to offenders across the country.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The circumstances that bring people to prison are also complex and varied, our wellbeing approach adopts the premise no single factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and employment is subject to receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "N7 8TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5442", "longitude": "-.116957"}}, "title": "Primary Care Clinical Lead - HMP Wormwood Srubs", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250579", "validThrough": "2020-11-15T23:59:59+0000"}