{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26997", "minValue": "25590", "unitText": "YEAR", "value": "£25,590 - £26,997 / Band 4"}}, "datePosted": "2020-11-04T23:31:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Trainee Education Wellbeing Practitioner (EWP)&lt;/strong&gt;&lt;br /&gt;Salary: £25,590- £26,997 per annum (AfC roles), NHS Band 4 (NHS roles) | Based in Kingston | Fixed-term (12 Months) | Full time (36 to 37.5 hours per week)&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;br /&gt;In line with the government’s priority to increase access and availability of mental health and wellbeing support for children and young people, the new Education Mental Health Practitioner (EMHP) role is an exciting opportunity to deliver evidence-based early interventions for children and young people, working across both educational settings and healthcare sectors in England.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Employing Bodies - &lt;/strong&gt;Please note that there are two employing bodies for these roles. 8 positions will be employed by Achieving for Children, the remaining 4 by the&lt;/em&gt;&lt;em&gt;South West London &amp; St George&#39;s NHS Trust.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a total of 12 graduate-level practitioners to provide guided self-help Cognitive Behavioural Therapy (CBT) and parenting interventions. These posts are salaried at NHS Agenda for Change band 4 and fully funded for a one-year post-graduate diploma in Children’s Mental Health and Wellbeing through Kings College London, a centre of excellence for children’s mental health learning. Further intensive supervision and on the job training will be provided by an experienced supervisor within each team. There will be an expectation for trainees to continue in post on successful completion of the one year training, with a salary increase to NHS Band 5 scale for the second year onwards.&lt;br /&gt;&lt;br /&gt;Successful candidates will be employed on a full-time basis within a Mental Health Support Team delivering individual, group and workshop mental health interventions within a borough-based cluster of schools. These three new Mental Health Support Teams will be based in Kingston, Richmond and Sutton. Each MHST works within a cluster of schools and offers a schools-based mental health service, as well as supporting the implementation of a Whole School Approach (WSA) to mental health across the cluster. Some travel between schools and base is to be expected but this can be managed by public transport, owning a car may be helpful but is not necessary.&lt;br /&gt;&lt;br /&gt;The eight Kingston and Richmond posts will be employed by Achieving for Children who currently run two Mental Health Support Teams (MHST) across the two boroughs. The established teams have good relationships with schools, strong CPD opportunities as they sit within a generic CAMHS service, and there is a strong peer support network across the boroughs. The MHST for both boroughs will focus on reducing health inequalities linked to deprivation and aim to enhance children and young people&#39;s resilience. The Kingston MHST has a specialist focus on improving health inequalities for BAME children and young people (especially the Korean population) and the Richmond MHST has a specialist focus on reducing self-harm and other risk-taking behaviours.&lt;br /&gt;&lt;br /&gt;The four Sutton posts will be employed by South West London &amp; St Georges NHS Trust. SWLSTG MH Trust currently runs six Mental Health Support Teams (MHST) across Merton, Sutton and Wandsworth, there are strong links between all the teams and a good peer support network across the Trust MHSTs. The Sutton MHST will have a specialist focus around Domestic Abuse and while the EMHP training year will focus on the university guided self-help models of training, from the second year the EMHP work will seek to integrate the standard models with a more trauma-informed focus.&lt;/p&gt;\n&lt;p&gt;During training, the post-holders will work under close supervision to gain experience across healthcare and educational settings to enable them to gain the level of competence required to deliver high- quality, evidence-based early interventions for children and young people experiencing mild to moderate mental health problems.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To be aTrainee Education Wellbeing Practitioner (EWP), you will be passionate about making a positive difference to the lives of children and young people as well as demonstrating the following points:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A good degree in Psychology or other appropriate subjects&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;li&gt;The ability to work cohesively within small teams&lt;/li&gt;\n&lt;li&gt;Motivation to learn and to be challenged&lt;/li&gt;\n&lt;li&gt;The ability to use feedback and adapt accordingly&lt;/li&gt;\n&lt;li&gt;Good organisational skills&lt;/li&gt;\n&lt;li&gt;Experience of working within a mental health setting and / or school pastoral care&lt;/li&gt;\n&lt;li&gt;Experience of working with children and an understanding of how to talk with them&lt;/li&gt;\n&lt;li&gt;Commitment to using data and relevant measures to assess clinical outcomes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;br /&gt;Applicants will need to be ready to start work in mid-January 2020 and posts cannot be offered to candidates unless they can guarantee this start date.&lt;br /&gt;&lt;br /&gt;Shortlisted candidates will also need to submit an application form to Kings College London for a place on the Diploma in Child and Young Persons Psychological Wellbeing Practice. The Kings College London application form details are attached to this vacancyand will need to be completed at the same time as your application for a post.&lt;br /&gt;&lt;br /&gt;Please apply online including a supporting statement addressing how you meet the criteria for this post detailing what skills, knowledge, experience and abilities you can bring to the role, as outlined in the attached role profile.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Please note – We reserve the right to close applications for this role early when a sufficient number of applications has been received. Candidates are advised to ensure they complete their application without delay to ensure they are considered.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;For any urgent queries about the posts please contact Dr Sarah Head, Counselling Psychologist &amp; MHST Lead from AfC, in relation to the Kingston or Richmond posts, on sarah.head@achievingforchildren.org.uk, or Dr Annika Clark, Consultant Clinical Psychologist, in relation to the Sutton posts, on annika.clark@swlstg.nhs.uk&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Advert Closing Date: 11th November 2020&lt;br /&gt;Provisional Interview dates: 17th, 18th and 19th November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;South West London &amp; St George&#39;s NHS&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Royal Borough of Kingston upon Thames", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130374"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston upon Thames", "postalCode": "KT1 1EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4078", "longitude": "-.306445"}}, "title": "Trainee Education Wellbeing Practitioner (EWP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256894", "validThrough": "2020-11-11T23:59:59+0000"}