{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 8"}}, "datePosted": "2020-10-08T13:17:54+0100", "description": "&lt;p&gt;We are a friendly, supportive and forward thinking London practice, which provides primary care services to a mixed demographic population of just over 10,000 patients.&lt;/p&gt;\n&lt;p&gt;We are now looking to recruit a dynamic and proactive full time Advanced Nurse Practitioner who can join our established &amp; friendly team and work collaboratively within the multi-disciplinary general practice team, providing support to the GP’s and practice team as required.&lt;/p&gt;\n&lt;p&gt;This is a developing role and would therefore, suit someone who can take an active part in developing and building this service.&lt;/p&gt;\n&lt;p&gt;As an experienced advanced nurse practitioner, you’ll be a vital addition to our clinical team and you should be comfortable in assessing, diagnosing, treating and discharging patients autonomously every day.&lt;/p&gt;\n&lt;p&gt;Together with the rest of the nursing team, you will be responsible for providing an excellent standard of patient care and health promotion to all who access our care services.&lt;/p&gt;\n&lt;p&gt;Prescribing is an essential requirement and career development is encouraged.&lt;/p&gt;\n&lt;p&gt;For further information, please contact the Practice Manager on 020 7476 2255&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "E16 3NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5126", "longitude": ".025299"}}, "title": "Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218453", "validThrough": "2020-11-30T23:59:59+0000"}