{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £ 30,615 per annum"}}, "datePosted": "2020-10-26T15:05:06+0000", "description": "&lt;p&gt;&lt;span&gt;The trust provides a full range of services across South Birmingham, East Birmingham, Solihull, Sutton Coldfield, Tamworth and South Staffordshire. This is delivered across the four hospital sites at the Queen Elizabeth, Birmingham Heartlands, Good Hope and Solihull Hospitals&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting time to join our Health Care Team at University Hospital Birmingham Foundation Trust. The recent acute Trust merger has led to further developments within our specialty becoming an extremely exciting place to work. Our vision is patients should be as happy and healthy as possible, living self-sufficient, independent lives, able to have choice and control over what they do and what happens for them.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We have a fantastic opportunity for newly qualified or experienced band 5 nurse practitioners to join our new team on ward 18 at Birmingham Heartlands Hospital. The ward has a multi-speciality approach in the care of non-surgical trauma patients. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ward consists of 21 beds plus 4 assessment trolleys for direct admission from the emergency department. We can offer a friendly environment and provide support in your clinical development. We have a specific Trauma clinical nurse educator who provides support and education to our nursing teams. We encourage staff to participate in development and educational opportunities including attending conferences and postgraduate training. Ward 18 will support the education and training of nursing students and trainee nurse associates. We encourage our staff to engage in their personal and professional development encouraging participation in specialist areas such as tissue viability and infection control. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate would be required to provide care on both days and night shifts including weekend however, we at University Hospitals Birmingham support flexible working and welcome applications from nurses seeking flexible working opportunities and family friendly working hours.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you feel that we are right for you to develop further in your career and become part of a strong team then please contact Tracey Barton on ward 18 for an informal discussion. 0121 424 2218.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Interviews to be held 16th / 17th November 2020 (via Video call)&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243046", "validThrough": "2020-11-08T23:59:59+0000"}