{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393"}}, "datePosted": "2020-11-03T11:16:47+0000", "description": "&lt;h1&gt;THERAPIES DIRECTORATE&lt;/h1&gt;\n&lt;p&gt;Band 7 HIGHLY SPECIALIST PHYSIOTHERAPIST&lt;/p&gt;\n&lt;p&gt;Respiratory Care and Pulmonary Rehabilitation&lt;/p&gt;\n&lt;p&gt;Permanent (37.5 hours/week. Please note 30 hours per week would also be considered)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the physiotherapy service at St George’s University Hospitals NHS Foundation Trust for an experienced and highly motivated individual to lead the Community Respiratory Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will have proven leadership skills in order to co-ordinate their team to provide a high standard of physiotherapy assessment, treatment and advice to respiratory outpatients including running pulmonary rehabilitation programmes, outpatient clinics and a domiciliary service. Note that many of these services are currently virtual or via telephone. The successful applicant will also manage their own specialist caseload of respiratory patients and maintain close working relationships with physiotherapy colleagues, referring clinicians and other disciplines within St George’s University Hospital’s NHS Trust, Wandsworth CCG, neighbouring CCG’s and Social Services as appropriate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In addition, the successful candidate will need to be able to take a lead role in the supervision, teaching and appraisal of physiotherapists, assistant staff, physiotherapy students and the MDT caring for patients with respiratory conditions. The post sits within a larger cardiorespiratory team which provides an inpatient service but there is no requirement for this post to cover on calls.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is essential that you have a minimum of 4 years post-registration experience, which must include at least 2 years in respiratory and at least 1 year’s NHS experience. We are strongly committed to evidence-based practice, professional and personal development as well as service development. There is a well-established in-service education programme and relevant postgraduate training is negotiable.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Please ensure that you read the job description and person specification before applying. Applicants will only be short listed if they give examples of how they meet all the essential criteria. Please note the post may close before the closing date if sufficient applications are received.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit, please contact Nikki Webster, Principal Physiotherapist (nikki.webster@stgeorges.nhs.uk)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Community Respiratory Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253692", "validThrough": "2020-11-29T23:59:59+0000"}