{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "38000", "unitText": "YEAR", "value": "Up to £38,000pa DoE"}}, "datePosted": "2020-11-06T11:43:11+0000", "description": "&lt;p&gt;&lt;strong&gt;‘Healing takes time and asking for help is a courageous step’&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you want to play an active role in the recovery process of those diagnosed with Personality disorder and/or Eating disorders? Are you ready to further develop and enhance your clinical skills? If so, we have an exciting opportunity and want to recruit a proactive OT to this Senior OT post (Band 6).&lt;/p&gt;\n&lt;p&gt;We would love you to join our friendly and supportive team at Cygnet Ealing, working between our Personality Disorder and Eating Disorder wards.&lt;/p&gt;\n&lt;p&gt;We are looking for a confident, enthusiastic and motivated person who is able to share our passion in providing the best possible care for our service users.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;5 reasons why you should make an application today…&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;We care passionately about people in our services, as well as the staff supporting them&lt;/li&gt;\n&lt;li&gt;Support with personal development, offering regular supervision and training opportunities&lt;/li&gt;\n&lt;li&gt;You will be a part of an experienced and varied multi-disciplinary team at Ealing, with a wide range of knowledge to draw from within the MDT (including OTs, Psychologists, Physiotherapists, Dieticians, Nurses and Psychiatrists).&lt;/li&gt;\n&lt;li&gt;Cygnet Ealing has a well-stocked OT craft room, a studio for activities as well as a newly refurbished rehabilitation kitchen that forms part of the therapy process. There is also a sensory room and outdoor area for further OT input.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;strong&gt;Post:&lt;/strong&gt;Occupational Therapist (Band 6)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base:&lt;/strong&gt;Ealing Hospital – Primarily based on New Dawn ward (Personality Disorder unit) as well as a small caseload on Sunrise ward (Eating Disorder unit)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible for:&lt;/strong&gt;The post holder will be the OT based on New Dawn ward (this ward has their own OTA) and will have a shared caseload on Sunrise ward, under the supervision of a Band 6 OT and Therapy Lead.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible to:&lt;/strong&gt; Therapy Lead on site (Ealing) and Regional Lead Occupational Therapist (London &amp; South East)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;40 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;Ealing, W5 2HT&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role please contact Daniel Mansaray, Therapy Lead DanielMansaray@cygnethealth.co.uk or our in house recruiter Hayleyvalentine@cygnethealth.co.uk.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Overview of site/Ward:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;New Dawn Ward is a specialist Tier 4 service, providing treatment, care and support for women with a personality disorder who are ready to engage in therapy. Our service can support women who have a diagnosis of personality disorder and who need either a short-term crisis intervention utilising a Dialectical Behavioural Therapy (DBT) model (i.e. emergency referrals) or a longer-term therapeutic treatment programme utilising the principles of DBT with skills coaching and individual therapy.&lt;/p&gt;\n&lt;p&gt;Sunrise Ward provides a highly specialised eating disorder service for women, including those with extremely low BMIs. Sunrise focuses on supporting service users to attain a healthy BMI and prepare for a return home.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Elements of treatment focused on include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Weight restoration and physical harm reduction through the institution of an appropriate meal plan.&lt;/li&gt;\n&lt;li&gt;Cognitive reconstruction via individual and/or group therapy to improve ego strength, conflict resolution, personal identity, and self-acceptance at normal body weight.&lt;/li&gt;\n&lt;li&gt;Psychosocial functional enablement via individual and/or group psycho-educative, creative, and experiential activities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As an Occupational Therapist, you will provide direct clinical care which will encompass OT assessments, treatment and management of patients within the service, according to the patient’s diagnosis and identified needs. This will be based upon findings from assessments including associated risks, in order to develop treatment plans accordingly.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;The Successful Candidate should be/have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A registered Occupational Therapist with the HCPC (Health Care Professions Council)&lt;/li&gt;\n&lt;li&gt;Experienced in the field of adult mental health&lt;/li&gt;\n&lt;li&gt;Working as a Band 5 or Band 6 Level&lt;/li&gt;\n&lt;li&gt;An understanding of Occupational Therapy process/interventions and can take a “hands on” approach&lt;/li&gt;\n&lt;li&gt;Able to effectively work within a team and supervise an OTA&lt;/li&gt;\n&lt;li&gt;Excellent communication and time management skills&lt;/li&gt;\n&lt;li&gt;Passionate about student education&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary- up to £38,000 DOE&lt;/li&gt;\n&lt;li&gt;Opportunities for CPD and to undertake further learning and development. For example: MOHO Case Formulation, specialist assessments and interventions, and a Sensory Integration Preceptorship programme.&lt;/li&gt;\n&lt;li&gt;Training days provided by highly experienced and renowned OT specialists such as Sue Parkinson and Éadaoin Bhreathnach.&lt;/li&gt;\n&lt;li&gt;On site clinical supervision and peer support and expert off-site supervision.&lt;/li&gt;\n&lt;li&gt;Bi-monthly OT CPD meetings focused on skill and strategic service development.&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;NHS Discount Cards &amp; Blue Light Card&lt;/li&gt;\n&lt;li&gt;Free parking &amp; meals on duty&lt;/li&gt;\n&lt;li&gt;Relocation packages offered&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There is a national network of over 150 OTs in the Cygnet Group within different specialisms including Forensic Practice, LD and ASD, Acute mental health, PICU, and inpatient CAMHS. Support is offered from these various sites should you require&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;br /&gt; The successful candidate will be required to undergo an enhanced DBS and reference check and an offer of employment will be subject to successful clearance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*Please note - speculative recruitment emails are not to be sent directly to our clinical staff, these need to go via our internal recruitment team. If speculative candidates are sent directly to a member of the clinical team, we will consider these candidates as our own*&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "22 Corfton Rd, Hanger Hill, London", "postalCode": "W5 2HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5212", "longitude": "-.297112"}}, "title": "Band 6 Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259463", "validThrough": "2020-11-27T23:59:59+0000"}