{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-01T15:17:01+0100", "description": "&lt;p&gt;Consultant in Respiratory Medicine&lt;/p&gt;\n&lt;p&gt;Cornwall is the county occupying the South Western peninsula of the British Isles. It extends from the river Tamar in the east to Lands End in the west. Three-quarters of its boundary comprises some of the most beautiful and spectacular coastline in the country, reflected in the facts that tourism is a major industry and that the population increases significantly during the summer holiday season.&lt;/p&gt;\n&lt;p&gt;Cornwall provides an outstanding quality of life and many opportunities for outdoor activities, with its sailing waters, surfing beaches and rugged costal pathways for walking and cycling to more relaxing pastimes as there is a thriving arts and theatre scene as well as an interesting variety of eating places, with fine dining provided by some of Britain’s world famous chefs; there is something to suit all tastes outside of hospital life.&lt;/p&gt;\n&lt;p&gt;The main hospital site is situated on the western edge of the city, with easy access to the A30, the main trunk road serving Cornwall, linking with the M5 at Exeter, and the A38 to Plymouth. Truro has excellent primary and secondary schools and is on the main railway line linking Penzance to Paddington. Newquay airport is twenty miles away with daily connections to many cities throughout the UK and abroad.&lt;/p&gt;\n&lt;p&gt;The Royal Cornwall Hospitals Trust is an independent NHS Trust formed in April 1992. It serves a population of approximately 400,000 people. The trust has 1,000 beds and covers three hospital sites. Most of the services are provided at the main Royal Cornwall Teaching Hospital in Truro. With some in-patient eldercare services, out-patient and day care services at the West Cornwall Hospital along with an urgent care centre and GP services. St Michaels provides largely surgical day care, out-patient and neurology rehabilitation services.&lt;/p&gt;\n&lt;p&gt;These two permanent Consultant posts are an expansion of our dynamic Respiratory Department which is part of the Division of Medicine, Emergency Department (ED) and West Cornwall Hospital (WCH), Royal Cornwall Hospitals NHS Trust. One is a replacement post and the other a new post. The post-holders will be joining a team of six consultant chest physicians and will be based at the Royal Cornwall Hospital, Truro taking the total to 8.&lt;/p&gt;\n&lt;p&gt;For further details please contact Dr Sarah Coulter, Specialty Lead, sarah.coulter1@nhs.net or 01872 253799&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Royal Cornwall Hospital is an Equal Opportunities Employer&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Respiratory Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916209077", "validThrough": "2020-11-16T23:59:59+0000"}