{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53168", "minValue": "53168", "unitText": "YEAR", "value": "Up to £53,168 per rota"}}, "datePosted": "2020-11-02T09:01:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Role:&lt;/strong&gt; Clinical/ Forensic Psychologist&lt;br /&gt; &lt;strong&gt;Salary:&lt;/strong&gt;Up to £53,168 pro rata&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; Up to 20 hours per week will consider 2 days at 16 hours &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term:&lt;/strong&gt;6 months(Mat cover starting from December 20)&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;Location: Meeko House, Wisbech just outside of Peterborough &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Cambian Group, the UK’s largest provider of specialist services in education, mental health rehabilitation, and learning disabilities, is looking for a dedicated, caring individual to join the company as a psychologist.&lt;/p&gt;\n&lt;p&gt;We offer excellent training and career progression opportunities as well as a variety of staff benefits.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Meeko House&lt;/strong&gt; is a specialist Ofsted Registered residential home for young people from the ages of 12-18 years with ongoing complex mental health needs and associated behaviours. The framework underpinning the clinical model is referred to as STEP incorporating a stabilization, strengthening and moving on phase.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role will involve the assessment, formulation, and treatment of young people’s psychological needs. You will be part of a multi-disciplinary team that includes speech and language therapy, occupational therapy, mental health practitioner, care, and education. As a senior member of the therapy team, the post-holder will be expected to contribute to service development at the college and work with other psychologists within the region to continually improve service provision&lt;/p&gt;\n&lt;p&gt;You will also learn from some of the most dedicated and inspirational people in our profession and just like our young people you will be learning all the time through our on-going mentoring and support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidate Profile&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To be successful in this role you will be excited by the Cambian vision and values and will relish an opportunity to make a difference. You will need to be a clear communicator, well-organised, confident and capable of managing a complex caseload in a demanding environment. Experience of supervising others and providing training to multi-disciplinary staff is required.&lt;/p&gt;\n&lt;p&gt;CAMHS experience is required.&lt;/p&gt;\n&lt;p&gt;Successful candidates will have to meet the person specification in order to be offered this post. Cambian is committed to Safeguarding and protecting the young people and service users within our care. All candidates will be subject to an enhanced DBS check and reference checks. Cambian is an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Note:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Successful candidates will need to meet the person specification in order to be offered this post.&lt;/p&gt;\n&lt;p&gt;Cambian is committed to Safeguarding and protecting the young people and service users within our care.&lt;/p&gt;\n&lt;p&gt;All candidates will be subject to an &lt;strong&gt;enhanced DBS check &lt;/strong&gt;and &lt;strong&gt;reference checks&lt;/strong&gt;. Cambian is an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130935.png", "name": "Cambian Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wisbech", "postalCode": "PE14 0LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6175", "longitude": ".147201"}}, "title": "Clinical Psychologist - Meeko House", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251374", "validThrough": "2020-11-16T23:59:59+0000"}