{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 per annum pro rata"}}, "datePosted": "2020-10-27T09:01:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Research Fellow in Haematology (4 posts available)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are pleased to announce this exciting opportunity to recruit 4 full time clinical research fellow positions to join the Department of Haematology at UCLH.&lt;/p&gt;\n&lt;p&gt;These posts are expected to start February 2021 for 12 months contract (subject to satisfactory progress within the first 6 months). The clinical research fellow will have 50% research time and 50% clinical time working at ST3+ level within the clinical haematology team at UCLH, which is one of the biggest haematology centres in Europe. We will be moving to a dedicated state-of-the-art hospital building with full electronic patient health record system in December 2020.&lt;/p&gt;\n&lt;p&gt;The appointee is will be a medical doctor (GMC registered) and is expected to have an interest in pursuing a career in haematology. Candidates who have completed Internal Medicine Training or equivalent who have completed full membership exams, and are seeking experience of haematology at registrar level are also encouraged to apply.&lt;/p&gt;\n&lt;p&gt;This advertisement does not meet the requirements for a Certificate of Sponsorship under Home Office regulations and therefore the hospital will not be able to offer sponsorship for this role. The selection process will include a panel interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Leandersson helen.leandersson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH, London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Haematology Clinical Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243750", "validThrough": "2020-11-08T23:59:59+0000"}