{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per anum"}}, "datePosted": "2020-10-19T15:52:34+0100", "description": "&lt;p&gt;&lt;strong&gt;Breast Unit - Clinical Advanced Practitioner &lt;/strong&gt;(37.5 hours per week)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of Clinical Advanced Practitioner to join the Breast Unit team. The post is predominantly based at University Hospital North Tees Breast Unit but involves working across all Trust sites and in the community setting.&lt;/p&gt;\n&lt;p&gt;The role provides support to the Breast Screening and Symptomatic Services Manager to deliver a high standard of clinical leadership. It is a 70% clinical role and 30% management. The duties are varied and include, but are not limited to; perform two advanced practice disciplines to the highest standard, assist in staff training of all aspects of mammography and advanced practice where applicable and contribute to both service and staff development, perform mammography in the screening and symptomatic service, deliver leadership to the clinical radiography team and contribute to quality improvement projects within the service and department.&lt;/p&gt;\n&lt;p&gt;The Breast Unit is a busy department working within both the National Breast Screening service and Symptomatic Breast service. We have a screening population of circa 170,000 clients plus a busy TeesWide symptomatic service.&lt;/p&gt;\n&lt;p&gt;The successful candidate would join an already established team. The structure within the senior team sees two Clinical Advanced Practitioner roles which work in unity. It is essential that the successful candidate demonstrates good communication and team work in order to maintain this.&lt;/p&gt;\n&lt;p&gt;Applicants must hold current HCPC registration and a post graduate qualification in breast advanced practice. The ability to work in a team and to communicate in a wide variety of settings is essential.&lt;/p&gt;\n&lt;p&gt;Interviews will be held on 17th December 2020 at University Hospital North Tees. Candidates invited to interview will be asked to deliver a 10 minute presentation, title will be provided on invitation to interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmanda FirbyJob titleBreast Screening and Symptomatic Services ManagerEmail addressa.firby@nhs.netTelephone number01642 624259Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you require further information please contact&lt;/p&gt;\n&lt;p&gt;Amanda Firby&lt;/p&gt;\n&lt;p&gt;Breast Screening and Symptomatic Services Manager&lt;/p&gt;\n&lt;p&gt;01642 624259&lt;/p&gt;\n&lt;p&gt;E mail: a.firby@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Tees and Hartlepool NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120670"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of North Tees, Stockton", "postalCode": "TS19 8PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5829", "longitude": "-1.34677"}}, "title": "Clinical Advanced Paractitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233009", "validThrough": "2020-11-16T23:59:59+0000"}