{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 8a"}}, "datePosted": "2020-10-27T17:09:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Professional Lead for Speech and Language Therapy.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;8a&lt;br /&gt; St Martins Hospital, Bath  &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;30 hours&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a &lt;em&gt;confident and motivated senior Speech and Language therapist &lt;/em&gt;looking to join an organisation focused on professional growth and development, whilst ensuring you feel valued each and every day?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As &lt;em&gt;Professional Lead for Speech and Language therapy &lt;/em&gt;within Virgin Care, BANES you will provide leadership and operational management of a large skill mix team, contributing to the strategic development and management of services for children and young people with Speech, Language and Communication Needs (SLCN) within Bath and North East Somerset.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will also work closely with the Head of Specialist Services to deliver the clinical strategy across children’s specialist services and will be responsible for delivering high standards of care, demonstrating achievement through quality and performance indicators.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will hold a recognised Speech and Language Therapy Degree Qualification or equivalent and a registered member of Royal College of Speech and Language Therapy as well as having significant experience as a leader working within children’s services&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will feel valued as a Professional Lead for Speech and Language therapy with Virgin Care, receiving access to exclusive rewards and benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt; AfC Band 8a.  &lt;/li&gt;\n&lt;li&gt;Flexible working to provide you with that true work / life balance&lt;/li&gt;\n&lt;li&gt;Access to Virgin Tribe - our staff benefits scheme which grants you access to premier offers and discount off all Virgin products including flights, holidays, gyms and media, along with regular competitions and giveaways.&lt;/li&gt;\n&lt;li&gt;Feel the difference fund - a £100,000 fund to bring ‘Feel the difference’ to life, giving every employee a chance to have their thoughts and ideas heard.&lt;/li&gt;\n&lt;li&gt;Access to MyWellness – a health and lifestyle platform covering mental health awareness and support, healthy recipes &amp; activity challenges&lt;/li&gt;\n&lt;li&gt;Access to bespoke career pathways and opportunities to continue your professional development including leadership and management apprenticeships.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Virgin Care partner with the NHS and local authorities, providing high quality care for more than 1 million people each year up and down the country. We are an ambitious, forward thinking and passionate company who strive to make a real difference to people and our colleagues. We re-invest all of the money we earn to improve the experience, deliver ambitious transformations and empower all of our colleagues to make the changes, no matter how big or small, that make a real difference.&lt;/p&gt;\n&lt;p&gt;So why not click apply to find out where your journey with Virgin Care can take you! If you’d like to discuss the role further, please contact &lt;em&gt;Alison Burge &lt;/em&gt;via email: &lt;em&gt;Alison.burge@virgincare.co.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Virgin Care is committed to safeguarding and protecting the children and young people that we work with. As such, all posts are subject to a safer recruitment process, including the disclosure of criminal records and vetting checks. We ensure that we have a range of policies and procedures in place which promote safeguarding and safer working practice across our services. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA2 5RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3578", "longitude": "-2.37292"}}, "title": "Professional Lead for Speech and Language Therapy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245541", "validThrough": "2020-11-10T23:59:59+0000"}