{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907- £30,615"}}, "datePosted": "2020-10-29T13:01:25+0000", "description": "&lt;p&gt;We are currently seeking a highly motivated and professional practitioner to join our expanding theatre department within the Division of Perioperative Care.&lt;br /&gt;&lt;br /&gt;At Salford we currently have 19 theatres over 2 floors covering Neurosurgery, Spinal Surgery, Renal, Pain Service, ENT, Neuro X Ray, MR Scan, General, Upper and Lower GI, Orthopaedic and we provide a dedicated 24 hour Emergency service. Within the wider NCA we have other theatre complexes and we are exploring rotational opportunities within these to support knowledge and skill development.&lt;/p&gt;\n&lt;p&gt;You will be proactive in providing a seamless service to all patients during their theatre journey and will have the ability to support all junior staff and students. There will be additional responsibilities that may be allocated by the team leaders, these will be done following discussion and completion of the trusts ‘Contribution Framework’ which is completed by all SRFT employees. &lt;br /&gt;&lt;br /&gt;You will need to demonstrate effective communication and be able to take charge of a theatre and in some cases the department when the need arises. &lt;br /&gt;&lt;br /&gt;You will be a Registered ODP or Qualified Nurse with an Anaesthetic Qualification and be able to demonstrate continued professional development.&lt;br /&gt;&lt;br /&gt;The off duty covers a 7 day week using early and late shifts running from 07:30 to 20:00 hours. Due to the nature of the specialities variation to shift patterns may be required; some rotation onto nights will be a future development. Shift patterns can be discussed at interview.&lt;br /&gt;&lt;br /&gt;We are committed to lifelong learning through our learning and development team.&lt;br /&gt;&lt;br /&gt;If you are interested in enhancing career and wish to work in a CQC ‘Outstanding’ rated hospital, and major trauma centre for Manchester we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, sexual preference, disability, nationality, religion, marital status, social back ground or trade union membership.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSteven LathamJob titleAnaesthetic Team LeaderEmail addresssteven.latham@srft.nhs.ukTelephone number01612064140Additional contact information&lt;/p&gt;\n&lt;p&gt;Steven Latham&lt;br /&gt;&lt;br /&gt;on 0161 206 4140&lt;/p&gt;\n&lt;p&gt;steven.latham@srft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Qualified Nurse/ Operating Department Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248438", "validThrough": "2020-11-12T23:59:59+0000"}