{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "32000", "unitText": "YEAR", "value": "£32 - £38k + enhancements (+£4k nuse allowance)"}}, "datePosted": "2020-11-02T16:22:51+0000", "description": "&lt;p&gt;We are looking for a &lt;strong&gt;Registered Mental Health Nurse (RMN)/Learning Disability Nurse (RNLD)&lt;/strong&gt; with a passion for delivering outstanding care.&lt;/p&gt;\n&lt;p&gt;You’ll be working 38.5 hours a week at &lt;strong&gt;Cygnet Hospital Ealing,&lt;/strong&gt; on New Dawn – Female Tier 4 Personality Disorder Service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Hospital Ealing&lt;/strong&gt; provides a welcoming, non-institutional environment, offering personalised treatment for service users with an eating disorder or personality disorder over two separate wards.&lt;/p&gt;\n&lt;p&gt;Apply now to enjoy excellent career prospects whilereaping the rewards of making a difference to others – every day.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Day-to-Day…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;• Produce outstanding written reports based on your nursing assessments and observations&lt;br /&gt;• Work closely with the management team to develop the service, audit, and improve quality&lt;br /&gt;• Attend all training and engage in CPD to further knowledge &amp; promote nursing&lt;br /&gt;• Under NMC guidelines, ensure that individual care plans are complete &amp; maintained collectively with residents, relatives and other healthcare professionals.&lt;br /&gt;• Administer prescribed medicines with Healthcare procedure and Healthcare Commission guidelines.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An experienced &lt;strong&gt;RMN/RNLD or Newly Qualified&lt;/strong&gt;with a current Pin Number, you’ll have…&lt;/p&gt;\n&lt;p&gt;• Open, compassionate, honest &amp; resilient&lt;br /&gt;• Capable to maintain documentation and undertake audits&lt;br /&gt;• Well informed of the Mental Health Act 1983 &amp; have an understanding of latest nursing practices&lt;br /&gt;• Able to deputise in a clinical lead role&lt;br /&gt;• Focused on patient recovery to monitor, manage &amp; reduce risk&lt;br /&gt;• Helping to empower &amp; support service user independence.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet? We’ll offer you…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;£32,000 - £38,000 per annum +£4,000 Location Allowance&lt;br /&gt; 10% of basic Salary for Night shifts&lt;br /&gt; 20% of basic salary for weekend shifts&lt;br /&gt; 30% of basic rate for nights on the weekend&lt;br /&gt; 66% of basic rate for bank holidays&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;Strong career progression and development opportunities within the region, including into further management roles&lt;/li&gt;\n&lt;li&gt;RCNi membership&lt;/li&gt;\n&lt;li&gt;Free meals provided on duty&lt;/li&gt;\n&lt;li&gt;Monthly reflective practice, support with revalidation &amp; CPD opportunities&lt;/li&gt;\n&lt;li&gt;Expert clinical supervision &amp; peer support&lt;/li&gt;\n&lt;li&gt;Employee referral scheme&lt;/li&gt;\n&lt;li&gt;50% of NMC registration renewal paid by Cygnet&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;Employee &amp; NHS discount scheme&lt;/li&gt;\n&lt;li&gt;Additional leave can be granted for a range of personal circumstances&lt;/li&gt;\n&lt;li&gt;Additional training and induction can be arranged&lt;/li&gt;\n&lt;li&gt;Bespoke career pathways&lt;/li&gt;\n&lt;li&gt;Company paid Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Smart Health Toolkit- Providing you with Fitness Programmes, Nutrition consultation and Health checks&lt;/li&gt;\n&lt;li&gt;Plus many more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Health Care&lt;/strong&gt; has been providing a national network of high quality specialist mental health services for 30 years.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location Information:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;At Cygnet Hospital Ealing&lt;/strong&gt;, the eating disorder service is nationally commissioned by NHS England, and has developed a nationwide reputation for treating those with the most complex of eating disorders. With the national tier 4 personality disorder service also on site, the unit has become renowned for effectively dealing with those with dual diagnosis, where the eating disorder is the presenting problem.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;New Dawn Ward &lt;/strong&gt;at &lt;strong&gt;Cygnet Hospital Ealing&lt;/strong&gt; is a 9 bed specialist Tier 4 service, providing treatment, care and support for women with a personality disorder who are ready to engage in therapy. New Dawn is one of a small handful of tier 4 personality disorder services, across the entire country, that is nationally specialist commissioned by NHS England.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Hospital Ealing&lt;/strong&gt; is in a leafy, residential area .The hospital building was once a house and has retained its homely feel, thanks to our welcoming, friendly staff and pleasant surroundings.&lt;/p&gt;\n&lt;p&gt;•Ealing is a 5 minute walk from Ealing Broadway (central line) station and bus station with&lt;br /&gt;•Excellent links to the M25 and central London.&lt;br /&gt;•There is a hub of restaurants, coffee shops and retail outlets 5 minutes’ walk from the site.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you care about making a difference – we want to talk to you!&lt;/p&gt;\n&lt;p&gt;Click the link to apply.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ealing", "postalCode": "W5 2HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5212", "longitude": "-.297112"}}, "title": "Mental Health / Learning Disability Nurse (RMN / RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252826", "validThrough": "2020-12-02T23:59:59+0000"}