{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 Per annum"}}, "datePosted": "2020-10-30T09:16:06+0000", "description": "&lt;p&gt;There is a vacancy for a Clinical Fellow, for a period of three months. The post of Senior Clinical Fellow is an excellent opportunity to gain experience in Intensive Care Medicine (ICM) within one of the North West’s largest teaching hospitals and would be suitable for applicants with a background in anaesthesia or another acute specialty.&lt;/p&gt;\n&lt;p&gt;The successful applicants will join a team of doctors providing resident cover for the seventeen bedded general intensive care unit. The unit has a longstanding reputation for training in ICM and has training recognition for nine Specialist Trainees with backgrounds in ICM, Anaesthesia and Medicine including two advanced level trainees and one ST3 in ICM.&lt;/p&gt;\n&lt;p&gt;This post is suitable for a candidate with no previous experience in intensive care medicine who has appropriate experience in a specialty which is complementary to ICM; either anaesthesia, medicine or emergency medicine. Study leave allowance will be in keeping with that of a Core Trainee.&lt;/p&gt;\n&lt;p&gt;The posts will provide experience in patient care for an interesting and varied case mix, including tertiary referral for major burns, vascular surgery, cardiology and respiratory medicine and will offer opportunities to be involved in teaching, audit, research and management in the intensive care setting. These posts are not recognised for training by the Royal Colleges. Applications from candidates wishing to work at less than full time will be welcomed. Full registration with the General Medical Council is required.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Jon HopperJob titleConsultant in Intensive Care MedicineEmail addressjon.hopper@mft.nhs.ukTelephone number0161 291 6420Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Jon Hopper&lt;/p&gt;\n&lt;p&gt;Intensive Care Unit&lt;/p&gt;\n&lt;p&gt;Acute Block&lt;/p&gt;\n&lt;p&gt;Wythenshawe Hospital&lt;/p&gt;\n&lt;p&gt;Southmoor Road&lt;/p&gt;\n&lt;p&gt;Manchester&lt;/p&gt;\n&lt;p&gt;M23 9LT&lt;/p&gt;\n&lt;p&gt;jon.hopper@mft.nhs.uk or christine.gooding@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel 0161 291 6420&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Senior Clinical Fellow in Intensive Care Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249451", "validThrough": "2020-11-16T23:59:59+0000"}