{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-04T17:45:39+0000", "description": "&lt;p&gt;The MFT Emergency Planning, Resilience and Response (EPRR) Team is responsible for ensuring the Trust achieves and maintains compliance with its responsibilities set out in the Civil Contingencies Act 2004, Health and Social Care Act 2012 and any associated regulations and guidance relating to emergency preparedness, resilience and response (EPRR), including NHS England’s core standards for EPRR.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join the team as a full time EPRR Officer. The post-holder will be responsible for the delivery of the Trust’s EPRR work programme which encompasses all elements of the Emergency Planning Cycle; including assessing risk, developing and maintaining plans, testing and validating plans and training and exercising key staff.&lt;/p&gt;\n&lt;p&gt;Applicants will have a background in EPRR and possess excellent communication and interpersonal skills with the ability to prioritise their workload and meet demanding deadlines. As an EPRR Officer, you will be flexible, resilient and have the ability to build strong working rapports. The post-holder will be passionate and enthusiastic to develop their skills and knowledge in the field and work as a team to continuously develop working practices. The post-holder will work within a team which has a wide range of expertise along with a culture of sharing and learning.&lt;/p&gt;\n&lt;p&gt;The post-holder will be based across the MFT footprint ensuring support for all Hospitals and Local Care Organisations.&lt;/p&gt;\n&lt;p&gt;For further information or an informal chat, please contact via email to arrange a call or visit:&lt;/p&gt;\n&lt;p&gt;Beth Warburton, EPRR Manager&lt;/p&gt;\n&lt;p&gt;beth.warburton@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBeth WarburtonJob titleEmergency, Preparedness, Resilience and Response ManagerEmail addressbeth.warburton@mft.nhs.ukTelephone number0161 701 5752&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cobbett House, Greater Manchester", "postalCode": "M13 9PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4679", "longitude": "-2.23322"}}, "title": "Emergency Preparedness, Resilience and Response Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256843", "validThrough": "2020-11-16T23:59:59+0000"}