{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "54318", "minValue": "46614", "unitText": "YEAR", "value": "£46,614 - £54,318"}}, "datePosted": "2020-10-20T15:33:47+0100", "description": "&lt;p&gt;&lt;strong&gt;We have an opportunity for an Gynaecology Oncology CNS to join our Cancer Services Team based at our Cancer Centre, across the road from The London Clinic’s main hospital in Central London, W1G (close to Regents Park &amp; Baker Street tube stations).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest independently owned non-profit hospital, with state-of-the-art facilities located on Harley Street. We have circa 1200 employees, a total of 8 premises, and we are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise.&lt;/p&gt;\n&lt;p&gt;Our main hospital spans 8 floors comprising of 234 beds and 10 theatres, including a Hybrid theatre and two minimally invasive and day surgery theatres. The Duchess of Devonshire Wing is our award-winning cancer centre, which includes state-of-the-art radiotherapy, chemotherapy suites and dedicated patient bedrooms&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Description&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with both gynae-oncology Consultants, and the nursing teams at TLC. This includes having a distinct level of responsibility to gynaecological patients and provide a comprehensive specialist nursing service to The London Clinic working within the multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full time, permanent position working 37.5 hours per week (Monday to Friday.)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The attractive salary range for this role is £46,614 - £54,318 (inclusive of London Weighting &amp; COLA) and will be dependent upon skills and experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits package&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer our permanent staff a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 25 day’s annual leave plus bank holidays, season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties &amp; Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide specialist knowledge, expertise and care to gynae-oncology patients, this includes optimal care for inpatients, outpatients and their families.&lt;/li&gt;\n&lt;li&gt;To assess, plan, implement and evaluate all aspect of the patient’s physical, psychological, and social needs, including HNA tool completion.&lt;/li&gt;\n&lt;li&gt;As a key worker, provide gynae-oncology patients, their families and carers with a point of contact from diagnosis, through investigations and treatment.&lt;/li&gt;\n&lt;li&gt;Provide support to patients and their families during their diagnosis, ensuring that they have information to help them make informed decisions regarding their treatment.&lt;/li&gt;\n&lt;li&gt;Promotes self-management, undertaking risk stratification to determine those who can self-manage, following education, those who will need guided support to self-manage and those who will require on-going, face to face support&lt;/li&gt;\n&lt;li&gt;Monitor patients on an ongoing basis, to evaluate outcomes and adjust nursing care practice to ensure optimum co-ordination and delivery of care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;This job description is intended as a general guide to the post, but it may change in line with the needs of the department or at the request of the line manager.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills &amp; Experience&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Registered general nurse&lt;/li&gt;\n&lt;li&gt;Relevant post registration  experience, at a G-grade level or above in cancer or relevant speciality&lt;/li&gt;\n&lt;li&gt;Minimum of 3yrs experience in gynae-oncology care or area of relevance&lt;/li&gt;\n&lt;li&gt;Previous involvement in the development, implementation and audit of clinical guidelines and standards&lt;/li&gt;\n&lt;li&gt;Ability to work on own initiatives, unsupervised&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;The successful applicant’s offer is subject to relevant DBS, Occupational Health and Reference Checks respectively, alongside standard Right To Work Checks.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "Clinical Nurse Specialist - Gynaecology Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235068", "validThrough": "2020-11-29T23:59:59+0000"}