{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Rates - Dependent upon experience"}}, "datePosted": "2020-11-06T11:22:25+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you seeking a challenge? &lt;/em&gt;&lt;/strong&gt;An exciting opportunity has arisen for an experienced Practice Nurse to join our expanding, friendly skilled nursing teams within Modality Partnership AWC.&lt;/p&gt;\n&lt;p&gt;We have a permanent, full time vacancy available within the Craven area, these practices include; Crosshills Group Practice, Fisher Medical Centre and Silsden Medical Practice.&lt;/p&gt;\n&lt;p&gt;These positions would suit Practice Nurses with experience in long-term condition management. We offer a competitive salary and an NHS pension.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;***PREVIOUS APPLICANTS NEED NOT APPLY***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Modality Partnership AWC are a group of well-established practices within the Airedale, Wharfedale &amp; Craven area and we pride ourselves on providing excellent care. We joined with the Modality Partnership, whose vision of excellence and innovation matches our own, in order to work more effectively at scale, and provide even better services for our patients.&lt;/p&gt;\n&lt;p&gt;Modality Partnership represents a new and innovative way of providing and organising general practice. It is a ‘Super Partnership’, and moves away from a traditional small business approach to a larger GP-led model. This creates opportunity to expand the range of primary and secondary care services delivered, and provides many more benefits for patients and staff. Our vision is to work with like-minded practices, such as those who have joined in Cross Hills and Skipton, to build a bigger, stronger organisation that will grow as a leading primary care provider in the local area and nationally. We are delighted to be part of these pioneering developments. We are looking for other compassionate and motivated team members to join us at this exciting time.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135834.jpg", "name": "Modality Partnership AWC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Craven", "postalCode": "BD23"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0816", "longitude": "-2.09478"}}, "title": "Practice Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259395", "validThrough": "2020-11-20T23:59:59+0000"}