{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890"}}, "datePosted": "2020-10-19T13:45:17+0100", "description": "&lt;p&gt;&lt;strong&gt;Specialist Paediatric Occupational Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: &lt;strong&gt;Friday 04 Dec 2020&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: &lt;strong&gt;Wed 25 Nov 2020&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;strong&gt;Band 6, &lt;strong&gt;£31,365 - £37,890 &lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;strong&gt;37.5 per week&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base: &lt;strong&gt;Child Development Centre, Hill Rise, Kempston, Beds &lt;strong&gt;MK42 7EB and&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Redgrave Children and Young People’s Centre, Redgrave Gardens, Luton, LU3 3QN&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an innovative, adaptable and committed Band 6 Specialist Paediatric Occupational Therapist, to join our friendly and progressive Team which operates from two bases and covers Bedfordshire and Luton.&lt;/p&gt;\n&lt;p&gt;We are community based and this post will be working from the Child Development Centre Bedford and Redgrave Children and Young People’s Centre, Luton. Both bases are purpose built with a range of facilities, including modern treatment spaces, a sensory room and a soft play area. We work in a variety of settings e.g.) mainstream and special nurseries and schools. We work collaboratively with multi-agency colleagues including other health professionals, education and social care staff. We also work closely with children, young people and their families alongside the coproduction teams and parent / carer forums in the continued development of the service.&lt;/p&gt;\n&lt;p&gt;Bedfordshire Community Health Services offers training opportunities within a service committed to preceptorship, clinical supervision and continued professional development; aimed at developing and consolidating clinical skills. We encourage the development of skills and interests to meet the needs of the service and staff.&lt;/p&gt;\n&lt;p&gt;The post involves the assessment and management of children and young people from birth to school leaving age with a diverse range of special needs. This includes children with complex neurological diagnoses and developmental co-ordination disorder; facing difficulties and challenges with functional life skills inclusive of accessing the national curriculum.&lt;/p&gt;\n&lt;p&gt;Applicants should possess, and be able to demonstrate, the skills to effectively manage multiple and complex client needs and to develop and deliver an Occupational Therapy Program to meet these needs.&lt;/p&gt;\n&lt;p&gt;Applicants must hold a Diploma/Degree in Occupational Therapy, and have knowledge and experience of working with children with common paediatric conditions e.g. cerebral palsy and developmental coordination disorder.&lt;/p&gt;\n&lt;p&gt;Previous experience working within the NHS is desirable.&lt;/p&gt;\n&lt;p&gt;All applicants must be able to work independently, show initiative, drive and enthusiasm. Good communication skills are essential. Applicants must have the ability to travel across Bedfordshire.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to further develop Paediatric Occupational Therapy skills working under the supervision of a Band 7 within a supportive and experienced team.&lt;/p&gt;\n&lt;p&gt;Due to covid 19 informal visits cannot be accommodated but if you have any questions please contact Paediatric Occupational Therapy Team Managers Jennie Oliver on 07780 788751 or Mandy Nash on 07535 889239.&lt;/p&gt;\n&lt;p&gt;Please note interviews will take place over Microsoft Teams&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful applicants to posts at band 6 or above for which a DBS check is required, will be asked to pay for this as a condition of their job offer (£44 for an Enhanced Check or £27 for a Standard Check). This payment will be deducted from their first month&#39;s salary unless a longer pay back period is agreed with the appointing manager. This will not apply to successful applicants who are registered with the DBS Update Service and is in possession of the disclosure certificate, for whom an online status check will be undertaken.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125234.png", "name": "Cambridgeshire Community Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kempston and Luton", "postalCode": "LU3 3QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.918", "longitude": "-.450082"}}, "title": "Specialist Paediatric Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232524", "validThrough": "2020-11-25T23:59:59+0000"}