{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-08T14:52:33+0100", "description": "&lt;p&gt;St Anthony&#39;s Hospital is looking for an experienced Cardiac Physiologist to join our Cardiology Department in Sutton and work alongside the best consultants in the region. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bank Cardiac Physiologist | Sutton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The hospital provides cardiac surgeries for both inpatient and outpatient procedures. In the role you will be working very closely with your team of cardiac physiologists, cardiac consultants and this will be predominantly in the outpatient department. You will contribute to the implementation of cardiac services and apply patient technology for measurement, monitoring and treatment. You will promote excellent care and always strive for quality improvement. You will provide and receive complex, sensitive or contentious information and this will develop your own knowledge and skills and those of your team. You will also acknowledge the risk of Healthcare Associated Infections (HCAI) and understand own responsibility as agreed with line manager in the prevention and control of HCAI.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt; Qualified Cardiac Physiologist     &lt;/li&gt;\n&lt;li&gt;Minimum of 3 years experience with Electrophsiology and advanced in using 3D CARTO,  CRYO and BARD system .  &lt;/li&gt;\n&lt;li&gt;Confident in EP VT and Atrial tachycardia using 3 D mapping.&lt;/li&gt;\n&lt;li&gt;Trouble shooting brady and tachy devices during implants and clinic follow ups.&lt;/li&gt;\n&lt;li&gt;Familar with MACLAB system &lt;/li&gt;\n&lt;li&gt;Able to support intervention procedures including angiogram and angioplasty.  Familar with diagnostic equipments such as pressure wire , IVUS and OCT .&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Spire St Anthony&#39;s Hospital", "postalCode": "SM3 9DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3795", "longitude": "-.220251"}}, "title": "Bank Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218777", "validThrough": "2020-12-31T23:59:59+0000"}