{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35510", "minValue": "32497", "unitText": "YEAR", "value": "£32,497 to £35,510  per annum"}}, "datePosted": "2020-10-14T09:06:33+0100", "description": "&lt;p&gt;We would be delighted to speak to you If you’ve previously worked for the &lt;strong&gt;NHS&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are currently seeking Full Time &lt;strong&gt;Staff Nurses&lt;/strong&gt; (RGN/RMN/RNLD)to join our &lt;strong&gt;Specialist Brain Injury Neurological Care and Rehabilitation&lt;/strong&gt; Service at &lt;strong&gt;Blackheath Brain Injury Rehabilitation Centre (Private Sector) – South East London.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Unit is located in South East London close to Blackheath and Lewisham, directly on the A2 with Greenwich, Lewisham and Blackheath stations all close by.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Thames Brain Injury Unit (17 beds) provides assessment and specialist rehabilitation for individuals with acquired brain injuries and other neurological conditions with a primary cognitive and behavioural need. This service is typically for those who no longer require the high level of medical care provided by an NHS hospital but who on assessment would benefit from an intensive period of neurological rehabilitation and cognitive behavioural management. &lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;span&gt;Heathside unit (18 beds) provides rehabilitation for individuals who have complex physical and/or communicative impairments associated with a brain injury or other neurological condition. &lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We would like to welcome all nurses joining our permanent team with a ‘Welcome Bonus’ of at least £1000.00 (pro rata)&lt;/p&gt;\n&lt;p&gt;Working with The Huntercombe Group is rewarding and varied. Through our “Conversation into Action” programme we actively encourage our employees to get involved and to drive organisational change for the better.&lt;/p&gt;\n&lt;p&gt;The Unit provides a person-centred inpatient rehabilitation and care for male and female adolescents and adults (over 17 years) with a brain injury or other complex neurological condition.&lt;/p&gt;\n&lt;p&gt;Throughout their stay with us, our patients are encouraged to make individual choices about all aspects of life at the centre and to be as independent as possible.&lt;/p&gt;\n&lt;p&gt;Our Staff Nurses play an instrumental role in the lives of individuals, supporting and encouraging them to achieve their goals and ambitions.&lt;/p&gt;\n&lt;p&gt;When you join The Huntercombe Group as a Staff Nurse, you will be part of a company that is understanding, strives towards excellence, is innovative, reliable and accessible and above all puts people first.&lt;/p&gt;\n&lt;p&gt;Most patients are referred to The Huntercombe Group by the NHS and local authorities. We play an integral part in contributing to new models of care outlined in the Five Year Forward View.&lt;/p&gt;\n&lt;p&gt;As a Full time Staff Nurse (RGN/RMN/RNLD) working in our Specialist Brain Injury Neurological Care and Rehabilitation Service, your main duties will be:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide high standards of nursing and therapeutic care in the rehabilitation of brain injured patients; and through membership of the multi-disciplinary team, provide supervision and guidance to Rehabilitation Assistants&lt;/li&gt;\n&lt;li&gt;To assess and deliver effective individual care and treatment towards the rehabilitation of service users&lt;/li&gt;\n&lt;li&gt;To undertake the role of named nurse&lt;/li&gt;\n&lt;li&gt;To actively participate in clinical meetings promoting, reviewing and initiating relevant changes to service user care&lt;/li&gt;\n&lt;li&gt;To effectively co-ordinate the shift, including allocation of service users, supervision of Rehabilitation Assistants, and ensuring the safety of the unit&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To join The Huntercombe Group as a Staff Nurse (RGN/RMN/RNLD) you will be:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Registered Nurse with current NMC registration (Mental Health, Adult, Child, Learning Disabilities) appropriate to the job&lt;/li&gt;\n&lt;li&gt;Able to maintain professional standards of practice at all times&lt;/li&gt;\n&lt;li&gt;Flexible and adaptable, well organised and able to manage time and workload effectively in line with the needs of the service&lt;/li&gt;\n&lt;li&gt;Able to motivate, lead and supervise a team&lt;/li&gt;\n&lt;li&gt;Person centred, showing empathy with a desire to make a difference&lt;/li&gt;\n&lt;li&gt;Professional in your approach to customer care&lt;/li&gt;\n&lt;li&gt;Motivated with the desire to expand your professional development and support organisational change&lt;/li&gt;\n&lt;li&gt;Able to provide demonstrable experience of working in mental health and of enhancing care&lt;/li&gt;\n&lt;li&gt;Legally entitled to work in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return we offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A ‘Welcome Bonus’ of at least £1000.00 (pro rata)&lt;/li&gt;\n&lt;li&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/li&gt;\n&lt;li&gt;2 weeks paid paternity leave&lt;/li&gt;\n&lt;li&gt;Shared parental leave, matching the maternity leave benefit&lt;/li&gt;\n&lt;li&gt;A fantastic preceptorship programme&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;Reimbursement for NMC registration fees&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Continuing Professional Development (CPD)&lt;/li&gt;\n&lt;li&gt;Support for revalidation&lt;/li&gt;\n&lt;li&gt;Support for BSc and MSc&lt;/li&gt;\n&lt;li&gt;Professional support through Nurses forum&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click Apply now.&lt;/p&gt;\n&lt;p&gt;To learn more about The Huntercombe Group please visit our website&lt;/p&gt;\n&lt;p&gt;Posting Date: 14th October 2020&lt;/p&gt;\n&lt;p&gt;Closing Date: 15th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackheath, SE London", "postalCode": "SE10 8AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4723", "longitude": "-.011107"}}, "title": "Staff Nurse (RGN/RMN/RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225414", "validThrough": "2020-11-15T23:59:59+0000"}