{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-30T15:45:25+0000", "description": "&lt;p&gt;&lt;strong&gt;Opening Statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has been created to join our expanding team of healthcare professionals at DGS Health to be part of our primary care network team. The future of general practice will focus on working across multiple practices within networks, collaborating, building relationships and working as part of a multi-disciplinary team to provide safe, high quality integrated care to improve the health of population.&lt;/p&gt;\n&lt;p&gt;Working within a Primary Care Network offers both variety and flexibility, in terms of your day to day work, training and development, career progression but also opportunities to work flexibly across network locations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Potential Candidates&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for candidates who are enthusiastic and adaptable to change, with excellent clinical skills and a good level of competence in use of I.T. Candidates should exhibit good organisational skills and ability to communicate effectively with a wide range of healthcare professionals and other stakeholders including patients, families and carers. The successful candidate will work at practice level, independently, but also as part of a supportive practice team and the Primary Care Network, to deliver safe and effective use of medicines by applying their clinical, pharmaceutical and technical skills to a variety of tasks within the medicines optimisation agenda.&lt;/p&gt;\n&lt;p&gt;These are new, exciting posts in which you could make a real impact. As the role is patient-facing, you will see how your role directly impacts the community you serve.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Local Area&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Dartford, Gravesham and Swanley area is located in North Kent, only a 15 minute commute by train from London St Pancras, and our main GP Federation office is metres away from Ebbsfleet International Rail Station. The area is undergoing considerable housing, retail and leisure development including the Ebbsfleet Garden City Area. The area also boasts the Bluewater retail centre, and there are a good variety of high performing schools including state, grammar and independent schools. All practices in the area are members of the GP Federation and we work together to design and deliver clinically led and managerially enabled services.&lt;/p&gt;\n&lt;p&gt;We place great value on our staff and recognise our success is a result of the quality and commitment of the staff we recruit.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gravesend", "postalCode": "DA12"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4123", "longitude": ".40887"}}, "title": "Physician Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250797", "validThrough": "2020-11-13T23:59:59+0000"}