{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "105783", "minValue": "94333", "unitText": "YEAR", "value": "£94,333 - £105,783"}}, "datePosted": "2020-10-23T09:22:03+0100", "description": "&lt;p&gt;A unique and exciting opportunity has arisen for an Assistant Director to join our team, in helping to shape Adult Social Care for over half a million local residents across Cambridgeshire and Peterborough.&lt;br /&gt;&lt;br /&gt;We’re looking for a dynamic and ambitious individual who is able to provide strategic leadership across both Cambridgeshire County Council and Peterborough City Council, working as a key member of a strong management team.&lt;br /&gt;&lt;br /&gt;Within this role you will lead the continued development of our person centred strengths based approach that maximises independence and wellbeing and achieves good outcomes for residents and their carers. This will be achieved through effective collaboration with other public and third sector partners.&lt;br /&gt;&lt;br /&gt;Key deliverables:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To lead accountability for delivering cost-effective support and care to deliver outcomes that promote independence.&lt;/li&gt;\n&lt;li&gt;To work closely with the Head of Safeguarding and Principal Social Worker to continuously develop and improve practice.&lt;/li&gt;\n&lt;li&gt;To lead on transformation and service improvement programmes to review, develop and improve our offer to adults , their carer’s and families&lt;/li&gt;\n&lt;li&gt;To play an integral role across the wider health and social care transformation programme to prevent delay the need for long –term support and care.&lt;/li&gt;\n&lt;li&gt;To drive and support the development of an integrated and multi-disciplinary approach with a strong focus on local solutions and a place based approach&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;To excel in this role you’ll need to be collaborative and share our ambition for delivering the best for both authorities. You’ll have extensive leadership experience at senior management level, an in depth understanding of local authority adult social care and evidence of good influencing skills to achieve good outcomes.&lt;br /&gt;&lt;br /&gt;Benefits of working for us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Generous annual leave provision&lt;/li&gt;\n&lt;li&gt;Forward thinking authority working on innovative projects&lt;/li&gt;\n&lt;li&gt;Work life balance and flexible ways of working&lt;/li&gt;\n&lt;li&gt;Visible and supportive senior management team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;For an informal discussion please contact Director of Adult Social Care for Cambridgeshire and Peterborough Charlotte Black, on Charlotte.Black@cambridgeshire.gov.uk or via 01223 727993/ 07966151337.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Further information can also be found within the attached covering paper and job description, which is under the supporting documents section.&lt;br /&gt;&lt;br /&gt;To be considered for this role, please upload your CV which should include a personal statement (on the same document) about why you think you are suitable.&lt;br /&gt;&lt;br /&gt;The application deadline is Monday 23rd November 2020, preliminary interviews will take place on the week commencing 7th December 2020.&lt;br /&gt;&lt;br /&gt;If you have any queries about the recruitment process or experience technical difficulties, please contact Megan James on Megan.James@cambridgeshire.gov.uk or 01223 715362.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Peterborough City Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Flexible across Cambridgeshire &amp; Peterborough", "postalCode": "CB3 0AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2128", "longitude": ".114057"}}, "title": "Assistant Director, Adults &amp; Safeguarding", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239814", "validThrough": "2020-11-23T23:59:59+0000"}