{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 p.a"}}, "datePosted": "2020-10-30T10:30:56+0000", "description": "&lt;p&gt;1 Year Fixed Term Opportunity&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within Diggory Division of CNWL NHS Foundation Trust, for a dynamic and motivated individual to work as a Business and Transformation Manager for the Milton Keynes Community Health Services. The post is a strategic one and requires collaborative work with a range of partners including commissioners, partners, local communities as well as internal stakeholders.&lt;/p&gt;\n&lt;p&gt;The individual will need to be highly motivated and organised with good experience of project management, service development and business support in a public sector environment. They will be comfortable working as part of a wider team but under their own self-initiative on a day-to-day basis, holding responsibility for leading the business function for a portfolio of high profile services. They will be comfortable receiving high level guidance and direction from senior leaders, and being responsible for translating this in to clear plans for the service, through to delivery.&lt;/p&gt;\n&lt;p&gt;The role requires commitment to improving clinical quality and the patient experience alongside good technical and financial skills. The successful candidate will work on a range of developments including new models of care, bid writing, activity modelling, contract management, as well as workforce planning. The post holder will need to offer a flexible and supportive approach to clinical colleagues and be a key member of the Milton Keynes Community Health Services Senior Management Team.&lt;/p&gt;\n&lt;p&gt;The Milton Keynes Community Health Services Directorate providers a range of services for children and adults across Milton Keynes. The NHS is currently in the midst of delivering a large-scale transformation programme in the NHS Long Term Plan, and this post holder will play a key role in the delivery of this work. The service is also always developing new opportunities, with tendering for new business and business development also key parts of this role.&lt;/p&gt;\n&lt;p&gt;If you have relevant experience, are looking for a new challenge and are committed to improving patient care, please contact us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Liam Clarke&lt;br /&gt;Job title: Head of Contracts, Partnerships and Business Development&lt;br /&gt;Email address: liam.clarke@nhs.net&lt;br /&gt;Telephone number: 01908 725949&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Milton Keynes Trust Headquarters, Milton Keynes", "postalCode": "MK6 5LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0264", "longitude": "-.735774"}}, "title": "Business &amp; Transformation Manager - Milton Keynes Community Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249739", "validThrough": "2020-11-08T23:59:59+0000"}