{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pro rata"}}, "datePosted": "2020-10-27T16:01:22+0000", "description": "&lt;p&gt;Job Title:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Children’s Carer, Children and Young People’s Complex&lt;/strong&gt; &lt;strong&gt;Physical Health Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Trust Scale/Grade:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Length and Type of Contract:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent 0.85 WTE all year round or Full time term time contract &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for children’s carer to join the complex physical health service supporting and clinic services in the City of Coventry Health Centre. The post will be shared with other carers and involve being rotated to work in both a clinic environment and in Coventry’s special schools. The successful candidate will support children and young people with complex health needs to access education in Coventry’s special schools. The post will also support outpatient clinics at the city of Coventry health centre supporting children attending for medicals and paediatrician appointments as well as ensuring the smooth running of the facility.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The vacancy is for a children’s carer who has a level 3 NVQ or equivalent in a child related subject. Ideally the applicant should have experience of caring for children with complex physical health needs in either a hospital or community setting. Experience working in a special school/ outpatients clinic is desirable but not essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The children and young people the service supports may experience a range of physical and or learning disabilities. The successful candidate will be expected to undertake, following competency based training, a wide range of clinical skills to meet the children and young people’s health needs. The successful candidate will be able to demonstrate good communication skills and have a passion for working with children and young people.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The children’s carer will be joining an experienced, established team who aspire to support children and young people to reach their potential. Ability to work well as part of a team whilst being able to work independently is essential. In return you will be part of a large team and have opportunity to develop new skills and be supported in your role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The children we support reflect the rich diversity of the multicultural society in Coventry. We would actively welcome applicants from a range of cultural and ethnic backgrounds whose skills and life experiences will enrich the services we provide.&lt;/p&gt;\n&lt;p&gt;Our recent CQC inspection rated our Children’s services as good overall and outstanding for care. Please visit the CQC website for further information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a permanent post requiring the successful applicant to work either 32 hours per week over five days all year round or 37.5 hours per week term time only.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information contact Glenys Hopkins Team Leader Children and Young People’s Complex Physical Health Team on 07584369665.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paybody Unit, Coventry", "postalCode": "CV1 4FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4181", "longitude": "-1.49965"}}, "title": "Part time Children&#39;s Carer - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245301", "validThrough": "2020-11-15T23:59:59+0000"}