{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum"}}, "datePosted": "2020-11-03T15:16:32+0000", "description": "&lt;p&gt;The Mount is a mental health unit based in Leeds City Centre. This is a dynamic, exciting service specialized in the care of older people whom have a diagnosed mental health problem or organic illness which aims to deliver excellent person cantered dementia and mental health care to our service users across four wards .&lt;/p&gt;\n&lt;p&gt;The service area is a perfect place for you to work in either your first band 6 position or work if you are an existing band 6 allowing you to experience a wide range of experiences in delivering excellent care to our service users.&lt;/p&gt;\n&lt;p&gt;We currently have posts on Ward 1 on our dementia in-patient services which deliver assessment and treatment for service users whom have dementia and psychological, behavioural symptoms of the diagnosis.&lt;/p&gt;\n&lt;p&gt;Every ward at the Mount also encourages staff to have time to reflect on their practice in a weekly reflective practice group which is run by our specialist psychologist as we value the wellbeing of all our staff. The service has also piloted optional mindfulness sessions for staff to support wellbeing.&lt;/p&gt;\n&lt;p&gt;We are committed to the development of all staff members at the Mount particularly those working in a band 6 role. As an inpatient service we totally committed to the development of our staff as individuals and have support staff to attend a wide range of training such as dementia care mapping, end of life care, family therapy, courses on research, leadership and management courses such as the Mary Seacole program, various counselling courses such as studies in PSI and other higher education studies at degree and masters level.&lt;/p&gt;\n&lt;p&gt;Within the ward you will work in collaboration with an experienced clinical multi-disciplinary leadership team which compromises of mental health nurses, nurse associates, health support workers, clinical psychologist, a consultant psychiatrist, practice development nurse, occupational therapists, speech and language, physiotherapists, dieticians and ward managers.&lt;/p&gt;\n&lt;p&gt;We are committed to providing a high standard of person centred care for all our service users and cares. We benchmark our service against best practice in dementia care and also QNOAHS in order to ensure that service users receive the best care possible and our service continues to rate as good by the CQC.&lt;/p&gt;\n&lt;p&gt;The older people’s service is vibrant exciting service where developments and creativity is encouraged we have been involved and lead on a number of developments. We have successfully implemented huddles across the service and the work we have carried out has been celebrated both locally and regionally with other NHS organizations. We have engaged in a number of research projects with our local universities. Staff members have also successfully implemented developments in regards to physical health care, working with behaviours that challenge, patient experience for which we were short listed for a trust award&lt;/p&gt;\n&lt;p&gt;As a Charge Nurse you will have an intrinsic leadership role within The Older Peoples Inpatient Services and have a responsibility to contribute to the effective running of the service in which you work and to its future direction.&lt;/p&gt;\n&lt;p&gt;Delivering the best person centred and evidence based care we can to our service users and carers will be at the heart of your role as a Charge Nurse.&lt;/p&gt;\n&lt;p&gt;To improve the quality and safety of the Older Peoples Acute Inpatient Services, it is essential that our Charge nurses are competent, positive role models &amp; have effective leadership skills.&lt;/p&gt;\n&lt;p&gt;You will be positive and enthusiastic in your approach, calm and confident when dealing with the needs of the service users, their carers &amp; peers. You will have excellent communication skills, and will show that you have the ability to form and sustain therapeutic relationships with older people, people with dementia &amp; are able to share this with others. You will be expected to take part in &amp; lead on developmental activities on the ward you will work and across the services, even the trust, making this post attractive to innovative and enthusiastic practitioners.&lt;/p&gt;\n&lt;p&gt;Could all applications please highlight the service in which they wish to work either the older people’s functional wards or the dementia in-patient wards.&lt;/p&gt;\n&lt;p&gt;**Please note any correspondence following application will be sent via trac.jobs &amp; the Trust&#39;s Resourcing Team**&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Scott Walker ( Ward Manager Ward 1) 0113 8555571 or Claire Wray ( Ward Manager Ward 2) 0113 8555611.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Mount, Leeds", "postalCode": "LS2 9LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8042", "longitude": "-1.55908"}}, "title": "Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254526", "validThrough": "2020-11-17T23:59:59+0000"}