{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 Per Annum"}}, "datePosted": "2020-11-04T12:46:10+0000", "description": "&lt;p&gt;• Job Title: Transformation Programme Manager&lt;br /&gt;• Duration: 37.5 hours a week Permanent &lt;br /&gt;• Employing Organisation: Arden &amp; GEM Commissioning Support Unit &lt;br /&gt;• Department: Transformation and Consultancy Services. The post will be based at either the Warwick or Derby office (currently working from home due to the pandemic to be discussed during the interview)&lt;br /&gt;• Salary: £53,168 to £62,001&lt;br /&gt;• Pay Band: 8b&lt;br /&gt;• Job Type: Permanent&lt;br /&gt;• Pay Scheme: Agenda for Change&lt;br /&gt;• Staff Group: Admin &amp; Clerical&lt;/p&gt;\n&lt;p&gt;Arden &amp; GEM is one of the largest Commissioning Support Units in the country. Our customers include more than 60 Clinical Commissioning Groups (CCG), NHS England, local authorities and a range of care providers.&lt;/p&gt;\n&lt;p&gt;With offices throughout the Midlands, North West and South East we cover a core geographic patch that extends to Greater Manchester in the north and Essex in the south. Our services are built on a strong foundation of experienced people who build great relationships, a commitment to NHS values and a thorough understanding of our clients and the challenges they face.&lt;/p&gt;\n&lt;p&gt;We provide real value to our customers by working at scale, creating the synergies and innovation that ultimately drives improved patient outcomes and makes commissioning resources work harder. Our cornerstones are quality, value, innovation and complete customer focus.&lt;/p&gt;\n&lt;p&gt;We have a fantastic opportunity for an experienced programme manager to join a high performing team. Working within the Transformation and Consultancy service the candidate will have a proven track record in designing and delivering programmes and projects ideally within the NHS and health and social sector. The Programme Manager role is a key part of the wider team, responsible for leading, developing, coordinating and managing projects, programmes and associated workstreams.&lt;/p&gt;\n&lt;p&gt;The Transformation team operates within an internal framework of supervision and works with other teams in the CSU in a matrix way to deliver seamless services to our customers.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for a talented Programme Manager who is:&lt;br /&gt;&lt;br /&gt;• Solutions focused&lt;br /&gt;• Understands and can apply redesign methodology including change management tools and approaches&lt;br /&gt;• Able to structure and deliver a wide range of programmes&lt;br /&gt;• Able to work closely with patients and the public to understand needs and help create new models of care and services&lt;br /&gt;• Adaptable to new ways of working within an evolving environment&lt;br /&gt;• Customer focused and committed to delivering an excellence service &lt;br /&gt;• Able to demonstrate experience of change management particularly within the health and social care sector &lt;br /&gt;• Able to work flexibly with a range of clinicians and stakeholders.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;In return, you will have an opportunity to help shape a changing and ambitious organisation that will support you in your development, career needs and aspirations.&lt;/p&gt;\n&lt;p&gt;Please refer to the Job description and the Person Specification for details of the role and the skills, qualifications and experience required.&lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact (Chris Davies on: 01216110756)&lt;/p&gt;\n&lt;p&gt;Selection Timescales&lt;br /&gt;Interview Date: 9th December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePartner - Tranformation &amp; ConsultancyEmail addressagcsu.transformation@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;For all enquiries about the post of Programme Manager please email the Transformation &amp; Consultancy Business Support Team ; agcsu.transformation@nhs.net.&lt;/p&gt;\n&lt;p&gt;A suitable time for a telephone discussion will be arranged with one of the Partners in the Transformation Team.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127894.jpg", "name": "NHS Arden and Greater East Midlands Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Westgate House, Warwick", "postalCode": "CV34 4ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2826", "longitude": "-1.59353"}}, "title": "Programme Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255910", "validThrough": "2020-11-18T23:59:59+0000"}