{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per Annum Pro Rata + LW"}}, "datePosted": "2020-11-03T13:00:32+0000", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANT IN ACUTE MEDICINE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants are invited to apply for the post of Consultant in Acute Medicine at the Chelsea and Westminster NHS Foundation Trust to join an exciting and expanding department in one of the countries busiest and most highly rated non-elective trusts.&lt;/p&gt;\n&lt;p&gt;We are in the process of expanding our consultant body and therefore posts are available at the Chelsea &amp; Westminster Hospital site. We are looking for enthusiastic and dynamic, forward thinking team players to help build on the current excellent reputation and trust ethos.&lt;/p&gt;\n&lt;p&gt;The Acute Medicine team provide clinical leadership to dedicated Acute Assessment Units, Enhanced Care Areas and Ambulatory Care Units and have taken on senior leadership positions within the organisation. The Acute Medicine team have an enviable reputation for education and service development and can boast a number of national awards for their innovative approach to the delivery of clinical care.&lt;/p&gt;\n&lt;p&gt;The post holders will undertake fixed clinical and non-clinical duties according to an agreed timetable as part of the consultant team. It is envisaged the new appointees will further consolidate our teaching reputation, strengthen our highly motivated multidisciplinary team and enable further development of this busy, dynamic service. We have a proven record of supporting consultants who would like to work flexibly / less than full time and encourage applicants who have specific specialist interests (clinical, research etc.). Opportunities to continue pursuing these can be negotiated. Furthermore, successful applicants will be provided a mentor to enhance their leadership journey within the organisation.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Charlotte Travill - Job title: Service Manager - Emergency &amp; Acute Medicine&lt;/p&gt;\n&lt;p&gt;Email address - charlotte.travill@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Hannah Skene - Service Director for Acute Medicine&lt;/p&gt;\n&lt;p&gt;Hannah.skene@chelwest.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelsea &amp; Westminster Hospital, London", "postalCode": "SW10 9NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.181435"}}, "title": "Acute Medicine Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254073", "validThrough": "2020-12-01T23:59:59+0000"}