{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T12:45:54+0100", "description": "&lt;p&gt;The Speech and Language Therapy Service at Sandwell and West Birmingham Hospitals NHS Trust is excited to recruit another band 5 into our innovative and forward-thinking therapies structure at a time of considerable and exciting change as the trust works towards its move to the state of the art Midland Metropolitan University Hospital in 2022.&lt;/p&gt;\n&lt;p&gt;Our Speech and Language Therapy team, based across Sandwell and City hospital sites, are a welcoming and aspirational group of therapists with a clear vision and strong commitment to improving the lives of local people. We have a strong focus upon delivering patient-centred care and embedding ‘what matters to you’ care principles into all of our work. We also place equal emphasis upon caring for each other and are proud to work within a trust that champions the health and well-being of its staff.&lt;/p&gt;\n&lt;p&gt;A desire to work with an adult caseload is vital and undergraduate knowledge and experience with a range of acquired communication and swallowing disorders in an acute hospital placement will be essential. A successful candidate will be joining an SLT team with a strong commitment to integrated working and quality improvement. There will be excellent training and development opportunities, scope to lead in areas of service development, as well as a robust supervision and appraisal system&lt;strong&gt;. &lt;/strong&gt;You will have the opportunity to work alongside highly specialist staff and integrate into a variety of specialist multi-disciplinary teams. As a team we have established videofluoroscopy services and in-patient FEES also, so opportunities to access these instrumental assessments to help shape your learning and clinical practice will also be available.&lt;/p&gt;\n&lt;p&gt;The Trust provides a 7-day call-in dysphagia service within Stroke services. The post-holder will be required to participate in this service once level B RCSLT dysphagia competencies have been acquired.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For information please call&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Lucy.Wood27@nhs.net,&lt;/p&gt;\n&lt;p&gt;Kate.Palser@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLucy WoodJob titleService Lead for Speech and Language Therapy, Nutrition and DieteticsEmail addressLucy.Wood27@nhs.netTelephone number07970993641&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell &amp; West Birmingham NHS Trust, Sandwell", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240569", "validThrough": "2020-11-15T23:59:59+0000"}