{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 £18,813 - £20,795 pa (plus HCAS)"}}, "datePosted": "2020-11-04T13:01:18+0000", "description": "&lt;p&gt;Havering 0-19 Universal Children Services is a friendly and innovative team/service, and a great place to work. The NELFT Children’s Integrated Universal &amp; Early Intervention Services in Havering is looking to recruit to the post of an Administrator Band 3.&lt;/p&gt;\n&lt;p&gt;The post holder will have previous experience of working in the provision of good customer care. Previous experience of working in an NHS environment would be desirable.&lt;/p&gt;\n&lt;p&gt;The role will involve day to day office work within the service. You will be required to provide an effective front of house service by handling telephone and staff enquiries in a calm and friendly manner, book appointments and upload documents as well creating referrals on the RiO electronic patient record system.&lt;/p&gt;\n&lt;p&gt;You should have well-developed communication skills with patients/ colleagues and be able to provide an initial response to patient and other agencies queries, concerns and sign post/direct as appropriate. You will also be required to prioritise your work, be a team player, use your initiative and meet deadlines. The vacancy is a full time position working 9am-5pm Monday to Friday.&lt;/p&gt;\n&lt;p&gt;In return for working with us we offer excellent training in role opportunities, flexibility and ongoing support. If you feel you have the required skills to undertake this role, we would love to hear from you&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Please note: this advert is subject to closing early once a high number of applications have been received&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Probationary Period&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Assessment/Interview info&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Starting with NELFT&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;High Cost Area Supplement - London&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namebreda.kavanaghJob titleoperational LeadEmail addressbreda.kavanagh@nelft.nhs.ukTelephone number07772020561Additional contact information&lt;/p&gt;\n&lt;p&gt;Breda Kavanagh&lt;/p&gt;\n&lt;p&gt;Operational Lead&lt;/p&gt;\n&lt;p&gt;07772020561&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cranham  Health centre, Havering", "postalCode": "RM14 1RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5689", "longitude": ".26532"}}, "title": "Primary Care Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255958", "validThrough": "2020-11-11T23:59:59+0000"}