{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34000", "minValue": "24000", "unitText": "YEAR", "value": "Salary £24,000 - £34,000"}}, "datePosted": "2020-10-26T13:39:11+0000", "description": "&lt;p&gt;We look forward to welcoming you to our friendly and supportive practice. We are currently recruiting for a full-time (40 hrs/week) Finance &amp; Technology Officer to complement our team to best serve our patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the practice&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a nurturing environment and so this role would be suitable for an established Finance &amp; Technology Officer with experience working in financial management and in computer support, or a new but highly competent and motivated individual.&lt;/p&gt;\n&lt;p&gt;We serve approximately 13,500 socially and culturally diverse patients and work from a large, modern, primary care health centre. We are a multidisciplinary team consisting of ten doctors, registrars, and a pharmacist, nursing and healthcare assistant team. We operate with budget of 1.6 million and over thirty PCs and thirty phones.&lt;/p&gt;\n&lt;p&gt;We have a comprehensive package of staff benefits which include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive &lt;/strong&gt;salary recognising experience and length of service&lt;/li&gt;\n&lt;li&gt;Promotion of &lt;strong&gt;a healthy work-life balance&lt;/strong&gt; and a potential for flexible working&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Great support&lt;/strong&gt; in your role from our experienced and competent administrative team&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Opportunities &lt;/strong&gt;for promotion and advancement&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Attractive&lt;/strong&gt; holiday package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Who are we looking for?&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our team is made up of dynamic, innovative and caring people and we are looking for applicants with similar working ethos.&lt;/p&gt;\n&lt;p&gt;This post would ideally be suitable for someone with experience, however we believe in employing the right person and would help nurture those with less experience, provided there is a willingness to learn. We feel there are a lot of opportunities to develop your skills and knowledge of financial management and organisational processes, also of information management and technical operations.&lt;/p&gt;\n&lt;p&gt;The successful candidate should be able to prioritise their workload, have effective communication skills with staff, and work with a high degree of accuracy. You should be able to work in accordance with good practice of book-keeping and accounting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What to expect?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please refer to the job description and person specification attached.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What support will you receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Training will be provided, including working protocols and procedures. You will work with an experienced leadership and management team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are the working hours like?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The practice is open from 0715 to 1915 Monday to Friday, within this we aim to provide a flexible working pattern for the benefit of you and the practice. Part-time is considered to be 20 hours.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to apply?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please submit your CV and personal statement outlining how your skills meet the requirements of the role and explaining why you would like to undertake this position. Applications are only accepted through NHS Jobs; no applications will be considered from recruitment agencies.&lt;/p&gt;\n&lt;p&gt;First round interviews will be conducted on 10th November 2020 via Zoom. Second round interviews will be conducted in person at the practice on 16th November 2020; obeying current social distancing rules.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Questions&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you have any questions or would like to discuss this position, please email the Practice Manager, Sarah McLaughlin at morrishouse@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Morris House Group Practice, North London", "postalCode": "N17 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5978", "longitude": "-.082026"}}, "title": "Finance &amp; Technology Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242712", "validThrough": "2020-11-08T23:59:59+0000"}