{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-06T11:01:01+0000", "description": "&lt;p&gt;We are looking for an enthusiastic, self-motivated and experienced team member support the planning and production of clinical rotas to meet the requirements of the Medical Directorate based across Cardiff and Vale.&lt;/p&gt;\n&lt;p&gt;The post holder will look forward to a challenging and rewarding work environment, where initiative and team working play a key part.&lt;/p&gt;\n&lt;p&gt;The primary responsibility of the role is the management of medical rotas that meet the requirements of the Medicine Directorate, achieved through the effective coordination of clinical staff absence, distribution of appropriate skill mix, utilisation of all contractual hours and compliance to Standard Operating Procedures, working time regulations and Health Board Policy.&lt;/p&gt;\n&lt;p&gt;The Clinical Workforce Coordinator is a point of contact for rota queries and maintains regular contact with the Clinical Workforce Supervisor or/and Manager Clinical leaders to ensure staff availability, short notice absence and unexpected gaps are reported in a timely manner.&lt;/p&gt;\n&lt;p&gt;The role provides support and guidance to the Clinical Workforce Assistant in the execution of their duties. The role supports the Clinical Workforce Supervisor and Manager in the administration ongoing development and implementation of the electronic rota system. The Clinical Workforce Coordinator is required to demonstrate a high level of discretion in maintaining management confidence in relation to the handling of confidential staff information.&lt;/p&gt;\n&lt;p&gt;The Clinical Workforce Coordinator is required to work on a rotational basis to meet the operating hours of the department across a seven-day working week.&lt;/p&gt;\n&lt;p&gt;We are searching for an individual who is able to demonstrate the core values of Cardiff and Vale University Health Board:&lt;/p&gt;\n&lt;p&gt;- We care about the people we serve and the people we work with&lt;/p&gt;\n&lt;p&gt;- We trust one another&lt;/p&gt;\n&lt;p&gt;- We respect each other&lt;/p&gt;\n&lt;p&gt;- We take personal responsibility&lt;/p&gt;\n&lt;p&gt;- We treat people with kindness&lt;/p&gt;\n&lt;p&gt;- We act with integrity&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply. &lt;/p&gt;\n&lt;p&gt;Closing Date: 16/11/2020 &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: &lt;/p&gt;\n&lt;p&gt;Name: Rhiannon Owen&lt;/p&gt;\n&lt;p&gt;Job title: Lead Coordinator&lt;/p&gt;\n&lt;p&gt;Email address: Rhiannon.Owen4@wales.nhs.uk &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of Wales, Cardiff", "postalCode": "CF14 4XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5068", "longitude": "-3.18937"}}, "title": "Clinical Workforce Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259335", "validThrough": "2020-11-16T23:59:59+0000"}