{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 to £30,615 Per Annum"}}, "datePosted": "2020-11-05T09:23:10+0000", "description": "&lt;p&gt;The Acute Medical Unit is merging in Dec 2020 and recruitment is our priority.&lt;/p&gt;\n&lt;p&gt;Do you fancy a challenge ? with support, education and reassurance , this could be the Unit for you&lt;/p&gt;\n&lt;p&gt;Both AMU&#39;S are merging to become 1 large Unit located beside the Emergency Department, working with Ambulatory care to assess and identify appropriate patents from the Emergency department , GP surgeries clinics etc.&lt;/p&gt;\n&lt;p&gt;Our patients will be assessed, triaged and treated to identify whether to stay on the assessment unit , be discharged or require a longer stay Specialist bed . Our length of stay will be up to 72 hours.&lt;/p&gt;\n&lt;p&gt;The department will consist of 6 bedded bays throughout the Unit, 2 bays of which will have higher acuity patients, requiring level 1 care which will have moved from the Emergency Department, to improve patient flow and treatment .&lt;/p&gt;\n&lt;p&gt;Our area will provide excellent experience for newly qualified nurses , we offer a substantial in house training programme, along side the Perceptorship programme provided by the Trust and 6 weeks Supernumerary experience. You will work with your own allocated HCA in a bay of no more than 6 patients . There will always be a Senior nurse on duty for support, Dr&#39;s available 24/7 to review any queries and pharmacy on the Unit too for speedy discharges.&lt;/p&gt;\n&lt;p&gt;For more Senior band 5&#39;s there is the opportunity to consolidate knowledge , care for level 1 patients with support and training, and develop in preparation for band 6 role either down the Clinical route or Managerial route&lt;/p&gt;\n&lt;p&gt;We also provide specialist Training opportunities, for staff development identified on the annual Appraisal&lt;/p&gt;\n&lt;p&gt;We require enthusiastic individuals with a can do attitude that have the ability to work within our friendly units and teams. You must also be committed to undertake ongoing in-service training and further development is essential. You should be motivated, keen to learn and ready to embrace change and service improvement. Our commitment to you is to provide the environment for this to happen and ensure that you are part of our ongoing development programmes.&lt;/p&gt;\n&lt;p&gt;Posts are offered on a full and part time basis. The post requires flexible working patterns to meet the needs of the service to include bank holidays, nights and weekends as required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlison BalshawAdditional contact information&lt;/p&gt;\n&lt;p&gt;Alison Balshaw&lt;/p&gt;\n&lt;p&gt;01254 734015&lt;/p&gt;\n&lt;p&gt;Victoria Blackstock&lt;/p&gt;\n&lt;p&gt;01254 734018&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Blackburn Teaching Hospitals, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Staff Nurse - AMU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257037", "validThrough": "2020-11-27T23:59:59+0000"}