{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-27T15:09:34+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Intermediate Care Service - Rapid Response Team- Registered Nurse- Band 5&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bridgwater Hospital location.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a Registered Nurse who has a passion for patients staying at home, working in an unplanned way and avoiding Hospital Admission where possible?&lt;/p&gt;\n&lt;p&gt;We are looking to recruit Registered Nurses looking for a challenge and wanting to join our expanding Rapid Response Team in a role that will support and provide unplanned short term care interventions to patients at home.&lt;/p&gt;\n&lt;p&gt;The successful applicants will join a Multidisciplinary team, with a ’can do’ attitude, passionate about admission prevention, and team working.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Responsibilities include:&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Actively working alongside Therapists and Healthcare Support Workers, proactively supporting patients on the caseload to remain independent within their own home environment, providing nursing support, care planning, preventing unnecessary hospital admission, support flow/transition through the service.&lt;/p&gt;\n&lt;p&gt;Rapid Response is a countywide team working as part of the new ‘Somerset Intermediate Care Service’, working alongside the 4 Neighbourhood teams within Somerset. The successful applicants will be based from either West Mendip/Bridgwater/Dene Barton or South Petherton Community Hospitals however some flexibility will be required to cover all areas to cover sickness / annual leave etc.&lt;/p&gt;\n&lt;p&gt;What is the main aim of the service?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Prevent unnecessary hospital admission&lt;/li&gt;\n&lt;li&gt;Keep service users to their optimal functional level in their own home&lt;/li&gt;\n&lt;li&gt;Reduce the need for ongoing care and potentially reduce referral on to discharge to assess service buy using the enablement approach&lt;/li&gt;\n&lt;li&gt;Provide support to enable quick turn around of patients from Hospital to prevent longer hospital stay than is needed&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidates will be expected to work shifts covering 0800 to 2300hrs 7 days per week.&lt;/p&gt;\n&lt;p&gt;The service positively supports staff development and successful candidates will be encouraged to pro actively develop their personal development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We offer a relocation package to those looking to relocate to Somerset (details / terms and conditions can be sent directly to you).&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bridgwater Community Hospital, Bridgwater", "postalCode": "TA6 4GU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1352", "longitude": "-3.00186"}}, "title": "Registered Nurse, Band 5 - Rapid Response Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245127", "validThrough": "2020-11-20T23:59:59+0000"}