{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T10:01:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Older Adult Care Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an experienced registered mental health nurse or nursing associate and looking for a change or a newly qualified nurse looking for an exciting opportunity to complete your preceptorship? If so, this is the opportunity for you!&lt;/p&gt;\n&lt;p&gt;KMPT’s Older Adult Inpatient Services are developing and we are looking for excellent nursing staff to join us. Our teams, based at various locations across Kent and Medway, are delivering outstanding care with kindness and compassion. They are effective, multi-disciplinary teams offering assessment and treatment for patients of all ages (although predominantly 65 and over) with functional and/or organic presentations.&lt;/p&gt;\n&lt;p&gt;We are currently undertaking a large scale refurbishment and upgrade programme right across our ward estate, with the intention that we can provide purpose built environments that best meet the needs of our patients, their families and our staff. We have recently reopened two of our refurbishments and are looking forward to continuing this work.&lt;/p&gt;\n&lt;p&gt;We are also thinking innovatively about how we continue to develop our services, with opportunities to get involved in research or quality improvement projects as well as our ongoing work towards achieving accreditation with the Royal College of Psychiatrists Quality Network for Older Adults Mental Health Services (QNOAMHS).&lt;/p&gt;\n&lt;p&gt;All staff working on our wards receive regular supervision and support, as well as opportunities to undertake continuing professional development. For newly qualified staff we offer a one year preceptorship programme with protected time. This is an exciting time to join us with lots of opportunities!&lt;/p&gt;\n&lt;p&gt;If you are committed to enabling the recovery of older people and share our commitment to providing high quality care in a dynamic clinical environment, we’d love to tell you more about our current vacancies. We have a variety of flexible working options available across the Trust, with both full and part time roles.&lt;/p&gt;\n&lt;p&gt;KMPT provide Older Adult wards in the following locations;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Jasmine Ward – 16 bed mixed gender ward in Dartford&lt;/li&gt;\n&lt;li&gt;Ruby Ward – 13 bed female ward in Medway&lt;/li&gt;\n&lt;li&gt;Orchards Ward – 16 bed mixed gender ward in Maidstone&lt;/li&gt;\n&lt;li&gt;Heather Ward – 15 bed mixed gender ward in Canterbury&lt;/li&gt;\n&lt;li&gt;Woodchurch Ward – 15 bed mixed gender ward in Margate&lt;/li&gt;\n&lt;li&gt;Sevenscore Ward – 12 bed mixed gender ward in Margate&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please contact us to arrange an informal visit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Grace Maina - Recruitment Officer&lt;/p&gt;\n&lt;p&gt;Telephone: 01227 812166&lt;/p&gt;\n&lt;p&gt;Email: Grace.maina@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent &amp; Medway NHS &amp; Social Care Partnership Trust, Various", "postalCode": "ME16 9PH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2734", "longitude": ".486413"}}, "title": "Staff Nurse - Older Adults", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251513", "validThrough": "2020-11-22T23:59:59+0000"}