{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-28T13:46:35+0000", "description": "&lt;p&gt;&lt;strong&gt;AAU BNHH Staff Nurse&lt;/strong&gt; – Hampshire Hospitals NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Basingstoke &amp; North Hampshire Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role is open to newly qualified nurses supported by a great preceptorship programme. We pride ourselves on having an environment where your development matters.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Description:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be responsible for assessing patients on their arrival from ED &amp; GPs as well as being involved in planning and implementing their care. You will be well supported to develop and use your nursing skills to look after a wide variety of medical patients. No two days are the same on AAU!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexible working patterns will be considered for all nursing applicants! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we look for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Enthusiastic and passionate registered nurses who are eager to develop your own clinical practice, knowledge and skills&lt;/li&gt;\n&lt;li&gt;Staff who are able to (or willing to learn) to act as a role model for colleagues and student nurses within our team&lt;/li&gt;\n&lt;li&gt;Nurses who are able to support the team to ensure that clinical services are delivered to a high standard&lt;/li&gt;\n&lt;li&gt;Registered nurses who are able to provide holistic care for patient and their families when they are at their most vulnerable&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We value all backgrounds. This role is open to newly qualified nurses supported by a great preceptorship programme. We pride ourselves on having an environment where your development matters&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we Offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A 12 month preceptorship programme for all newly qualified staff&lt;/li&gt;\n&lt;li&gt;In house &amp; university based development &amp; education&lt;/li&gt;\n&lt;li&gt;Free car parking!&lt;/li&gt;\n&lt;li&gt;A friendly well supported environment to work in&lt;/li&gt;\n&lt;li&gt;Enhanced care skills including venepuncture and cannulation, ILS &amp; palliative care&lt;/li&gt;\n&lt;li&gt;An opportunity to look after a wide variety of medical patients (respiratory, gastro, cardiology, endocrinology, neurology &amp; many more)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we are: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The acute medical service at Basingstoke hospital comprises of a 23 bedded acute assessment unit (AAU) and an Ambulatory Care Unit (ACU). Both units receive patients from ED &amp; GPs and as a member of the team you will have the opportunity to work in both areas which will provide you with the skills you need to care for a wide range of medical patients.&lt;/p&gt;\n&lt;p&gt;Our ACU provides care for patients who are mobile and can be treated as outpatients rather than inpatients We have direct access to investigations including CT &amp; MRI scans as well as specialist Consultant reviews meaning patient can get access to the treatment they need whilst avoiding a hospital admission.&lt;/p&gt;\n&lt;p&gt;AAU will give you the opportunity to care for medical patients who need admission. As a nurse on the unit you will be pivotal in assessing these patients and ensuring they receive the treatment they need. Our AAU patients are either discharged home from our unit or transferred into the main hospital system should they need longer in patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The vision at Hampshire Hospitals NHS Foundation Trust is to provide outstanding care for every patient. We serve a population of nearly 600,000 people across Hampshire and West Berkshire as well as some people who access our specialist services from across the country.&lt;/p&gt;\n&lt;p&gt;Created in January 2012 the Foundation Trust prioritises the provision of exceptional, compassionate, care delivered by the valued staff working in a culture of collaboration and mutual respect. HHFT employs circa 6,000 people and had a turnover of £382m in 17/18&lt;/p&gt;\n&lt;p&gt;Four core values (CARE) Compassion, Accountability, Respect and Encourage. These are in place to support of four clear objectives, provide outstanding care of patients, empowering all members of staff, sustainable growth and innovating for the future.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;#AspiringToBeTheBest &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Simone Holman - Clinical Matron&lt;/p&gt;\n&lt;p&gt;simone.holman@hhft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number01256 313261&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke and North Hampshire Hopsital, Basingstoke", "postalCode": "RG24 9NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2806", "longitude": "-1.10986"}}, "title": "Staff Nurse - Acute Assessment Unit (Basingstoke)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246825", "validThrough": "2020-11-06T23:59:59+0000"}