{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42130", "minValue": "36816", "unitText": "YEAR", "value": "£36,816 - £42,130 p.a."}}, "datePosted": "2020-10-28T12:00:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Highly Specialised Cardiac Physiologist - Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a highly specialised Cardiac Physiologist to join our Community Cardiology Team. Based at Wimborne Hospital within the Out-Patient Department for Dorset Healthcare.&lt;/p&gt;\n&lt;p&gt;We require a physiologist to provide an Echocardiography service for our open access echocardiography service at Wimborne and our two satellite clinics at Swanage Hospital and Poole Healthcare centre .This is a physiologist lead service so you should be able to work autonomously as you will be working independently in the community reporting directly to the local GP s and being confident in being able to triage when results need to be escalated to Consultant Cardiologists.&lt;/p&gt;\n&lt;p&gt;The role also involves analysis of ambulatory monitors, also physiologist lead, the candidate must have extensive ECG and arrhythmia knowledge. We also support the visiting Cardiologists clinics with non-invasive diagnostic tests including Exercise Stress Tests.&lt;/p&gt;\n&lt;p&gt;Suitable candidates should possess a BSc in Clinical Physiology, have BSE accreditation and be eligible for RCCP registration.&lt;/p&gt;\n&lt;p&gt;Candidates should hold a full driving license as the role involves weekly travel to our satellite centres.&lt;/p&gt;\n&lt;p&gt;As a senior member of the team they will be required to manage our support team of HCA s and clerical staff.&lt;/p&gt;\n&lt;p&gt;Professional support will be provided as we wish to develop the Community cardiology service within Dorset Healthcare.&lt;/p&gt;\n&lt;p&gt;This post is for 35.5 hours per week but part time/job share will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal visit or more information please contact Ann Wiltshire (Monday or Tuesdays) on 01202 856416&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Sharon Powell&lt;/p&gt;\n&lt;p&gt;Job title: Weymouth and Portand Locality Manager and Nurse-Led Services Manager&lt;/p&gt;\n&lt;p&gt;Email address: Sharon.Powell6@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07766590887&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Victoria Hospital - Wimborne", "postalCode": "BH21 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7974", "longitude": "-1.97419"}}, "title": "Cardiac Physiologist, Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246459", "validThrough": "2020-11-11T23:59:59+0000"}