{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34728", "minValue": "34728", "unitText": "YEAR", "value": "Up to £34,728"}}, "datePosted": "2020-10-27T16:09:51+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Welcome to Worcestershire Children First. &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Worcestershire Children First is offering an exciting and new opportunity to be part of a multidisciplinary safeguarding team.&lt;/p&gt;\n&lt;p&gt;Worcestershire Family Safeguarding (WFS) Pilot will be working very closely with our partners in Mental Health, Substance Misuse and Domestic Abuse Services in Worcestershire. Family Safeguarding is a whole system change approach, successfully implemented in several local authorities across the country and now being piloted by Worcestershire Children First in conjunction with Public Health.&lt;/p&gt;\n&lt;p&gt;Focusing on key factors of mental health, alcohol and drug misuse and domestic abuse, Family Safeguarding is a strengths-based model which brings together social workers, family support workers, domestic abuse practitioners, recovery workers and mental health practitioners in a co-located team. The team will be trained in motivational interviewing and will work collaboratively with the family to develop goals, reduce risk and improve outcomes for the whole family.&lt;/p&gt;\n&lt;p&gt; We also recognize the need for practitioners to receive professional support in delivering these key interventions and Worcestershire Children First is committed to ensuring appropriate professional supervision will be provided for all these specialist roles.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;WFS Mental Health Nurse – Fixed Term of 24 months&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A key expertise within this team is a highly motivated, empathetic candidate to take on the role of Mental Health Nurse. This is a great opportunity for a highly skilled professional with experience of working in a multi-disciplinary team in the community, trained in delivering specialist mental health interventions. &lt;/p&gt;\n&lt;p&gt;You will have significant experience of working with children, young people and families in a community mental health setting, able to assess develop and implement evidence-based interventions in order to achieve positive change.&lt;/p&gt;\n&lt;p&gt;The preferred candidate will have:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Considerable experience of managing a caseload/casework of individuals with emotional wellbeing and mental health needs including those with complex needs&lt;/li&gt;\n&lt;li&gt;Demonstrable evidence of providing structured therapeutic interventions to individuals, families and in groups&lt;/li&gt;\n&lt;li&gt;Specialist understanding of child and adolescent development and risk management of young people in crisis&lt;/li&gt;\n&lt;li&gt;Significant relevant experience of working with children and adults with emotional wellbeing and/or mental health needs&lt;/li&gt;\n&lt;li&gt;Evidence of continuing professional development in advances in mental health and emotional wellbeing best practice&lt;/li&gt;\n&lt;li&gt;Demonstrable experience of local resources to meet wider health and care needs drawing on support from the local community&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What can Worcestershire offer you?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A basic salary of up to £34,728 per annum. &lt;/p&gt;\n&lt;p&gt;Specialist professional supervision and support from our partners in linked NHS, Domestic Abuse and Substance Misuse services in addition to expert supervision in Worcestershire Children First.&lt;/p&gt;\n&lt;p&gt;Plus&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The technology and flexibility to work from home, in the office or from touch points across the county&lt;/li&gt;\n&lt;li&gt;Ongoing training and professional development opportunities. &lt;/li&gt;\n&lt;li&gt;An allowance of up to £10,000 to eligible to recruits who need to move home as a result of accepting an appointment.  You can receive help towards removal expenses, legal fees, estate agents’ fees disturbance expenses and additional accommodation costs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;So, what next?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you would like more information on these posts or just simply want to understand more about Worcestershire Children’s First, please contact:&lt;/p&gt;\n&lt;p&gt;Maria White, Assistant Director (Locality Safeguarding Services) - Tel: 01905 846009&lt;/p&gt;\n&lt;p&gt;To apply please complete the online application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 10th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire", "postalCode": "WR5 2NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1856", "longitude": "-2.18253"}}, "title": "Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245346", "validThrough": "2020-11-10T23:59:59+0000"}