{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-26T10:47:03+0000", "description": "&lt;p&gt;The South West Regional Operations Centre (ROC) is now being established to manage the expected support required to coordinate the delivery of services to our patients and to support local healthcare professionals and Systems in delivering required services, during what may be a challenging period. The ROC will be responsible for communicating COVID-19, Winter and EU Exit Transition requirements to Providers, Commissioners and other organisations that support healthcare delivery in the South West Region; assuring local preparations; responding to operational enquiries for COVID-19, Winter and EU Exit Transition; coordinating the operational response within the South West Region and meeting national reporting requirements for COVID-19, Winter and EU Exit Transition.&lt;/p&gt;\n&lt;p&gt;We are looking for energetic and committed team members to bring their skill set and experience to the role and support in the delivery of this vital function. Learning, continuous improvement, growth and development will be fully supported and encouraged.&lt;/p&gt;\n&lt;p&gt;As the ROC Governance Lead, the post holder will work as part of the team in delivering an effective service supporting local organisations across the Region to maintain a high level of preparedness and delivery for COVID-19, Winter and EU Exit Transition. The post holder will be responsible for ensuring that the ROC complies with national Records Management policies and deliveries the ROC Risk Management Strategy, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensuring that the ROC processes are compliant with national Records Management policy.&lt;/li&gt;\n&lt;li&gt;Support the delivery of Records Management training to members of the ROC.&lt;/li&gt;\n&lt;li&gt;Audit ROC teams on a regular basis to ensure compliance with national Records Management policies.&lt;/li&gt;\n&lt;li&gt;Advise the ROC Director and Head of ROC on Risk Management processes and establish and maintain the ROC Risk Register, including advise on articulating emergent risks, drafting mitigations and advising on appropriate risk scoring.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Additionally, this post will support the Regional Cells to ensure their Risks are appropriately recorded and recorded on the approved Risk Register (which may be Corestream). While the ROC Governance Lead will generally operate during standard working hours, they will need to work flexibly. This could mean providing cross-cover for other members of the ROC, flexing working hours in line with ROC core operating hours and undertaking other tasks and activities as specified by the ROC Director.&lt;/p&gt;\n&lt;p&gt;While the primary location for the South West ROC is in South West House, Taunton, following a period of induction, the successful candidate will generally work remotely, using MS Teams, following current NHS workforce guidance.&lt;/p&gt;\n&lt;p&gt;When the ROC is able to return to an office base environment, the successful candidate’s location may include SW House, Jenner House, Chippenham or Peninsula House in Saltash.&lt;/p&gt;\n&lt;p&gt;The reason for the fixed term contract is because this a short-term time limited project.&lt;/p&gt;\n&lt;p&gt;Please note that this job advert will close as soon as sufficient applications have been received.&lt;/p&gt;\n&lt;p&gt;Interviews will take place virtually via MS Teams.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Nina Barnard&lt;/p&gt;\n&lt;p&gt;Job title: Workforce Manager&lt;/p&gt;\n&lt;p&gt;Email address: n.barnard1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton/Chippenham/Saltash", "postalCode": "TA1 2PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0152", "longitude": "-3.06776"}}, "title": "Regional Operations Centre Governance Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242062", "validThrough": "2020-11-09T23:59:59+0000"}