{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T14:46:57+0000", "description": "&lt;p&gt;&lt;strong&gt;Cambridge locality teams&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are located in the vibrant University City of Cambridge. The North and South Cambridge Adult Locality Teams (CALTs) ,based at Union House, are community-based mental health teams. The multidisciplinary teams are made up of nurses, social workers, support workers, peer support workers, occupational therapists, clinical psychologists, assistant psychologists, psychiatrists, administrative staff, team managers, service manager, and students from various disciplines.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What do we do?&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;We support working-age adults who have moderate to severe affective and psychotic disorders. The teams offer support in a number of ways, drawing from the expertise of such a variety of disciplines. We offer care-coordination, a daily duty service, psychiatric assessments, medication reviews, ongoing risk management, care planning, support around benefits and housing, carers’ assessments, and a wide variety of therapeutic interventions.&lt;/p&gt;\n&lt;p&gt;Our interventions include Brief Psychological Interventions (BPI&#39;s), Re-ablement, sensory profiling, social inclusion, Brief Solution Focused Practice, family work, Occupational Therapy assessments, individual Cognitive Behavioural Therapy, neuropsychological assessments, as well as psychological groups such as Bipolar Psychoeducation group, Checking group, Carers’ and Family group, Living Well group, and Anxiety and Depression CBT group. We also run a physical health care and Clozapine clinic.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Service Developments&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;We are continually developing the service, considering what interventions may be helpful for our service users, and evaluating the support we already provide. Recent developments include a ‘Sensory Integration group’, a ‘Coping Skills group’ and a running and walking group.&lt;br /&gt;We have recently started a ‘Compassion-Focused Therapy group’ and hope to offer an ‘Overcoming OCD group’.&lt;/p&gt;\n&lt;p&gt;Recovery principles are embedded in the work of the locality teams and we aim to support people to reach their potential by facilitating hope, empowering autonomy and developing meaning and purpose in life.&lt;/p&gt;\n&lt;p&gt;We have a commitment to research and service audits in the field of mental health and the team is currently collaborating on a number of interesting projects, including piloting ‘an integrated CBT approach to depression’, a multisite single-case study with Newcastle University, evaluating Brief Psychological Interventions provided in the Cambridge Adult Locality Teams (north and south teams), and evaluating group therapies carried out in the teams. We are also in the process of applying for Excellence Accreditation through the Royal College of Psychiatry.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working in CALT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be an active member of a dynamic, highly motivated, skilled and creative team&lt;/p&gt;\n&lt;p&gt;You will be working in a supportive environment that values your supervision and professional development&lt;/p&gt;\n&lt;p&gt;You will have a voice and role to play in service development&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to manage a caseload of diverse service users, delivering a diverse range of clinical skills and building a therapeutic and recovery based relationship.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a strong team work ethic, sense of accountability, accompanied by an ability to work under pressure and with a desire for innovation. We are able to support agile working for staff, using all appropriate I.T equipment and support, and have a secure area for staff bicycles. The city provides a good opportunity to be active at work, with staff being able to cycle to local appointments.&lt;/p&gt;\n&lt;p&gt;This service covers both Cambridge city and the surrounding rural areas; therefore, successful applicants will need to be able to travel independently. We are pleased to inform candidates that there is the potential for new staff to access affordable accommodation as detailed below, which can be very helpful where re-location is considered.&lt;/p&gt;\n&lt;p&gt;For those applicants who are out of area, relocation costs are available as per Trust policy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff Accommodation &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have 24 rooms of staff accommodation which is situated in Waterbeach Barracks, 11 miles from Fulbourn/Cambridge. The accommodation was refurbished in July 2018 and is available immediately.&lt;/p&gt;\n&lt;p&gt;Each room is in a group of four rooms and has a small shared living area and a shared bathroom. Each room has a bed, wardrobe, bedside table, desk and chair. Each group of four rooms will share a large kitchen, large living room and dining area with another group of four rooms.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The accommodation includes:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Free laundry facilities&lt;/p&gt;\n&lt;p&gt;Free Wi-Fi&lt;/p&gt;\n&lt;p&gt;Free residents&#39; parking&lt;/p&gt;\n&lt;p&gt;The accommodation is managed by the Royal Papworth Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;One month&#39;s rent is required as a deposit and this is held by TDS (Tenancy Deposit Scheme) which is a Government backed scheme to secure tenancy deposits. The tenancy will normally be for a minimum of 6 months. The rent is £450 per calendar month.&lt;/p&gt;\n&lt;p&gt;To find out more about availability and prices at our staff accommodation in Waterbeach, please contact our Recruitment Team by email to accommodation@cpft.nhs.uk or by phone on 0800 953 7016.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Accommodation Address:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Waterbeach Barracks, Waterbeach CB25 9PA&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Maggie Page - Service Manager&lt;/p&gt;\n&lt;p&gt;maggie.page@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01223 341 500&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Union house, Cambridge", "postalCode": "CB4 1PR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2177", "longitude": ".137858"}}, "title": "Care Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258188", "validThrough": "2020-11-19T23:59:59+0000"}