{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 per annum"}}, "datePosted": "2020-11-02T16:35:51+0000", "description": "&lt;h1&gt;Clinical Specialist Speech and Language Therapist - ITU, Band 7&lt;/h1&gt;\n&lt;p&gt;An exciting opportunity is now available at the Royal United Hospital for an enthusiastic and forward thinking Speech and Language Therapist. A full time Band 7 vacancy has been created in Intensive Care as part of a business case to match GPICS2 for 16 beds and we are open to part time or full time candidates wishing to apply. The business case will aim to see the development of all therapy services (SLT, OT, PT, Dietitian, Psychology and Pharmacy) and provides the opportunity for exciting new ways of working together, along with existing therapy staff, to improve patient care. The post holder will be responsible for establishing and developing the ITU SLT service and contributing to the shared AHP vision for ITU alongside other therapy leads.&lt;/p&gt;\n&lt;p&gt;The post holder will be a highly specialist SLT who is dedicated to the ITU and will be expected to deliver advanced dysphagia and communication assessment and treatment to critical care patients. The post holder will be able to demonstrate significant experience in this area of practice and have all the necessary competencies to participate in the MDT care of tracheostomy patients. Video fluoroscopy and FEES competencies are highly desirable and the successful candidate will have the opportunity to participate in existing and developing clinics at the RUH. Demonstrable knowledge of highly specialist communication interventions will be required, with the understanding of the specific needs of patients on ITU.&lt;/p&gt;\n&lt;p&gt;The SLT team at the RUH is innovative and enthusiastic with strong leadership in Stroke, Neurology, General Wards and Head and Neck Cancer, and we are now looking for the right person to lead our SLT ITU service. Despite being small in numbers we are a valued part of the MDT and work closely together, with our AHP colleagues, to develop services and provide excellent patient care. The post holder will lead in the development of critical care skills and tracheostomy competencies for the SLT team, and contribute to student education. The therapy department has a positive approach to continuing professional development and there is an active in-service training programme.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Clinical Specialist Speech and Language Therapist - ITU, Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252887", "validThrough": "2020-11-16T23:59:59+0000"}