{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-21T12:14:43+0100", "description": "&lt;p&gt;As a Healthcare Assistant, you’ll play an important part in creating a great experience for patients undergoing major and minor surgeries in our theatres. Putting their care first, you will have more time caring for them as individual people, not just as patients. You will also form a key part of supporting the department the achievement of all clinical governance and audit reviews.&lt;/p&gt;\n&lt;p&gt;As a highly motivated person, you will be used to working in a fast-paced environment, in places that are constantly and rapidly changing. With lots of empathy for people, you’ll find the challenges of theatre work fascinating. Ideally, you will be qualified to NVQ level 2 or 3, although not essential as we can provide training.&lt;/p&gt;\n&lt;p&gt;Playing a valuable role within the team, you will also have excellent communication skills, passion and a flexible approach to your everyday work.&lt;/p&gt;\n&lt;p&gt;Nuffield Heath is Britain’s largest and most pioneering healthcare charity, integrating fitness and well-being, prevention and cure. We’ve brought together our hospitals, clinics, fitness &amp; wellbeing centres as well as our diagnostic units into one holistic healthcare service provided from over 200 locations. A not-for-profit organisation, we reinvest every penny we make into helping the people of Britain to lead healthier, happier lives. In today’s healthcare market, we’re in an enviably strong position.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brentwood Hospital", "postalCode": "CM15 8EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6236", "longitude": ".312716"}}, "title": "BANK Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236296", "validThrough": "2020-11-21T23:59:59+0000"}