{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18702", "minValue": "17460", "unitText": "YEAR", "value": "£17,460 - £18,702 pa"}}, "datePosted": "2020-10-28T14:30:54+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS ADVERT MAY CLOSE EARLY DUE TO LARGE AMOUNT OF APPLICATIONS.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Come and join our team! &lt;/strong&gt; If you have an interest in caring for people there is opportunity to begin a career in a support role within an interesting and rewarding area of rehabilitation, which requires no set qualifications.&lt;/p&gt;\n&lt;p&gt;South Warwickshire NHS Foundation Trust (SWFT) is now recruiting Clinical Support Workers to join the newly developed Central England Rehabilitation Unit (CERU) at Leamington Spa Hospital. Central England Rehabilitation Unit (CERU) is a national centre of excellence which has been established for over 20 years based at Leamington Spa Hospital. CERU offers 42 beds split over 2 wards and is recognised as one of the top units for providing patients with specialist rehabilitation. The unit specialises in caring for people suffering from an acquired and traumatic brain injury. It is also the rehabilitation centre for the major trauma pathway from UHCW. Last year, the unit was awarded Level 1 status following a national review of services for adults with an acquired brain injury and is now recognised as a Centre of Excellence for in-patient rehabilitation for the most complex of brain injured patients.&lt;/p&gt;\n&lt;p&gt;Treatment is offered within a comfortable setting with access to state-of-the-art facilities. Our patients have highly complex nursing needs requiring extended clinical skills so you will have the opportunity to learn and develop, tracheostomy management skills, alternative feeding skills, cannulation and venepuncture to name a few.&lt;/p&gt;\n&lt;p&gt;This position can offer you the opportunity to learn and work within a large nursing and multidisciplinary team, alongside developing your clinical skills and increase neurological conditions knowledge. It is suitable for anyone looking to ‘start’ a career in healthcare or alternatively someone who is looking to ‘develop’ their career as a support worker. You must have excellent communication and interpersonal skills, be reliable, work well in a team, flexible and have a caring, kind and compassionate nature.&lt;/p&gt;\n&lt;p&gt;We support learning and educational environment to ensure all employees have the right skills and knowledge to carry out their roles competently. We also fully engage in development and promote career progression internally. You will also have the opportunity to complete a clinical apprenticeship which provides an alternative career route into the nursing profession especially for those with commitment and enthusiasm rather than academic qualifications.&lt;/p&gt;\n&lt;p&gt;In return you will learn a range of new skills and knowledge, excellent training and career development, a salary from £17.5k – 18.5K plus unsociable hours allowance and other related organizational benefits.&lt;/p&gt;\n&lt;p&gt;This post includes &lt;strong&gt;working shifts which include days, nights and weekends. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The current &lt;strong&gt;hours available are for both full and part time.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a great opportunity so joining our organisation now as a Clinical Support Worker will be your chance to play a part in shaping our future as an excellent provider of healthcare.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To help us achieve our vision of providing the best possible healthcare, South Warwickshire NHS Foundation Trust run Assessment Centres to select its future employees. These vary depending on the vacancy but their core purpose is to create an environment in which you, along with other candidates are able to demonstrate key workplace skills. The Assessment Centre will be an opportunity for you get a feel for the culture, leadership, and learning opportunities within South Warwickshire NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Assessment is based on a numeracy test, an interview and a group exercise which will be undertaken against the core values and behaviours that our employees pride themselves with.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of individuals and expects all staff to share this commitment. As part of our safe recruitment practice, it is a mandatory requirement for all newly appointed staff requiring a Disclosure and Barring Service (DBS) check to be registered with the DBS Update Service. All eligible staff recruited to the Trust are expected to maintain their annual update subscription whilst employed with the Trust as a condition of employment. The cost of the first year’s subscription to the update service will be reimbursed by the Trust as a payroll refund.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For more information or to arrange an informal visit please contact Kathy Wagstaff 01926 317774&lt;br /&gt;&lt;br /&gt;Should you wish discuss the opportunities available or the recruitment process please contact either Claire Hawkins on 01926 495321 ext: 8437&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Warwickshire NHS Foundation Trust, Leamington Spa", "postalCode": "CV34 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2693", "longitude": "-1.54106"}}, "title": "Clinical Support Worker - CERU (Leamington)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246979", "validThrough": "2020-11-11T23:59:59+0000"}