{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80554", "minValue": "70641", "unitText": "YEAR", "value": "£70,641 - £80,554 per annum inclusive"}}, "datePosted": "2020-10-26T12:46:37+0000", "description": "&lt;p&gt;Great Ormond Street Hospital for Children NHS Foundation Trust (GOSH) is the leading hospital for children in the UK and renowned the world over for its dedication to paediatric research and medicine. This is an exciting time to join the Trust as we have recently launched our ‘Above and Beyond’ strategy which is a 5 year plan to advance care for children and young people with complex health needs.&lt;/p&gt;\n&lt;p&gt;At GOSH we are constantly planning for the future and we are investing significantly to replace and develop our ICT infrastructure, reshaping the business to deliver the highest levels of performance and best clinical outcomes possible. This extensive strategic investment in Information Management and Technology builds on our existing systems to deliver digital enhancements across all aspects of care. We have a strong enterprise electronic patient record (EPR) which sits at the very heart of the Trust digital footprint.&lt;/p&gt;\n&lt;p&gt;We have an opportunity for a talented and experienced senior technology leader to join our ICT directorate in the role of Assistant Director of ICT Data &amp; Applications.&lt;/p&gt;\n&lt;p&gt;The Assistant Director of ICT Data &amp; Applications will provide senior team leadership and be responsible and accountable for the operational management of the Trust’s ICT Data and Applications. They will set up, lead and manage the applications support functions within ICT, providing IT applications support for GOSH and its stakeholders. The role will cover:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working with the ICT Strategic Solution Architect to plan the design and delivery of IT applications across the Trust.&lt;/li&gt;\n&lt;li&gt;Co-ordinate installation and delivery of IT Applications and Data Management Solutions&lt;/li&gt;\n&lt;li&gt;Ensure the availability of the Trust’s data, as accessed via the relevant application(s), encompassing clinical, research and non-clinical information. This includes developing, configuring, maintaining and supporting all new and existing applications, other than the EPR.&lt;/li&gt;\n&lt;li&gt;Responsible for developing the technical data management policies across the estate, overseeing activities, providing direction and support to all ICT teams and the EPR Programme, in addition to developing collaborative ways of working with the organisation to ensure the most effective management of the Trust’s datasets&lt;/li&gt;\n&lt;li&gt;Participates in various committees, groups and boards as appropriate Sit on the Information Governance Steering Group to ensure that data is accessed and managed in accordance with ICT standards, policies &amp; procedures, Information Governance policies &amp;and procedures and agreed , including data retention policies.&lt;/li&gt;\n&lt;li&gt;Engages with Trust Board, Trust Executive, Senior Managers and the wider GOSH business, advising and reporting on complex IT issues as required.&lt;/li&gt;\n&lt;li&gt;Develops and embeds within GOSH strategic technology partnerships with relevant suppliers.&lt;/li&gt;\n&lt;li&gt;Responsible for clinical and non-clinical applications, both on premise and remotely hosted&lt;/li&gt;\n&lt;li&gt;Acts as primary link to the EPR team, and manages the contract for the remote hosting of the EPR in collaboration with the AD Technology &amp; Cyber Security.&lt;/li&gt;\n&lt;li&gt;Accountable for the three sections within the Data &amp; Applications function: Clinical Digital Content; Enterprise Application Management; Interoperability.&lt;/li&gt;\n&lt;li&gt;Budgetary Responsibility for Pay and Non-Pay Revenue Budget of Circa £2.5M&lt;/li&gt;\n&lt;li&gt;Working with the other Assistant Directors of ICT to ensure that all ICT Services are delivered efficiently across the organisation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a crucial role within the organisation and the post holder will play a key strategic role helping the directorate achieve its objectives and deliver results.&lt;/p&gt;\n&lt;p&gt;This is a challenging role and we are looking for a driven, exceptional candidate who is excited by the challenge and thrives in a busy and ever changing environment. You will be expected to have significant and wide-ranging previous knowledge and experience within the ICT field preferably in a healthcare setting including management of significant operational budgets and a strong track record of delivery.&lt;/p&gt;\n&lt;p&gt;You will also have exceptional leadership qualities with the ability to lead, manage and motivate your team in addition to strong core values in line with those at GOSH.&lt;/p&gt;\n&lt;p&gt;For a full outline of the candidate requirements please review the Person Specification for the role.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Assistant Director of ICT Data &amp; Applications", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242501", "validThrough": "2020-11-06T23:59:59+0000"}