{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34340", "minValue": "34340", "unitText": "YEAR", "value": "34,340.00"}}, "datePosted": "2020-11-04T13:57:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Purpose:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Health Care Professional, you will be joining our team of clinicians who are on hand 24 hours a day, 365 days a year to assess and address the health needs of detained persons, as well as conducting forensic medical examinations gathering evidence for use in the criminal justice system. The role will involve conducting clinical assessments, identifying and implementing appropriate interventions, collecting forensic samples, providing advice and guidance and maintaining detailed and accurate records to ensure the health, safety and welfare of detained persons held in police custody.&lt;/p&gt;\n&lt;p&gt;42 Hours Per week, 2 days and 2 nights consisting of a 12 hour shift.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key accountabilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CARING&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide a professional, responsive and caring service to detained persons in the custody environment to support the Custody Sergeant and Custody Officers in assessing the healthcare needs of detained persons and an effective care pathway throughout their time in custody.&lt;/li&gt;\n&lt;li&gt;Carry out forensic sampling.&lt;/li&gt;\n&lt;li&gt;Determine an individual’s fitness to be detained, fitness to be released, fitness to be interviewed and competence to understand charge.&lt;/li&gt;\n&lt;li&gt;Assessment of alcohol and drug intoxication and withdrawal and retrieval of blood samples under the Road Traffic Act.&lt;/li&gt;\n&lt;li&gt;Provide advice and support to Custody Officers in determining the health care needs of detainees and the priorities of care. Seek telephone advice and refer cases to the Consultant FME when required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;EFFICIENT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Effectively deliver the requirements of the forensic practitioner service following the Codes of Practice of the Police and Criminal Evidence Act 1984 and locally agreed protocols.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Abide by the NMC code of conduct, maintain professional development through training and experience, and use opportunities to promote the role of nurses in the custody setting.&lt;/li&gt;\n&lt;li&gt;Keep accurate, complete and contemporaneous notes of work carried out, including the recording of injuries. Ensure all activities are logged using the systems in use.&lt;/li&gt;\n&lt;li&gt;Participate in the collection of data for service audits and other mechanisms for achieving continuous service improvement.&lt;/li&gt;\n&lt;li&gt;Keep up to date on current internal and external procedures and regulations.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;RESPECT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop positive working relationships with Consultant FMEs and doctors, custody staff, police officers, local healthcare providers, drug referral workers, and other organisations which can contribute to service excellence.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;TEAMWORK&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work with other members of the team to ensure that a high quality service is provided at all times.&lt;/li&gt;\n&lt;li&gt;Work cooperatively and productively, openly exchanging information and supporting colleagues to achieve team goals.&lt;/li&gt;\n&lt;li&gt;Assist in the training of new team members.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;ACCOUNTABILITY&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be accountable for decisions made based upon a strict interpretation of rules, regulations and procedures.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;FUN&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be a positive, committed team member, who partakes in the more light-hearted interactions with clinical and custody colleagues, in what can be a challenging environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Experience and Key Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Nurse with minimum of 3 years’ service.&lt;/li&gt;\n&lt;li&gt;Have been continuously resident in the UK for at least 3 years.&lt;/li&gt;\n&lt;li&gt;A full UK driving license.&lt;/li&gt;\n&lt;li&gt;Registered as RGN or RMN.&lt;/li&gt;\n&lt;li&gt;Competent in oral and written English.&lt;/li&gt;\n&lt;li&gt;Full membership of the NMC.&lt;/li&gt;\n&lt;li&gt;Right to Work in the UK, UK/EU Passport or valid work visa&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Health, Safety and Compliance:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Adhere to PHL policies and procedures at all times&lt;/li&gt;\n&lt;li&gt;Take all reasonable steps to manage and promote a safe and healthy working environment which is free from discrimination.&lt;/li&gt;\n&lt;li&gt;Comply with the PHL policy on confidentiality and in line with GDPR, relating to information held manually or on computerised system&lt;/li&gt;\n&lt;li&gt;Respect the confidentiality and privacy of Patients and staff at all times&lt;/li&gt;\n&lt;li&gt;Maintain a constant awareness of health, welfare and safety issues affecting colleagues, patients, visitors and themselves, reporting any accidents or fault in line with PHL policy taking into account conditions associated with unsocial working hours&lt;/li&gt;\n&lt;li&gt;Fully participate in health and safety training&lt;/li&gt;\n&lt;li&gt;This job description seeks to outline the key duties safety issues affecting colleagues, patients, visitors and themselves, reporting any accidents or fault in line with PHL policy taking into account conditions associated with unsocial working hours&lt;/li&gt;\n&lt;li&gt;This job description seeks to outline the key duties and responsibilities of the post; it is not a definitive document and does not form part of the main statement of Terms and Conditions. The job description will naturally change with time as the business matures and may be reviewed from time to time&lt;/li&gt;\n&lt;li&gt;The post holder is required to travel independently between PCC sites and to attend meetings as necessary&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SAFEGUARDING CHILDREN AND ADULTS &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;PHL is committed to safeguarding and promoting the welfare of children, young people and adults. Safeguarding is everyone&#39;s responsibility and all employees and volunteers are required to act in such a way thatat all timessafeguards the health and wellbeing of children, young people and adults that you come into contact with during your work. To fulfil these duties, you will be required to participate and attend appropriate mandatory training to recognise the signs and symptoms of abuse and how to respond to these signs and symptoms. All employees are required to adhere to local and national safeguarding policies and guidance. All employees must ensure that they understand and act in accordance with this clause. If you do not understand exactly how this clause relates to you personally then you must ensure that you seek clarification from your immediate manager as a matter of urgency. Equally, all managers have a responsibility to ensure that their team members understand their individual responsibilitieswith regard toSafeguarding Children and Adults.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135074.jpg", "name": "Partnering Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth &amp; Southampton", "postalCode": "PO8 8DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8939", "longitude": "-1.01816"}}, "title": "Forensic Healthcare Professional", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256100", "validThrough": "2020-11-18T23:59:59+0000"}