{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-22T11:31:58+0100", "description": "&lt;p&gt;Previous applicants need not apply - You must have the appropriate nursing associate qualification and be registered with the NMC.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit highly motivated staff to work within our dynamic team and strive for excellence.&lt;/p&gt;\n&lt;p&gt;Ward 8a specialises in Gastroenterology and Endocrinology delivering quality, safe care to our patients. We have 29 beds and an adjoining medical day unit.&lt;/p&gt;\n&lt;p&gt;If you are an enthusiastic nursing associate, then we are excited to inform you that we are now advertising for Nursing Associates!!&lt;/p&gt;\n&lt;p&gt;ULHT are proud to have supported the first wave of training Nursing Associates through their training, and are excited to offer the opportunity to recruit you subject to your successful completion of the course. This will allow you the opportunity to develop your skills and expertise further once qualified and in your band 4 role. Once recruited we will offer you a preceptorship and further development opportunities which as well as offering you the opportunity to consolidate your role, could provide you with a structured career pathway that could lead to you becoming a registered nurse in the future.&lt;/p&gt;\n&lt;p&gt;Within United Lincolnshire Hospitals there is a firm commitment to achieving an effective and sustainable nursing workforce to ensure that our patients received the very best care and are at the centre of everything we do. This includes considering new ways of working and delivery of patient care.&lt;/p&gt;\n&lt;p&gt;The Nursing Associate role is a role that sits alongside existing registered nurses and nursing care support workers- to deliver hands-on, excellent care for patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachel TiffinJob titleWard ManagerEmail addressRachel.Tiffin@ulh.nhs.ukTelephone number01205 445677&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pilgrim, Boston", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Nursing Associate - Ward 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238164", "validThrough": "2020-11-12T23:59:59+0000"}