{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T13:31:33+0000", "description": "&lt;p&gt;We are an integrated Children’s physiotherapy service providing assessment and intervention for children and young people aged 0-19 years with a range of physical and developmental conditions, complex needs and life limiting conditions as well as respiratory and musculoskeletal problems.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic HCPC registered Physiotherapist who has the ability to communicate with children of all ages who is passionate work in paediatrics and a willingness to develop their clinical skills in this specialist area. You will need to be a team player and work collaboratively within the integrated team as well as the wider MDT.&lt;/p&gt;\n&lt;p&gt;As a band 5 therapist, you will be given the opportunity to develop your skills in therapeutic handling, use of standardised assessments, develop your ability to work in 1:1 situations as well as groups with children presenting with a broad range of difficulties. There will be opportunities to develop casting skills, gain knowledge and understanding of orthotic management and understand and develop the use of varying equipment to support a CYPs development.&lt;/p&gt;\n&lt;p&gt;Multidisciplinary and multi-agency working is a major part of the role and allows the team to provide person centred, safe and joined up care. As a service we contribute fully to the SEND agenda and work hard to maintain effective relationships with our local authority colleagues and wider MDT.&lt;/p&gt;\n&lt;p&gt;You will work closely with senior qualified members of staff but will also be expected to work as an autonomous practitioner managing a varied caseload. The role will also be to support the acute service at time of increased capacity in the assessment and management of acutely unwell CYP with the support of senior staff.&lt;/p&gt;\n&lt;p&gt;You will be working across the Borough of Walsall in clinics, schools, mainstream and special, in the children’s homes as well as in the acute setting. The Paediatric Physiotherapy Service continues to respond to government initiatives around SEND, Safeguarding and the Healthy Child Programme as well as developing cost effective and efficient ways to deliver the service. You should therefore be able to demonstrate a willingness and ability to support these developments, be adaptable to change and drive the service forward.&lt;/p&gt;\n&lt;p&gt;The service currently takes place over a 5 day period (Monday to Friday) however all new contracts will be 5 working days over 7 to enable cover of a 7 day service in the future (if required). Opportunities for on-call and weekend working may be available once the appropriate training has been received.&lt;/p&gt;\n&lt;p&gt;Preceptorship, supervision, personal development reviews and professional development opportunities are available and CPD is supported and actively encouraged. Physiotherapy students are regularly taken by the team and close links are maintained with Wolverhampton, Keele and Birmingham Universities.&lt;/p&gt;\n&lt;p&gt;For an informal chat or further information regarding this post please contact: Rebecca Logan or Uta Wilkinson, Paediatric Physiotherapy Team Leads on 01922 605810&lt;/p&gt;\n&lt;p&gt;Walsall Healthcare NHS Trust is committed to operating flexible working practices and service provision. Applicants must be able to travel across the borough within the working day in order to provide a community based service.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be expected to apply for disclosure (criminal records bureau check) and have HPCP registration. Please note that we reserve the right to alter the closing date for this post and that if a large number of applicants meet the essential criteria for this post, random selection interviewing will also take place.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is important that your application meets the minimum requirements of the personal specification, as we will shortlist against these details.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca LoganJob titlePaediatric Physiotherapy Team LeadEmail addressrebecca.logan@walsallhealthcare.nhs.ukTelephone number01922 605810Additional contact information&lt;/p&gt;\n&lt;p&gt;Alternative contact&lt;/p&gt;\n&lt;p&gt;Uta Wilkinson&lt;/p&gt;\n&lt;p&gt;Paediatric Physiotherapy Team Lead&lt;/p&gt;\n&lt;p&gt;uta.wilkinson@walsallhealthcare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120984.jpg", "name": "Walsall Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120984"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walsall Child Development Centre, Walsall", "postalCode": "WS4 1PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6143", "longitude": "-1.95538"}}, "title": "Paediatric Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242663", "validThrough": "2020-11-09T23:59:59+0000"}