{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-02T15:46:05+0000", "description": "&lt;p&gt;Cambridgeshire &amp; Peterborough NHS Foundation Trust (CPFT) provides integrated community and mental health, learning disability and social care services of the highest standard due to our continued commitment to quality and service improvement. We aim to support people of all ages to achieve the very best they can for their health and well being. To ensure that we achieve this goal we look to recruit candidates of a high calibre that share our passion for delivering excellent service user care, research and education.&lt;/p&gt;\n&lt;p&gt;An exciting vacancy has arisen for an enthusiastic and motivated full time (37.5 hours per week) Band 6 community respiratory physiotherapist to join our team. As part of a MDT they will provide expert supportive care for community-based respiratory patients, by helping to prevent avoidable hospital attendances, providing facilitated support following hospital admission and the promotion of self management; in addition they will be responsible for the delivery of our commissioned Pulmonary Rehabilitation programmes for those living with chronic respiratory disease.&lt;/p&gt;\n&lt;p&gt;The base of this post is to be discussed within Cambridgeshire and Peterborough, however the successful candidate will be required to work flexibly across the countywide respiratory service and therefore significant amounts of travel is required.&lt;/p&gt;\n&lt;p&gt;The CPFT Respiratory Service exists to deliver high quality care for those with long-term respiratory conditions. Specialist Nurses and Physiotherapists draw upon expert knowledge to support both our patients and their wider health and care support network. We work passionately to equip our patients with the skills and resources to empower them to take control of their self-care and enable them to remain in their own home.&lt;/p&gt;\n&lt;p&gt;The successful candidate must be capable of working autonomously whilst supported by a small established team. They will work in collaboration with other services across CPFT and other stakeholders in order to make a positive impact on the health and well being of patients with chronic respiratory disease. They will also act as a resource of respiratory knowledge for patients and other health professionals.&lt;/p&gt;\n&lt;p&gt;This post is open to appropriately qualified and registered physiotherapists with the right attributes, skills and experience to enhance our team. It is anticipated that the successful candidate will have respiratory and/or community experience, however, training and support is available for candidates with the potential to develop.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of an expanding and developing specialist service, striving to make a real difference for our community by supporting people with long-term respiratory conditions we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Benefits of working for CPFT include:&lt;br /&gt;• Annual leave allowance 27 days plus bank holidays (or greater depending on cumulative NHS service)&lt;br /&gt;• NHS Pension scheme&lt;br /&gt;• Professional Counselling service&lt;br /&gt;• Salary sacrifice schemes&lt;br /&gt;• Staff discount schemes&lt;br /&gt;• Professional development via the CPFT Academy which provides in-house training programmes&lt;br /&gt;• Free on-site parking (or subsidised dependent on site)&lt;br /&gt;• Access to stress awareness training &amp; mindfulness training&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Louise Goswell&lt;/strong&gt;, Clinical Manager and Respiratory Specialist Physiotherapist &amp; Pulmonary Rehabilitation Lead on 07790571092 or via email louise.Goswell@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;or &lt;strong&gt;Deborah Watts&lt;/strong&gt;, Clinical Manager on 07983343218 or deborah.watts@cpft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various, Cambridgeshire and Peterborough", "postalCode": "PE29 7HN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3454", "longitude": "-.175684"}}, "title": "Community Respiratory Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252696", "validThrough": "2020-11-22T23:59:59+0000"}