{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-12T12:01:44+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Palliative Medicine &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Substantive full time (part time negotiable)&lt;/p&gt;\n&lt;p&gt;Salary £ 82,096– £ 110,683 per annum pro rata&lt;/p&gt;\n&lt;p&gt;Northamptonshire Healthcare NHS Foundation Trust (NHFT) has been rated as Outstanding by CQC since 2018 and continues to be committed to achieving the Trust’s vision to be a leading provider of outstanding, compassionate care as well as being an employer of choice and a great place to work.&lt;/p&gt;\n&lt;p&gt;The Trust’s mission statement “Making a difference for you, with you” is at the core of everything we do and through every service we provide, we want to make a difference in people&#39;s lives.&lt;/p&gt;\n&lt;p&gt;NHFT has joined with Kettering General Hospital NHS Foundation Trust (KGH) to work collaboratively in continuing to expand Specialist Palliative Care services and have created a new and exciting opportunity for a Consultant in Palliative Medicine to be a part of this journey. We are looking for candidates who put People First; treat others with respect and compassion; demonstrates a dedication to equality and diversity and strives to improve lives of the people we serve.&lt;/p&gt;\n&lt;p&gt;The postholder will primarily be based at KGH with an in-patient caseload at Cynthia Spencer Hospice in Northampton. The Specialist Palliative Care service is a countywide service and the successful candidate will be required to work at other sites in response to clinical need. The successful candidate will, in addition to everyday clinical care, work with the End of Life Care Lead at KGH to deliver teaching and training; and to develop new educational resources. KGH has excellent simulation facilities, which are already being used to deliver palliative care teaching. There is also a possibility to expand the successful candidate’s scope of work in clinical governance and strategic development of end of life care at KGH.&lt;/p&gt;\n&lt;p&gt;The successful candidate will share an in-patient caseload with current Consultants at Cynthia Spencer Hospice in Northampton; and there is scope to include outpatient and domiciliary work. The postholder will be part of the established Specialist Palliative Care service, which is a key provider of end of life care in Northamptonshire. This post works alongside four established, highly experienced and dedicated Consultants and supported by 10.0 WTE junior and middle grade doctors in training and non-training grades. At KGH, the postholder will work alongside an experienced and supportive team of Palliative Care Nurse Specialists. This post offers the opportunity to work in a variety of care settings with emphasis on hospital-based palliative and end of life care delivery and the ideal candidate will therefore need to show a commitment to working compassionately within a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Northamptonshire is a rural county with a growing diverse population. The catchment area of KGH includes the rapidly developing town of Corby. Major towns of the county are connected with London and other cities in the Midlands by rail and road. Thus, the post provides an exciting opportunity to develop culturally sensitive, responsive and proactive services for a growing and diverse community. At NHFT, there is emphasis on integration of various community services to improve and develop care pathways to provide care outside the acute hospitals. This direction of care nearer home provides an opportunity to be innovative and to lead system change.&lt;/p&gt;\n&lt;p&gt;The ability to work across the system to influence policy and patient experience is vital, including the collaborative working with neighbouring counties.&lt;/p&gt;\n&lt;p&gt;This new and exciting opportunity is for applicants who hold full GMC registration and are on the GMC Specialist Register for Palliative Medicine or within 6 months of CCT date at the time of interview. We are looking for an individual who can demonstrate that they represent the Trust’s values and leadership behaviours and has the skills, knowledge and passion for this specialism to deliver outstanding care.&lt;/p&gt;\n&lt;p&gt;Applications are invited from candidates willing to work full or part-time. Provisional interview date is 7 December 2020.&lt;/p&gt;\n&lt;p&gt;For further information, please visit the websites of NHFT, KGH, Cransley Hospice and Cynthia Spencer Hospice. For further discussion or for an informal visit please contact Dr Sanjay Shah, Clinical Lead via sanjay.shah@nhft.nhs.uk or by calling 01536452013. We look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;Making a difference with you, for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr S ShahJob titleConsultantEmail addressJenny.french@nhft.nhs.ukTelephone number01604 682682&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hospital, Kettering", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Consultant in Palliative Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222233", "validThrough": "2020-11-12T23:59:59+0000"}