{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14658", "minValue": "14658", "unitText": "YEAR", "value": "£8.72 plus enhancements"}}, "datePosted": "2020-10-25T13:29:29+0000", "description": "&lt;h2&gt;Housekeepers | Hospitality | £8.71 per hour plus enhancements | Didsbury | Full Time - Monday to Friday 6pm to 12am&lt;/h2&gt;\n&lt;h2&gt;Spire Manchester Hospital, located in the Heart of Didsbury has an exciting opportunities for experienced Domestic Assistants/Cleaners/Housekeepers to join our Hospital Services Teamon a Permanent Basis. We have Full Time vacancies available between 30 and 37.5 Hours per week.&lt;/h2&gt;\n&lt;p&gt;You will be part of a team who pride themselves on providing exemplary hygiene and cleanliness standards for patients and staff.&lt;/p&gt;\n&lt;p&gt;This role is for hours 6pm to 12am Monday to Friday. Please only apply if you are able to commit to these shifts.&lt;/p&gt;\n&lt;p&gt;Spire Manchester Hospital is a brand new, £65m state-of-the-art healthcare facility offering you the opportunity to work across a wide variety of specialisms. You will be able to develop your clinical skills in a modern and progressive environment. The Manchester team currently consists of over 500 colleagues and we are rapidly expanding as we increase the scope of services we provide across our experienced and dynamic teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Duties and responsibilities&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Hospital covers a wide variety of procedures, as a Housekeeper, you must ensure you maintain high standards of cleanliness throughout the hospital in line with the housekeeping and infection control policy.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work in close liaison with our clinical staff, understanding the special needs of the hospital on a day to day basis and always ensuring our Hospital is immaculate.&lt;/p&gt;\n&lt;p&gt;Quality assurance and patient confidentiality must always be maintained, you will be pivotal in ensuring compliance with all Health and Safety at Work regulations including COSHH.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Who we&#39;re looking for&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ideally you will be an experienced Housekeeper from either a Healthcare or Domestic cleaning background with demonstrable experience in a customer facing environment/role. The successful candidate will have proven experience working unsupervised and on your own initiative, coupled with a positive and flexible approach to customer service and strong communication skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Benefits&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;33 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Free on-site Gym&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please see the attached benefits leaflet for more information&lt;/p&gt;\n&lt;p&gt;We commit to our employee’s well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;For us,&lt;/em&gt;&lt;em&gt;it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M20 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4149", "longitude": "-2.23507"}}, "title": "Domestic Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241587", "validThrough": "2020-11-08T23:59:59+0000"}