{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Hourly Rate"}}, "datePosted": "2020-10-30T13:25:47+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;BANK Health Visitor&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;strong&gt;&lt;span&gt;Basildon / Brentwood / Castle Point / Rayleigh / Rochford / Thundersley/ Billericay&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a registered nurse / midwife with a Specialist Community Public Health Nursing qualification? Are youlooking for flexible NHS bank opportunities to fit around your lifestyle?If so, this could be the place for you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Valued&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Health Visitor,you’ll be working as part of the NHS system in South Essex, delivering heartfelt service, making families really feel the difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As well as the attractive hourly rates of pay, you’ll benefit from:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Working in an environment focused on the highest clinical and quality standards with 91% of our services being rated overall&lt;strong&gt;good&lt;/strong&gt;or&lt;strong&gt;outstanding&lt;/strong&gt;by the CQC&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Flexible hours either full time or part time, allowing you to achieve the best&lt;strong&gt;work / life balance&lt;/strong&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Opportunities to work in different areas and various different services to gain new knowledge and experience&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to our Strive for Better networks, a national support and professional network made up of NHS professionals like you, giving you the chance to&lt;strong&gt;constantly develop industry-leading care and quality&lt;/strong&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Free statutory and mandatory training, as well as access to a range of courses and e-learning to develop further skills,&lt;strong&gt;continuing your professional development&lt;/strong&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to our free well-being service available 24/7/365 online and by telephone including; counsellors, post trauma incident support, legal, debt and practical life management helpline, guided self-help, telephonic career coaching and monthly well-being newsletters&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to information on permanent vacancies&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Proud&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In South Essex you’ll join a team who are supportive, dedicated and always go the extra mile for the children and families with a recent CQC rating of “Good”&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are also trail blazing a new operating model that is taking the healthcare market by storm – we are presenting to government and other Local Authorities around the country on our integrated partnership model with Barnardo’s – a model that drives efficiencies so we can put more people in our services, spending time with children and families to improve health outcomes in the local community.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a BankHealth Visitor you will support children predominantly 0-8 years delivering holistic health care, including the development, implementation and evaluation of packages of care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care partner with the NHS and local authorities, providing high quality care for more than 1 million people each year up and down the country. We are an ambitious, forward thinking and passionate company who strive to make a real difference to people and our colleagues. We re-invest all of the money we earn to improve the experience, deliver ambitious transformations and empower all of our colleagues to make the changes, no matter how big or small, that make a real difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;So why not click apply to find out where your journey with Virgin Care can take you! If you’d like to discuss the role further, please contact Natalie Jones via email: natalie.jones@virgincare.co.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Virgin Care&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care is committed to safeguarding and protecting the children and young people that we work with. As such, all posts are subject to a safer recruitment process, including the disclosure of criminal records and vetting checks. We ensure that we have a range of policies and procedures in place which promote safeguarding and safer working practice across our services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon", "postalCode": "SS14 3EZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5915", "longitude": ".496223"}}, "title": "Bank Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250346", "validThrough": "2020-11-13T23:59:59+0000"}