{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-06T09:10:56+0000", "description": "&lt;p&gt;Would you like to be part of a forward thinking progressive service that is embracing the therapeutic day and recovery into acute mental health wards?&lt;/p&gt;\n&lt;p&gt;Are you someone who has a passion for working with adults with acute mental illness and who wants to use your core skills as an Occupational Therapist?&lt;/p&gt;\n&lt;p&gt;We are taking an innovative approach in our adult acute inpatient services. In response to our service users’ needs and the demand for access to therapy across the 7 day period we have increased our Occupational Therapy posts to be able to support this new way of working. This post will be based on the ward within the MDT team with support and access to the wider OT team and professional network within the acute services.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit an enthusiastic and motivated Occupational Therapist. You will be responsible for providing OT assessments and interventions both individual and in groups. You will work closely with the nursing teams, unit OTs, support workers and to provide a therapeutic programme that supports the use of activity and recovery. You will share skills and undertake tasks that support the nursing roles that maximises service user engagement.&lt;/p&gt;\n&lt;p&gt;You will need to be a dynamic clinician with good interpersonal skills to enable engagement of service users in the therapeutic programme. You will need to be flexible and be prepared to work an early and/or late shift pattern (including weekends).&lt;/p&gt;\n&lt;p&gt;DHCFT offers both personal and clinical development opportunities, in addition to regular professional and clinical supervision, Personal Development Plans, and support for Continual Professional Development activities. We also offer a number of clinical and professional development opportunities through our clinical forums and internal professional networks and links with local universities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jenny Jarman, Senior Occupational Therapist, on 01246 512563 or April Saunders, Senior OT Lead Hartington Unit on 07917 506475.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chesterfield Royal Hospital, Calow, Chesterfield", "postalCode": "S44 5BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2362", "longitude": "-1.40008"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258970", "validThrough": "2020-11-22T23:59:59+0000"}