{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39867", "minValue": "36708", "unitText": "YEAR", "value": "£36,708 to £39,867"}}, "datePosted": "2020-11-02T12:09:48+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Specialist School Nurse&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt;Salary - £36,708 - £39,867 (£21,460 to £23,306 pro rata) | Based in Kingston | Permanent | Part-time | 24 hours per week, Term time only&lt;br /&gt;&lt;br /&gt;There’s never been a better time to join Achieving for Children (AfC), we were awarded&lt;strong&gt;OUTSTANDING&lt;/strong&gt;in our October 2019 Kingston Ofsted inspection.&lt;br /&gt;&lt;br /&gt;If you have the skills that will enable us to continue to enhance our practice and improve outcomes for children further, we want to hear from you. We are looking for bright, enthusiastic people who have the passion and the drive to make a positive difference to children’s lives. By recognising and championing strengths we know we can make a real difference. It’s a genuine team effort in AfC. That’s why we want talented people, like you, to join us and help create a brighter future for children and families. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About the role&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;Working as a specialist school nurse, primarily based at Dysart School, you will provide holistic, family centred care for children and young people with complex health needs.&lt;br /&gt;&lt;br /&gt;As a Specialist School Nurse for Achieving for Children, you will be responsible for&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensuring the safe delivery of specialist nursing care to children and young people whilst in school and in the community, working in partnership with hospital/ specialist teams.&lt;/li&gt;\n&lt;li&gt;Providing holistic nursing care and family support to children and young people, including health advice and promotion, ensuring the views of the child/ young person are listened to, respected and incorporated into care as appropriate.&lt;/li&gt;\n&lt;li&gt;Delivering specialist training to parents/ carers and teaching staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About AfC&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt;We are a not-for-profit social enterprise owned by three local authorities (Kingston, Richmond and Windsor &amp; Maidenhead), we offer the freedoms of a social enterprise with the employment benefits of local government. To find out more about usclick here.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About you&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt;To be a Specialist School Nurse for AfC, you will be passionate about making a positive difference to the lives of children and young people as well as demonstrating the following points&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Children’s Nurse (RN Child/RSCN) with a minimum of 2 years post qualification experience in paediatric nursing.&lt;/li&gt;\n&lt;li&gt;Experience of working with children and young people with special needs.&lt;/li&gt;\n&lt;li&gt;An ability to work independently and flexibly and adapt to change as service need requires.&lt;/li&gt;\n&lt;li&gt;Display excellent communication skills, both verbal and non-verbal.&lt;/li&gt;\n&lt;li&gt;Show initiative and a passion to work with children and young people.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About our benefits&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt;When you join AfC you will have access to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Positive and supportive working environments&lt;/strong&gt;- We have a highly supportive working environment in which managers are challenging and supporting in equal measures.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Positive work-life balance&lt;/strong&gt;- Access to employee benefits and support forms part of our health and wellbeing offer.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A competitive salary and access to LA pension scheme&lt;/strong&gt;- Our salaries are benchmarked against other local authorities.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A range of staff benefits and discounts managed via your own app&lt;/strong&gt;- Staff can enjoy a wide range of discounts on sports and leisure activities and everyday shopping through AfC My Place.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional reflective supervision&lt;/strong&gt;- Regular, high-quality reflective supervision which helps to build confidence is available to all.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Strong Management&lt;/strong&gt;- A strong performance management culture, with an equally strong focus on practice learning is embedded across the organisation.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A fantastic learning and development offer&lt;/strong&gt;- A clearly set out and accessible learning and development pathway, offering an extensive range of training and learning opportunities is accessible for all. This includes funding for post qualifying courses.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To find out about all of the breadths of benefits of working for Achieving for Childrenclick here&lt;br /&gt;&lt;br /&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Start dates&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt;Achieving for Children havefixed start dates, candidates are advised to prepare for this should a job offer be accepted to ensure eligible continuous service is not affected.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;To apply&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt;If you would like more information about this role please see ourrole profile. Please apply online including a supporting statement addressing how you meet the criteria for this post detailing what skills, knowledge, experience and abilities you can bring to the role, as outlined in the Role Profile&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Closing Date: 16th November 2020&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;If you would like to find out more about this exciting opportunity, please contact Kirsty Dobson, Children’s Community Nursing Team Lead, on kirsty.dobson@achievingforchildren.org.uk or 07710 117626 to request an informal discussion. &lt;br /&gt;&lt;br /&gt;&lt;em&gt;Achieving for Children is an equal opportunities employer and is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults. We expect all staff and volunteers to share this commitment.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Royal Borough of Kingston upon Thames", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130374"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston upon Thames", "postalCode": "KT1 1EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4078", "longitude": "-.306445"}}, "title": "Specialist School Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251984", "validThrough": "2020-11-16T23:59:59+0000"}