{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-06T14:15:15+0000", "description": "&lt;p&gt;North East Lincolnshire Clinical Commissioning Group is responsible for commissioning high quality health and adult social care services for a population of approximately 170,000. We work closely with providers of health services, local government, regulatory bodies, voluntary and carer groups, patient representatives and the general public to achieve the best health and care outcomes possible and to ensure high quality, safe and effective services.&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated and enthusiastic individual to joint NELCCG as an administrative assistant in the Care and Independence team working within adult services. The role requires the provision of an efficient and effective secretarial and administrative service to the senior team within the CCG.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to have proven experience of producing accurate notes, preparing agendas and the management of very busy diaries. They should have experience of working in a busy administrative environment and have excellent organizational and communication skills with the ability to manage and prioritize a busy workload. It is essential that the successful candidate has excellent computer skills and a wide knowledge of Microsoft applications including outlook, word, excel and Microsoft Teams.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have the ability to work under their own initiative, be flexible, conscientious and be willing to learn new skills.&lt;/p&gt;\n&lt;p&gt;Strict adherence to the rules of confidentiality must be maintained.&lt;/p&gt;\n&lt;p&gt;We operate an agile working environment which enables our workforce to be flexible, efficient and have the ability to work in a variety of locations.&lt;/p&gt;\n&lt;p&gt;NELCCG welcomes applications from all parts of the community and particularly from applicants with a BME background.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North East Lincolnshire CCG ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grimsby", "postalCode": "DN31 2UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5792", "longitude": "-.106037"}}, "title": "ADMINISTRATIVE ASSISTANT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260071", "validThrough": "2020-11-22T23:59:59+0000"}