{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-11-02T13:16:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Deputy Business Support Manager – 0.6wte 22.5hrs – Fixed Term initially for 12 months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The newly established Specialist Services Care Group provides inpatient and community services for children and adults needing specialist mental health assessment, care and treatment. As an organisation we are absolutely committed to strengthening and creating real opportunities for learning, improving and working creatively.&lt;/p&gt;\n&lt;p&gt;Our Care Group includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Early Intervention in Psychosis Service&lt;/li&gt;\n&lt;li&gt;Eating Disorder Service (for adolescents across the county and for adults as well in Yarmouth and Waveney)&lt;/li&gt;\n&lt;li&gt;Perinatal Mental Health Service&lt;/li&gt;\n&lt;li&gt;Dragonfly Unit (adolescent in-patient ward)&lt;/li&gt;\n&lt;li&gt;Kingfisher Mother and Baby Unit.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;With the Specialist Services continuing to expand we are looking to recruit a Deputy Business Support Manager on a part-time basis to support the Early Intervention in Psychosis Services and Eating Disorder Services across Norfolk. You will work closely alongside the other Deputy Business Support Manager who supports the Perinatal Mental Health Service, the Dragonfly Unit and the Kingfisher Mother and Baby Unit. There will be an expectation that during times of absence, cover across these teams will be required.&lt;/p&gt;\n&lt;p&gt;As the Deputy Business Support Manager, you will be key in delivering Information and Intelligence to help drive improvements in performance and support transformation projects and initiatives across the Trust aimed at improving service user care.&lt;/p&gt;\n&lt;p&gt;As a new Care Group we are focused on improving how we collate, analyse and share our information to drive better clinical performance and we are seeking to appoint confident, committed, skilled and motivated individuals to work as part of the clinically-led Specialist Services Care Group in Norfolk and Waveney.&lt;/p&gt;\n&lt;p&gt;You will be responsible for ensuring the day to day delivery of reporting and will have previous experience of working flexibly, under pressured conditions and be adaptable to changing requirements and deadlines.&lt;/p&gt;\n&lt;p&gt;Your role will involve leading a team of Administrators, who are responsible for the delivery of effective and efficient business support across the Care Group. You should have the ability to produce intelligence derived from a range of data collected via Trust systems held locally and deliver succinct reporting that supports stakeholder requirements that may be used for service delivery, service improvement, business planning and commissioning. You will possess good technical, analytical, communication and organisational skills with a flair for improvement.&lt;/p&gt;\n&lt;p&gt;This is a part time post (22.5 hours). There is flexibility around the working pattern and where the post will be based, with opportunities to work remotely. There will be a requirement to be able to travel independently across Norfolk and Suffolk on occasion.&lt;/p&gt;\n&lt;p&gt;If you feel you have the vision and drive to offer dynamic leadership to hardworking services, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Shabana Alexander&lt;/p&gt;\n&lt;p&gt;Job title: Performance &amp; Information Business Support Manager&lt;/p&gt;\n&lt;p&gt;Email address: shabana.alexander@nsft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07795401558&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;shabana.alexander@nsft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across Norfolk, Norwich, Great Yarmouth/Waveney and Kings Lynn", "postalCode": "NR6 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6596", "longitude": "1.25089"}}, "title": "Deputy Business Support Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252201", "validThrough": "2020-11-16T23:59:59+0000"}