{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum, pro rata"}}, "datePosted": "2020-11-02T17:15:58+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Nursery Nurse to join our dedicated Community Health Visiting Team in Wrightington, Wigan and Leigh Foundation Trust. A requirement of the role will be to support families by assessing development, utilising appropriate assessment tools and delivering packages of care under the direction of the named Health Visitor. You will be required to work in a variety of settings such as the family home and community hubs including Children Centres and Early Years settings.&lt;/p&gt;\n&lt;p&gt;The role will include carrying out children’s development reviews, group activities, health promotion and health education programmes as delegated by the Health Visitor in the provision of the Healthy Child Programme. You will do so in line with the local policy and National Guidance, offering early support as required. You will work with all families including universal, universal plus and universal partnership plus and you will be expected to actively participate/lead when working with families who need Early Helps to support them.&lt;/p&gt;\n&lt;p&gt;There are various part-time hours available, which can be discussed at interview.&lt;/p&gt;\n&lt;p&gt;Professional childcare knowledge is required eg BTEC / NNEB or equivalent. A working knowledge of SystmOne is preferable although training will be provided.&lt;/p&gt;\n&lt;p&gt;The role will require you to work across all areas in the Trust which may include working with patients designated as positive, asymptomatic and negative for COVID-19.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note: Candidates will be asked to provide original qualifications at interview. An Enhanced DBS (with checks against the Adults and Children&#39;s Barred lists) will be obtained for the successful candidate at pre-employment check stage.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If a high volume of applications has been received the vacancy may close earlier than the given closing &lt;/strong&gt;date&lt;strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name - Emma Taylor&lt;/p&gt;\n&lt;p&gt;Job title - Team Leader&lt;/p&gt;\n&lt;p&gt;Email address - emma.taylor98@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number - 07786 504053&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Sharon Swift&lt;/p&gt;\n&lt;p&gt;Health Visiting Team Leader&lt;/p&gt;\n&lt;p&gt;Sharon.swift@nhs.net&lt;/p&gt;\n&lt;p&gt;contact: 07767 670208&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wrightington, Wigan and Leigh NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wigan", "postalCode": "WN1 2NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5576", "longitude": "-2.62953"}}, "title": "Community Nursery Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253015", "validThrough": "2020-11-15T23:59:59+0000"}