{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum, pro rata"}}, "datePosted": "2020-10-30T12:10:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Somerset Intermediate Care service-  Rapid Response Team- Healthcare Support Workers&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community based setting.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cotford St Luke, Dene Barton Hospital location.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a great opportunity for you to join our new and developing community based admission avoidance service in Somerset.&lt;/p&gt;\n&lt;p&gt;The key aim of the new service is to prevent unnecessary admissions to hospital, providing a rapid short term intervention to adults in their own homes.&lt;/p&gt;\n&lt;p&gt;We are looking for dynamic individuals who work well in a team and have a flexible ‘can do’ attitude to providing care and support to patients in their own home.&lt;/p&gt;\n&lt;p&gt;Previous community experience is desired, but not essential as the teams will give you the support and guidance you need to succeed in the role. We will ensure we support you to develop your skills through on the job training. You&#39;ll be required to work shifts over 7 days a week between the hours of 08:00 and 23:00, and 21:45hrs and 08:15hrs for night shifts. Flexible working requests can be considered and will be discussed at interview.&lt;/p&gt;\n&lt;p&gt;The service operates across Somerset targeting key areas with high numbers of hospital admissions and has bases in Taunton/Bridgwater, South Somerset area, and West Mendip. You will expected to work either in pairs or individually and be must prepared to do home care visits alone depending on patient needs. A clinical Supervisor also oversees each shift, providing support as and when required.&lt;/p&gt;\n&lt;p&gt;As this is a community based position, a driving license with access to your own vehicle and business insurance is essential. Hours and shifts are offered on a full or part time basis.&lt;/p&gt;\n&lt;p&gt;We are looking for Support Workers who are confident, flexible and competent with good communication skills. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you think this is for you, please get in touch, we&#39;d love to hear from you!&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dene Barton Community Hospital, Cotford St Luke", "postalCode": "TA4 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0376", "longitude": "-3.18224"}}, "title": "Senior Support Worker (Community), Band 3 – Rapid Response Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250099", "validThrough": "2020-11-13T23:59:59+0000"}