{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-26T15:01:35+0000", "description": "&lt;p&gt;On 1st April 2020, North Manchester General Hospital became part of Manchester University NHS Foundation Trust (MFT) under a new management agreement. The Northern Care Alliance NHS Group will continue to support North Manchester with its recruitment and workforce requirements until the service is formally transferred into MFT. All subsequent appointments to North Manchester will hold an employment contract with MFT. North Manchester General Hospital has a vibrant future ahead as it works with MFT to provide better care for patients and their families in the local community and across Greater Manchester.  Plans to create an innovative health campus which will see a new hospital build and the development of a ‘wellbeing hub’ that will bring health and economic benefits to the wider community. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a RN Adult to join our amazing team on our Accident and Emergency Department as Band 5 Staff Nurse.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Is providing excellent nursing care and getting the basics right one of your key drivers? Is making a difference and doing the right thing fundamental to you?&lt;br /&gt;&lt;br /&gt;This post will allow you the opportunity to deliver the nursing skills you have whilst developing both your clinical and leadership skills, whilst ensuring the highest quality of care is delivered to our patients and families.&lt;br /&gt;&lt;br /&gt;We are looking for nurses who possess excellent communication skills as you will work closely with the multi-disciplinary team within department and wider hospital setting.&lt;br /&gt;&lt;br /&gt;If you are ready for a change or are looking for your first post we would like to hear from you. We are looking for nurses who are enthusiastic and motivated, as we seek to deliver high quality care to all our patients and their families&lt;br /&gt;&lt;br /&gt;We are looking for someone who will drive and support innovation in nursing care and patient pathways across the department working with our senior team to drive the service forward&lt;br /&gt;&lt;br /&gt;The post can be full time or part time and involves full internal rotation to all shift patterns.&lt;br /&gt;&lt;br /&gt;We value our workforce as we see you as the means to ensuring the highest quality care for all our patients, at every attendance, every time.&lt;br /&gt;&lt;br /&gt;Informal visits are welcome.&lt;/p&gt;\n&lt;p&gt;In line with the Trust&#39;s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, nationality, religion, marital status, social background or trade union membership.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Sarah Slicker&lt;/p&gt;\n&lt;p&gt;Lead Nurse&lt;/p&gt;\n&lt;p&gt;sarah.slicker@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;All communications to applicants will be via the email address provided on your application form and all further correspondence will be through email, therefore please ensure that you regularly check your emails after the closing date for this post.&lt;/p&gt;\n&lt;p&gt;You are advised to check Spam and Junk folders as emails can sometimes go to these folders. Although references are not requested until a conditional offer is made, we would be grateful if you could provide us with email addresses for your referees when prompted by the application form.&lt;/p&gt;\n&lt;p&gt;Any messages sent via NHS Jobs may not be reviewed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you have any queries please contact the Manager for this vacancy as detailed in the advert.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, North Manchester Care Organisation, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Staff Nurse - Accident &amp; Emergency", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243034", "validThrough": "2020-11-09T23:59:59+0000"}