{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 per annum"}}, "datePosted": "2020-10-27T09:31:25+0000", "description": "&lt;p&gt;&lt;strong&gt;Mental health nurse, CAMHS Inpatient unit (Wokingham)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit &lt;strong&gt;passionate&lt;/strong&gt; mental health nurses who hold a keen desire to work within a CAMHS setting. You will be based at Willow House which will offer a rewarding opportunity to deliver high-level mental health care in a truly supportive and professional environment. Our well-regarded facility caters mostly to in-patients aged 12-18 years with severe and enduring problems as well as social and emotional development issues.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role of Staff Nurse requires the assessment, development, implementation and evaluation of nursing care. You will need excellent communication skills to support both patients and their families, together with a friendly and compassionate outlook. You will also be well organized and confident in working without supervision, whilst interacting regularly with multi-disciplined staff and senior consultants.&lt;/p&gt;\n&lt;p&gt;In return you will benefit from a culture that is firmly centred on staff support and development, enabling genuine job satisfaction. Much of our work is innovative and you will enjoy full involvement while being encouraged to contribute your own thoughts and initiatives. Further training opportunities will ensure you can fulfil your career potential, and in 2020 we will be moving into a new state-of-the-art facility.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Work base&lt;/strong&gt; – Willow House, Wokingham Hospital, Barkham Road, Wokingham, Berkshire, RG41 2RE&lt;/p&gt;\n&lt;p&gt;Some of the benefits of joining our team:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary ranging from &lt;strong&gt;£24,907&lt;/strong&gt; to&lt;strong&gt; £30,615&lt;/strong&gt; per annum&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;High cost area supplements&lt;/strong&gt; provided&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working&lt;/strong&gt; opportunities and a strong emphasis on &lt;strong&gt;work life balance&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Annual leave – 27 days for new starters, 29 days after 5 years and 33 days after 10 years NHS service plus &lt;strong&gt;8 days bank holidays&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Excellent &lt;strong&gt;learning and development&lt;/strong&gt; opportunities&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Salary sacrifice&lt;/strong&gt; scheme for a &lt;strong&gt;new car&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;strong&gt;Lease car scheme &lt;/strong&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Generous &lt;strong&gt;maternity&lt;/strong&gt;, &lt;strong&gt;paternity&lt;/strong&gt; and &lt;strong&gt;adoption leave&lt;/strong&gt; for eligible staff&lt;/li&gt;\n&lt;li&gt;Advanced &lt;strong&gt;IT enablement and support&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent staff &lt;strong&gt;support and advice&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you familiar with Wokingham?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are not familiar with the market town of Wokingham, it lies approximately 4 miles west of Bracknell and 7 miles from Reading. Transport links are excellent. Wokingham is extremely well-placed, being served by the A329 London to Reading road and by the M4, which links it to Heathrow airport, the West of England and South Wales.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The 3 “must haves” for you to be considered for this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Either a qualified mental health nurse or currently in your last year of training (with NMC registration)&lt;/li&gt;\n&lt;li&gt;Confident in working without direct supervision but will enjoy constant interaction with other members of a multi-disciplinary team&lt;/li&gt;\n&lt;li&gt;Most of all you will have a calm, friendly and compassionate outlook and understand its vital importance within professional care&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Should you identify with the person we are looking for above, then we would recommend you make your application to work at Berkshire Healthcare NHS Foundation Trust!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details about this role or questions in general about working for Berkshire Healthcare please contact &lt;strong&gt;Rebecca Martin &lt;/strong&gt;on &lt;strong&gt;07342 068975 &lt;/strong&gt;or via email at &lt;strong&gt;Rebecca.Martin@berkshire.nhs.uk&lt;/strong&gt;.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Willow House, Wokingham Hospital, Barkham Rd, RG41 2RE, Wokingham", "postalCode": "RG41 2XR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4104", "longitude": "-.843681"}}, "title": "Mental Health Nurse, CAMHS Inpatient Unit (Wokingham)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243840", "validThrough": "2020-11-29T23:59:59+0000"}