{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 per annum"}}, "datePosted": "2020-10-07T15:35:51+0100", "description": "&lt;p&gt;&lt;strong&gt;About Sirona Care &amp; Health&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The recent award of a 10 year contract for Adult Community Health Services contract across Bristol, North Somerset and Gloucestershire (BNSSG) and the growth and development of Sirona is a new and exciting chapter. This will enable us, together with our colleagues across the system, to work with individuals, carers and families to transform out-of-hospital services to support people to live longer and healthier lives, accessing care and support close to where they live and ensure consistency and equity across BNSSG&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;South Gloucestershire Learning Disability Services&lt;/strong&gt;&lt;br /&gt;The South Gloucestershire Specialist Psychiatric services for people with Learning Disabilities transferred to Sirona care &amp; health on 1st October 2013.&lt;br /&gt;The post holder will be a local champion for people with learning disabilities, and to facilitate people developing skills in working with adults with a learning disability. The post holder is will help maximise the access of people with learning disabilities to the services and resources available from mainstream mental health and other services through collaborative working. The post already has strong links with local generic psychiatry networks.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;br /&gt;We are looking for a Consultant Psychiatrist to join our Learning Disability team, based in South Gloucestershire. &lt;br /&gt;The post holder will work together with the Learning Disabilities Services Manager to ensure that a safe, efficient and appropriate service is made available to the people in the catchment area. The Consultant will play a key role within the multi-disciplinary team. The successful candidate will be responsible for psychiatric assessment and management of adults with learning disabilities referred through the South Gloucestershire Learning Disabilities Service, Senior Psychiatric input into South Gloucestershire Learning Disabilities Service will support of the practice of other clinicians and the supervision of Psychiatric medical staff working within the South Gloucestershire Learning Disabilities Service. The post holder will be required to interface with Neurology and other services where needed to facilitate access of service users into services that provide the most appropriate care for people with learning disabilities.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity including: &lt;br /&gt;• Individualised offer with consideration of flexible hours and support for special interests &lt;br /&gt;• Support for consultants to be involved in relevant College / Union / University projects &lt;br /&gt;• Service development and driving forwards an established, modern psychiatric service &lt;br /&gt;• Working alongside, and access to, other CLDT teams and Psychiatry colleagues across the BNSSG footprint &lt;br /&gt;• Established SLA with AWP for Medical leadership, CPD and PDP programme enabling access to a large and inclusive Learning Disability Psychiatry peer-support network&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holder will also have on call duties, administrative duties and be responsible for the teaching and supervision of junior medical staff. There will be full time secretarial support and access to a private shared office, mobile phone and computer facilities. The IT facilities include laptop accessing Sirona and AWP systems.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to have transport available to fulfil the requirements of the post and live within 10 miles of the centre of Bristol or within 45 minutes travelling distance.&lt;/p&gt;\n&lt;p&gt;If you would like a further discussion regarding the role, please contact Sarah Whiteaker – sarah.whiteaker1@nhs.net or Dr Kate Rush – kate.rush2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS16 4RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4727", "longitude": "-2.50681"}}, "title": "Consultant Psychiatrist - Psychiatry of Learning Disabilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217149", "validThrough": "2020-11-08T23:59:59+0000"}