{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-06T08:17:15+0000", "description": "&lt;p&gt;&lt;strong&gt;PREVIOUS APPLICANTS NEED NOT APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 – Specialist Practitioner Mental Health in Schools Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Coventry and Warwickshire Partnership Trust, in partnership with South Warwickshire CCG have been successful in securing funding as part of the National Trailblazer programme for Mental Health in Schools Teams and the 4 Week Wait programme.&lt;/p&gt;\n&lt;p&gt;The Mental Health in Schools Teams (MHST) are bringing together a new workforce of Emotional &amp; Mental Health Practitioners (EMHP) whose role provides additional capacity to deliver evidence-based early interventions for children and young people experiencing mild to moderate mental health difficulties within educational settings. The teams will be providing brief, evidence based interventions at an early stage of need to children, young people and parents individually or in group settings as well as supporting the implementation of effective whole school approaches to mental health to improve outcomes and reduce the need for future more costly specialist CAMHS interventions.&lt;/p&gt;\n&lt;p&gt;The trainee EMHP’s started their placements in January 2020 and the Team Leader will support the supervision and management of the MHST as well as support additional recruitment and development of activities alongside a Service manager for the pilot to ensure an operational MHST will be in place by the New Year.&lt;/p&gt;\n&lt;p&gt;If you want to be part of an exciting new venture in child and adolescent mental health provision then this maybe the role for you. We are looking for enthusiastic people who have a professional qualification and current professional registration with a governing body. This is an exciting opportunity to support the leadership and development of the Mental Health in Schools Teams within the Coventry Pilot and candidates should have a substantial working knowledge of mental health in children and young people as well as a knowledge of support in schools, you will also ideally have had experience of team development and project working and be able to provide specialist supervision to team members. You will also possess additional training CBT.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for providing specialist supervision to other team members and will provide specialist input and intervention with more complex cases identified by schools; this will include assessment, intervention, consultation with other agencies and training. You will be required to hold a caseload of children and young people and be able to deliver brief interventions to them.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Chris Heydon – Service Manager, South Warwickshire Trailblazer tel: 01926 881640 or email: christine.heydon@covwarkpt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Coventry, Coventry", "postalCode": "CV1 4FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4181", "longitude": "-1.49965"}}, "title": "Specialist CAMHS Practitioner Mental Health in Schools Team - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258895", "validThrough": "2020-11-22T23:59:59+0000"}