{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-11-06T08:17:13+0000", "description": "&lt;p&gt;An exciting opportunity has arisen on ETC Surgery Ward to join our team in the position of full time Ward Clerk. The post holder will provide a comprehensive administration service and ensuring our patients and their relatives experience a co-ordinated and streamlined patient journey.&lt;/p&gt;\n&lt;p&gt;This is a very busy role and we are therefore looking for individuals with excellent communication skills, the ability to work well under pressure and the desire and enthusiasm to assist us in providing a first class service.&lt;/p&gt;\n&lt;p&gt;The working pattern for this post will be mostly Monday to Friday, with the occasional weekend/bank holiday.&lt;/p&gt;\n&lt;p&gt;As a valued employee of the Trust, you will be provided with a comprehensive induction, participate in discussing your development needs through your annual appraisal and will agree a personal development plan. You will also be given the opportunity to attend training courses to expand your existing skills.&lt;/p&gt;\n&lt;p&gt;Manchester University NHS Foundation Trust (MFT) is the leading Trust for teaching, research and specialist services in the North West of England. We provide an extensive range of district general hospital services to the local population of central Manchester and tertiary and specialist services to patients from across the North West and beyond.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVictoria TyasJob titleWard ManagerEmail addressVictoria.Tyas@mft.nhs.ukTelephone number0161 701 4775&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Royal Infirmary, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Ward Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258894", "validThrough": "2020-11-12T23:59:59+0000"}