{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-06T12:16:17+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM FOR 12 MONTHS DUE TO MEET THE NEEDS OF THE SERVICE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Medicines Management Directorate has an exciting opportunity for an enthusiastic and committed Pharmacy Technician to join our team based at Ysbyty Cwm Rhondda, providing services to our community hospitals: Ysbyty Cwm Rhondda and Ysbyty Cwm Cynon.&lt;/p&gt;\n&lt;p&gt;Our technicians are valued members of the multidisciplinary team at ward level in both community hospitals, and also work as ACTs in our automated dispensary at Ysbyty Cwm Rhondda.&lt;/p&gt;\n&lt;p&gt;You will work closely with pharmacists and other health care professionals to deliver high quality, patient focussed medicines management services, with a particular focus on supporting discharge for patients to ensure they are able to manage their medicines when they return home; this will involve assessing patients ability to self-administer their medicines and where additional support is needed, working with patients to identify appropriate solutions and liaising with primary care colleagues to ensure that transfer of care is seamless.&lt;/p&gt;\n&lt;p&gt;You must possess excellent communication and organisational skills in order to provide an efficient and safe pharmacy service for patients in these busy environments.&lt;/p&gt;\n&lt;p&gt;We are committed to the development of the technician role and can offer excellent in house training, where you will be supported and encouraged to further develop your skills in new and diverse roles.&lt;/p&gt;\n&lt;p&gt;Applicants must have a BTEC National Certificate /NVQ Level 3 in Pharmaceutical Sciences or equivalent qualification and be registered with the General Pharmaceutical Council. The Accredited Checking Technician qualification is required to be appointed to a Band 5, however, we will accept applications from individuals who are working towards or eligible to work towards the act qualification.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Janine Edmunds, Senior Pharmacy Technician&lt;br /&gt;janine.edmunds@wales.nhs.uk&lt;br /&gt;01443 443443 ext 72810&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Cwm Rhondda/Ysbyty Cwm Cynon, Tonypandy/Mountain Ash", "postalCode": "CF40 2LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6372", "longitude": "-3.44731"}}, "title": "Medicines Management Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259620", "validThrough": "2020-11-19T23:59:59+0000"}