{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001"}}, "datePosted": "2020-11-03T10:16:58+0000", "description": "&lt;p&gt;ELFS Shared Services, established in 2002 and hosted by Salford Royal NHS Foundation Trust, provides Transactional Finance and Payroll shared services to over 40 NHS organisations across the country from our offices in Darwen Lancashire. We are continually attracting new business and now plan to strengthen our management team to support the growth.&lt;/p&gt;\n&lt;p&gt;This is an exciting and unique opportunity to join and contribute to a forward thinking, high quality focused organisation which will provide a challenging and fast paced working environment and in return, an excellent developmental opportunity for someone who is looking to progress their career in finance within the NHS.&lt;/p&gt;\n&lt;p&gt;We are looking for a talented qualified accountant to take on the newly created role as &lt;strong&gt;Head of Operational Finance,&lt;/strong&gt; to lead a team of 70+ Finance staff across the Accounts Receivable and Technical Accounting teams as well as being a specialist Client liaison manager for specified Clients working to improve performance and to satisfy their requirements.&lt;/p&gt;\n&lt;p&gt;Based out of Darwen with occasional visits to clients nationally (Covid permitting), we are looking for an individual who has a drive and passion in delivering an exemplar service and who would like to progress their career in the NHS. You will be joining at a pivotal time in shaping, taking ownership and driving forward the team to ensure the organisation makes the correct business decisions, with a real passion and interest in supporting the development of smart automation for the business.&lt;/p&gt;\n&lt;p&gt;Personal qualities needed to deliver in this role are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Decisive&lt;/li&gt;\n&lt;li&gt;Proactive / A go-getter&lt;/li&gt;\n&lt;li&gt;Resilient&lt;/li&gt;\n&lt;li&gt;The ability to prioritise and juggle conflicting deadlines&lt;/li&gt;\n&lt;li&gt;Continually driving for improvement&lt;/li&gt;\n&lt;li&gt;Leading teams with great people skills – Engaging!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we offer: £52,306 - £60,983 (dependent upon experience) + benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We provide a supportive environment in which to learn and develop, with the opportunity to further your skills and career within an exciting and evolving environment.&lt;/p&gt;\n&lt;p&gt;Joining our inclusive and innovative team comes with a range of benefits including flexible working arrangements, a generous pension scheme and generous annual leave allowance.&lt;/p&gt;\n&lt;p&gt;With our training schemes and support networks, you will be empowered to play a leading role in the future of healthcare, whatever your specialism or interest. And as a member of NHS staff you will receive plenty of discounts from a host of restaurants and high-street stores too.&lt;/p&gt;\n&lt;p&gt;If you think you have the required skills, aptitude and commitment to join us on our journey, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level &lt;/em&gt;&lt;em&gt;of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kevin Round&lt;/p&gt;\n&lt;p&gt;07768 000420&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Darwen, Blackburn", "postalCode": "BB3 0FG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7147", "longitude": "-2.47947"}}, "title": "Head of Operational Finance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253411", "validThrough": "2020-11-20T23:59:59+0000"}