{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-11-03T16:00:31+0000", "description": "&lt;p&gt;Your new company&lt;/p&gt;\n&lt;p&gt;An exciting opportunity presents itself working for South Central West procurement team. We work both in local, regional and national environments. Projects include securing consultancy services, clinical services, and digital solutions along with non-clinical product buys.&lt;br /&gt;We are looking for a candidate with proven procurement skills or the enthusiasm and drive to develop these. Great customer focus is critical as we are an enabling service helping our colleagues deliver well for customers and patients. &lt;br /&gt;The successful candidate may have experience of other sectors, public or commercial and their skills will be transferrable. &lt;br /&gt;In light of Covid evolving our ways of working we are in a position where home working is the norm. It is likely that this will continue therefore we welcome candidates that are able to embrace that culture; support colleagues and team remotely, form relationships quickly and successfully maintain/service these relationships. Organising yourself well with diligence is critical. &lt;br /&gt;We welcome your interest and conversation. For further information or just to talk through to help you decide whether this is for you please contact Garry Mitchell, Deputy Director of Procurement (garry.mitchell@nhs.net) 07786 275 627&lt;/p&gt;\n&lt;p&gt;BACKGROUND&lt;/p&gt;\n&lt;p&gt;South, Central &amp; West CSU (SCW) is one of the largest Commissioning Support Units in the country, and support NHS clients across the South of England. SCW approach is innovative, flexible and open to following their customer’s vision, looking at things in a new way. We collaborate with customers and partners across health and social care systems to manage, analyse, and improve performance and enable our customers to achieve the best possible outcomes for their service users (patients).&lt;/p&gt;\n&lt;p&gt;Major clients of SCW include a number of Clinical Commissioning Groups (CCGs). CCGs hold contracts with a wide range of different organisations that provide care to the local population, including NHS England, local authorities, foundation trusts, social enterprises, and other health related organisations. You will therefore be working with a diverse range of stakeholders, continually adapting your approach and learning about how to provide the best service to distinct customers.&lt;/p&gt;\n&lt;p&gt;Your new role &lt;br /&gt;You will be working for an organisation where you know that every penny saved through your actions could benefit the care of patients.&lt;/p&gt;\n&lt;p&gt;Due to expansion of our service we are looking for two buyers to work in our non-clinical procurement team. Pace is fast and we want people who are keen to develop and grow.&lt;/p&gt;\n&lt;p&gt;A confident individual, you will be responsible for obtaining quotations from and negotiating with numerous suppliers as well as converting purchase requisitions into purchase orders, resolving invoice queries and answering all manner of challenging queries whilst ensuring that our clients receive an outstanding level of customer service.&lt;/p&gt;\n&lt;p&gt;What you&#39;ll need to succeed &lt;br /&gt;Ideally you would have previous buying experience but SCW will train candidates of a suitable calibre who can demonstrate they have the passion and skills to match our ambition. This might be your first step into a Procurement career or simply a role which you feel you can help make a real difference to patient care by working diligently in this key ‘back-office’ function.&lt;/p&gt;\n&lt;p&gt;Benefits&lt;br /&gt;SCW provides a strong and comprehensive benefits package, which will support your salary and allow you to maintain a genuine work-life balance.&lt;br /&gt;The full package includes:&lt;br /&gt;• Defined benefits NHS pension scheme&lt;br /&gt;• generous annual leave allowance&lt;br /&gt;• training &amp; career development policy&lt;br /&gt;• generous paternity, adoption and maternity pay&lt;br /&gt;• occupational health service&lt;br /&gt;• Access to NHS vehicle leasing scheme&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127935.jpg", "name": "South, Central and West Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "High Wycombe / South West / Devon / Flexible / Home based", "postalCode": "HP11 1AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6272", "longitude": "-.747682"}}, "title": "Buyer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254698", "validThrough": "2020-11-29T23:59:59+0000"}