{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T16:46:20+0000", "description": "&lt;p&gt;A unique opportunity for a progressive 5 – 6 Senior Dosimetrist has arisen in University Hospital Southampton NHS Foundation Trust (UHS).&lt;/p&gt;\n&lt;p&gt;This would be a fantastic opportunity for HCPC registered Radiographers or RCT registered Clinical Technologists to develop their experience and expertise supporting all areas of our comprehensive Radiotherapy physics services.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and passionate individual to join our friendly team . Within this post you will have set competencies to become a Band 6 which you will need to complete within 12 months.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;Radiotherapy physics at Southampton supports Radiotherapy services which include SRS, SABR, IntraOperative Electron and IntraOperative photon Radiotherapy. Brachytherapy includes MR guided interstitial HDR treatments for gynaecological malignancies, HDR and seed treatments for prostate malignancies. We have a comprehensive clinical trials portfolio and research projects ongoing in areas of imaging and dosimetry. Services are delivered across sites at Southampton General Hospital (SGH) and Basingstoke and North Hampshire Hospital (BNHH). Southampton is equipped with 6 linacs and 2 dedicated planning CTs and Basingstoke is equipped with a further linac and dedicated planning CT.&lt;/p&gt;\n&lt;p&gt;At SGH we have 5 new Elekta Versa HD, 2 with Exactrac imaging systems plus, 1 Elekta precise and a further Elekta Precise with Agility at BNHH. Planning is supported by Pinnacle treatment planning system and Elements is currently being commissioned for our specialist SRS service.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;Work will include treatment planning/checking, mould room support and Quality Control. Individuals will be encouraged to develop site specific interest/expertise and to contribute to service development, teaching and training.&lt;/p&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;The successful postholder will be a HCPC registered Radiographer; RCT registered Clinical Technologist or equivalent. Training will be delivered to develop specialist skills.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Wednesday 2nd December&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit, please contact:&lt;/p&gt;\n&lt;p&gt;Iulianna Craciun; Iulianna.craciun@uhs.nhs.uk; 023 8120 8503&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Iulianna Craciun&lt;/p&gt;\n&lt;p&gt;Head of External Beam Radiotherapy&lt;/p&gt;\n&lt;p&gt;Iulianna.craciun@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;023 8120 8503&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Progressive Band 5-6 Dosimetrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256721", "validThrough": "2020-11-18T23:59:59+0000"}