{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23720", "minValue": "20046", "unitText": "YEAR", "value": "£20,046 - £23,720"}}, "datePosted": "2020-10-30T15:43:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Housekeeping and Catering Supervisor&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hospice Band 4: Salary &lt;strong&gt;£20,046 - £23,720 &lt;/strong&gt; &lt;/strong&gt;&lt;strong&gt;(depending on skills and experience)&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity in a new role to support a local charity, providing essential palliative care services, we are looking for an efficient, organised and reliable individual to lead the Housekeeping and Catering teams.&lt;/p&gt;\n&lt;p&gt;Do you have excellent and proven leadership skills with significant line management experience? A good standard of education including BICS, NVQ 3 or City and Guilds in Cleaning Supervision (or equivalent) and knowledge of COSHH, HACCP and Infection Prevention and Control?&lt;/p&gt;\n&lt;p&gt;You may be the person we want to join our team.&lt;/p&gt;\n&lt;p&gt;The Hospice provides palliative and supportive care including nursing, medical, spiritual, practical support and therapeutic care to both patients within our In Patient Unit, Day Hospice Service and patients within the community to ensure they can remain either at home with loved ones or in their preferred location as long as they wish and are able to. We are a charity that relies on fundraising activities to enable us to continue our much needed and appreciated works. 97% of Patients friends and family are advised they are either likely or extremely likely to recommend Birmingham St Mary’s Hospice services.&lt;/p&gt;\n&lt;p&gt;The Catering team support patients in the Ward and Day Hospice with high quality and freshly made nutritious food in a safe and well managed environment. Working with nursing teams and patients to identify ways to support their nutritional and hydration needs and to accommodate likes and dislikes as well as allergens and special dietary needs.&lt;/p&gt;\n&lt;p&gt;The Housekeeping team undertake daily cleaning of the ward areas, Day Hospice and office spaces ensuring full infection control standards are maintained at all times, This includes undertaking deep cleans of infectious rooms which patients are present, to ensure both the safety and comfort of those within our care and working to support that care.&lt;/p&gt;\n&lt;p&gt;Both teams are part of the Facilities team which also includes Health and Safety, Maintenance, Waste Management, Utilities, Transport and Stores. As such, a good team work ethic to support fellow colleagues is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not reapply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you require more information about this exciting opportunity, please email Kirsty Hardwick: (kirsty.hardwick@birminghamhospice.org.uk)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 10th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview and presentation: Week Commencing 17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note if high volumes of applications are received, we may bring the closing date forward.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;No recruitment agencies please.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Registered Charity no. 50345&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham St. Mary's Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125454"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B29 7DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4395", "longitude": "-1.92674"}}, "title": "Housekeeping &amp; Catering Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250795", "validThrough": "2020-11-10T23:59:59+0000"}