{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inclusive of HCAS"}}, "datePosted": "2020-10-27T12:32:06+0000", "description": "&lt;p&gt;&lt;span&gt;Nursing at Barnet - it’s a career for life&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Imagine working as a band 5 staff nurse @Barnethospital within the brilliant division of medicine and urgent care, whether you are at the start of your career or looking to broaden your experience medicine and urgent care @Barnethospital is a superb place to be.&lt;/p&gt;\n&lt;p&gt;The division is committed to “making every busy day a good day” our patients and their families tell us that we provide compassionate, kind care and that our staff have happy faces with big smiles. We believe that this is because within medicine and urgent Care teams respect and care for one another due to all our staff feeling valued at work. “Joy at work” is our top priority and we know happy staff means wonderful patient care is delivered.&lt;/p&gt;\n&lt;p&gt;We presently have vacancies in the acute medical wards, coronary care, health care of the elderly, emergency department, urgent care centre, clinical decisions unit and adult assessment area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our benefits package is substantial and includes:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Newly qualified preceptor programmes, weekly band5@barnet development programme group. senior clinical educators.&lt;/li&gt;\n&lt;li&gt;Multiple accredited evidence based leadership and clinical education programmes.&lt;/li&gt;\n&lt;li&gt;Self rostering&lt;/li&gt;\n&lt;li&gt;Help and support with finding local accommodation either on an individual or group basis.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply on line via Trac or NHS Jobs to join this brilliant team &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;PREVIOUS APPLICANTS NEED NOT APPLY&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to social distancing and Covid 19 pressures you will be contacted if successful in shortlisting with further details regarding an interview. We will use Zoom and similar tools to conduct testing and interviews. Due to the challenging times we are experiencing you may be asked to go to different departments and work under difficult circumstances.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kay Gilsenan - Senior Matron Urgent Care - kay.gilsenan@nhs.net&lt;/p&gt;\n&lt;p&gt;Lorraine Kanaris - PA to Divisional Directors for Medicine and Urgent Care - Lorraine.kanaris@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet Hospital, London", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Band 5 Staff Nurse – Medicine and Urgent Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244521", "validThrough": "2020-11-25T23:59:59+0000"}