{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-22T10:31:51+0100", "description": "&lt;p&gt;Powys Teaching Health Board has a fantastic and exciting opportunity for a Senior Nurse Manager to provide strong clinical leadership to the Planned Care Service (Theatres and Endoscopy). Planned Care Services in Powys consists of two laminar flow operating theatres for day case procedures in our Day Surgery Units, one in Brecon Hospital and one in Llandrindod Hospital. We have one Endoscopy Unit soon to be two, which is part of our Day Surgery Unit. In our endoscopy unit located at Brecon Hospital, we undertake diagnostic and therapeutic procedures. The unit is also a screening centre as part of the Bowel Screening Wales Programme. We are also a JAG (Joint Advisory Group) accredited unit since 2012, Brecon is the second endoscopy unit to be accredited in Wales and the first community hospital in Wales to be accredited. Llandrindod Wells currently undertakes flexible cystoscopies only which are undertaken within the operating theatre department under local anaesthetic.&lt;/p&gt;\n&lt;p&gt;The Senior Nurse Manager will lead and manage the clinical team covering Theatres and Endoscopy championing the delivery of high quality evidence care and promoting effective clinical risk management. You will have experience managing and developing both clinical and non-clinical team members and be able to motivate your staff to achieve national standards. You will also be able to demonstrate continual clinical and professional development throughout your nursing career.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicola KellySenior Manager Planned&lt;/p&gt;\n&lt;p&gt;nicola.kelly@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01874 615708&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123203.jpg", "name": "Powys Teaching Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123203"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brecon Hospital, Brecon", "postalCode": "LD3 7NS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.949", "longitude": "-3.38482"}}, "title": "Senior Nurse Manager Theatres &amp; Endoscopy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237939", "validThrough": "2020-11-12T23:59:59+0000"}