{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "91881", "minValue": "91881", "unitText": "YEAR", "value": "£91,881"}}, "datePosted": "2020-10-27T14:16:04+0000", "description": "&lt;p&gt;&lt;strong&gt;Locum Consultant in Emergency Medicine &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Based at Royal Gwent Hospital moving to Grange University Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time and Part Time 10 Sessions available &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locum Consultant in Emergency Medicine &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dual Accredited with Pre Hospital Emergency Medicine &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Anticipated Start Date: ASAP &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date for Applications: Midnight on 18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Aneurin Bevan University Health Board has recently completed a review of its clinical model within its Emergency Departments and has secured Executive support to increase its body of Consultants to deliver the new clinical model in the Grange University Hospital – opening November 2021. These posts aim to increase the Consultant presence in the Emergency Department to provide a senior decision maker led model of care, whilst also expanding consultant numbers as part of the longer term strategy of the Health Board of a single sited Emergency Department at the new specialist critical care hospital – The Grange University Hospital (GUH). This post will be principally based at the GUH - Cwmbran, however some sessions may be located at the peripheral Minor Injury Units at the Royal Gwent Hospital, Nevill Hall Hospital and Ysbyty Ystrad Fawr.&lt;/p&gt;\n&lt;p&gt;These post have been designed to enhance the Consultant presence in the new Department with an additional post focussing on Pre-Hospital Emergency Medicine (PHEM). This would support our Physician Response Unit, have a role supporting Pre-Hospital Streaming and would allow a job plan that included sessions with EMRTS (Emergency Medical Retrieval and Transfer Service) Wales.&lt;/p&gt;\n&lt;p&gt;The successful candidates must possess excellent background knowledge in Emergency Medicine and an appropriate higher qualification (e.g. FRCEM). It is essential that applicants are accredited at Provider level in all three Advanced Life Support disciplines (ALS, APLS, and ATLS) and desirable that they are a qualified Instructor in at least one of these disciplines.&lt;/p&gt;\n&lt;p&gt;The Health Board actively supports consultant doctors to undertake funded 3 month formal sabbaticals through an annual application process&lt;/p&gt;\n&lt;p&gt;Free parking is available across all Aneurin Bevan University Health Board Sites.&lt;/p&gt;\n&lt;p&gt;This position involves Regulated Activity with &lt;strong&gt;children and adults&lt;/strong&gt; as defined by the Safeguarding Vulnerable Groups Act (amended by the Protection of Freedoms Act 2012) and the following checks will be undertaken following any conditional offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Enhanced check with barred list information, including&lt;/li&gt;\n&lt;li&gt;an adults and children’s barred list check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants must hold full registration and a licence to practice with the GMC.&lt;/p&gt;\n&lt;p&gt;Candidates for Consultant posts must also be on the GMC Specialist Register (including via CESR/European Community Rights) or will have a CCT/CESR(CP) date within 6 months of interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Vacancy Ref: 040-LCON367-CF &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date for Applications: Midnight on 18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Published on NHS Jobs and Trac: 28th November 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Tim RogersonJob titleClinical DirectorEmail addressTim.Rogerson@Wales.nhs.ukTelephone number01633 234066&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Gwent Hospital, SE Wales moving to Grange University Hospital, Newport, SE Wales", "postalCode": "NP20 2UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5798", "longitude": "-2.99816"}}, "title": "Locum Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244922", "validThrough": "2020-11-18T23:59:59+0000"}