{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a."}}, "datePosted": "2020-10-28T13:19:04+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Would you like to work with a forward thinking and innovative team in Community Nursing as a Senior Nurse? &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;If you do, we are currently recruiting for a Community Sister post for our Community Nursing Out of Hours &lt;/span&gt;Team! This is a great opportunity to develop Skills as a Senior Nurse in the community setting.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be supported by senior nurses within the teams and will be given an opportunity to develop case management skills and lead a dedicated team of Nursing staff in order to provide expert, quality Nursing care to patients in their own homes. You will work as part of an integrated health and social care team providing nursing assessment, care and treatment to adults and older people living at home who have physical health needs which may be complex and long term.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for ambitious, innovative and passionate nurses to join our Community Locality teams to provide excellent Nursing Care and leadership, inspiring other staff in developing their skills. Our staff are our most valuable asset and we are committed to supporting you to develop your career with us.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;The Out of Hours service operates seven days a week over a shift pattern 16.00pm – 12midnight / Nights 21.30pm – 08.30am&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful applicants will have good communication and interpersonal skills and will need to be flexible and adaptable. Community experience is desirable although not essential as we have an innovative competency-based approach to training and development to support you to maximise your career potential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a full time position however, we may consider part time position.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Must be a car driver with a valid driving licence or have access to transport with appropriate business insurance in order to travel throughout the Trust, to meet the needs of the service.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;em&gt;If you are interested or would like to talk more about this opportunity, please contact Sally Pearce &lt;/em&gt;&lt;em&gt;07826902702 or Julie Southcott 07876 230748&lt;/em&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;We look forward in hearing from you!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO3 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8004", "longitude": "-1.06359"}}, "title": "Community Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246752", "validThrough": "2020-11-12T23:59:59+0000"}