{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-11-05T10:16:46+0000", "description": "&lt;p&gt;Imperial College Healthcare NHS Trust is the North West London administrative centre for the National Institute for Health Research (NIHR) Clinical Research Network (CRN). The Network is the clinical research delivery arm of the NHS in England, and is tasked with supporting the rapid set-up and effective conduct of studies, enabling the research community to gather evidence to improve treatments for NHS patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Imperial College Healthcare NHS Trust is now seeking to appoint a Research Facilitator who will provide research management support to NIHR Clinical Research Network (CRN) Portfolio studies undertaken in North West London.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post-holder will be responsible for coordinating the setup of a portfolio of research projects and supporting Chief Investigators in primary care. They will provide advice to researchers on AcoRD cost attribution, Portfolio processes, study setup and governance requirements, as well as coordinate support across different CRN teams.&lt;/p&gt;\n&lt;p&gt;They will provide assistance to research studies at various stages, from grant application, expressions of interest and feasibility, all the way to regulatory submissions, operational setup and delivery. They will be responsible for project managing study setup, engaging with sponsors, clinicians, support departments and managers to ensure that research projects are approved and initiated in a timely.&lt;/p&gt;\n&lt;p&gt;We offer a flexible approach to working hours to meet the needs of the individual and the service. Please talk to us at interview about the flexibility you may need.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For enquiries please contact Antoinette.McNulty@nihr.ac.uk at the NIHR Clinical Research Network: North West London.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 6 Research Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257203", "validThrough": "2020-11-19T23:59:59+0000"}