{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Band 5/6 dependent on experience"}}, "datePosted": "2020-11-02T15:44:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Theatre Practitioner – Anaesthetics Band 5/6 | Permanent | Excellent development opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Murrayfield Hospital Wirral is looking for a highly motivated and experienced Theatre Practitioner to join our high performing Theatre Team, with a focus on anaesthetics this is your opportunity to join one of the UK’s leading private hospitals and take your career to the next level.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Murrayfield Hospital is a state-of-the-art private hospital. We offer fast access to consultations with specialists in a wide range of treatments, supported by advanced imaging and diagnostic technology. Our high-quality accommodation and aftercare means we are committed to looking after you and your health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful ODP or Nurse will prepare the operating theatre/anaesthetic room for surgery in relation to instrumentation, equipment and supplies required for specific operative procedures. You will run a theatre list without supervision and supervise / mentor junior staff (subject to experience) and perform anaesthetic duties. You will have the opportunity to develop your skills as the unit performs various surgical procedures ranging from General Surgery, Orthopaedic, ENT, Plastics and Ophthalmic.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be a HCPC registered ODP or an NMC registered Nurse with an Anaesthetic module.&lt;/li&gt;\n&lt;li&gt;Ideally you will have ALS or ILS however training &amp; courses can be offered.&lt;/li&gt;\n&lt;li&gt;Excellent communication and organisation is key to continue our high standards of patient care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals and 8 clinics across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Usman Masood usman.masood@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;About Us&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Welcome to Spire Healthcare Careers&lt;/strong&gt; - Here at Spire Healthcare, caring is our passion. We have been putting patients at the heart of everything we do for over 25 years. Everything we do works towards one vision, to provide the best care possible. We’re committed to looking after people, both patients and staff. Join us, and you’ll receive a warm welcome.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we?&lt;/strong&gt; - A profitable, successful business led by an experienced and stable senior management team, we provide the highest quality of care through the latest medical technology, new facilities, and a focus on inspiring leadership and employee development.&lt;/p&gt;\n&lt;p&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wirral", "postalCode": "CH61 1AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3493", "longitude": "-3.08008"}}, "title": "Qualified ODP/Anaesthetic Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252677", "validThrough": "2020-12-02T23:59:59+0000"}