{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38202", "unitText": "YEAR", "value": "PHE SEO £38,202-£44,503/ Afc Band7 £38,890-£44,503"}}, "datePosted": "2020-10-30T16:17:22+0000", "description": "&lt;p&gt;Public Health England (PHE) is an executive agency of the Department of Health providing; strategic leadership, research, advice and support for Government, local authorities and the NHS in protecting and improving the nation’s health.&lt;/p&gt;\n&lt;p&gt;The commissioning of Screening and Immunisation services and responsibility for effective delivery of Screening and Immunisation programmes is mandated to NHS England and Improvement. NHS England and Improvement’s role is to ensure that the NHS delivers better outcomes for patients within its available resources. It plays a vital role in providing national leadership for improving outcomes and driving up quality of care.&lt;/p&gt;\n&lt;p&gt;Employed by PHE, this post is embedded within NHS England and Improvement South East. Currently the team is based at home due to the COVID19 pandemic. Risk assessments can be carried out for any member of the team who requires access to office space.&lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Purpose / Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to contribute to high quality screening and immunisation services across Surrey and Sussex. Coordinators will work as part of the Public Health England Screening and Immunisation team embedded within NHS England and Improvement (South East). They will coordinate and act as a liaison for the delivery of screening and immunisation programmes across Surrey and Sussex. They will provide leadership and support to primary care and other service providers in order to achieve high coverage rates and maintain the quality of programme pathways. Programme responsibilities may change according to the needs of the service.&lt;/p&gt;\n&lt;p&gt;Applicants should have some experience of screening and/or immunisation programmes. applicants should also have experience of managing projects, leading service improvement and building effective working relationships. A clinical background is not necessary for this role.&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Clinical Ring fence&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;This vacancy falls within the clinical ring fence pool of post within Public Health England. Therefore suitable qualified clinical applicants will be employed on NHS terms and conditions and will be able to join the NHS pension.&lt;/p&gt;\n&lt;p&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion please contact:&lt;/p&gt;\n&lt;p&gt;Caroline Vass, public health screening and Immunisations Lead at caroline.vass@nhs.net or Karen Burgess, Screening and Immunisations Manager at k.burgess2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York House, Horley", "postalCode": "RH6 7DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1714", "longitude": "-.164685"}}, "title": "Screening and Immunisations coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250929", "validThrough": "2020-11-15T23:59:59+0000"}