{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28577", "minValue": "28577", "unitText": "YEAR", "value": "circa £17.00 per hour"}}, "datePosted": "2020-10-21T08:35:26+0100", "description": "&lt;p&gt;We are looking for an enthusiastic, motivated and qualified practice Nurse to join our Nursing and Health Care Assistant Team.  As an integrated part of the Clinical Team the post holder will work alongside our GP’s, assist with supporting our HCA’s and Practice Manager to deliver the practice priorities. Alongside the GP&#39;s the Nursing Team will deliver clinical evidence-based practice for the our local population, meeting the needs of the patients with particular attention to patients with long term conditions, and the provision of preventative healthcare.&lt;/p&gt;\n&lt;p&gt;The ideal candidate should, have experience of working within a Primary Care environment and be able to demonstrate experience of working within a team and also to work autonomously if necessary.  Experience in areas of Chronic Disease Management, Cervical Cytology and vaccinations/ immunisations are essential.&lt;/p&gt;\n&lt;p&gt;We are a GP practice based in Burgess Hill which form part of the Mid Sussex Division of the Modality Partnership, alongside our other practices this provides stability for the future changes that we are facing in primary care.   Our current patient list size is 5600 and we have 3 GP partners, 1 salaried GP, 1 nurse and 1 HCA.  This is a permanent post for 25 hours, worked between Monday to Friday, with start and finish times that are negotiable.  Salary is circa £17.00 per hour and is dependent on the candidate having the minimum competencies in the job specification.  We offer the NHS Pension for employees and our annual leave is based on the Agenda for Change calculations.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to meet the English language fluency requirements as outlined in the Immigration Act 2016. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Only successful shortlisted candidates will be contacted for interview.&lt;/strong&gt;  Please apply online and upload a CV if necessary.   Advert may be closed early if high levels of applicants are received.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Burgess Hill", "postalCode": "RH15 8HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9618", "longitude": "-.137225"}}, "title": "PRACTICE NURSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235556", "validThrough": "2020-11-18T23:59:59+0000"}