{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365.00 - £37,890.00"}}, "datePosted": "2020-10-27T13:01:21+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a full-time Paediatric Research Nurse at the Children’s Hospital, Oxford. The Children’s Research Team provide the delivery and management of clinical trials and research studies across the Children’s Directorate in the Oxford Children’s Hospital. We are looking for a Band 6 research nurse to embed into the neurology service.&lt;/p&gt;\n&lt;p&gt;The Children’s Research Team drives high quality research in the region for the benefit of the NHS and the health of children. We are seeking an enthusiastic, motivated and organised nurse to join our team and this is a great opportunity for an experienced, registered paediatric nurse, to make a move into research and develop their career further. Previous experience in research is desired but not essential as full training will be given.&lt;/p&gt;\n&lt;p&gt;Working with senior and team support, you will be responsible for effectively managing and delivering NIHR Portfolio adopted neurology and neuromuscular research studies, as well as assisting on studies in other specialities when required. Tasks will involve the identification of eligible patients, patient recruitment, data management and administration, which will be facilitated by good communication, organisation and attention to detail as well as being able to work autonomously. The post holder will actively promote research across the Childrens directorate.&lt;/p&gt;\n&lt;p&gt;The role is a fixed term contract (12 months) with the possibility of extension dependent on funding.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameZoe OliverJob titleSenior Paediatric Research NurseEmail addresszoe.oliver@ouh.nhs.ukTelephone number01865231729Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For informal enquiries or to discuss the post in more detail please contact Zoe Oliver, Senior Paediatric Research Nurse on 01865 231729 or Rebecca Beckley, Children’s Research Coordinator on 01865 234332&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford University Hospitals NHS Foundation Trust, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Paediatric Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244649", "validThrough": "2020-11-10T23:59:59+0000"}