{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T10:01:42+0000", "description": "&lt;p&gt;Do you love using data to gain insight and drive improvements? If so, then this may be the role for you.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a Performance Analyst to join our NHS Jobs service where you&#39;ll be working alongside some of the most passionate people who work in a supportive and positive environment.&lt;/p&gt;\n&lt;p&gt;NHS Jobs is the official online recruitment service, for the NHS, in England and Wales. It caters for jobseekers searching and applying for new roles, and for a wide range of recruiting organisations looking to fill healthcare related vacancies. The service is used by over 11 million jobseekers and more than 7,000 recruiting organisations. Annually, the service attracts 4.3 million applications submitted against the 400,000 vacancies advertised.&lt;/p&gt;\n&lt;p&gt;We are currently developing a new NHS Jobs service to replace the current version. The two services will run in parallel as we roll out a phased transition to the new service. The new NHS Jobs service is designed around user needs, and aims to enhance the employer and jobseeker experience.&lt;/p&gt;\n&lt;p&gt;We are looking for a resourceful, forward thinking performance analyst to drive insight from both the existing and new service to improve our understanding of the customer journey, support our business decisions and make recommendations for improvements and efficiencies across the NHS Jobs service.&lt;/p&gt;\n&lt;p&gt;As an NHS Jobs Performance Analyst, you will be required to develop performance measurement frameworks (KPIs, goals, user needs, benefits etc) to analyse the performance of the service and identify where improvements may be possible. Your challenge will be to understand and develop the data and present accurate and meaningful management information.&lt;/p&gt;\n&lt;p&gt;The Performance Analyst role is for someone with exceptional analytical skills and experience and a desire to use insight to drive improvements.&lt;/p&gt;\n&lt;p&gt;If you think this could be you and would like to know more then please contact Nicola Dickinson -&lt;/p&gt;\n&lt;p&gt;Nicola.dickinson2@nhs.net or 07827 358297&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Business Services Authority", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121052"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle upon Tyne", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Performance Anlayst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247807", "validThrough": "2020-11-08T23:59:59+0000"}