{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 8A"}}, "datePosted": "2020-10-12T10:54:16+0100", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse | Governance| Band 8A | Full Time | Slough | Career Progression&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Thames Valley Hospital has an exciting opportunity for an ambitious Registered Nurse to manage our Clinical Governance team. The successful person would be the lead on hospital Clinical Governance and work closely with the Director of Clinical Services and the Hospital Director in leading clinical quality and the Clinical Governance strategy within the hospital.&lt;/p&gt;\n&lt;p&gt;This unmissable opportunity suits an effective leader with demonstrable knowledge of clinical governance, attention to detail and fairness in investigation and management of complaints and incidents. The successful candidate will be responsible for ensuring that robust governance is in place and that effective learning and continuous development take place across the organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Thames Valley located in Slough provides the highest standard of private healthcare to patients from Berkshire and the surrounding areas. The hospital has a 38 bedded ward with 2 theatres, Endoscopy suite and 10 outpatient consultation rooms. Our modern hospital has a full multi-disciplinary medical team onsite.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be a confident and dedicated individual with a strong background in patient safety and governance, an excellent communicator, and have the ability to manage a demanding and ever changing workload. This role is responsible for clinical governance across all hospital departments and will deputise for the Director of Clinical Services as required.&lt;/p&gt;\n&lt;p&gt;You will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Nurture strong relationships with the Heads of Departments, to ensure processes are followed and embedded&lt;/li&gt;\n&lt;li&gt;Deputise for the Director of Clinical Services&lt;/li&gt;\n&lt;li&gt;Oversee a small governance team&lt;/li&gt;\n&lt;li&gt;Develop robust governance &amp; quality systems and processes throughout the hospital&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Registered&lt;/li&gt;\n&lt;li&gt;Clinical governance experience&lt;/li&gt;\n&lt;li&gt;Experience of positive working relationships with external stakeholders&lt;/li&gt;\n&lt;li&gt;Experience of managing a clinical team&lt;/li&gt;\n&lt;li&gt;Excellent attention to detail and communication skills&lt;/li&gt;\n&lt;li&gt;Ability to engage and be visible within the hospital departments&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;li&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Elena Tsoneva on 07921 065 874 or emailelena.tsoneva@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Slough", "postalCode": "SL3 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5428", "longitude": "-.572397"}}, "title": "Clinical Governance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221967", "validThrough": "2020-11-12T23:59:59+0000"}