{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "Starting salary from £24,907 per annum pro rata"}}, "datePosted": "2020-10-30T12:01:05+0000", "description": "&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for enthusiastic and motivated individuals to join our Reactive Emergency Assessment Community Team (REACT) as a Community Nurse. The REACT Team are a multi-agency team based in the community, A&amp;E department and Frailty Assessment Base with an admission prevention role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our team delivers excellent patient focused care to patients in the East Suffolk community. You will work as a valued, key member of our multi-disciplinary team with excellent induction and training support. The successful candidate will have experience of working in a community setting and ideally within an admission prevention role. The role will involve delivering acute care in the patient’s home as part of community nursing both during core hours, and out of hours. In addition the successful candidate will work within a team of therapists, generic workers and with social care and the voluntary sector to provide holistic assessments in a patient’s home and primary care settings. The role will also include carrying out appraisals and clinical supervision for more junior staff. The successful applicant should be motivated, flexible and committed to working in an ever changing environment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role involves travelling throughout East Suffolk. The post holder will be expected to cover early, late, night and weekend/bank holiday shifts covering a variety of roles including our OPAT (Outpatient Parenteral Antibiotic Therapy) service, out of hours community nursing and multidisciplinary admission avoidance.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we are committed to support you in your professional development and chosen career pathway, ensuring you have opportunities to demonstrate your skills, abilities and appropriate training and support to reach your potential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sue Deas or Piia Hughes, REACT Nurse Specialists 01473 278988&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "86 Sandy Hill Lane, Ipswich", "postalCode": "IP3 0NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0373", "longitude": "1.16299"}}, "title": "Community Nurse (REACT)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250080", "validThrough": "2020-11-13T23:59:59+0000"}