{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-27T09:12:39+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Community Children’s Occupational Therapist: Band 5&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;CHILDRENS OCCUPATIONAL THERAPSIT: We are looking to recruit an enthusiastic and motivated Occupational Therapist to join our Community team based across Staffordshire and Stoke-on-Trent. The post will be based at Hazel Trees (Fenton) which is a centre that supports children and young people who have disabilities in Stoke on Trent.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be joining an experienced team of Occupational Therapists and Assistants offering services to Children aged 0-19 years of age. We provide assessments and treatments to children with physical disabilities and motor coordination difficulties that are impacting on their ability to carry out day to day activities including school work, play and self-care tasks. Assessments and treatments are carried out in clinic, the child’s home, via telephone or video technology or in education setting. We offer a range of individual or group treatments. The service uses Care Aims which is a caseload management and clinical decision making tool to help support clinical decisions, outcome measures and caseloads.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Communication, organisational and time management skills are essential and you will need to be able to develop working relationships with the child, their families and other staff working alongside them.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will receive regular supervision and have access to the service’s in-house CPD program and journal clubs. You will create a personal development plan which will reflect your learning needs alongside service development needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Paediatric experience would be advantageous but not essential and you will need to be flexible in your approach to service delivery. You will need to work closely with health, education and social services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information or to arrange an on-line discussion please contact Amanda Whitehouse on 01782 427450 or Amanda.Whitehouse@mpft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke on Trent", "postalCode": "ST4 3NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.994", "longitude": "-2.15508"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243784", "validThrough": "2020-11-23T23:59:59+0000"}