{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-30T13:15:48+0000", "description": "&lt;p&gt;New funding and restructure as part of our growing Adult SLT service means that we have 2 new roles to offer;&lt;/p&gt;\n&lt;p&gt;SLT Team Lead – Acute/Gen Med (Band 7 - 1.0WTE Permanent)&lt;/p&gt;\n&lt;p&gt;Highly Specialist SLT – Dysphagia (Band 7 - 1.5WTE Permanent)&lt;/p&gt;\n&lt;p&gt;The Team Lead post will have management and staff leadership responsibilities, ideal for an SLT keen to develop these skills, or who has experience already and wants dedicated time to hone these skills. This role is full time and will include both clinical and management/leadership work. There will be the opportunity to expand and enhance MDT working, and involvement in a range of initiatives across the acute hospital are available and encouraged.&lt;/p&gt;\n&lt;p&gt;The Highly Specialist opportunity allows significant clinical skill progression in the area of dysphagia and has dedicated time for the development of this area across the service, working in partnership with Head of Adult SLT, Team Leads and other Highly Specialist SLTs and MDT colleagues. This role could be full or part time, and as there is 1.5WTE available there will be opportunity to work closely with your peer appointed to the other part of this exciting role.&lt;/p&gt;\n&lt;p&gt;The adult team consists of a diverse profile of staff in all grades from highly specialist to student and includes SLT support practitioners. There is a Head of Adult SLT and the Team is part of the wider Wolverhampton SLT Service with a SLT Service Manager. In-patient, out-patient and community services are offered to patients with communication and swallowing disorders across a number of clinical pathways including stroke, head &amp; neck cancer, voice and in-patient ward provision. We offer strong professional leadership and development embracing the Trust values. CPD and supervision is encouraged and supported.&lt;/p&gt;\n&lt;p&gt;The SLT service has access to videofluoroscopy. There is an identified need for a FEES service. Development of the services for instrumental dysphagia assessment is anticipated in conjunction with the Head of Adult SLT and the wider MDT.&lt;/p&gt;\n&lt;p&gt;We welcome the opportunity to discuss these exciting roles with potential applicants prior to shortlisting and interview.&lt;/p&gt;\n&lt;p&gt;We expect to conduct these interviews via Microsoft Teams.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCharlotte ColesbyJob titleServices Manager - Speech and Language TherapyEmail addresscharlotte.colesby1@nhs.netTelephone number01902 444363&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Cross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Band 7 Adult Speech and Language Therapists", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250312", "validThrough": "2020-11-15T23:59:59+0000"}