{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 Per Annum"}}, "datePosted": "2020-10-27T17:15:23+0000", "description": "&lt;p&gt;We would like to invite you to join our friendly team in the glorious West Country. Situated on the beautiful South West coast, Plymouth boasts many local Heritage sites and areas of ‘outstanding natural interest’. At Plymouth Hospitals, we recognise that work is only a part of your life - and the Trust is ideally located for walking, cycling, climbing, sailing and many other indoor and outdoor pursuits. Plymouth also has good transport links to the rest of the UK and Europe via road, rail and sea.&lt;/p&gt;\n&lt;p&gt;Derriford Hospital is a teaching hospital and provides a wide range of acute and general hospital services including oncology and radiotherapy, paediatric, neurosciences and cardiothoracic. The emergency department is designated as a major trauma centre.&lt;/p&gt;\n&lt;p&gt;Our Trust core values are ‘Put patients first’, Take ownership’, ‘Respect others’, and ‘Be positive’ If you agree that these values should be integral to your work, then Plymouth Hospitals NHS Trust has much to offer you.&lt;/p&gt;\n&lt;p&gt;We currently have the following vacancy:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 Deputy IT Support General Radiographer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;1.0 wte full time&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have an attractive opportunity for a radiographer with excellent clinical skills. We will consider experienced staff or appropriately motivated members of staff with less experience and work through a thorough in house training program.&lt;/p&gt;\n&lt;p&gt;You will become a valuable member of a team of radiographers delivering a quality led and timely X-Ray service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be expected to deputise regarding Imaging IT matters during the planned absence of the Lead Radiographer in X-Ray East. A successful candidate will become actively involved with PACS and CRIS related matters and in plain film imaging where you will carry out duties commensurate with a band 6 radiographer within the department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There will be an expectation to: Create, implement, maintain and enhance an effective clinical learning environment through role modelling, leadership and excellence in practice. To contribute to the development of a skilled professional workforce and facilitate a range of education, training and learning opportunities in the clinical and non-clinical environment. Be responsible for evaluating and maintaining the standard of work produced, ensuring it is of a high quality and taking corrective action where there may be problems&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a senior radiographer you must respond to the changing needs of the department on a daily basis by providing a flexible approach to the working day, thus maintaining the existing excellent standard of service and the continuing promotion of good working relationships with other teams within the trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful candidates will be expected to participate in an out of hours Rota covering seven days a week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We may decide to close this vacancy earlier than the published closing date if sufficient applications are received.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;***Preference will be given to internal Trust staff, as well as ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon who are able to display recent relevant experience as dictated by the Person Specification.***&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245548", "validThrough": "2020-11-10T23:59:59+0000"}