{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Per annum (Plus HCAS) pro rata"}}, "datePosted": "2020-11-05T17:45:19+0000", "description": "&lt;p&gt;NELFT is looking for an Equality, Diversity and Inclusion (EDI) Manager to join the EDI team. The role is Trust wide and will report to the Head of EDI. The team is supported by an EDI Administrator and is accountable to the Executive Director of People and Culture.&lt;/p&gt;&lt;p&gt;&lt;span&gt;&lt;strong&gt;Key Responsibilities&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Will take a lead role in the implementation of the Trust EDI Strategy, Disability Staff Network Strategy, Ethnic Minority Staff Network Strategy and the LGBT+ staff network strategy.&lt;/li&gt;&lt;li&gt;Supporting and enabling our employee network groups to drive inclusion across the business and improve employee experience.&lt;/li&gt;&lt;li&gt;Provide guidance and subject matter expertise on all aspects of diversity and inclusion at a strategic level.&lt;/li&gt;&lt;li&gt;Ensure that diversity and inclusion compliance with the legal and mandatory frameworks and reporting is in place and operates effectively.&lt;/li&gt;&lt;li&gt;Contribute to the design of the EDI specialist training programmes to ensure that they develop inclusive behaviours for everyone.&lt;/li&gt;&lt;li&gt;Review and deliver EDI training across the Trust.&lt;/li&gt;&lt;li&gt;Attending and organising events to maximise awareness of inclusion internally and externally.&lt;/li&gt;&lt;li&gt;Work across all business service functions to ensure all are aligned on diversity and inclusion matters.&lt;/li&gt;&lt;li&gt;Use data and analytics to measure the effectiveness of our approach and understanding and communicating areas where further improvement is desirable&lt;/li&gt;&lt;li&gt;Build relationships and form alliances with staff, patients, and the community we serve and external stakeholders to identify innovations and opportunities to collaborate together and improve how we deliver serves to the communities we serve using the EDS2 framework.&lt;/li&gt;&lt;li&gt;Work with key stakeholders to set diversity and inclusion targets and developing action plans in order to measure progress against targets.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;span&gt;&lt;strong&gt;Experience &amp; Skills&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Good knowledge and understanding of the legal requirements under the Equality Act 2010, Workforce Race Equality Standard, Workforce Disability Equality Standard, Accessible Information Standard, Sexual Orientation Monitoring Standard, Gender Pay Gap, Equality Delivery System2.&lt;/li&gt;&lt;li&gt;Diversity &amp; Inclusion subject matter expert with experience of building successful relationships at all levels across all systems, processes and services.&lt;/li&gt;&lt;li&gt;Experience of managing a budget.&lt;/li&gt;&lt;li&gt;Demonstrable experience of implementing diversity and inclusion initiatives that have resulted in measurable changes within an organisation&lt;/li&gt;&lt;li&gt;Ability to manage cross-functional projects with multiple stakeholders and work on their own initiative.&lt;/li&gt;&lt;li&gt;Brilliant planning and organisation skills, and the ability to manage different projects and priorities and meet strict deadlines&lt;/li&gt;&lt;li&gt;Group facilitation skills&lt;/li&gt;&lt;li&gt;Strong stakeholder management skills with the ability to provide support &amp; challenge employees at all levels&lt;/li&gt;&lt;li&gt;Most importantly, being resilient.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Please check our website on some of the work that the EDI team have been leading on to meet its compliance with the Equality Act 2010.  &lt;/p&gt;&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment.  As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;High Cost Area Supplement – London&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;NameHarjit K Bansal,Job titleHead of Equality, Diversity &amp; InclusionEmail addressharjit.bansal@nelft.nhs.ukTelephone number07985813684Additional contact information&lt;p&gt; &lt;/p&gt;&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CEME, Rainham", "postalCode": "RM13 8EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5186", "longitude": ".171121"}}, "title": "Equality, Diversity and Inclusion Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258737", "validThrough": "2020-11-19T23:59:59+0000"}