{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "61000", "minValue": "61000", "unitText": "YEAR", "value": "Up to £61,000pa DOE"}}, "datePosted": "2020-11-02T14:12:14+0000", "description": "&lt;p&gt;We are currently recruiting a Consultant Psychologist to join our team and work across our Cygnet Scotland services in the Dundee area (Wallace Hospital, Thistle and Ellen Mhor), Dunblane (Ranaich House) and Lockerbie (Trinity).&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Opportunity...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To ensure the systematic provision of a high quality psychological service to the units.&lt;br /&gt;&lt;br /&gt;You will work within a highly specialised clinical area and provide psychological assessments of clients to formulate plans for formal psychological interventions and treatment based upon an appropriate conceptual framework relating to client diagnosis, potential risks and social needs.&lt;br /&gt;&lt;br /&gt;You will work as part of an established multi-disciplinary team comprising of Psychiatry, Specialty Doctors, Occupational Therapy, Speech &amp; Language Therapy, Nursing and a Support Team.&lt;br /&gt;&lt;br /&gt;Within this setting, you will be expected to offer psychological insight and knowledge, whilst supporting the clinical, nursing and direct care teams in making skilled evaluations and decisions about clinical options. You will also provide consultation about the psychological care of the client group to staff, families and other agencies.&lt;br /&gt;&lt;br /&gt;The post-holder will have a key role in leading in the design and implementation of individual and group psychological treatment programmes.&lt;br /&gt;&lt;br /&gt;You will support with the training and clinical supervision of Assistant Psychologists, Volunteers and Psychology Trainees/Students across the units. You will also have involvement in audit, implementing policy and service development changes.&lt;br /&gt;&lt;br /&gt;As a member of the psychology department, there will be considerable opportunity for further professional development through access to various CPD activities, training, events and research.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We are looking for people who have…&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Doctorate Level Qualification (or equivalent) in Clinical / Counselling or Forensic Psychology along with HCPC Registration&lt;/li&gt;\n&lt;li&gt;Experience of working with a variety of adult client groups, ideally within autism (ASD), learning disability and mental health&lt;/li&gt;\n&lt;li&gt;Current experience operating as a Lead, Head, Senior, Consultant or Principal Psychologist&lt;/li&gt;\n&lt;li&gt;Experience of specialist psychological assessment and treatment with associated complex needs of varying severity and complexity&lt;/li&gt;\n&lt;li&gt;Knowledge of psychological assessment and formulation in healthcare, as well as planning and delivering psychological interventions&lt;/li&gt;\n&lt;li&gt;Experience of various psychological therapies/models and risk assessments&lt;/li&gt;\n&lt;li&gt;Training and supervision experience is desirable&lt;/li&gt;\n&lt;li&gt;The ability to work autonomously and as part of an interdisciplinary team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet? We’ll offer you…&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary up to £61,000 (full time equivalent / depending on experience)&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;NHS and employee discount scheme&lt;/li&gt;\n&lt;li&gt;Free meals&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;Internal CPD monthly events&lt;/li&gt;\n&lt;li&gt;Access to external CPD&lt;/li&gt;\n&lt;li&gt;Opportunities to become involved in research&lt;/li&gt;\n&lt;li&gt;Expert clinical supervision and peer support&lt;/li&gt;\n&lt;li&gt;Opportunities to train in additional therapies, broaden experience and enhance service&lt;/li&gt;\n&lt;li&gt;development&lt;/li&gt;\n&lt;li&gt;A relocation package will also be considered for this role&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contracted hours: part or full time considered.&lt;/p&gt;\n&lt;p&gt;Please note: successful candidates will be required to undergo an enhanced DBS check.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Cygnet Health Care have been providing a national network of high quality specialist services for over 30 years.&lt;/p&gt;\n&lt;p&gt;If you care about making a difference – we want to talk to you!&lt;/p&gt;\n&lt;p&gt;Click the link to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dundee", "postalCode": "DD3 9AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "56.4887", "longitude": "-3.00544"}}, "title": "Regional Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252356", "validThrough": "2020-11-16T23:59:59+0000"}