{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-23T16:30:56+0100", "description": "&lt;p&gt;Do you take pride in the care you provide? Do you want to put your skills to best use every day? Do you want to inspire future generations of healthcare professionals? If you’re saying yes to these questions, then we want you to come and join our team of BHT heroes!&lt;/p&gt;\n&lt;p&gt;If you&#39;re interested in acute and general medicine patients, then this is the role for you!&lt;/p&gt;\n&lt;p&gt;We are proud of our high standards of care and our supportive and friendly environment. We are looking for a forward thinking, motivated and professional nurse who is committed to providing a high standard of holistic care and can demonstrate an ability to work in partnership with our multi-disciplinary team, patients and their families. We welcome candidates from a variety of nursing backgrounds and whether you are experienced, looking for a new direction, or newly qualified, we will support you and your nursing journey.&lt;/p&gt;\n&lt;p&gt;You will join a busy multi-disciplinary team who are dedicated in providing individualised, evidence based care. You will be self-driven, striving to provide a high standard of nursing care. Your philosophy should be that the patient’s needs come first.&lt;/p&gt;\n&lt;p&gt;If you think you have the right values to offer us and this exciting time in your career and would like to develop your professional knowledge, competence skill and effectiveness then we would very much like to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sister Emma Kelly&lt;/p&gt;\n&lt;p&gt;01296 316505&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke Mandeville Hospital, Aylesbury", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241319", "validThrough": "2020-11-06T23:59:59+0000"}