{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 per annum"}}, "datePosted": "2020-11-06T11:00:52+0000", "description": "&lt;p&gt;Health Education England’s (HEE) vision is that everyone associated with health care will be committed to a lifetime of professional development, be proud of the care they provide, support and challenge one another and strive for ever-increasing standards of patient-centred care.&lt;/p&gt;\n&lt;p&gt;HEE supports the delivery of high-quality care for patients and high quality public health services by ensuring that the health workforce has the right skills, behaviours and training, and that health care staff are available in the right numbers to meet the needs of the public. It takes on leadership and oversight of healthcare workforce planning and will also be responsible for supporting and authorising Local Education and Training boards. HEE will maintain an effective system for professional education and training as part of a comprehensive health service.&lt;/p&gt;\n&lt;p&gt;An exciting career opportunity has arisen in the Wessex (Winchester office) within Health Education England for a permanent, full time Revalidation and Accreditation Manager.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will you be doing? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will manage a wide range of operational functions to ensure the smooth running of assessment and revalidation and will be responsible for implementing local and national guidance, policy and procedures across the Wessex local office.&lt;/p&gt;\n&lt;p&gt;This will include managing the day to day activities of revalidating postgraduate medical trainee doctors on behalf of the Responsible Officer (RO). This incorporates manipulating several information systems, maintaining excellent records: and ensuring accuracy and timely activity.&lt;/p&gt;\n&lt;p&gt;You will manage assessment activity across a number of education programmes as well as supporting the Education Programme Managers ensuring appropriate governance is in place. They will also lead on the management of ARCP appeals in line the Gold Guide and HEE policy.&lt;/p&gt;\n&lt;p&gt;As a line manager of the Revalidation and Accreditation Officer and Coordinators you will be required to conduct appraisals, regular 1:1, annual leave and sickness management, as well as the day to day queries that arise.&lt;/p&gt;\n&lt;p&gt;Whether you are contacting trainee doctors, the General Medical Council, local NHS organisations on behalf of Health Education England or working with colleagues from other areas in England, your essential input will help ensure we carry on delivering our current high standards of excellent customer service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What do you need? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic and highly motivated individual who can demonstrate the key values of the NHS Constitution to provide a full and comprehensive front line service within the team. You will work in a challenging, busy and rewarding environment, liaising with a range of external bodies including NHS Trusts, national members of the HEE teams and the Royal Colleges. As a result of the particular requirements to support the revalidation and accreditation function, previous experience of revalidation and assessment processes is desirable.&lt;/p&gt;\n&lt;p&gt;Our ideal candidate will be a be a good team player and Manager, who enjoys communicating with a wide range of people, be highly organised and have a flexible positive approach to work. The successful applicant will have a good general level of education and experience and be able to deal with a very busy environment. You will also need to demonstrate excellent organisational skills and the ability to approach obstacles in a creative and constructive manner, whilst adhering to the Gold Guide and HEE Standard Operating Processes.&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 6 with a full-time starting salary of £31,365, with pay step increases as after 2 years’ service and 5 years&#39; service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah Case&lt;/p&gt;\n&lt;p&gt;Business and Education Manager&lt;/p&gt;\n&lt;p&gt;sarah.case@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;01962 690333&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southern House, Winchester", "postalCode": "SO21 2RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.009", "longitude": "-1.33424"}}, "title": "Revalidation and Accreditation Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259329", "validThrough": "2020-11-22T23:59:59+0000"}