{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-27T09:45:44+0000", "description": "&lt;p&gt;&lt;strong&gt;Head of Risk Management&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£45,753 - £51,668 Per Annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 Hours Per week - Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;About us&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at George Eliot our vision to &lt;em&gt;‘&lt;strong&gt;excel at patient care’&lt;/strong&gt;&lt;/em&gt; takes centre stage. An ever evolving clinically-led acute service provider we are on a journey to continually provide high quality, safe and responsive services delivered by inspiring, friendly and compassionate staff who share our corporate values which underpin everything we do. Our values are not just words on a piece of paper, they bond us together, reflect our ambition and shape who we are:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;E&lt;/strong&gt;ffective Open Communication&lt;/p&gt;\n&lt;p&gt;e&lt;strong&gt;x&lt;/strong&gt;cellence and safety in everything we do&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;C&lt;/strong&gt;hallenge but support&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;E&lt;/strong&gt;xpect respect and dignity&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;L&lt;/strong&gt;ocal health that inspires confidence&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The Role&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Team GEH are currently looking for a Head of Risk Management to work as part of their well-regarded Governance team. This role will involve providing robust Trust Wide Leadership and high level support in relation to Risk Management including leading on the implementation of the Trust Risk Management Strategy, managing the Trust’s Corporate Risk Register, facilitating the Executive Risk Committee, and providing risk management reports for Trust Board and Committees, in partnership with the Senior Management Teams.&lt;/p&gt;\n&lt;p&gt;This post holder will be key to the functioning of Risk Management within the Clinical Directorates and the Trust. You will also be central to supporting service developments, best practice, and training/development initiatives as informed by Trust Wide risks, and incidents.&lt;/p&gt;\n&lt;p&gt;We are looking for a proactive leader, with a strong sense of initiative, an excellent team working approach and an exceptional communicator. You will be able to demonstrate a high level of organisational, analytical and IT skills, and have relevant risk management experience. Knowledge of national guidance in the field is essential.&lt;/p&gt;\n&lt;p&gt;This post offers an excellent opportunity to work in an interesting team environment, and make a difference to patient care.&lt;/p&gt;\n&lt;p&gt;For Further information please contact Sangeeta Bassi (Associate Director of Quality Governance) on 07880052313 or email Sangeeta.Bassi@geh.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Benefits &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our benefits include but are not limited to: On-site nursery, 27 days minimum annual leave plus 8 bank holidays, cycle to work scheme, flexible working, on-site discounted gym, extensive in-house course learning directory, buying and selling of annual leave, subsidised restaurant, tranquillity garden and generous subsidised on-site parking.&lt;/p&gt;\n&lt;p&gt;Closing date: 08/11/2020&lt;/p&gt;\n&lt;p&gt;Interview Date: 19/11/2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post may close early due to high numbers of applications &lt;/strong&gt;&lt;strong&gt;so you are advised to apply promptly.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All correspondence for this vacancy will be sent by email; please check your account regularly including your Junk and SPAM areas.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;A great and friendly place to work, so bring your passion, commitment and expertise &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;and enjoy the opportunities to make a difference every day. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;#JoinTeamEliot&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "George Eliot Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120955"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "George Eliot Hospital NHS Trust, Nuneaton", "postalCode": "CV10 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.512", "longitude": "-1.47512"}}, "title": "Head of Risk Management", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243872", "validThrough": "2020-11-08T23:59:59+0000"}