{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33000", "minValue": "33000", "unitText": "YEAR", "value": "Up to £33,000"}}, "datePosted": "2020-10-29T10:34:47+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;I treat more than just symptoms&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;We’ll utilise the wellbeing model to put patient care and safety at the heart of everything we do through assessing prisoners across 5 domains of; physical and mental wellbeing, substance misuse, relationships and resettlement. The patient and clinician complete a wellbeing wheel assessment to set goals and outcomes in partnership. The patient will complete the assessment and any needs identified will be met by our fully integrated service delivery team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About the Job&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Substance Misuse Nurse, you must be able to carry out comprehensive assessments, initiate and review individual recovery plans and confidently communicate the full range of treatment options available to service users. You must have an understanding and commitment to recovery and a person centred approach.  Across everything you do, you’ll maintain accurate records and provide the kind of helpful, empathetic support that will make every patient feel at ease. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Requirements&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;As an RGN/RMN/RNLD with valid NMC registration, you&#39;ll have the ability to work autonomously; with sound clinical/substance misuse knowledge. We’ll want to see evidence of your continued professional development, and a real passion for taking your skills even further.&lt;/p&gt;\n&lt;p&gt;It goes without saying that you’ll have a solid understanding of health and safety, along with exemplary record keeping skills. Self-motivated, you’ll show plenty of initiative when it comes to handling a wide range of situations. Beyond that, you should have a flexible approach and the ability to achieve changing priorities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS12 2TJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7956", "longitude": "-1.5761"}}, "title": "Substance Misuse Nurse - HMP Leeds", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247935", "validThrough": "2020-11-29T23:59:59+0000"}