{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pro rata per annum"}}, "datePosted": "2020-11-02T12:31:37+0000", "description": "&lt;p&gt;We have an exciting opportunity for a General Adult Consultant Psychiatrist to join our crisis team based at The Oaklands Centre for Acute Care, in Chichester, West Sussex.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;P&lt;/strong&gt;&lt;strong&gt;lease note this post has a Relocation Package of up to £8000. Information on this can be obtained from the Medical Staffing Team on 0300 304 0393.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Sussex Partnership we are committed to providing opportunities for &lt;strong&gt;flexible working&lt;/strong&gt;. If you would like to work differently or different hours to as advertised, please get in touch to discuss this in more detail.&lt;/p&gt;\n&lt;p&gt;The Oaklands Centre, where the team is based, has &lt;strong&gt;free on-site parking &lt;/strong&gt;which will be accessible to the successful post holder. Also, if you haven’t thought about living in &lt;strong&gt;West Sussex&lt;/strong&gt; before then you should consider the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Journey from the coast to the countryside in minutes&lt;/li&gt;\n&lt;li&gt;Enjoy a lifestyle where there are renowned cycle routes and picturesque walks, including the famous South Downs Way in the South Downs National Park!&lt;/li&gt;\n&lt;li&gt;Embrace taking time to discover all the miles of scenic coastline, including West Wittering beach and Selsey.&lt;/li&gt;\n&lt;li&gt;Easy access to airports - Gatwick and Heathrow are both within 90 minutes of the county, providing links to Europe and beyond&lt;/li&gt;\n&lt;li&gt;Brighton and Hove or London are within easy reach via local and national bus routes and national mainline stations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The crisis team cares for adults from Chichester, Bognor and the surrounding areas. You will be part of a friendly and supportive multidisciplinary team that consists of another less than full time Consultant, Nurse’s, Social Workers, and more.&lt;/p&gt;\n&lt;p&gt;The Trust strives to maximise clinical time for doctors so you will benefit from assigned admin support.&lt;/p&gt;\n&lt;p&gt;You will work with other acute services in the local area including the working age and older persons acute wards in Chichester, the Liaison team and other community services There are separate services for older persons including those with dementia.&lt;/p&gt;\n&lt;p&gt;This role can also support any interest in research, development, medical education or special interests that you may have. We strongly believe in creating roles that provide a service but also give you the opportunity to develop your own areas of special interest.&lt;/p&gt;\n&lt;p&gt;There is only so much we can say to you in an advert, so would love to speak to you about this role in more detail.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Claire TannerJob titleClinical Director West Sussex CDSEmail addressClaire.Tanner@sussexpartnership.nhs.ukTelephone number07710977985&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crisis team, Oaklands Centre for Acute Care, Chichester", "postalCode": "PO19 6GS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8466", "longitude": "-.77098"}}, "title": "Consultant Psychiatrist - Crisis team Chichester", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252067", "validThrough": "2020-11-23T23:59:59+0000"}