{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "68891", "minValue": "60058", "unitText": "YEAR", "value": "£60,058 - £68,891 p.a. inclusive of HCA"}}, "datePosted": "2020-11-06T11:15:56+0000", "description": "&lt;p&gt;Evelina London is part of Guy&#39;s and St Thomas&#39; NHS Foundation Trust and we are responsible for providing the Trust’s services for women and children. With over 3,000 dedicated staff, and led by an Executive Team and Board, we have significant devolved autonomy to focus operationally and strategically upon the needs of our patients. We also benefit from being part of a large and successful NHS foundation trust, whose values we share. We have an ambitious strategic development programme, with backing from Guy’s and St Thomas’. Find out more by serching Guys and St. Thomas - Evelina Hostpital&lt;/p&gt;\n&lt;p&gt;The children’s community physiotherapy service is an integral part of the children’s community services directorate, which provide a comprehensive range of services for the 121,000 children and young people that live in Lambeth and Southwark. This includes universal services – health visiting, family nurse partnership, school nursing, nutrition and dietetics, and a newborn hearing screening programme. Our specialist services cover community paediatrics, speech and language therapy, physiotherapy, occupational therapy, complex needs nursing, sickle cell and audiology, and our statutory services include looked after children, child protection, safeguarding, and adoption and fostering.&lt;/p&gt;\n&lt;p&gt;We are seeking a skilled and enthusiastic individual to lead our large and dynamic paediatric community physiotherapy team, which consists of 16 WTE physiotherapists specialising in motor development, complex needs and neurodisability. The post holder will be responsible for the clinical, professional, strategic and operational management of the Community Paediatric Physiotherapy Team, including supervision and line management of the team, co-ordinating the delivery and development of the service, ensuring that the service is equitable and effective and that local and national standards of practice are maintained.&lt;/p&gt;\n&lt;p&gt;There are exciting opportunities to support the development of a variety of multi-disciplinary care pathways in conjunction with other teams, and build on the existing links with Evelina London hospital services to further develop integrated pathways for local families. A key part of the role will be to lead, develop and support staff within the service, leading on service improvements and relevant initiatives, prioritising and facilitating professional development and research including outcome measurement, and contribute to advancing the profile of the department within the Trust, locally, and nationally.&lt;/p&gt;\n&lt;p&gt;This well-established team demonstrate dynamic clinical practice and a strong focus on child-centred care, working in close partnership with parents. They are keen to welcome new leadership to support the ongoing development of the service at a local and national level.&lt;/p&gt;\n&lt;p&gt;For further information, please contact:&lt;/p&gt;\n&lt;p&gt;Anne Gordon – Chief Therapist for Evelina London (anne.gordon@gstt.nhs.uk)&lt;/p&gt;\n&lt;p&gt;Bidisha Lahoti – Clinical Director for Children’s Community Services (bidisha.lahoti@gstt.nhs.uk)&lt;/p&gt;\n&lt;p&gt;Jude Connolly – General Manager for Children’s Community Services (judith.connolly@gstt.nhs.uk)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnne GordonJob titleEvelina London Chief TherapistEmail addressanne.gordon@gstt.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details please contact; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Anne Gordon – Chief Therapist for Evelina London (anne.gordon@gstt.nhs.uk)&lt;/p&gt;\n&lt;p&gt;Bidisha Lahoti – Clinical Director for Children’s Community Services (bidisha.lahoti@gstt.nhs.uk)&lt;/p&gt;\n&lt;p&gt;Jude Connolly – General Manager for Children’s Community Services (judith.connolly@gstt.nhs.uk)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NHS jobs, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Clinical Lead for Children&#39;s Community Physiotherapy Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259372", "validThrough": "2020-12-03T23:59:59+0000"}