{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35301", "minValue": "35301", "unitText": "YEAR", "value": "Annex 21 may apply depending on experience"}}, "datePosted": "2020-10-27T12:32:13+0000", "description": "&lt;p&gt;An amazing &lt;span&gt;opportunity&lt;/span&gt; has arisen for an Advanced Specialist Practitioner in Colorectal Surgery to join a team of dedicated clinicians delivering cancer treatment to patients across Lancashire and South Cumbria. This is a perfect development opportunity for a senior nurse with experience in Colorectal Surgery to work alongside a fantastic and welcoming team. Could this be you?&lt;/p&gt;\n&lt;p&gt;The post holder will be a key member of the colorectal team and as an autonomous practitioner, they will be responsible for developing and leading a comprehensive service for managing patients who are referred into the colorectal service on a two week rule pathway. The post holder must be dynamic and proactive. A team player is essential with the ability to communicate effectively within the service and with patients.&lt;/p&gt;\n&lt;p&gt;The successful applicant for this job role would be supported to develop their clinical and leadership skills. A tailor made programme of development would be undertaken dependent on skill set and experience. We would expect the successful candidate to either be educated to masters level or willing to undertake a masters in Advanced Clinical Practice. This would be complimented by a supportive consultant mentor and the development of specific competencies.&lt;/p&gt;\n&lt;p&gt;On completion of the masters and competencies, the successful candidate would qualify as an Advanced Specialist Practitioner in Colorectal Surgery, which is a pioneering role we are proud to support. This is an Annex 21 payscale and Band 8a salary will be paid upon completion of all these elements.&lt;/p&gt;\n&lt;p&gt;Interview Date: 23rd November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah WelshJob titleMatron for General Surgery &amp; UrologyEmail addresssarah.welsh@lthtr.nhs.ukTelephone number07852 580459Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Sarah Welsh - Matron for Colorectal - sarah.welsh@lthtr.nhs.uk / 07852 580459&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Advanced Specialist Practitioner - Colorectal", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244526", "validThrough": "2020-11-15T23:59:59+0000"}