{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T16:16:21+0000", "description": "&lt;p&gt;Newcastle OHS Psychology &amp; Counselling team are excited to offer this unique opportunity for a Qualified Psychological Wellbeing Practitioner (PWP) to join our growing team in Occupational Health, expanding our ability to offer a high quality wellbeing being provision for staff employed by Newcastle upon Tyne Hospitals NHS Foundation Trust. The successful candidate will have the chance to develop and shape the provision of Low Intensity interventions and mental health education within the OHS team as part of a wider MDT including Clinical Psychology, Counselling, Physiotherapy, Nursing &amp; Medical colleagues.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have demonstrable experience of delivering evidence based low intensity interventions on both a group and individual basis and including through remote means, managing their own caseload. Delivering education and training will be a key part of the role therefore good communication and presentation skills are essential. They will demonstrate a comprehensive understanding of psychological wellbeing and common mental health problems, with the ability to apply this to the NHS workplace setting. We place value on CPD and Clinical supervision so a track record of using CPD and supervision effectively would be of value.&lt;/p&gt;\n&lt;p&gt;We are hoping to find an enthusiastic &amp; adaptable qualified PWP who is keen to expand their existing skills into a brand new specialty, supporting NHS staff and stakeholders. We are a team that thrives on innovation and working creatively and will strive to support the right candidate to applying their skills in novel ways to develop the service. We welcome informal enquiries from interested candidates.&lt;/p&gt;\n&lt;p&gt;Please refer to the Job Description and Person Specification for all essential and desirable criteria required for the role.&lt;/p&gt;\n&lt;p&gt;Full Time 37 Hours 30 Minutes/Week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 Trustwide", "postalCode": "NE7 7DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0028", "longitude": "-1.59341"}}, "title": "Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254744", "validThrough": "2020-11-17T23:59:59+0000"}