{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 per annum pro rata"}}, "datePosted": "2020-11-04T16:15:18+0000", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Practice Development Sister/Charge Nurse -Community Division&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 - &lt;/strong&gt;&lt;strong&gt;37.5 hrs/week - b&lt;/strong&gt;&lt;strong&gt;ased at Milford Hospital, Surrey&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have a passion for the development and education of staff in practice?&lt;/p&gt;\n&lt;p&gt;Are you an advocate for gold standards of care?&lt;/p&gt;\n&lt;p&gt;Why not consider joining the community division as their practice development nurse. You will be part of the highly motivated Practice Development Team at the Royal Surrey County Hospital but with a focus on community services delivering excellent education in the classroom and at the bedside in the hospital and in patients own homes.&lt;/p&gt;\n&lt;p&gt;The Practice Development Team support all levels of the nursing team to deliver high quality, evidence based, compassionate care to their patients. The team comprises of highly experienced educators who provide training and assessment for the National Care Certificate, Preceptorship, the RCN accredited Intravenous Administration course, specific core clinical skills and Test of Competence for overseas nurse within the trust.&lt;/p&gt;\n&lt;p&gt;The successful candidate would work strategically across the community supporting student nurses and working alongside staff nurses, preceptees, and healthcare assistants, Community rehabilitation assistants and specialist nurses supporting their transition to new roles, as well as building confidence and competence in those gaining new skills and/or who have been identified as requiring additional support. An integral part of the role is providing education in the classroom setting using varying methods of teaching, including innovative strategies such as simulation, empathy building devices and educational games to name but a few.&lt;/p&gt;\n&lt;p&gt;Advanced communication skills, a Mentor/Practice Assessor qualification and experience are essential for the role when providing assessment feedback and creating development plans with managers and staff to improve standards of patient care. Your clinical background and knowledge would contribute to the creation and review of our educational programmes, Trust standards, competencies and policies which act as a framework to protect our staff and patients.&lt;/p&gt;\n&lt;p&gt;We are looking for nurses with a passion for improving patient care and developing staff to do the same.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact Alison Oram, Sally Whitehouse or Vanessa Pasquier Practice Development team members Tel: 01483 571122 Extension 6945/2188 or Annette Coote Divisional Head of Nursing for the Community Division on 07920233704.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Godalming, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Practice Development Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256571", "validThrough": "2020-11-19T23:59:59+0000"}