{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45000", "minValue": "45000", "unitText": "YEAR", "value": "£45,000"}}, "datePosted": "2020-10-21T15:12:29+0100", "description": "&lt;p&gt;&lt;strong&gt;Clinical Specialist / Clinical or Counselling Psychologist or CBT Therapist&lt;/strong&gt;&lt;br /&gt;Salary - £44,790 - £50,826 | Based in Kingston | Fixed-Term (12 months) | 1x Full-Time (36 hours per week)&lt;em&gt;or&lt;/em&gt;2x Part-Time (18 hours per week)&lt;br /&gt;&lt;br /&gt;Achieving for Children recognise these are unprecedented times, but we continue to build capacity to support our most vulnerable groups. To do this we are continuing to attract talented professionals to join us as we continue to provide&lt;strong&gt;OUTSTANDING&lt;/strong&gt;(Kingston ILACS Ofsted 2019) services.&lt;br /&gt;&lt;br /&gt;If you have the skills that will enable us to continue to enhance our practice and improve outcomes for children further, we want to hear from you. We are looking for bright, enthusiastic people who have the passion and the drive to make a positive difference to children’s lives. By recognising and championing strengths we know we can make a real difference. It’s a genuine team effort in AfC. That’s why we want talented people, like you, to join us and help create a brighter future for children and families.&lt;br /&gt;&lt;strong&gt;&lt;br /&gt;About the Roles&lt;/strong&gt;&lt;br /&gt;These are two exciting new posts that are an integral part of our developing Mental Health Support Teams in Schools (from the government green paper in 2017 on Transforming Children&#39;s Mental Health. These roles will be supervisors in the Kingston clusters and will attend the King&#39;s College supervisor training. Both posts are part time or can be combined to a full time position. There may be potential to add additional hours to the part time roles elsewhere in the Emotional Health Service.&lt;br /&gt;&lt;br /&gt;As a Clinical Specialist / Clinical or Counselling Psychologist or CBT Therapist for Achieving for Children, you will be responsible for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing training, support, advice and consultation to school staff&lt;/li&gt;\n&lt;li&gt;Undertaking specialist mental health assessments of cases in order to formulate, plan and deliver a range of psychological interventions.&lt;/li&gt;\n&lt;li&gt;Providing CBT to children and young people both individually and in groups&lt;/li&gt;\n&lt;li&gt;Providing clinical supervision to other staff in the MHST&lt;/li&gt;\n&lt;li&gt;Attending the King&#39;s College supervisor training at part of the MHST programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About AfC&lt;/strong&gt;&lt;br /&gt;We are a not-for-profit social enterprise owned by three local authorities (Kingston, Richmond and Windsor &amp; Maidenhead), we offer the freedoms of a social enterprise with the employment benefits of local government. To find out more about usclick here.&lt;br /&gt;&lt;strong&gt;&lt;br /&gt;About You&lt;/strong&gt;&lt;br /&gt;To be an Clinical Specialist at AfC, you will be passionate about making a positive difference to the lives of children and young people as well as demonstrating the following points:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Putting children and young people first.&lt;/li&gt;\n&lt;li&gt;Be Qualified as a Clinical / Counselling Psychologist or CBT Therapist&lt;/li&gt;\n&lt;li&gt;Be able to provide consultation and training to school staff&lt;/li&gt;\n&lt;li&gt;Have CAMHS experience in working with complex and vulnerable families.&lt;/li&gt;\n&lt;li&gt;Be able to undertake child mental health assessments and deliver high-quality CBT to children and families.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About our benefits&lt;/strong&gt;&lt;br /&gt;When you join AfC you will have access to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Positive and supportive working environments&lt;/strong&gt;- We have a highly supportive working environment in which managers are challenging and supporting in equal measures.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Positive work-life balance&lt;/strong&gt;- Access to employee benefits and support forms part of our health and wellbeing offer.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A competitive salary and access to LA pension scheme&lt;/strong&gt;- Our salaries are benchmarked against other local authorities.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A range of staff benefits and discounts managed via your own app&lt;/strong&gt;- Staff can enjoy a wide range of discounts on sports and leisure activities and everyday shopping through AfC My Place.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional reflective supervision&lt;/strong&gt;- Regular, high-quality reflective supervision which helps to build confidence is available to all.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Strong Management&lt;/strong&gt;- A strong performance management culture, with an equally strong focus on practice learning, is embedded across the organisation.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A fantastic learning and development offer&lt;/strong&gt;- A clearly set out and accessible learning and development pathway, offering an extensive range of training and learning opportunities is accessible for all. This includes funding for post-qualifying courses.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To find out about all of the breadth of benefits of working for Achieving for Childrenclick here&lt;strong&gt;&lt;br /&gt;&lt;br /&gt;Start dates&lt;br /&gt;&lt;/strong&gt;Achieving for Children havefixed start datesand candidates are advised to prepare for this should a job offer be accepted to ensure eligible continuous service is not affected. Please see the attached documentation for more information.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;To apply&lt;br /&gt;&lt;/strong&gt;Please apply online including a supporting statement addressing how you meet the criteria for this post detailing what skills, knowledge, experience and abilities you can bring to the role, as outlined inRole Profile for the Kingston roleand theRole Profile for the Tolworth Girlsrole.&lt;br /&gt;&lt;br /&gt;If you would like to find out more about this exciting opportunity, please contact Sarah Head, Deputy Head of EHS &amp; MHST Lead on 020 8547 6269 for an informal discussion.&lt;br /&gt;&lt;strong&gt;&lt;br /&gt;Advert Closing Date: 18th October 2020&lt;br /&gt;Provisional Interview Date: 3rd November 2020&lt;br /&gt;&lt;br /&gt;We reserve the right to close this vacancy once a sufficient number of applications has been received. Therefore, it is strongly advised that you complete and return your application as soon as possible to avoid disappointment.&lt;/strong&gt;&lt;br /&gt;&lt;em&gt;&lt;br /&gt;Achieving for Children is an equal opportunities employer and is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults. We expect all staff and volunteers to share this commitment.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Royal Borough of Kingston upon Thames", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130374"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston", "postalCode": "KT1 1EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4078", "longitude": "-.306445"}}, "title": "Clinical or Counselling Psychologist or CBT Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237033", "validThrough": "2020-11-08T23:59:59+0000"}