{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 pa pro rata"}}, "datePosted": "2020-10-28T16:45:54+0000", "description": "&lt;p&gt;Weston General Hospital, part of University Hospitals Bristol and Weston NHS Foundation Trust, is delighted to announce an exciting job opportunity within the award winning Geriatric Emergency Medicine Service (GEMS), the acute front door frailty service at Weston General Hospital.&lt;/p&gt;\n&lt;p&gt;The team are looking for an enthusiastic, motivated and dedicated person to join GEMS at Weston General Hospital. This is a full time position, but we will consider candidates looking for a part time or job share contract.&lt;/p&gt;\n&lt;p&gt;The Geriatric Emergency Medicine Service consists of a frailty specialist Multi-Disciplinary Team (MDT) working from within the new GEMS Unit , within the Emergency Department, and supporting GEMS MDT members working on the Acute Medical Unit to deliver best care for older people living with frailty.&lt;/p&gt;\n&lt;p&gt;The post holder will be confident and have experience of being the first doctor to assess and initiate appropriate investigation and care for older aged patients arriving into hospital including presentations in the Emergency Department. They will be competent in assessing patients for injury and wound care including being competent at reviewing x-rays for bony injury and have the knowledge to apply national guidelines such as for CT head scan following head injury. The post holder should have experience of working within an MDT.&lt;/p&gt;\n&lt;p&gt;You will be working alongside other partners including Community, Ambulance, Acute and Voluntary Sector as we work together to create a seamless integrated proactive pathway for older patients living with Frailty.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the GEMS team as we further develop frailty services within the hospital and within the locality.&lt;/p&gt;\n&lt;p&gt;We welcome applicants from a range of backgrounds including Medicine, Emergency Medicine and General Practice, who can demonstrate skill and experience of caring for older patients living with frailty in the acute setting.&lt;/p&gt;\n&lt;p&gt;Weston-super Mare is enjoying a period of investment and development but still remains an affordable place to live. As well as the usual attractions of a seaside town it is surrounded by picturesque countryside.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Rachael Morris-SmithJob titleAssociate Specialist in Acute Frailty and Frailty Service LeadTelephone number01934 636363Additional contact information&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Dr Alison Edwards (Associate Medical Director) on 01934 636363.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Weston General Hospital, Weston-super-Mare", "postalCode": "BS23 4TQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3223", "longitude": "-2.97141"}}, "title": "Specialty Doctor in Frailty Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247413", "validThrough": "2020-11-11T23:59:59+0000"}