{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "41457", "minValue": "37596", "unitText": "YEAR", "value": "From £37,596 - £41,457 per annum"}}, "datePosted": "2020-11-03T09:02:02+0000", "description": "&lt;p&gt;We are looking for a fully qualified and experienced Family therapist / Systemic psychotherapist to work in our Child and Adolescent Mental Health Service (CAMHS) at The Huntercombe Hospital Stafford located in Wheaton Aston, 10 miles from Telford &amp; 12 miles from Wolverhampton. The hospital is rated as Good overall with outstanding care by the Care quality commission.&lt;/p&gt;\n&lt;p&gt;As a Family therapist / Systemic Psychotherapist you will have undertakena systemic family therapy course and be registered as a family therapist. You willbe able to work autonomously within the context of a multi-disciplinary team approach and undertake specific clinical work with patients and their families in response to clinical needs, in a way which coheres with the overall treatment philosophy of the Unit. This is mainly working with in-patients, but may also be with-out patients and day patients.&lt;/p&gt;\n&lt;p&gt;The Huntercombe Hospital – Stafford&lt;/p&gt;\n&lt;p&gt;The hospital is a 36 bed Tier 4 CAMHS hospital for young people aged 12 -18 years with a range of mental health disorders and includes the following units:&lt;/p&gt;\n&lt;p&gt;•General Adolescent Care&lt;/p&gt;\n&lt;p&gt;•Psychiatric intensive care&lt;/p&gt;\n&lt;p&gt;•Eating Disorders&lt;/p&gt;\n&lt;p&gt;There is FREE PARKING at hospital which is located close to the village of Wheaton Aston, 10 miles from Stafford and just 6 miles from the M6 motorway.&lt;/p&gt;\n&lt;p&gt;We employ an experienced and fully trained multidisciplinary team of staff and provide ongoing support with comprehensive training, learning and development opportunities.&lt;/p&gt;\n&lt;p&gt;All patients are referred via NHSE. We play an integral part in contributing to new models of care outlined in the Five Year Forward View.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a Family therapist / Systemic Psychotherapist working in our Child and Adolescent Mental Health Service (CAMHS) your main duties will be:-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•To undertake specific therapeutic work with patients and their families in response to the clinical need, in a way which coheres with the overall treatment philosophy of the Unit&lt;/p&gt;\n&lt;p&gt;•Maintaining effective clinical records and casework notes in accordance with developing policy&lt;/p&gt;\n&lt;p&gt;•Providing evidence-based mental health and systemic psychotherapy services across the hospital&lt;/p&gt;\n&lt;p&gt;•Conducting systemic assessments, treatment and consultation to client systems including children, young people, their families, carers and professional networks&lt;/p&gt;\n&lt;p&gt;•Working as a member of the multidisciplinary team (MDT) participating in clinical team meetings and other departmental meetings as necessary&lt;/p&gt;\n&lt;p&gt;•Attending team meetings aimed at facilitating and enhancing team cooperation and performance&lt;/p&gt;\n&lt;p&gt;•Providing coaching, training, mentoring and management of junior staff and student placements&lt;/p&gt;\n&lt;p&gt;•Taking responsibility for own professional &amp; personal development through the performance and development reviews and attending all relevant training&lt;/p&gt;\n&lt;p&gt;•Ensuring that that all relevant codes of practice and regulations (MHA1983 &amp; Care Standards Act 2000, Children’s Act, Human Rights Act) are upheld&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To join The Huntercombe Group as a Family therapist / Systemic Psychotherapist you will:-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•Hold current UKPC registration&lt;/p&gt;\n&lt;p&gt;•Have undertakena systemic family therapy course and be registered as a family therapist&lt;/p&gt;\n&lt;p&gt;•Have knowledge and understanding of adolescent development&lt;/p&gt;\n&lt;p&gt;•Have a person centred ethos, showing empathy and a desire to make a difference&lt;/p&gt;\n&lt;p&gt;•Have the ability to motivate, lead and supervise a team&lt;/p&gt;\n&lt;p&gt;•Be able to demonstrate initiative and creativity&lt;/p&gt;\n&lt;p&gt;•Be flexible and adaptable, well organised and able to manage time and workload effectively in line with the needs of the service&lt;/p&gt;\n&lt;p&gt;•Have a desire to expand your professional development and support organisational change&lt;/p&gt;\n&lt;p&gt;•Have a legal right to work in the UK&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•A thorough induction programme tailored to the hospital where you will be working&lt;/p&gt;\n&lt;p&gt;•Clear pay structure, with competitive rates&lt;/p&gt;\n&lt;p&gt;•Generous annual leave entitlement&lt;/p&gt;\n&lt;p&gt;•Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/p&gt;\n&lt;p&gt;•The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/p&gt;\n&lt;p&gt;•Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/p&gt;\n&lt;p&gt;•2 weeks paid paternity leave&lt;/p&gt;\n&lt;p&gt;•Shared parental leave, matching the maternity leave benefit&lt;/p&gt;\n&lt;p&gt;•Death in service benefit equivalent to 2 x salary&lt;/p&gt;\n&lt;p&gt;•A range of staff discounts&lt;/p&gt;\n&lt;p&gt;•Employee Assistance Programme (EAP)&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, martial status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click Apply now.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wheaton Aston, STAFFORDSHIRE", "postalCode": "ST19 9QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6942", "longitude": "-2.23489"}}, "title": "Family Therapist / Systemic Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253208", "validThrough": "2020-12-02T23:59:59+0000"}