{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-27T08:45:27+0000", "description": "&lt;p&gt;We are looking for a Band 4 Support Worker who can bring enthusiasm, knowledge and expertise to the dynamic and developing Crisis Resolution and Home Treatment Team (CRHTT) based in Worthing.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity that we believe adds real value to our services. We are aiming to provide a smother transition from inpatient to community care, create more opportunities for early discharge from hospital, focused crisis and relapse prevention planning and this post will be instrumental in this development.&lt;/p&gt;\n&lt;p&gt;You will form part of an additional resource allocated specifically to achieve the above goals and improve crisis intervention work overall. You will be working with people when they first present to Crisis Home Treatment Team until the point of discharge.&lt;/p&gt;\n&lt;p&gt;Our Coastal Urgent Care Pathway is moving towards CORE 24 standards and service provision at the General Hospital Mental Health Liaison Teams (MHLT). As a member of CRHTT you will be expected to work a shift system between 7am - 9.30pm, seven days a week including Bank Holidays.&lt;/p&gt;\n&lt;p&gt;This will be a challenging but rewarding role, working with people presenting with a range of mental health issues and risks. You will need to demonstrate how you can work in a fast paced environment, have the ability to be dynamic and adaptable.&lt;/p&gt;\n&lt;p&gt;The successful postholder will work within a dedicated, dynamic and enthusiastic team, and will receive appropriate support and supervision.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are reading this and thinking this is the ideal job opportunity for you and you would like more information, please do contact me on the number below. I would welcome interested applicants for an informal visit and conversation about the role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah LivermoreJob titleTeam LeaderEmail addresssarah.livermore@sussexpartnership.nhs.ukTelephone number01903 843739Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Meadowfield, Worthing", "postalCode": "BN13 3EF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8424", "longitude": "-.41189"}}, "title": "Senior Support Worker CRHT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243740", "validThrough": "2020-11-10T23:59:59+0000"}