{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 Pro-rata"}}, "datePosted": "2020-11-02T11:36:38+0000", "description": "&lt;p&gt;Are you professional and highly motivated with a drive for delivering excellent care? Are you looking to move into an exciting and rewarding role within The Ministry of Defence?&lt;/p&gt;\n&lt;p&gt;Look no further.&lt;/p&gt;\n&lt;p&gt;We have just the role for you here at Clive Barracks, Tern Hill. You will be part of a multi-disciplinary primary healthcare team delivering general medical services and elements of occupational health to military personnel and, where appropriate, their dependants.&lt;/p&gt;\n&lt;p&gt;As the successful candidate you will be required to deliver a unified, safe, efficient and accountable primary healthcare service for entitled personnel to maximise their health and to deliver personnel medically fit for operations. You will be responsible for the delivery of appropriate assessment, planning, implementation and evaluation of care needs, medical screening and advice to patients within your professional competence. You will be expected to uphold the Nursing &amp; Midwifery Council code of professional conduct, whilst adhering to all Ministry of Defence standards, policies and guidelines.&lt;/p&gt;\n&lt;p&gt;The working environment here is welcoming, inclusive and supportive, and you will be valued for the skills you bring. The successful candidate may also be required to work from RAF Shawbury Medical centre, Shrewsbury Shropshire SY4 4DZ.&lt;/p&gt;\n&lt;p&gt;It is important to note that you will gain access to the additional benefits of a competitive salary, paid holiday entitlement and numerous opportunities for continuous professional development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note this role is Part Time advertised at 30 hours per week.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please read the attached Job Description for further information on the role and it&#39;s requirements.&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;Essential Criteria&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Must be registered with the Nursing and Midwifery Council (NMC) with professional knowledge acquired through degree/diploma, supplemented by diploma level specialist training, experience, short courses&lt;/li&gt;\n&lt;li&gt;Hold a valid Personal Identification Number (PIN)&lt;/li&gt;\n&lt;li&gt;Specialist knowledge across a range of procedures underpinned by theory.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Selection Process&lt;/h2&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV.&lt;/p&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;You will also be tested against the following NHS Key Skills Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core – NHSC1 – Communication&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC2 – Personal &amp; People Development&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC4 – Service Improvement&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB1 – Promotion of Health &amp; Wellbeing&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB6 – Assessment &amp; Treatment Planning&lt;/li&gt;\n&lt;li&gt;NHS Information &amp; Knowledge – NHS IK2 – Information Collection &amp; Analysis&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;Further Information&lt;/h2&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel, but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;Please note that salary will be pro rata.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clive Barracks, Tern Hill, Market Drayton, Shropshire TF9 3QE", "postalCode": "TF9 3QE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8793", "longitude": "-2.5386"}}, "title": "Band 6 Nurse (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251844", "validThrough": "2020-11-24T23:59:59+0000"}