{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35573", "minValue": "31469", "unitText": "YEAR", "value": "£31469.00 - £35573.00 Per Annum"}}, "datePosted": "2020-11-06T12:16:28+0000", "description": "&lt;p&gt;Qualified Nurse&lt;br /&gt;&lt;br /&gt;Penylan House, Cardiff&lt;br /&gt;&lt;br /&gt;We offer bank, part time and full time positions.&lt;br /&gt;&lt;br /&gt;From £31,469.00pa (£15.31ph) to £35573.00pa (£17.31ph) - depending on the T&amp;C package chosen by the successful applicant&lt;br /&gt;&lt;br /&gt;Looking for a Nurse position where you can make a real difference every day?&lt;br /&gt;&lt;br /&gt;We&#39;re thrilled to announce that our recent residents and relatives&#39; satisfaction survey showed an incredible 100% are happy with the quality of their relative&#39;s care and support.&lt;br /&gt;&lt;br /&gt;To enable us to continue on our successful journey, we now have fantastic opportunities for Qualified Nurses to join our team in our Penylan House Nursing Home, Cardiff.&lt;br /&gt;&lt;br /&gt;This sounds great, tell me more...!&lt;br /&gt;&lt;br /&gt;Penylan House is a part of Linc Care and operates in the not-for-profit sector. The fully redeveloped modern, purpose-built facility has 75 single, ensuite bedrooms with well furnished rooms, landscape gardens and car parking. The whole building exceeds CSSIW requirements with bigger bedrooms, wider corridors, spacious lounges and a high staff to resident ratio.&lt;br /&gt;&lt;br /&gt;Working alongside a well trained staff team of Care Assistants, our nurses lead by example on a daily basis to support approximately 15 elders by day within an assigned &#39;community&#39;. Our elders have a range of complex care needs allowing you to enhance your experience of working in Nursing and EMI care.&lt;br /&gt;&lt;br /&gt;Taking responsibility and acting as &#39;named nurse&#39; gives our nurses the opportunity to build effective professional relationships, and ensure that the care we deliver always meets the changing circumstances and personal wishes of each individual.&lt;br /&gt;&lt;br /&gt;Did you know...?&lt;br /&gt;&lt;br /&gt;•Linc offer a flexible benefit system for our Nurses where you can pick from two benefit packages to suit your needs. Would you prefer an enhanced hourly rate or enhanced annual leave? You decide!&lt;br /&gt;•You will be working 39.38 hours per week for a full time position, which includes a paid 15-minute handover, and your shifts will be provided to you around 4 weeks in advance so that you can balance your work and home life.&lt;br /&gt;•We recognise the importance of Continuous Professional Development, and you will benefit from a full, tailored induction programme when you start with us. You&#39;ll then be provided with significant opportunities to enhance your specialist clinical and management skills and be provided with full support with PIN revalidation.&lt;/p&gt;\n&lt;p&gt;So what are you waiting for?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Come and take the first steps towards your career with an organisation that is passionate about people, homes and their communities!&lt;br /&gt;&lt;br /&gt;We look forward to hearing from you!&lt;/p&gt;\n&lt;p&gt;If you would like an informal chat about nursing with Linc or would like to arrange an informal look around our Nursing homes, please give the recruitment team a call on 02920 474 715. We look forward to hearing from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Linc Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cardiff", "postalCode": "CF23 5YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5015", "longitude": "-3.16073"}}, "title": "Registered Nurse (£31,003.00+)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259628", "validThrough": "2020-12-06T23:59:59+0000"}