{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45000", "minValue": "45000", "unitText": "YEAR", "value": "Up to £45,000"}}, "datePosted": "2020-10-28T11:46:22+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Are you looking for a new challenge in an environment where no two days are the same?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Patient care is at the centre of what we do and we are looking for an enthusiastic, hard working and committed nurse who wants to make a difference to our patient’s lives. HMP YOI Moorland + Hatfield is a category C adult male and young offenders prison. We provide a GP surgery provision alongside access to mental health and substance misuse services.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Make a difference from day one!&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt; &lt;br /&gt;Prisons are challenging, yet rewarding places for healthcare professionals to work.&lt;br /&gt; &lt;br /&gt;If you want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it! As a healthcare provider, we recognise the fact that prisoners are a socially excluded group with complex healthcare needs that can often be associated with poor outcomes. We believe in putting the patient first, regardless of the environment or their history. We are the market leader, providing care to over 30,000 patients in over 40 prisons across the country. Our core values are; everyone makes a difference, patients are at the heart of everything we do and together we make things better. If you share these values and have transferable skills we want to meet you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What can we offer you?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As the Mental Health Lead Nurse you will be an integral part of the healthcare team by utilising your clinical skills, decision making and problem solving skills. In addition to triaging and leading clinics, reception screening, medication administration and responding to emergency situations you will manage other staff providing them managerial and clinical supervision. Your role will involve supporting junior staff to carry out comprehensive assessments, confidently communicating treatment options and initiating supportive care plans. You will work with individuals on a 1-2-1 basis alongside the wider multi-disciplinary team. There are great opportunities for training and development and the opportunity to work with interesting patients and learn new skills.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt; &lt;br /&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. They will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at either HMP Moorland or Hatfield if suitable. For more information or to arrange an informal visit please contact us on the details provided. Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced free DBS check and prison vetting. At Care UK we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN7 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5471", "longitude": "-.97144"}}, "title": "Mental Health Lead - HMP YOI Moorland/ Hatfield", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246388", "validThrough": "2020-11-18T23:59:59+0000"}