{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum/pro rata"}}, "datePosted": "2020-11-04T10:16:31+0000", "description": "&lt;p&gt;Frailty Nurse Specialist&lt;/p&gt;\n&lt;p&gt;Division: Unplanned &amp; Integrated Care&lt;/p&gt;\n&lt;p&gt;Care Group: Therapies and Older Persons&lt;/p&gt;\n&lt;p&gt;Band: 6&lt;/p&gt;\n&lt;p&gt;Salary: £31,365 - £37,890 per annum/pro rata&lt;/p&gt;\n&lt;p&gt;Interview date - Week commencing 30th November 2020&lt;/p&gt;\n&lt;p&gt;We are recruiting for a Clinical Nurse Specialist who shares our ambition and vision to deliver the &lt;em&gt;&lt;strong&gt;Best of Care by the Best of People&lt;/strong&gt;&lt;/em&gt; and has the drive to take us forward, by ensuring that the Trust continues to be the first choice for patients and our staff.&lt;/p&gt;\n&lt;p&gt;As a Clinical Nurse Specialist, you will work collaboratively as part of a small and friendly multi-disciplinary team with a focus on providing holistic, evidence-based and cost-effective care&lt;/p&gt;\n&lt;p&gt;You will provide clinical supervision to other staff, students and may undertake research, lead clinical audits in our specialist area of Frailty. Ensuring the safety and well-being of service users and always working in a manner that promotes dignity and improved patient experience through the adoption of person centered care principles.&lt;/p&gt;\n&lt;p&gt;Within this role you will act as an advocate for patients within the department, to ensure a patient orientated approach to the delivery of care and to meet agreed standards&lt;/p&gt;\n&lt;p&gt;The Trust and its employees are all committed to creating and maintaining a fair and supportive working environment and culture.&lt;/p&gt;\n&lt;p&gt;As part of our ongoing commitment to professional development we are offering a number of apprenticeships and training opportunities in Leadership and Management, Business Services, Finance, Accounting and HR, Clinical Support Work, Research and Innovation, Nursing Associate and Assistant Practitioner alongside our in-house comprehensive clinical pathways.&lt;/p&gt;\n&lt;p&gt;Our hope is that our education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the protection of children, young people, their families and vulnerable adults accessing its services. Promoting the message that “safeguarding is everyone’s business” is vital to ensure our patients are protected and safe from abuse. To this end you must comply with Trust’s and the Kent and Medway Safeguarding Board’s policies on safeguarding children, young people and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Almarie Latibudiere - Frailty Nurse Specialist&lt;/p&gt;\n&lt;p&gt;a.latibudiere@nhs.net / 01634 830000 ext 5982&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Frailty Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255350", "validThrough": "2020-11-18T23:59:59+0000"}