{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pro rata"}}, "datePosted": "2020-10-28T12:48:12+0000", "description": "&lt;p&gt;We are looking to recruit a committed Speech and Language Therapist who has enthusiasm and compassion for supporting and enabling young people with complex needs with a particular interest in youth forensic services. We invite you to join our well established health care team within a Local Authority provision. The team is comprised of a Forensic Psychologist, two Mental Health Nurses, an Occupational Therapist, a Substance Misuse Nurse and Physical Health care Nurse. We are looking to recruit a committed Speech and Language Therapist who has enthusiasm and compassion for supporting and enabling young people with complex needs with a particular interest in youth forensic services. We invite you to join our well established health care team within a Local Authority provision. The team is comprised of a Forensic Psychologist, two Mental Health Nurses, an Occupational Therapist, a Substance Misuse Nurse and Physical Health care Nurse. We have direct business support from two Administrators and support from a Child &amp; Adolescent Consultant Psychiatrist.&lt;/p&gt;\n&lt;p&gt;The Lincolnshire secure unit is a 12 bedded secure children’s home, housing those serving youth custodial sentences or residing under a court welfare order. We work within the Secure Stairs model of care. The model involves training staff to provide more psychologically informed trauma responsive care surrounding comprehensive, co-produced assessments to ensure all needs are identified and addressed. The health care staff provide a team approach to all of the Young people including close collaboration and consultation to the care and education staff on site.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work with adolescents, their families/carers and wider community care teams providing appropriate assessment and intervention. This post will involve participation in multi-disciplinary team meetings and occasionally supporting the delivery of training to the care team.&lt;/p&gt;\n&lt;p&gt;You will have an understanding of the communication needs for young people with a multitude of complex difficulties such as attachment disorder and Autistic spectrum disorder. You must be able to demonstrate this with recent and on-going clinical professional development.&lt;/p&gt;\n&lt;p&gt;The successful candidate can expect to work within a friendly, professional and passionate team, receive regular managerial and clinical supervision, an annual appraisal and training opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In addition to other attractive benefits from LPFT there is the availability of a £4,000 payment in lieu of relocation (to assist with commuting) or full relocation package.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincolnshire Secure Unit, Rookery Avenue, Sleaford", "postalCode": "NG34 8QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9826", "longitude": "-.455546"}}, "title": "Speech &amp; Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246661", "validThrough": "2020-11-22T23:59:59+0000"}