{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T12:17:00+0000", "description": "&lt;p&gt;The OT Practitioner rotation within Gwent currently has a vacancy for an Occupational Therapy Practitioner working in Newport Community Learning Disability Team based in the Civic Centre Newport (CLDT). The postholder will be working alongside a supervising senior OT and an OT support worker. The post holder will be delivering community OT assessment and intervention for adults with a Learning Disability living in the community.&lt;/p&gt;\n&lt;p&gt;The OT Practitioner rotation for Aneurin Bevan University Health Board offers the opportunity to gain experience in the clinical areas of Learning Disabilities, Adult and Older Adult Mental Health, Community Reablement, Paediatrics, Acute Medicine, Surgery and Trauma Orthopaedics, Acute Stroke Care and Rehabilitation, General and Orthopaedic Rehabilitation, Child and Adolescent Mental Health.&lt;br /&gt;&lt;br /&gt;Supported by skilled and experienced specialist staff we offer regular supervision, a preceptorship programme to support newly qualified practitioners, annual appraisal and a variety of opportunities for continuing professional development. &lt;br /&gt;&lt;br /&gt;Occupational Therapy is a highly valued service within Gwent and we are strongly committed to service development, standard setting, clinical effectiveness and life long learning. We are keen to recruit occupational therapists that are ready to work in an occupational therapy service that is actively developing and changing to meet the needs of the people that we serve.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 11th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mel Vale Professional lead Occupational Therapist for Adult with Learning Disabilities 01633 623559 melanie.vale@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Sandra Napper OT Newport Commuity Learning Disability Team Sandra.napper@wales.nhs.uk Tele: 01633 238656&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport CLDT, Newport", "postalCode": "NP20 4UR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5887", "longitude": "-3.00582"}}, "title": "Occupational Therapist Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246540", "validThrough": "2020-11-11T23:59:59+0000"}