{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-03T11:46:11+0000", "description": "&lt;p&gt;&lt;span&gt;St Richard&#39;s Hospital, Chichester&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to begin your career in a friendly dynamic team in a CQC rated “outstanding” Trust?&lt;/p&gt;\n&lt;p&gt;If you are a student qualifying in 2021 or qualified and seeking to relocate; Western Sussex Hospitals NHS Foundation Trust has opportunities for radiographers to join the Chichester St. Richard&#39;s team. The Western Sussex radiology team were voted South East region “team of the year 2018” by the SCOR.&lt;/p&gt;\n&lt;p&gt;You will be mentored through a comprehensive induction programme using DR equipment and taught CT head scanning for out of hours shifts. Induction will include rotation through all areas of the general department, theatres and fluoroscopy. There may be occasion for cross site working to Worthing Hospital. Free hospital transport runs between all sites in the Trust.&lt;/p&gt;\n&lt;p&gt;Our departments are focused on providing an excellent level of service for our patients and a supportive environment for our staff. We support continual learning and development.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to staff health &amp; wellbeing offering many activities and support.&lt;/p&gt;\n&lt;p&gt;We ask that you demonstrate exceptional clinical and professional standards, consistently deliver the highest quality patient-focused care to our patients, and provide evidence of ongoing CPD.&lt;/p&gt;\n&lt;p&gt;Some experience of working within the UK health system as well as a general background in a broad range of imaging is required for this role. We require all radiographers to have a positive attitude to team working and good organisational and communication skills.&lt;/p&gt;\n&lt;p&gt;Please note that all qualified applicants must hold a BSc in Diagnostic Radiography or the Diploma of the College of Radiographers and HCPC registration. Assistance with first HCPC application fee is available.&lt;/p&gt;\n&lt;p&gt;In common with many Imaging departments the demand continues to increase and therefore a commitment to providing seven day services, extended working days, weekends, standby and on call duties are requirements of the successful candidate.&lt;/p&gt;\n&lt;p&gt;Located on the south coast Chichester provides excellent transport links to Brighton, Worthing, London &amp; Portsmouth; with Gatwick airport easily accessible.&lt;/p&gt;\n&lt;p&gt;Please feel free to contact us if you wish to come to look around our “Outstanding” rated Hospitals.&lt;/p&gt;\n&lt;p&gt;Contact details below.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMatthew StevensJob titleSuperintendent RadiographerEmail addressmatthew.stevens7@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121075.png", "name": "Western Sussex Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St. Richards Hospital, Chichester", "postalCode": "PO19 6SE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8436", "longitude": "-.768008"}}, "title": "Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253789", "validThrough": "2020-11-17T23:59:59+0000"}