{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata)"}}, "datePosted": "2020-10-22T11:32:11+0100", "description": "&lt;p&gt;Due to internal promotion and the continuing strong growth of our BCHC Plus (Traded) Speech and Language Therapy Team we are recruiting to further permanent Band 6 posts. We are interested in recruiting therapists who have experience in working in mainstream and/or specialist education settings.&lt;/p&gt;\n&lt;p&gt;Our BCHC Plus Programme was introduced in September 2014 and we now have an enthusiastic team consisting of Band 6 and Band 5 SLTs, dedicated admin support, and a Band 7 Team Leader. The team has established a reputation for service excellence and enviable customer feedback.&lt;/p&gt;\n&lt;p&gt;We value our therapists within the BCHC Plus Team and advocate career progression internally. We encourage our SLTs to contribute to service development, and we value new ideas and experiences.&lt;/p&gt;\n&lt;p&gt;We deliver clinical excellence through Universal, Targeted and Specialist approaches tailored to the schools’ and children’s individual needs to provide an efficient and effective service. Working in this way provides ample opportunities to develop a broad range of clinical skills with a variety of client groups.&lt;/p&gt;\n&lt;p&gt;Our well established working relationships with other agencies have enabled us to play an active part in development of the Citywide strategy for children with speech, language and communication needs.&lt;/p&gt;\n&lt;p&gt;We would like to recruit individuals who have a passion for developing their career as a speech and language therapist within school and nursery environments. Applicants must have established clinical and negotiation skills and recent experience of working within schools.&lt;/p&gt;\n&lt;p&gt;The BCHC Plus SLT Service forms part of a large and forward thinking Children’s Speech and Language Therapy Service, working as part of Inclusion Services within the Children and Families Division of Birmingham Community Healthcare NHS Trust. The wider SLT Service works across the whole city covering the full range of community settings, including mainstream and Special Schools, Health Centres, and Child Development Centres. By being part of the wider Children’s Speech and Language Therapy Service, the BCHC Plus Service are able to offer a supportive working environment with access to specialist clinical support and an emphasis on sharing good practice through effective team working and encourage continuing professional development.&lt;/p&gt;\n&lt;p&gt;Please contact Laura Adlington (Team Leader) to discuss the role.&lt;/p&gt;\n&lt;p&gt;IMPORTANT&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLaura AdlingtonJob titleTeam LeaderEmail addresslaura.adlington@bhamcommunity.nhs.ukTelephone number07701 293 974&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfields Centre, Raddlebarn Road, Selly Oak, Birmingham, B29 6JB, Birmingham", "postalCode": "B29 6JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4362", "longitude": "-1.93814"}}, "title": "Band 6 Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238173", "validThrough": "2020-11-08T23:59:59+0000"}