{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 to £32,146 pa inc HCAS"}}, "datePosted": "2020-11-02T03:45:56+0000", "description": "&lt;h1&gt;&lt;strong&gt;Emergency Department (Adult)&lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;Join our Nursing Team – Together We Care&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;It’s an exciting time to be a nurse at Ashford &amp; St Peter’s as the Emergency department will soon be undergoing some exciting renovations with a bigger and better urgent care centre, and a restructuring of the main department to improve the streamlining of patient care. The Trust’s vision is being able to provide an outstanding experience and the best outcome for both patients and the team. We believe in providing safe, high quality and effective care to all our patients, with award-winning nurses at the heart of our services.&lt;/p&gt;\n&lt;p&gt;The Adult ED is divided into 6 sections:&lt;br /&gt;•PIT stop (Ambulance receiving)&lt;br /&gt;•Urgent Care Centre – for minor injuries and illness with a 7 day Emergency Nurse Practitioner Service &lt;br /&gt;•Trolleys / Low dependency&lt;br /&gt;•Majors / High dependency&lt;br /&gt;•Resuscitation – a 4 bedded area with dedicated stroke, cardiac, trauma and paediatric bays &lt;br /&gt;•Same Day Emergency Care &amp; Clinical Decisions Unit – for patients requiring more than 4 hours observation, but not requiring hospital admission&lt;/p&gt;\n&lt;p&gt;We have a dedicated Trauma Team and close ties with St. George’s Major Trauma Centre and Neurosurgical Services.&lt;/p&gt;\n&lt;p&gt;Our aim is to provide excellence in clinical care in a safe environment and we strive to continuously develop the service we provide. We ensure that care is provided in an evidence-based manner and we are strongly committed to clinical governance and quality improvement.&lt;/p&gt;\n&lt;p&gt;Our Emergency Department (ED) is the biggest and busiest department in Surrey operating a 24 hour service; however the dedicated team of nurses, doctors and reception staff along with our other multi-disciplinary colleagues always strive to do the best for our patients and to support each other.&lt;/p&gt;\n&lt;p&gt;All staff are positively encouraged to undertake continuing education and mandatory training sessions. We have a Clinical Practice Development Nurse, whose role is to lead and facilitate the education and training of the nursing team in all our areas, with strong links to the University of Surrey and Brighton University.&lt;/p&gt;\n&lt;p&gt;All new staff will be allocated a mentor and a personalised orientation programme is developed between the individual staff member and their mentor, with a minimum 4 week supernumerary period following the 5 day Trust Induction.&lt;/p&gt;\n&lt;p&gt;We are keen to hear from experienced nurses, newly qualified nurses looking for their first post upon qualifying and nurses looking for their first NHS hospital experience.&lt;/p&gt;\n&lt;p&gt;We offer flexible working including days, nights and twilight shifts.&lt;/p&gt;\n&lt;p&gt;For further information please e-mail Matrons kaye.paterson@nhs.net and sarah.moth@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Staff Nurse, A&amp;E - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251220", "validThrough": "2020-12-07T23:59:59+0000"}