{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 Per Annum"}}, "datePosted": "2020-10-23T14:45:59+0100", "description": "&lt;p&gt;We are looking for an enthusiastic Senior Therapy Technician (Band 4) to join the Therapies Team at the University Hospital of North Midlands. The post holder will work within a team of dedicated Therapists and Technicians, supporting both Occupational Therapy and Physiotherapy activities, including assessment, treatment and discharge of patients, always aiming to meet the patients’ rehabilitation goals.&lt;/p&gt;\n&lt;p&gt;The Therapy Department is made up of two divisional therapy teams working across multiple clinical areas. This full time post sits within the Medical Division Therapies team, with the post holder predominantly being based at County Hospital, although all posts have opportunities to work across both the Royal Stoke and County Hospital sites.&lt;/p&gt;\n&lt;p&gt;Regular supervision will be provided by the Advanced and Senior Occupational Therapists/Physiotherapists and continuous development will be supported through appraisal and training.&lt;/p&gt;\n&lt;p&gt;Therapy Services work within a 7 day shift system therefore the post holder will be required to work weekends, late shifts and bank holidays.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGaynor-Kay TravisJob titleHead of Therapy Services, County HospitalEmail addressgaynor.travis@uhnm.nhs.ukTelephone number01785 230201Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "County, County", "postalCode": "ST16 3SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8113", "longitude": "-2.09774"}}, "title": "Senior Therapy Technical Instructor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240987", "validThrough": "2020-11-06T23:59:59+0000"}