{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa, based on full time hours"}}, "datePosted": "2020-10-21T11:00:35+0100", "description": "&lt;p&gt;&lt;strong&gt;Do you wish to be part of our exciting new developments in our Early Intervention in Psychosis Service, including the delivery of our Psychosis Pathway? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a Senior Specialist Practitioner, Band 6, to join our Early Intervention in Psychosis Team (EIP).&lt;/p&gt;\n&lt;p&gt;The team provides timely support to service users in Southampton in line with national and local guidelines and for people experiencing first episode psychosis between the ages of 14 to 35.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and reflective person who is committed to working with a diverse, multi-cultural community and to provide individualised care to promote the recovery of people experiencing First Episode Psychosis.&lt;/p&gt;\n&lt;p&gt;Within our well established team, the work is varied and challenging, and there is a strong team approach ensuring good support for the successful applicant. You will need to have a flexible, multi-disciplinary approach, have a solid understanding of risk assessment, crisis planning and delivering care within the early intervention model and psychosis pathway. The team provides recovery orientated NICE concordant interventions for up to three years duration. There is opportunity for a formal induction and further training.&lt;/p&gt;\n&lt;p&gt;We work closely with colleagues within the wider Community Treatment Team, Local Authority and voluntary sector organisations to maximise our service user experience.&lt;/p&gt;\n&lt;p&gt;To be considered for this role you will need to be either a Registered Mental Health Nurse, an Occupational Therapist or a Social Worker. The use of a car is also essential to complete this position, as well as the ability to travel.&lt;/p&gt;\n&lt;p&gt;Previous experience and training in CBT would be highly desirable. Knowledge and experience in running groups, delivering psychosocial interventions and working with dual diagnosis would also be valued.&lt;/p&gt;\n&lt;p&gt;We are currently looking for a practitioner to work full time hours. The EIP Team provides a flexible service covering hours between 08:00 to 18:00 Monday to Friday and includes working weekends and Bank Holidays.&lt;/p&gt;\n&lt;p&gt;We cannot wait to welcome you as part of our wonderful team!&lt;/p&gt;\n&lt;p&gt;If you are interested in this vacancy however you have any questions or would like to discuss further then we would be happy to hear from you, please feel free to get in touch with the EIP Team Leader Paul Jones on 02380 878040 or email at p.jones9@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Follow us on Facebook and on Twitter:&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;@Southern_NHSFT&lt;/p&gt;\n&lt;p&gt;　&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO15 5PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9221", "longitude": "-1.43187"}}, "title": "EIP Senior Specialist Practitioner (OT or Social Worker)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236013", "validThrough": "2020-11-06T23:59:59+0000"}