{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "37241", "unitText": "YEAR", "value": "£37,241 - £51,069 per annum"}}, "datePosted": "2020-10-30T15:15:54+0000", "description": "&lt;p&gt;Applications are invited for the above full time post to commence as soon as possible for an initial 1 year contract in Neonatal Medicine.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated career paediatrician/neonatologist to join our innovative and exciting, tertiary level 3 neonatal unit for the Beds and Herts Perinatal Network.&lt;/p&gt;\n&lt;p&gt;Our maternity unit is one of the busiest in the East of England with over 5300 deliveries per year, resulting in over 900 admissions per year. The unit comprises 37 cots in total. Of which 11 are intensive care, and 8 are high dependency. A comprehensive range of neonatal services are provided at the L&amp;D; i.e. inhaled nitric oxide, high frequency oscillation and hypothermia therapy for neonatal encephalopathy; with close links to Great Ormond Street Hospital and Addenbrookes Hospital for surgical and cardiac care. Subspecialty neonatal interests include cardiology, nutrition, respiratory and neurology, with specialist chronic lung disease, neurodevelopment and cardiology clinics.&lt;/p&gt;\n&lt;p&gt;Pathology within the local population is particularly extensive and complex and provides excellent opportunities for fetal medicine, genetics, and inborn errors of metabolism experience, owing to the ethnic diversity and high degree of consanguinity within the local population.&lt;/p&gt;\n&lt;p&gt;The department prides itself on its passion and enthusiasm for teaching, thus providing a comprehensive educational programme, includes weekly consultant teaching, simulation, fetal medicine, radiology, physiotherapy, dietetics, and journal club. Alongside the paediatric department we run an excellent membership teaching programme and have obtained exceptional results for our trainees. We actively encourage participation in management and clinical governance activities, to further enhance your professional development.&lt;/p&gt;\n&lt;p&gt;The appointee will be offered a full time post on a 9 person ST4+ rota, which is EWTD compliant. You will be working in a supportive and friendly environment, with a separate Consultant and ST1-3 rota.&lt;/p&gt;\n&lt;p&gt;The Hospital serves a local population of approximately 310,000 and has excellent access to Central London by road or rail and to the Midlands and the North via the M1/A1. The town also has an international and domestic airport. The surrounding areas are both urban and rural, the latter including many attractive villages within easy reach of the Hospital. Excellent schools are found nearby.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be subject to full Occupational Health Clearance and an Enhanced Disclosure and Barring Service check prior to commencement.&lt;/p&gt;\n&lt;p&gt;It is an exciting time to be joining the newly formed Bedfordshire Hospitals NHS Foundation Trust which has resulted from the merger of The Luton and Dunstable University Hospital and Bedford Hospital NHS Trusts. The merger took place on 1 April 2020 and under the umbrella of the single NHS Trust both hospitals will retain their identity and individual hospital names. This will bring many benefits for patients and opportunities for staff. Both hospitals will retain their identity with individual hospital names and key services will remain on both sites and be managed as single teams across the whole Bedfordshire catchment area. Travel between hospital sites may be required.&lt;/p&gt;\n&lt;p&gt;The L&amp;D is an Equal Opportunities Employer and operates a No Smoking Policy.&lt;/p&gt;\n&lt;p&gt;To apply online please visit NHS Jobs, job reference: 418-M-PD-333&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: &lt;/strong&gt;&lt;strong&gt;13th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;COMMITTED TO EQUALITY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Jogesh KapadiaJob titleTraining Programme DirectorEmail addressmedicalstaffing@ldh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Luton and Dunstable Hospital, Luton", "postalCode": "LU4 0DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8942", "longitude": "-.474244"}}, "title": "Senior Clinical Fellow (ST4+ Equivalent) in Neonatal Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250700", "validThrough": "2020-11-13T23:59:59+0000"}