{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-28T08:20:19+0000", "description": "&lt;p&gt;&lt;span&gt;Now is a great time to work in the NHS and with such a focus on the importance of mental health, Mental Health Nurses (RMN) are really standing out. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Here in Yeovil, Rowan Ward are looking for nurses to contribute to providing excellent services. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are a very caring and close knit team with a focus on supporting each other through the challenges of working on an acute ward so we can continue to make a difference to our patient&#39;s recovery.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Rowan Ward consists of 16 beds both looking after working age adults . We provide an environment that is modern, bright, clean and safe for our residents to recover in, as well as a great facility for our staff to work in.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We will empower you to work innovatively, showing a commitment to providing compassionate care and a strong desire to improve the patient’s experience. You will be able to apply the philosophies of engagement, recovery and positive care in your work with your patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We have been accredited with AIMS from the Royal College of Psychiatrists creates an environment where you will be able to learn from your colleagues, whilst supporting each other to provide the most high-quality patient care.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are fortunate enough to be able to consider applications from preceptees and will pay your first year’s registration fee for NMC, and we can offer an excellent relocation package for those looking to move to the area.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;As well as the usual NHS Benefits such as 5.4 weeks annual leave PLUS bank holidays, enhanced pay for unsociable hours to complement your income, and flexible working practices to promote a good work-life balance, you will also benefit from excellent support from your manager and colleagues and you’ll have opportunities to access specialist training in line with your professional development.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We would love to hear from you so please get in touch if you would like an informal discussion about the role.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Hazel Armstrong or Jenny Walton&lt;/p&gt;\n&lt;p&gt;01935 410784&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Yeovil", "postalCode": "BA20 2BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9467", "longitude": "-2.64803"}}, "title": "Staff Nurse RMN, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245731", "validThrough": "2020-11-18T23:59:59+0000"}