{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-10-20T10:17:16+0100", "description": "&lt;p&gt;Secondment Opportnity&lt;/p&gt;\n&lt;p&gt;A fantastic opportunity has arisen at the Royal Berkshire NHS Foundation Trust for a Band 7 Sister in our forward thinking 19 bedded Intensive Care Unit (ICU).&lt;br /&gt;&lt;br /&gt;We are looking for a caring, friendly and highly motivated individual who thrives in challenging and dynamic environments. You must be a Registered Nurse with a minimum of 2 years’ post ICU course experience in ICU at band 6 level. You will possess a nationally recognised Intensive Care qualification and be able to demonstrate consistently supportive leadership and staff development skills. Candidates suitable for this role will be required to demonstrate a passion for delivering person centered care with kindness and respect. Respect for staff and prioritizing staff development is something that we continuously strive to achieve. As a Sister/Charge Nurse your strong mentorship and staff development skills will contribute greatly to our goal of supporting and developing our team. You will work in partnership with the senior nursing team and will be supported by the Lead Nurse and ICU Matron to provide managerial leadership on both clinical and professional levels to a designated mentor group and the wider team. &lt;br /&gt;&lt;br /&gt;You will play an integral part in the leadership of acute nursing care within the ICU, whilst supporting the multi professional team by sharing your knowledge and skills whilst ensuring safe practice at all times. You will need excellent communication skills when liaising with a wide variety of people, both over the phone and face to face, and display our core values in everything you do. &lt;br /&gt;&lt;br /&gt;Compassionate in our thoughts, words and actions&lt;br /&gt;&lt;br /&gt;Aspirational and a true desire to be dynamic and to innovate &lt;br /&gt;&lt;br /&gt;Resourceful and responsible in the way we work and live &lt;br /&gt;&lt;br /&gt;Excellence through development, fairness and sharing best practice&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;We are also highly committed to your development. As a unit we offer the opportunity to care for a wide range of level two and level three critically ill patients presenting with a range of complex surgeries, and medical conditions. All new nurses are supported by a practice educator and supportive leadership structure. The learning and development team also offer a wide range of management and leadership courses which may help compliment your established skills in areas such as recruitment and selection, absence management and team coaching. The hospitals new Investment in Excellence Programme also focuses on developing your leadership to create positive working environments and to meet the challenges of modern healthcare settings. As part of a new development programme, the trust and Henley Business School are now offering a very exciting opportunity to study for a BA (Hons) in Applied Management. This is an unique opportunity offered through Henley Business School, a leading business school in the UK. &lt;br /&gt;&lt;br /&gt;We encourage our nurses to learn from and become involved in our well established ‘Rehabilitation after Critical Illness Programme’. We also offer secondments to our ‘ICU Bereavement Support Service’ and Education Team. We also have a well-established Intensive Care Research Programme. An informal visit is highly recommended.&lt;/p&gt;\n&lt;p&gt;For any informal visits/information please contact Matron Angela Foster on 01183228918 or ICU Lead Richard Bendon on 01183227251&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ward - ICU, Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Sister / Charge Nurse - ICU (Secondment)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233789", "validThrough": "2020-11-08T23:59:59+0000"}