{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "6976", "minValue": "6976", "unitText": "YEAR", "value": "Apprentice rate £4.15 per hour"}}, "datePosted": "2020-10-27T13:15:59+0000", "description": "&lt;p&gt;Please note this advert may close early if sufficient applications are received&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an individual who wishes to develop their career within a finance function. We are offering an Apprenticeship within the Financial Services Department within the central finance team based at Blackpool Teaching Hospitals NHS FT. The successful candidate will work within the Trust’s Accounts Payable section working under the supervision of the Treasury Services Accountant.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to the current Government eligibility criteria for Government funded apprenticeship schemes, we are currently only able to accept applications from candidates who have been resident in the UK for the last 3 years, and who are not already in any form of Government funded education. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role will assist in the smooth running of the Financial Services Team. The post will be assisting the Accounts Payable Team in processing invoices in a timely accurate manner. In addition the post will provide assistance in the Trusts Accounts Office with banking processes and attending to the reception window when required.&lt;/p&gt;\n&lt;p&gt;The ideal candidate must have a desire to work within a Finance department, strong numeracy skills, show initiative, have the ability to work to tight schedules, an efficient telephone manner and appropriate keyboard skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If successful after interview, an initial assessment (BKSB) must be completed within 2 weeks of receiving the conditional offer to ascertain you are eligible to undertake an apprentice programme. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate will undertake AAT Finance Apprenticeship qualification starting at Level 2 and progressing to levels 3 and 4.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Financial Services Apprentice position will be for a 36 month fixed term period.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRuth DavenportTelephone number01253 957916Additional contact information&lt;/p&gt;\n&lt;p&gt;Should you wish to discuss the role prior to submitting an application please contact Ruth Davenport - Treasury Services Accountant on 01253 957916&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Financial Services Apprentice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244679", "validThrough": "2020-11-10T23:59:59+0000"}