{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-02T14:14:44+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Improving access to Psychological Therapies&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt; ( IAPT)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Trainee Cognitive Behavioural Psychotherapists (IAPT High Intensity Trainees)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;***Previous applicants need not apply***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Midlands Partnership Foundation Trust (MPFT) works in partnership with North Staffordshire Combined Healthcare (NSCHC) to deliver IAPT services across the whole of Staffordshire, also including Shropshire and Telford &amp; Wrekin. To meet the IAPT targets set out in the NHS Five Year Forward View, we are advertising for new trainee posts within the South Staffordshire services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidates need to submit an application for the Post Graduate Diploma Course in CBT at Staffordshire University at the same time as applying to this advert. The offer of a post will be conditional on passing the university selection process, which will take place alongside the service interviews/selection. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be supported to apply for the 12 month Post-Graduate Diploma in Cognitive Behavioural Therapy at Staffordshire University (starting January 2021), and will spend 3 days per week working in one of these IAPT teams, with 2 days at University. The service will also provide in-house training and supervision, which is focused on ensuring access to a range of suitable training cases designed to meet the requirements of the course. These training posts are currently being offered on a 12 month fixed term contract, but subject to the local CCG funding agreement and successful completion of the course, posts will be made permanent at the end of the training period wherever possible. This is an excellent opportunity for those committed to training and working as Cognitive Behavioural Therapists. We are seeking individuals who can demonstrate some existing knowledge and experience of delivering CBT interventions, as well as experience of treating anxiety disorders and depression, but who would like to specialise further in this area. Our teams are committed to continuing clinical training/development, supervision and support for all therapists. The service has been a pathfinder for several developments in IAPT service delivery, and has a proven track record for quality and research. Our friendly teams are committed to promoting the wellbeing of our workers, as well as our clients. As a centre for research as well as clinical practice, we work in partnership with Staffordshire and Keele Universities. All therapists contribute to on-going clinical research projects, and are actively encouraged to pursue their own research interests.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;***Previous applicants need not apply***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Staffs/Shropshire and Telford and Wrekin", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "High Intensity CBT Trainees", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252359", "validThrough": "2020-11-19T23:59:59+0000"}