{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum inc. (pro rata)"}}, "datePosted": "2020-11-04T08:16:26+0000", "description": "&lt;p&gt;We are pleased to announce a rare and amazing opportunity for an experienced Pharmacy Technician to join the team that will be both challenging and exciting. The post for Lead Medicines Optimisation for Clinical Trials and Audit requires a technician who is forward thinking and highly motivated to deliver a high quality, safe and effective pharmacy service. This opportunity will allow the candidate to develop on a personal and professional level through exposure to all departmental activities. The Pharmacy Department has a strong focus on medicines optimisation and innovative pharmaceutical practice.&lt;/p&gt;\n&lt;p&gt;All applicants must have evidence to verify knowledge, skills and training undertaken in their role as a pharmacy technician. The post holder will possess excellent communication skills, good interpersonal and IT skills, and ability to work independently as well as in a team in a dynamic Pharmacy department.&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have experience of working in a hospital pharmacy post qualification&lt;/li&gt;\n&lt;li&gt;Collaborate with the multidisciplinary team to deliver patient focused car to patients and ensure a timely supply of medicines, utilisation of patients’ own medicines and medicines adherence.&lt;/li&gt;\n&lt;li&gt;Participate in ward based dispensing, medicines optimisation and ward top-ups&lt;/li&gt;\n&lt;li&gt;Provide dispensary-based patient services to inpatients and outpatients including clinical trials.&lt;/li&gt;\n&lt;li&gt;Complete or work towards working as an Accredited Pharmacy Checking Technician.&lt;/li&gt;\n&lt;li&gt;Have experience of carrying out pharmacy related Audits&lt;/li&gt;\n&lt;li&gt;Undertake a course in Education and Training to facilitate learning.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Have good IT knowledge and training experience on Pharmacy systems&lt;/li&gt;\n&lt;li&gt;Through provision of an effective Pharmacy service, this post will;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Challenge your problem solving and commincation skills.&lt;/li&gt;\n&lt;li&gt;Strengthen your organisational skills by co-ordination and prioritisation of work.&lt;/li&gt;\n&lt;li&gt;Develop and expand your management and leadership skills.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder must hold Level 3 BTEC and NVQ in Pharmacy Services Certificate or equivalent and must be registered with the General Pharmaceutical Council.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vishakha Patani on 02089095410&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120878.png", "name": "Royal National Orthopaedic Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120878"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stanmore, Middlesex", "postalCode": "HA7 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6315", "longitude": "-.306607"}}, "title": "Lead Medicines Optimisation Pharmacy Technician, Research and Audit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255058", "validThrough": "2020-11-17T23:59:59+0000"}