{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-10-28T13:20:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Bank Dietitian with Head and Neck/Oncology Experience required&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you keen to be part of a specialist dietetic team? We are looking for a dynamic, enthusiastic and confident individual and currently welcoming applications for an experienced Dietitian to join our team on bank.&lt;/p&gt;\n&lt;p&gt;Applicants must have prior experience in oncology and ideally in Head and Neck Oncology.&lt;/p&gt;\n&lt;p&gt;Pay will be at Band 5 or 6 rate dependant on experience.&lt;/p&gt;\n&lt;p&gt;You should have leadership skills, the ability to work well within teams and be able to manage your time effectively. The successful applicant will be based at University College London (UCH), part of UCLH NHS Foundation Trust. The post holder will provide cover to head and neck patients within their care pathway in the inpatient or outpatient setting. The dietetic team are responsible for managing patients throughout their pathway from referral, during treatment and rehabilitation and long term care. Also, we have an established service with extended scope practice for leading the enteral feeding tube service. The dietetic team are based with the Head &amp; Neck team and well integrated within all aspects of the service creating opportunities for development at different stages of the pathway across the multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;Effective communication and negotiation skills and an ability to work effectively within teams are essential. Thinking differently with a focus on quality, efficiency and productivity are central to the culture of the head and neck dietetic team. We are a forward thinking department of 36 Dietitians and dietetic assistants, and committed to professional development. You will be involved in student training initiatives.&lt;/p&gt;\n&lt;p&gt;Hours required: Approximately 37.5 hours/ 5 days per week although this is negotiable&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospital", "postalCode": "NW1 2BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5249", "longitude": "-.136987"}}, "title": "Bank Specialist Dietician Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246754", "validThrough": "2020-11-27T23:59:59+0000"}