{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bursary"}}, "datePosted": "2020-11-04T15:01:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a nurse whose UK NMC registration has lapsed?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking to return to practice and re-join the NMC professional register?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Have you missed clinical practice and the rewards of caring for patients?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If the answer is yes, then we are offering an exciting opportunity for both Adult and Paediatric registered nurses to re-join the register by supporting your clinical placement in the&lt;/p&gt;\n&lt;p&gt;Return to Practice Programme for Registered Nurses&lt;/p&gt;\n&lt;p&gt;The theoretical and academic element of this programme is delivered by the University of the West of England and consists of taught days with clinical placement here with us at the University Hospitals Bristol and Weston NHS Foundation Trust. During your clinical placement you will be fully supported and be assigned a sign off mentor.&lt;/p&gt;\n&lt;p&gt;Upon successful completion of the course you are guaranteed a Band 5 interview and as one of the largest acute trusts in the country there are numerous opportunities for you to re-kindle your nursing career.&lt;/p&gt;\n&lt;p&gt;You will receive a stipend funded through Health Education South West, which is paid near the start of the programme. Further information can be found on the Health Education England South West website.&lt;/p&gt;\n&lt;p&gt;To register your interest in the Return to Practice Programme, please complete the online application.&lt;/p&gt;\n&lt;p&gt;Candidates who are eligible will be invited to a virtual interview during week commencing 23rd or 30th November.&lt;/p&gt;\n&lt;p&gt;The UWE course will start on 11th January 2021.&lt;/p&gt;\n&lt;p&gt;Induction at University Hospitals Bristol and Weston for your clinical placement will be on 4th January 2021.&lt;/p&gt;\n&lt;p&gt;Our Adult hospital placement opportunities may include: Bristol Royal Infirmary (BRI); Bristol Haematology &amp; Oncology Centre (BHOC); Bristol Heart Institute (BHI); Bristol Eye Hospital (BEH); Weston General Hospital (WGH); South Bristol Community Hospital (SBCH).&lt;/p&gt;\n&lt;p&gt;All Children’s nursing placements will be at Bristol Royal Hospital for Children (BRHC).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please state in your application whether you are interested in Paediatric Nursing or Adult Nursing.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ann Sherwood, Talent Acquisition Specialist - ann.sherwood@uhbristol.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Return to Practice Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256348", "validThrough": "2020-11-15T23:59:59+0000"}