{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 pa inc"}}, "datePosted": "2020-11-04T16:30:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse Paediatric Haematology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are for looking for a Band 5 nurse to cover maternity leave for a year. The successful applicants will join a multidisciplinary team of skilled and highly motivated staff who provide specialist Haematology and Stem Cell Transplant services along with infectious diseases. Grand Union ward is a 14 bedded Unit with 4 Transplant cubicles, 2 negative pressure isolation cubicles and 8 normal cubicles.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; The Children’s haematology service at Imperial is one of the largest in the country and encompasses the largest bone marrow transplant unit for non-malignant haematological disorders in the UK, one of the largest paediatric units overall, conducting close to 40 allografts a year, and pioneering worldwide the use of alternative donors and reduced intensity. We specialise in aplastic anaemia, inherited bone marrow failure syndromes, sickle cell disease, thalassemia and other red cell disorders. &lt;br /&gt; &lt;br /&gt; The service constitutes the specialist centre for the Imperial College Red Cell Network offering comprehensive care for children with haemoglobinopahies and red cell disorders for Northwest London, the Thames Valley and the Luton area, to which we provide outreach clinics. The service has a specialist clinic for patients with Diamond Blackfan anaemia constituting the largest cohort of patients in the world, receiving national and international referrals. There is a POSCU level 2 unit, which aims to be a lever 3 unit at the completion of the forthcoming London reconfiguration. There is significant national expertise in general paediatric haematology, thrombosis and transfusion medicine.&lt;br /&gt; &lt;br /&gt; Grand Union ward is a tertiary referral unit for children with infectious diseases, this service treats patients with Kawaski’s disease, TB, HIV, Meningitis, Congenital CMV and many more weird and wonderful diseases. The infectious diseases team consists of consultants and professors that are internationally renowned for their expertise with in the field of ID, this team is based with in Grand Union Ward. &lt;br /&gt; &lt;br /&gt; We are looking for nurses who are committed to the delivery of compassionate high quality care. We strive to use the views of staff working in our service to improve our current and future service provision. The learning and development opportunities are endless. The ward team nurses are supported by a team of Clinical Nurse Specialists. We promise that we will guide your development with a comprehensive programme. Your development will be tailored to meet your needs and the needs of the service. We are enthusiastic about education. You will have the opportunity to develop or enhance your skills of caring for children with high acuity and dependency needs.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 5 Staff Nurse Paediatric Haematology - WCCS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256665", "validThrough": "2020-11-18T23:59:59+0000"}