{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683  PER ANNUM"}}, "datePosted": "2020-10-19T18:45:27+0100", "description": "&lt;p&gt;Consultant Cardiologist (Intervention)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited for a &lt;strong&gt;Substantive Consultant in Cardiology (2 posts, ideally 1 x Imaging, 1 x Coronary Intervention)&lt;/strong&gt;. This is an exciting opportunity to join a growing department within Northwick Park Hospital, Central Middlesex and Ealing Hospitals. Consultants are expected to work at all sites of the Trust delivering outpatient care and to liaise with colleagues and GPs.&lt;/p&gt;\n&lt;p&gt;The jobs have been created to provide a 1 in 9 consultant on-call service (Consultant of the Week at Northwick Park Hospital) with the increasingly busy Acute Medical Assessment Unit to provide the best possible care to our cardiac patients. The department is working eventually towards providing 24/7 acute cardiac services and these new roles will be integral to this provision.&lt;/p&gt;\n&lt;p&gt;Depending on the candidate’s suitability, the imaging consultant role will be expected to work closely with the Lead for the Department and Chief Cardiac Physiologists and their team to oversee the management and overall governance of our busy world renowned echo department. They will be encouraged to develop non-echo Cardiac Imaging services across all sites. Service developments for physiologist led stress echo service and specialist physiologist led valve clinics will be an important part of the post. The interventional consultant role will be expected to work at least 3 cath lab sessions a week and contribute with the other interventional consultants towards providing 24/7 Acute Cardiac Care service. The candidate must have completed sub-speciality training in interventional cardiology. Good experience of PCI is essential.&lt;/p&gt;\n&lt;p&gt;London North West University Healthcare NHS Trust is one of the largest integrated care Trusts in the country bringing together hospital and community services across the boroughs of Brent, Harrow and Ealing. Our 9,000 staff, including 1,300 doctors and 4,000 nurses serves a diverse population of approximately 850,000. The Trust was established in October 2014 following the merger of The North West London Hospitals NHS Trust and Ealing Hospital NHS Trust and has an annual budget of over £640 million.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews: 18/12/20&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr. Jaymin ShahJob titleClinical LeadEmail addressjaymin.shah@nhs.netTelephone number07957608408Additional contact information&lt;/p&gt;\n&lt;p&gt;Rachel Tunstall - General Manager on rachel.tunstall@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross Site, London", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Consultant in Cardiology (Intervention)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233383", "validThrough": "2020-11-19T23:59:59+0000"}