{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53168", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 per annum (pro rata)"}}, "datePosted": "2020-10-30T19:45:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Mid and South Essex NHS Foundation Trust are setting up a COVID vaccination and screening programme and urgently require an &lt;/strong&gt;&lt;strong&gt;exceptional people &lt;/strong&gt;&lt;strong&gt;to head up the service. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently gearing up to launch our new COVID vaccination and screening service in December this year, and are looking for three exceptional people to join the team to help get it set up and operational. These services will oversee inpatient testing for over 1,200 beds, weekly surveillance screening for over 17,000 staff and the delivery of over 34,000 doses of COVID vaccine.&lt;/p&gt;\n&lt;p&gt;The post holder will support the General Manager, Control Centre / Integrated Care in the planning, setup and operational delivery of the following new services that are being setup:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The COVID vaccination programme within the Trust and for partner organisations.&lt;/li&gt;\n&lt;li&gt;The inpatient COVID testing marshal service within the Trust.&lt;/li&gt;\n&lt;li&gt;The delivery of a COVID survillence screening programme within the Trust and for partner organisations.&lt;/li&gt;\n&lt;li&gt;The post holder will set-up and provide operational management of these services, engaging with local, regional and national stakeholders as required and will be required to adapt service delivery rapidly in the event of changing national guidance and Trust requirements.&lt;/li&gt;\n&lt;li&gt;The post holder will develop a multi-professional culture within area of responsibility in which all staff are delivering high quality, patient centered care based upon the principles outlined in legislation and initiatives and government guidance.&lt;/li&gt;\n&lt;li&gt;Lead on service / pathway reviews as required supporting the ‘out of hospital’ agenda&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Candidates will need to be able to start immediately or be willing to accept a secondment with an immediate start if they are internal to the Trust.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTom AbellJob titleDeputy Chief ExecutiveEmail addresstom.abell@btuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mid and South Essex NHS Foundation Trust, MSE", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Head of COVID Vaccination and screening service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251112", "validThrough": "2020-11-09T23:59:59+0000"}