{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "30000", "unitText": "YEAR", "value": "Up to £30,000 dependent on experience"}}, "datePosted": "2020-10-30T09:47:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a Nurse with recent experience in a surgical setting? Do you have the passion to make a difference to patients? Whether you’re coming from an NHS or private hospital we’ll give you time to use your nursing skills – and help you build a fulfilling career. We are looking for a Registered Nurse to join our inpatient team on a part time basis, working 25 hours per week.&lt;/p&gt;\n&lt;p&gt;As part of our professional, friendly and compassionate team you will do everything you can to ensure the patient’s treatment is of the highest standard.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be part of a close knit collaborative team who pride themselves in providing the highest standard of care to our patients and their families. Our inpatients team is made up of experienced nurses and healthcare assistants supported by our experienced Ward Manager, Pauline. As well as undertaking basic ward duties you will maintain accurate records and support junior staff in the assessment of patients. All of our work is planned so you will be able to plan your week with ease knowing your work schedule won’t change.&lt;/p&gt;\n&lt;p&gt;As an NMC Registered Nurse with relevant post registration experience gained in a surgical setting it would be advantageous if you have experience in orthopaedics and if you have performed ECG’s, venepuncture and IV drug administration. Your sound clinical and Infection control knowledge combined with your ability to solve problems and think both literally and laterally will enable you to coach and support others in your team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. If you want to move up the ladder, we’ll support you. If you just want to stay in your role, that’s fine too. We’ll help you be the best you can be.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contact Sonia Sanghvi in our friendly resourcing team.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidate but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chesterfield", "postalCode": "S43 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2815", "longitude": "-1.2822"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249549", "validThrough": "2020-11-27T23:59:59+0000"}