{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42327", "minValue": "39217", "unitText": "YEAR", "value": "£23.33 - £25.18 (p/h including WTR)"}}, "datePosted": "2020-10-19T17:12:12+0100", "description": "&lt;p&gt;&lt;strong&gt;Imperial College Healthcare NHS Trust Staff Bank&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Please note this is a Bank/Temporary advert to join the Temporary Staffing Bank&lt;/strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Imperial College Healthcare NHS Trust was launched on 1st October, 2007. Made up of five hospitals; Charing Cross, Hammersmith, Queen Charlotte&#39;s and Chelsea, St Mary&#39;s and the Western Eye, and integrating with Imperial College London, we are one of the largest acute trusts in the UK with an annual turnover exceeding £900 million and employing almost 10,000 staff. Offering more than 50 clinical specialities, and with one of the largest portfolios of services in the country we have one million patient contacts a year.&lt;/p&gt;\n&lt;p&gt;The Staff Bank Department is a dedicated team aiming to provide a quality service to Imperial College Healthcare NHS Trust. The Staff Bank strives to support our Hospitals with competent, reliable and registered health care professionals who will be able to provide the highest level of service to our patients.&lt;/p&gt;\n&lt;p&gt;We are absolutely committed to ensuring that our patients have the best possible experience within our hospitals. We seek people who are committed to delivering outstanding patient care, whatever their role, and who take pride in what they do. We place a high value on treating all patients, visitors and colleagues with respect and dignity, and seek people who strive for excellence in all that they do.&lt;/p&gt;\n&lt;p&gt;Join our staff bank and be a valued member of the team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bank Speech &amp; Language Therapists - Adult Acute (Band 6 and 7) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have experience of working in adult acute and critical care settings? Are you looking for an opportunity to continue developing your clinical skills in a supported environment? If so, we’d love you to come and join our growing team of speech and language therapists (SLT) who are working on staff bank.&lt;/p&gt;\n&lt;p&gt;The adult acute SLT service operates across St Mary’s, Charing Cross and Hammersmith hospitals with friendly teams of highly skilled clinicians based on each site. We have expertise, knowledge and skill in the assessment and treatment of communication and swallowing disorders arising from a number of complex aetiologies. We hold weekly videofluoroscopy clinics and provide an SLT-led FEES service across all sites. We are focused on driving forward evidence based practice and quality improvement within our specialty areas, and staff are actively encouraged and supported to participate in CPD activities.&lt;/p&gt;\n&lt;p&gt;We are looking for motivated and experienced Band 6 and 7 Speech &amp; Language Therapists (depending on experience) to join us as part of our staff bank to help us deliver the increasing demand for our services. You will work as a fully integrated member of the SLT and multidisciplinary teams providing assessment and management to patients across a wide range of medical and surgical specialisms, such as acute admissions units, respiratory, care of the elderly, stroke, neurosciences, cancer, renal, cardiothoracics, vascular, major trauma and critical care. Some cross-site working may be required according to service need.&lt;/p&gt;\n&lt;p&gt;For band 7 roles, you will have completed competencies in tracheostomy and videofluoroscopy, and have experience of managing patients with complex communication and swallowing disorders in level 2 and 3 critical care settings. Experience of FEES and managing ventilator dependent patients is desirable.&lt;/p&gt;\n&lt;p&gt;The roles would involve working flexibly across the 3 hospital sites where the adult SLT service is provided (CX, SMH, HH)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rates of pay&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6: £23.33&lt;/strong&gt; (including WTR)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7: &lt;/strong&gt;&lt;strong&gt;£25.18&lt;/strong&gt; (including WTR)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working Bank shifts is easy:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We value all of our staff and aim to provide rewarding careers and benefits, fulfilling work environments and exciting opportunities&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits for you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Great Opportunity to progress within the Imperial College Healthcare NHS Trust&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Weekly Payments&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Competitive Pay Rates&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Platform to gain experience in different areas&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Friendly team environment&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Efficient Recruitment Process&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Complimentary Mandatory Training&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Contact&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contact a friendly member of our recruitment team on &lt;strong&gt;0203 311 1552&lt;/strong&gt; or&lt;span style=&quot;text-decoration: underline;&quot;&gt; imperial.staffbank.ahp@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Bank - Band 6/7 Speech and Language therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233313", "validThrough": "2021-01-28T23:59:59+0000"}