{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50000", "minValue": "50000", "unitText": "YEAR", "value": "Up to £50,000pa DOE"}}, "datePosted": "2020-11-05T11:52:29+0000", "description": "&lt;p&gt;We are currently recruiting for a Clinical or Counselling Psychologist to join our team at Cygnet Hospital Ealing.&lt;br /&gt;&lt;br /&gt;Cygnet Hospital Ealing provides a welcoming, non-institutional environment, offering personalised treatment for our service users over two wards.  New Dawn Ward is a 9 bed specialist Tier 4 service, providing treatment, care and support for women with a personality disorder who are ready to engage in therapy. Sunrise Ward is a 14 bedded ward providing a highly specialised eating disorder service for women, including those with extremely low BMIs. Sunrise focuses on supporting service users to attain a healthy BMI and prepare for a return home.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;The Opportunity…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will have a key role in providing specialist psychological assessments, interpretation from psychological tests, semi-structured interviews, and individual and group DBT therapy for services users on New Dawn ward.  In addition to leading the DBT service, you will also consider potential risks and social needs of the client group, relevant to their diagnosis and providing least restrictive practice.&lt;/p&gt;\n&lt;p&gt;This role will be working as part of an established multidisciplinary team comprising of; a Consultant Psychiatrist, a Specialty Doctor, an Occupational Therapist, Nurses and Health Care Support Workers. You will be expected to offer psychological insight and knowledge around the clinical area and provide consultation about the psychological care of the client group to staff, families and other agencies.&lt;/p&gt;\n&lt;p&gt;As a senior member of the psychology team, you will have a pivotal role in training and clinical supervision of assistant psychologists, volunteers and trainee psychologists.  You will provide specialist DBT awareness and training to other professionals in the hospital and regularly attend multidisciplinary and psychology departmental meetings as an integral part of your role.  You will also have involvement in audit, policy and service development alongside your clinical responsibilities.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;You will have…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Doctorate Level Qualification (BPS route or equivalent) in Clinical or Counselling Psychology along with HCPC Registration&lt;/li&gt;\n&lt;li&gt;Preferably have inpatient experience within adult mental health&lt;/li&gt;\n&lt;li&gt;DBT Trained&lt;/li&gt;\n&lt;li&gt;Knowledge and experience of various psychological assessment, treatment and therapies&lt;/li&gt;\n&lt;li&gt;The ability to work effectively as part of an multidisciplinary team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Why Cygnet? We&#39;ll offer you...&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary: Up to £50,000pa (Depending on Experience)&lt;/li&gt;\n&lt;li&gt;Pension scheme&lt;/li&gt;\n&lt;li&gt;NHS and employee discount scheme&lt;/li&gt;\n&lt;li&gt;Free meals&lt;/li&gt;\n&lt;li&gt;Internal / external CPD and research opportunities&lt;/li&gt;\n&lt;li&gt;Expert clinical supervision and peer support&lt;/li&gt;\n&lt;li&gt;A comprehensive employee assistance programme&lt;/li&gt;\n&lt;li&gt;Opportunities to train in additional therapies, broaden experience and enhance service development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;br /&gt;Contracted hours: up to 40 per week, Monday to Friday.&lt;/p&gt;\n&lt;p&gt;Please note: successful candidates will be required to undergo an enhanced DBS check.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cygnet Health Care have been providing a national network of high quality specialist services for over 30 years.&lt;/p&gt;\n&lt;p&gt;If you care about making a difference – we want to talk to you!&lt;/p&gt;\n&lt;p&gt;Click the link to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ealing", "postalCode": "W5 2HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5212", "longitude": "-.297112"}}, "title": "Clinical/Counselling Psychologist (DBT)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257524", "validThrough": "2020-11-19T23:59:59+0000"}