{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-28T09:15:46+0000", "description": "&lt;p&gt;We are currently looking to recruit an enthusiastic and motivated First Responder (Mental Health Practitioner) to join our First Response Service.&lt;/p&gt;\n&lt;p&gt;Winner of the National Positive Practice in Mental Health Crisis &amp; Acute Services Award, the First Response Service provides 24 hour access to mental health services for people who identify, or have been identified as being in a mental health crisis. It is an all age service.&lt;/p&gt;\n&lt;p&gt;Support is provided initially over the phone by Psychological Wellbeing Telecoaches, who are trained in the process of mental health triage and who will attempt to de-escalate the individual’s crisis over the phone and formulate a safety plan for that individual.&lt;/p&gt;\n&lt;p&gt;Dependent on the risk and need identified, a face to face assessment can be arranged and carried out by a Mental Health First Responders. The team is overseen each shift by a Clinical Lead. The outcome of the telephone triage or face to face assessment is that the patient will be supported, given advice, referred to appropriate services.&lt;/p&gt;\n&lt;p&gt;Working hours: 08:00-20:00, 13:00-01:00, 20:00-08:00.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a strong team work ethic, sense of accountability, accompanied by an ability to work under considerable pressure at times. This post is open to professionals with the right attributes to enhance a team.&lt;/p&gt;\n&lt;p&gt;In return we will provide the necessary support to ensure your development within your role. We are keen to support and develop our staff through a clear career pathway and encourage promotional opportunities within the Trust.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference for our community by supporting people with mental health or learning disability needs then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) provides integrated community and mental health, learning disability and social care services of the highest standard due to our continued commitment to quality and service improvement. We aim to support people of all ages to achieve the very best they can for their health and well being. To ensure that we achieve this goal we look to recruit candidates of a high calibre that share our passion for delivering excellent service user care, research and education.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Benefits of working for CPFT include:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;• Annual leave allowance 27 days plus bank holidays (this may increase depending on     NHS service)&lt;/p&gt;\n&lt;p&gt;• Pension scheme&lt;/p&gt;\n&lt;p&gt;• Flexible job share opportunities&lt;/p&gt;\n&lt;p&gt;• Salary sacrifice schemes&lt;/p&gt;\n&lt;p&gt;• Staff discount schemes&lt;/p&gt;\n&lt;p&gt;• Professional development via the CPFT Academy which provides in-house training programmes&lt;/p&gt;\n&lt;p&gt;• Stress awareness training&lt;/p&gt;\n&lt;p&gt;• Mindfulness training&lt;/p&gt;\n&lt;p&gt;• Counselling service&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Carolyne Coenen on 07973 723987 or email carolyne.coenen@cpft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redshank House, Huntingdon", "postalCode": "PE29 6SN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3361", "longitude": "-.197129"}}, "title": "First Responder (Mental Health Practitioner)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245796", "validThrough": "2020-11-10T23:59:59+0000"}