{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum (pro rota)"}}, "datePosted": "2020-11-02T15:31:43+0000", "description": "&lt;p&gt;Lancashire &amp; South Cumbria NHS Foundation Trust (LSCFT) is a large health and wellbeing Trust employing over 7000 staff and serving a population of 1.5 million across Lancashire. The Trust provides inpatient and community specialist Mental Health services to children and young people, adults and older adults and also delivers forensic mental health services. Additionally, the Trust provides a range of physical health care community services including; diabetes, stroke, rheumatology, community physiotherapy, public health, learning disability services, and district nursing.&lt;/p&gt;\n&lt;p&gt;The Trust delivers high quality Clinical Research Trials to a wide range of patient groups, working in partnership with the North West Coast Clinical Research Network and Lancashire Teaching Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We continue to develop and expand our capacity and capability in undertaking Clinical Research within its NIHR Clinical Research Facility. As a Senior Research Nurse/Senior CSO for the Clinical Research Facility you will enjoy working in a busy environment and support research activity across the Trust. The successful applicant will be expected to work closely with the Research Nurse Manager, in order to support the research staff to deliver an active research portfolio at the Trust, ensuring that all studies across the organisation, within the NIHR portfolio, are undertaken to the highest standards within timelines and meeting recruitment targets.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karen Palmer, Mobile: 07958 228843, Tel: 01772 773498&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Lantern Centre, Preston", "postalCode": "PR2 8DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7793", "longitude": "-2.70459"}}, "title": "Senior Research Nurse/Senior Clinical Studies Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252615", "validThrough": "2020-11-16T23:59:59+0000"}