{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum Pro Rata"}}, "datePosted": "2020-10-30T13:16:13+0000", "description": "&lt;p&gt;Do you want to work for a Trust which&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;values inclusivity?&lt;/li&gt;\n&lt;li&gt;invests in you with ongoing in-service training, development and supervision from expertly trained clinical specialists?&lt;/li&gt;\n&lt;li&gt;is at the start of a transformational journey where collaboration between sector partners is core business?&lt;/li&gt;\n&lt;li&gt;values and invests in YOU?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If this sounds like you why not come and see what UHMBT, the country’s 7th most inclusive employer, has to offer. We are a multi-disciplinary team who would welcome you to join us.&lt;/p&gt;\n&lt;p&gt;We are looking for a Physiotherapist to join our Community Physiotherapy Team based at Barrow in Furness. You will support the delivery of high quality care to community dwelling residents and the rehabilitation of patients in the Millom community hospital step up step down unit. Therefore you must have the ability to work and travel to various sites across the Trust independent of public transport.&lt;/p&gt;\n&lt;p&gt;The service works closely with the the ward MDT, Integrated Care Communities, GP&#39;s, Adult Social Care, ACP’s and hospital discharge teams for example. The service supports people with a wide variety of conditions including elderly care, frailty and falls, orthopaedics, long term condition management and post covid rehabilitation.&lt;/p&gt;\n&lt;p&gt;Working together to deliver care to patients you will need to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;have completed a range of core rotations within the NHS as a physiotherapist with a desire to develop your clinical skills further&lt;/li&gt;\n&lt;li&gt;demonstrate and evidence your own professional development&lt;/li&gt;\n&lt;li&gt;demonstrate your ability to work independently when necessary&lt;/li&gt;\n&lt;li&gt;have a friendly and flexible attitude, which is patient focused and dedicated to quality care&lt;/li&gt;\n&lt;li&gt;use your expertise to supervise and teach physiotherapy students and other staff within the service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;What will we offer you?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A supportive team environment which values the input of the team&lt;/li&gt;\n&lt;li&gt;A structured two-way appraisal process to support your ongoing development&lt;/li&gt;\n&lt;li&gt;In-house recognition schemes&lt;/li&gt;\n&lt;li&gt;A focus on employee involvement where your contribution is valued&lt;/li&gt;\n&lt;li&gt;Encouragement for your professional development&lt;/li&gt;\n&lt;li&gt;A relocation package for prospective applicants living more than 60 miles away&lt;/li&gt;\n&lt;li&gt;Opportunity to be part of our transformational programme of combining acute and community services&lt;/li&gt;\n&lt;li&gt;Excellent location of our sites near the Lake District to support a healthy worklife balance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;would consider full or part time applications&lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSara FisherJob titleTeam Lead South Cumbria Community PhysiotherapyAdditional contact information&lt;/p&gt;\n&lt;p&gt;for further information please contact&lt;/p&gt;\n&lt;p&gt;Sara Fisher, Team Lead&lt;/p&gt;\n&lt;p&gt;Sara.Fisher@mbht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Mob: 07870376470&lt;/p&gt;\n&lt;p&gt;Or Catherine Salt, Clinical Lead, Furness&lt;/p&gt;\n&lt;p&gt;Catherine Salt@mbht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01229402666&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Cumbria Community Physiotherapy, Barrow", "postalCode": "LA13 9AH"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1232", "longitude": "-3.21567"}}, "title": "Community Physiotherapist band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250331", "validThrough": "2020-11-15T23:59:59+0000"}