{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro-rata"}}, "datePosted": "2020-11-04T16:16:02+0000", "description": "&lt;p&gt;Applications are invited for a Locum Consultant in Clinical Oncology (with a specialist interest in Neuro-Oncology and Skull base tumours and Pelvic malignancies) to commence as soon as possible for 12 months.&lt;/p&gt;\n&lt;p&gt;This is an 8 PA post in Neuro-Oncology and the Skull Base Unit based at Cambridge University Hospitals NHS Foundation Trust (CUH) visiting Hinchingbrooke Hospital, part of North West Anglia NHS Foundation Trust (NWAFT).&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to maintain the highest clinical standards in Neuro-Oncology and skull base tumours and pelvis tumours including state-of-the art radiotherapy and precision medicine services.&lt;/p&gt;\n&lt;p&gt;We are fortunate to be embedded in the Cambridge Biomedical Campus, where world-leading scientific advances are being made, as detailed in the Job Description.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join ambitious and supportive teams at The Oncology Centre at CUH and Hinchingbrooke Hospital – these teams have a strong track record and are driven by clinical and research excellence. We offer patients the highest standards of care in diagnostics, surgery, radiotherapy and systemic therapies, with holistic support throughout their illness.&lt;/p&gt;\n&lt;p&gt;You will be fully registered with the GMC and ideally have a CCT in Clinical Oncology or be within six months of award of CCT at the time of interview. Applications are welcomed from those unable to work full-time for personal reasons or those wishing to job-share.&lt;/p&gt;\n&lt;p&gt;The applicant must have demonstrable skills in listening, reading, writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013).&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Informal enquiries about this post should be addressed to Dr Sarah Jefferies, Clinical Director for the Cancer Directorate at sarah.jefferies@addenbrookes.nhs.uk or cherylpalmer@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital / Hinchinbrooke Hospital, Cambridge / Huntingdon", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Locum Consultant in Clinical Oncology (Neuro-Oncology and Skull base", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256580", "validThrough": "2020-11-17T23:59:59+0000"}