{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 to £39,681 pa with allowance"}}, "datePosted": "2020-10-20T15:48:38+0100", "description": "&lt;p&gt;&lt;span&gt;We are expanding our Occupational Therapy Stroke team to include a static Band 6 Occupational Therapy position, offering an opportunity to further develop your knowledge and skills in the area of the treatment of stroke in the acute hospital setting, and your management and leadership as a Band 6 Occupational Therapist.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post is for a qualified Occupational Therapist and requires you to have g&lt;/span&gt;&lt;span&gt;ood communication skills, a professional attitude and experience at Band 5 or Band 6 level as essential, along with the enthusiasm to work in a busy acute setting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;The Department&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Trust we are developing a Hyper acute and acute stroke unit.&lt;/p&gt;\n&lt;p&gt;We offer a friendly and supportive working environment, with peer support, clinical supervision and regular in-service training.&lt;/p&gt;\n&lt;p&gt;There is access to informal and formal training and CPD opportunities, where learning and sharing is strongly encouraged.&lt;/p&gt;\n&lt;p&gt;We have a dedicated, innovative band 7 Practice Development Occupational Therapist to support staff in their clinical development.&lt;/p&gt;\n&lt;p&gt;We have actively participated in ongoing service development, and participation in Trust-wide projects and audits, and cross-discipline working is highly valued.&lt;/p&gt;\n&lt;p&gt;Our recent Trust-wide staff survey demonstrated higher than the national average scores with excellent staff engagement across the Therapies Directorate and excellent scores overall.&lt;/p&gt;\n&lt;p&gt;We offer practice placements for Pre-Reg Occupational Therapy students from Canterbury Christchurch University and are excited to have 3 staff on the newOccupational Therapy apprentice 4 year degree course&lt;/p&gt;\n&lt;p&gt;Leadership is provided by the Professional Lead Occupational Therapist and an experienced award-winning team of Senior Occupational Therapy Team Leads.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Candidates&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Essential experience required:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Post-graduate clinical experience working as a Band 5/Band 6 Occupational Therapist.&lt;/li&gt;\n&lt;li&gt;Evidence of participation in In-service training and personal CPD.&lt;/li&gt;\n&lt;li&gt;HCPC registration and RCOT/BAOT membership.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;Closing date for applications:16th November&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Proposed Interview date: T27th November&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information contact &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Mrs Jo Poulton Tel:01322 428579 or email &lt;/span&gt;&lt;span&gt;jopoulton@nhs.net&lt;/span&gt;&lt;span&gt; .&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Our staff are our most valuable asset.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We support and develop our staff through the facilitation of key learning events to enhance their continuing professional development and ensure they are up to date in their clinical knowledge.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust has a strong commitment to equality and diversity. We aim to employ a representative workforce that reflects the communities we serve. &#39;Positive action&#39; initiatives can be used whenever an under-represented group is identified. As our workforce is currently under-represented in bands 6, 7 and 8, we encourage applications from people with black or minority ethnic backgrounds.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working days and or shift patterns will be agreed by the line manager to meet the needs of the service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dartford and Gravesham NHS Trust is a smoke free organisation. To improve public health, smoking is not permitted anywhere on the hospital site. For advice and support on stop smoking please call 0300 123 1220.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121400.png", "name": "Dartford and Gravesham NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dartford", "postalCode": "DA2 8DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4351", "longitude": ".25819"}}, "title": "Stroke Occupational Therapist Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235131", "validThrough": "2020-11-16T23:59:59+0000"}