{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25820", "minValue": "25820", "unitText": "YEAR", "value": "£15.36"}}, "datePosted": "2020-10-23T10:16:22+0100", "description": "&lt;h1&gt;Bank Yourself A Bank Role...&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Have you thought about working within prison healthcare?&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; If you are looking for a challenging and rewarding Bank Pharmacy Technician role and want to develop your Pharmacy skills in an environment where no two days are the same then this could be the new job for you!&lt;/p&gt;\n&lt;h1&gt;About us...&lt;/h1&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work. If you are a qualified nurse, or soon to qualify, and want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;br /&gt; &lt;br /&gt; As a healthcare provider, we recognise the fact that prisoners are a socially excluded group with complex healthcare needs that can often be associated with poor outcomes. We believe in putting the patient first, regardless of the environment or their history. We are the market leader, providing care to over 30,000 patients in over 40 prisons across the country.&lt;br /&gt; &lt;br /&gt; Our core values are; everyone makes a difference, patients are at the heart of everything we do and together we make things better. If you share these values and have transferable skills we want to meet you!&lt;/p&gt;\n&lt;h1&gt;Information about the role...&lt;/h1&gt;\n&lt;p&gt;As a Bank Pharmacy Technician at HMP Isle OF Wight, you will assist in the delivery of a high quality pharmacy service to the prison population.&lt;br /&gt; &lt;br /&gt; You can expect to provide medicines management services to assist in tackling identified, inequalities within the prison population contributing to diagnosis of care and treatment needs. This includes providing pharmacy related information to patients, prison officers and other healthcare professionals ensuring that the level of advice given is appropriate to overcome barriers to understanding, conveying complex and sensitive information in an easily understandable form.&lt;br /&gt; &lt;br /&gt; The Pharmacy Technician will also assist with the implementation and development of pharmacy support to all wings in the prison which includes, where appropriate, counselling of patients on the correct use of medication.&lt;br /&gt; &lt;br /&gt; It goes without saying that you will be responsible for dispensing medicines to agreed standards, calculating doses and quantities for supply where there is a specific requirement for accuracy e.g. Methadone preparation.&lt;/p&gt;\n&lt;h1&gt;A little about you…&lt;/h1&gt;\n&lt;p&gt;You will hold NVQ Level 3, BTEC or equivalent qualifications and must have a current registration with the General Pharmaceutical Council (GPhC) alongside being an Accredited Checking Technician (ACT) to be considered for this role. You will also have relevant post-qualification experience working within a multi-disciplinary team.&lt;/p&gt;\n&lt;h1&gt;Salary &amp; Benefits...&lt;/h1&gt;\n&lt;p&gt;This is a bank role working shifts as and when required to cover holiday and sickness. The rate of pay is £15.36 per hour.&lt;br /&gt; &lt;br /&gt; At HMP Isle Of Wight A 7-day service is in operation, therefore you will be required to work across those days including weekends.&lt;br /&gt; &lt;br /&gt; Practice Plus Group benefits include training &amp; development opportunities, company contributory pension scheme, 25 days annual leave plus 8 public bank holidays, staff well-being, cycle to work scheme, on-site gym facilities and free onsite parking.&lt;br /&gt; &lt;br /&gt; We are also proud to support our employees with continued professional development opportunities and further education subject to service needs.&lt;/p&gt;\n&lt;h1&gt;More information...&lt;/h1&gt;\n&lt;p&gt;The work is interesting and varied and is an opportunity to make a difference to peoples’ lives, enabling them to improve and maintain their health and wellbeing.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to references, an enhanced DBS check and prison vetting.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;br /&gt; &lt;/em&gt;&lt;strong&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5NX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7144", "longitude": "-1.30639"}}, "title": "Bank Pharmacy Technician - HMP Isle Of Wight", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240004", "validThrough": "2020-11-06T23:59:59+0000"}