{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-05T15:01:25+0000", "description": "&lt;p&gt;We are in the process of searching for an exceptional Team Leader who has a background in leading a team of people dedicated to dealing with complex administration. This post will be working within the Urology Department, as part of Hub 11 in the Clinical Administration Service. You will join the management team of Hub 11 and work very closely with its Hub Manager and other Team Leaders.&lt;/p&gt;\n&lt;p&gt;Whilst it is desirable to have experience of working in a healthcare setting, we are first and foremost looking for individuals who can successfully unite teams and can drive improvements through the effective coaching and development of our staff.&lt;/p&gt;\n&lt;p&gt;The successful individuals will be passionate about delivering the right outcome for the patients, clinicians and healthcare team and will have a track record of with working with a wide range of stakeholders. Excellent IT skills are essential to this role.&lt;/p&gt;\n&lt;p&gt;With a background in leading a similar sized team (up to 30 staff) the successful individuals will have the following deliverables:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Identify and manage the teams performance including work allocation&lt;/li&gt;\n&lt;li&gt;Lead, inspire and motivate the team to go over and above to keep the patient at the heart of everything they do.&lt;/li&gt;\n&lt;li&gt;Manage change positively and promote continuous improvement by recommending changes that will improve results whilst retaining team spirit.&lt;/li&gt;\n&lt;li&gt;Engagement with key stakeholders to ensure service delivery and escalate where any key performance indicators or service level agreements may be going off-track&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alex Jewitt, Hub Manager (Hub 11) alex.jewitt@hey.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Castle Hill Hospital, Cottingham", "postalCode": "HU16 5JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7768", "longitude": "-.44499"}}, "title": "Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258227", "validThrough": "2020-11-19T23:59:59+0000"}