{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-23T14:00:57+0100", "description": "&lt;p&gt;2 x 37.5 hrs per (full time) posts available&lt;/p&gt;\n&lt;p&gt;1 x 37.5 hrs per (full time) posts available-Maternity Cover for up to 12 Months&lt;/p&gt;\n&lt;p&gt;NHS England and Improvement – East of England Region are looking to recruit 3 full time enthusiastic and organised Commissioning Support Administrators across a number of our teams within the Primary Care and Public Health Directorate.&lt;/p&gt;\n&lt;p&gt;Applicants must have excellent written &amp; verbal communication skills, ability to develop &amp; maintain good working relationships both internally &amp; externally with partners along with the ability to work with clinical, managerial and support staff at all levels and manage a challenging and changing workload priorities.&lt;/p&gt;\n&lt;p&gt;The successful post holder will also provide and support managers with a wide range of administrative and IT skills along with manage meeting arrangements, including the taking and distribution of minutes, taking appropriate follow-up action as required.&lt;/p&gt;\n&lt;p&gt;Our successful candidate will be a highly organised, experienced and flexible administrator, capable of using their own skills and expertise to provide co-ordination and support to enable successful delivery of national and regional priorities and initiatives. You will be self-motivated with excellent attention to detail, a natural ability to plan ahead, be keen to apply and grow your excellent organisational skills and be able to communicate effectively with individuals at all levels. In return for this commitment we will support you in your own development&lt;/p&gt;\n&lt;p&gt;As you would expect, all our interviews will take place using video calls on MS Teams.&lt;/p&gt;\n&lt;p&gt;The job will be based either in Chelmsford, Fulbourn or Welwyn Garden City. The job will require travel between the three NHS England and NHS Improvement East of England bases. Please note that all posts are currently home based and resources will be made available to the successful candidates to carry out their role virtually, with a view to return to an office setting.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vikki Anton, Primary Care Support Officer; victoria.anton@nhs.net or 01135397296&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swift House, Victoria House or Charter House, Chelmsford", "postalCode": "CM2 5PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.75", "longitude": ".509112"}}, "title": "Commissioning Support Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240835", "validThrough": "2020-11-08T23:59:59+0000"}