{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-26T10:16:30+0000", "description": "&lt;p&gt;NHS England &amp; NHS Improvement - South East commissions a range of primary health care services for the residents of Hampshire, Kent, Surrey, Sussex, Berkshire, Oxfordshire, Buckinghamshire. The regional primary care commissioning team is responsible for the safe, effective and efficient commissioning of general medical services (where not delegated to a CCG), dental services, community pharmacy and ophthalmic services for the population of the South East Region of approximately 9 million patients.&lt;/p&gt;\n&lt;p&gt;As a Dental Contract Officer, the post holder will work as part of a dynamic team in the delivery and effective commissioning and contract performance management of dentistry, by supporting managers and staff across the south east commissioning team. The post holder will have excellent Excel skills and be experienced in the use of Word. Good communication skills are essential. You will have the ability to delegate tasks to ensure timely and accurate delivery of the service and the ability to support others in their professional development. Attention to detail, the ability to prioritise your own workload effectively and to work unsupervised is also essential. You must have a good understanding of confidentiality and data protection.&lt;/p&gt;\n&lt;p&gt;For more details of this post, please refer to the Job Description within this advert.&lt;br /&gt;&lt;br /&gt;This post is a full-time position within a friendly team and may be based at York House in Horley or Oakley Road in Southampton or Jubilee House in Oxford dependent upon where the successful candidate lives. Flexible working is encouraged and working from a base combined from working from home is supported. Occasional travel to each office base and external venues is required.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;NHS England and NHS Improvement values and respects the diversity of its employees and contractors and aims to engage a workforce which reflects our diverse communities. We welcome applications irrespective of people&#39;s age, disability, gender, race or ethnicity, religion or belief, sexual orientation, or other personal circumstances.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We have policies and procedures in place to ensure that all applicants are treated fairly and consistently at every stage of the recruitment process, including an invitation to the first stage of the selection process and consideration of reasonable adjustments for people who have a disability; where you believe this may apply please specify in your application.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Please note that we reserve the right to close this vacancy early should we have an overwhelming response.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;If you are shortlisted to attend an interview, you will be sent an email via this website. The email will be sent to the address that you have registered with this site. Therefore, please ensure you regularly check your email account to find out about an interview details.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name - Cathy Thurgood&lt;/p&gt;\n&lt;p&gt;Job title - Dental Commissioning Manager&lt;/p&gt;\n&lt;p&gt;Email address - cathythurgood@nhs.net&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oakley Road, Southampton or York House, Horley or Jubilee House, Oxford", "postalCode": "SO16 4GX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9233", "longitude": "-1.44876"}}, "title": "Dental Contract Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241975", "validThrough": "2020-11-06T23:59:59+0000"}