{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-05T11:01:22+0000", "description": "&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) provides integrated community and mental health, learning disability and social care services of the highest standard due to our continued commitment to quality and service improvement. We aim to support people of all ages to achieve the very best they can for their health and well being. To ensure that we achieve this goal we look to recruit candidates of a high calibre that share our passion for delivering excellent service user care, research, and education.&lt;/p&gt;\n&lt;p&gt;***This post is open to one Full-Time candidate and one Part-Time candidate at 30 hours per week.***&lt;/p&gt;\n&lt;p&gt;We are currently looking to recruit an enthusiastic and motivated Adult ADHD Specialist Practitioner – Non-Medical Prescriber to join our Adult ADHD clinic, based in Cambridge. The role includes assessment, diagnosis, and treatment of adults with ADHD.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a strong team work ethic, sense of accountability, accompanied by an ability to work under considerable pressure at times. This post is open to professionals with the right attributes to enhance a team.&lt;/p&gt;\n&lt;p&gt;We will provide the necessary support to ensure your development within your role. We are keen to support and develop our staff through a clear career pathway and encourage promotional opportunities within the Trust.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference for our community by supporting people with mental health or learning disability needs then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Benefits of working for CPFT include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual leave allowance 27 days plus bank holidays (this may increase depending on NHS service)&lt;/li&gt;\n&lt;li&gt;Pension scheme&lt;/li&gt;\n&lt;li&gt;Flexible job share opportunities&lt;/li&gt;\n&lt;li&gt;Salary sacrifice schemes&lt;/li&gt;\n&lt;li&gt;Staff discount schemes&lt;/li&gt;\n&lt;li&gt;Professional development via the CPFT Academy which provides in-house training programmes&lt;/li&gt;\n&lt;li&gt;Stress awareness training&lt;/li&gt;\n&lt;li&gt;Mindfulness training&lt;/li&gt;\n&lt;li&gt;Counselling service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are unable to attend an interview on the suggested date, please let us know on your application form as other options may be available.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment. As part of the selection process you may be required to undergo a Disclosure and Barring check.&lt;/p&gt;\n&lt;p&gt;The Trust is an equal opportunities employer and we positively encourage applications from people who have experienced mental health issues.&lt;/p&gt;\n&lt;p&gt;The Trust believes in treating everyone with dignity and respect and encourages applications from all sectors of the community. We guarantee an interview to candidates with disabilities who meet the minimum essential criteria.&lt;/p&gt;\n&lt;p&gt;Please note that due to the variety of contacts you may provide it cannot be guaranteed that the recruitment process will be managed exclusively within the NHS email system. Please ensure that all the details you provide on your application form are correct.&lt;/p&gt;\n&lt;p&gt;**Internal CPFT Trust applicants who are currently ‘at risk’ and who meet the essential criteria will be given prior consideration over any other candidates who may apply for this post. Further consideration will then be given to other internal applicants currently ‘affected by change’ and then to other NHS applicants who are currently ‘at risk’ within the wider NHS. If you are ‘at risk’ or ‘affected by change’ please make it clear on your application so that you receive priority consideration**&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Michael Kasese - Team Manager&lt;/p&gt;\n&lt;p&gt;michael.kasese@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01223 219674&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Adult ADHD Assessment Clinic, Chitra Sethia Autism Centre, Fulbourn, Cambridge", "postalCode": "CB21 5EF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1852", "longitude": ".188204"}}, "title": "Adult ADHD Specialist Practitioner – Non-Medical Prescriber", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257349", "validThrough": "2020-11-19T23:59:59+0000"}