{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "70035", "minValue": "70035", "unitText": "YEAR", "value": "£70035.00"}}, "datePosted": "2020-10-29T09:51:38+0000", "description": "&lt;p&gt;At Stockton Hall Hospital, just outside York.  We provide a medium-secure care setting in which patients access a broad range of therapeutic interventions including one-to-one and group-based psychological treatments.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The facility is split across seven wards, providing care for up to 112 male and female patients with a broad range of needs including autism spectrum disorder, learning disability, mental illness, personality disorder, and those with a settled-in presentation that necessitates a long-term rehabilitative approach. This diverse patient population makes Stockton Hall a fulfilling and stimulating environment in which to work, and provides the opportunity to develop a broad range of clinical competencies as well as areas of clinical specialism.&lt;/p&gt;\n&lt;p&gt;We are currently seeking an exceptional and highly motivated Consultant Forensic and/or Clinical Psychologist to lead our dynamic, well-established Psychology Department and to oversee and develop the provision of psychological services at Stockton Hall. As well as managing the Department, holding a clinical caseload and providing direct supervision and consultation to colleagues, the role also involves working alongside the senior clinical and leadership teams to ensure that a first-class clinical service is delivered across the hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Psychology Department boasts a number of both Forensic and Clinical psychologists ranging in grade from consultant to an assistant psychologist, which evidences the prominent role that psychology is afforded within the hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Clinically, the Head of Psychology will be responsible for, and will directly engage in, the assessment and treatment of the patient population, including the use of structured risk assessment measures and one-to-one and group-based interventions relating to a range of needs including trauma, sexual and violent offending, fire-setting, problem solving, substance misuse and anger management. The post-holder will ensure that approaches used within individual therapy draw upon a range of modalities including CBT, DBT, Radically Open DBT, Compassion-Focused Therapy, and Acceptance and Commitment Therapy. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will hold full registration as a Practitioner Psychologist with the Health and Care Professions Council (HCPC). They will demonstrate high levels of leadership and clinical expertise, and will have substantial post-qualification experience of working with complex patients within secure settings.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact Liz Littlewood - Hospital Director  on 01904 400500&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO32 9UN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9954", "longitude": "-1.00281"}}, "title": "Head of Psychology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247786", "validThrough": "2020-11-19T23:59:59+0000"}