{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615  pa pro rata"}}, "datePosted": "2020-10-30T15:31:18+0000", "description": "&lt;p&gt;&lt;br /&gt;Blackpool Teaching Hospitals are looking for highly motivated and committed Band 5 Staff Nurses to work on ward 2 which have strong links to the AECU unit. This ward is a general medical ward and as such offers a fantastic learning opportunity. The ward consists of 18 beds. We are a ward that prides ourselves on their commitment to providing a high quality of care from its existing motivated and passionate team. We welcome applicants with an interest within this specialty. &lt;br /&gt;&lt;br /&gt;We require enthusiastic individuals with a can do attitude that have the ability to work within our friendly ward team. They must be as passionate as we are in getting things right first time every time. &lt;br /&gt;Commitment to undertake ongoing in-service training and development is essential. You should be motivated, keen to learn and ready to embrace change. Our commitment to you is to provide the environment for this to happen and ensure that you are part of our defined preceptorship programme. &lt;br /&gt;&lt;br /&gt;If you are motivated to deliver high standards of care and have the personal qualities and characteristics as outlined in the Blackpool person then this could be the post for you.&lt;br /&gt;&lt;br /&gt;An enhanced DBS check will be required for this post.&lt;br /&gt;&lt;br /&gt;Please note that if you are successful in your application you agree that the Occupational Health Department can access your occupational health records from your current or previous employer (in order to check the status of your inoculations and screening tests). This is an automated process and the information will only be used for these purposes prior to your taking up the position with us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These positions are available to Student Nurses, we would also welcome applicants who are interested in a Secondment Opportunity.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexible Working Patterns may also be available upon discussion, such as Night Shifts or Part-time hours, please discuss at Interview stage&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen SherlockJob titleRecruitment ManagerAdditional contact information&lt;/p&gt;\n&lt;p&gt;Ward Manager Vanessa Wilcock-Clare&lt;br /&gt;Tel: 01253 951337&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Staff Nurse Ward 2 (General Medicine)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250746", "validThrough": "2020-11-15T23:59:59+0000"}