{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "42712", "unitText": "YEAR", "value": "£42,712 - £49,325 per annum, pro rata"}}, "datePosted": "2020-11-05T15:41:21+0000", "description": "&lt;h2&gt;&lt;strong&gt;Clinical Researcher - (Equivalent to Band 7) &lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term Contract – 12 months to cover extended leave.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Part Time: 22.5 hours per week &lt;/strong&gt;(3 days per week).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary £43,712 - £49,325 per annum, pro rata&lt;/strong&gt; (dependent upon experience).&lt;/p&gt;\n&lt;p&gt;A rare and exciting opportunity has arisen for a clinical academic to join our research team to cover long term leave. The post holder will undertake and disseminate research into practices of rehabilitation and neurodisability.&lt;/p&gt;\n&lt;p&gt;Knowing what it takes to deliver clinical research, you will possess a sound knowledge of research practices and an excellent understanding of  acquired brain injury (ABI), education and 24-hour management for children and young people with profound and multiple learning difficulties (PMLD).  With experience of working in a complex environment, across a large and diverse workforce, you will be exceptionally organised with a high-level of attention to detail.  You will naturally possess excellent inter-personal skills, and an ability to consult and positively engage with key stakeholders across the organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to discuss the role please contact the People Operations Team, email: &lt;/strong&gt;&lt;strong&gt;recruitment@thechildrenstrust.org.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date&lt;/strong&gt;:  &lt;strong&gt;Sunday, 22 November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date(s)&lt;/strong&gt;: To be confirmed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Strictly no agencies please.&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Children’s Trust is the UK’s leading charity for children with acquired brain injury, providing expert rehabilitation, education, therapy and care at our national specialist centre in Tadworth, and to children and their families across the UK, via our Brain Injury Community Service. &lt;/p&gt;\n&lt;p&gt;Boasting a beautiful 24-acre site in Surrey, we are located just outside of London, close to the M25 (accessible via Junction 8, A217 to Tadworth) and easily accessible via National Rail, by way of: Clapham Junction, Sutton and Epsom.&lt;/p&gt;\n&lt;p&gt;The work we do is highly rewarding, and in addition to an attractive salary, we offer a valuable range of benefits, including: free on-site parking; subsidised cafeteria; on-site staff accommodation (subject to availability); the ability to retain your NHS pension (where applicable) or the opportunity to join an alternative scheme; and the opportunity to develop and implement your expertise in an environment that is as unusual in its beautiful historic nature, as it is unique in its state-of-the-art facilities.&lt;/p&gt;\n&lt;p&gt;The Children’s Trust is fully committed to protecting children and young people.  All posts at The Children&#39;s Trust are subject to an enhanced DBS check.  If you are applying to The Children&#39;s Trust, and are already registered with the DBS update service, this will speed up the recruitment process significantly.  We are an equal opportunities employer, and welcome applications from all suitably qualified candidates, regardless of their race, sex, disabilities, religion/beliefs, sexual orientation, or age.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Children's Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128594"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tadworth", "postalCode": "KT20 5RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.295", "longitude": "-.226042"}}, "title": "Clinical Researcher (Equivalent to Band 7)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258391", "validThrough": "2020-11-22T23:59:59+0000"}