{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "105042", "minValue": "77913", "unitText": "YEAR", "value": "£77,913-£105,042 pa, pro rata"}}, "datePosted": "2020-10-27T11:02:57+0000", "description": "&lt;p&gt;An exciting opportunity for an Inpatient Consultant Psychiatrist has arisen within Derbyshire Healthcare NHS Foundation Trust’s Pleasley Ward, a 20-bedded mixed gender inpatient ward at the Hartington Unit located in Chesterfield Royal Hospital in Calow, Chesterfield.&lt;/p&gt;\n&lt;p&gt;The post would suit a Consultant with a passion for physical healthcare in the psychiatric population and who has a CCT in Older Adult Psychiatry or dual CCT in General Adult and Older Adult Psychiatry.&lt;/p&gt;\n&lt;p&gt;You will have clinical responsibility for the ward and will be working with an experienced multi-disciplinary in-patient team.&lt;/p&gt;\n&lt;p&gt;You will be part of a team of a total of 3 Inpatient consultants at the Hartington Unit.&lt;/p&gt;\n&lt;p&gt;The two other experienced substantive consultants with responsibility for the other 2 in-patient, general adult wards on the Hartington Unit have been in post for several years and robust cross cover arrangements are in place.&lt;/p&gt;\n&lt;p&gt;You will be working in a team of dedicated, like-minded and supportive consultants who provide excellent peer support.&lt;/p&gt;\n&lt;p&gt;Chesterfield is a beautiful, ancient market town with good links to all major cities in the Midlands and beyond and enjoys an idyllic setting in close proximity to the Peak District National Park.&lt;/p&gt;\n&lt;p&gt;Up to £8,000 relocation expenses is available to eligible candidates.&lt;/p&gt;\n&lt;p&gt;We are able to offer you excellent training and career progression opportunities, including study leave support of up to £1,000 per annum towards your continuous professional development.&lt;/p&gt;\n&lt;p&gt;We are also committed to equal opportunities, improving the working lives of all our staff and will consider applications to work flexibly. We encourage you to feel free to talk to us about what is important to you including your personal and professional needs.&lt;/p&gt;\n&lt;p&gt;To find out more about our Trust and Derbyshire as a great place to live and workand live please visit our recruitment site which you will find under further links.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;We would welcome you to contact the Trust to find out more about this post, our services and discuss what is important to you.&lt;/p&gt;\n&lt;p&gt;Please contact:&lt;/p&gt;\n&lt;p&gt;Dr Radha Khurana, Consultant Psychiatrist and Clinical Director, Campus (North) via r.khurana@nhs.net or 01246 512578&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Dr John Sykes, Consultant Psychiatrist and Medical Director or Dr Mark Broadhurst, Deputy Medical Director, 01246 515971&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hartington Unit, Chesterfield Royal Hospital, Chesterfield", "postalCode": "S44 5BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2362", "longitude": "-1.40008"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244158", "validThrough": "2020-11-09T23:59:59+0000"}