{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32, 478 - £51, 069"}}, "datePosted": "2020-11-06T13:51:55+0000", "description": "&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Fellow In Trauma and Perioperative Older People’s Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a great opportunity for a motivated, enthusiastic individual to join this progressive, and dynamic service. The post holder will gain ample experience in geriatrics, perioperative medicine, elderly major trauma and fragility fractures.&lt;/p&gt;\n&lt;p&gt;The post would be suitable for experienced core medical trainees who have completed Foundation and Core Medical competencies (or equivalent), and wish to gain a period of focused experience and training in geriatric medicine whilst pursuing ST3 training. The post is suitable for candidates who are attempting the second parts of the MRCP.&lt;/p&gt;\n&lt;p&gt;The Older People Services wards (52 beds) are based in the new Royal London Hospital and work closely with the emergency department and acute admissions unit. There are on call duties 1 in 5 weekends.&lt;/p&gt;\n&lt;p&gt;The Trauma and Perioperative Older People’s Service (TPOPS) is part of the OPS Department. The service provides an embedded liaison service to older patients who are undergoing surgery or sustain trauma. The service includes joint care with the orthopaedic surgeons for hip fracture patients which commences at the start of the admission, and continues throughout the stay, including optimising them for surgery. The Royal London Hospital is a Major Trauma Centre and older patients increasingly make up a significant proportion of those trauma admissions. Acknowledging this, a Best Practice Tariff for Major Elderly Trauma was created in April 2019 , mandating a geriatrician review of all older patients within 72 hours. Providing proactive input to this group of patients, as well as patients from other surgical specialities, forms a major component of the T-POPS service.&lt;/p&gt;\n&lt;p&gt;It would be expected that the individual actively participates in quality improvement to help support development of the service , as well as help support any educational or research initiatives that are going on at the time&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Sophie Edwards&lt;/p&gt;\n&lt;p&gt;sophie.edwards10@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal London Hospital, London", "postalCode": "E1 1BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.519", "longitude": "-.058048"}}, "title": "Clinical Fellow In Trauma and Perioperative Older People’s Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259990", "validThrough": "2020-11-22T23:59:59+0000"}