{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13688", "minValue": "13688", "unitText": "YEAR", "value": "£13,688.72 per annum"}}, "datePosted": "2020-10-29T15:31:19+0000", "description": "&lt;p&gt;WUTH is committed to building on our strengths to become the first choice healthcare provider for our communities. We are focused on exceptional customer service through the delivery of integrated, seamless, continuous pathways of care, enabled by innovation and leading edge technology. Underpinning this commitment are our values and fundamental belief that our patients must be at the heart of everything we do.&lt;/p&gt;\n&lt;p&gt;We are now seeking to appoint a Non-Executive Director, from February 2021, who has experience of leading strategic or transformational change and;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;who is medically qualified with wider experience of working at a senior level in large organisations, preferably in the NHS Provider sector;&lt;/li&gt;\n&lt;li&gt;who has direct experience of leading a large professional workforce through strategic or transformational change;&lt;/li&gt;\n&lt;li&gt;who has the ability to contribute to the development of the work of a Board operating in a very challenging and regulated environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In accordance with the Trust’s constitution, applicants must be resident within the Trust’s constituencies which cover the North West England and North Wales.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal and confidential discussion about the role, please contact our Director of Corporate Affairs, Jill Hall, to book a discussion on email jill.hall16@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arrowe Park Hospital, Arrowe Park Hospital", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Non-Executive Director", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248888", "validThrough": "2020-11-27T23:59:59+0000"}