{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata, per annum"}}, "datePosted": "2020-10-28T10:46:49+0000", "description": "&lt;p&gt;We are delighted to offer an exciting career opportunity in the Manchester Eating Disorders Service. This is a part-time (0.9 wte) permanent post, for an 8a psychological therapist. We would also welcome applications from those who wish to consider this role as part of a job share. It is an exciting period of change in the service, after being successful in receiving new funding to expand the team, which will help us to transform the way we work with and support people who experience eating difficulties in Manchester. The role has been created as part of this expansion.&lt;/p&gt;\n&lt;p&gt;We are a community based service, which offers various psychological therapies to people who present with a variety of eating disorder presentations, severities and associated difficulties. This includes individual and group therapies, such as cognitive-behavioural therapy, MANTRA, compassionate-focused therapy, and cognitive analytic therapy. We will also be offering new pathways as part of the service structure going forward, including a FREED pathway, and a new pathway for individuals who experience more enduring eating difficulties. The service has strong links with the universities, and collaboratively offers a student pathway with the university counselling services. We also regularly offer training placements to psychology trainees. As well as psychological support, dietetics and medical monitoring will form integral parts of the new service structure.&lt;/p&gt;\n&lt;p&gt;We are seeking a psychological therapist who has experience of working with people who have an eating disorder, and who is passionate and enthusiastic about working with this client group. The role would suit someone who is confident in working autonomously, as well as contributing and supporting the wider MDT.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Ian GillJob titleClinical LeadEmail addressian.gill@gmmh.nhs.ukTelephone number0161 271 0621&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gaskell House, Manchester", "postalCode": "M13 0EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.463", "longitude": "-2.22202"}}, "title": "Psychological Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246166", "validThrough": "2020-11-11T23:59:59+0000"}