{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,214 to £30,112 pa"}}, "datePosted": "2020-10-27T10:31:13+0000", "description": "&lt;p&gt;Post: Band Nurse (Community)&lt;/p&gt;\n&lt;p&gt;Base: Ellen Badger Hospital, Shipston on Stour&lt;/p&gt;\n&lt;p&gt;Hours: Full-time &amp; Part-time considered&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Come and join a Trust rated Outstanding by the CQC. South Warwickshire NHS Foundation have been rated as outstanding following our latest inspection by the CQC and we are recruiting new staff to come and help us improve even further.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to a recent team restructuring we are now looking for dynamic, self-motivated Band 5 Nurses to work within the Place Based Team (Community nursing) based at Ellen Badger Community Hospital in the market town of Shipston on Stour. You will be working primarily within the community team however there are opportunities to rotate between community nursing and the 16 bedded ward within the hospital for further skill development and opportunities.&lt;/p&gt;\n&lt;p&gt;We service our community for patients that may not be able to attend a clinical or hospital facility together with working closely with the ward, day hospital and outpatient clinics. As a community nursing team we are very fortunate to be able to work in a rural area of outstanding beauty which covers the main towns/villages of Shipston, Wellesbourne, Bidford on Avon &amp; Lower Quinton.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;SWFT are proud of the services our community teams provide. We are developing ground breaking new services designed to help patients better manage their own conditions, stay out of hospital and use the latest systems and technology to provide the most efficient and effective health care possible. We have grown considerably in our community teams over the past few years and we need excellent people to continue our journey of innovation and development.&lt;/p&gt;\n&lt;p&gt;This position is suitable for both experienced nurses and those who are about to qualify. There is a comprehensive preceptorship programme as well as a core induction process with ongoing development opportunities for the right person.&lt;/p&gt;\n&lt;p&gt;As a Nurse you will be caring, compassionate and committed to providing the best service possible to our patients. You will have proven organisational, time management and communication skills and be enthusiastic. You will be a clinical role model and have high clinical standards with a passion to make a difference for patients and staff alike.&lt;/p&gt;\n&lt;p&gt;As this is a community post the ability to meet the travel requirements of the role is essential. &lt;em&gt;Hours to include weekends and Bank Holidays working with a variety of shift patterns between the hours of 8am and 8pm to allow for flexibility: 8am – 4pm, 10am-6pm, 12pm-8pm. &lt;/em&gt; You will need to be able to be comfortable with agile working and have good IT skills.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of individuals and expects all staff to share this commitment. As part of our safe recruitment practice, it is a mandatory requirement for all newly appointed staff requiring a Disclosure and Barring Service (DBS) check to be registered with the DBS Update Service. All eligible staff recruited to the Trust are expected to maintain their annual update subscription whilst employed with the Trust as a condition of employment. The cost of the first year’s subscription to the update service will be reimbursed by the Trust as a payroll refund.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Hannah Madden - Professional Lead - &lt;strong&gt;07768711616&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Claire Hawkins (Senior HR Advisor - Resourcing) - 07887628247&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Integrated Health Team EBH 63773, SHIPSTON-ON-STOUR", "postalCode": "CV36 4AX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0671", "longitude": "-1.62208"}}, "title": "Community Nurse - Shipston", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244006", "validThrough": "2020-11-10T23:59:59+0000"}