{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-03T15:00:15+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a peer support worker who is an expert by experience. We are looking for someone who has lived experience of ADHD or Autism to join our Specialist Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Service for adults with ADHD &amp; Autism provides diagnostic assessments and specialist interventions for people in the Wakefield, Kirklees, and Barnsley localities. The Service administrative base is in Wakefield and clinicians work agile using clinical bases and hot desk facilities across the localities of the Trust. This post will be to work within the Kirklees area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Service received the prestigious ACOMHS accreditation awarded by the Royal College of Psychiatrists. Such accreditation assures staff, service users and carers, commissioners and regulators of the quality of the Service provided. We are the first Team working with people with adult neurodevelopmental disorders ever to receive it.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an integral and highly valued member of our Multi-disciplinary Team, the Peer Support Worker will work alongside the Team to provide training to the wider trust and partnership organisations. They will also work in collaboration to help develop and run small groups such as Autism post-diagnostic groups, social skills groups and carers groups.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The postholder will also need to be able to clearly articulate and promote the role of the Peer support worker in the Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will demonstrate a willingness to undergo additional training and a genuine interest in working with adults with ADHD and Autsim is required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your experience and commitment, we can offer you a friendly working environment, support and supervision within an experienced specialist Multidisciplinary Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Candidates should ensure they are able to demonstrate all essential requirements for the post identified in the person specification and note duties on the job description are as applicable to current requirements of the post and future development of the pathway.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The position is 37.5hrs per week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information/informal queries please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Emma Pell, Team Manager or Professor Marios Adamou, Clinical Lead on 01924 316492&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 5PN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6705", "longitude": "-1.48941"}}, "title": "Peer Project Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254447", "validThrough": "2020-11-18T23:59:59+0000"}