{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 per annum"}}, "datePosted": "2020-10-30T11:16:04+0000", "description": "&lt;p&gt;Living in Lincolnshire – a great combination of urban and rural life&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Want the best of both worlds? Come and work for the NHS in Lincolnshire.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join the existing Critical Care Medicine team in Lincolnshire. We are seeking to recruit consultant colleagues to join the team of experienced ICM Consultants who are a motivated, energetic and committed team based at both Lincoln County Hospital and Pilgrim Hospital, Boston.&lt;/p&gt;\n&lt;p&gt;The Trust has a total 25 Critical Care beds provided in 2 mixed level 3 and level 2 units (9 beds at Pilgrim Hospital and 16 beds at Lincoln County).&lt;/p&gt;\n&lt;p&gt;These posts are replacement posts that have arisen due to recent retirements. The posts have a basic 10 PA job plan with the opportunity for additional DCC and SPA by negotiation and agreement with successful applicants up to a maximum 48 hour working week.&lt;/p&gt;\n&lt;p&gt;The posts are primarily focused on providing 24/7 cover for the 16 bedded Critical Care Unit on a 1 in 10 on call basis on a separate ICU only on call rota (Lincoln County Hospital) and a 1 in 8 on call basis to cover 9 Critical Care beds at Boston Hospital. There will be opportunity to undertake daytime sessions in another area of specialty interest typically for 2-3 sessions/ week.&lt;/p&gt;\n&lt;p&gt;You will be joining a team of 8 consultants at Lincoln and 6 consultants based at Pilgrim Hospital, Boston in providing comprehensive Critical Care services to the 750,000 strong population of Lincolnshire&lt;/p&gt;\n&lt;p&gt;You will be supported by an excellent team of experienced Critical Care nurses and trainee and specialty grade medical as well as having the opportunity to be involved in medical education for undergraduate, foundation, core and specialty level trainees. We have recently recruited 2 ACCP&#39;s to the Critical Care team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Payscale: National NHS Consultant contract and Terms and conditions of service- point on pay scale at appointment depending on experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We offer the following unique only to Lincolnshire&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Direct links to the new £21 million Lincoln Medical School via Lincoln University&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The new facility is due to come on line soon and is scheduled for completion in Spring 2021&lt;/li&gt;\n&lt;li&gt;The facility will include:-\n&lt;ul&gt;\n&lt;li&gt;Clinical skills suite with mock consultation rooms (including hospital wards or a GP surgery) with the latest technologies to provide high quality teaching&lt;/li&gt;\n&lt;li&gt;2 x 120 capacity lecture theatres&lt;/li&gt;\n&lt;li&gt;Seminar space&lt;/li&gt;\n&lt;li&gt;Café and social learning space&lt;/li&gt;\n&lt;li&gt;Library, Science Library and Project Library&lt;/li&gt;\n&lt;li&gt;Anatomy Suite and Clinical Skills Suite&lt;/li&gt;\n&lt;li&gt;The entire building is designed to meet BREEAM (Building Research Establishment Environmental Assessment Method)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This new facility will enable medical students to explore the latest technology developments in healthcare and will support the provision of undergraduate medical education across all 3 acute sites in the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff Benefits:&lt;/strong&gt; We offer various staff benefits to all employees as follows:-&lt;/p&gt;\n&lt;p&gt;Family and Childcare&lt;/p&gt;\n&lt;p&gt;Benefits at work&lt;/p&gt;\n&lt;p&gt;Discounts and Salary Sacrifice&lt;/p&gt;\n&lt;p&gt;Rewards and Recognition&lt;/p&gt;\n&lt;p&gt;‘Providing the excellent care that we would expect for our own families’&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;People move to Lincolnshire, primarily, for the quality of life on offer: a real mix of bustling historic market towns, idyllic villages, miles of un-spoilt coastline, areas of outstanding natural beauty and one of the greatest cathedral cities in Britain.&lt;/p&gt;\n&lt;p&gt;Property prices are typically 60% of the average of those in the south east – first time buyers can take their first step on the property ladder for as little as £60,000.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Property type&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Avg. current value (June 2019)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Avg. £ per sq ft.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Avg. # beds&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Avg. £ paid (last 12m)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Detached&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£266,738&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;£197&lt;/p&gt;\n&lt;p&gt;3.5&lt;/p&gt;\n&lt;p&gt;£254,626&lt;/p&gt;\n&lt;p&gt;Semi-detached&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£168,640&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;£187&lt;/p&gt;\n&lt;p&gt;3.0&lt;/p&gt;\n&lt;p&gt;£170,160&lt;/p&gt;\n&lt;p&gt;Terraced&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£146,311&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;£179&lt;/p&gt;\n&lt;p&gt;2.7&lt;/p&gt;\n&lt;p&gt;£146,251&lt;/p&gt;\n&lt;p&gt;Flats&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£124,141&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;£194&lt;/p&gt;\n&lt;p&gt;1.9&lt;/p&gt;\n&lt;p&gt;£117,000&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Current asking prices in Lincolnshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Average: &lt;strong&gt;£236,619&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Current asking rents in Lincolnshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Average: &lt;strong&gt;£602 pcm&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In terms of property types, flats in Lincolnshire sold for an average of £117,000 and terraced houses for £146,251&lt;/p&gt;\n&lt;p&gt;If you require a larger family home or just like lots of space, then £250,000 will buy you something very special indeed.&lt;/p&gt;\n&lt;p&gt;Lincolnshire also has a diverse and fast growing economy, low unemployment, a healthy environment, low crime rates, health and education facilities well above the national average and affordable housing.&lt;/p&gt;\n&lt;p&gt;Lincolnshire is a county with plenty on offer to enhance any type of lifestyle by day or by night, in towns, villages and in Lincoln itself. That’s why there’s something for everyone in Lincolnshire.&lt;/p&gt;\n&lt;p&gt;Famed for its cathedral, castle and history, Lincoln has transformed itself in the past 20 years and is now a lively university city with 12,000-plus students and major industries supporting the city and county’s thriving retail, entertainment and nightlife scenes&lt;/p&gt;\n&lt;p&gt;Towns and villages sit in stunning countryside, including Boston under expansiv&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln and Boston, Lincoln and Boston", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Consultant in Intensive Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249906", "validThrough": "2021-05-02T23:59:59+0100"}