{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T10:31:39+0000", "description": "&lt;p&gt;&lt;strong&gt;2020 is the Year of the Nurse – why not make it your year starting with a career in Critical Care?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a motivated registered nurse who wants to start a career, or continue to work within critical care? Then come and join our fantastic team!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can even offer a relocation package.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have full time and part time opportunities for Registered Nurses within the Critical Care department at The William Harvey Hospital in Ashford, Kent.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on delivering consistently high standards of holistic care. This is reflected in our CQC reports, ICNARC data, performance metrics and feedback from patients, relatives and visitors to our unit.&lt;/p&gt;\n&lt;p&gt;We have a busy, mixed level unit admitting emergency and elective patients from a variety of specialities. These include maxillo-facial surgery and pPCi covering Kent. We are excited to announce that we are expanding to 24 beds in a new purpose built Intensive Care unit within the next 6 months.&lt;/p&gt;\n&lt;p&gt;We are a friendly, supportive and dynamic team with a strong commitment to professional development.&lt;/p&gt;\n&lt;p&gt;We are seeking enthusiastic, caring and self- motivated staff nurses who aspire to making a positive contribution to the care of critically ill patients. We are looking for both newly qualified nurses and experienced nurses that may have expertise within ITU. &lt;strong&gt;We have a job for you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return for your commitment and hard work&lt;/strong&gt;, we will actively support and encourage your education &amp; development. The dedicated Critical Care education team provides Band 5 nurses with a structured development programme, supporting individuals to gain the required skills and knowledge to become excellent Critical Care nurses. There will also be the opportunity to access to development opportunities with our excellent links with Canterbury Christchurch University.&lt;/p&gt;\n&lt;p&gt;Once established there will be an opportunity to further enhance your development and gain experience skills by rotating to the Kent and Canterbury ITU. This is an 8 bedded mixed level unit with multiple specialities including vascular, neurology, urology, renal and haematology specialities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Newly qualified or new to ITU?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We welcome applications from newly qualified staff with acute placement experience, who are qualifying within the next &lt;strong&gt;4 months&lt;/strong&gt;. We will provide you with the structured Trust Preceptorship programme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; We offer &lt;/strong&gt;an extensive fully supported induction programme over the first year. There is an initial 4 to 6 weeks supernumerary period. Afterwards we offer a ‘buddy’ system. We also run a critical care foundation course. This includes The STEP 1 national competencies for critical care nurses, and in house study days. We have a team of Practice Development Nurses who will work with you and help you to become a competent ITU nurse. These, in combination with self-directed study will support you in gaining the skills to safely care for critically ill patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Already experienced in ITU?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For those nurses who have ITU experience, our critical care education team will offer a package which will help you further enhance your clinical skills. This will include simulation days, advanced ventilation workshops and renal replacement study days. There will be an opportunity for you to apply for the ITU course which is run by Greenwich University. There will also be opportunities for you develop your leadership skills within the team.&lt;/p&gt;\n&lt;p&gt;We aim to provide safe and effective care that exceeds the expectations of our patients and the public and we are looking for excellent nurses who embrace our Trust values:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;People feel &lt;strong&gt;cared&lt;/strong&gt; for as individuals&lt;/li&gt;\n&lt;li&gt;People feel &lt;strong&gt;safe&lt;/strong&gt;, reassured and involved&lt;/li&gt;\n&lt;li&gt;People feel that we are &lt;strong&gt;making a difference&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;People feel teamwork, trust and &lt;strong&gt;respect&lt;/strong&gt; sit at the heart of everything we do&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anna Reilly-Clinical Nurse Educator on 01233 616114&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Harvey Hospital, Ashford", "postalCode": "TN24 0LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1415", "longitude": ".91624"}}, "title": "Registered Nurse in Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253472", "validThrough": "2020-11-17T23:59:59+0000"}