{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21142", "unitText": "YEAR", "value": "£21,142 - £24,157 per annum"}}, "datePosted": "2020-10-30T14:16:33+0000", "description": "&lt;p&gt;The Estates Department is responsible for the operation and maintenance of engineering services, plant, building fabric and grounds and gardens across a large acute hospital site. We presently support services to more than 500 beds. The site is busy and consists of a mix of new and old buildings. This is a challenging time and opportunity to join a team of Estates Management Professionals.&lt;/p&gt;\n&lt;p&gt;Candidates will have served an apprenticeship or undertaken other suitable training in an electrical trade, attained an appropriate qualification and gained experience to carry out maintenance on a wide range of engineering plant and services to ensure a safe and pleasant environment for patients, visitors and staff.&lt;/p&gt;\n&lt;p&gt;It is essential you have experience in the installation and maintenance of electrical plant and services. You should be able to work to deadlines with the minimum of supervision, have a positive attitude and a flexible approach. You should possess good fault diagnosis skills and be a good communicator.&lt;/p&gt;\n&lt;p&gt;The Trust is introducing increased flexibility towards employees hours of work. Currently a Monday to Friday work pattern 8.00 a.m. – 4.00 p.m. applies and will be followed for the purpose of site familiarisation. There will then be an expectation and requirement for the successful applicant to work an extended pattern of flexible hours consistent with moves towards 24/7 working.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to provide a ‘return to work’ commitment outside of normal working hours and must be prepared to participate in an ‘on-call’ rota.&lt;/p&gt;\n&lt;p&gt;We offer an induction programme to familiarise you with the work and the site, appropriate in-service training where necessary, uniform, up to 33 days holiday, final salary pension scheme, restaurant and opportunity for career development&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMick ClaytonJob titleEstates officerEmail addressmick.clayton@ulh.nhs.ukTelephone number01205445235Additional contact information&lt;/p&gt;\n&lt;p&gt;Craig Hancock craig.hancock@ulh.nhs.uk 01205445235&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pilgrim, Boston", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Maintenance Craftsperson Electrician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250511", "validThrough": "2020-11-15T23:59:59+0000"}