{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 Per Annum, Pro Rata"}}, "datePosted": "2020-10-23T11:15:23+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;HPB Service Line&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;POST: 12 months Specialist Hepato-Pancreato-Biliary (HPB) Dietitian - Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;DEPARTMENT: HPB / General Surgery Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HOURS: 0.7 WTE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SALARY: Band 7 Pro rata&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking a highly skilled, motivated and confident Dietitian with specialist HPB experience to join the HPB surgical team based at Derriford Hospital, Plymouth. The post holder will work as part the acute dietetic team to provide care to patients undergoing HPB surgery, provide outpatient input for chronic HPB conditions (chronic pancreatitis, cancer, etc) and also provide inpatient specialist care for patients with severe pancreatitis. The post is approved and funded for an initial 12 months, but planned to be permanent pending audit and continued evidence of need.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be responsible for providing an inpatient and outpatient service to these patients attending consultant and nurse led clinics and will be actively involved in the entire team. The HPB service at Plymouth has identified the lack of dietetic support as a key area for improvement in our service, and this post provides the exciting opportunity to shape our service for the future.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In addition to the clinical workload the post holder will be encouraged to undertake audit and will be responsible for clinical development and supervision of junior staff and student dietitians as well as acting as a professional resource for other dietitians.&lt;/p&gt;\n&lt;p&gt;The post holder will be involved in all nutrition and dietetic departmental activities and will contribute to the delivery of a Trust wide dietetic service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We will support training in HPB dietetics and attendance at regional, national and international training days / conferences / units will be encouraged and available.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; If you are able to work under pressure and can make sound clinical decisions this will be an exciting career opportunity for you. Plymouth is a vibrant city on the stunning South Devon coast within easy reach of Dartmoor National Park, and with good road, rail, continental ferry and air links.&lt;/p&gt;\n&lt;p&gt;The interview panel will include Claire Goulding – HPB CNS, Chris Briggs – Consultant HPB Surgeon and service Line lead and a dietetic department representative. A short presentation will be expected &lt;em&gt;on “The development of the new HPB dietitian role at Derriford”.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For an informal discussion and more information about this post please phone Chris Briggs, HPB service line lead on 07980748257 or e-mail christopherbriggs@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that applications from temporary workers who have been engaged with the Trust for a minimum of 3 months are welcome.&lt;/p&gt;\n&lt;p&gt;Available as a fixed term contract or secondment opportunity. (With current line manager&#39;s agreement).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Specialist (HPB) Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240254", "validThrough": "2020-11-08T23:59:59+0000"}