{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "dependant on experience"}}, "datePosted": "2020-10-23T13:54:07+0100", "description": "&lt;p&gt;UCLH is host to Cochrane Neuromuscular, which is one of 8 Cochrane Review Groups (CRGs) within the Cochrane Mental Health and Neuroscience Network, and one of over 50 Cochrane CRGs globally. Cochrane is a global independent network of health practitioners, researchers, patient advocates and others, responding to the challenge of making the vast amounts of evidence generated through research useful for informing decisions about health. It does this through the production of systematic reviews which collect and synthesise the high quality research on clinical questions. The editorial base of Cochrane Neuromuscular is located in the Queen Square Centre for Neuromuscular Diseases, within the National Hospital for Neurology and Neurosurgery (NHNN).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Purpose of this role:to support the production of the Review Group’s systematic reviews up to submission for publication in &lt;em&gt;The Cochrane Library&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours available: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Up to 5 days/week (37.5 hours)&lt;/p&gt;\n&lt;p&gt;Duration: up to 26 February 2021; possibly further work thereafter&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A minimum of 2 years&#39; experiencein aCochraneeditorial and/or systematic reviewer role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tasks&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proofread and edit protocols and reviews for content, methodological, reporting, and technical integrity (Methodological Expectations of Cochrane Intervention Reviews (MECIR) standards), format, grammar and the use of English.&lt;/li&gt;\n&lt;li&gt;Carry out systematic review tasks (data extraction, data entry, reviewing search results)&lt;/li&gt;\n&lt;li&gt;Check authors&#39; responses to peer review and other feedback.&lt;/li&gt;\n&lt;li&gt;Assist in editorial and other review group tasks relating to peer review, including identifying external peer and consumer reviewers; also priority setting, data collection, publicising published reviews, updating workflows&lt;/li&gt;\n&lt;li&gt;Information Specialist skills with the ability to develop and peer review search strategies would be helpful&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The list of tasks is not intended to be exhaustive and it is likely that duties may be altered from time to time in the light of changing circumstances and after consultation with the post holder.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Knowledge:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Educated to a degree level in a scientific or medical subject, preferably with a higher degree&lt;/li&gt;\n&lt;li&gt;Experience in an scientific editing role, ideally in a Cochrane review group&lt;/li&gt;\n&lt;li&gt;Good working knowledge of MECIR (Methodological Expectations for the Conduct and Reporting of Cochrane Intervention Reviews) standards and systematic review methods, the Cochrane Handbook for Systematic Reviews of Interventions&lt;/li&gt;\n&lt;li&gt;Familiar with commonly usedCochrane software (including as a minimumReview Manager,Archie, GRADE)&lt;/li&gt;\n&lt;li&gt;Experienced in review tasks including(but not limited to) Risk of bias assessment, data extraction, data entry into Review Manager Software, meta-analysis methods&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills and qualities&lt;br /&gt; &lt;br /&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Attention to detail&lt;/li&gt;\n&lt;li&gt;Very high standard of written and spoken English&lt;/li&gt;\n&lt;li&gt;Good record keeping&lt;/li&gt;\n&lt;li&gt;Able to work closely with senior academics/researchers&lt;/li&gt;\n&lt;li&gt;Excellent interpersonal skills&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "WC1X 8HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5237", "longitude": "-.11479"}}, "title": "Systematic Reviewer/Assistant Managing Editor Cochrane Neuromuscular", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240797", "validThrough": "2021-02-26T23:59:59+0000"}