{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56000", "minValue": "54000", "unitText": "YEAR", "value": "£54,000 - £56,000"}}, "datePosted": "2020-11-04T18:16:27+0000", "description": "&lt;p&gt;Head of Clinical Services&lt;/p&gt;\n&lt;p&gt;The role:&lt;/p&gt;\n&lt;p&gt;An integral part of the team who is committed to delivering the highest quality clinical outcomes in a supported environment, where you will be valued for your skills and expertise. You will work in close partnership with the Hospital Director and be part of the Senior Leadership Team. Providing strong leadership, direction and operational management to support and meet the business and workforce objectives of the hospital and Ramsay Health Care as a whole.  Commitment to the development of high quality evidence based acute care, combined with personal drive, enthusiasm, creativity and resilience.&lt;/p&gt;\n&lt;p&gt;What you’ll bring with you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A strong clinical background in acute surgical/medical care&lt;/li&gt;\n&lt;li&gt;NMC or HCPC Registered&lt;/li&gt;\n&lt;li&gt;Significant exposure in a senior clinical role to external stakeholders such as Consultants and the health care community&lt;/li&gt;\n&lt;li&gt;Exeperinece of working in a surgical environment &lt;/li&gt;\n&lt;li&gt;Experience in clinical governance, development and administration of budgets, management reports and supply contracts&lt;/li&gt;\n&lt;li&gt;The ability to provide effective monitoring and management of resources needed to sustain agreed activity levels&lt;/li&gt;\n&lt;li&gt;Experienced in leading clinically based projects&lt;/li&gt;\n&lt;li&gt;The ability to develop effective working relationships with key stakeholders e.g. Integrated Care Systems, Clinical Commissioning Groups, General Practitioners, Consultants and Suppliers&lt;/li&gt;\n&lt;li&gt;A proven track record of leadership and be able to manage a team, ensuring that the Hospital complies with CQC requirements.&lt;/li&gt;\n&lt;li&gt;A Comprehensive understanding of relevant legal and professional care/practice standards&lt;/li&gt;\n&lt;li&gt;The competence to provide effective monitoring and management of the clinical services&lt;/li&gt;\n&lt;li&gt;Excellent communication and rapport building skills&lt;/li&gt;\n&lt;li&gt;The ability to make decisions and use your initiative&lt;/li&gt;\n&lt;li&gt;Passion to deliver outstanding care in a rewarding and what can be emotionally challenging environment&lt;/li&gt;\n&lt;li&gt;A flexible and positive attitude&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Access to the Ramsay Academy – genuine opportunities to grow, develop and specialise in your career&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus the opportunity to buy/sell more&lt;/li&gt;\n&lt;li&gt;Flexible shift options&lt;/li&gt;\n&lt;li&gt;Private Healthcare and Life Assurance&lt;/li&gt;\n&lt;li&gt;Subsidised staff restaurant&lt;/li&gt;\n&lt;li&gt;Free uniform&lt;/li&gt;\n&lt;li&gt;Access to our employee Discount Programme&lt;/li&gt;\n&lt;li&gt;Wellbeing centre and access to 24/7 employee assistance line for free advice&lt;/li&gt;\n&lt;li&gt;Free DBS checking&lt;/li&gt;\n&lt;li&gt;Long service, Employee recognition and appreciation awards&lt;/li&gt;\n&lt;li&gt;Annual bonus of up to 20% &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;About us:&lt;/p&gt;\n&lt;p&gt;Park Hill Hospital is one of South Yorkshire&#39;s leading private hospitals with an excellent reputation for delivering high quality healthcare treatments and services.&lt;/p&gt;\n&lt;p&gt;Located in Doncaster, the hospital currently has 17 bedrooms and a four bedded day care unit all with en suite facilities.&lt;/p&gt;\n&lt;p&gt;By investing in advanced medical technology, the hospital offers a wide range of treatments and services. The fully equipped ultra clean air theatre is particularly suitable for orthopaedic procedures offered such as arthroscopy and hip and knee replacement. The day unit is suitable for minor operations.&lt;/p&gt;\n&lt;p&gt;Ramsay Health Care UK is a well-established global hospital group with over 50 years’ experience. It is well respected within the healthcare industry and is one of the leading providers of independent hospital services in England.&lt;/p&gt;\n&lt;p&gt;Ramsay Health Care UK is a well-established global hospital group with over 50 years’ experience. It is well respected within the healthcare industry and is one of the leading providers of independent hospital services in England.&lt;/p&gt;\n&lt;p&gt;We love people with a positive, “can do” attitude who want to make a difference in their work. &quot;Our employees are Ramsay.&quot; The skills and commitment of our employees forms the basis for our success.&lt;/p&gt;\n&lt;p&gt;“The Ramsay Way” culture recognises that people – staff and doctors – are Ramsay Health Care’s most important asset and this has been key to our ongoing success. Click here to find out more.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN2 5TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5303", "longitude": "-1.11134"}}, "title": "Head of Clinical Service/Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256853", "validThrough": "2020-11-18T23:59:59+0000"}