{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-28T13:30:54+0000", "description": "&lt;p&gt;The Department of Immunology at Oxford University Hospitals Trust, are looking for an HCPC registered Healthcare Scientist with experience in an NHS diagnostic laboratory (preferably Immunology). Unregistered applicants, who can demonstrate significant progress on their registration portfolio, may also be considered. This post is for a fixed term of two years from start of employment.&lt;/p&gt;\n&lt;p&gt;We are keen to employ an enthusiastic, flexible and self-motivated person who is a good communicator to join our friendly team. You will play a key role in delivering and developing our comprehensive, clinical immunology service. You will help to meet quality standards necessary for accreditation, and ensure that protocols are followed and method files maintained in a way that maintains Health, Safety and Security for individuals, the Department and the Trust.&lt;/p&gt;\n&lt;p&gt;The Department of Immunology, is a large and dynamic laboratory providing a wide ranging regional diagnostic Immunology service. It offers a substantial and diverse repertoire of assays, some of which are highly specialized . The laboratory has UKAS 15189 Accreditation and processes over 380,000 tests per year. Situated in a vibrant, historical city with a tradition of innovation and forward-thinking we offer great opportunities for career development in a highly progressive working environment.&lt;/p&gt;\n&lt;p&gt;Please ensure you read the job description attached below and that your statement in support reflects this, as your application will be judged against these criteria.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 11th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Planned Interview Date: tbc &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Victoria Barnard, Laboratory Manager, victoria.barnard@ouh.nhs.uk 01865 225991&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Churchill Hospital, Oxford", "postalCode": "OX3 7LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Healthcare Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246783", "validThrough": "2020-11-15T23:59:59+0000"}