{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa, Based on Full Time Hours"}}, "datePosted": "2020-10-13T18:15:54+0100", "description": "&lt;p&gt;&lt;strong&gt;Would you like to be part of a team dedicated to helping children and adolescents with Mental Health needs?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Right now is an exciting time to join our CAMHS team! Austen House has recently opened to help meet the the national shortage of beds for young people with specialist mental health needs and will mean that patients living in the south of the country will be able to access treatment closer to home, preventing them and their families having to travel long distances to receive the care they need.&lt;/p&gt;\n&lt;p&gt;We are a 14 bed unit that helps young people, both male and female, aged 12-18 years. Young people using our service have complex mental health problems which means they may pose a risk to themselves. Austen House has state of the art facilities including, education facilities, a gym, a sensory room and many more areas designed with our young people in mind.&lt;/p&gt;\n&lt;p&gt;As a Health Care Support Worker you will work closely with service users, their families, friends and carers. You will play an important role in ensuring those who use our services have a positive and supportive experience. Successful candidates will need to be kind and responsive and remain professional and informative and contribute to the quality of the services we provide.You will need to have good communication skills and be able to demonstrate a caring and supportive approach to working. Experience within a forensic environment is not essential, but a compassionate and caring nature is.&lt;/p&gt;\n&lt;p&gt;To find out more about working in CAMHs please click the link at the side.&lt;/p&gt;\n&lt;p&gt;Any queries or an informal discussion please contact please contact Bethan Grundy, Ward Manager on 02382 311322 or email Bethan.grundy@southernhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO40 2TA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9316", "longitude": "-1.52542"}}, "title": "Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225242", "validThrough": "2020-11-11T23:59:59+0000"}