{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-29T17:01:19+0000", "description": "&lt;p&gt;An innovative and experienced senior mental health nurse who is passionate about ensuring people who use our mental health and learning disability services, receive high quality safe care, is required to fulfill the role of Associate Director of Nursing Standards and Safety. You will be working within a highly motivated, patient centered and forward thinking team.&lt;/p&gt;\n&lt;p&gt;Working in conjunction with the Deputy Chief Nurse, your role will be essential in leading on the implementation of reducing restrictive interventions and PMVA, improving clinical standards, Safer Staffing and the development and implementation of appropriate clinical policies supported by bespoke training packages. In addition, the role will require you to provide expert nursing guidance, support and professional leadership relating to patient safety issues with the Care Delivery Services.&lt;/p&gt;\n&lt;p&gt;A passion for nursing and the ability to work within and deliver on, competing and complex demands is essential.&lt;/p&gt;\n&lt;p&gt;In return, we can offer you support and supervision, a very exciting and challenging role, opportunity for personal development, access to Leadership programmes and a highly rewarding role.&lt;/p&gt;\n&lt;p&gt;The interviews are planned for the 11th December.&lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact Justine Rosser at justine.rosser@sussexpartnership.nhs.uk or by phone via Liz Chamberlain on 07912 091854.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swandean, Worthing", "postalCode": "BN13 3EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8412", "longitude": "-.411136"}}, "title": "Associate Director of Nursing Standards and Safety", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249183", "validThrough": "2020-11-24T23:59:59+0000"}