{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23887", "minValue": "23887", "unitText": "YEAR", "value": "£14.21 Per hour"}}, "datePosted": "2020-10-14T09:14:25+0100", "description": "&lt;p&gt;&lt;em&gt;Ready for the recognition &lt;em&gt;and rewards you deserve?&lt;/em&gt;&lt;/em&gt;We don’t just talk about putting employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort. So we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt;Suttons Manor is a specialist low secure forensic service for men who are over the age of 50.&lt;/p&gt;\n&lt;p&gt;Care is provided over two wards, both of which are 13 bedded male units and offer an age appropriate environment for those who also have a mental health/personality disorder and/or dementia, in need of physical health care needs.&lt;/p&gt;\n&lt;p&gt;The hospital is set in its own attractive grounds of over 9 acres near the town of Romford in Essex. Convenient access is provided by the M25, and the nearby underground station at Theydon Bois, which is on the Central Line, or rail station at Romford.&lt;/p&gt;\n&lt;p&gt;As part of our nursing team you will assist and support the assessment, treatment and rehabilitation of patients in the unit and on community trips.&lt;/p&gt;\n&lt;p&gt;Working as part of a multidisciplinary team under the direct supervision of a qualified nurse you will be required to undertake a range of duties involving direct patient contact and interaction.&lt;/p&gt;\n&lt;p&gt;Our Registered Mental Health Nurse role involves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing a high standard of care to people with mental illness and personality disorder.&lt;/li&gt;\n&lt;li&gt;Developing therapeutic relationships to optimise patient engagement&lt;/li&gt;\n&lt;li&gt;Following all codes of conduct, standards and legislation, respecting the rights of others and promoting ethical practice.&lt;/li&gt;\n&lt;li&gt;Contributing to patient assessments, compiling a plan of care alongside the individual, and monitoring patient progress.&lt;/li&gt;\n&lt;li&gt;At a more senior level, you’ll also need to lead shifts as well as mentoring and supporting student nurses and other members of the team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stapleford, Romford", "postalCode": "RM4 1BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6599", "longitude": ".183406"}}, "title": "Bank Registered Mental Health Nurse (RMN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225428", "validThrough": "2020-11-13T23:59:59+0000"}