{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum"}}, "datePosted": "2020-11-05T12:16:11+0000", "description": "&lt;p&gt;Want to work at one of the largest trusts in England? Eager to help us take great steps forward to engage our staff, recognise their achievements and celebrate success? Looking for a role that stretches and challenges you? Then this is the job for you.&lt;/p&gt;\n&lt;p&gt;We are seeking two internal communications professionals who will deliver innovative and highly-effective communications and engagement. They will put the 15,000 people who work at the trust across our numerous sites at the heart of everything they do and will be a passionate advocate and ambassador for the values of the Trust.&lt;/p&gt;\n&lt;p&gt;These are exciting, newly created roles within the communications team and an opportunity for someone with enthusiasm, energy and talent to really make their mark. The post holders will be responsible for ensuring our employees are kept regularly informed and engaged across a range of channels about corporate news (including HR), staff health and wellbeing and sharing success and good practice. In particular these roles will work in partnership with HR and OD colleagues, the wider communications team and key teams like corporate services to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;develop and implement the Trust’s internal communications strategy&lt;/li&gt;\n&lt;li&gt;manage internal communication channels&lt;/li&gt;\n&lt;li&gt;be a point of contact and offer advice on internal communications&lt;/li&gt;\n&lt;li&gt;represent internal communications on project groups&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our ideal candidates will have a track record in developing and delivering communications and engagement plans. They will be adept at managing a varied and pressurised workload in a changeable environment and, as natural networkers, will be able to build and maintain effective relationships with colleagues, partners and stakeholders across the Trust.&lt;/p&gt;\n&lt;p&gt;Working as part of a small team, in a busy, cross-site environment, you’ll have the chance to make a real impact and put your excellent communications skills to use on a wide range of interesting projects. You will also have experience of line management, proven skills in working with a variety of stakeholders and the ability to work alongside senior managers on high profile issues.&lt;/p&gt;\n&lt;p&gt;These are crucial roles, ensuring our staff get the right information at the right time to ensure they&#39;re able to care for patients and look after each other during the unprecedented challenge facing the NHS by Covid-19 and beyond.&lt;/p&gt;\n&lt;p&gt;You don’t need to have worked in the NHS before – but experience of working at the heart of a busy communications environment will be essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNiki EvesJob titleAssociate Director, Communications and EngagementEmail addressniki.eves@meht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon, Chelmsford or Southend, Basildon, Chelmsford or Southend", "postalCode": "CM1 7ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7746", "longitude": ".465452"}}, "title": "Communications and Engagement Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257606", "validThrough": "2020-11-18T23:59:59+0000"}