{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro-rata"}}, "datePosted": "2020-11-03T12:22:05+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Rapid Response Sister – Luton Community Services&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band:&lt;/strong&gt; 6&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt; £31,365 –£37,890&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; The Poynt, Luton&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; Full/Part time hours available(For part time posts salary will be pro-rata)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours of service: &lt;/strong&gt;08:00 - 23:00 – Flexible working over 7 days a week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract:&lt;/strong&gt; Permanent&lt;/p&gt;\n&lt;p&gt;We are expanding our Rapid Response Community Nursing Team and this brings an exciting opportunity for experienced and skilled Nurses to join the Rapid Response team in Luton.&lt;/p&gt;\n&lt;p&gt;The Rapid Response Team is an established and successful team that form an integral part of the Luton ‘At Home First’ Integrated Rapid Response service and the Integrated Community District nursing service, with the aim of providing high quality nursing care to the people of Luton to enable them to maximize their health status, minimize the effects of ill health and disability, and to lead as independent a life as possible.&lt;/p&gt;\n&lt;p&gt;Through the ‘Luton At Home First’ approach we work collaboratively with local providers and GP’s to ensure that people can receive care at home that avoids inappropriate hospital admission by providing intensive support to help people to recover at home without the risk of picking up hospital acquired infections and prevent other effects of hospital admission such as loss of confidence in mobilizing or carrying out daily activities.&lt;/p&gt;\n&lt;p&gt;The Team also supports patients under the care of the District Nursing teams by providing unscheduled care in and out of hours to patients across the Luton area.&lt;/p&gt;\n&lt;p&gt;As a member of the team you will contribute to the continuing service development and delivery of our ambition for teams to work more closely together, support periods of high demand and develop new ways of working in clinical triage, patient assessment, and care delivery ensuring person centred holistic care is delivered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Is this an opportunity for you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will enjoy working autonomously in a community environment, which puts the patient at the centre of their care. You will have experience of undertaking comprehensive nursing assessment and treatment planning preferably with community experience.&lt;/p&gt;\n&lt;p&gt;You will have passion and drive with a strong team ethic and flexible disposition, responding positively to a fast changing environment.&lt;/p&gt;\n&lt;p&gt;You will enjoy the challenges that a changing environment brings.&lt;/p&gt;\n&lt;p&gt;You will work collaboratively as a member of the integrated team with local health and social care providers as well as GP’s, and the voluntary sector to provide high quality health care within an integrated team model.&lt;/p&gt;\n&lt;p&gt;We offer a comprehensive induction period and are committed to developing our staff. You will have a Personal development plan which supports your development, identifying both formal and informal training.&lt;/p&gt;\n&lt;p&gt;Interviews will take place virtually over Microsoft Teams&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Successful applicantsto postsatband 6 or above for which a DBS check is required, will beasked to pay for this as a condition of their job offer(£44.00 for an Enhanced Check or £27.00 for a Standard Check). This payment will be deducted from their first month’s salary unless a longer pay back period is agreed with the appointing manager.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Thiswillnot apply tosuccessful applicants who are registered with the DBS Update Service and is in possession of the disclosure certificate, for whom an online status check will be undertaken.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125234.png", "name": "Cambridgeshire Community Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Poynt, Luton", "postalCode": "LU4 0LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8927", "longitude": "-.487287"}}, "title": "Rapid Response Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253957", "validThrough": "2020-11-17T23:59:59+0000"}