{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "120000", "minValue": "120000", "unitText": "YEAR", "value": "£120,000 per annum"}}, "datePosted": "2020-10-07T18:22:27+0100", "description": "&lt;p&gt;&lt;strong&gt;Please Note, we cannot accept applications through NHS Jobs. T&lt;/strong&gt;&lt;strong&gt;o apply for this role, please apply via the following link or search 2020-2342 on the Change Grow Live careers site: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;careers-changegrowlive.icims.com/jobs/search?ss=1¬Found=1&amp;mobile=false&amp;width=687&amp;height=500&amp;bga=true&amp;needsRedirect=false&amp;jan1offset=0&amp;jun1offset=60&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you want to work for a caring organisation that believes in people? Do you want to make a difference? As a Consultant  with Change Grow Live you’ll work with people who use our services, helping them get to where they want to be.&lt;/p&gt;\n&lt;p&gt;Change Grow Live are looking to recruit a Consultant Psychiatrist for their substance misuse treatment services in Nottingham (Bases are Mansfield/ Worksop/ Hucknall and open for discussion).&lt;/p&gt;\n&lt;p&gt;The post holder will be the Clinical Lead for the service have responsibility to lead a multi-disciplinary team to provide holistic care for service users.&lt;/p&gt;\n&lt;p&gt;The post-holder will contribute to the service to ensure that service users consistently receive high quality services that adhere to the best practice guidelines and achieve high professional standards. They will be responsible for contributing to the overall performance of the service to ensure that contractual output targets are achieved. They will be required to record and input client data and information in order that the service operates within contractual, administrative and financial requirements.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to provide a constant stimulus for improving clinical services and be a role model. They will have a recovery-focussed approach to treatment.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be able to access a well-developed monthly CPD program, receive regular supervision and be fully supported in the appraisal and revalidation structure. All doctors within CGL receive weekly protected CPD and are encouraged and supported to get involved in clinical audit and research. Applicants for the above role should have significant experience in addiction medicine at Consultant level.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132514.png", "name": "change, grow, live (CGL)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottinghamshire", "postalCode": "NG18 1ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1398", "longitude": "-1.19691"}}, "title": "Consultant Psychiatrist in Addictions", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217498", "validThrough": "2020-12-31T23:59:59+0000"}