{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45859", "minValue": "42821", "unitText": "YEAR", "value": "£42,821 - £45,859 per annum"}}, "datePosted": "2020-10-27T15:02:06+0000", "description": "\n&lt;p&gt;&lt;strong&gt;Oxfordshire County Council are looking for a Practice Supervisor Social Worker to work within the Acute Hospital Team based at the John Radcliffe Hospital.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an opportunity for you to showcase your excellent practice skills, together with your energy and enthusiasm and be part of this supportive,  innovative and forward-thinking Hospital Team.   &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n\n&lt;strong&gt;About us&lt;/strong&gt;\n\n&lt;p&gt;We are committed to partnership working and work collaboratively with our Health colleagues focusing on admission avoidance and timely discharges. Promoting service user independence is underpinned by the development and embedding of strength based practice throughout all of our work, including Reablement, Reviews and Care Needs Assessments.&lt;/p&gt;\n&lt;p&gt;We are easily commutable from many locations including Birmingham, North London, Newbury, Reading, Swindon and Warwick.&lt;/p&gt;\n&lt;p&gt;To find out more, please visit Oxfordshire County Council Social Work Careers&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n\n\n&lt;strong&gt;About the role&lt;/strong&gt;\n\n&lt;p&gt;You will work closely with the Team Manager and other Practice Supervisors within the Hospital Teams, embracing new ways of working to empower service users, promote their independence and meet their identified needs effectively and efficiently.   &lt;/p&gt;\n&lt;p&gt;An enhanced DBS ‘Disclosure and Barring Service’ check for regulated activity (formerly known as CRB) and the Children’s and Adults’ Barred List checks will be required for this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n\n\n&lt;strong&gt;About you&lt;/strong&gt;\n\n&lt;p&gt;We are looking for a Practice Supervisor, who will be able to demonstrate and apply excellent understanding and knowledge of Adult Social Care and Health legislation; to evidence an applied and effective knowledge of safeguarding vulnerable adults’ procedures; together with evidence of an ability to develop and support good inter-professional relationships across both the statutory and third sector. Hospital experience would be helpful but is not essential.&lt;/p&gt;\n&lt;p&gt;You must be an experienced Social Worker with current SWE registration, have excellent communication skills and be able to demonstrate the aptitudes and ability to support a busy dynamic team effectively, prioritising daily challenges and expectations as well as making sound confidential decisions that respond to competing demands. In a time of extraordinary challenges and change you will have ample opportunity to demonstrate your ability to support the team in responding flexibly and quickly to changing needs. With your ‘glass half-full perspective’ and commitment to strength-based practice you will be adept at finding solutions.&lt;/p&gt;\n&lt;p&gt;Driven by a commitment to deliver excellent social work practice and the development of staff practice, you must be able to provide evidence of effective supervision as you will be providing professional support to staff in managing their workloads and lead staff in best practice approaches. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n\n\n\n&lt;strong&gt;Rewards and benefits&lt;/strong&gt;\n\n&lt;p&gt;It really is true that every single job role here contributes to bettering the lives of the people in our county - we want to do this for our employees too. We are proud of our strong flexible working culture, including the opportunity for flexibility on working hours and the use of technology to support agile working. We offer some of the very best learning and development opportunities to support your ongoing development. &lt;br /&gt; &lt;br /&gt;We have a generous holiday allowance which rises as you remain in employment with us up to 32 days, as well as giving you the option to buy additional holiday. You will also have access to a Local Government Pension Scheme with employer contributions of up to 19.9% of your salary; a range of local and national retail discounts; and a host of enhanced family friendly policies including carers leave and paid time off for volunteering.&lt;/p&gt;\n\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxfordshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129518"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Practice Supervisor (Acute Hospital Team) OCC45670", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245115", "validThrough": "2020-11-15T23:59:59+0000"}