{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 pro rata per annum"}}, "datePosted": "2020-10-12T10:10:01+0100", "description": "&lt;p&gt;Applications are invited for a full-time (10 PAs plus 10% R+R plus 1 additional programmed activity ) Inpatient Adult Consultant Psychiatrist&lt;/p&gt;\n&lt;p&gt;This posts has arisen in adult inpatients through retirement and service redesign, opening up an exciting opportunity to join an organisation with strong values and capable leadership, committed to all aspects of quality improvement. You will be based at the new purpose built Hartley Hospital which is a state of the art inpatient and community facility.&lt;/p&gt;\n&lt;p&gt;Mersey Care NHS FT is an innovative well led Trust, with an aspiration of Perfect Care for all of its service users, delivered through a supportive “Just Culture” environment for staff. For Consultant Psychiatrists it offers excellent opportunities for professional development, research and medical management roles. As a Global Digital Exemplar Mersey Care is developing digital applications to support the implementation of its &#39;Zero Suicide Policy&#39; and the use of predictive analytics in mental health which will assist clinicians with their decision making and risk prioritisation.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from applicants with a passion for supporting colleagues with their professional expertise and leadership qualities, and making contributions to service developments in the field of Adult Psychiatry.&lt;/p&gt;\n&lt;p&gt;At Mersey Care we are passionate about mental health and wellbeing, and delivering the best possible care for the people we serve. Quality, recovery and wellbeing are at the heart of everything that we do.&lt;/p&gt;\n&lt;p&gt;Help us achieve our ambitious vision for the future, whilst living in the Liverpool City Region that offers an outstanding quality of life.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Hannah Ruth&lt;/p&gt;\n&lt;p&gt;Hannah.Ruth@merseycare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hartley Hospital, Southport, Southport", "postalCode": "L34 1PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4231", "longitude": "-2.8262"}}, "title": "Consultant Psychiatrist Adult Inpatients", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221804", "validThrough": "2020-11-18T23:59:59+0000"}