{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-03T13:00:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Health Care Support Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our nursing team is small, skilled and friendly working within a busy specialist ambulatory care outpatient setting. Our combined Outpatient Department is now based at Royal Papworth Hospital in Cambridge. We facilitate the ongoing care and management of patients with cardiac disease and chronic respiratory diseases. We work as part of a number of multidisciplinary teams in a constantly evolving and innovative ambulatory care setting.&lt;/p&gt;\n&lt;p&gt;We have an allocated team coordinator and expect all our staff to be able to effectively multitask and run multiple clinics ensuring all infection control risks are managed within the department, and the patients experience is optimised through good communication, team working and intentional rounding of the waiting area.&lt;/p&gt;\n&lt;p&gt;The successful applicant will require previous experience and be able to manage and prioritise competing demands in a complex clinic environment. Ideally we would like dynamic individuals who have already demonstrated continued development within the HCSW role and have skills in venepuncture, ECG’s, observations and managing patients within permitted guidelines. You will also need to have some IT skills and be able to effectively document into our EPR system.&lt;/p&gt;\n&lt;p&gt;We plan to commence care delivery to patients at the weekends in the near future. This is currently under review, but would likely involveone shift every 4 weeks on a Saturday or Sunday (08:00 – 16:00).&lt;/p&gt;\n&lt;p&gt;If you are a friendly, compassionate, patient focused team player who is flexible and looking for a new challenge and wished to advance your clinical skills and knowledge in a specialist cardio-thoracic ambulatory care setting, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information or an informal visit please contact either:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Deputy Charge Nurse Lee Brooks, or Telephone: 07775 555620&lt;/p&gt;\n&lt;p&gt;Deputy Sister Daisy Gamblesmith&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Cambridge Biomedical Campus, Papworth Road, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Healthcare Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254069", "validThrough": "2020-11-16T23:59:59+0000"}