{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 Per Annum"}}, "datePosted": "2020-11-04T17:15:15+0000", "description": "&lt;p&gt;&lt;span&gt;County Durham and Darlington NHS Foundation Trust is one of the largest integrated care providers in England, serving a population of around 600,000 people. We are a high performing organisation with a track record of success. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;An exciting opportunity has arisen for an Urgent Care Practitioner to join an established team working in Urgent Treatment Centres in County Durham and Darlington, with a nominal base at Shotley Bridge Urgent Treatment Centre. The Centre operates 24/7 and is Practitioner led Monday to Friday Midnight -1800, with GP cover for the remainder.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Experience in Primary or Urgent Care is essential. Candidates must have an accredited Physical Assessment Skills qualification enabling them to work autonomously, assessing, diagnosing, treating or referring onwards patients of all age ranges with a broad spectrum of minor illness and injury presentations. Paediatric Clinical Skills qualification or equivalent experience is required but support can be provided to achieve this for the successful applicant.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The candidate must also have an independent prescribing qualification or have made a commitment to undertake this. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful applicant will be working alongside GP’s and an experienced team of Nurse and Paramedic Practitioners, as well as having responsibility for mentoring and developing junior Practitioners, HCA’s and Nurse Associate Apprentices. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Advanced leadership, interpersonal and organisational skills are required as is a commitment to service development and excellence in practice.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are a confident, enthusiastic positive team orientated Registered Nurse or Paramedic seeking a new challenge and you fulfill the requirements above please apply or contact us directly for an informal discussion regarding the position.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shotley Bridge", "postalCode": "DH8 0NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8691", "longitude": "-1.84293"}}, "title": "Urgent Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256778", "validThrough": "2020-11-18T23:59:59+0000"}