{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 PA"}}, "datePosted": "2020-11-05T12:16:47+0000", "description": "&lt;p&gt;The group of hospitals Mid Essex Hospital Services NHS Trust, Southend University Hospital NHS Foundation Trust and Basildon &amp; Thurrock University Hospitals NHS Foundation Trust (MSEFT) have agreed a wide ranging transformation portfolio that forms part of the Mid and South Essex STP.&lt;/p&gt;\n&lt;p&gt;Reporting to the Head of Portfolio Management, the post holder will be responsible for the management of databases and for maintaining related information essential to the effective utilisation of space across the MSEFT and whole MSE STP systems estate.&lt;/p&gt;\n&lt;p&gt;Effective space utilisation will support delivery of an extensive and complex programme of new and remodelled estates infrastructure, both within the MSE Hospital Group and across the whole MSE STP. Included in this is a diverse MSEFT capital programme as part of a multi-year portfolio of projects, with a value of over £300m over the next five years. Projects range from minor works and backlog investment to major schemes of over £10m.&lt;/p&gt;\n&lt;p&gt;The post holder will be part a highly-skilled and motivated Capital project team (approx. 30 wte. internal staff and external project delivery specialists) across the MSEFT that links directly to the wider MSE STP: they will work as part of an integrated system to assist with the delivery of CCG and MSE capital projects, with seamless integration of new projects within the operations of existing services across both MSEFT and wider MSE STP.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoe BurroughsJob titleHead of Portfolio ManagementEmail addressjoseph.burroughs@southend.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend Hospital, Southend", "postalCode": "SS00RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Project Administrator - Estates Space Management Systems", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257630", "validThrough": "2020-11-18T23:59:59+0000"}