{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum (pro rata)"}}, "datePosted": "2020-10-05T14:12:30+0100", "description": "&lt;p&gt;&lt;strong&gt;Head of Therapies&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced Therapy Manager with a proven track record of leadership and change management to be part of our senior team.&lt;/p&gt;\n&lt;p&gt;Responsible for the operational management and strategic clinical leadership of the therapy staff across all three sites: Worcestershire Royal Hospital, Alexandra Hospital, Redditch and Kidderminster Treatment Centre, the role of Head of Therapy Services is pivotal to helping us to deliver efficient, integrated and patient-centred care.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work closely with other services within the acute trust as well as system partners to ensure that AHPs are integral to achieving our vision. You will work closely with the 3 Therapy Managers within Physiotherapy &amp; Orthotics, Occupational Therapy, Nutrition &amp; Dietetics and Speech &amp; Language Therapy to ensure that your teams are delivering against operational performance targets whilst embedding a culture of quality improvement, safety and staff empowerment. You will also need to work in partnership with external stakeholders to drive the strategy for AHPs, ensuring alignment across the system.&lt;/p&gt;\n&lt;p&gt;Education and development is a key priority and in this role you will be responsible for leading our AHP Faculty with a focus on developing the current and future Therapy workforce.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for anyone looking to enhance their leadership skills and wanting a new challenge.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information and an informal discussion please contact : Vicky Morris Chief Nursing Officer; Jo Kenyon Director of Operations – Specialty Medicine Tel : 01905 760001 Tel : 01905 733599 Email via PA : julie.everingham@nhs.net Email via PA: karenmcbride@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Worcestershire Acute Hospitals NHS Trust Charles Hastings Way Worcester WR5 1DD&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Countywide", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Head of Therapies", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213055", "validThrough": "2020-11-06T23:59:59+0000"}