{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-19T14:00:57+0100", "description": "&lt;p&gt;We are excited to offer an opportunity to a committed pharmacist to work within our mental health services in Wigan. We are looking for a pharmacist who have extensive experience in mental health and are a qualified non-medical prescribers or who are currently undertaking non-medical prescribing training.&lt;/p&gt;\n&lt;p&gt;You will be working as a non-medical prescriber in as part of the Wigan South Recovery and SDF Team. This is ideal for a pharmacist, who is keen to develop the role of pharmacist within in the Trust and provide a high quality service to our service users. You will work closely with the South Team integrating with specialist to provide excellent medicines optimisation to our service users.&lt;/p&gt;\n&lt;p&gt;Our friendly team provides an environment that encourages all staff to develop both the service and themselves.&lt;/p&gt;\n&lt;p&gt;The successful applicant(s) will&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work within a locality mental health team and medicines management team to contribute to delivery of local &amp; Trust objectives&lt;/li&gt;\n&lt;li&gt;Provide specialist mental health advice across a diverse population with complex psychiatric needs&lt;/li&gt;\n&lt;li&gt;Provide face to face medication reviews working as part of a wider multi-disciplinary team&lt;/li&gt;\n&lt;li&gt;Be a part of the innovative NWBH medicines management team benefiting from teaching, education and clinical supervision opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is an excellent opportunity for a pharmacist who has well-developed clinical and communication skills and a passion for delivering excellent care to our service users.&lt;/p&gt;\n&lt;p&gt;We can offer flexible working hours and are committed to enabling good work/life balance for our team.&lt;/p&gt;\n&lt;p&gt;The team provides remote out of hours advice only ‘on call’ services and the successful candidate will be required to be scheduled on an approximately 1 in 20 rota.&lt;/p&gt;\n&lt;p&gt;This is a medicines management role and there is no dispensary commitment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is subject to an enhanced check with adults barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50, the cost of which will be deducted from first salary.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBarry RobertsonEmail addressBarry.Robertson@nwbh.nhs.ukTelephone number07917 556074&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Atherleigh Park, Wigan", "postalCode": "WN7 1YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5008", "longitude": "-2.5222"}}, "title": "Advanced Clinical Pharmacist (Mental Health)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232604", "validThrough": "2020-11-06T23:59:59+0000"}