{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T10:01:08+0000", "description": "&lt;p&gt;&lt;br /&gt;Our specialist acute services are located across a number of sites within the beautiful county of Kent in Dartford, Maidstone and Canterbury. We are looking for dedicated Staff Nurses to join and be part of our forward thinking, progressive service, that invest in staff through continuous development and career progression. We are looking for enthusiastic motivated and flexible Staff Nurses to join our established Health Based Place of Safety team. &lt;br /&gt;&lt;br /&gt;Are you someone who has a passion for working with adults with acute mental illness? &lt;br /&gt;&lt;br /&gt;Do you want to develop your knowledge, skills and expertise to ensure that we deliver high quality, person centred care at the right time and in the right place?&lt;br /&gt;&lt;br /&gt;The Place of Safety team work closely with those detained under section 136 Mental Health Act 2007. It is an environment that is fast paced, but due to this, it has many different opportunities for skill development and learning. We work within the acute care group and therefore work closely with the acute wards within KMPT also. &lt;br /&gt;&lt;br /&gt;We take pride in our services which are underpinned by our values of respect, openness, accountability, working together, innovation and excellence.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kerri Scutts - 01622 725000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Priority House, Maidstone", "postalCode": "ME16 9PH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2734", "longitude": ".486413"}}, "title": "Staff Nurse (RMN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241935", "validThrough": "2020-11-09T23:59:59+0000"}