{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-22T10:15:19+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Mental Health Liaison Team Senior Practitioner – Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location – Gloucester Royal Hospital and Cheltenham General Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - £31,365 to £37,890&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week: 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NB This service will be delivered over 7 days a week, between the hours of 7.00am – 10.00pm including Bank Holidays and so this post will undertake weekend cover.&lt;/p&gt;\n&lt;p&gt;Gloucestershire Health and Care NHS Foundation Trust are pleased to be able a suitably qualified MH professional a substantive appointment with GHCNHSFT Mental Health Liaison Team. The successful applicant will gain valuable Mental Health Liaison experience within a well respected and successful service.&lt;/p&gt;\n&lt;p&gt;You will become part of an established team, providing mental health assessment and care within both Gloucester Royal and Cheltenham General Hospitals, working alongside other specialist practitioners and supported by the Consultants for Liaison Psychiatry.&lt;/p&gt;\n&lt;p&gt;You will participate in the provision of a responsive, needs-led mental health assessment and short term intervention service to individuals presenting to GRH/CGH with a range of mental health problems. A significant part of the role will be the assessment of individuals following an episode of self harm and signposting to other support services. There will also be a teaching, education and support role, assisting non mental health staff to respond to mental health needs more effectively.&lt;/p&gt;\n&lt;p&gt;You will hold a registered mental health qualification and be able to demonstrate post registration experience at Band 5 or above. You will need to provide evidence of continual professional deveopment.&lt;/p&gt;\n&lt;p&gt;This is a challenging role, but if you would like to be part of an exciting liaison service and have a track record of enthusiasm and a commitment to the development of nursing practice, then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the post, obtain further information or to arrange an informal visit, please contact Jim Welch (Clinical and Operational Lead Nurse) on 0300 422 5490 or email Jim.Welch@ghc.nhs.uk&lt;/p&gt;\n&lt;p&gt;Flexible working arrangements will be considered. Any request will be set against genuine operational requirements and limitations and it is not obligatory for a manager to accede to the request.&lt;/p&gt;\n&lt;p&gt;Please note that all candidates who declare themselves on their application form to be disabled and who meet the essential criteria for the post will be shortlisted in accordance with the Trust’s Two Ticks Pledge on disability.&lt;/p&gt;\n&lt;p&gt;The Trust reserves the right to close this vacancy when sufficient applications have been received.&lt;/p&gt;\n&lt;p&gt;If you do not hear from us within three weeks of the closing date you have probably not been shortlisted.&lt;/p&gt;\n&lt;p&gt;We are sorry we are unable to let you know the outcome of your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 24th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 25th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cheltenham", "postalCode": "GL51 7SU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.902", "longitude": "-2.11696"}}, "title": "Mental Health Liaison Senior Practitioner - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237839", "validThrough": "2020-11-24T23:59:59+0000"}