{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum (pro-rata)"}}, "datePosted": "2020-11-02T12:45:48+0000", "description": "&lt;p&gt;We have an exciting opportunity within the Respiratory Medicine directorate at Manchester University NHS Foundation Trust (Wythenshawe site) to appoint a new Deputy Directorate Manager. This is an established post and you will be working with a management team consisting of the Directorate Manager, another Deputy Directorate Manager, and four Assistant Directorate Managers/ Operational Managers. The Respiratory Directorate sits within the Heart and Lung Division.&lt;/p&gt;\n&lt;p&gt;The Cardiology Directorate is one of the biggest in the UK and consists of 25 consultants (both clinical &amp; academic), 20 junior doctors, and multiple teams of allied health professionals including an OPAT team, and Community Respiratory Team. Respiratory Medicine are responsible for 7 respiratory wards (3 general respiratory although this is under continuous review during the COVID pandemic) the regional cystic fibrosis centre, the North West Ventilation Unit, Pulmonary Oncology Unit, and a Programmed Investigation and Treatment Unit (PITU).&lt;/p&gt;\n&lt;p&gt;The respiratory subspecialties include cystic fibrosis, occupational respiratory disease, lung transplantation, severe asthma, allergy, COPD, long term non-invasive ventilation, sleep disorders, interstitial lung disease and chronic cough. The directorate is split into two so that the Deputy Directorate Managers cover their own subspecialties, providing managerial support for the clinical leads.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameElliot ShuttleworthEmail addressElliot.Shuttleworth@mft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Elliot Shuttleworth, Deputy Divisional Director - Cardiac&lt;/p&gt;\n&lt;p&gt;Elliot.Shuttleworth@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Deputy Directorate Manager - Cardiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252102", "validThrough": "2020-11-15T23:59:59+0000"}