{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38890", "minValue": "38890", "unitText": "YEAR", "value": "From £38,890 per annum, pro rata"}}, "datePosted": "2020-10-29T14:15:52+0000", "description": "&lt;p&gt;Are you an experienced CAMHS practitioner who is dedicated and passionate about improving child and adolescent mental health services? North Somerset CAMHS has recently transferred to be provided by AWP, joining Bristol and South Gloucestershire CAMHS. This has provided an exciting opportunity for service development and transformation, to recruit to several key posts within the team. AWP CAMHS is a busy, forward thinking and thriving CAMHS service with excellent CPD opportunities. The Community CAMHS service is committed to continuous improvement and providing therapeutic interventions to children, young people and families which are accessible, flexible and responsive.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be part of a stimulating and supportive multi-disciplinary child and adolescent mental health team, working with children, adolescents and their families with complex mental health needs. You will be required to carry out mental health assessments and risk assessments and offer evidence-based treatment for young people who are experiencing severe and enduring mental health difficulties, including those with learning difficulties. AWP is a forward thinking and inclusive Mental Health Trust with a strong commitment to clinical supervision and professional development within CAMHS. AWP CAMHS has developed a rolling programme of comprehensive in-house training incorporating the core CAMHS competencies framework that is open to all staff.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rosina Moore, Clinical Service Manager, on 0117 919 0330 email Rosina.Moore2@nhs.net&lt;/p&gt;\n&lt;p&gt;or via Caroline Sturgess, PA to CAMHS senior management team on 0117 3408601.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Weston-Super Mare", "postalCode": "BS23 3NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3397", "longitude": "-2.96851"}}, "title": "Band 7 Clinical Psychologist - Weston super Mare", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248663", "validThrough": "2020-11-22T23:59:59+0000"}