{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 to £73,664 pa"}}, "datePosted": "2020-11-05T10:45:19+0000", "description": "&lt;p&gt;&lt;strong&gt;‘To deliver excellence in health care through innovation and collaboration’&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mid Cheshire Hospitals NHS Foundation Trust (MCHFT) provides good quality, safe and effective healthcare to the people of Cheshire and beyond.  The Trust is also part of Central Cheshire Integrated Care Partnership (CCICP), a new and unique local health partnership that provides a range of community health services for people across South Cheshire and Vale Royal.&lt;/p&gt;\n&lt;p&gt;Significant investment in recent years has meant a great deal of clinical expansion has taken place at the Trust and it can now boast about having some of the very best clinical facilities. As such there is a drive to support this investment by creating the role of Head of Financial Services and Strategic Developments&lt;/p&gt;\n&lt;p&gt;The Head of Financial Services and Strategic Developments will be responsible for the provision of all aspects of the Trust’s financial control function and lead on key significant projects for the Trust. This will include  the  management and performance as the finance lead on projects. The successful candidate will be expected to liaise with regulators, executives and be cognisant of the framework for material projects from a regulatory perspective.&lt;/p&gt;\n&lt;p&gt;Strong leadership, interpersonal and negotiation skills will be essential, and you will bring the integrity and gravitas to influence. Technical astute and adaptable, you will bring your expertise and knowledge to advise the senior management to inspire your team to continue to achieve all they can.&lt;/p&gt;\n&lt;p&gt;For an informal chat please call our recruitment partner Martin Chadwick on 07971 929230 or email on martin@seymourjohn.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be aware that this post is still subject to AfC banding confirmation.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Head of Financial Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257291", "validThrough": "2020-11-20T23:59:59+0000"}