{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615  per annum pro rata"}}, "datePosted": "2020-10-01T16:01:52+0100", "description": "&lt;p&gt;&lt;strong&gt;Registered Nurse- Infectious Diseases, Band 5, salary between £24,214 and £30,112, ***RELOCATION SUPPORT AVAILABLE UP TO £4,000***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Gate 27B Infectious Diseases Suite is a specialist area caring for patients with a variety of conditions requiring isolation in a positive pressure ventilation rooms. We are a receiving unit for patients that may be suffering from diseases of high consequence such as NDM-1, MERS, VHF and MDR/XDR-TB. We also care for patient&#39;s with HIV whether newly diagnosed or acute complications.&lt;/p&gt;\n&lt;p&gt;We are attached to the Acute respiratory ward and there will be opportunity to rotate into this environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;range between from £24,214- £30,112 (AFC, band 5), dependent on experience, plus an additional supplement of 30% for Saturdays and between 8pm and 6am and a 60% supplement for Sundays and bank holidays for any work undertaken as a result of working on a shift out of hours. You will also be eligible for a wide variety of excellent NHS benefits.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHY APPLY?&lt;/strong&gt; This Registered Nurse position gives a fantastic opportunity for a role with-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Flexible interview options&lt;/strong&gt;- we can offer interviews via Skype or face to face- whichever is easiest for you&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional development- &lt;/strong&gt;rotational opportunities available within the sub specialities, providing a great opportunity to develop experience. There is also the opportunity to take part in a rotation programme across the medicine division in Complex Care, Specialist and Acute medicine.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A supportive, strong leader- &lt;/strong&gt;ward manager is a visible role model with an open door policy&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;An active teaching programme-&lt;/strong&gt;department has an active teaching programme and can provide the opportunity for those who wish to participate in a Link Nurse role, where you will be allocated responsibilities for a specific subject (I.e. Nutrition)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Excellent working facilities-&lt;/strong&gt; you will be based in the Brunel building at Southmead Hospital which has been named the best designed large hospital internationally at the European Healthcare Awards&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Award winning location-&lt;/strong&gt; Bristol has been consistently voted as one of the best places to live in the UK, with a rich history, thriving arts, music, gastronomic and independent retail scenes, excellent transport links and easy access to spectacular countryside and coastlines. If you prefer country, village or smaller town living, NBT is also easily commutable from a range of attractive locations in North Somerset, South Gloucestershire and South Wales (e.g. Portishead, Chepstow, Clevedon, Nailsea, Frome, Thornbury, Weston-Super-Mare)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Relocation support-&lt;/strong&gt; available for up to £4,000 for eligible applicants*. Please email nursing@nbt.nhs.uk for more details.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;THE ROLE:&lt;/strong&gt; In this Registered Nurse post, you will play a key role within a team of nursing staff in the delivery of evidence based patient-centred care. Key duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing nursing care for a group of patients with multiple complex needs&lt;/li&gt;\n&lt;li&gt;Assessing patients changing conditions and delegating care taking into account staff skills and competence&lt;/li&gt;\n&lt;li&gt;Administering medication and for some multiple complex intravenous therapies&lt;/li&gt;\n&lt;li&gt;Providing support in other areas of the medicine division as appropriate&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;YOU&lt;/strong&gt;: The successful candidate will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Registered Nurse&lt;/li&gt;\n&lt;li&gt;A team player who remains calm in pressured environments&lt;/li&gt;\n&lt;li&gt;Compassionate and strong&lt;/li&gt;\n&lt;li&gt;Able to recognise own limitations and to not be afraid to ask for support&lt;/li&gt;\n&lt;li&gt;Excited by the thought of a new challenge&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;APPLY NOW!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;***This role is eligible for our Internal Refer a Friend Scheme***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For more information on &lt;strong&gt;North Bristol Trust Careers&lt;/strong&gt;. Follow us on Facebook, Twitter and LinkedIn See our Nursing Career Video&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Interested in learning more? Join us at our upcoming event: &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nursing and ODP Careers: Spring Exhibition&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to work for one of the most modern hospitals in Europe?&lt;br /&gt;&lt;br /&gt;Would you like to gain FREE participatory CPD hours for revalidation, network with our clinical teams and learn more about our comprehensive preceptorship programme and wellbeing support available?&lt;br /&gt;&lt;br /&gt;Book your place on our Spring Careers Exhibition (1 February 2020)&lt;br /&gt;&lt;br /&gt;A chance for nurses and ODP&#39;s to: &lt;br /&gt;&lt;br /&gt;• Tour the Brunel Building&#39;s state-of-the-art facilities &lt;br /&gt;• Meet the clinical teams you could be working with&lt;br /&gt;• Explore our purpose-built clinical skills training space&lt;br /&gt;• Gain a chance to interview on the day&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Date: &lt;/strong&gt;01/02/2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Times&lt;/strong&gt;: 09.00 – 16.00&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Learning and Research Building, Southmead Hospital, Southmead Road, Bristol. United Kingdom. BS10 5NB.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Find out more:&lt;/strong&gt; &lt;strong&gt;Facebook event &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If it’s not for you, please share with anyone who may be interested- Thanks.&lt;/p&gt;\n&lt;p&gt;Unfortunately, due to the volume of applications, we are unable to reply to unsuccessful applications. However, we will give full feedback to all candidates who are interviewed.&lt;/p&gt;\n&lt;p&gt;*Relocation- Criteria for eligibility is&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Registered Nurse- Infectious Diseases-Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916209226", "validThrough": "2020-11-12T23:59:59+0000"}