{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "40000", "unitText": "YEAR", "value": "£40,000"}}, "datePosted": "2020-10-27T14:51:40+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Make a difference from day one!&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Practice Plus Group is working with NHS England to achieve elimination of hepatitis C as a significant public health problem by 2025. In collaboration with Gilead Sciences Ltd we have developed a simplified treatment pathway, opening directly acting antiviral treatment to all our hep C patients.&lt;br /&gt; &lt;br /&gt;It is crucial that we deliver this and bring the uptake of opt-out screening, diagnostic testing and linkage to care for all patients who test positive. Successful candidates will have an exciting opportunity to implement the Practice Plus Group policy and ensure that patients receive state of the art care.&lt;br /&gt; &lt;br /&gt;This has been shown to reduce all-cause mortality and there is anecdotal evidence of reduced re-offending in patients cured of hep C. You will work in collaboration with the Operational Delivery Networks in your region.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What do we need from you so you can do the job?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Registered Nurse you will work as part of an integrated healthcare team, utilising your clinical expertise, decision making and problem solving skills to provide skilled and evidence based nursing care for patients in the prison.&lt;br /&gt; &lt;br /&gt;You will work within your scope of practice, in accordance with Practice Plus Group and prison service policies and procedures in line with the NMC Code of professional conduct, performance and ethics for nurses and midwives. Take a key role in leading and developing the opt-out screening and diagnostic testing across the organisation and will use specialist/advanced nursing practice to manage a cohort of patients referred for specialist intervention, care and support.&lt;br /&gt; &lt;br /&gt;Demonstrate highly developed communication and leadership skills and, where necessary, develop advanced specialist knowledge and skills through innovative practice leading to the development of increasing levels of autonomy. Implement strategies to ensure practice development, education and competence assessment for other health care workers caring for patients with blood borne viruses (BBVs).&lt;br /&gt; &lt;br /&gt;You&#39;ll be responsible for leading and developing a team providing clinical supervision to all staff. You&#39;ll work within your scope of practice, in accordance with Practice Plus Group and prison service policies and procedures in line with the NMC Code of professional conduct, performance and ethics for nurses and midwives.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;In return for your hard work you will...&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Receive an annual salary of up to £40,000 depending on experience pro rota. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support. Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt;Next steps&lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by Basanti Lama, the Internal Recruiter for this role. The recruiter will submit your CV to the hiring manager and in turn Basanti will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job. For further information, please contact us on the details provided.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;More information&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full time role working 37.5 hours per week. The salary for this role is up to £40,000 - dependent on experience. Within your region, you will be required to work / visit your sites so flexibility with work location is key. When you are not on site, you will be based from home.&lt;br /&gt; &lt;br /&gt;The sites for this region are:&lt;br /&gt; &lt;br /&gt;HMP Bure&lt;br /&gt;HMP Highpoint&lt;br /&gt;HMP Hollesley Bay&lt;br /&gt;HMP Stockten&lt;br /&gt;HMP Warren Hill&lt;br /&gt;HMP Wayland&lt;br /&gt;HMP Whatton&lt;br /&gt; &lt;br /&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting. At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East of England", "postalCode": "CB89YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.137", "longitude": ".51069"}}, "title": "Regional BBV Lead Nurse - East of England", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245060", "validThrough": "2020-11-27T23:59:59+0000"}