{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Pro Rata Per Annum"}}, "datePosted": "2020-11-06T15:46:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Do you aspire to deliver excellent maternity care?&lt;/strong&gt; &lt;em&gt;This is the philosophy of Doncaster &amp; Bassetlaw Maternity services.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;There is an exciting opportunity for experienced midwives to explore your potential at Doncaster &amp; Bassetlaw Teaching Hospitals NHS Foundation Trust as a labour ward coordinator working across both of our sites&lt;/p&gt;\n&lt;p&gt;We are looking for clinically credible midwives with at least 2 years experience as a Band 6 labour ward midwife with a broad range of midwifery experience in the acute setting.&lt;/p&gt;\n&lt;p&gt;You will need to be self -motivated, dynamic and enthusiastic with excellent interpersonal skills and possess a distinct passion for Midwifery and a have a drive for ongoing learning and development.&lt;/p&gt;\n&lt;p&gt;As a Band 7 labour ward co-ordinator you will be the senior midwife and are responsible for the safe staffing of the maternity service, ensuring safe care is provided to all women.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Why join our team?&lt;/span&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;With a current delivery rate of 4700 births at home or on one of our two maternity sites, we have an ambitious plan across the Local Maternity System for transforming maternity services aligned with the Better Births recommendations in order to meet the needs of the women with in the local population.&lt;/p&gt;\n&lt;p&gt;As a unit we believe in choice. We are passionate about women centred care, and are committed to offering a wide range of experiences and development for our staff. We aim to provide the best possible standards of care in a warm, relaxed, friendly environment and we are committed to providing this in partnership with women, their families and the multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;If you have a passion for clinical excellence, patient care and your own career development, you’ll feel at home at Doncaster &amp; Bassetlaw Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join our team and support our vision of delivering the right care first time, every time. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Julie Todd - Matron for Intrapartum Services, Julie.todd10@nhs.net, 01302 642206&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster and Bassetlaw Hospitals", "postalCode": "DN2 5LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5308", "longitude": "-1.10926"}}, "title": "Labour Ward Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260437", "validThrough": "2020-11-22T23:59:59+0000"}