{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32000", "minValue": "32000", "unitText": "YEAR", "value": "£32,000 DOE"}}, "datePosted": "2020-10-26T15:19:26+0000", "description": "&lt;p&gt;&lt;strong&gt;The Disabilities Trust is hiring in The Maples!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you an Assistant Manager looking for your next exciting role? We have an opening for an Assistant Manager on full-time, permanent basis at The Maples.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to redefine and expand the team here at The Maples. We are looking for someone that is dynamic, innovative and compassionate to enable the people living here to have fulfilling lives.&lt;/p&gt;\n&lt;p&gt;The Maples is a purpose-built centre that provides accommodation and support to adults who have autism and learning disabilities. We support people in a person-centred way ensuring that they are at the heart of everything that we do.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for someone who is passionate about quality and delivering the best possible services to people.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As Assistant Manager, you will be a flexible member of the management team ensuring effective coordination of the service. You will assist in the management of a multidisciplinary workforce ensuring the Trust&#39;s policies, procedures and values are adhered to with due consideration to the regulations and outcomes surrounding registered services. Ensuring the care and support offered to service users is also a huge part of the role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main duties will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure the care and support offered to each person is of the highest quality, meeting individual needs sensitively and striving to enable service users to maximise their potential.&lt;/li&gt;\n&lt;li&gt;Demonstrate professional leadership and provide hands on management support and guidance, managing staff activities and influencing their practises and attitude.&lt;/li&gt;\n&lt;li&gt;Ensure all staff receives required supervision and personal development reviews, to promote their learning, as per The Disabilities Trust policies.&lt;/li&gt;\n&lt;li&gt;Identify the training needs of the staff and contribute to the Service Training Plan, including the organisation of appropriate inductions, emphasising the aims, value base and high-performance standards expected. This also may include carrying out staff training.&lt;/li&gt;\n&lt;li&gt;Assist and support the Service Manager in setting and monitoring of budgets, capital and revenue for each area within location.&lt;/li&gt;\n&lt;li&gt;Be prepared to meet regularly with local authority representatives, staff, clinicians, family and other stakeholders to ensure a multidisciplinary team approach to service provision.&lt;/li&gt;\n&lt;li&gt;Support the organisation with effective staff rotas ensuring staff meet their contractual requirements and personal objectives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary of up to £32,000&lt;/li&gt;\n&lt;li&gt;35 Hours a week&lt;/li&gt;\n&lt;li&gt;33 days holiday per year plus bank holidays&lt;/li&gt;\n&lt;li&gt;National discount scheme, including gym membership, dining out and shopping!&lt;/li&gt;\n&lt;li&gt;Excellent training and support&lt;/li&gt;\n&lt;li&gt;Group life assurance&lt;/li&gt;\n&lt;li&gt;Eye voucher scheme&lt;/li&gt;\n&lt;li&gt;Long service and staff awards&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Disabilities Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG4 9EY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4949", "longitude": "-.987208"}}, "title": "Assistant Manager - Reading", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243121", "validThrough": "2020-11-09T23:59:59+0000"}