{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-10-30T12:45:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 3 - Healthcare Support Worker &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Minor Injuries Units, Trowbridge and Chippenham &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 Hours per Week - Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you enjoy working in a busy environment where no two shifts are the same?&lt;/p&gt;\n&lt;p&gt;Would you like to work in a highly supportive team with excellent opportunities for development and progression?&lt;/p&gt;\n&lt;p&gt;Do you want to fully utilise and develop your clinical skills underpinned with funded training in Emergency Practice?&lt;/p&gt;\n&lt;p&gt;If so our Minor Injury Units are the place for you!&lt;/p&gt;\n&lt;p&gt;Wiltshire Health and Care have a variety of full and part-time Health Care Support Worker roles available within our two Minor Injury Units;&lt;/p&gt;\n&lt;p&gt;Our Minor Injury Units are based in Chippenham and Trowbridge, and  treat approximately 2000 patients across the service per month, making a real difference, providing care closer to home and avoiding admission to hospital wherever possible and appropriate.&lt;/p&gt;\n&lt;p&gt;Wiltshire Health and Care is committed to the development of staff and a programme of support and development will be put in place, tailor for all new starters,  to develop competencies, skills and knowledge, enabling progression on the career ladder.&lt;/p&gt;\n&lt;p&gt;You will be joining a multi-disciplinary team who pride themselves on their excellent team working and support of each other whilst treating a diverse range of conditions.&lt;/p&gt;\n&lt;p&gt;If you put patient care central to all you do and you have experience from working in an Emergency Department environment, have excellent wound care skills and are able to apply a variety of Plaster of Paris back slabs, or if you are keen to learn these skills, come for an orientation visit.&lt;/p&gt;\n&lt;p&gt;Our roles will provide you with a challenging but rewarding opportunity to utilise your skills and to deliver excellent care to a wide group of patients.&lt;/p&gt;\n&lt;p&gt;To apply for our roles, please visit NHS Jobs and Search for Wiltshire Health and Care or if you would like any further information, or to arrange an informal visit, please contact Barry Iedema, Senior Clinical Lead, 07392 280 263 or email: b.iedema@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wiltshire Health and Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chippenham and Trowbridge", "postalCode": "SN15 2AJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4525", "longitude": "-2.12672"}}, "title": "Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250222", "validThrough": "2020-11-13T23:59:59+0000"}