{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "37890", "unitText": "YEAR", "value": "£37,890 to £44,503 per annum (pro rata)"}}, "datePosted": "2020-10-29T10:02:04+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Community Nurse – Learning Disabilities –1 x Band 7 full time /part time will be considered and 1 x band 7 fixed term for 12 months &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit two Registered Learning Disabilities band 7 Nurses to work within the South Hub of the Community Learning Disabilities service for Birmingham Community Healthcare NHS Foundation Trust, the post is currently based at the Greenfields in Kings Norton. You will join an established team of clinicians providing nursing interventions for patients with a diagnosis of learning disability with a range of complex health needs including physical health, mental health and behaviour. You will be part of a community nursing team working within the wider learning disabilities multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced clinician to take the challenge of delivering a high standard of nursing intervention within the learning disability service. Do you have the skills and sound clinical knowledge to manage a caseload of patients and provide robust support and clinical leadership to your nursing and multi-disciplinary team colleagues? Are you a dedicated and motivated individual with experience and the ability to work independently? We are looking for an organised and efficient clinician with good communication skills to work within this busy team. If you enjoy variety and a fast pace of work within a patient focused setting, this could be the job for you.&lt;/p&gt;\n&lt;p&gt;You will have access to a comprehensive induction, training and development opportunities.&lt;/p&gt;\n&lt;p&gt;You will be entitled to join the NHS Pension scheme.&lt;/p&gt;\n&lt;p&gt;Do you want to join a forward thinking and innovative organisation which puts its patients first?&lt;/p&gt;\n&lt;p&gt;IMPORTANT&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulie HortonJob titleClinical Operational ManagerTelephone number0121 466 3900&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Greenfields, Birmingham", "postalCode": "B30 3QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4124", "longitude": "-1.90439"}}, "title": "Band 7 Senior Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247823", "validThrough": "2020-11-12T23:59:59+0000"}