{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21892", "minValue": "21892", "unitText": "YEAR", "value": "From £21,892 per annum"}}, "datePosted": "2020-10-23T11:16:22+0100", "description": "&lt;p&gt;This is a fixed-term/secondment until 31st March 2021. If you are an internal candidate on a substantive contract you may only apply for a secondment. Please ensure you have the support of your current line manager before applying. At the end of your secondment you will return to your current post at your current grade.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within LIFT Psychology Swindon to join our team as an Employment Advisor. You will work within the Swindon LIFT Psychology Service as Employment Support alongside a Senior Employment Advisor and Clinical lead to be an integral part of the LIFT Psychology Employment Pathway.&lt;/p&gt;\n&lt;p&gt;Supporting the successful LIFT Psychology IAPT+ service, providing specialist Employment interventions for people with mild to moderate mental health needs as they journey towards work or education, or seek to retain existing employment, working directly with adults with mental health needs who require support to gain or retain employment. You will carry out vocational assessments and compile an action plan with each individual working closely with LIFT Psychology therapists, and carry a caseload of individuals on their chosen route to employment, training or volunteering.&lt;/p&gt;\n&lt;p&gt;With customer service experience, you will have empathy with/and or experience of working with people who have experienced mental health issues and ideally have an understanding of the barriers they face in accessing employment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:  Amy Derham, Senior Employment Advisor on Amy Derham 01793 836836 or lift.psychology@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LIFT Psychology, Swindon", "postalCode": "SN1 4GB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5504", "longitude": "-1.79639"}}, "title": "Band 4 Employment Advisor - Old Town Surgery, Swindon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240272", "validThrough": "2020-11-08T23:59:59+0000"}