{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "37890", "unitText": "YEAR", "value": "£37,890 per annum pro rata"}}, "datePosted": "2020-10-21T15:30:15+0100", "description": "&lt;h1&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h1&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Are you an experienced CAMHS clinician looking for a new challenge and opportunity to join a service at a time of exciting change?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Can you work with children, young people and their parents/carers, across the age range, providing evidence based intervention in the community?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Would you like to experience life in one of the UK’s most beautiful areas, with exciting cities, charming countryside and magnificent coastlines?&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for Band 6 Bank CAMHS Mental Health Practitioners who may be based in various locations across Devon (e.g. Exeter, Torquay, Dartington, Barnstaple) who can bring skills, experience and enthusiasm to meet the needs of children/ young people with complex emotional and mental health needs in the community.We are particularly interested in people with experience in supporting young people and their families in crisis, and those who would have the relevant skills and experience to join our eating disorder pathways.&lt;/p&gt;\n&lt;p&gt;In this important role you will use your extensive skills and experience as a mental health practitioner to deliver high quality care, developing and sustaining relationships across agencies and working as a core member of a multi-disciplinary team. Using both evidence based practice and routine outcome measures, you will use a strength-based approach to work collaboratively with service users, in line with CYP-IAPT key principles.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Children and Young People say…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“We would like the people who work for Child and Family Health Devon to be understanding, patient and respectful. They should be trustworthy and make us feel safe and comfortable. It is important that they use their skills and experience to listen carefully in a non-patronising and non-judgemental way. When staff are positive and friendly, they help to create an environment that is informal and without pressure”.&lt;/em&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will be an experienced and qualified CAMHS professional with a core registrable qualification. You will be able to work alongside colleagues in a multi-disciplinary team and develop relationships across agencies to meet the needs of children and families. The ability to adapt communication and intervention style to meet individual need is important and you will have knowledge of child development and child protection procedures.&lt;/p&gt;\n&lt;p&gt;Managing risk and being able to assess mental health presentations in the community is a core part of this role, responding to both urgent and routine, planned and unplanned need. You will be required to work flexibly across a range of clinical, community and home-based settings to meet the needs of the child. Some roles may involve working across evenings and weekends.&lt;/p&gt;\n&lt;p&gt;You will be responsible for providing therapeutic intervention that is strengths-focused, evidence-based and tailored to meet the needs of the child/young person and their family/carer. Supervision of more junior staff and trainees is expected to be part of your role as you share your skills and knowledge with those around you.&lt;/p&gt;\n&lt;p&gt;Personally, we’re looking for individuals who are passionate about working with children/ young people in the community with the confidence to intervene to meet a range of mental health needs and a desire to work with others to continually improve what we do.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date is to be confirmed.&lt;/strong&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;In this Bank role with Devon Partnership NHS Trust, you will be working with Children and Family Health Devon who have been tasked with catalysing the collaboration and integration across the full health, education, care and voluntary sector to have a long-lasting impact on every child and family’s future health, happiness and aspirations. Children and Family Health Devon is part of an Alliance that is unique and brings together six leading providers of adult and children’s community, acute and mental health services in Devon, along with key voluntary sector organisations and academic partners.&lt;/p&gt;\n&lt;p&gt;This Alliance has designed a system-wide service model to deliver integrated, coordinated support wrapped around the child, young person and family. It builds on our strong relationships across education, health, social care and voluntary sector services in Devon, and, most importantly, it has been developed and refined in partnership with children, young people and their families/carers.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Living here&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Devon provides a unique, varied and beautiful environment. The coastal areas of North and South Devon provide excellent opportunities for water sports. The National Parks, Dartmoor and Exmoor, are havens for country lovers. Exeter is a thriving University city offering culture and city life. There are excellent rail, road and air connections, with a regional airport in Exeter.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Devon and Torbay", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "CAMHS Bank Mental Health Practitioners", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237086", "validThrough": "2020-11-30T23:59:59+0000"}