{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-20T16:31:01+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Details&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Job Title &lt;strong&gt;Matron&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Department &lt;strong&gt;Critical care Unit&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Site &lt;strong&gt;Trust Wide Services&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Salary &lt;strong&gt;Band 8a&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Hours &lt;strong&gt;5 hours&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Contract Type &lt;strong&gt;permanent&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About the Role….&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working closely with the Lead Nurse, the Clinical Lead and Clinical Business Unit Team the post holder will have the line management responsibility for The ICU services Trust Wide to include Critical care Outreach, pain management, Sepsis team and Resuscitation services. The post holder will provide strategic leadership and vision to the service. He/she will have a specific brief to develop nursing practice Trust wide ensuring that the standards are consistent and based on best practice.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we’re looking for…..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder should be visible, motivational and inspirational. He/she should be a forward thinking, ambitious, determined registered nurse who wants to lead and manage the Lincolnshire service at a time of considerable change and development. Your management skills and experience should be extensive and demonstrate success in previous roles. This is the chance for you to determine the future shape of this service. You should be a registered nurse with considerable clinical experience, appropriate Critical care qualifications, leadership roles and service development. The post holder must be a team player, an effective communicator and negotiator, able to work under pressure, self-motivated and able to engage the team effectively in change.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return, we will support your personal development and continued professional development, and offer you to be part of our team. The NHS also offers one of the most competitive benefits package with regards to Annual Leave, Pensions and a comprehensive range of NHS Discounts. The Division supports new ways or working with a keen interest in developing new roles, rather than the traditional model of delivery of care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;United Lincolnshire Hospitals NHS Trust recognises that everyone is different, and values the unique contribution that individual experiences, knowledge and skills make in delivering quality healthcare and becoming a model employer.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to Equal Opportunities and improving working lives. We welcome applications from members of the minority ethnic groups and people with disabilities who are currently underrepresented in our workforce. All applications will be treated on merit. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Safeguarding Children and Vulnerable Adults&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;United Lincolnshire Hospitals Trust is committed to safeguarding and promoting the welfare of children, young people and adults, both as service users and visitors to Trust premises. All staff have a responsibility to safeguard and promote the welfare of children and adults.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: John Boulton&lt;/p&gt;\n&lt;p&gt;Job title: Lead Nurse TACC&lt;/p&gt;\n&lt;p&gt;Email address: john.boulton@ulh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07771834161&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln County Hospital, Lincoln", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Matron - Critical Care TACC - Band 8a - Permanent", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235269", "validThrough": "2020-11-10T23:59:59+0000"}