{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-06T16:41:25+0000", "description": "&lt;p&gt;ARE YOU AN EXPERIENCED PHYSIOTHERAPIST WITH A PASSION FOR WORKING WITH ADULTS IN THE COMMUNITY?&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for experienced physiotherapists to join our friendly community Physiotherapy bank across East Cheshire.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a team of enthusiastic and dynamic bank physiotherapists with proven experience in the rehabilitation of adults within the community setting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the service:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are an exciting team, offering community adult rehabilitation in a variety of care communities across East Cheshire. These bank posts will be located across the entire geographical area covering one of the 5 care communities which are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Congleton and Holmes Chapel&lt;/li&gt;\n&lt;li&gt;Knutsford&lt;/li&gt;\n&lt;li&gt;Chelford, Handforth, Alderley Edge and Wilmslow&lt;/li&gt;\n&lt;li&gt;Bollington, Disley and Poynton&lt;/li&gt;\n&lt;li&gt;Macclesfield&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We work holistically within a large multidisciplinary team of Physiotherapists, Nurses, Occupational Therapists, GP&#39;s and Social workers. We work in a variety of different settings including nursing homes, residential homes, patients own homes and two rehabilitation wards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for &lt;/strong&gt;&lt;strong&gt;HCPC registered Physiotherapists, with previous experience of working in the NHS and the community &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will have experience of working with older Adults in the Community settings.&lt;/li&gt;\n&lt;li&gt;Be self-motivated with excellent communication skills and the ability to work both autonomously and as part of a multi-disciplinary team.&lt;/li&gt;\n&lt;li&gt;You will have proven assessment and discharge planning skills, a positive attitude to risk management, and be committed to supporting the development of the therapy team within a designated care community.&lt;/li&gt;\n&lt;li&gt;Have a full UK driving licence and access to a vehicle, or be able to demonstrate means of meeting the travel requirements of the post.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post is Bank&lt;/p&gt;\n&lt;p&gt;Hours per week: Zero&lt;/p&gt;\n&lt;p&gt;Closing Date: 15th November 2020&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced with Barred list Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Kat McDaid Job title Community Therapy Team Manager CHAW &amp; BDP Email address katherine.mcdaid@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Clinical Specialist Physiotherapist - Community Therapies", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260644", "validThrough": "2020-11-15T23:59:59+0000"}