{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36566", "minValue": "31756", "unitText": "YEAR", "value": "£31,756 - £36,566 per annum  DoE"}}, "datePosted": "2020-10-28T11:35:41+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a strong, dynamic leader to join our Family Support team at Sue Ryder, St John’s Hospice.&lt;br /&gt; &lt;br /&gt; St John’s is a Sue Ryder hospice, based in the beautiful village of Moggerhanger – Just outside of Bedford. We’re here for people aged 18 and over who are living with conditions like cancer, heart failure and lung disease.&lt;br /&gt; &lt;br /&gt; We offer a range of support to patients and their families including inpatient care in our 15 bed hospice, a day service for those with long-term conditions and support in the community through our befriending, Hospice at Home and bereavement services.&lt;br /&gt; &lt;br /&gt; We are keen to hear from applicants who have a solid background in Counselling and/or family therapy who can strategically lead and shape this exciting service. Our family support services provide psychological, spiritual and psychosocial support for patients, families, carers and staff to maximise comfort and wellbeing. We are ideally looking for someone who has experience with working in Bereavement and it is essential that you are able to demonstrate solid management and leadership skills in order to be considered for this position.&lt;br /&gt; &lt;br /&gt; To be considered for this post, you should be an accredited counsellor / psychotherapist with the BACP/UKCP and preferably have training in family therapy. Experience as a social worker is desirable for this role however not essential.&lt;br /&gt; &lt;br /&gt; If you feel you have some of the skills we need but not all please contact us directly to discuss the possibility of joining us in a developmental role.&lt;br /&gt; &lt;br /&gt; For more information or to arrange an informal visit, please contact Victoria White, Head of Clinical Services – 07787740702 or email victoria.white@suerydercare.org&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Benefits:&lt;/p&gt;\n&lt;p&gt;• Company pension scheme&lt;/p&gt;\n&lt;p&gt;• 25 days holiday - rising to 30 with length of service plus bank holidays&lt;/p&gt;\n&lt;p&gt;• Enhanced maternity and paternity pay&lt;/p&gt;\n&lt;p&gt;• Enhanced sick pay&lt;/p&gt;\n&lt;p&gt;• Continuation of NHS pension (T&amp;Cs apply)&lt;/p&gt;\n&lt;p&gt;• NHS holiday honoured (Up to a maximum of 30 days, T&amp;Cs apply)&lt;/p&gt;\n&lt;p&gt;• Corporate discount with hundreds of retailers and services&lt;/p&gt;\n&lt;p&gt;• Staff discount of 10% on new goods online at shop.sueryder.org&lt;/p&gt;\n&lt;p&gt;• Season ticket loan&lt;/p&gt;\n&lt;p&gt;• Cash referral bonus scheme of up to £500&lt;/p&gt;\n&lt;p&gt;• Cycle to work scheme&lt;/p&gt;\n&lt;p&gt;• Free parking, tea and coffee and subsidised meals&lt;/p&gt;\n&lt;p&gt;• Wellbeing centre and free will writing service&lt;/p&gt;\n&lt;p&gt;• Development opportunities for all through our structured development framework&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Sue Ryder provides hospice and neurological care for people facing a frightening, life-changing diagnosis. We do whatever we can to be a safety net for our patients and their loved ones at the most difficult time of their lives. We see the person, not the condition.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moggerhanger", "postalCode": "MK44 3RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1281", "longitude": "-.335766"}}, "title": "Head of Family Support", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246372", "validThrough": "2020-12-06T23:59:59+0000"}