{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 Per annum"}}, "datePosted": "2020-11-06T10:31:13+0000", "description": "&lt;p&gt;An exciting opportunity has emerged for a high quality candidate to join the critical care team at Wythenshawe Hospital as a Consultant in Intensive Care Medicine.&lt;/p&gt;\n&lt;p&gt;Manchester University NHS Foundation Trust (MFT) was formed on 1st October 2017 following the merger of Central Manchester University Hospitals NHS Foundation Trust (CMFT) and University Hospital of South Manchester NHS Foundation Trust (UHSM).&lt;/p&gt;\n&lt;p&gt;The Trust comprises of Manchester Royal Infirmary, Manchester Royal Eye Hospital, University Dental Hospital of Manchester, St Mary’s Hospital for Women, The Royal Manchester Children’s Hospital, Trafford General Hospital, Wythenshawe Hospital, Altrincham Hospital and Withington Community Hospital.&lt;/p&gt;\n&lt;p&gt;MFT is in partnership with the Manchester Academic Health Science Centre (MAHSC) which provides patients and clinicians with rapid access to the latest discoveries, and improving the quality and effectiveness of patient care.&lt;/p&gt;\n&lt;p&gt;Through extensive local, national and global collaborations, MAHSC is becoming a major biomedical and health hub, providing clinical and research leadership and helping healthcare organisations to reap the benefits of research and innovation to drive improvements in care.&lt;/p&gt;\n&lt;p&gt;Manchester University Hospitals NHS Foundation Trust is a major UK teaching hospital with an exceptionally strong academic and research base.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Steve KnightAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Steve Knight, Clinical Director for Intensive Care Medicine (Wythenshawe)&lt;/p&gt;\n&lt;p&gt;0161 291 6420&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Hospital, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Consultant in Intensive Care in Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259232", "validThrough": "2020-11-19T23:59:59+0000"}