{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-06T15:46:31+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and motivated individual to join our friendly team as a Team Leader in the Diabetes Department at York Teaching Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The post holder will line manage administrative staff within the team and will ensure that all staff receive the necessary support, feedback and training to deliver an efficient, high-quality service.&lt;/p&gt;\n&lt;p&gt;As the successful applicant you should have experience of managing administrative staff, including exposure to a range of line management responsibilities such as recruitment, supervision, appraisals, and attendance management. You should have a positive and can do attitude. Be flexible, adaptable and willing to learn new skills.&lt;/p&gt;\n&lt;p&gt;You will be expected to provide management support to the Diabetes Team by contributing to an efficient and effective service within a very busy environment. You will work within strict departmental and national guidelines with responsibility for receiving, maintaining and providing manual and electronic data containing sensitive and confidential information.&lt;/p&gt;\n&lt;p&gt;Educated to GCSE level or equivalent including Maths and English at grade C or above, you must be able to demonstrate: excellent computer/IT skills to include Microsoft Office Packages, good organisational skills, the ability to work to high quality standards, paying attention to detail and accuracy,&lt;/p&gt;\n&lt;p&gt;As a Team Leader you will be required to demonstrate a full understanding of patient confidentiality and information governance, supporting the team in ensuring compliance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be advised that this vacancy may close prior to the closing date stated due to the high level of applications it may attract. If you would like to apply, please submit your application promptly to avoid disappointment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application!&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Name: Bradley Stevens&lt;/p&gt;\n&lt;p&gt;Job title: Service Manager&lt;/p&gt;\n&lt;p&gt;Email address: Bradley.Stevens@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: (01904) 721120&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Additional contact information&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Tara Kadis - Diabetes Specialist Nurse Team Leader&lt;/p&gt;\n&lt;p&gt;Telephone number: (01904) 726324&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Team Leader (Diabetes Admin Services)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260444", "validThrough": "2020-11-15T23:59:59+0000"}