{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a. pro rata"}}, "datePosted": "2020-11-03T14:47:02+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;eHospital – be part of the team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cambridge University Hospitals is the first UK hospital to implement the Epic electronic patient record (EPR) system and an opportunity has come up to be part of the team responsible for the Interfaces that support the Epic EPR. This is an exciting and challenging role, at the heart of the transformation of clinical services providing high-quality care supported by a world class electronic patient record system. You will be provided with training to achieve accreditation in the Interfaces Epic module. We welcome applications from individuals whom have strong technical and analytical capabilities, enjoy problem solving, and understand the nature of modular work in large and complex organisations.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This vacancy closes on: - 15 November 2020 Midnight&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel. For further details of our fantastic benefits please refer to the attachment below - CUH Benefits. Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered. We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAdriaan van LeeuwenJob titleeHospital Senior Team LeaderEmail addressadriaan.van-leeuwen@addenbrookes.nhs.ukTelephone numberPlease emailAdditional contact information&lt;/p&gt;\n&lt;p&gt;Indra Sathish - eHospital Team Lead- Interfaces 01223 256556&lt;/p&gt;\n&lt;p&gt;Adriaan van Leeuwen - eHospital Senior Team Leader - 01223 254698&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital - Division Corporate, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Senior Epic Application Analyst - Interfaces", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254411", "validThrough": "2020-11-15T23:59:59+0000"}