{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 pa"}}, "datePosted": "2020-10-22T13:15:30+0100", "description": "&lt;p&gt;In this role, you will provide leadership and direction to the Technical Assurance team and line manage a group of Quality Project Specialists. You will work with teams across NHS Blood and Transplant (NHSBT), particularly the Digital Data and Technology Services (DDTS) team, to ensure safe, efficient and effective delivery of large scale Programmes and Projects relating to IT systems.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Your activities support a range of operational users and DDTS staff at locations across the country, understanding their needs, to:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- advise on software assurance and validation (including at supplier locations),&lt;br /&gt;- develop, improve and implement systems that ensure we comply with regulations and standards, &lt;br /&gt;- maintain our services to hospitals and make donation a great experience.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This includes listening, watching, sensitively challenging, and growing an understanding of NHSBT systems, their interfaces and integration, and proposing innovative solutions.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will have a proven, expert understanding of the regulatory requirements and scientific aspects that the functionality supports and how this aligns to NHSBT service delivery, enabling meaningful systems development and validation conversations. By applying continuous improvement methods, we keep pace with changing technology and performance expectations.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The normal working hours for this role are 37.5 hours per week. However, travel and time away from base, involving working irregular hours and overnight stays, may be required, with prior notice.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is a national vacancy, as such the location is to be agreed with the successful applicant at one of our Blood Centre’s. London HCAS will be provided, where applicable.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For an informal discussion in relation to this role, please contact Mark Whelan via email at: mark.whelan@nhsbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;This vacancy will close at 23:59 on Sunday 8th November 2020.&lt;/strong&gt;&lt;br /&gt;Interview dates are to be confirmed.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National - by agreement", "postalCode": "BS34 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5179", "longitude": "-2.56889"}}, "title": "National Quality Manager - Technology Assurance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238618", "validThrough": "2020-11-08T23:59:59+0000"}