{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum plus Outer HCAS"}}, "datePosted": "2020-11-03T14:47:42+0000", "description": "&lt;p&gt;This role is based in Bromley but will be expected to travel to out of borough placements.&lt;/p&gt;\n&lt;p&gt;This is an opportunity for an experienced Registered Nurse who has experience in NHS Continuing Healthcare (CHC) and has leadership skills to work as a senior member of the Continuing Healthcare team, with staff who are highly motivated and skilled nurse assessors. Primarily assessments will be carried out in the Bromley area with some travel to out of borough placements.&lt;/p&gt;\n&lt;p&gt;The role will be providing clinical advice, operational management skills and supervising a team of nurse assessors. As a lead Nurse you will be expected to promote evidence-based best practice and provide clinical expertise to decision making processes regarding eligibility and funding, have excellent assessment writing skills that portray the holistic health needs of patients.&lt;/p&gt;\n&lt;p&gt;You will be able to manage your time and the time of others within the team and you should be able to work in a pressurised environment. You will have relevant experience in complex case management and drawing on previous skills, knowledge and be confident about what is required to deliver an excellent CHC service. You will need to demonstrate a high level of interpersonal and communication skills, including the application of tact and diplomacy in challenging expectations and complaints, to liaise effectively with colleagues, health and social care professional, patient’s family members and others.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Organisational Context&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;With effect from the 1st April 2020, NHS South East London Clinical Commissioning Group is now the statutory body responsible for commissioning healthcare services to south east London’s 1.9 million residents of the boroughs of Bexley, Bromley, Greenwich, Lambeth, Lewisham and Southwark. We are part of the South East London Integrated Care System helping to shape the future of the NHS in South East London. Our aim is to work with our partners to improve care and health outcomes for local people. We will do that by:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensuring that the services we commission for local people are high quality, safe and accessible.&lt;/li&gt;\n&lt;li&gt;Working with our partners across health and social care, including those in the voluntary and independent sectors, to plan and improve services.&lt;/li&gt;\n&lt;li&gt;Ensuring there are effective relationships with organisations that deliver care, so it is joined up in ways that are in the best interests of those using these services.&lt;/li&gt;\n&lt;li&gt;Making sure that the money we receive from the Government is used to provide the right services, to the right people and at the right time.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;South East London CCG covers all GP practices in the area and is overseen by a governing body, which is responsible for making decisions about healthcare. The governing body includes GPs, nurses, a hospital doctor and other healthcare professionals and patient representatives. This is supported by other prime committees including Borough Based Boards which will have delegated responsibility for commissioning local services.&lt;/p&gt;\n&lt;p&gt;Organisations that commission healthcare should make certain, through their service specifications and contracts, that the safeguarding arrangements of their providers are effective.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS South East London CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128195"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Global House, Bromley, BR2 7EH", "postalCode": "BR2 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3772", "longitude": ".01045"}}, "title": "Lead CHC Nurse Assessor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254422", "validThrough": "2020-11-17T23:59:59+0000"}