{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14658", "minValue": "14658", "unitText": "YEAR", "value": "£8.72 p/h"}}, "datePosted": "2020-10-22T15:15:22+0100", "description": "&lt;p&gt;Care Assistant&lt;br /&gt;Full time/Bank available&lt;br /&gt;starting from £8.72 p/h&lt;/p&gt;\n&lt;p&gt;Shift Patterns are 7.15 am - 8.15 pm&lt;/p&gt;\n&lt;p&gt;We are looking for compassionate, dedicated and experienced Care Assistants to join our dedicated team in our BRAND NEW Sue Ryder Neurological Care Centre Lancashire.&lt;/p&gt;\n&lt;p&gt;Sue Ryder Neurological Care Centre Lancashire will be a purpose-built, state of the art neurological care centre based in Eastway, Preston. The main centre will includes 40 fully accessible en-suite rooms, over three floors, with an additional four supported living apartments on site.&lt;/p&gt;\n&lt;p&gt;Our Carers will be offered support and development to start on the path to a rewarding and fulfilling career in Neurological care with amazing opportunities to also progress through Neurological rehabilitation.&lt;/p&gt;\n&lt;p&gt;The Care Assistant responsibilities will be:&lt;/p&gt;\n&lt;p&gt;• To promote choice in the delivery of care and support&lt;br /&gt;• Making decisions to enhance the individuals experience.&lt;br /&gt;• Ensure accurate reporting and documentation&lt;br /&gt;• Promote Sue Ryder Values and continued High standards.&lt;/p&gt;\n&lt;p&gt;You must be flexible with excellent people skills and be a team player. Successful applicants must have recent experience in the delivery of care in a similar environment and have or be willing to gain an NVQ 2 in Health and Social care.&lt;/p&gt;\n&lt;p&gt;If you want to make the first step to your next exciting carer change at apply now as we have interview now available.&lt;/p&gt;\n&lt;p&gt;Sue Ryder offer a large range of benefits and pay enhancements including:&lt;br /&gt;• 25 days holiday rising to 30 with service plus bank holidays &lt;br /&gt;• Option to buy and sell holiday up to five days &lt;br /&gt;• Private pension matched at 5% &lt;br /&gt;• Enhanced Maternity Benefits &lt;br /&gt;• Cash referral bonus scheme for certain roles &lt;br /&gt;• Carers leave policy &lt;br /&gt;• 24 hour employee assistance line for free advice on work, family and personal life &lt;br /&gt;• PeoplePerks - discounts with hundreds of retailers and services that can amount to an average annual saving of GBP 350 &lt;br /&gt;• Staff discount of 15% on new goods at the online shop &lt;br /&gt;• Free onsite parking and good transport links &lt;br /&gt;• Staff loans and company car loans &lt;br /&gt;• Free uniform &lt;br /&gt;• Wellbeing centre and free will writing service &lt;br /&gt;• Opportunities to progress through our development framework structure&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lancashire", "postalCode": "PR5 6AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.71", "longitude": "-2.66211"}}, "title": "Care Assistant Days", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239068", "validThrough": "2020-11-26T23:59:59+0000"}