{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28988", "minValue": "26365", "unitText": "YEAR", "value": "£26,365 - £28,988 per annum Inc."}}, "datePosted": "2020-11-05T14:16:18+0000", "description": "&lt;p&gt;&lt;strong&gt;About the role and service:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within South London and Maudsley Mental HealthTrust for a Plumber Fitter to join our Estates team within Maudsley Hospital.&lt;/p&gt;\n&lt;p&gt;We provide NHS care and treatment for people with mental health problems. We also provide services for people who are addicted to drugs or alcohol. As well as serving the communities of South London, we provide specialist services for people from across the UK and beyond.&lt;/p&gt;\n&lt;p&gt;Locally, we deliver mental health services for people living in the London boroughs of Croydon, Lambeth, Lewisham and Southwark; and substance misuse services for residents of Bexley, Lambeth, Greenwich and Wandsworth.&lt;/p&gt;\n&lt;p&gt;We provide clinical services in seven London boroughs, with a combined population of nearly 2 million people covering an area of 168 square miles, rich in culture, diversity and architecture.&lt;/p&gt;\n&lt;p&gt;Please ensure that you read and understand the Job Description and Personal Specification attached to the role. Your Statement in Support should reflect the requirements specified as your application will be judged against these criteria.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located at Denmark Hill less than 5 minutes from the train station (zone 2). We also provide services and operate across other locations, such as London boroughs of Croydon, Lambeth, Lewisham and Southwark; and substance misuse services for residents of Bexley, Lambeth, Greenwich and Wandsworth.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Javard Toossi&lt;/p&gt;\n&lt;p&gt;Estates Officer | Estates and Facilities&lt;/p&gt;\n&lt;p&gt;020 3228 83409&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maudsley Hospital, Denmark Hill, London, SE5 8AZ, London", "postalCode": "SE5 8AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4687", "longitude": "-.091415"}}, "title": "Plumber Fitter", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258072", "validThrough": "2020-11-19T23:59:59+0000"}