{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25066", "minValue": "23525", "unitText": "YEAR", "value": "£23,525 - £25,066 per annum"}}, "datePosted": "2020-10-30T08:45:18+0000", "description": "&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice. To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place.  Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition.  The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Public Health England (PHE) is an executive agency of the Department of Health providing; strategic leadership, research, advice and support for Government, local authorities and the NHS in protecting and improving the nation’s health.&lt;/p&gt;\n&lt;p&gt;The post is based in the Reference Microbiology Clinical Services Unit. The work of microbiology reference laboratories includes clinical microbiological advice and diagnosis, complex reference, service delivery, methodology development, microbial epidemiology, investigation of national and uncommon outbreaks, response to international health alerts, and advice on the risks posed by various infections. Clinical samples and isolates are received from public health departments, the National Health Service and commercial laboratories across the UK and internationally for specialist testing, characterisation and susceptibility testing.&lt;/p&gt;\n&lt;p&gt;The post holder will undertake basic microbiology and molecular laboratory duties under supervision, guided by standard operating procedures, protocols or systems of work based on training provided, and taking into account the operational requirements of the laboratory. They will make judgments, plan activities and contribute to service development. They will develop the knowledge of how to deal with a range of non-routine activities, such as work allocation, problem solving for a team or area of work. They will be able to use the LIMS and perform general laboratory duties and to complement other members of the team.&lt;/p&gt;\n&lt;p&gt;The post holder should have a good standard of general education or significant equivalent previous proven experience. Experience of working in a laboratory including using Pre Analytical techniques applicable to Bacterial, Serological or Molecular methods is desirable.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see job description for competencies.&lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vasiliki Zianta, Vasiliki.Zianta@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London, Colindale", "postalCode": "NW9 5HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5948", "longitude": "-.254078"}}, "title": "Healthcare Scientist Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249371", "validThrough": "2020-11-13T23:59:59+0000"}