{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T14:46:10+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Description: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post&lt;/strong&gt;: Band 5 Occupational Therapist&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Base&lt;/strong&gt;: Rehabilitation and High Support Directorate (RHSD).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main Contacts:&lt;/strong&gt; Internal or external contacts&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To provide occupational therapy assessment, treatment and review of service users who experience serious mental Illness (SMI). The post holder will work across the three on site wards at Prospect Place and be responsible for an allocated caseload (under supervision). You will be expected to use your own initiative and clinical reasoning to plan and carry out treatment, run treatment groups and to contribute to the MDT management and treatment of our service users.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Main Duties &amp; Responsibilities&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Clinical:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To carry out appropriate assessment and treatment of allocated patients.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To plan, conduct and participate in various treatment sessions in response to assessment and need.&lt;/li&gt;\n&lt;li&gt;To provide clinical and other support to multidisciplinary team.&lt;/li&gt;\n&lt;li&gt;To attend appropriate clinical meetings.&lt;/li&gt;\n&lt;li&gt;To carry out 1:1 and group sessions.&lt;/li&gt;\n&lt;li&gt;To promote recovery and social inclusion programmes.&lt;/li&gt;\n&lt;li&gt;MDT:&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;To work in close liaison with other disciplines involved in the care and treatment of patients allocated to you.&lt;/li&gt;\n&lt;li&gt;To work as an integrated team member on the unit.&lt;/li&gt;\n&lt;li&gt;To participate in supervision and training.&lt;/li&gt;\n&lt;li&gt;To provide in-service training.&lt;/li&gt;\n&lt;li&gt;To develop and maintain community links to increase social inclusion and community integration. Professional:&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;To comply with the professional code of conduct for Occupational Therapy.&lt;/li&gt;\n&lt;li&gt;To promote Occupational Therapy core skills in your area of work.&lt;/li&gt;\n&lt;li&gt;To maintain strict confidentiality regarding any information concerning patients.&lt;/li&gt;\n&lt;li&gt;To be aware of and adopt correct procedures and departmental policies when treating patients, dealing with visitors, students and other staff.&lt;/li&gt;\n&lt;li&gt;To establish and maintain professional relationships with patients, their relations and friends and to support and promote patients’ rights and identity.&lt;/li&gt;\n&lt;li&gt;Financial:&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To be responsible for the day to day management of petty cash and its use to promote rehabilitation.&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Research and Development:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To promote evidence based practice in own work and within the MDT.&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To support research and audit with the RHSD.&lt;/li&gt;\n&lt;li&gt;Staff management:&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;To line manage technical instructor.This job description is not exhaustive, but is intended to give an overall picture of the role. Other duties within the general scope of the post may be required from time to time. The duties of the post and job description can be reviewed through the agreed process.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;General Duties of all post holders&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To undertake any other reasonable duty, which is appropriate to the band, when requested by Senior Staff&lt;/li&gt;\n&lt;li&gt;To be familiar with and comply with all Trust and departmental policies, procedures, protocols and guidelines&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To be aware of and work towards the Trusts strategic goals&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Standards of Business Conduct &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The post holder will be required to comply with the organisations standing order and standing financial instructions and at all times, deal honestly with the organisation with colleagues and all those who have dealing with the organisation including patients, relative and suppliers&lt;/li&gt;\n&lt;li&gt;The post holder must ensure that their behaviour and interests inside and outside work do not conflict with their Trust position, duties and/or responsibilities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;The post holder must comply with and support the development of the performance standards within the service/department to ensure the service is responsive to and meets the needs of its customers&lt;/li&gt;\n&lt;li&gt;The post holder will be required to develop and maintain good working relationships with all patients, service users, staff, contractors and where appropriate, members of the public.&lt;/li&gt;\n&lt;li&gt;The Trust aims to maintain the good will and confidence of its own staff, patients, service users, NHS contractors and the general public. To assist in achieving this objective it is essential that at all times, the post holder carries out their duties in a courteous, sympathetic and professional manager&lt;/li&gt;\n&lt;li&gt;All post holders who are members of a professional body must comply with standards of professional practice / conduct. It is the post holders’ responsibilities to ensure they are both familiar with and adhere to these requirements and maintain their professional membership to the relevant body&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Equality and Diversity &amp; Equal Opportunities &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The post holder must carry out all duties and responsibilities of the post in accordance with the Trust’s Equal Opportunities and Equality and Diversity policies, avoiding unlawful discriminatory behaviour and actions when dealing with colleagues, service users, members of the public and all other stakeholders&lt;/li&gt;\n&lt;li&gt;The post holder must promote awareness of and respect for equality and diversity in accordance with Trust policies and procedures&lt;/li&gt;\n&lt;li&gt;The post holder is responsible for treating all staff, patients, service users, NHS contractors and the general public with dignity and respect at all times&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Safeguarding&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Appointments to regulated and controlled activities requ&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prospect Place, Birch Hill Hospital, Rochdale", "postalCode": "OL12 9QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6431", "longitude": "-2.12634"}}, "title": "Occupational therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240995", "validThrough": "2020-11-06T23:59:59+0000"}