{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-02T15:32:16+0000", "description": "&lt;p&gt;We are currently looking for enthusiastic, highly motivated Registered Nurses to work within our Stroke Unit at Sandwell and West Birmingham Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Stroke and Neurology Care within SWBH is currently undergoing huge changes in preparation of our move the Midland Metropolitan Hospital in 2022. We have a new management team across both the acute and rehab wards. We have a Stroke Alert Nurse pathway where in a Stroke Nurse support the Acute Stroke pathway in the emergency department to ensure we provide high quality acute Stroke Care and have developed a structured development programme with some of our team commencing Advanced Clinical Practitioner training.&lt;/p&gt;\n&lt;p&gt;We are a dedicated MDT on a 25 bedded acute stroke unit, consisting of 2 Hyper Acute Stoke Bays. We admit patients directly from the emergency department and Acute Medical Unit. performing thrombolysis treatment where appropriate, and arranging for patients to be sent for mechanical thrombectomy at the Queen Elizabeth Hospital when required. All patients then go on to receive rehabilitation on tour rehabilitations ward and also where appropriate care in the community provided by the Early Supported Discharge team.&lt;/p&gt;\n&lt;p&gt;As a Registered Nurse, you will work as a team member on the acute stroke unit a long side a large ward-based multi-disciplinary team and working with the team in the Emergency Department to provide seamless Stroke Care&lt;/p&gt;\n&lt;p&gt;We have within our unit a stroke-specific MDT including Physiotherapists and Occupational Therapists, SALT, a Clinical Psychologist and a Stroke Research Nurse. We have gym facilities on the ward.&lt;/p&gt;\n&lt;p&gt;We have a high risk TIA clinic on the ward facilitated by our experienced multi skilled care team which currently runs 7 days a week.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to undertake training, complete competencies successfully and keep their practice up to date. We offer extended role opportunities and encourage staff to fulfil their potential. The candidate is expected to work flexibly and offer assistance across the stroke unit.&lt;/p&gt;\n&lt;p&gt;The ward offers a supportive and learning environment, which endeavors to constantly develop the service, in order to ensure its patients can receive the highest quality and most up to date care. You will need a high level of self-awareness and be dedicated in improving patient care and delivery care in a timely manner as per Sentinel Stroke National Audit Programme (SSNAP) Key Performance Indicators. Sandwell Stroke Service are committed in providing exceptional stroke care and is part of the SSNAP national programme as well as having links with Queen Elizabeth hospital for thrombectomy care.&lt;/p&gt;\n&lt;p&gt;We want to develop the future of Stroke Nursing, the up and coming Ward Managers, Matrons, Specialist Nurses, Advanced Clinical Practitioner and even the next Chief Nurse.&lt;/p&gt;\n&lt;p&gt;If this sounds like you come and join our team&lt;/p&gt;\n&lt;p&gt;Matron Michael Brennan&lt;/p&gt;\n&lt;p&gt;Ward Manager Cherie Marzan&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMichael BrennanEmail addressmichael.brennan2@nhs.netTelephone number01215073366/07971520343&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Bromwich", "postalCode": "B71 4HJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5274", "longitude": "-1.98788"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252637", "validThrough": "2020-11-16T23:59:59+0000"}