{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-10-23T15:24:51+0100", "description": "&lt;p&gt;This role sits within the Finance Department and is responsible for the delivery of Payroll and Pension services to the organisation. The team provides support to over 3500 employees and managers along with a large team of bank staff. Our main aim is to deliver a “Customer Service Excellence” to ensure all our customers receive a worry free payroll service&lt;/p&gt;\n&lt;p&gt;As a very experienced Payroll Technician, you will be working as part of a busy team providing advanced administrative support to all Sirona employees. The role is supporting both monthly and weekly employees, assisting them with enquiries and communications by phone, email and in person.&lt;br /&gt;The post holder will be allocated their own individual group of approximately 450 employees and working independently under limited supervision will be responsible for all processes relating to their employment. They will be responsible for the start to finish of their payroll cycle whilst with Sirona. The post holder is also required to be a visible positive role model throughout Sirona and to always be striving to ensure we provide the best service possible&lt;/p&gt;\n&lt;p&gt;Based within the Payroll Department initially at Kingswood Civic Centre and subject to review, to work 37.5 hours (over 5 days a week). This role will be permanent. The core hours of the department are 9am to 5pm but we do offer some flexibility if required.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS15 9TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4627", "longitude": "-2.50131"}}, "title": "Payroll Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241100", "validThrough": "2020-11-08T23:59:59+0000"}