{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-10-30T16:45:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Registered General Nurse/ Deputy Ward Manager – Inpatient Older Peoples Service (Mental Health)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic Band 6 Registered General Nurse to work in our mental health Older Peoples Inpatient Service located at St Charles Hospital, Ladbroke Grove. This post entails taking a lead role in maintaining high quality physical healthcare on the ward and working with and supporting the other Nurses, HCA&#39;s and other MDT staff to ensure high quality standards around physical health care. We are looking for applicants who have completed their preceptorship, mentorship, have experience at Band 5 preferably working with Older People and are able to deputise for the Ward Manager, lead a team, and work creatively and effectively in the clinical environment. Successful candidates will demonstrate progressive skills in leadership, supervision, clinical practice, service development, risk assessment and risk management. We are seeking nurses who are also friendly, approachable, compassionate and motivated with good communication skills. If you are committed to providing person centered recovery focused care with a sound knowledge of best practice within an Older Peoples Inpatient Service, this could be the opportunity for you.&lt;/p&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;p&gt;An opportunity to work within and around the heart of London&lt;/p&gt;\n&lt;p&gt;Excellent progression through various career pathway opportunities&lt;/p&gt;\n&lt;p&gt;Support and guidance with Revalidation&lt;/p&gt;\n&lt;p&gt;Flexible working&lt;/p&gt;\n&lt;p&gt;Band 6 Development Days and Leadership Programmes&lt;/p&gt;\n&lt;p&gt;On-going supervision and appraisals with optional coaching available&lt;/p&gt;\n&lt;p&gt;Tailored education and development programmes.&lt;/p&gt;\n&lt;p&gt;Opportunities to be part of innovative QI programmes on an AIMs accredited ward.&lt;/p&gt;\n&lt;p&gt;Hidden Gem and annual award ceremonies&lt;/p&gt;\n&lt;p&gt;Excellent staff benefits.&lt;/p&gt;\n&lt;p&gt;Our benefit packages are amongst the best in London, and include:&lt;/p&gt;\n&lt;p&gt;Relocation package, childcare vouchers, health and wellbeing services, season ticket loans and cycle-to-work scheme&lt;/p&gt;\n&lt;p&gt;Our nurses work within our supportive nursing structure in developing and implementing assessments, treatments and recovery focused care for patients. You will receive on-going support from your peers and team managers. You will also receive individual supervision as well as support in reflective practice groups. Our teams are well established, dynamic, with a strong commitment to multi-disciplinary working, service development and continued professional development. We also provide on-going in-house training and workshops for dedicated staff, to enable discussion, reflection and education which lead to the delivery of the best care for our patient groups.&lt;/p&gt;\n&lt;p&gt;Based in the busy inner and outer London boroughs, we have a lively and vibrant working atmosphere, with quick and easy transport links to all our sites. Our size and resources enable us to offer a range of attractive benefits as well as unparalleled support, opportunities, education and development for staff at all levels. This includes an extensive portfolio of academic and clinical courses and programmes ranging from on-going personal development through to clinical excellence and leadership skills.&lt;/p&gt;\n&lt;p&gt;CNWL (Central and North West London NHS Foundation Trust) has almost 7,000 staff providing integrated healthcare to a third of London’s population, Milton Keynes and areas beyond. CNWL prides itself on its investment in staff both in terms of developing career skills but also its commitment to staff health and wellbeing.&lt;/p&gt;\n&lt;p&gt;CNWL is recognised locally, nationally and internationally for providing high quality, innovative healthcare. We aim to employ only the best people, and our experts are frequently called upon to contribute to national health strategy and policy, and many models of our care have been adapted for use in other countries.&lt;/p&gt;\n&lt;p&gt;As a Foundation Trust we involve service users, carers, the public, staff and partner organisations in the way that we are run and our future development. If you are interested in becoming a member of our Foundation Trust please visit the get-involved section of our website.&lt;/p&gt;\n&lt;p&gt;Due to the high level of response we receive for some of our vacancies, we may expire any of them prior to the advertised closing date. We advise you to submit your application as soon as possible. Candidates shortlisted for interview will be informed via the email address registered with NHS Jobs.&lt;/p&gt;\n&lt;p&gt;Employment on Agenda for Change contracts with CNWL are subject to a contractual 13 week probationary period.&lt;/p&gt;\n&lt;p&gt;Interview date: 09/12/ 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSamuel Opoku-MensahJob titleKershaw Ward ManagerEmail addresss.opoku-mensah@nhs.netTelephone number02082067220Additional contact information&lt;/p&gt;\n&lt;p&gt;Samuel Opoku-Mensah: Ward Manager&lt;/p&gt;\n&lt;p&gt;s.opoku-mensah@nhs.net&lt;/p&gt;\n&lt;p&gt;02082067220&lt;/p&gt;\n&lt;p&gt;or Sean Mooney: Matron&lt;/p&gt;\n&lt;p&gt;seanmooney@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Charles Hospital, London", "postalCode": "W10 6DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5224", "longitude": "-.217393"}}, "title": "Band 6 Registered General Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250981", "validThrough": "2020-11-15T23:59:59+0000"}