{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata"}}, "datePosted": "2020-11-03T12:46:27+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Birmingham&lt;/strong&gt;&lt;strong&gt; and Solihull Mental Health Foundation Trust&lt;/strong&gt;&lt;/span&gt;&lt;strong&gt;Adults of Working Age Division&lt;/strong&gt; &lt;strong&gt;Clinical/Counselling Psychologist or Psychological Therapist with equivalent applied psychological practice qualification (Band 8a)&lt;/strong&gt;&lt;strong&gt;Lyndon and Newington CMHTs, Solihull ICCR Hub &lt;/strong&gt;&lt;strong&gt;12 month fixed term contract to cover maternity leave (1.0 wte)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a suitably qualified and experienced clinician to join our team in Solihull Integrated Community Care and Recovery Hub (ICCR). We encourage applicants from Clinical/Counselling Psychology and also applied Psychological Professionals who feel that they meet the person specification. This is a fixed term 12 month long contract to cover maternity leave within our team.&lt;/p&gt;\n&lt;p&gt;Solihull ICCR Hub provides a comprehensive range of community services focused around our two Community Mental Health Teams based at Lyndon Clinic and the Maple Leaf Centre. We are a dynamic and forward thinking service where psychologists are strongly placed to lead on service development and delivery across all elements of the care pathway. We have an established track record in service innovation and support a diverse range of clinical and academic interests with strong links to university programmes in the region. We have a well-developed CPD programme and have robust supervision and professional line management systems. Job plans include generous CPD allowance and protected time for research and innovation.&lt;/p&gt;\n&lt;p&gt;We are looking for a skilled and highly experienced clinician who can work effectively as part of a multilevel psychology service to provide a range of clinical services. You should have experience of working with service users with complex mental health and behavioural needs. You should be familiar with the needs of a diverse BAME community and working in areas of high socioeconomic deprivation. You will be expected to guide, oversee and deliver expert and effective psychological services assessments, formulations and interventions within a community mental health team locality and will provide psychological advice, support and training to MDTs where needed. This role requires providing direct and indirect clinical work, contributing towards the delivery of clinical programmes, teaching, training and supervising. The post holder is expected to be involved in service development and review, audit and research.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Trust is committed to equal opportunities. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Emma CotesJob titlePrincipal Clinical PsychologistEmail addressemma.cotes@nhs.netTelephone number0121 3014800 or 07985 882068&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maple Leaf Centre, Solihull", "postalCode": "B37 7JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4696", "longitude": "-1.73925"}}, "title": "Band 8a Senior Clinical or Counselling Psychologist/Clinical Speciali", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254029", "validThrough": "2020-11-16T23:59:59+0000"}