{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 per annum pro rata"}}, "datePosted": "2020-10-19T15:17:02+0100", "description": "&lt;p&gt;&lt;strong&gt;Join us for our digital Nursing and ODP Engagement event!&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Dates: &lt;/strong&gt;17 November 2020&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Location: &lt;/strong&gt;Digital Event&lt;/li&gt;\n&lt;li&gt;Book your place: HERE&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;So, you’re eager to learn more about nursing careers at North Bristol NHS Trust. Here are some of the reasons you should attend our upcoming digital engagement event...&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You’ll have a unique opportunity to gain access to hear online presentations from our clinical divisions: Medicine, ASCR (Anaesthesia, Surgery, Critical Care and Renal) and NMSK (Neurosciences and MusculoSkeletal). We will also have a presentation from our bank team- NBTeXtra.&lt;/li&gt;\n&lt;li&gt;You’ll gain an insight into life at our Trust, including our award-winning health and wellbeing support, our commitment to equality, diversity and inclusion and our aspirations to be leaders in the field of sustainable healthcare.&lt;/li&gt;\n&lt;li&gt;You’ll hear about our comprehensive Preceptorship support programme available for Newly Qualifying Nurses.&lt;/li&gt;\n&lt;li&gt;You&#39;ll have the opportunity to book an interview for the day or an informal video call with our divisional recruitment leads.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At our online event, you’ll learn our trust itself is pioneering, progressive and proud. For example…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our health and wellbeing initiat­­­ives, devised by our dedicated staff wellbeing team, encompass lifestyle support, physical support and psychological support, and have been nationally recognised by REBA.&lt;/li&gt;\n&lt;li&gt;We value staff feedback; in the results of our 2019 staff survey, our response rate was &lt;strong&gt;higher than the national average &lt;/strong&gt;and highlighted we had improved in all the areas staff told us were priorities in 2018. Out of the 90 questions asked, we had made 73 improvements from the previous year and 69% of staff would recommend our organisation as a place to work (6% better than the national average).&lt;/li&gt;\n&lt;li&gt;Our nurses do not shy away from a challenge in aid of Southmead Hospital Charity. They cycle, run, row and race in aid of a fantastic cause, or sing in our staff choir and compete in ‘Southmead Does Strictly’.&lt;/li&gt;\n&lt;li&gt;We’re committed to supporting staff on their career journey with us offering personalised training packages and bespoke specialty rotations. We also support internal transfers for those who wish to gain experience in a new specialty or further develop their skills.&lt;/li&gt;\n&lt;li&gt;Our staff are consulted on equity issues across the trust within equality and development groups, and are given the mentoring and support to succeed. Our trust supports the development of Bristol’s LGBT+ manifesto and a case study of good practice has been reported to NHS England in response to a government review of public services and Trans people.&lt;/li&gt;\n&lt;li&gt;Our clinical environment is award-winning in its approach to healthcare design; each patient room has a view, many of which are naturally ventilated and 75% of rooms in our Brunel Building are single and en-suite. With nurses in mind, our clinical spine carefully separates staff and patient areas, with a generous staff canteen extending out to a rooftop terrace.&lt;/li&gt;\n&lt;li&gt;Bristol is consistently voted the best place to live in the UK, with vibrant local music, arts and gastronomic scenes. Our city boasts a wide range of state-of-the-art shopping, recreation and leisure facilities, a wealth of great local family days out, and excellent transport links.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Right, that’s enough about us… let’s focus on you. Are you…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An experienced nurse with the passion and talent to progress clinically and professionally, eager to learn more about our trust?&lt;/li&gt;\n&lt;li&gt;A registered nurse eager to channel your experience into a new and exciting role, keen to discover what our engagement days have to offer?&lt;/li&gt;\n&lt;li&gt;A newly qualified or newly qualifying nurse ready to take the leap from theory to the clinical setting, looking to find out more about our preceptorship, wellbeing programme, and training opportunities?&lt;/li&gt;\n&lt;li&gt;A student nurse in final year of study, looking to secure your first qualified role?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Yes, that’s me! When is the event and how do book my place?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Date:&lt;/strong&gt; Tuesday 17 November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Online event only&lt;/p&gt;\n&lt;p&gt;Book your place HERE.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Looking to interview on the day?&lt;/em&gt;&lt;/strong&gt; Please submit your application on this advert and a member of our Talent Acquisition Team will be in contact to book your interview.&lt;/p&gt;\n&lt;p&gt;Follow us on social media to join in the conversation and gain an insight into (search @NBTNursing on Twitter, Facebook, Linkedin and Instagram)&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTalent Acquisition TeamEmail addressNursing@nbt.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Email &lt;strong&gt;Nursing@nbt.nhs.uk&lt;/strong&gt; for more information about this event.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Digital Event - Online only, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Digital Event: Nursing and ODP Engagement Event - 17 November 2020 -", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232890", "validThrough": "2020-11-17T23:59:59+0000"}