{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum (pro rata)"}}, "datePosted": "2020-11-03T17:05:40+0000", "description": "&lt;p&gt;We are looking for an enthusiastic pharmacist who is passionate about patient care to join our pharmacy team on a 3 year fixed term contract.&lt;/p&gt;\n&lt;p&gt;This post includes rotations through various specialties at each of our hospital sites such as medicine for the elderly, general surgery, paediatrics and acute admissions. You will also gain experience in working in our dispensaries, technical services and medicines information department. You will take part in our emergency out of hours service, late night and weekend service on a rotational basis.&lt;/p&gt;\n&lt;p&gt;Training and support will be provided by learning from our senior and specialist pharmacists and working alongside our team of experienced medicines optimisation technicians, enabling you to gain knowledge and experience in clinical pharmacy. You will be provided with a wide range of opportunities to build your foundation portfolio and will be expected to complete a Post Graduate Diploma in clinical pharmacy. Opportunities may also be available to undertake a non-medical prescribing qualification.&lt;br /&gt; &lt;br /&gt; Please note the closing date may be brought forward if sufficient applications are received. Please complete your application as early as possible to avoid disappointment&lt;br /&gt; &lt;br /&gt; For further information please contact Caroline Lofthouse, Advanced Clinical Pharmacist Education &amp; Training on 01924 541537.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Foundation Pharmacist +EDC", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254880", "validThrough": "2020-11-17T23:59:59+0000"}