{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 gross per annum"}}, "datePosted": "2020-10-14T10:18:06+0100", "description": "&lt;p&gt;An exciting opportunity has come up for a 1.0wte 8b clinical psychologist to join our well-established psychology team within the Central Cluster Adult Acute Services. You will be predominately working within the crisis resolution home treatment team alongside two assistant psychologists and a large multi-disciplinary team. However, you will also sit within the wider acute psychology team which covers all five adult inpatient wards and comprises of psychological therapists, a clinical psychologist and assistant psychologist providing:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Specialist assessment, formulation and brief interventions&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Consultancy and training across the acute service line&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Supervision and support to MDT colleagues&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Helping to promote and work with senior management in providing more psychologically informed ways of working/pathways within the acute service&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Contributing to relevant trust wide projects such as the personality disorder implementation project.&lt;/p&gt;\n&lt;p&gt;Within this you will be expected to provide strong clinical leadership and have skills and expertise in working with adults who present with complex issues who are experiencing high levels of distress. Linked to this, you will be confident in helping the teams make informed judgements and decisions regarding risk in a decisive manner.&lt;/p&gt;\n&lt;p&gt;We are a friendly, welcoming team who come with a range of specialist interests and therapy approaches. There are several exciting developments and opportunities arising in acute services currently. These include the development of a DBT therapeutic approach that links with community teams and their full therapy programme, contributing to the Personality Disorder Implementation project with training opportunities and the new build anticipated to be completed in 2024. We also have strong links with the UEA doctorate course, providing teaching and regularly taking trainees.&lt;/p&gt;\n&lt;p&gt;We would happily consider part-time or full-time hours, a shared post or, secondment for 12 months.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interviews are to be confirmed, candidates may only be given a minimum of 3 days’ notice, please note this date is provisional and may be subject to change. You will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Covid-19 update&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are working hard to maintain usual recruitment process however please be aware that we may ask you to be interviewed via skype rather than in person.  Please also bear with us as we endeavour to recruit as many people as we can in unprecedented times.&lt;/p&gt;\n&lt;p&gt;We would be very pleased to talk to you about the post to see if this is potentially a post that would suit you.  For more information please contact Jamie Durrance, Clinical Psychologist on 07557744742 or jamie.durrance@nsft.nhs.uk  &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hellesdon Hospital, Norwich", "postalCode": "NR6 5RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6676", "longitude": "1.25423"}}, "title": "8b Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225688", "validThrough": "2020-11-08T23:59:59+0000"}