{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 per annum, pro rata"}}, "datePosted": "2020-11-06T08:54:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Child &amp; Adolescent Psychiatrist, West Berkshire CAMHS &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; We are looking for an enthusiastic and forward-thinking Consultant Child &amp; Adolescent Psychiatrist to join our innovative and experienced community specialist CAMHS team in West Berkshire.&lt;/p&gt;\n&lt;p&gt;Due to vacancies created by new service developments and staff changing roles we have a total of 6PAs available covering generic community CAMHS and neurodevelopmental work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would encourage interested applicants to contact Dr Tamsin Marshall, Medical Lead for CAMHS (07990 946840) for more information and informal discussions.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; Berkshire Healthcare CAMHS runs a pathway model with locality-based specialist community teams working alongside county-wide specialist care pathway teams including a CBT pathway for anxiety &amp; mood disorders, neurodevelopmental services, EIP, CAMHS Eating disorders, a Rapid Response team and our 9 bedded inpatient unit.&lt;/p&gt;\n&lt;p&gt;This post is in West Berkshire CAMHS, Lower Henwick Farm House, Thatcham a unique setting, housed in a Georgian Farmhouse. The building was converted into a clinic 15 years ago and retains many original features which give it a more family friendly feel. We also have use of the building’s gardens which clinicians have used in their work or for breaks in the summer months. There are a selection of clinic rooms as well as a conference room and separate office space for admin and clinicians. The Farm House has plenty of free parking for patients and staff.&lt;/p&gt;\n&lt;p&gt;West Berkshire CAMHS is located within 300m of the main A4 which links Reading to Newbury and sits on the crossroads of the M4 and the A34, which offer quick access across southern England. London, Reading, Southampton, Portsmouth, Bristol, Oxford and Swindon are all within an hour&#39;s drive of the area. It is a diverse area incorporating the best features of town and attractive countryside.&lt;/p&gt;\n&lt;p&gt;The West Berkshire team are a cohesive team of professionals including Psychologists, Family Therapist, Art Therapist, nurses, CBT therapist, assistants and a very experienced admin team who run our clinics with great expertise and humour. Our staff are our greatest asset and we value our Consultant Psychiatry colleagues, working closely with them with appreciation of their expert skills and thoughtful reflection around young people and their families. We are a supportive and stable team. Clinicians like working in West Berkshire and tend to stay due to the positive team culture.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; Berkshire Healthcare has been awarded an overall ‘Outstanding’ rating from the CQC, with both its Community and In-patient CAMHS services achieving this rating. The Trust was recognized as an ‘Outstanding’, well-led, organization in its latest CQC inspection, which found that: ‘Managers across Berkshire Healthcare promoted a positive culture that supported and valued staff, creating a sense of common purpose based on shared values.’&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. We are pioneers in compassionate leadership and Quality Improvement, with a strong commitment to creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt;Our 4 locality-based CAMHS Specialist Community Teams, of which West Berkshire is one, have recently embarked on the Trust Quality Management Improvement System training, with Berkshire Healthcare the first community and mental health trust to employ this innovative way of improving the working culture for patients and staff.&lt;/p&gt;\n&lt;p&gt;As a Global Digital Exemplar, Berkshire Healthcare will provide you with an excellent working environment through our ambitious plans to improve ways of working using new technology. You will have access to our Trust-wide Learning and Development programme and will be supported in your career and personal growth with opportunities to help you to build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel. Berkshire Healthcare places great value in its relationship with Reading University. CAMHS services benefit in particular from strong working relationships with the School of Psychology and Clinical Language Sciences which has an international reputation for research into child development and psychopathology. We also have close links with the Centre for Autism and the Centre for Integrative Neuroscience and Neurodynamics and there are opportunities for interested candidates to develop research in a range of areas.&lt;/p&gt;\n&lt;p&gt;There is a friendly supportive CAMHS Consultant group who share peer supervision including a monthly case discussion group, two PDP groups and in house CPD programme. There is a wider supportive network of psychiatrists across the trust and CPD opportunities to meet psychiatrists from other specialities.&lt;/p&gt;\n&lt;p&gt;Consultants share the out of hours on call rota of approx. 1:11 frequency.&lt;/p&gt;\n&lt;p&gt;Applicants should have a higher specialist training in Child and Adolescent Psychiatry in an approved training post, and must be at least within 6 months obtaining their CCT at the time of interview.&lt;/p&gt;\n&lt;p&gt;*Please note; you may be called to interview before the closing date*&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Tamsin Marshall, Medical Lead for CAMHS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel: 07990 946840&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lower Henwick Farm House, Thatcham", "postalCode": "RG18 3AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4096", "longitude": "-1.28695"}}, "title": "Consultant Child &amp; Adolescent Psychiatrist, West Berkshire CAMHS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258943", "validThrough": "2020-11-22T23:59:59+0000"}