{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 Per Annum"}}, "datePosted": "2020-11-02T11:45:19+0000", "description": "&lt;h1&gt;Highly Specialised Pharmacist&lt;/h1&gt;\n&lt;p&gt;Portsmouth Hospitals University NHS Trust are looking to recruit to a dedicated and enthusiastic clinical pharmacist to manage the clinical service to Critical Care, Anaesthetics and Theatres (CHAT). This is a fantastic opportunity to work with a forward thinking, multi-professional team to ensure we deliver the highest quality of care to patients within the speciality.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In post you will be an integral part of the critical care and pharmacy teams providing a vital clinical service to the 24 bedded critical care wards and theatres. You will attend daily critical care ward rounds, provide expert medicines advice and ensure patients have timely access to essential medicines. As medicines expert you will support the critical care department in the management and governance of their locally developed electronic prescribing system and IV pump library to ensure safe administration of medicines. You will use your knowledge and skills to educate and train staff in pharmacy and throughout CHAT on medicines management including supporting the rotational pharmacist in critical care and Pre-Registration pharmacists. Working closely with colleagues you will ensure local policies, guidelines and practice support the teams to deliver the best evidence based care to our patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Candidate:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will have hospital pharmacy experience in a relevant clinical field.&lt;/li&gt;\n&lt;li&gt;You will possess a relevant postgraduate clinical qualification and be committed to ongoing CPD within the field&lt;/li&gt;\n&lt;li&gt;You will be a dynamic individual able to effectively collaborate with colleagues in a way that motivates and inspires others.&lt;/li&gt;\n&lt;li&gt;You will possess the necessary professionalism and drive to work to an excellent standard within requested time frames.&lt;/li&gt;\n&lt;li&gt;You will be able to work flexibly and act as role model to all colleagues.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What We Offer You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The opportunity to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Join a dynamic team in a progressive organisation committed to improving patient care.&lt;/li&gt;\n&lt;li&gt;Make a significant difference to clinical outcomes and patient safety for patients of Portsmouth Hospitals University Trust (serving a population of around 675,000 residents of Portsmouth and South East Hampshire).&lt;/li&gt;\n&lt;li&gt;Develop your clinical skills and knowledge in an environment that values its staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;A healthy work-life balance is valued in PHT&lt;/strong&gt;. Portsmouth is a vibrant city and tourist destination on the south coast with convenient access to the South Downs National Park and the Isle of Wight and just 90 minutes from London Waterloo by train. Whether your passion is the outdoors – with beaches, sailing, kite-surfing, horse-riding and hiking on our doorstep – or culture – in the birthplace of Charles Dickens, with two theatres and a major concert venue in the city – Portsmouth has something for everyone. If history is your hobby, Portsmouth Historic Dockyard offers a rich exploration of Britain’s naval history, but if retail therapy is more likely to float your boat, discount designer-label shopping at Gunwharf Quays attracts shoppers from far and wide. If you like to travel and explore, ferries sail from Portsmouth to the Channel Islands, France and Spain and cruise ships depart from nearby Southampton to the Mediterranean, Baltic, Caribbean and Nordic seas. Southampton airport is just 20 miles away, serving destinations across the British Isles and Europe.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Closing Date 16th November 2020&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Highly Specialised Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251865", "validThrough": "2020-11-16T23:59:59+0000"}