{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 per annum inc. High Cost Allowan"}}, "datePosted": "2020-10-22T11:31:40+0100", "description": "&lt;p&gt;&lt;strong&gt;Reporting Sonographer Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This position is open to qualified sonographers who are looking to work in a dynamic, fast-paced department and be part of our friendly and hardworking team at Surrey and Sussex NHS Trust.&lt;/p&gt;\n&lt;p&gt;In line with our trust objectives, we wish to recruit a Sonographer with high standards who is passionate in their work, and is committed to the pursuit of excellence. The trust ultrasound department is sonographer-led and caters for a wide range of services including obstetrics (including early pregnancy), general/surgical, urology, gynaecology, paediatrics, head and neck (including diagnostic and therapeutic intervention), Contrast enhanced ultrasound, musculoskeletal (including therapeutic injections) and a comprehensive vascular service in line with a dedicated vascular laboratory. We are happy to support staff development in line with personal ambition and service needs. We require highly-motivated, team players, who are keen to develop professionally whilst maintaining competency in other key areas.&lt;/p&gt;\n&lt;p&gt;As a band 7 sonographer, you will be expected to produce high-quality diagnostic images and reports as well as providing a supportive learning environment for sonographers in-training. You will also be expected to take part in audits and quality assurance programmes to develop the team and department. We recognise the value of each team member and we believe that investment in our staff produces an excellent team. We appreciate that ensuring staff satisfaction is the key to facilitating the optimum patient experience; by enabling staff to provide the highest standards of patient care. Our organisation has been voted by staff as being one of the top 20% in the country to work for and receive care in.&lt;/p&gt;\n&lt;p&gt;The successful candidate should be able to work under pressure and promote team values at all times. Good organizational and communication skills are essential to ensure efficient, safe workflow. Applicants will be expected to work across all sites. We can consider flexible working patterns that fit in with the service requirements. You may also be required to undertake additional duties, when required at weekends.&lt;/p&gt;\n&lt;p&gt;We are keen to recruit staff that subscribe to our core values and who want to part of a successful and developing organisation. Applications are welcomed from empathic and compassionate sonographers who want to help make a difference to our patients. We are keen to meet you and welcome you to the team.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange a visit please contact Diane McFeeters on 01737 768511 x2729 or d.mcfeeters@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 25th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Diane McFeeters Operations Manager&lt;/p&gt;\n&lt;p&gt;d.mcfeeters@nhs.net 01737 768511 x2729&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Sonographer - band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238153", "validThrough": "2020-11-15T23:59:59+0000"}