{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-20T20:16:32+0100", "description": "&lt;p&gt;&lt;strong&gt;We have the very rare and exciting opportunity to appoint a B7 Advanced Practitioner Physiotherapist to join our enthusiastic community based therapy team in South Molton.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an experienced, enthusiastic and passionate physiotherapist looking for an opportunity to provide clinical leadership across a team of occupational therapists, physiotherapists, assistant practitioners and therapy support workers within a multidisciplinary health and social care team?&lt;/p&gt;\n&lt;p&gt;Come and work with us on the edge of Exmoor and close to North Devon’s outstanding beaches.&lt;/p&gt;\n&lt;p&gt;Northern Devon NHS Trust is almost unique in England as it delivers a range of acute, community and social care services. The community therapy team work with people with a wide range of disabilities and acute or long term conditions striving to deliver excellent patient centred care. Our work is consistently varied and stimulating covering admission prevention and supporting discharge, rehabilitation and habilitation in a range of community settings through medical, social and public health approaches.&lt;/p&gt;\n&lt;p&gt;The post holder/s will work hand in hand with the Therapy Team Lead and Advanced Practitioner occupational therapist and alongside the therapy and broader health and social care team in service delivery and development. The post holder/s will become a member of the community advanced practitioner forum which drives forwards rehabilitation service delivery and development across North Devon Health and Social Care teams.&lt;/p&gt;\n&lt;p&gt;If you would like to work with us developing a robust community based therapy service in a post with a remit to ensure delivery of high quality patient centred care measured by clinical effectiveness, patient safety and patient experience we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post is full time working 37.5 hours per week and we will consider job share and part time applicants.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For more information please contact:&lt;/p&gt;\n&lt;p&gt;Nancy Rollinson Therapy Team Lead on 01769 575959 or 07552254679.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 15/11/2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120959.jpg", "name": "Northern Devon Healthcare Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120959"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Molton", "postalCode": "EX36 4DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0171", "longitude": "-3.83926"}}, "title": "Advanced Practitioner Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235476", "validThrough": "2020-11-15T23:59:59+0000"}