{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-23T09:16:14+0100", "description": "&lt;p&gt;Looking for an exciting job opportunity within prison healthcare at HMP Garth?&lt;/p&gt;\n&lt;p&gt;Are you collaborative, caring and compassionate?&lt;/p&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;As a healthcare provider, we recognise the fact that prisoners are a socially excluded group with complex healthcare needs that can often be associated with poor outcomes. We believe in putting the patient first, regardless of the environment or their history.&lt;/p&gt;\n&lt;p&gt;You will be required to work in partnership with the existing nursing teams to ensure that there is collaborative and holistic approach to the management of long term conditions for a specific caseload of patients. This includes the assessment of need, delivery and evaluation of care interventions and management plans in line with best practice standards.&lt;/p&gt;\n&lt;p&gt;You will also be required to proactively manage frequent and high demand users of health services using long term condition strategies in line with the Department of Health standards for the management of long-term conditions as well as providing professional support and guidance for the nursing team and ensure resources available are utilised effectively for the day to day management of patients with long term conditions. The post holder is an integral part of the Service and contributes to the assessment of need for the local population.&lt;/p&gt;\n&lt;p&gt;As a Long Term Conditions Nurse you’ll be an integral part of the healthcare team by bringing your top notch clinical skills and passion for care You will also need to undertake the role of Supervisor/Mentor, participating in and supporting others to deliver clinical practice.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Allen Head of Healthcare&lt;/p&gt;\n&lt;p&gt;emma.allen@gmmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number01772 443421&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Garth, Leyland", "postalCode": "PR26 8NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6796", "longitude": "-2.75636"}}, "title": "Long Term Condition Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239796", "validThrough": "2020-11-08T23:59:59+0000"}