{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-10-26T08:17:45+0000", "description": "&lt;p&gt;We are looking for a suitably experienced 8a Clinical or Counselling Psychologist, for a .8wte post, with relevant experience to work alongside us at Northcroft Community Mental Health Team.&lt;/p&gt;\n&lt;p&gt;The post is part of our adult community mental health provision at our Erdington Centre location.&lt;/p&gt;\n&lt;p&gt;We are a dynamic and forward thinking service where psychologists are strongly placed to lead on service development and delivery across all elements of the care pathway. We have an established track record in service innovation and support a diverse range of clinical and academic interests with strong links to university programmes in the region. We have a well-developed CPD programme and have robust supervision and professional line management systems. Job plans include generous CPD allowance and research and innovation protected time.&lt;/p&gt;\n&lt;p&gt;The post includes excellent opportunities to gain experience of multilevel and integrated service provision and to further develop skills of complex case assessment, formulation and the application of evidence based psychological interventions, both individual and in groups.&lt;/p&gt;\n&lt;p&gt;We are looking for a skilled and highly experienced clinician who can work effectively as part of a multilevel psychology service to provide a range of clinical services. You should have experience of working with service users with complex mental health and behavioural needs. You should be familiar with the needs of a diverse BME community and working in areas of high socioeconomic deprivation. You will be expected to guide, oversee and deliver expert and effective psychological services assessments, formulations and interventions within a community CMHT locality and will provide psychological advice, support and training to MDTs where needed. This role requires providing direct and indirect clinical work, contributing towards the delivery of clinical programmes, teaching, training and supervising. The post holder is expected to be involved in service development and review, audit and research.&lt;/p&gt;\n&lt;p&gt;You would be joining a team where you would be managed and supervised by experienced psychologists able to support your learning and professional development needs offering a range of clinical models and accreditation opportunities. We have an active CPD programme and you would have protected CPD time. We have long and well established links with local training courses.&lt;/p&gt;\n&lt;p&gt;Birmingham is a vibrant multicultural city with affordable housing and easy access to areas of historic importance and outstanding natural beauty.&lt;/p&gt;\n&lt;p&gt;For further information please contact: Dr Nina Ahuja, Principal Clinical Psychologist on 0121 301 5200.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNina AhujaJob titlePrincipal Clinical PsychologistEmail addressnina.ahuja@nhs.netTelephone number0121 301 5200&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northcroft CMHT, Birmingham", "postalCode": "B23 6DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5233", "longitude": "-1.85513"}}, "title": "Band 8a Senior Clinical / Counselling Psychologist - ICCR Northcroft", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241739", "validThrough": "2020-11-09T23:59:59+0000"}