{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15162", "minValue": "15162", "unitText": "YEAR", "value": "£9.02 an hours"}}, "datePosted": "2020-10-28T09:59:13+0000", "description": "&lt;p&gt;DMC Healthcare – Albion Place Medical Centre&lt;/p&gt;\n&lt;p&gt;Fixed Term for 6 months working for 37.5 hours a week&lt;/p&gt;\n&lt;p&gt;DMC Healthcare are looking to recruit an experienced, charismatic, and approachable medical notes summariser to support our Practice manager and assistant practice manager at our GP Surgery based in Maidstone town centre.&lt;/p&gt;\n&lt;p&gt;Our practice is modern, bright and welcoming with on-site staff parking, meeting rooms, air-conditioned offices and staff kitchen/dining area.&lt;/p&gt;\n&lt;p&gt;Post is Fixed Term for 6 months working for 37.5 hours a week.&lt;/p&gt;\n&lt;p&gt;As Medical Notes Summariser you will carry out administrative tasks relating to patient records, ensuring that all incoming patient notes are electronically summarised and assigned codes to provide a succinct and relevant record of the patients&#39; medical history&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be highly motivated and able to work under pressure to meet deadlines. Must be able to work well on their own, as well as being an integral part of our practice team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main duties/key tasks:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Culling and sorting patient records and letters in preparation for summarising&lt;/li&gt;\n&lt;li&gt;Reviewing medical records and producing an accurate summary of the patient’s medical history&lt;/li&gt;\n&lt;li&gt;Coding the information into the practice clinical system&lt;/li&gt;\n&lt;li&gt;Auditing data collection standards in the practice&lt;/li&gt;\n&lt;li&gt;Monitoring progress of notes summarising against practice targets&lt;/li&gt;\n&lt;li&gt;Filing and retrieving paperwork&lt;/li&gt;\n&lt;li&gt;Coding incoming letters on to the clinical system&lt;/li&gt;\n&lt;li&gt;Managing electronic GP2GP links and resolving degraded information&lt;/li&gt;\n&lt;li&gt;Providing additional administrative support to workflow team (processing incoming documentation) or assisting with registration processes in times of need.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DMC Healthcare Group is a provider of Primary Care Services operating GP surgeries, walk-in centres and mobile medical units. We offer patients a full range of NHS primary and urgent care services. At DMC we believe in working together to deliver healthier outcomes for our patients and our own teams and strive to continuously ensure our patients are safe, cared for and receive the care they need when they need it.&lt;/p&gt;\n&lt;p&gt;If you are interested in our vacancy then we would love to hear from you. In return, you will enjoy a challenging and diverse career with DMC.&lt;/p&gt;\n&lt;p&gt;For an informal discussion regarding the role please contact Sue Wanstall – Primary care manager via email at suewanstall@dmchealthcare.co.uk.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As part of our employment process, you will be required to complete the appropriate level DBS check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality and Diversity Statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The company supports the principle of Equality and Diversity in employment wholeheartedly and opposes all forms of unlawful or unfair discrimination on the grounds of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;This job advert may close as soon as sufficient suitable applications have been received. If interested please apply for this post as soon as possible&lt;/p&gt;\n&lt;p&gt;Your submitted application maybe imported into our preferred Third-party recruitment system. By applying for this post, you are agreeing to DMC Healthcare transferring the information within this application to its preferred applicant management system. If you are offered a job, information will also be transferred into the DMC Electronic Staff Records system.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone, Kent", "postalCode": "ME14 5DY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2742", "longitude": ".529529"}}, "title": "Medical Notes Summariser - Albion Place Medical Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245931", "validThrough": "2020-11-11T23:59:59+0000"}