{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-10-16T09:15:41+0100", "description": "&lt;p&gt;We are looking to recruit a motivated and enthusiastic Advanced Cardiac Physiologist The post would suit an experienced band 6 physiologist who is looking to further develop their Echo and/or CRM skills. On achievement of internal competencies and external accreditation in either Pacing or Echo (BHRS / IBHRE, or BSE) they would be upgraded to a band 7 if suitable. This post would also be suitable for a qualified physiologist who demonstrates potential and skill. The successful candidate would be taken on as a band 6 physiologist at annex 21 until they completed their competencies, with a potential to rise to band 7 on completion of professional. The band 6 salary would be between £31,365 and £37,890 (when you have obtained accreditation in either echo, or pacing you would be upgraded to a band 7). The band 7 salary would be between £38,890 and £44,503.&lt;/p&gt;\n&lt;p&gt;You need to have already been working as a qualified cardiac physiologist with relevant experience and should have obtained the BSc or MSc in clinical physiology, or an equivalent qualification.&lt;/p&gt;\n&lt;p&gt;We are looking for people with experience in either Echocardiography and/or Cardiac Rhythm Management. Applicants should have, or should be working towards, either a BSE, IBHRE, or BHRS qualification. For the suitable applicant support will be given to achieve their relevant accreditations. Experience in cardiac catheter lab is desirable, but not essential.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our team, as we are expanding and improving our services. Our department is currently BSE accredited. This post provides an excellent opportunity for an enthusiastic and experienced cardiac physiologist to join our service, where we perform physiologist led: stress echo, contrast, bubble, TOE, valve and Herceptin clinics. We also provide complex CRM implant and follow up and have a physiologist led ILR implant service.&lt;/p&gt;\n&lt;p&gt;We have weekly review and teaching meetings attended by one or more consultants, registrars, cardiac physiologists and junior staff. All physiologists are encouraged to attend relevant course/meetings, as continued professional development is important to our team and post-graduate exams are actively encouraged.&lt;/p&gt;\n&lt;p&gt;We achieved IQIPS accreditation in 2019. Patient experience is particularly important to us, as in our location, we are lucky to be exposed to a diverse patient population. You will be able to gain experience of many different cardiac pathologies, working in a multi-disciplinary team of over 40 staff.&lt;/p&gt;\n&lt;p&gt;As a family friendly department, we are able to offer this position as full time or part time. We are also able to offer flexible working hours of 8am to 6pm, four days per week with a fixed day off (following a two month settling in period), or 9am to 5pm five days per week. We would be happy to accommodate weekend working, if this is desirable.&lt;/p&gt;\n&lt;p&gt;We encourage you to give us a call to arrange an informal visit.&lt;br /&gt;If you would like to know more about this role please contact Ruth Naylor on 0121 507 6295, or email ruthnaylor@nhs.net&lt;/p&gt;\n&lt;p&gt;If you are thinking of applying for our vacancy, you will need to have all of the essential requirements that we have listed in the personal specification for the appropriate level, in the field that you specialise in, or be working towards that level.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRuth NaylorJob titleCardiology Diagnostics ManagerTelephone number01215076295Additional contact information&lt;/p&gt;\n&lt;p&gt;Ruth Naylor, email ruthnaylor@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell and City Hospitals (Cross Site), Birmingham", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Advanced Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229403", "validThrough": "2020-11-30T23:59:59+0000"}