{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum (pro rata)"}}, "datePosted": "2020-11-02T08:17:03+0000", "description": "&lt;p&gt;Be at the centre of an exciting, digitally-enabled future at one of the UK’s largest Acute Trusts.&lt;/p&gt;\n&lt;p&gt;On 1 October 2017, Manchester University NHS Foundation Trust (MFT) was created from the merger of Central Manchester University Hospitals NHS Foundation Trust (CMFT) and University Hospital of South Manchester NHS Foundation Trust (UHSM). The merger was founded on a desire to deliver significant improvements in health outcomes and healthcare for the people of Manchester and surrounding areas.&lt;/p&gt;\n&lt;p&gt;We are the main provider of hospital care to approximately 750,000 people in Manchester and Trafford and the single biggest provider of specialised services in the North West of England. We are also the lead provider for a significant number of specialised services including Breast Care, Vascular, Cardiac, Respiratory, Urology Cancer, Paediatrics, Women’s Services, Ophthalmology and Genomic Medicine.&lt;/p&gt;\n&lt;p&gt;The Trust comprises of nine hospitals across six separate sites, providing a wide range of services from comprehensive local general hospital care through to highly specialised regional and national services.&lt;/p&gt;\n&lt;p&gt;Our vision is to improve the health and quality of life of our diverse population by building an organisation that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excels in quality, safety, patient experience, research, innovation and teaching&lt;/li&gt;\n&lt;li&gt;Attracts, develops and retains great people&lt;/li&gt;\n&lt;li&gt;Is recognised internationally as a leading healthcare provider&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Did we mention these are exciting times?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The MFT Group Informatics service must respond quickly and flexibly to the demands of this new organisation, ensuring that we provide multiple services fit for purpose, whilst evolving our capability and tools to deliver an ambitious transformation change programme for the future.&lt;/p&gt;\n&lt;p&gt;This exciting post will provide an opportunity for you to help develop, support and drive forward the Group Informatics service within the Health Records function.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Health Records Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a team of 100 staff working across locations in Manchester.&lt;/p&gt;\n&lt;p&gt;Our aim is to ensure the availability of health records and to support the journey towards digitisation of records. We do this through the creation, transit, location tracking, scanning and storage of health records for the Trust. We manage the Records Library which is home to approximately one million health records.&lt;/p&gt;\n&lt;p&gt;We believe that health records play a vital role in patient care. We strive to make records available at the right place and time to support our clinical colleagues to deliver the best standards of care for our patients.&lt;/p&gt;\n&lt;p&gt;Our work is highly valued and respected by the Trust. It is important to us that we treat our colleagues with fairness and respect in return. In the Health Records Team everyone’s contribution counts and our ideas are listened to as we strive to improve our service.&lt;/p&gt;\n&lt;p&gt;If you share our values and you believe that you can help us achieve our aims, then we need you to join us in the Health Records Team.&lt;/p&gt;\n&lt;p&gt;As a Health Records Service Clerk, you will work with large quantities of patients’ health records. Our tasks can involve picking and filing around 30 files per hour, tracking health records into and out of our numerous libraries using barcode scanner technology, transporting and collecting the health records to and from the wards and departments throughout the Trust sites.&lt;/p&gt;\n&lt;p&gt;The role of Health Records Clerk role can be very demanding and we have a variety of tasks within the department with some that require you to be on your feet for a large portion of the day and others that will require you to be desk-based using a PC.&lt;/p&gt;\n&lt;p&gt;To join our team you will need to be friendly and approachable as you will be the face of our team in the Trust. We ask that you are flexible in your approach to work as your priorities continuously change.&lt;/p&gt;\n&lt;p&gt;This is a very busy environment so being able to work under pressure and to tight deadlines is essential for this role. If you are able to manage a busy workload with a high level of accuracy, and have the ability to work under your own initiative, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;Please note that this position will involve working across our library sites in Manchester. You will therefore need the ability to transport confidential records from site to site and will hold a clean, current driving license.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAngela FaircloughAdditional contact information&lt;/p&gt;\n&lt;p&gt;Angela Fairclough, Health Records Service Manager on 0161 291 5181&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe, Wythenshawe", "postalCode": "M23 9GP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3928", "longitude": "-2.29376"}}, "title": "Health Records Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251323", "validThrough": "2020-11-08T23:59:59+0000"}