{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa plus HCAS"}}, "datePosted": "2020-10-29T10:02:00+0000", "description": "&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for 2 District Nurses to join one of our Integrated Teams in Barking and Dagenham.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidates will be expected to support their team, department and organisation to achieve the Trust’s Values in their day to day work. These are the 5P’s:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Putting people first&lt;/li&gt;\n&lt;li&gt;Prioritising quality&lt;/li&gt;\n&lt;li&gt;Being progressive, innovative and continually improve&lt;/li&gt;\n&lt;li&gt;Being professional and honest&lt;/li&gt;\n&lt;li&gt;Promoting what is possible – independence, opportunity and choice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidates will be a Registered Nurse (RN12-NMC) responsible for patients allocated to them and will assess, manage, plan and deliver care, including being professionally and legally accountable.&lt;/p&gt;\n&lt;p&gt;The successful candidates will support their peers and team leader and be an effective team member whilst working on their own initiative. They will supervise pre-registration students. They will have a commitment to collaborative working actively supporting and liaising with other health and social professionals and agencies.&lt;/p&gt;\n&lt;p&gt;The post holders will lead and manage a Community Nursing Team, geographically aligned to GP practices and be responsible for the management of a caseload ensuring the provision of a high standard of nursing care to patients and their families in the community. He/She will work as part of the integrated primary/community health care team, working within and across professional and organisational boundaries. Liaising with GPs, other professionals and statutory and voluntary agencies he/she will deliver individualised care to patients. The district nurse works without direct supervision and provides leadership to the community nursing team.&lt;/p&gt;\n&lt;p&gt;Applications are welcome from nurses currently undertaking the Band 6 Development Program.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement - London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Esther Harry 0300 5551201 ext. 56473&lt;/p&gt;\n&lt;p&gt;Esther.Harry@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Porters Avenue Health Centre, Barking &amp; Dagenham", "postalCode": "RM8 2EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5454", "longitude": ".122634"}}, "title": "District Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247820", "validThrough": "2020-11-12T23:59:59+0000"}