{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753.00 - £51,668.00 per annum"}}, "datePosted": "2020-10-27T10:31:38+0000", "description": "&lt;p&gt;Are you keen to join a motivated group of professionals in an acute surgical setting? A great opportunity has arisen on our Surgical Triage Unit (STU), a fast paced unit specialising in emergency surgical assessment. To improve patient pathways we are expanding STU to ensure a smoother assessment process for our emergency patients, as well as including new specialties to our area. We are soon to welcome ENT and Maxillofacial to our unit which will increase learning and development opportunities in our area for all staff. This is a really exciting opportunity as it enables us as a team to be able to influence and improve patient pathways and the care we will deliver to ensure our patients get the best experience possible. It will also allow us to develop our service in order to provide high standards of care to fit within the Magnet criteria and our journey to excellence in the Trust.&lt;/p&gt;\n&lt;p&gt;For the first time ever on this area we are introducing the ACP role, the Unit is currently ran by the Emergency General Surgery Registrar on call and the Emergency General Surgery Consultant on call. We are looking for an individual/s that will be able to take the lead in this change, along with a Band 7 project lead to help develop the service and provide 7 day a week cover to assess, treat and admit/discharge patients admitted to STU from the Emergency Department, GPs, community and East Midlands Ambulance Service (EMAS)&lt;/p&gt;\n&lt;p&gt;On STU you will work alongside multiple different members of the emergency team which ranges from our experienced and knowledgeable CSWs, Nurse Practitioners from the different specialities (Emergency General Surgery, Vascular, ENT &amp; Max Fax), our own nursing team and the surgeons and Consultants.&lt;/p&gt;\n&lt;p&gt;Social distancing has reduced how many patients can be in our waiting areas so your communication skills and use of hospital systems such as Nervecentre and Medway must be excellent as this enables teams outside our area to monitor our Opel status efficiently.&lt;/p&gt;\n&lt;p&gt;You must be reliable and able to work flexibly, undertaking a full range of shifts, at present including long days, weekends and bank holidays. Shift patterns can be looked at if they fit within the units requirements but must be discussed with managers in advance. Full and part time hours are available.&lt;/p&gt;\n&lt;p&gt;If you are a professional, forward thinking and motivated individual we would love to hear from you. An informal visit is highly recommended.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Caroline Sheppard - Lead Nurse&lt;/p&gt;\n&lt;p&gt;0781 227 5628&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Medical Centre, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Advanced Clinical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244023", "validThrough": "2020-11-10T23:59:59+0000"}