{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 per annum (pro rata if part time)"}}, "datePosted": "2020-10-07T10:16:28+0100", "description": "&lt;p&gt;Are you a highly skilled Nurse looking for an exciting and rewarding role working in a friendly and professional organisation? Defence Primary Health Care (DPHC) have 2 vacancies for Band 5 Nurses at Regional Medical Centre, RAF Halton, Aylesbury, HP22 5PG.&lt;/p&gt;\n&lt;p&gt;One post is being offered for 37 hours and one post is being offered part time for 13.5 hours.&lt;/p&gt;\n&lt;p&gt;You will be a registered nurse who, acting within their professional boundaries, will provide care for the presenting patient. You will demonstrate safe, clinical decision-making and expert care for patients including treatment, preventative care, screening and patient education within the medical facility (MF). You will work collaboratively with the multi-disciplinary team (MDT) to meet the needs of patients.&lt;/p&gt;\n&lt;p&gt;Supported by a senior nurse you will work unsupervised to deliver care within the boundaries of their role, focusing upon: supporting patients to be healthy; monitoring of long-term conditions; health promotion; performing travel health assessments; undertaking screening activities. You will work collaboratively with the MDT to meet the needs of patients, supporting the delivery of policy and procedures, and providing nurse leadership as required.&lt;/p&gt;\n&lt;p&gt;On a rotational basis you will cover the Day Assessment Unit which provides care to service personnel under training between 0745-1830 hrs.&lt;/p&gt;\n&lt;p&gt;Duties of the role include, but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing direct clinical patient care performing clinical assessment, interventions and management as competent including: ear care; gynaecological care; wound care; vaccinations; chronic disease management; minor injuries and minor illness (list not exhaustive).&lt;/li&gt;\n&lt;li&gt;Assessing for, preparing and delivering immunisations during vaccination parade.&lt;/li&gt;\n&lt;li&gt;Offering a holistic service to patients and their families, developing where appropriate an on-going plan of care/support, with an emphasis on prevention and self-care.&lt;/li&gt;\n&lt;li&gt;Promoting health and well-being through the use of health promotion, health education, screening and therapeutic communication skills (i.e. smoking cessation, weight management, alcohol misuse).&lt;/li&gt;\n&lt;li&gt;Referring patients directly to other services/agencies as appropriate.&lt;/li&gt;\n&lt;li&gt;Delivering specialist services, such as long term disease management (i.e. diabetes, asthma, chronic obstructive pulmonary disease, hypertension).&lt;/li&gt;\n&lt;li&gt;Participating in identification of community health needs and developing patient/family-centred strategies to address them.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please see the attached Job Description and Person Specification for further information regarding the role.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV and at interview you will be tested against the following NHS Competency Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core - NHSC1 - Communication&lt;/li&gt;\n&lt;li&gt;NHS Core - NHSC2 - Personal &amp; People Development&lt;/li&gt;\n&lt;li&gt;NHS Core - NHSC5 - Quality&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing - HWB2 - Assessment &amp; Care Planning&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing - HWB5 - Provision of Care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to provide evidence of the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Professional/clinical knowledge acquired through training to degree/diploma level.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;Registered Nurse with live registration on the NMC register.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Experience would be desirable in: teaching/mentoring, clinical supervision, travel immunisation.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel, but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;From time to time The Ministry of Defence may advertise per regional Headquarters. To ensure your search yields the best results, search under MoD-Healthcare jobs from the home page or alternatively avoid completing the mileage section when using the search criteria based on your post code.&lt;/p&gt;\n&lt;p&gt;For details of which locations are in each region, please see attached Regional Layout document.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Regional Medical Centre, RAF Halton, Aylesbury", "postalCode": "HP22 5PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7749", "longitude": "-.727866"}}, "title": "Band 5 Nurse (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916215930", "validThrough": "2020-11-11T23:59:59+0000"}