{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-28T17:00:55+0000", "description": "&lt;p&gt;Location – Lincoln County Hospital&lt;/p&gt;\n&lt;p&gt;United Lincolnshire Hospitals NHS Trust provides a Neonatal service for the babies and families of Lincolnshire and surrounding areas. There are 2 Neonatal Units within ULHT. Lincoln County Hospital is a Local Neonatal unit and has a cot capacity of 15, providing 1 ITU, 2 HDU and 12 Special Care cots and in addition there are 4 Transitional care cots located on the Post Natal Ward.&lt;/p&gt;\n&lt;p&gt;Pilgrim Hospital Boston is a Special Care Baby Unit and has a cot capacity of 12, providing 8 Special Care and 4 Transitional care cots. Sick babies are stabilised prior to transfer out to a Neonatal Intensive Care Unit. ANNP’s at present are based at Lincoln County Hospital only.&lt;/p&gt;\n&lt;p&gt;Lincoln is a thriving cathedral city with a growing university, affordable housing and good schools.&lt;/p&gt;\n&lt;p&gt;We are currently looking to recruit a qualified ANNP to join our established team. The successful candidate must be qualified as a MMediSci Advanced Neonatal Nurse Practitioner or be currently working towards this. The successful candidate must also be qualified as a non-medical prescriber and be registered with the NMC.&lt;/p&gt;\n&lt;p&gt;ANNP’s work as part of the Tier 1 medical rota and are required to work days, nights, bank holidays and weekends. You will need to have excellent communication skills, be flexible and able to use initiative. You must display a positive manner and be an ambassador for the Trust. You will also need to be capable of working independently as well as part of the wider team and be adaptable to meet the changing needs of the organisation.&lt;/p&gt;\n&lt;p&gt;We would welcome and encourage informal visits to the unit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCatherine FranklinJob titleMatronEmail addressCatherine.Franklin@ULH.nhs.ukTelephone number07388370041.Additional contact information&lt;/p&gt;\n&lt;p&gt;Ward Consultant on 01522 573604&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln county, Lincoln", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Advanced Neonatal Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247447", "validThrough": "2020-11-18T23:59:59+0000"}