{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata (Indicative Banding)"}}, "datePosted": "2020-10-23T13:16:03+0100", "description": "&lt;p&gt;&lt;strong&gt;Hours: Up to 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: Secondment for 12 months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has risen for a highly motivated and enthusiastic Band 7 Sister/Charge Nurse at Scarborough Emergency Department.&lt;br /&gt;&lt;br /&gt;We are looking for an exceptional Band 7 Nurse, who is passionate about Emergency Nursing and making a difference to the patient’s experience. Our Emergency Department sees over 55,000 patients each year, and has a 3 bedded resuscitation room and 11 majors cubicles, and a 6 bay assessment area. In addition, it has an integrated urgent care centre for minor illness and minor injuries patients. This area is managed primarily by Emergency Nurse Practitioners (ENPs). The possession of an ENP qualification would be desirable, but not essential.&lt;br /&gt;&lt;br /&gt;As a Sister/Charge Nurse you will have excellent leadership skills and will embrace the challenge of working in a highly demanding and diverse environment, while actively supporting the nursing team to ensure high standards of care are delivered.&lt;br /&gt;&lt;br /&gt;This is a very exciting time, and as a senior member of the team you will be in a position to influence and affect emergency care, as we continue to develop our innovative ways of working.&lt;br /&gt;&lt;br /&gt;This is a rewarding but challenging role, that requires you to organise and prioritise patient care to ensure maximum flow through the department, and provide support and advice to junior members of the team and/or students.&lt;/p&gt;\n&lt;p&gt;As a leadership position you will be expected to provide managerial support, inclusive of HR issues, Workforce, and change management.&lt;/p&gt;\n&lt;p&gt;In return you will be working with a dynamic nursing team with strong peer support, and access to educational opportunities to further your career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Please seek permission from your current line manager before applying for this secondment position.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;strong&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Sarah Freer&lt;/p&gt;\n&lt;p&gt;Job title: Matron&lt;/p&gt;\n&lt;p&gt;Email address: sarah.freer@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01723385373&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scarborough", "postalCode": "YO12 6QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2817", "longitude": "-.434723"}}, "title": "Sister/Charge Nurse - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240666", "validThrough": "2020-11-08T23:59:59+0000"}