{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £31,365 to £37,890 per annum pro"}}, "datePosted": "2020-10-28T11:17:23+0000", "description": "&lt;p&gt;We are looking for a Dietitian to join our Primary Care team of 10 clinicians providing dietetic support for people referred for a range of conditions.&lt;/p&gt;\n&lt;p&gt;This role offers an opportunity for a Dietitian to work within the varied caseload of community primary care clinics. Working within a supportive team of senior Dietitians will allow the post holder to experience clinical dietetics in a community setting, whilst developing specialist skills. This post would be ideal for a band 5 Dietitian looking to take the next step in their career or a band 6 Dietitian wanting to establish their career in Community Dietetics. Our team includes specialists in Gastroenterology, Weight Management, Maternal Health &amp; Diabetes. Experience in diabetes management and group education with a desire further develop these skills would be beneficial for this post, but not essential.&lt;/p&gt;\n&lt;p&gt;We are a large and unique community dietetic department consisting of dietitians, psychologists, support workers, nutrition nurses and administrators, with a strong national and local profile and a reputation for innovation and partnership working. There are also opportunities to work as part of a wider specialist MDT.&lt;/p&gt;\n&lt;p&gt;The service supports personal development via CPD opportunities, mentoring, clinical supervision and departmental Clinical Update meetings. We provide full A, B and C placements for student dietitians, and we are developing our capacity to undertake dietetic research.&lt;/p&gt;\n&lt;p&gt;We have excellent office accommodation, with free convenient parking, as the role requires you to travel to venues across Birmingham. Flexible working is always considered and we are well equipped for remote working with the use of laptops, smartphones and digital technology supported by the Trust.&lt;/p&gt;\n&lt;p&gt;Alternative hours could be considered and we encourage you to ring us to discuss the post further.&lt;/p&gt;\n&lt;p&gt;Kathryn Haywood&lt;/p&gt;\n&lt;p&gt;0121 683 2300&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKathryn HaywoodJob titlePrimary Care Team LeaderEmail addresskathryn.haywood@bhamcommunity.nhs.ukTelephone number0121 683 2300Additional contact information&lt;/p&gt;\n&lt;p&gt;For an informal discussion, contact Kathryn Haywood (Primary Care Team Leader) or Paul McArdle (Lead Clinical Dietitian &amp; Deputy Head of Nutrition).&lt;/p&gt;\n&lt;p&gt;Email: kathryn.haywood@bhamcommunity.nhs.uk or paul.mcardle@nhs.net or contact us by phone on 0121 683 2300.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gee House, Birmingham", "postalCode": "B7 5JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5024", "longitude": "-1.86768"}}, "title": "Band 6 Senior Primary Care Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246266", "validThrough": "2020-11-11T23:59:59+0000"}