{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-10-22T16:01:06+0100", "description": "&lt;p&gt;We offer a fantastic benefits package, competitive pay rates with annual increases, annual leave of 27 days increasing to 33 days after 10 years, access to the NHS Pension Scheme to which you and the Trust contribute, extensive training development opportunities with paid mandatory training, support for flexible working, access to an On-site Ofsted graded ‘Outstanding’ Nursery. We promote a healthy work life balance, provide an Occupational Health Service to support you at work with a number of NHS discounts available.&lt;/p&gt;\n&lt;p&gt;The Royal Devon and Exeter NHS Foundation Trust (RD&amp;E) provides Acute and Community services across Exeter/East Devon serving a population of more than 450,000. In our latest CQC inspection of our services, the RD&amp;E received an overall rating of “good” and “outstanding” for our Emergency and Critical Care services, and for Caring Trustwide.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The RD&amp;E has been ranked as the joint best performing non-specialist Trust in the country for overall patient care experience in the 2016 CQC Adult Inpatient Survey.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The main hospital site is in the historical Cathedral city of Exeter in the middle of the South West with beautiful surrounding countryside and coast of Devon and Cornwall all within easy access and with abundant family amenities. It has good transport links and educational facilities available locally. Our Community sites are equally well positioned and good places to work.&lt;/p&gt;\n&lt;p&gt;The Urgent Community Response Service (UCR) in Exeter is looking to recruit Support Workers. If you want a rewarding career caring for people and/or are ready to take the next step in your career, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;UCR is a joint Health and Social Care Service providing support to people in their homes in times of crisis, to avoid unnecessary hospital admissions for people who could safely be maintained at home and facilitate discharges home from hospital.&lt;/p&gt;\n&lt;p&gt;The service provides care 7 days a week 365 days a year, with shift patterns covering 0730hrs until 2200hrs. The service provides care across Exeter and outlying areas and you will be part of a team providing a quality service promoting independence, dignity and support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours and shifts are offered on a full or part time basis. This will include weekends and evenings at enhanced rates.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Previous community experience is desired but not essential as the teams will give you support and guidance you need to excel. You will join a dynamic multi-disciplinary team, working with Health and Social Care Teams to respond to urgent situations, to enable people to stay in their own homes or ensure a timely discharge from Acute and Community Hospitals.&lt;/p&gt;\n&lt;p&gt;You will be provided with a comprehensive induction programme which will include support to complete the National Care Certificate.&lt;/p&gt;\n&lt;p&gt;It would be beneficial if successful candidates have experience of working with adults in health and social care in a community setting. You will also need to be competent with IT as electronic recording is an essential part of the role. As this is a community based position, a driving license is essential as is access to a vehicle.&lt;/p&gt;\n&lt;p&gt;Urgent Community Response Support Workers are lone workers within the community, although support is always available.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Prior to submitting an application please call the Urgent Community Support Managers on 01392 465683 or 465629 if you wish to discuss the role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are:&lt;br /&gt;Honesty, Openness &amp; Integrity&lt;br /&gt;Fairness&lt;br /&gt;Inclusion &amp; Collaboration&lt;br /&gt;Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Privacy Notice&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;During the course of this recruitment process, the Trust will be collecting your data and processing it in accordance with relevant Data Protection Legislation. Please see our website for more information with regards to the Trust’s Privacy Notice (RD&amp;E website - Information Governance page). This Privacy Notice is designed to provide you with further information on how we will be using your data for this purpose and to comply with the relevant legislation.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Royal Devon &amp; Exeter NHS Foundation Trust will contact previous employers to confirm employment history to cover a period of at least 3 years. The Trust is only able accept written references; these will be requested via email. One of your referees must be your current line manager and all references must cover the previous three years work or study history.&lt;br /&gt;&lt;br /&gt;Tier 2 Certificate of Sponsorship (formerly a Work Permit):&lt;br /&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. However, non-EEA candidates may not be appointed to a post if a suitably qualified, experienced and skilled EU/EEA candidate is available to take up the post as the employing body is unlikely, in these circumstances, to satisfy the Resident Labour Market Test. The UK Border Agency requires employers to complete this test to show that no suitably qualified EEA or EU worker can fill the post. For further information please visit UK Border Agency website.&lt;/p&gt;\n&lt;p&gt;As users of the disability confident scheme, we operate a Guaranteed Interview Scheme for job applicants with disabilities. If you let us know, when you apply, that you would like to use this scheme, we will guarantee you an interview, if you meet the essential criteria listed in the person specification section of the job description.&lt;/p&gt;\n&lt;p&gt;We will also make any reasonable adjustments you require to our selection process. Please let us know what you need.”&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX1 3RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.731", "longitude": "-3.48415"}}, "title": "Urgent Community Response Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239243", "validThrough": "2020-11-18T23:59:59+0000"}