{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata + 5% of basic"}}, "datePosted": "2020-10-26T10:30:56+0000", "description": "&lt;p&gt;SPA is looking for an energetic, dynamic and ambitious Senior Clinical Advisor to support us on a journey in providing flexible and responsive working behaviours in an environment which has contact with every treatment team throughout the Trust as demand requires. We seek problem solvers with the experience in their speciality to be able to apply their skills to a broad spectrum of circumstances to join our award-winning team and to play a vital leadership role throughout the next phase of our development, further cementing our position as a leading integrated healthcare provider.&lt;/p&gt;\n&lt;p&gt;After comprehensive training which is tailored to your learning style with our in-house training staff you will be acting as an autonomous clinician/practitioner, providing a comprehensive telephone screening and triage service to service users, carers and their referrers resulting in a safe and appropriate clinical decision. You will learn a range of electronic patient record systems, telephony systems, and develop new IT skills to fulfil your role. You will be personable and professional, maintaining a high level of care.&lt;/p&gt;\n&lt;p&gt;The key responsibilities of a Clinical Advisor include, but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Facilitating the provision of accurate health and social care information, self-care / improvement advice or, where applicable, referring to the appropriate level and location of care, in order to meet the holistic and therapeutic requirements of the service user&lt;/li&gt;\n&lt;li&gt;Providing both supervision and advice to referral advisors within the Single Point of Access&lt;/li&gt;\n&lt;li&gt;Staffing our GP telephone hotline service to provide priority mental health advice to surgeries across Hertfordshire&lt;/li&gt;\n&lt;li&gt;Screening and triaging new referrals coming into the service, ensuring service users are directed to the most appropriate service with a clear care plan and advice&lt;/li&gt;\n&lt;li&gt;Ensuring the privacy of the service user and carer’s interests and wellbeing at all times including service user/carer confidentiality, under the supervision of senior clinicians&lt;/li&gt;\n&lt;li&gt;Participating actively in the Trusts Out of Hours Mental Health Helpline (MHHL), which is part of the SPA remit (this will include working within the SPA 24/7 framework)&lt;/li&gt;\n&lt;li&gt;Reporting all complaints, accidents and incidents in accordance with agreed policies and statutory requirements, and complying with the appropriate regulatory body and within ethical, legislative and organisational frameworks&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you’re looking for a flexible work life balance and being part of a supportive team within Single point of access, then this is the place for you. We also recognise the amazing work you do and also offer some home remote working to provide further flexibilities.&lt;/p&gt;\n&lt;p&gt;Whilst it is a challenging period for the NHS and this is a challenging role, there has never been a more exciting time to join SPA and HPFT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKeira GarforthJob titleClinical Team LeaderEmail addresskeira.garforth1@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;Keira Garforth - Clinical Team Leader - keira.garforth1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "99 Waverley Road, St Albans", "postalCode": "AL3 5TL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7621", "longitude": "-.345255"}}, "title": "Clinical Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242026", "validThrough": "2020-11-09T23:59:59+0000"}