{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-26T15:16:17+0000", "description": "&lt;p&gt;We are looking for a highly committed, innovative pharmacist with excellent organisation and communication skills who are keen to develop/deliver clinical pharmacy services based in the St Helens and Knowsley area.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be able to demonstrate significant evidence against the person specification criteria, and will be primarily responsible for the provision of professional pharmaceutical advice and support to our inpatient mental health services and community physical health services, including the Knowsley anticoagulant service.&lt;/p&gt;\n&lt;p&gt;You will be expected to further develop and improve medicines management activities to promote the effective and efficient use of medicines, thereby improving patient care and minimising waste. You will work alongside a medicines management technician and as part of the inpatient multi-disciplinary team to provide a clinical pharmacy service to both acute and long stay wards. The role is very clinically focused and does not involve any time spent in the dispensary.&lt;/p&gt;\n&lt;p&gt;We have a well-structured support system across the department, including, robust individual and group supervision, personal development plans and regular access to professional training which thereby ensures excellent opportunities for professional development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT: &lt;/strong&gt;The role will involve regular travel across multiple sites in the North West Boroughs Healthcare NHS Foundation Trust catchment area. Therefore, the post holder must be able to meet the travel requirements of this post. Please indicate on your application how you meet this requirement.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced with children’s and adult’s barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Steve Buxton&lt;/p&gt;\n&lt;p&gt;Advanced Clinical Pharmacist&lt;/p&gt;\n&lt;p&gt;steve.buxton2@nwbh.nhs.uk&lt;/p&gt;\n&lt;p&gt;01925 664453&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harry Blackman House, Peasley Cross Hospital, St Helens", "postalCode": "WA9 3DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4385", "longitude": "-2.72137"}}, "title": "Specialist Mental Health Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243096", "validThrough": "2020-11-09T23:59:59+0000"}