{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-11-06T10:16:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Homerton University Hospital NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locum Consultant Neonatologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Homerton is an innovative and friendly Foundation Trust providing a wide range of services to the local community of Hackney and specialist services on a national level. Located in the multicultural east end of London we are situated close to the heart of the capital, whilst being within easy reach of the M11 and M25. The Hospital has a modern Medical Education Centre and an active Postgraduate Teaching Programme and a well-stocked library. Good facilities for study and training are available and the Trust has recently been rated outstanding by CQC.&lt;/p&gt;\n&lt;p&gt;You are invited to apply for the post of locum Consultant Neonatologist. This is a fixed term post for 9 to 12 months to cover maternity leave. It is a full time 10 PA NHS appointment based at Homerton University Hospital which is a teaching hospital of Barts &amp; the London School of Medicine and Dentistry, and provides undergraduate and postgraduate teaching and training.&lt;/p&gt;\n&lt;p&gt;Homerton is one of the 3 designated Perinatal centres in The North East and North Central London Neonatal Operational Delivery Network (NENCL-ODN). The Neonatal Intensive Care Unit comprises of 46 cots, of which 16 are designated as intensive care cots and the others being a mixture of high dependency and special care cots. The Neonatal Unit participates in the National Grid neonatal training programme for middle grade doctors. The Homerton Maternity Unit has nearly 6000 deliveries a year, with a high risk Obstetrics and Fetal Medicine department&lt;/p&gt;\n&lt;p&gt;Candidates must be on the GMC Specialist Register or be within 6 months of obtaining their CCT in Paediatrics (Neonatal Medicine) or equivalent within 6 months of the interview date.&lt;/p&gt;\n&lt;p&gt;Teaching and academic interests will be encouraged. Career development assistance (for example management activities) will be provided if required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion, please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Professor Narendra Aladangady | Clinical Lead on n.aladangady@nhs.net&lt;/p&gt;\n&lt;p&gt;or Dr Susan Rowe | Associate Medical Director on susan.rowe9@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Homerton University Hospital, London", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Locum Consultant Neonatologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259167", "validThrough": "2020-11-27T23:59:59+0000"}