{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a."}}, "datePosted": "2020-10-26T15:54:12+0000", "description": "&lt;p&gt;Portsmouth CAMHS is excited to announce that we have recently received new financial investment from the local Commissioning unit to strengthen and enhance the Neurodevelopmental Pathway for children and young people within Portsmouth, who are referred to Portsmouth CAMHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for registered professionals with anationally recognised qualification ie. Registered Nurse, Registered Mental Health Nurse, Social Work, Psychology, Occupational Therapy or IAPT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This new investment means that the Portsmouth CAMHS team has an opportunity to recruit two full time Neurodevelopmental Practitioner posts who will provide Neurodevelopmental assessments to children and young people who are on the Neurodevelopmental Pathway, In addition, the successful candidates will have direct input into the future shaping of the Portsmouth CAMHS and Portsmouth citywide approaches to meeting the clinical needs of children and young people who present with Neurodevelopmental concerns. This is an exciting and amazing opportunity to have a real impact upon improving pathway wait times, service delivery and implementing new ways of working.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for dedicated and pro-active professionals who would be able to quickly pick up a full-time caseload and who would share both our Solent NHS Trust values and Portsmouth CAMHS team ethos. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidates will be offered training on how to complete Neurodevelopmental assessments, regular 1:1 line management as well as individual, team and therapeutic models clinical supervision. Whilst also having an opportunity to join clinical case discussion meetings, peer supervision groups and regular academic learning events. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;In addition, we now have a CAMHS Academy competency framework that will support practitioners to develop within a children&#39;s mental health service and will therefore support those who may have passion and transferable skills but limited experience of working with children or young people.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting time to join a dynamic and innovative CAMHS service, whilst focusing on Neurodevelopmental presentations. The Portsmouth CAMHS team is a forward thinking, specialist Multi-Disciplinary Team, working hard to deliver clinical care pathways, using evidence-based practice, to ensure timely and effective interventions are offered to children, young people and their families that maximise mental health and maintain children and young people within their home and educational environment. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact Nigel Sampson, Operational Manager on 0300 123 6632.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Portsmouth is located within the county of Hampshire which is a beautiful county with excellent transport network linking with the neighbouring counties of Surrey, Wiltshire, Berkshire and Sussex. It is the third largest shire county in the UK and the largest county in South East England. It has many tourist attractions such as the historical Cathedral City of Winchester, National Parks in the New Forest and the South Downs and two of the largest ports (Southampton and Portsmouth) in England, to name a few.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews for this post will take place on 25th November at Falcon House, Portsmouth. Please note that social distancing measures will be in place.&lt;/strong&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO4 8LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7971", "longitude": "-1.05012"}}, "title": "Neurodevelopmental Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243249", "validThrough": "2020-11-19T23:59:59+0000"}