{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum, inc HCA"}}, "datePosted": "2020-11-06T09:16:04+0000", "description": "&lt;p&gt;&lt;strong&gt;Team Leader – Cardiac Theatres&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours - Full Time 37.5 hours /week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary…….&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/p&gt;\n&lt;p&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/p&gt;\n&lt;p&gt;King’s College Hospital (KCH) NHS Foundation Trust provides comprehensive health care and emergency services for a diverse community. KCH is part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), a pioneering collaboration between King&#39;s College London, and Guy&#39;s and St Thomas&#39;, King&#39;s College Hospital and South London and Maudsley NHS Foundation Trusts. We are a major trauma centre and a tertiary centre for multiple specialties including trauma, cardiac, liver &amp; neuro and advanced laparoscopic surgery.&lt;/p&gt;\n&lt;p&gt;Presently we have a full-time vacancy for band 6 theatre nurses to join the Cardiac team. Applicants must be Registered Nurses or ODPs who hold appropriate post basic qualification or relevant theatre experience. The successful candidate will be expected to deputise and represent the Cardiac Theatres in various departmental forums. He/she will organise and participate in the on-call rota to scrub on cardiac emergency surgical interventions. Whilst mentorship is desirable the successful candidates must be able to demonstrate a portfolio of teaching and evidence associated feedback at interview.&lt;/p&gt;\n&lt;p&gt;You will have the motivation, vision and leadership qualities necessary to lead a safe, productive and efficient cardiac team. As a key member of the team, you will have the ability to support, teach and develop junior staff and facilitate the delivery of high standards of patient care in the operating theatres. You are required to have excellent communication skills and communicate effectively with the MDT, Head of Nursing, Lead Nurse and Matrons, be a team player, be empathetic and be able to remain calm and steady under pressure. This role also requires a reassuring manner and the understanding of the rights, privacy &amp; dignity and safeguarding of all patients.&lt;/p&gt;\n&lt;p&gt;The department is committed to appraisal and supporting continuous education and professional development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKarissa FabroJob titleClinical CoordinatorEmail addresskfabro@nhs.netTelephone number0203 299 7434Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Noryll Gimeno, Cardiac Theatre Matron Tel: 0203 299 5460; ngimeno@nhs.net&lt;/p&gt;\n&lt;p&gt;Karissa Fabro Theatre Band 7 Tel: 0203 299 7434; kfabro@nhs.net&lt;/p&gt;\n&lt;p&gt;Please apply on line either through the King’s website or the NHS jobs website. Only applications on-line will be accepted. An application form, job description and King’s-specific information can be downloaded from either the King’s website or the NHS Jobs Website&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Band 6 Team Leader - Cardiac Theatre Scrub Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258989", "validThrough": "2020-11-19T23:59:59+0000"}