{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35500", "minValue": "35500", "unitText": "YEAR", "value": "up to £35,500 plus enhancements"}}, "datePosted": "2020-11-03T14:11:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff/Senior Staff Nurse (RNLD &amp; RMN) – Sycamore Ward,  ASD &amp; Learning Disabilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Northampton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: up to £35,500 plus enhancements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why St Andrew&#39;s Healthcare?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;St Andrew’s is the UK’s largest mental health charity and a unique provider of specialist care in mental health and learning disability. We aspire to deliver truly world class, holistic services within our outstanding, modern facilities. Our independence means we can always put patients’ interests at the heart of decision making, while re-investing surpluses in frontline services. We are currently transforming the Charity to deliver ‘Value Based Healthcare’. This will ensure our patients consistently get the best possible outcomes and local teams gain more control and responsibility.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our patients and your colleagues will expect you to live the St Andrew’s CARE values of Compassion, Accountability, Respect and Excellence every single day&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sycamore Ward&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Sycamore is a bespoke 4 bedded enhanced support medium secure ward for women with learning disabilities who present with challenging behaviours and high levels of risk. Patients admitted to the ward are typically long stay in-patients who cannot tolerate busy ward environments needing high levels of staffing intervention (enhanced support).&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Our aim is to improve our patient’s quality of life, support them with their individualised treatment plans and focus on a treatment goal of reducing enhanced support and re-integration back into a general ward environment or a structured community placement.&lt;/p&gt;\n&lt;p&gt;We are looking for individuals who are interested in working on a high dependency enhanced support ward, be part of an intensive staff team and MDT care model to deliver excellent patient care and treatment.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you feel you have the skills to support our patient group and being part of their recovery, we look forward to hearing from you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Some of the main duties of a Senior Staff Nurse are to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plan, organise and deploy staff according to competencies and workload in order to meet patient needs.&lt;/li&gt;\n&lt;li&gt;Develop, implement, review and promote the importance of effective outcome focused care plans to meet individual preferences and needs, attending and contributing to ward rounds.&lt;/li&gt;\n&lt;li&gt;Effectively communicate with all MDT members, taking positive risks to manage the care environment and reduce the use of restrictive practices.&lt;/li&gt;\n&lt;li&gt;Build and monitor ongoing relationships with patients, their families and carers to encourage trust, whilst listening to and interpreting their needs and concerns.&lt;/li&gt;\n&lt;li&gt;Ensure all patient records, records of risk and interventions that have been taken, are up to date and accurate.&lt;/li&gt;\n&lt;li&gt;Use refection and supervision to learn from events and generate opportunities to improve patient outcomes.&lt;/li&gt;\n&lt;li&gt;Receive and provide clinical supervision.&lt;/li&gt;\n&lt;li&gt;Support the division to deliver specific outcome measures.&lt;/li&gt;\n&lt;li&gt;Complete required ward audits in line with the Clinical Governance strategy. &lt;br /&gt; &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;br /&gt;You will have in depth experience of working with challenging patients in a mental health service. Being a strong team player, you will be able to build and maintain effective relationships across clinical teams. You will have good interpersonal skills with the ability to develop rapport with patients. You will also be highly resilient, able to work under pressure and have good problem solving skills. You will have an active NMC registration and have completed your preceptorship. &lt;br /&gt; &lt;br /&gt;&lt;strong&gt;We offer an excellent package that includes:&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt;•                Excellent professional and career development and training opportunities&lt;br /&gt;•                ‘Transform’ our Leadership development program&lt;br /&gt;•                Pension and life assurance&lt;br /&gt;•                Sickness policy on par with the NHS&lt;br /&gt;•                38 days annual leave, increasing further with service (including bank holidays)&lt;br /&gt;•                Access to huge savings through retail discount and cashback schemes from St Andrew’s Reward Gateway, Blue Light Card and Health Service Discounts&lt;br /&gt;•                Cycle to work scheme&lt;br /&gt;•                Healthcare cash plan&lt;br /&gt;•                Free parking&lt;br /&gt;•                Paid DBS application&lt;br /&gt; &lt;br /&gt;&lt;strong&gt;Interested?&lt;br /&gt; &lt;br /&gt;Then we’d love you to apply here or email your interest to recruitment@standrew.co.uk &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton", "postalCode": "NN1 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2382", "longitude": "-.873687"}}, "title": "Staff/Senior Staff Nurse (RNLD &amp; RMN) - Sycamore Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254273", "validThrough": "2020-11-29T23:59:59+0000"}