{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum +Outer London HCAS"}}, "datePosted": "2020-10-21T18:00:27+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Clinical Psychologist&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are delighted to be able to offer the opportunity to join our innovative Adult Community Mental Health Services in Barnet. We are looking to recruit a Band 7 Clinical Psychologist to work across a multi-disciplinary mental health team and a specialist Psychology Hub. This is a permanent and full-time (1.0 wte, 37.5 hours per week) post, and the post holder will work half-time (0.5 wte) in North Locality Team and half-time (0.5 wte) in the Barnet Psychology Hub.&lt;/p&gt;\n&lt;p&gt;The North Locality Team role involves joint-working and consultation with MDT colleagues, and the undertaking of specialist psychological assessments. The post holder will join a Band 8a Clinical Psychologist within the team, and access supervision from a senior psychologist. In the Barnet Psychology Hub is a psychological therapies team in which the post holder will work into specialist treatment pathways with a range of therapeutic approaches, and across the spectrum of mental health presentations with high levels of complexity - including anxiety and depression, personality disorders, PTSD, and psychosis. The Psychology Hub provides a range of therapeutic models including CBT, third wave, CAT informed, psychodynamic, systemic, and trauma-focused; and both individual and group formats. Specialist supervision is provided across therapeutic models and presentations to support the delivery of our psychological interventions.&lt;/p&gt;\n&lt;p&gt;This post is an excellent opportunity to develop skills in a broad range of areas of adult mental health. In addition, the development of special interests and skills development is well supported and encouraged within the team (e.g. PTSD, psychosis, personality disorder). The Hub model provides a range of opportunities for continuing professional development with access to specialist CBT, integrative, and psychoanalytic models. In addition, the Trust has launched a CPD programme specifically for Band 7 &amp; 8a psychological therapists which you would be able to access.&lt;/p&gt;\n&lt;p&gt;Interview Dates: &lt;strong&gt;Wednesday 25th and Thursday 26th November &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We would encourage interested candidates to call and speak to:&lt;/p&gt;\n&lt;p&gt;Dr Richard Rushe&lt;/p&gt;\n&lt;p&gt;Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Lead for the Barnet Psychology Hub&lt;/p&gt;\n&lt;p&gt;richard.rushe@nhs.net&lt;/p&gt;\n&lt;p&gt;Tel: 0208 702 4394&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet /Psychology Hub &amp; North Locality Team", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237475", "validThrough": "2020-11-15T23:59:59+0000"}