{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-03T12:01:01+0000", "description": "&lt;p&gt;Full or part time hours are available (minimum 22.5 hours per week)&lt;/p&gt;\n&lt;p&gt;The post would involve working over the 7 day period on a rota basis.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting time for Northamptonshire Community Hospitals as we continue to widen our provision of care to enable care closer to home for patients by increasing the number of stroke beds. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are expanding our specialist stroke rehabilitation team at Isebrook hospital, so it is an ideal opportunity to join this established team. The Isebrook hospital stroke beds are part of the established County stroke pathway provision and work closely with our partners in other organisations providing seamless stroke care from admission to discharge.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a Band 6 Senior physiotherapist you would be responsible for managing a group of patients which would include all physio assessments on admission, treatments and providing clinical expertise’s whilst an inpatient though to complex discharge planning to achieve a successful discharge for patients. You would also be involved with staff development by carrying out appraisals and supervision and developing their personal developing plans, acting as a mentor for students and providing on the job training to all ward based staff.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust as an excellent leadership development programme which you would also be encouraged to attend as well as further developing your clinical skills.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Multi-disciplinary working is key to successful discharge planning; individuals are required to be highly motivated, forward thinking with excellent communication and interpersonal skills. Good literacy and IT skills are essential as the ward maintain electronic patient records.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namevanessa crossJob titleservice and practice development facilitatorEmail addressvanessa.cross@nhft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Liz Metcalfe - Therapy lead - liz.metcalfe@nhft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isebrook hospital, wellingborough", "postalCode": "NN8 1LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2977", "longitude": "-.683342"}}, "title": "Senior Stroke Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253857", "validThrough": "2020-11-17T23:59:59+0000"}