{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "As per the national pay scale"}}, "datePosted": "2020-11-04T11:04:33+0000", "description": "&lt;p&gt;Applications are invited for appointment to sub-specialty training placements in stroke medicine across England and Wales,starting from 4 August 2021.&lt;/p&gt;\n&lt;p&gt;The application window opens on &lt;strong&gt;Thursday 12 November 2020 &lt;/strong&gt;at &lt;strong&gt;10.00am &lt;/strong&gt;(UK time) and closes on &lt;strong&gt;Thursday 3 December 2020 &lt;/strong&gt;at&lt;strong&gt; 4.00pm &lt;/strong&gt;(UK time). You will not be able to submit your application after this time. Please ensure that you have completed all the relevant sections of the application form as missing information will deem your application incomplete and it will not be considered.&lt;/p&gt;\n&lt;p&gt;You must apply via our online recruitment system, Oriel. Oriel can be accessed from the link provided. Registration is available to applicants now.&lt;/p&gt;\n&lt;p&gt;The qualifications and professional registration requirements plus other eligibility criteria can be found in the person specification. The person specification for this specialty is available from the Specialty Training website which can be accessed via the link provided.&lt;/p&gt;\n&lt;p&gt;Vacancy numbers are published to the stroke medicine section of the ST3 Recruitment website as confirmed by each region and provisional information will be available by the opening date for applications. The website of each region has information about their training programme.&lt;/p&gt;\n&lt;p&gt;Upon satisfactory completion of training in stroke medicine, trainees will be eligible to have the sub-specialty included in their entry in the GMC’s Specialist Register.&lt;/p&gt;\n&lt;p&gt;These posts do not attract a new National Training Number (NTN). Applicants must hold an existing NTN in one of the parent specialties which includes acute internal medicine, cardiology, clinical pharmacology and therapeutics, general internal medicine (single accredited programmes only), geriatric medicine, neurology and rehabilitation medicine.&lt;/p&gt;\n&lt;p&gt;Recruitment to this specialty in this round will be managed by Health Education Thames Valley, who will manage all longlisting of applications, manage the online interviews and make offers on behalf of all regions.&lt;/p&gt;\n&lt;p&gt;Candidates will not need to give preferences of particular regions or posts at the time of application. Those candidates who are subsequently shortlisted for interview will be invited to give preferences around the time of interview.&lt;/p&gt;\n&lt;p&gt;For further queries contact the Physician Specialty Recruitment Office via email: st3medrecruitment@hee.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England London and the South East", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123901"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "England, Wales", "postalCode": "WC1B 5DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5211", "longitude": "-.127467"}}, "title": "Stroke medicine sub-specialty training registrar", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255534", "validThrough": "2020-12-03T23:59:59+0000"}