{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393"}}, "datePosted": "2020-10-29T13:46:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Employer: St George’s University Hospitals NHS Foundation Trust&lt;br /&gt;&lt;br /&gt;Department: Occupational Therapy &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Grade: Band 7 – Critical Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time: 37.5 hours/week including weekend working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term for 6 months&lt;br /&gt;&lt;/strong&gt;________________________________________&lt;br /&gt;St. George’s University Hospitals NHS Foundation Trust is one of the UK’s largest healthcare organisations and is integrated with Community Services Wandsworth. The Trust shares its main hospital site in south west London with St George’s University of London, and is linked to Kingston Faculty of Health and Social Care Sciences. St George’s has an established national and international reputation as a leading hospital for specialist care including neurosciences, cardiac care, stroke and cancer. We also provide excellent local care to the residents of Wandsworth, and regional care as both an acute, hyper acute stroke unit and trauma centre.&lt;br /&gt;&lt;br /&gt;As well as acute hospital services, St George’s University Hospitals NHS Foundation Trust provides a wide variety of specialist and community hospital based care and a full range of community services to children, adults, older people and people with learning disabilities. These services are provided from Queen Mary’s Hospital, Roehampton, 11 health centres and clinics, schools and nurseries, patients’ homes and Wandsworth Prison. We employ 8,000 staff, have an annual income of c£620m, around 1,100 beds and we serve a population of 1.3 million across south west London.&lt;br /&gt;________________________________________&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;As part of St George’s COVID 19, Flu and Winter Plan, an exciting opportunity has become available to recruit highly specialist Occupational Therapists to join the existing Occupational Therapy service and support the expansion of critical care which currently consists of separate units for neuro, cardiac and general critical care. The post holder will have experience of working in acute medicine/surgery, critical care, neurosciences and major trauma. The post holder will have advanced communication and negotiation skills and be a strong team player.&lt;/p&gt;\n&lt;p&gt;The post holder will collaborate closely with the multidisciplinary team, supported by the OT Team Leads in conjunction with the wider OT team. The post holder will provide and receive regular clinical supervision and support to enhance specialist clinical skills. They will be joining a highly proficient, professional, patient centred and innovative Occupational Therapy team offering excellent support and well established CPD opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For enquiries regarding this post, please contact Kyra Hamilton, Principal Occupational Therapist for neurosciences on kyra.hamiltonstgeorges.nhs.uk or 02087251365 or Cheryl Edwards, Principal Occupational Therapist for acute neurosciences on cheryl.edwards@stgeorges.nhs.uk or 020 8725 3193.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;For further information or to arrange an informal visit please contact Kyra Hamilton Principal Occupational Therapist for Neurosciences on 0208 725 1365 or email &lt;/span&gt;Kyra.hamilton@stgeorges.nhs.uk&lt;span&gt; or Cheryl Edwards Principal Occupational Therapist for Neurorehabilitation via email &lt;/span&gt;cheryl.edwards@stgeorges.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Georges Hospital, London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Band 7  Highly Specialist Occupational Therapist Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248564", "validThrough": "2020-11-12T23:59:59+0000"}