{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-05T15:02:28+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Job Title: Nursing Associate &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Department: Inpatient Services&lt;/p&gt;\n&lt;p&gt;Location: Whittington&lt;/p&gt;\n&lt;p&gt;Salary: £21,892 - £24,157&lt;/p&gt;\n&lt;p&gt;Working hours: Full time and part time hours available, working days and nights over seven days to cover a 24 hour service&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Application review date: 23rd&lt;/span&gt;&lt;span&gt;November 2020 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Interview date: Tbc&lt;/p&gt;\n&lt;p&gt;Are you passionate and committed to providing the best possible care to patients and their families who are experiencing terminal illness? Do you want to be part of a specialist multidisciplinary team delivering true holistic care in a state of the art setting?&lt;/p&gt;\n&lt;p&gt;We can offer comprehensive training and development including the opportunity to develop advanced clinical practice skills.&lt;/p&gt;\n&lt;p&gt;In addition to an excellent nurse: patient ratios, transferrable NHS pension, the chance to buy and sell annual leave and free parking.&lt;/p&gt;\n&lt;p&gt;Current NMC Registration, strong communication and team-working skills and an empathetic disposition are essential. Experience of hospice/palliative care is desirable. Applicants must have 12 months post registration experience working in a healthcare inpatient environment.&lt;/p&gt;\n&lt;p&gt;Company benefits:&lt;/p&gt;\n&lt;p&gt;To reward the hard work of our fantastic staff, St Giles Hospice offers an excellent benefits package as per the below.&lt;/p&gt;\n&lt;p&gt;- 27 days’ annual leave plus bank holidays (rising to 35 days with service)&lt;/p&gt;\n&lt;p&gt;- Contributory pension scheme&lt;/p&gt;\n&lt;p&gt;- Free car parking&lt;/p&gt;\n&lt;p&gt;- Training &amp; Development opportunities as well as progression within the organisation&lt;/p&gt;\n&lt;p&gt;About us:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;St Giles Hospice is a registered charity with a CQC rating of Outstanding&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;, &lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;providing high-quality medical and nursing care for local people living with cancer and other serious illnesses, as well as offering support for their families and helpers. Care is offered in a variety of ways according to the individual’s needs and is offered out in the community as well as from 3 sites, an inpatient unit at Whittington, with other day unit facilities at Sutton Coldfield, and Uttoxeter. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We receive funding from the NHS but primarily we rely on fundraising activities and legacies, together with trading activities (Shops, Lottery and other trading) to support our work. We employ more than 400 people across a broad range of roles – from direct patient care to fundraising and administration as well as support from over 1500 volunteers to provide our services.&lt;/p&gt;\n&lt;p&gt;Further details:&lt;/p&gt;\n&lt;p&gt;To find out more or have an informal chat please contact Sharon Meehan, Ward Manager 01543 434466.&lt;/p&gt;\n&lt;p&gt;This post is subject to a Disclosure and Barring Service (DBS) check&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We may review applications before the application review date, however, if you apply after the application review date, your application may not be considered. We will accept applications until we have successfully filled the role&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;All correspondence in response to applications will be sent via email. Due to the number of applications received, it is not always possible to respond to every application. Therefore, applicants who do not receive a response within 14 days of the review date should assume that they have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;St Giles Hospice, Fisherwick Road, Whittington, Lichfield, WS14 9LH. Registered charity 509014 Company limited by guarantee 1430090&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130216.jpg", "name": "St Giles Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130216"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whittington", "postalCode": "WS14 9LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6712", "longitude": "-1.763"}}, "title": "Nursing Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258251", "validThrough": "2020-11-23T23:59:59+0000"}