{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive including Benefits"}}, "datePosted": "2020-10-21T14:06:44+0100", "description": "&lt;p&gt;As an experienced Consultant in Reproductive Medicine/ Fertility Specialist you will perform all routine IVF procedures and deliver excellent service to CARE Fertility patients. You will have the opportunity to gain experience to allow you to diversify your knowledge as we provide training on more complex treatment pathways – something which CARE Fertility can uniquely offer, due to our leading position.&lt;/p&gt;\n&lt;p&gt;We are looking for a natural self- starter with a desire to continually develop themselves and we’ll encourage you to actively pursue research interest and contribute to the advancement of the clinical programmes and the success of CARE Fertility.&lt;/p&gt;\n&lt;p&gt;We offer unrivalled opportunities and this is an excellent role in which to further develop your career at CARE Fertility.&lt;br /&gt; &lt;strong&gt;&lt;br /&gt; The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide an exceptional consultation service to patients&lt;/li&gt;\n&lt;li&gt;Manage and plan patient treatment&lt;/li&gt;\n&lt;li&gt;Undertake patient treatments&lt;/li&gt;\n&lt;li&gt;Manage the assessment of emergency admissions, arranging appropriate onward referral where appropriate&lt;/li&gt;\n&lt;li&gt;Optimise patient experience by corresponding and communicating with patients (e.g. by phone, video, email, letter)&lt;/li&gt;\n&lt;li&gt;Independently establish priorities and manage deadlines&lt;/li&gt;\n&lt;li&gt;Comply with the GMC Good Medical Practice recommendations and CARE clinical protocols and guidelines&lt;/li&gt;\n&lt;li&gt;Identify, monitor and deliver fully against personal objectives using the management information provided to you&lt;/li&gt;\n&lt;li&gt;Recognise potential risks and resolve issues without putting the patient or business at risk&lt;/li&gt;\n&lt;li&gt;Promote CARE services through media interviews and educational meetings&lt;/li&gt;\n&lt;li&gt;Provide clinical support to nursing staff providing emergency telephone advice, when on call.&lt;/li&gt;\n&lt;li&gt;Suggest improvements to current policies and procedures&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A natural self-starter with the ability to be flexible and empathetic to deliver client needs&lt;/li&gt;\n&lt;li&gt;Qualifications including: &lt;br /&gt; -  MBBS, or equivalent medical qualification&lt;br /&gt; -  Full registration and licence to practice with the GMC&lt;br /&gt;-  MRCOG, or equivalent&lt;br /&gt;-  ATSMs in Subfertility and Assisted Conception, or equivalent&lt;/li&gt;\n&lt;li&gt;Essential to be competent in scanning, however, a qualification is desirable&lt;/li&gt;\n&lt;li&gt;Ability to prioritise and adapt to meet patient and business need&lt;/li&gt;\n&lt;li&gt;Excellent problem-solving and research skills&lt;/li&gt;\n&lt;li&gt;Excellent verbal and numerical skills&lt;/li&gt;\n&lt;li&gt;Flexible and able to independently judge potential situations, identify and take alternative courses of action without putting the client or business at risk&lt;/li&gt;\n&lt;li&gt;Excellent interpersonal and communication skills&lt;/li&gt;\n&lt;li&gt;Act as a CARE Fertility ambassador&lt;/li&gt;\n&lt;li&gt;A desire for continuous personal and professional development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Company&lt;br /&gt; &lt;br /&gt; &lt;/strong&gt;CARE Fertility is the one of the largest independent providers of fertility treatments in the world and draw on the knowledge of our wider team of over 600 dedicated doctors, embryologists, nurses and support staff who all work together to ensure our patients get the very best chance of success.&lt;/p&gt;\n&lt;p&gt;Our excellent service to our patients has allowed for market growth which means we continuously seek new and fresh talent to complement our current team as well as developing our people to reach their full potential. Join our team and look forward to a challenging and rewarding role, with great results bringing great opportunity for recognition and promotion with the CARE Group.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;A relocation package is on offer (subject to HMRC rules).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced DBS check.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "CARE Fertility", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tunbridge Wells", "postalCode": "TN4 9LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1411", "longitude": ".261737"}}, "title": "Consultant in Reproductive Medicine/ Fertility Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236757", "validThrough": "2020-11-22T23:59:59+0000"}