{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-03T15:16:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you currently a Band 5 Physiotherapist looking to progress? Or a band 6 Physiotherapist looking to build further knowledge and skills in a community setting?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an enthusiastic and motivated Physiotherapist to join our community rehabilitation team in Swaffham. You will be part of a friendly and experienced team of Physiotherapists, Occupational Therapists and Community Assistant Practioners.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There will be an opportunity to work with patients located in community inpatient units and residential homes, as well as providing rehabilitation to patients within their own homes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have the opportunity to progress their clinical knowledge and skills through our in-service training program and will participate in regular supervision. There will also be opportunities to develop your managerial skills through regular supervision of junior staff.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are looking to develop and progress your clinical skills and are passionate about delivering rehabilitation to patients in the community, this is the job for you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is essential the post holder has the ability to prioritise their own caseload and has access to transport, to travel to patients across Swaffham and the surrounding areas.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;West Norfolk is an area of contrast and beauty situated close to the borders of Cambridgeshire and Lincolnshire. Apply now to join an organisation that has been awarded an ‘Outstanding’ rating by the Care Quality Commission (CQC), the highest possible rating and the first stand-alone NHS community trust in the country to be awarded the title.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Leanne Williamson, leanne.williamson@nchc.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;07919535120&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk Community Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120940"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swaffham Community Hospital, Swaffham", "postalCode": "PE37 7HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6511", "longitude": ".691988"}}, "title": "Community Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254516", "validThrough": "2020-11-25T23:59:59+0000"}