{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-30T14:44:29+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“Newly Qualified Applications Considered”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Turning Point, we are recognised leaders in helping people recover from addiction and gain control of their lives. By providing the right support at the right time, and making sure that people can find all the help they need through a single point of contact, we have grown into one of the largest providers of substance misuse services in England and Wales. Right now, we are now looking for a talented Chartered Clinical or Counselling Psychologist to ensure the effective management, development and delivery of all psycho-social interventions within our community-based substance misuse services in Wakefield.&lt;/p&gt;\n&lt;p&gt;Wakefield Inspiring Recovery is a fully integrated adult service delivered by Turning Point from July 2020. Wakefield Inspiring Futures is the substance misuse service for young people up to the age of 25. There will be a focus on partnership working throughout the services to help those in the local community who need support to achieve their goals. We will deliver treatment and support across Wakefield District, ensuring a holistic and inclusive approach to recovery in this new all age drug and alcohol service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will offer clinical guidance, training and leadership to a team that delivers psycho-social interventions to both individuals and groups. You will use your expertise to build on a range of innovative approaches with people who use substances. In addition to being responsible for the systematic governance of these and other services, you will offer practical advice on CBT and other evidence-based psychological interventions to colleagues as well as local agencies and organisations. Inspiring, developing and coordinating everyone on your team will of course, be a vital part of your role. We will also expect you to have a small caseload of service users with complex needs, providing specialist psychological assessments and therapies.&lt;/p&gt;\n&lt;p&gt;Beyond the operational level, you will have a significant impact on the strategic direction and development of the service as a whole. This will include building strong professional links with other statutory and voluntary service providers and using your expertise to put relevant support and education structures in place. You will also explore ways to continuously improve our services and integrate wider issues - housing, employment and finances, for example – into the overall treatment process. You will be invited to work with our national team of Clinical, Counselling and Forensic Psychologists to develop psychological and psycho-social approaches used across services and to pursue a therapeutic specialism that fits with service needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Along with up to date registration through the Health and Social Professions Council (HCPC) as a Clinical, Counselling or Forensic Psychologist, you will need a doctorate in your professional specialism and proven ability to deliver psychological services. Your experience of leading and supervising clinical staff will ideally be supported by experience of working with substance misuse Service Users. Formal training in supervision, whilst not essential, would be desirable. Excellent communication skills, adaptability and commitment to the Recovery Agenda, will all contribute to you becoming a vital member of our clinical leadership team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from&lt;em&gt;Investors in People&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;33 days’ paid holiday a year, increasing with each year of service up to 35 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 3AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6844", "longitude": "-1.4971"}}, "title": "Chartered Clinical, Counselling or Forensic Psychologist - Wakefield", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250615", "validThrough": "2020-11-30T23:59:59+0000"}