{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T11:08:56+0000", "description": "&lt;h2&gt;&lt;strong&gt;Administration Manager - Band 5 37.5 hrs - (Internal Candidates only)&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Medical Specialties Directorate&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Band 5 Administration Manager to work for the Medical Specialties Directorate.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The successful candidate will be a highly motivated, enthusiastic individual who can work in a fast paced and ever changing environment supporting the Deputy General Managers in the delivery of divisional business objectives taking personal responsibility for designated objectives. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Proven management skills and a track record of effective communication and organisational skills are essential. You will be expected to have an understanding of the Medical Secretarial role and responsibilities, along with a wider knowledge of the NHS and its performance targets. You will develop, implement and monitor standardised processes across the administrative teams.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This is a very busy and demanding role and flexibility will be needed from the right candidate. In return you will gain operational experience and work alongside a supportive and cohesive team where development is encouraged.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The key elements of the role are:&lt;/p&gt;\n&lt;p&gt;Line management of administrative teams while ensuring continuous service development, responsive to the needs of the organisation, including all aspects of Human Resource management and recruitment.&lt;/p&gt;\n&lt;p&gt;Assisting with medical flow and bed capacity&lt;/p&gt;\n&lt;p&gt;Responsibility for the delivery of specific key performance indicators (KPIs) eg: Data Quality, RTT tracking (including identifying and assisting with training issues)&lt;/p&gt;\n&lt;p&gt;Working in conjunction with the Deputy General Managers and other relevant staff within the Trust, to ensure the optimum administrative flow of patients through outpatient and inpatient services.&lt;/p&gt;\n&lt;p&gt;To support the Deputy General Manager in the delivery of Medical Division business objectives taking personal responsibility for designated tasks.&lt;/p&gt;\n&lt;p&gt;To discuss this opportunity further, please contact Jenny Connaughton, Deputy General Manager on extension 5330&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Administrative Manager - WVT Employees Only", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251720", "validThrough": "2020-11-10T23:59:59+0000"}