{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-03T11:03:48+0000", "description": "&lt;p&gt;&lt;strong&gt;PREVIOUS APPLICANTS NEED NOT APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity for a Senior Learning and Development Facilitator (Professions) has arisen in a dynamic and forward thinking Learning and Development team. Are you a qualified health care professional working as a clinical skills facilitator or working in clinical education? If so we are interested to hear from you.&lt;/p&gt;\n&lt;p&gt;The post holder will have responsibility for leading the design and delivery of training interventions to support the clinical workforce. The successful candidate will work together with the Learning and Development team and professional leads to undertake clinical learning needs analysis and support the development of a new and evolving workforce. The post holder will have responsibility for the design and delivery of the Trust Care Certificate programme.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic qualified health care clinician with experience of using blended learning approaches to designing learning interventions within complex environments. The post holder will have line management responsibilities and experience in people management is essential.&lt;/p&gt;\n&lt;p&gt;For further information please contact Kerry Gillott, Learning and leadership development Manager at kerry.gillott@swyt.nhs.uk or telephone 07785 414004.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 3SP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6988", "longitude": "-1.49218"}}, "title": "Senior Learning &amp; Development Facilitator - Professions", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253616", "validThrough": "2020-11-17T23:59:59+0000"}