{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-11T12:30:20+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse - Orthopaedic Trauma Unit (Trueta/Heygroves Ward)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an outstanding registered nurse who enjoys working in a diverse, exciting &amp; rewarding clinical area? Do you like that no two days are ever the same? Do you have a passion for trauma, spinal injury, head injury and poly trauma patients? If yes then the Trauma Unit is the place for you. We have an exciting opportunity for a staff nurse to join our friendly, professional, successful and outstanding team.&lt;/p&gt;\n&lt;p&gt;We offer great opportunities for further development in your career. We hold weekly ward teaching sessions alongside consultant led teaching. We have an active advanced trauma nurse team who hold regular teaching on traction and spinal injuries, bi-yearly trauma specific SDs as well as a Trauma Immediate Life Support course.&lt;/p&gt;\n&lt;p&gt;We also offer further development by offering level 6 &amp; 7 courses linked to the local universities. We can offer OSCE support for international nurses. There is a preceptorship programme for newly qualified nurses, which is supported by the trust. We also have opportunities for link roles if you have a passion in a certain area of nursing and can offer training in that area to improve your role.&lt;/p&gt;\n&lt;p&gt;We ensure that all of our staff are supported in the working environment by always having a band 6 SSN on duty during the day, and during some night shifts. We have a supervisory band 7 Sister and an active practice education team who can work alongside staff as required. We offer a two week supernumerary induction programme on the ward to help new staff settle into our team.&lt;/p&gt;\n&lt;p&gt;The trauma team works closely with the dedicated fractured neck of femur unit, collaborating across specialities including ortho-geriatricians, medical and surgical teams.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sister Claire Manton on 0118 322 7541 or claire.manton@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Staff Nurse - Orthopaedic Trauma Unit (Trueta/Heygroves Ward)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221431", "validThrough": "2020-11-14T23:59:59+0000"}