{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-19T12:01:13+0100", "description": "&lt;p&gt;We have exciting opportunities for Emergency Physicians looking to work in one of the largest single-site Major Trauma Centers in the UK.&lt;/p&gt;\n&lt;p&gt;The Emergency Department has an attendance of 195,000 new patients each year, including 45,000 children, seen in a co-located Paediatric Emergency Department. The department has a large academic and clinical skills area and has a strong education and research ethos.&lt;/p&gt;\n&lt;p&gt;The Adult ED has recently undergone an estates upgrade creating capacity for a 30 cubicle Majors Unit, and an Urgent Treatment Unit staffed by primary care and EM clinicians.  The Paediatric Emergency Department has 8 cubicles and a further 5 examination rooms.  There is a joint adult and paediatric resus room.&lt;/p&gt;\n&lt;p&gt;At this time, the department has been re-configured to manage a split COVID and non-COVID department.&lt;/p&gt;\n&lt;p&gt;We work closely with all our speciality teams to facilitate early access to appropriate care pathways.&lt;/p&gt;\n&lt;p&gt;Our Advanced Clinical Practitioner (ACP) Service is recognised as one of the best in the country.&lt;/p&gt;\n&lt;p&gt;You will join a friendly and dedicated team of 29 Consultants, 4 of which are exclusively paediatrics, working on a flexible annualised rostering system. You will be forward thinking and willing to work in a team as a role model and clinical leader alongside our multi-disciplinary workforce. Your experience, skills and knowledge will be used to think creatively, support others to develop to the best they can be and to be part of the vision to be a world-class center of excellence.&lt;/p&gt;\n&lt;p&gt;If you are a motivated emergency physician, this is the post for you. Appropriate qualifications and experience are outlined in the job description and person specification.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THIS JOB DESCRIPTION DOES NOT HAVE ROYAL COLLEGE APPROVAL&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Frank Coffey, Head of Service ED, tel 0115 9249924 ext 82712, Mobile: 07964475692, email Frank.coffey@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham University Hospitals NHS Trust - Queen&#39;s Medical Centre campus, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232141", "validThrough": "2020-11-16T23:59:59+0000"}