{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T11:31:15+0100", "description": "&lt;p&gt;We are looking for enthusiastic nurses to join our Adult Community Mental Health Services in East Hertfordshire.&lt;/p&gt;\n&lt;p&gt;We can offer you a competitive salary, staff benefits package and excellent career development and training that comes from working for Hertfordshire Partnership University NHS Foundation Trust . In addition this post attracts a £6,000 Recruitment &amp; Retention premia. T&amp;C’s apply and opportunities to join a fast track Band 5 to Band 6 career pathway.&lt;/p&gt;\n&lt;p&gt;Our local Adult Community Mental Health Services are developing mini teams to enhance our clinic provision for medicines administration and physical health support. This is an excellent opportunity to develop your knowledge of nursing in a community setting, working closely with colleagues in a small supportive team, and making a real difference to the quality of services.&lt;/p&gt;\n&lt;p&gt;You will be part of a supportive multi-disciplinary team who work creatively, collaboratively and compassionately to deliver the very best standards of care. The successful candidate have regular supervision, and continuing professional development opportunities.&lt;/p&gt;\n&lt;p&gt;As a University Trust, we have close links to the University of Hertfordshire, providing excellent learning and development opportunities for staff, as well as strengthening clinical research.&lt;br /&gt;&lt;br /&gt;Newly qualified Band 5 community nurses are supported in their transition from student to nurse through a 12 month preceptorship programme. We also offer the opportunity to apply for fast track programmes for Band 5 nurses to support rapid progression to Band 6.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGarikayi TeeraJob titleService ManagerEmail addressgarikayi.teera@nhs.netTelephone number07880082168&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cygnet House, Priory Street, Ware, SG12 0DE, Ware", "postalCode": "SG12 0DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8119", "longitude": "-.037244"}}, "title": "Community Mental Health Nurse with Recruitment Incentive", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240327", "validThrough": "2020-11-06T23:59:59+0000"}