{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-10-13T10:32:11+0100", "description": "&lt;p&gt;We currently have vacancies for Band 6 Occupational Therapists in the Kensington &amp; Chelsea Adult Community Mental Health Teams based in W10 and SW10. We are seeking enthusiastic, flexible and motivated team players with a degree or diploma in Occupational Therapy, HCPC Registration with extensvie post qualification experience working in mental health. You will be joining the teams at an exciting time of transformation with the opportunity to develop your OT role and to create close links with primary care services.&lt;/p&gt;\n&lt;p&gt;The postholders will work within the multi disciplinary team and will provide Occupational Therapy interventions and assessments for individuals. As part of our current community transformation programme the Occupational Therapists play a key role in supporting our services users to maximise the community opportunities in the borough and play a valuable role in facilitating discharges and transfers. There will be opportunity to work very creatively in establishing your role and you should have excellent communication skills and effective team working to establish good relationships with other services and with the many organisations in the borough.&lt;/p&gt;\n&lt;p&gt;The OT will provide interventions to support clients with their health and wellbeing goals, set up and facilitating groups / clinics and providing recovery focussed interventions. The Occupational therapists provide case work, functional assessments and home assessments to individuals as required, for environmental adaptations, the provision of equipment/aids and recommendations for support packages.&lt;/p&gt;\n&lt;p&gt;The post holder will have the opportunity to work with the CNWL Recovery &amp; Wellbeing College in co-producing and facilitating recovery focussed courses and workshops as a part of the Kensington and Chelsea Recovery College spoke.&lt;/p&gt;\n&lt;p&gt;Clinical and professional supervision will be provided plus good team support and training opportunities. Supervision of junior staff and offering practice placements to OT students is a key part of the role. CNWL NHS Foundation Trust provides excellent support and opportunities for training and development, and the OT service in CNWL has a robust Research and Development structure with opportunities for training, audit and research.&lt;/p&gt;\n&lt;p&gt;The Community team hubs are located at Nightingale Place, Chelsea SW10 and Barlby Road, W10 and support a diverse population. The multi-disciplinary teams are comprised of other Occupational Therapists, Medical staff, Nurses, Psychology, Social Workers, Support workers, Peer Support and an Employment Specialist in addition to close links with Arts Psychotherapies. &lt;/p&gt;\n&lt;p&gt;Interview Date:TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Jo Batten&lt;/p&gt;\n&lt;p&gt;Job title K&amp;C Adults Lead OT&lt;/p&gt;\n&lt;p&gt;Email address jo.batten@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07714092039&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Kensington &amp; Chelsea Mental Health Centre / Pall Mall Mental Health centre, London", "postalCode": "SW10 9NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.180208"}}, "title": "Community Mental Health Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223835", "validThrough": "2020-11-14T23:59:59+0000"}