{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "From £31,365 per annum"}}, "datePosted": "2020-10-29T12:31:00+0000", "description": "&lt;p&gt;&lt;em&gt;Based at South Gloucestershire CAMHS - Kingswood Hub and Patchway Hub&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Do you have a desire to work with children, young people and their families? If yes, this could be the vacancy you have been looking for if...&lt;/p&gt;\n&lt;p&gt;- You already have experience and skills in working with this group (ideally within a CAMHS setting) and are looking for a new opportunity?&lt;/p&gt;\n&lt;p&gt;- Or have significant experience working with adults with mental health difficulties and would like the opportunity to transfer these skills to working with this rewarding age group?&lt;/p&gt;\n&lt;p&gt;We are looking for a full-time week Band 6 clinician to join our South Gloucestershire CAMHS Locality Team. This post is a developmental post to help develop your CAMHS clinical skills. We welcome applications from a range of qualified and registered professionals (e.g. Mental Health Nurses, Child Psychotherapists, Family Therapists, Clinical Psychologists and Occupational Therapists) with good assessment/risk assessment skills and a flexible approach.&lt;/p&gt;\n&lt;p&gt;We are a supportive, experienced and progressive multi-disciplinary team. You will have the opportunity to develop skills assessing children, young people and families and ensuring they receive evidence based and effective interventions in a timely manner. We offer individual, family and group interventions which may be time limited or longer term therapies according to need.&lt;/p&gt;\n&lt;p&gt;South Gloucestershire CAMHS has radically transformed in recent years evidenced by our recent improved CQC rating to Good. This includes significantly improved waiting times; improved staff retention; fantastic team skill mix and opportunities for innovative practice. A recent example is producing a series of professionally filmed videos to provide an online group and resources for young people with emotional dysregulation. We also strive to provide compassionate leadership as we recognize the importance of staff well-being. As part of the wider local CAMHS service we are moving towards an I-Thrive approach to ensure our service is more responsive, accessible and effective.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Avon and Wiltshire Mental Health Partnership NHS Trust &lt;/em&gt;(AWP) is proud to be included in the Inclusive Top 50 UK Employers. We recognize the positive value of diversity, promote equality and challenge discrimination. We welcome and encourage job applications from people of all backgrounds.&lt;/p&gt;\n&lt;p&gt;We welcome potential applicants to make contact to discuss the opportunities of this role&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Michelle Blackler, S Glos Clinical Service Manager, 01454 862 431, m.blackler@nhs.net&lt;/p&gt;\n&lt;p&gt;Lisa Hughes - Senior Clinical Psychologist 01454 862 431 or lisa.hughes27@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS15 4DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4626", "longitude": "-2.49993"}}, "title": "Band 6 Mental Health Practitioner - South Glos", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248316", "validThrough": "2020-11-15T23:59:59+0000"}