{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6"}}, "datePosted": "2020-11-03T13:28:32+0000", "description": "&lt;p&gt;&lt;strong&gt;Acute Oncology Band 6 Deputy Clinical Nurse Specialist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;St Mary’s Hospital, Newport, Isle of Wight&lt;br /&gt; &lt;br /&gt; 37.5 hours per week &lt;br /&gt; Agenda for Change - Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Do you have the required enthusiasm and commitment to becomean advanced practitioner to take on this specialist nursing role. Working with the Band 7 Acute Oncology Clinical Nurse Specialist, the role provides key membership as part of the Acute Oncology multidisciplinary team. The post requires vision, innovation and the ability to work across professional boundaries, underpinned by a real desire to provide the highest standards of patient care measured by prospective audit and national protocols.&lt;/p&gt;\n&lt;p&gt;This post will work in collaboration with, and autonomously as part of, the Acute Oncology team to help develop and deliver the optimal acute oncology pathway across organisational, professional and geographical boundaries. This role will work closely with key areas of the Trust, forging close working relationships with the visiting consultants from the Cancer Centres, the Medical and Cancer teams and the Specialist Palliative Care team.&lt;/p&gt;\n&lt;p&gt;It is essential that you possess a high level of up-to-date relevant clinical knowledge and experience in Acute Oncology, Cancer Care or Specialist Palliative Care with evidence of ongoing continuous professional development with commitment to attain MSC. You must be highly motivated with strong leadership and excellent communication skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working with the Cancer Management Team this post will be responsible for the implementation and assessment of the service against the NHSi Qualitative Measures for Acute Oncology.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For further information about the role or an informal discussion please contact Anne Snow- Consultant Lead Cancer Nurse and Lead Clinician Lung Cancer 01983 534379 or email anne.snow2@iow.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127355.jpg", "name": "Isle of Wight NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127355"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport, Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Acute Oncology CNS Support Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254137", "validThrough": "2020-11-17T23:59:59+0000"}