{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "38000", "unitText": "YEAR", "value": "Up to £38,000 a year pro rata"}}, "datePosted": "2020-11-02T08:29:35+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you looking for a change in your career? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Have you ever thought about working within a prison environment, helping to rehabilitate and support offenders to live decent and purposeful lives as a member of the community? Are you looking for a challenging and rewarding role with career developments? Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;This role is for someone wanting a part time Occupational Therapist post working with offenders. There are two part time positions in the Sussex Prisons available (HMP Ford &amp; HMP Lewes) and can be joined to make one full time post if the candidate would like.&lt;/p&gt;\n&lt;p&gt;This role is a Social Care Occupational Therapist position working in partnership with West Sussex County Council, healthcare and prison staff for 15 hours/2 days per week providing assessments, advice, guidance, referrals, equipment requests and housing reports.&lt;/p&gt;\n&lt;p&gt;The Lewes OT will be working with the healthcare teams and liaising with prison staff for referrals into East Sussex County Council.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary and Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The salary range is £38,000 per annum - dependent on experience (pro-rata if part time).&lt;/p&gt;\n&lt;p&gt;Practice Plus Group benefits include training &amp; development opportunities, company contributory pension scheme, 25 days annual leave plus 8 public bank holidays, staff well-being, access to bank hours, CPD, re-validation, cycle to work scheme, on-site gym facilities and free onsite parking at some locations.&lt;/p&gt;\n&lt;p&gt;We are also proud to support our employees with continued professional development opportunities and further education subject to service needs...&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and employment is subject to receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arundel", "postalCode": "BN18 0BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8162", "longitude": "-.579781"}}, "title": "Senior Occupational Therapist - HMP Ford", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251338", "validThrough": "2020-11-30T23:59:59+0000"}