{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "100000", "minValue": "160", "unitText": "YEAR", "value": "£100 - £160.75"}}, "datePosted": "2020-10-23T15:50:11+0100", "description": "&lt;p&gt;We are seeking 2 Consultants in Palliative Medicine, who ar especially enthusiastic about delivering a Specialist Palliative Care service within the acute hospital environment to join our dedicated Palliative Care Team.Full time or less than full time posts are possible. This team is hosted by the Older Persons Medicine Care Group and the new post will add to the cohesive Consultant team.&lt;/p&gt;\n&lt;p&gt;The post will be based at Queen Alexandra Hospital working as part of the Hospital Palliative Care Team (HPCT). Due to retirement of the existing post-holder the consultant may be working as a sole consultant physician within the team.&lt;/p&gt;\n&lt;p&gt;The Consultant will deliver specialist palliative care to individual patients with complex needs, providing expertise on difficult symptom control problems and disseminating principles and practice of palliative care in the management of such patients.&lt;/p&gt;\n&lt;p&gt;There is the opportunity to enhance any post to include specialist clinical services depending on the needs of the service and of the successful applicant.  Post holders are actively encouraged to participate in service improvement projects, audits, research and represent the clinical service centre at college level and nationally. Full participation in teaching, audit and research will be expected.&lt;/p&gt;\n&lt;p&gt;Clinical Duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Medical assessment in support of the specialist palliative care nurses.&lt;/li&gt;\n&lt;li&gt;Medical assessment when requested by a consultant from another department.&lt;/li&gt;\n&lt;li&gt;Assessment of patients already known to the local specialist community palliative care teams requiring a specialist medical opinion during their hospital admission.&lt;/li&gt;\n&lt;li&gt;Attendance at cancer site specific MDT meetings shared with specialist nurses.&lt;/li&gt;\n&lt;li&gt;Medical assessment when requested, to consider transfer to a hospice for inpatient specialist palliative care.&lt;/li&gt;\n&lt;li&gt;Support of clinical teams in making difficult clinical and ethical decisions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If this sounds like it is for you, please apply with your CV here. Our dedicated Doctors recruiter will get in touch with you to answer any further questions you have and get the review and recruitment process started. For an initial chat please call our team on 0333 577 3316, option 2 or send us an email atjoin.portsmouth@bankpartners.co.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135154.jpg", "name": "Portsmouth Hospitals NHS Trust Staff Bank", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Locum Consultant Palliative Care Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241178", "validThrough": "2020-11-23T23:59:59+0000"}