{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa, based on full time hours"}}, "datePosted": "2020-10-13T13:30:26+0100", "description": "&lt;p&gt;&lt;span&gt;Berrywood Ward is an assessment and treatment ward providing care for older people who have functional mental health needs (such as depression, bipolar disorder or schizophrenia) and are unable to look after themselves or be looked after at home. The people we work with have complex comorbidities and whilst this can be a challenge, it adds to the richness of care we provide. We are proud of the way the team has a holistic approach in ensuring the patient receives the right care at the right time. We work with carers, relatives and others to ensure smooth transition back into the community. Berrywood Ward is set in the Western Community Hospital which is based just outside the centre of Southampton, with free parking available.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are currently looking for Band 5 Registered Mental Health nurses to join us at Berrywood Ward. We also welcome newly qualified staff and return to practice staff who have a passion for working with older people. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a member of our team, you will work closely as part of a multi-disciplinary team including nurses, AHPs, doctors and clinical psychology to ensure the best possible outcomes for patients and their carers. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To be in with a chance of working at Berrywood Ward you will need to be a registered Mental Health Nurse with the NMC. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to further information on this role, Sue Clifton our ward manager would be more than happy to have a friendly confidential chat. She can be contacted on 02380 540724&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Happy to Talk Flexible Working - all requests for flexible and part time working will be considered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Follow us on Facebook and on Twitter: &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;facebook.com/SouthernHealthNHS&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;@Southern_NHSFT&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Mental Health Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224471", "validThrough": "2020-11-30T23:59:59+0000"}