{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 per annum"}}, "datePosted": "2020-10-30T10:16:40+0000", "description": "&lt;p&gt;&lt;strong&gt;Head of PMO – 8d&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS England and NHS Improvement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North West – Strategy and Transformation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen within the Strategy and Transformation Directorate to appoint a &lt;strong&gt;Head of PMO&lt;/strong&gt; to develop and lead our regional Programme Management Office. This will support programmes of work designed to restore and recover services for our communities, with a focus on the areas of greatest opportunity to improve healthcare for people.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with colleagues across NW NSHE/I directorates, key system stakeholders, in particular ICS’s and STP’s within the North West, as well as regional and national NHSE/I colleagues, Clinical Commissioning Groups and Acute, Community and Mental Health Providers. This is a dynamic and exciting role in which the post holder will have scope to design, develop and deliver change, working collaboratively with NHSE/I colleagues, ICS’s/STP’s, Providers and other key stakeholders to make a tangible difference for our population.&lt;/p&gt;\n&lt;p&gt;One of our key focus areas for the PMO is to support the delivery of the ambitions of the Long-Term Plan, enabling collaborative transformation and development of new and innovative models of service delivery.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic, motivated individual experienced in PMO development and leadership, working with ICS’s, STP’s and Providers on large scale transformation and improvement projects and able to adopt new strategies, ideas and ways of working to support delivery of our restoration agenda.&lt;/p&gt;\n&lt;p&gt;The post-holder will ensure that clinical services are delivered in line with the ambitions of the Long-Term Plan and will lead a team to support the delivery of quality outcomes.&lt;/p&gt;\n&lt;p&gt;This post will be based in NHSE/I offices in the North West Region working flexibly from bases across Manchester, Cheshire &amp; Merseyside and Lancashire &amp; South Cumbria.&lt;/p&gt;\n&lt;p&gt;For further details or an informal discussion in relation to the position please contact &lt;strong&gt;Stephen.Hodges3@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Janet Jenkins&lt;/p&gt;\n&lt;p&gt;Job title PA / Business Support&lt;/p&gt;\n&lt;p&gt;Email address Janet.Jenkins8@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07918 368457&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "Head of PMO", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249675", "validThrough": "2020-11-15T23:59:59+0000"}