{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "231", "minValue": "231", "unitText": "YEAR", "value": "WD23 1RD"}}, "datePosted": "2020-11-06T15:14:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Scrub Nurse or ODP | Equivalent Band 5 | Bushey, Watford | Fantastic CPD on offer | No night shifts | Joining Bonus&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It’s an exciting time to join Spire Bushey hospital. We have opened a new state of the art 6th theatre that will allow us to continue offering outstanding care. If you are a Scrub Nurse or Operating Department Practitioner interested in working with us, then we would like to meet you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have the opportunity to work alongside some of the regions most experienced Consultants, covering a varied and diverse caseload. Training is available to allow you to broaden your experience and career development is readily available.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are offering a £2,000 joining bonus should you accept an offer before 30th October 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Bushey Hospital is one of North London and Hertfordshire’s leading private hospitals, with an excellent reputation for delivering high quality private hospital treatment. The hospital has been treating patients for over 35 years and has over 400 consultants. All of our consultants are highly experienced and many enjoy national and international reputations.&lt;/p&gt;\n&lt;p&gt;The hospital offers a premium service in key areas of complex healthcare including orthopaedics, neurospinal, general surgery and gynaecology Spire Bushey Hospital forms part of a 4 site portfolio, and is supported by and works alongside Spire Bushey Diagnostic Centre, Elstree Cancer Centre and Spire Pathology Centre – based on Centennial Park in Elstree - just 5 minutes from the main hospital site.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supporting in assessing patient’s health and well-being across a complex and changing caseload&lt;/li&gt;\n&lt;li&gt;Promoting best practice and contributing towards quality improvements&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC/HCPC&lt;/li&gt;\n&lt;li&gt;Current Scrub experience doing volume of procedures with high and quick turnover&lt;/li&gt;\n&lt;li&gt;Willingness to participate in flexible working rota&lt;/li&gt;\n&lt;li&gt;Will consider applicant who are available for Full or Part time Hours&lt;/li&gt;\n&lt;li&gt;Surgical 1stassistant qualification desirable or the desire to complete the course at an early opportunity&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Louise Tankard on louise.tankard@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bushey", "postalCode": "EC4Y 8EN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5131", "longitude": "-.105587"}}, "title": "Scrub Nurse or ODP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260292", "validThrough": "2020-12-06T23:59:59+0000"}