{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890-£44,503 per annum pro rata"}}, "datePosted": "2020-10-29T10:31:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Therapy Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Lead Paediatric Dietitian&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;11 hours per week &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a dietitian with a sound range of clinical experience and an interest in working with children and young people offering a specialist dietetics service to critical care and other specialities? Could you contribute to a multi-disciplinary team in order to deliver excellent quality care to our patients and their families and carers? Do you have a passion for improving patient outcomes with best nutritional care? Then an opportunity at Band 7, has become available at Nottingham Children&#39;s Hospital which is part of Nottingham University Hospitals (NUH) NHS Trust. Nottingham Children&#39;s Hospital offers both secondary and tertiary care for children and young people and their families across Nottinghamshire and the East Midlands.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced, proactive and innovative dietitian with a strong ability to work independently as well as part of a dietetics team. The post holder will work closely with the other paediatric clinical lead dietitians and will also assist in managing the paediatric dietitians within the general paediatric team.&lt;/p&gt;\n&lt;p&gt;This post is ideal for a dietitian wishing to use and develop their clinical, leadership, managerial and service development skills. The successful applicant will work as an integral member of the children&#39;s therapy team, building working relationships with other team members at NUH, as well as other dietitians within Nottinghamshire and regionally. You will develop and take part in clinical audit, guidelines development and other service initiatives.&lt;/p&gt;\n&lt;p&gt;You will need to have excellent communication and leadership skills, be adaptable and confident to work autonomously and with other members of staff within a supportive team. We expect you to be enthusiastic, motivated, able to evidence continuing professional development and keen to develop yourself and others. Experience of complex nutritional support and evidence of a varied clinical experience is essential.&lt;/p&gt;\n&lt;p&gt;We are a large and friendly dietetic department of around 90 staff including assistants and technicians providing dietetic and nutrition support across all areas of the Trust and beyond. The paediatric dietetic team currently comprises 21 staff of various grades including technicians and assistants and provides a friendly and supportive environment.&lt;/p&gt;\n&lt;p&gt;As a service, we are committed to continuing professional development for all our staff through a range of opportunities that include recognised training courses, involvement in service development and audit. We have supported staff through a number of development opportunities including Advanced Dietetic Practice Masters training and external programmes such as; Nottinghamshire Roosevelt Memorial Travelling Scholarship, Winston Churchill Fellowship and Higher Education East Midlands (HEEM) programmes.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to providing excellent nutritional care, led by its Nutrition and Hydration Steering committee. We have close links with the University of Nottingham, and take student dietitians for A, B and C placements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSally HawesJob titleTherapy Services ManagerEmail addresssally.hawes@nuh.nhs.ukTelephone number07812269772Additional contact information&lt;/p&gt;\n&lt;p&gt;Zoe Ransome tel: 0115 9249924, ext. 62066, zoe.ransome@nuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Medical Centre, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Clinical Lead Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247913", "validThrough": "2020-11-12T23:59:59+0000"}