{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata"}}, "datePosted": "2020-11-03T13:30:53+0000", "description": "&lt;p&gt;&lt;em&gt;Are you an experienced and passionate Occupational Therapist looking for a new challenge?&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Give your career a positive change with an exciting opportunity in Cornwall.&lt;/p&gt;\n&lt;p&gt;Cornwall Partnership NHS Foundation Trust offers specialist Mental Health Inpatient Services&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Opportunity…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a part time vibrant Senior Occupational Therapist for our Psychiatric Rehabilitation Service, which is based on the Bodmin Hospital site in Cornwall.&lt;/p&gt;\n&lt;p&gt;Fettle House is an open, inpatient, mixed gender unit supporting people recovering from complex and enduring mental health problems. A community Rehabilitation Team operates alongside the inpatient facility allowing the team to follow through a service specific pathway for our patients as they resume/ establish independent lives outside of the hospital setting.&lt;/p&gt;\n&lt;p&gt;In response to the current pandemic this integrated pathway has required a flexible approach to maintain our outstanding service and offers staff the opportunity to rotate between the two areas of service.&lt;/p&gt;\n&lt;p&gt;The Fettle Rehabilitation team works as part of a wider team that includes carers, families, other specialists e.g. Forensic services, housing, education, pharmacy,&lt;/p&gt;\n&lt;p&gt;We take a person centred approach in developing individual care plans and goal setting. In addition, the post holder will have a key role supporting and supervising junior team members as well as participating in the continued review and development of the rehabilitation service. Regular individual support and supervision is provided.&lt;/p&gt;\n&lt;p&gt;As part of a growing network of occupational therapists in the Trust you will have regular supervision with the Lead occupational therapist and should you wish, peer supervision with the occupational therapist working in a similar role in the West of the County. You will be invited to join our monthly best practice meeting where continual professional development topics are discussed and guest speakers are invited to share exciting developments and opportunities both within and outside of the Trust. We are committed to the learning and development of our staff and have very recently provided 3 days training on the use of the Model of Human Occupation and associated assessment tools with a further 2 days of MOHO formulation training planned. Occupational therapists from both CFT and RCHT joined together for this opportunity.&#39;&lt;/p&gt;\n&lt;p&gt;Whether you’re already living in Cornwall or looking to relocate, you could take the next step in your career and benefit from living in a beautiful part of the country whilst making a real difference to patients. We are proud of our innovative and patient safety focused culture. Interested applicants are strongly encouraged to arrange a visit to the unit to find out more.&lt;/p&gt;\n&lt;p&gt;This is a 22.5 hours per week post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachel CannerJob titleWard ManagerEmail addressRachel.canner@nhs.netTelephone number07385 348481Additional contact information&lt;/p&gt;\n&lt;p&gt;For any queries or questions, please contact Ward Manager Rachel Canner; 07385 3&lt;span&gt;48481 &lt;/span&gt;&lt;span&gt;Rachel.canner@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Lydia Lawson Professional Lead Occupational Therapist, 07799 115048, lydia.lawson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fettle House, Bodmin Hospital", "postalCode": "PL31 2QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4683", "longitude": "-4.74305"}}, "title": "Senior Occupational Therapist - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254146", "validThrough": "2020-11-17T23:59:59+0000"}