{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pro rata, per annum"}}, "datePosted": "2020-11-05T12:16:19+0000", "description": "&lt;p&gt;We are delighted to offer this vacancy to join a team of 20 Consultants working across 2 sites: the University Hospital of Hartlepool and University Hospital of North Tees. This post is a replacement post for a Locum Consultant Spinal Surgeon to join the team to further develop the service.&lt;/p&gt;\n&lt;p&gt;You will be joining the Trust at a very exciting time as it begins, with other local providers, to take forward the integrated care programme.&lt;/p&gt;\n&lt;p&gt;As part of our drive to ensure our services are developed and delivered based upon our populations health needs, now, and in the future, this post with be pivotal in delivering a seamless spinal service.&lt;/p&gt;\n&lt;p&gt;The Trust is an ambitious organisation with a focus on innovation in healthcare, reflecting the ambitions of the NHS Long Term Plan. The Trust provides acute and community services to the population of Stockton on Tees, Hartlepool, East Durham and surrounding areas including a large part of Sedgefield, with a budget of £310 million and 4,780 employees. Both hospital sites have formal accreditation from the NHS for Cancer Unit status and trauma unit status is based at the University Hospital of North Tees. We have an excellent supporting infrastructure of staffing and are proud of our high clinical reputation and positive working culture. We have excellent medical training, which supports the recruitment of good calibre trainees.&lt;/p&gt;\n&lt;p&gt;The trauma services, spinal unit and upper limb surgery is based at the University Hospital of North Tees. Elective joint replacement is based at the University Hospital of Hartlepool. Day case surgery and out-patient services for all sub specialities is provided across the two hospital sites to ensure local access for patients.&lt;/p&gt;\n&lt;p&gt;The post will be offered for 10 PAs under the Terms and Conditions of Service for Consultants (England). Candidates should be fully registered with the GMC with a licence to practice and on the Specialist Register (or within 6 months of obtaining their CCST). Although the post is tenable on a whole time basis, any applicant who, for personal reasons, is unable to work full-time, will be eligible to be considered for the post.&lt;/p&gt;\n&lt;p&gt;This appointment is subject to an Enhanced Level Criminal Records Bureau check.&lt;/p&gt;\n&lt;p&gt;This role may be suitable for non-UK or non-EEA job applicants wishing to apply for Home Office Tier 2 sponsorship.&lt;/p&gt;\n&lt;p&gt;This appointment is subject to an Enhanced Level Criminal Records Bureau check. This post is considered a “regulated activity” within the terms of the Safeguarding Vulnerable Groups Act 2006, and appointments will be subject to registration with the Independent Safeguarding Authority (ISA).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 03rd December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr C Bhatia, Consultant Spinal Surgeon 01642 383171Additional contact information&lt;/p&gt;\n&lt;p&gt;Mr A Middleton, Clinical Director for Orthopaedics on 01642 624809&lt;br /&gt;Mr C Bhatia, Consultant Spinal Surgeon on&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Tees and Hartlepool NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120670"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of North Tees, Stockton on Tees", "postalCode": "TS19 8PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5829", "longitude": "-1.34677"}}, "title": "Locum Consultant Spinal Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257611", "validThrough": "2020-12-03T23:59:59+0000"}