{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-15T14:50:21+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Are you an experienced Childrens, Mental Health or Learning disability Nurse or Health Visitor motivated by providing outstanding&lt;/strong&gt; &lt;strong&gt;care services and would like to work in a passionate and inspiring environment? &lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you’ve answered&lt;strong&gt; ‘yes’, &lt;/strong&gt;then we would like to hear from you. This is your opportunity to develop your clinical leadership skills in a diverse setting. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Personal Health Commissioning (PHC) has recently undergone a significant transformation programme and including a full-service restructure. We are embarking on a journey of continuous improvement to ensure we are at the forefront of providing high quality, efficient and sustainable services for our people. PHC is responsible for the implementation of the Childrens and Young Peoples Continuing Care (CYPCC) framework. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an experienced Childrens Nurse or Mental Health or Learning Disability Nurse or Health Visitor with excellent skills in the assessment of children and young people, with complex needs to work in our CYPCC team. The role will include leading and undertaking assessments  as part of a multi disciplinary team in order to make a recommendation on eligibility for CYPCC, managing a caseload a of children and young people found eligible for CYPCC, and working closely with partner organisations to ensure that they have a package of care that meets their identified needs in a safe and sustainable manner. You will review this care and support regularly and make representations to the CYPCC panel. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate must be able to work collaboratively with Health, Education and Social Care practitioners, families and care givers to ensure high quality assessments are delivered against both local and national performance targets.  The individual must demonstrate openness, honesty and transparency and have strong knowledge of the National Frameworks as well as legislation such as Children Act, Mental Capacity Act and Safeguarding.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a great opportunity to join NHS Dorset CCG as part of the Personal Health Commissioning team as it continues its service transformation. We are committed to the ongoing learning and development of our team and provide opportunities in line with the CHC Competency Framework including peer development and external training.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dorset CCG is a welcoming NHS employer and we offer a wide range of employee benefits &lt;/span&gt;&lt;span&gt;and the opportunity to live and work in a beautiful area&lt;/span&gt;&lt;span&gt;. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role, there is a requirement to travel and a full driving licence is essential&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128199.png", "name": "Dorset Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128199"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Vespasian House, Dorchester", "postalCode": "DT1 1TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7146", "longitude": "-2.44439"}}, "title": "Senior Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228682", "validThrough": "2020-11-08T23:59:59+0000"}