{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T09:00:44+0000", "description": "&lt;p&gt;Come and join our dynamic and enthusiastic Day Surgery theatre team based at The Royal Hampshire County Hospital, Winchester. We work across a wide range of specialties and are keen to promote a multi-skilled workforce while offering the opportunity to develop your skills in a unique and exciting setting. As a flexible and professional theatre team we offer the opportunity to rotate between different specialties in order to develop your practice.&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint a dynamic and dedicated Band 5 Operating Department Practitioner/Theatre Nurse who would like to dual role in recovery and scrub. We are looking for motivated individuals with excellent communication skills who thrive in well supported teams.&lt;/p&gt;\n&lt;p&gt;Ideally you will need to be an experienced Operating Department Practitioner/Theatre/Recovery Nurse with demonstrable commitment to your own professional development however; full training and support can be given to newly qualified practitioners.&lt;/p&gt;\n&lt;p&gt;It is important to us to support our staffs continued professional development. We are a learning environment for students and you will assist with their development alongside our Practice Development Leads.&lt;/p&gt;\n&lt;p&gt;If you are looking to develop your career, are a proven team player with good communication and organisational skills, enjoy a challenge and have the motivation and desire to help others, then please consider applying. If you think this is the post for you, we would encourage you to contact us to discuss your skill or learning need&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Melissa Gray, Treatment Centre Theatre Lead, melissa.gray@hhft.nhs.uk / 01962 828315.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Hampshire County Hospital, Winchester", "postalCode": "SO22 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0614", "longitude": "-1.33095"}}, "title": "Recovery/Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251371", "validThrough": "2020-11-16T23:59:59+0000"}