{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-22T11:16:00+0100", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Consultant in Acute Medicine/&lt;strong&gt;General Internal Medicine&lt;/strong&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;The Great Western Hospitals NHS Foundation Trust – Swindon&lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;This is a great time to join our forward thinking Acute Medical team&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;The Great Western Hospital has recently been awarded £30 million to restructure and redesign its front door services. To support this, we are looking to recruit substantive Consultants in Acute Medicine, both full time and part time applications will be considered. The successful applicants will be able to partake in the redesign of services and pathways to assist with increasing our Same Day Emergency Care offering as well as flow through Acute Medicine.&lt;/p&gt;\n&lt;p&gt;There is an opportunity for the successful candidates to pursue a special interest within other medical specialties with dedicated sessions offered as part of the role.&lt;/p&gt;\n&lt;p&gt;The department does aim to help strike a work life balance. The working week can be arranged for the successful applicant to have a non-working day each week. SPA time is allocated as a 1.5SPA minimum but additional SPA is available to all candidates wishing to take on other specified SPA duties. 2.5SPAs is common place for Consultants undertaking such roles.&lt;/p&gt;\n&lt;p&gt;The ideal applicants for these posts will be able to demonstrate the following attributes: strong knowledge and skills in acute medicine, positive response to the challenges of service development, resilience and flexibility in the face of rapid change, excellent interpersonal and communication skills. They will be able to work cooperatively and happily with colleagues both at consultant level and across the multidisciplinary team. They will have a strong commitment to undergraduate and postgraduate teaching and an ability to demonstrate an understanding of the role of research in driving up clinical quality.&lt;/p&gt;\n&lt;p&gt;The successful applicants should possess MRCP (UK) from the Royal College of Physicians (or equivalent) and should be within6 months of CCT at the time of interview or currently hold CCT or equivalent.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be expected to participate in the medical on call rota including the weekends. The on call rota is currently 1 in 14 weekdays and 1 in 7 weekends, as two consultants provide weekend cover on both days&lt;/p&gt;\n&lt;p&gt;Great Western Hospitals NHS Foundation Trust, where the Cotswolds meets the West Country, enjoys enviable local support and excellent partnership working. It serves the local population of Swindon, Wiltshire and parts of Gloucestershire, Oxfordshire and West Berkshire. Great Western Hospitals NHS Foundation Trust is a particularly friendly and effective organisation and benefits from excellent relationships between management teams and clinical staff. The hospital was built in 2003 and is a modern hospital which provides a pleasant working environment. It is well placed close to junction 15 of the M4 and located allowing commutes to accommodate family members’ jobs in cities such as Oxford, Bristol, Bath, Reading, Cheltenham and Gloucester. There is wealth of attractive villages in the area and good schools including grammar schools within commuting distance. There is a good rail connection to London (1 hour).&lt;/p&gt;\n&lt;p&gt;To discuss the post and arrange an informal visit, please contact Dr Catherine Strait, Clinical Lead on catherine.strait1@nhs.net or 01793605271 (sec).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120810.png", "name": "Great Western Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120810"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SN3 6BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5382", "longitude": "-1.72768"}}, "title": "Consultant in Acute Medicine/General Internal Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238095", "validThrough": "2020-11-20T23:59:59+0000"}