{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "38000", "unitText": "YEAR", "value": "£38,000"}}, "datePosted": "2020-10-14T14:55:02+0100", "description": "&lt;p&gt;&lt;strong&gt;The Disabilities Trust are Hiring a Senior Occupational Therapist in Leeds!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Disabilities Trust is a leading national charity, providing innovative care, rehabilitation and support solutions for people with profound physical impairments, acquired brain injury and learning disabilities as well as children and adults with autism. BIRT is the UKs leading charity providing assessment and rehabilitation services for people with acquired brain injury. We believe it is never too late to benefit from rehabilitation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Service:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Osman House is a 16 bed rehabilitation unit for adults with acquired brain injury. It is a slow stream service giving you the ability to really get to know the service users. The service is set within a small local village, it has plenty of space for working on rehabilitating the client group including our therapy kitchen &amp; 2 conservatories as well as our spacious private garden.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have:&lt;/p&gt;\n&lt;p&gt;- A diploma or a degree in occupational therapy and registered with HCPC&lt;/p&gt;\n&lt;p&gt;- At least four years post registration experience and 2 years within neurological rehabilitation&lt;/p&gt;\n&lt;p&gt;- Experience supervising and training others&lt;/p&gt;\n&lt;p&gt;- A valid UK driving licence This is an autonomous role, working alongside a therapy assistant, neuro psychologist, assistant psychologist and rehabilitation support workers.&lt;/p&gt;\n&lt;p&gt;Please also see the Job description and Person specification for more details.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits Include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- Company pension scheme – automatically enrolled and DT will contribute 10% of annual Salary, individual required to make minimum personal contribution 5% of gross salary.&lt;/p&gt;\n&lt;p&gt;- Private medical insurance – DT pay the contributions for the individual’s inclusion in the scheme.&lt;/p&gt;\n&lt;p&gt;- Life Assurance – available after 6 months’ continuous service and provides equivalent of four times annual salary in the event of death in service.&lt;/p&gt;\n&lt;p&gt;- 38 days Annual Leave (including Bank Holidays).&lt;/p&gt;\n&lt;p&gt;- Enrolment in a staff benefits scheme – Perkbox.&lt;/p&gt;\n&lt;p&gt;- Car allowance of £4k per annum&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- 21 Hours a week&lt;/p&gt;\n&lt;p&gt;- We are offering the chance for someone to take on the post flexible to meet the needs of the service as well as affording you the flexibility to work on the days you prefer to a degree.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Disabilities Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS15"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8111", "longitude": "-1.43119"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226751", "validThrough": "2020-11-27T23:59:59+0000"}