{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "Starting salary from £31,365 pro rata, per annum"}}, "datePosted": "2020-11-06T14:01:36+0000", "description": "&lt;p&gt;&lt;strong&gt;Kirton ward and the NEW ARCU Respiratory Unit.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have an interest in respiratory nursing? Are you looking for new challenge to expand your knowledge and skills in a new specialty or expand your existing knowledge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are then Kirton/ARCU is the ward for you, great respiratory experience and supportive senior staff. Consultants who are approachable and keen to teach on the ward.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Exciting changes for the Respiratory Unit at Ipswich Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to the Covid -19 pandemic there have been significant changes made within the respiratory service at Ipswich Hospital. The Acute Respiratory Unit has a new ward area purposely built to support the respiratory patients with acute and chronic respiratory conditions that require Aerosol Generating procedures (NIV, CPAP, optiflow and tracheostomy care). This new unit comes online in September 2020 and with this new build comes the need for additional staff to care for these patients. Kirton ward is a 28 bedded respiratory ward which is the base for the staffing for both Kirton ward and ARCU. The recruitment of staff for the respiratory unit will be based on Kirton ward where you will gain the experience and knowledge to be able to care competently for the Level 2 AGP patients within ARCU.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There are plans also for Kirton ward to be relocated to a refurbished ward next to the ARCU this year. The Medicine Division has a ward relocation project in place which will support the patients by enabling the staff to be able to deliver the best care to our patients as part of the new respiratory unit in a newer environment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking to recruit Band 6 Junior sister/Charge Nurses to join the team and work towards the new Respiratory unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are excited by the challenges of caring for respiratory patients, have a passion for high standards of clinical care and an innovative and progressive attitude this could be the role for you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are happy to consider secondments so you can see if this is the environment for you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information or an informal conversation please contact Darren Evans, Matron on 07772008347 or email Darren.evans@esneft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Junior Sister/Deputy Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260043", "validThrough": "2020-11-22T23:59:59+0000"}