{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-20T11:03:05+0100", "description": "&lt;p&gt;EXCITING REGISTERED NURSE OPPORTUNITIES FOR NEWLY REGISTERED NURSES&lt;/p&gt;\n&lt;p&gt;If you are a student nurse due to qualify outside of Wales we have vacancies available in Medical, Surgical and Community areas.&lt;/p&gt;\n&lt;p&gt;Are you interested in working as a Registered Nurse within Aneurin Bevan University Health Board? If you are studying outside of Wales we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;If you would like to find out more, apply online and come and find out more about our Preceptorship / Journey of Excellence programmes and what we can offer you in your future career.&lt;/p&gt;\n&lt;p&gt;In September 2015 we introduced the ‘Journey of Excellence’ rotational programme within Medicine, Surgery and Mental Health. Candidates preferred specialty and location will be discussed at interview.&lt;/p&gt;\n&lt;p&gt;The Grange University Hospital is currently being built in Llanfrechfa which will have around 470 beds, will deal with all major emergencies, and will treat and care for those needing complex, specialist or critical care. It will include a 24-hour emergency department and assessment unit, dealing with emergencies and resuscitation cases, and will have a broad range of diagnostic services, operating theatres, and a consultant-led obstetric unit. This is an excellent time to join the Health Board.&lt;/p&gt;\n&lt;p&gt;Aneurin Bevan University Health Board is a Health Board with ambition and a clear plan to modernise its delivery and the care provided to its patients with a clear commitment to the development of its Registered nurses.&lt;/p&gt;\n&lt;p&gt;The Health Board has the drive to deliver evidence based health care and is currently the only pilot site for the Revalidation of Nursing in Wales. We’ll support you all the way.&lt;/p&gt;\n&lt;p&gt;A wide range of opportunities the Health Board is responsible for delivering health care within Acute and Community Services across a large geographical area including Newport, Abergavenny, Caerphilly, Ebbw Vale Monmouth and Chepstow which includes two state of the art hospitals with single room facilities.&lt;/p&gt;\n&lt;p&gt;If you share our ambition we look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 15 November 2020&lt;/p&gt;\n&lt;p&gt;Interview Date: 10 December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tracey Rich&lt;/p&gt;\n&lt;p&gt;Assistant Divisional Nurse, Scheduled Care&lt;/p&gt;\n&lt;p&gt;tracey.rich@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01633 238268&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various sites within the Health Board, Various sites within the Health Board", "postalCode": "NP44 8YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6463", "longitude": "-2.99634"}}, "title": "Newly Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234025", "validThrough": "2020-11-15T23:59:59+0000"}