{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503"}}, "datePosted": "2020-10-16T16:15:20+0100", "description": "&lt;h1&gt;Clinical Scientist&lt;/h1&gt;\n&lt;p&gt;An exciting opportunity has arisen in our laboratory for a number of permanent Clinical Scientists at AfC band 7.&lt;/p&gt;\n&lt;p&gt;Applicants should have good interpersonal skills, a background in genetics, a strong interest in driving and improving the quality of diagnostic services and be able to work collaboratively within a multidisciplinary team. Demonstrable experience of genomic technology and the interpretation of a range of scientific data are essential.&lt;/p&gt;\n&lt;p&gt;Applicants should be registered (or close to registration) with the HCPC as a Clinical Scientist.&lt;/p&gt;\n&lt;p&gt;The post holders will be required to take responsibility for testing and reporting of specialised genomic diagnostic investigations and for managing areas of existing service work in the laboratory and be able to work to tight deadlines. Applicants should possess excellent communication and team leadership skills, have resilience and be able to work independently as required.&lt;/p&gt;\n&lt;p&gt;Appointment will be dependent on qualifications and experience. We are very much committed to continuous development and have active seminar programmes supporting Continuing Professional Development available to all staff. We would be willing to consider applications from individuals with an MSc or PhD in Genetics, or significant laboratory/ analysis experience in a relevant clinical setting. For those candidates who are not yet registered they will be expected to work toward HCPC registration and would be appointed on a salary band appropriate for their experience.&lt;/p&gt;\n&lt;p&gt;Over the last few years, the portfolio of genomic testing has significantly expanded with the introduction of large gene panels and exomes, creating an increase in workload and in the complexity of analysis and reporting. These posts will support the management and delivery of the clinical programmes and will have a key role in these and future developments, including the delivery of the new Prenatal exome service, as part of the National Genomic Medicine Service in England.&lt;/p&gt;\n&lt;p&gt;Following the 2018 NHS England designation of seven national Genomic Laboratory Hubs (GLHs), the West Midland Regional Genetics Laboratory (WMRGL) is the designated GLH leading the Genomic Local Laboratory Network (GLLN) for the West Midlands, Oxford &amp; Wessex Genomics Consortium (WMOWGC) as part of a national world class Genomics Laboratory NetworkThe GLHs will be an integral part of the national Genomic Medicine Service providing state of the art, high quality genomic analysis to patients with rare disease and/or cancer. The pace of change is exponential with genomics being placed at the heart of the future NHS. Our workforce will be fundamental to the successful delivery of this ambitious and high profile service. In particular our laboratory is one of two laboratories designated to deliver the national Prenatal exome service, and a number of other specialist Prenatal testing services.&lt;/p&gt;\n&lt;p&gt;The West Midlands Regional Genetics Laboratory is based at Birmingham Women’s and Children’s NHS FT within the Genetics Division alongside the West Midlands Clinical Genetics Service. We also work closely with our Fetal Medicine Centre, the National School of Healthcare Science; with the University of Birmingham, in particular, the Institute of Cancer and Genomics Sciences; and with diagnostic and pharmaceutical industries.&lt;/p&gt;\n&lt;p&gt;Any candidates with relevant experience of clinical delivery of genetic laboratory services suitable for this level of appointment are encouraged to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Birmingham Women&#39;s &amp; Children’s NHS Foundation Trust is committed to providing equality of opportunity in all aspects of employment, to every member of staff and to all potential employees. The Trust aims to build a workforce which is valued and whose diversity reflects the communities it serves, enabling it to deliver the best possible healthcare service to those communities.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information about the post please &lt;strong&gt;contact Stephanie Allen (on 0121 335 8036).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Closing Date: 13th November &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;strong&gt;Interview Date: TBC&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants will be expected to be available to start as soon as possible, pending required clearances.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham Women&#39;s Hospital", "postalCode": "B15 2TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4532", "longitude": "-1.94224"}}, "title": "Clinical Scientists", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231051", "validThrough": "2020-11-13T23:59:59+0000"}