{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 per annum"}}, "datePosted": "2020-11-02T10:31:58+0000", "description": "&lt;p&gt;&lt;span&gt;The Chief Nursing Informatics Officer and Director of Safety (Mission 4) role was established in March 2020. The purpose of the Deputy Chief Nursing Information Officer role is to support the CNIO in the development of the National vision and roadmap for Nursing and development of the CNIO team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Deputy Chief Nursing Information Officer, the post holder will lead and work in forming a dynamic team in delivering an effective service supporting clinicians, managers and staff across the Mission 4 directorate and the digital health sector. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Through developing collective leadership and professionalisation the post holder will identify ways of improving digital literacy nationally and will help to establish new roles and new ways of working. &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;This role will offer clinical nursing expertise in the support and development of driving nurse led digital transformation of care, and workforce to meet these needs.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;This role will support the CNIO to develop and communicate a vision for the advancement of digitally enabled nursing and midwifery practice and workforce to support the long term and the tech plan&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;This role will establish and cultivate relationships with senior regional and international stakeholders supporting the role of digital nursing within healthcare to allow collaborative working with experts in the area to formulate a strategy that will drive the digital transformation of care&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;This role will develop a fully networked approach to enable digital transformation teams at all levels of the system to have access to nursing and midwifery expertise &lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;This role will drive evidence based reform, support organisational change ensure the uptake of initiatives and best practice are highlighted to support excellent care&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;This role will encourage research and evidence-based practice in digital nursing and midwifery&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;This role will increase learning and understanding of international nursing and midwifery leadership within digital healthcare&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen BarkerJob titleBusiness Delivery ManagerEmail addresshelen.barker@nhsx.nhs.ukTelephone number07702422663&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Quarry House, Leeds", "postalCode": "LS2 7UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Deputy Chief Nursing Information Officer - NHSX", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251587", "validThrough": "2020-11-16T23:59:59+0000"}