{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27941", "minValue": "25676", "unitText": "YEAR", "value": "£25,676 - £27,941 pa inc"}}, "datePosted": "2020-10-28T16:00:55+0000", "description": "&lt;p&gt;Peer Support Worker- Community Access Service&lt;/p&gt;\n&lt;p&gt;We are recruiting to 2 posts across our Brent and Hillingdon Acute mental health services. One post will be based at Park Royal Centre for Mental Health (Brent) and the other position will be based at the Riverside Centre (Hillingdon).&lt;/p&gt;\n&lt;p&gt;Do you have your own personal lived experience of recovery from mental health challenges and of having personally accessed inpatient mental health services? This is an excellent opportunity to be part of a new, dynamic and friendly Community Access Service (CAS).&lt;/p&gt;\n&lt;p&gt;The CAS works alongside service users to ensure admission to hospital is purposeful and that service users on long admissions are actively and supportively linked into their local communities from hospital, reducing individuals’ long term and repeated admissions.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic and motivated individuals who would be committed to supporting the recovery of the individuals being cared for in this context. You must have your own personal lived experience of recovery from mental health challenges, have personal experience of accessing inpatient mental health services, and have some experience of working in a related health or social care field.&lt;/p&gt;\n&lt;p&gt;We are looking for people who are willing to positively share their personal experiences with others in order to support clients in their journey of recovery. You will be responsible for working with individuals towards the best possible outcome, helping them to identify personal recovery goals and supporting them to fully embed into their local communities whilst working towards their own aspirations of a meaningful recovery.&lt;/p&gt;\n&lt;p&gt;You will need to be motivated, organised, energetic and a flexible team worker with effective communication and interpersonal skills in order to work with service users, carers, CAS team members, Inpatient Multidisciplinary Team members, Bed Management Staff, Community Mental Health Teams, Home Treatment Teams and other outside professionals / community organisations.&lt;/p&gt;\n&lt;p&gt;You will be fully supported in your personal and professional development through regular 1:1 supervision within the team line management structure, along with peer supervision and involvement in trust-wide peer support worker development events.&lt;/p&gt;\n&lt;p&gt;At CNWL we endeavour to ensure that our Peer Support Workers have a robust lived experience-based knowledge of the environments that they are employed to work in. Please note only candidates who have personal experience of mental health difficulties and have &lt;strong&gt;accessed inpatient mental health services should apply&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Please describe in your application how your personal lived experiences are relevant to the individuals receiving care in this context. You will also be asked to give a short presentation on your recovery story at interview, should you be invited.&lt;/p&gt;\n&lt;p&gt;Interview date:TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicola JhumatJob titleUrgent Care SeniorAdditional contact information&lt;/p&gt;\n&lt;p&gt;Nicola.Jhumat@nhs.net&lt;/p&gt;\n&lt;p&gt;Francesca Lepori on 07415880943 or francesca.lepori@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Park Royal Centre for Mental Health, London", "postalCode": "NW10 7NS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5316", "longitude": "-.269746"}}, "title": "Peer Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247289", "validThrough": "2020-11-11T23:59:59+0000"}