{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-02T16:46:14+0000", "description": "&lt;p&gt;We are looking to appoint a highly motivated, innovative and enthusiastic clinical pharmacist with a keen interest in working in Medicines Safety to join our pharmacy team in the role of Medicines Safety Lead Pharmacist.&lt;/p&gt;\n&lt;p&gt;Your role will be to lead on managing the risk from medicines, improving our reporting and learning from medication incidents and promoting the safe use of medicines in our organisation. The post holder will also be the designated Trust Medicines Safety Officer (MSO) and you will work closely with the Pharmacy Management Team and the Trust Quality and Risk team&lt;/p&gt;\n&lt;p&gt;This role requires excellent organisational and interpersonal skills, alongside sound clinical knowledge and relevant experience. Good written and verbal communication skills are also essential.&lt;/p&gt;\n&lt;p&gt;You will also be required to provide a highly-specialist clinical pharmacy service to a designated specialty. Ideally you should hold a non-medical prescribing qualification or be working towards successful completion.&lt;/p&gt;\n&lt;p&gt;The department operates a 7 day service to the medical care group. Participation in the late night working, weekend and Bank Holiday rotas, and pharmacy on call will also be required.&lt;/p&gt;\n&lt;p&gt;The Pharmacy Department has over 100 staff operating across Whiston and St Helens Hospitals. We have established automated dispensing systems within the dispensaries at both sites. Both the Department and the Trust have a long-standing reputation for being a friendly and rewarding place to work. Our last Investors in People assessment recognised our Pharmacy as an outstandingly good department for staff support and development. A new e-prescribing facility has recently been launched. Both the Department and the Trust has a long-standing reputation for being a friendly and rewarding place to work. We were proud to have been awarded ‘Team of the Year’ at our annual staff awards in 2019. &lt;br /&gt;&lt;br /&gt;The Trust occupies two new state-of-the-art PFI hospitals, with the new Whiston Hospital having opened in April 2010, as well as Newton Hospital which has recently been integrated into the Trust’s service. Whiston Hospital is the main site within this large, high-performing acute Trust covering a large suburban area between Liverpool and Warrington, including St Helens, Prescot and Huyton. St. Helens Hospital provides diagnostic and clinic based services along with rehabilitation services with Newton providing a rehabilitation service. We manage in the region of 850 beds across all sites, have accredited teaching hospital status, and provide for most major specialties.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post will be subject to an Enhanced DBS (with barred list for both adult and children).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews are scheduled to take place on Wednesday 2nd December 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;St Helens &amp; Knowsley Teaching Hospitals NHS Trust is the BEST acute Trusts in England for the THIRD year running!&lt;/p&gt;\n&lt;p&gt;The Trust is currently the only acute Trust in Cheshire and Merseyside, and is one of few in the entire country, to achieve the title of OUTSTANDING, rated by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;We provide a full range of acute adult services to our local population of circa 350,000 and provide tertiary services across a much wider area in the North West, North Wales and Isle of Man. We are a Major Trauma Unit and the Mersey Regional Burns Unit.&lt;/p&gt;\n&lt;p&gt;Our &#39;5 Star Patient Care&#39; strategy is at the heart of all that we do; supporting our vision to provide world class services for all our patients by getting it right for every patient, every time.&lt;/p&gt;\n&lt;p&gt;Our latest achievements include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Trust rates Outstanding by the CQC – Inspection August 2018&lt;/li&gt;\n&lt;li&gt;Best in the NHS, Patient Led Assessment of the Care Environment 2017 and 2018&lt;/li&gt;\n&lt;li&gt;The Trust achieved top marks in the country for areas including; cleanliness, food, privacy and dignity, facilities for patients living with dementia and disabilities, conditions, appearance and maintenance of the hospital buildings.&lt;/li&gt;\n&lt;li&gt;Top 100 places to work in the NHS (NHS Employers and Health Service Journal)&lt;/li&gt;\n&lt;li&gt;Best acute Trust in England (NHS Staff Survey 2017 and 2018)&lt;/li&gt;\n&lt;li&gt;Best Patient Experience in the NHS (CHKS Top Hospitals Awards 2015)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In the NHS Staff Survey 2018 the Trust scored the highest marks in the following areas;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Positive organisation culture of safety&lt;/li&gt;\n&lt;li&gt;Quality of care&lt;/li&gt;\n&lt;li&gt;Staff engagement&lt;/li&gt;\n&lt;li&gt;Staff morale&lt;/li&gt;\n&lt;li&gt;Equality, diversity and inclusion&lt;/li&gt;\n&lt;li&gt;Providing a safe environment for staff&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our staff rated our Trust as the best place to work and receive treatment. The Trust has also been recognised, for the third year running, as being the top acute Trust in the entire country for staff engagement, staff motivation, and pride in the quality of care we provide to patients.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sally Patrick Job title Principal Clinical Pharmacist&lt;/p&gt;\n&lt;p&gt;Email address sally.patrick@sthk.nhs.uk &lt;/p&gt;\n&lt;p&gt;Telephone number 0151 290 4286&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121089.jpg", "name": "St Helens and Knowsley Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121089"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whiston and St Helens Hospitals, Prescot", "postalCode": "L35 5DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4201", "longitude": "-2.78641"}}, "title": "Advanced Clinical Pharmacist- Medicines Safety", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252927", "validThrough": "2020-11-16T23:59:59+0000"}