{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 £45,780 - £51,393 per annum incl"}}, "datePosted": "2020-10-29T11:46:36+0000", "description": "&lt;p&gt;&lt;em&gt;University College London Hospitals NHS Foundation Trust (UCLH) will be increasing surgical services in 2020 as part of our continued vision to deliver top-quality patient care, excellent education and world-class research.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Currently UCLH provide first-class acute and specialist services across eight sites and will be opening a new hospital providing surgical services in the Autumn of 2020. Additional support is required to staff this new site and the services on offer, therefore we are seeking applicants to the post/s of Medicines Management Technician to support our current staffing structure for this exciting new hospital at UCLH.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;UCLH, in partnership with University College London, has been designated one of the country’s five comprehensive biomedical research centres and there is an on-site early phase cancer clinical trials unit.&lt;/p&gt;\n&lt;p&gt;The UCLH Macmillan Cancer Centre opened in April 2012 and encompasses our busy outpatient clinics and daycare treatment facilities as well as our growing ambulatory chemotherapy practice.&lt;/p&gt;\n&lt;p&gt;The pharmacy cancer team is well integrated into the cancer directorate and provides a high-quality and progressive pharmacy service to cancer patients. Chemotherapy production services are delivered from a state of the art unit.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and self-motivated pharmacy technician to join our lively, progressive and dynamic pharmacy team. The successful candidate will provide a ward based clinical pharmacy technician service to our oncology and haematology patients. The postholder will work closely with the multi-disciplinary team and will have the opportunity to work across different clinical settings including inpatient wards, daycare, outpatients and ambulatory care.&lt;/p&gt;\n&lt;p&gt;You must be a qualified Pharmacy Technician with a NVQ Level 3 in Pharmacy Services and approved underpinning knowledge e.g. BTEC in Pharmaceutical Science or equivalent recognised pharmacy technician qualification, be registered with GPhC and be an accredited checking pharmacy technician or have suitable experience to work towards this.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDanielle OhanaAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact Russel Uddin (russel.uddin@nhs.net) or Danielle Ohana (danielle.ohana@nhs.net).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Medicines Management Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248171", "validThrough": "2020-11-12T23:59:59+0000"}