{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "64811", "minValue": "43928", "unitText": "YEAR", "value": "£43,928 - £64,811 per annum, including London Weig"}}, "datePosted": "2020-11-03T17:15:44+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking an enthusiastic and conscientious dentist with good interpersonal and clinical skills to join the Community Special Care Dental Service. This is a full time position and will involve working in our clinics based in South West London (Merton, Sutton &amp; Croydon) as well as providing domiciliary care for our patients residing in the local area.&lt;br /&gt; &lt;br /&gt;The successful candidate will preferably have current or recent previous, experience of working in a UK-based salaried primary-care dental service. They should have established and demonstrable skills in the provision of oral health care for children and adults with special needs. Ideally the candidate will also have experience of domiciliary dentistry, dental screening and dental epidemiological fieldwork. Candidates who have worked in General Dental Services and have an interest in Special Care will also be considered.&lt;br /&gt; &lt;br /&gt;Working as part of a team and with excellent nursing support, this post will suit a dentist who is committed to providing a high standard of oral health care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Good clinical and patient-management skills will enable the post-holder to achieve a high level of personal job satisfaction.&lt;br /&gt; &lt;br /&gt;Full registration with the GDC and completed vocational training or equivalence is essential for this post as is eligibility for a NHS performer number. A driving licence and daily access to a vehicle is also highly desirable.&lt;br /&gt; &lt;br /&gt;Candidates will not be short-listed unless their application provides evidence of how they meet the essential competencies listed in the Person Specification.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Fereshteh Taleifaz&lt;/p&gt;\n&lt;p&gt;Job title Lead Clinician&lt;/p&gt;\n&lt;p&gt;Email address fereshteh.taleifaz@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SW London Clinics, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Community Dental Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254898", "validThrough": "2020-11-26T23:59:59+0000"}