{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a pro rata"}}, "datePosted": "2020-11-06T14:46:02+0000", "description": "&lt;p&gt;We have an exciting opportunity to work in a new team at the forefront of innovation in Children’s and Young Peoples Mental Health and to play a key part in a team of people delivering interventions into schools and other settings in the Bletchley area of Milton Keynes. You will be part of a successfully established Wave 1 Mental Health Support Team (MHST) established to increase access and availability of mental health and wellbeing support for children and young people.&lt;/p&gt;\n&lt;p&gt;Milton Keynes Mental Health Support Team is looking for a qualified Education Mental Health Practitioner to join its team. We are seeking applicants who have successfully qualified from the Education Mental Health Practitioner PGDip as part of the MHST programme. We seek to appoint an enthusiastic and dynamic individual who is passionate about improving health outcomes for children and young people.&lt;/p&gt;\n&lt;p&gt;You will undertake assessments of children and young people and deliver evidence based low intensity group and individual interventions to children and young people with mild to moderate anxiety and depression and/or behavioural difficulties and their families and carers. You will also provide training and consultation to schools and other agencies about mental health in children and young people and support schools in identifying specific areas of need as part of the whole school approach to mental health.&lt;/p&gt;\n&lt;p&gt;You will work alongside other EMHPs, Mental Health Practitioners and a Senior Clinical Lead to support the wellbeing and mental health needs of 17 Bletchley schools and colleges.&lt;/p&gt;\n&lt;p&gt;MK MHST works with Young people with mild to moderate mental health presentations attending school in the Bletchley area in Milton Keynes.&lt;/p&gt;\n&lt;p&gt;The purpose of the team is to&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide evidence-based interventions for mild to moderate mental health issues.&lt;/li&gt;\n&lt;li&gt;Support the senior mental health lead in each education setting to introduce or develop their whole school or college approach.&lt;/li&gt;\n&lt;li&gt;Give timely advice to school and college staff, and liaising with external specialist services, to help children and young people to get the right support and stay in education.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;CNWL are committed to progressing and supporting their staff with career development and training, and ensuring staff health and wellbeing and job satisfaction.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMary Ann MonaghanJob titleTeam ManagerEmail addressmaryann.monaghan@nhs.netTelephone number01908 725691Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sarah Graham &lt;/strong&gt;&lt;strong&gt;sarah.graham10@nhs.net&lt;/strong&gt;&lt;strong&gt; on 01908 725691&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eaglestone Health Centre, Milton Keynes", "postalCode": "MK6 5NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0248", "longitude": "-.738428"}}, "title": "Education Mental Health Practitioner (EMHP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260178", "validThrough": "2020-11-19T23:59:59+0000"}