{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 to £76,751 pa"}}, "datePosted": "2020-11-03T13:45:16+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;MYDoc Specialty Doctor in Anaesthetics (2 POSTS)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Mid Yorkshire Hospitals NHS Trust is pleased to announce the introduction of these new roles aimed at doctors who are passionate about their practice and their career outside traditional models.  Our posts will combine education and career development with practical patient-facing care.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;These posts are not recognised UK training posts.  Nevertheless, MYDoc doctors will have a named supervisor and be supported in undertaking scheduled educational opportunities to consolidate and develop alongside their experiential learning, with certificated outcomes or credentialing to support career progression through other routes.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;An Introduction to the Division/Specialty from Dr Rose, Head of Clinical Service for Anaesthetics, Critical Care &amp; Pain Services. &lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our anaesthetic team includes 51 Consultants, 2 Associate Specialists and 5 Staff Grades with 12 Specialty Trainees, 20 Core trainees, and 2 Foundation Doctors.  The clinical team is supported by a dedicated team of administrative staff and has office and networked computer facilities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We provide anaesthetic services across our three hospital sites (Pinderfields (Wakefield), Dewsbury and Pontefract), which make up The Mid-Yorkshire Hospitals Trust. Our Trust has modern, spacious state of the art clinical and teaching facilities, with 15 operating theatres at Pinderfields which is also our acute hub and obstetrics centre with 3 dedicated maternity theatres, 6 theatres at Dewsbury Hospital and 4 in Pontefract. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a busy centre, with around 27,000 anaesthetics delivered, a 7000-delivery maternity unit, a busy Pain Management Service, a 20-bed critical care unit and the Regional Burns Unit. We also provide specialist anaesthesia support to other services such as cardiology, radiology, paediatrics (including burns) and emergency medicine – as well as the full range of services the Trust provides. We provide separate acute/obstetric anaesthesia on-call and critical-care on-call consultant rotas.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are very much a forward-looking department, striving for excellence in our services.  We have a number of ongoing service and quality improvement projects, including building a dedicated trauma anaesthesia team to enhance both speed and quality of care, and we are developing new pathways based on NELA data.  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Within our routine work, we are looking at ways to improve our peri-operative care pathways, and have just started providing cardio-pulmonary exercise testing as standard for our major colorectal surgery patients, alongside our major urology and vascular patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A team of junior doctors with an acute/obstetrics consultant, and an intensive care consultant provides the on-call cover for the anaesthetic service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As an Associated teaching Trust we are very focussed on education and development and support local and regional teaching; our team has many training awards for training anaesthetists, ACCS trainees, paramedics and medical students and others. We are very proud of our training and research contribution and run a number of courses including in difficult airways or obstetrics. Our service is the home of the internationally recognised MYRAG regional anaesthesia course.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a strong leadership pedigree in supporting leaders within the Trust, region or on the national or international stage; regional advisors, organ donation leads, TPDs, or international emergency relief work are all strong fields of interest within our team, whom we are keen to support.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is MY place to work.  If you want to make it yours, get in touch and see what a career at Mid-Yorks could be like for you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Alastair Rose &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Head of Clinical Services – Anaesthetics, Critical Care &amp; Pain Services&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;01924 542273&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Applicants will be eligible for the post of Specialty Doctor as described in Terms and Conditions of Service for Specialty Doctors – England (2008) and will be remunerated as appropriate on the salary scale MC46 (£41,158 to £76,751) per annum.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For any queries please contact Medical Staffing on (01924) 543642.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Candidates are welcome to visit the department &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is subject to a Disclosure Barring Service (DBS) check.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is an equal opportunities employer and operates a no smoking policy.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "MYDoc SPECIALTY DOCTOR IN ANAESTHETICS (2 POSTS)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254179", "validThrough": "2020-11-10T23:59:59+0000"}