{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16490", "minValue": "16490", "unitText": "YEAR", "value": "£9.81 per hour"}}, "datePosted": "2020-10-28T09:31:30+0000", "description": "&lt;p&gt;Brighton &amp; Sussex University Hospitals NHS Trust are seeking mature, honest, enthusiastic, hardworking and committed individuals, who are able to work in a team and as an individual on own initiative. &lt;br /&gt;&lt;br /&gt;You will be complimenting existing security teams based in the busy environment of the Royal Sussex County Hospital, Brighton and the Princess Royal Hospital, Haywards Heath. &lt;br /&gt;&lt;br /&gt;You will be required to perform duties within all premises in Brighton &amp; Sussex University Hospitals NHS Trust. You must be capable of protecting staff, patients and visitors and dealing with untoward incidents. Ideally you will have experience of dealing with the public in a customer orientated environment and be of a calm, sympathetic nature whilst maintaining an authoritative manner. Some control room duties will be required. &lt;br /&gt;&lt;br /&gt;You will come into contact with difficult, aggressive and sometimes violent individuals as well as patients and visitors. You will be given formal training in Conflict management &amp; Physical Intervention Techniques. A degree of physical and mental robustness is required. If you have any doubts about your physical abilities or any health problems that will make you more liable to physical or mental harm you should consider carefully whether to apply. &lt;br /&gt;&lt;br /&gt;Essential requirements for this role are good communication skills, good understanding of written and spoken English, staying calm under pressure and being able to sustain lengthy periods of concentration. Full training will be provided but experience of working in Security in a Healthcare or Higher Education establishment would be advantageous. Desirable for applicants to possessed a full, current, clean driving license (car) . &lt;br /&gt;&lt;br /&gt;Hours of work will be as required, but based on a 37.5 hour week pro rota, rostered duties will may include 12 hour shifts at weekends, nights and bank holidays. &lt;br /&gt;&lt;br /&gt;Security staff will be recruited in accordance with BS7858:2006. &lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameIan DoutreJob titleSecurity Operational Manager &amp; Training LeadEmail addressIan.Doutre@nhs.netTelephone number7051Additional contact information&lt;/p&gt;\n&lt;p&gt;Mathew Halford, ext: 7062&lt;/p&gt;\n&lt;p&gt;Email Mathew.halford@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital &amp; Princess Royal Hospital, Brighton and Haywards Heath", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Bank Security Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245830", "validThrough": "2020-11-08T23:59:59+0000"}