{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-19T09:15:30+0100", "description": "&lt;p&gt;Applications are invited for the post of consultant urological surgeon with an interest in bladder cancer. The position attracts a total of 10 PAs and includes on call and clinical commitments at the St George&#39;s University Hospitals NHS Trust sites and sessions at Epsom and St Helier Hospital.&lt;/p&gt;\n&lt;p&gt;St George&#39;s University Hospitals NHS Trust is a joint specialist urological cancer centre with the Royal Marsden Hospital and is the major surgical centre in South West London for bladder cancer. We perform robotic cystectomy and provide a specialist service for high risk non muscle invasive bladder cancer, with a particular interest in BCG failure.&lt;/p&gt;\n&lt;p&gt;The Department of Urology has 14 Consultant Urological Surgeons, supported by a dedicated team of Clinical Nurse Specialists. St. George’s Hospital is one of the largest teaching hospitals in the UK, closely integrated to St George&#39;s Medical School, part of the University of London. We are a joint cancer centre with the Royal Marsden Hospital and one of the key providers of secondary and tertiary services in South West London.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The job description is awaiting final sign off from the Royal College of Surgeons, any amendments will be sent to potential candidates.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBenjamin AyresJob titleConsultant Urologist and clinical leadEmail addressbenjamin.ayres@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;Please contact Mr. Benjamin Ayres via email should you wish to discuss this post further.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George&#39;s University Hospitals NHS Foundation Trust, Tooting", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Urological Surgeon with an Interest in Bladder Cancer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231589", "validThrough": "2020-11-09T23:59:59+0000"}