{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum pro rata"}}, "datePosted": "2020-10-27T17:01:05+0000", "description": "&lt;p&gt;&lt;span&gt;This post is a fixed term post until the end of March 2021.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are able to offer you the opportunity to join our Occupational Therapy service and develop your clinical knowledge and skills across a variety of clinical areas e.g. orthopaedics, medicine, stroke, general surgery, care of the elderly and Supported Discharge.&lt;br /&gt;&lt;br /&gt;You will work in an acute hospital and community setting as an Occupational Therapist on rotation based at the Royal Lancaster Infirmary, Lancaster.&lt;br /&gt;&lt;br /&gt;You will have knowledge and experience in the assessment and treatment of patients and will be motivated to join us in improving our patients’ experiences. Graduate experience in an acute hospital setting is desirable.&lt;br /&gt;&lt;br /&gt;You will join a dedicated and motivated team of Occupational Therapy staff.&lt;br /&gt;&lt;br /&gt;In addition to a comprehensive induction package, the successful candidate will be subject to the completion of satisfactory 6 month probationary period with support from experienced Occupational Therapists. This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;br /&gt;&lt;br /&gt;Staff develop their knowledge and skills using our appraisal process and we actively support staff through supervision with in-service training opportunities and a peer support group.&lt;br /&gt;&lt;br /&gt;Requirements:-&lt;br /&gt;&lt;br /&gt;- You will have A Diploma or Degree in Occupational Therapy approved by the Royal College of Occupational Therapists&lt;br /&gt;&lt;br /&gt;- Registration with HCPC as an Occupational Therapist&lt;br /&gt;&lt;br /&gt;- The ability to travel between sites and in the community.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMary DriverAdditional contact information&lt;/p&gt;\n&lt;p&gt;Mary Driver- Therapy Team Manager (Supported Discharge/Discharge to Assess) 07970 037095&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Lancaster Infirmary, Lancaster", "postalCode": "LA1 4RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0429", "longitude": "-2.79902"}}, "title": "Occupational Therapist - Occupational Therapy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245522", "validThrough": "2020-11-10T23:59:59+0000"}