{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-02T10:32:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you committed to delivering high quality patient care?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have the attitude, emotional robustness and skills to work positively with patients with complex needs?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you enjoy working in a supportive and skilled team and enjoy a challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Wenric House is a 22 bedded low secure unit for men with a diagnosis of mental illness and/or personality disorder. Many of our service users have had experience of the criminal justice system in the past.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated, enthusiastic and thoughtful individuals with an interest in rehabilitation and recovery to join our multi-disciplinary team. You will have a good knowledge base, excellent communication skills and a flexible and positive attitude. You should have a caring, non-judgmental and inclusive attitude and be committed to the delivery of safe, high quality care. Experience in a secure setting may be an advantage but is not essential.&lt;/p&gt;\n&lt;p&gt;Our team works hard to ensure high quality patient centered care is at the heart of everything we do. The applicant will be expected to be dynamic and committed by actively contributing to and supporting the recovery process as well as maintaining the high standards of patient care whilst working within a safe, secure and supportive environment.&lt;/p&gt;\n&lt;p&gt;In return, the applicant can expect to work within a busy, yet supportive environment.&lt;/p&gt;\n&lt;p&gt;You will receive regular clinical supervision, and will be actively encouraged to undertake further training and study in order for you to continue to develop professionally, in accordance with your agreed personal development plans&lt;/p&gt;\n&lt;p&gt;We have established very effective ways of working with the patients to help them identify and reach their goals whilst keeping them safe and supporting them onwards to a new life in the community. If you think you have the right skills and values to offer us at this exciting time then we would very much like you to hear from you.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to demonstrate and develop your skills and ability, whilst continually improving services and providing hands on quality care to our service users.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post attracts Regional Secure Unit allowance of £1,446 per annum paid monthly.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Martyn Smith, Ward Manager on 01865 902242.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX4 4XN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7175", "longitude": "-1.22952"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251589", "validThrough": "2020-11-17T23:59:59+0000"}