{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 Agenda of change continous servi"}}, "datePosted": "2020-10-30T16:31:02+0000", "description": "&lt;p&gt;We are looking to recruit a suitably qualified clinical/counselling psychologist with an interest in adult mental health to increase the psychology resource currently available in our 2 Community Mental Health Teams (CMHTs) based at Bentley House, Harrow. The role will require the post holder to work alongside the MDT, which consists of Consultant Psychiatrists, Psychotherapists, Nurses, Social workers, OTs, in the management of clients with complex mental health problems. The teams are currently undergoing a transformation process which will increase and clarify the provision of psychological treatments across our existing teams and bring them in line with the Trauma Informed Approaches (TIA) and the Power Threat Meaning (PTM) Model.&lt;/p&gt;\n&lt;p&gt;It is also expected the post holder will carry out other duties such as facilitate therapeutic groups, work with Carers as required and, offer clinical supervision to assistant psychologists and clinical/counselling psychology trainees as appropriate. The post will also have a consultative role and undertake joint working as well as undertake the provision of training in psychological approaches within the multi-disciplinary team, as required. Psychologists are fully embedded in the CMHTs and their roles are integral to the efficient and effective provision of treatments by the teams. The postholder may also offer support to clients transitioning between Harrow teams and may also offer ongoing psychological interventions in the interest of continuity of care.&lt;/p&gt;\n&lt;p&gt;We are looking for applicants who have enthusiasm and passion for working with complex cases in secondary care settings and, applicants who enjoy working within a team context. The post would be suitable for an experienced clinician as well as a newly qualified clinical/counselling Psychologist who wishes to consolidate and extend their knowledge and skills in adult mental health speciality. Experience and or training in Cognitive Behavioural therapy and DBT approaches will be an advantage and the post holder will be given further training and support in developing skills in these areas.&lt;/p&gt;\n&lt;p&gt;The post holder will receive regular clinical supervision and support from an experienced Clinical/Counselling Psychologist as well as benefit from peer support and guidance from MDT members, in the service. There will be links to other psychologists within the overall psychology services in Harrow as well other CNWL Borough based psychology departments including IAPT services. We have good links with, and have trainees from, all the regional clinical psychology training courses.&lt;/p&gt;\n&lt;p&gt;Interview date: 23rd November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAli ModaresiJob titleConsultant Clinical PsychologistEmail addressali.modaresi@nhs.netTelephone number02089017038Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit, please contact Ali Modaresi, consultant clinical psychologist 020 8901 7038 ali.modaresi@nhs.net or Claudine Pisani (Team Manager) c.pisani@nhs.net 0208 424 7701&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrow, Harrow", "postalCode": "HA3 5QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5944", "longitude": "-.336169"}}, "title": "Clinical counselling psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250953", "validThrough": "2020-11-15T23:59:59+0000"}