{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum or AfC Band 8D"}}, "datePosted": "2020-10-19T14:46:32+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Consultant in Public Health &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS Consultant (dependent on experience and qualifications) &lt;em&gt;or&lt;/em&gt; NHS Agenda for Change Scale 8d (£75,914 - £87,754 per annum)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Joint post working across University Hospital Coventry &amp; Warwickshire and Coventry City Council. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;University Hospital Coventry &amp; Warwickshire (UHCW) and Coventry City Council are seeking an outstanding Consultant in Public Health to provide leadership and management across a range of areas including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The establishment of a public health intelligence and population health management programme within UHCW.&lt;/li&gt;\n&lt;li&gt;The development of plans and strategies to address variations in healthcare outcomes and health inequalities.&lt;/li&gt;\n&lt;li&gt;Contribute the public health dimension to UHCW initiatives on inequalities, workplace wellbeing and anchor institutions.&lt;/li&gt;\n&lt;li&gt;Lead Coventry City Council programmes tackling social determinants of health including housing &amp; homelessness, newly arrived communities, modern day slavery and violence prevention.&lt;/li&gt;\n&lt;li&gt;Contribute to Coventry City Council’s emergency planning, epidemic and pandemic response including the response to Covid-19 and delivery of the Local Outbreak Control Plan.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We’re looking for someone who has experience of:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Translating national public health policy into local action, by developing clear, targeted and long term strategies to improve health and reduce health inequalities.&lt;/li&gt;\n&lt;li&gt;Working across internal organisational structures and city wide partners including health, social care, education, housing, planning, transport and infrastructure to shape services and improve the impact on the health of the population.&lt;/li&gt;\n&lt;li&gt;Working in complex political and social environments, including successful working with local authority elected members.&lt;/li&gt;\n&lt;li&gt;Using data, research and intelligence to understand complex circumstances, design solutions and drive activity.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview date: 3rd December&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For an informal chat about the role please contact, Liz Gaulton, Director of Public Health &amp; Wellbeing at: Harmony.Lully@Coventry.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Based, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Consultant in Public Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232752", "validThrough": "2020-11-09T23:59:59+0000"}