{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inclusive"}}, "datePosted": "2020-10-29T12:46:16+0000", "description": "&lt;p&gt;&lt;strong&gt;NeuroResponse Band 8A Physician Associate Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;1 year fixed term&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;strong&gt;(Please note: If for any reason you are unable to view the Job specification and trust values documents, please access/ direct yourself to these on the UCLH trust site -where the post is also advertised).&lt;/strong&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;A unique and exciting opportunity (funded by The National Brain Appeal) for an experienced Physician Associate (PA) to lead the development of new digital and face to face care pathways in Neurology, with a mentorship link to a leading consultant for movement disorders (Botulinum toxin therapy).&lt;/p&gt;\n&lt;p&gt;The post is a collaborative partnership between UCLH Foundation Trust, NeuroResponse a Community Interest Company and London Central &amp; West (LCW) unscheduled care collaborative and also provides networking with colleagues on programmes such as NHS England Clinical Entrepreneur, NHS Digital Academy, The Royal Free Hospital, and the Healthy London Partnership.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will benefit from an excellent governance and personal development&lt;/span&gt; framework, which includes 4 days per week in LCW leading the delivery of unscheduled care to people living with long term neurological conditions such as Multiple Sclerosis. Using digital care pathways linked to NHS 111 and other partner organisations the PA will provide clinical leadership and support to multidisciplinary colleagues including GP’s, Nurses and paramedics 4 days per week. One day per week the post holder will work in the movement disorder clinical at The National Hospital for Neurology, UCLH to deliver care including administration of botulinum toxin injections.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There is a robust governance and supervision infrastructure in place for both roles and training is available as required. This new role would suit someone with leadership skills, experience in neurological care, a passion for digital solutions and advance practice.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Bernadette Porter NeuroResponse founder &amp; CEO Bernadette.Porter@NeuroResponse.com&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Neuroresponse Physician Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248374", "validThrough": "2020-11-19T23:59:59+0000"}