{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-26T12:31:09+0000", "description": "&lt;p&gt;We are looking for an enthusiastic, Specialist Occupational Therapist to join our Musculoskeletal Band 6 Rotational Scheme at the Royal Cornwall Hospitals Trust.&lt;/p&gt;\n&lt;p&gt;This is a rare opportunity to gain experience in a range of separate specialist areas in both inpatient and outpatient settings. The post includes Inpatient Adult Elective Orthopaedics, Acute Inpatient Trauma, Musculoskeletal Outpatients (including Fracture Clinic) and Outpatient Rheumatology. Whilst primarily based at RCH Treliske Hospital, in Truro, the Elective Orthopaedic component of the rotation is based at the St. Michaels Hospital site, in Hayle. There may also be some outlying clinics as part of the Rheumatology rotation. You will have the opportunity to manage a varied caseload from acute, high turnover patients to those requiring long-term interventions with chronic conditions. The caseload is mainly adult, but there will be some opportunities to work with paediatric clients.&lt;/p&gt;\n&lt;p&gt;Do you have a sound knowledge of the core Occupational Therapy skills? Are you keen to develop your specialist clinical skills so that they are transferable between inpatient and outpatient settings? Would you enjoy developing a leadership role? If so, we would love you to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sally Boulton (Elective Orthopaedics), 01736 758887; Tue/weds/thu&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "MSK Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242440", "validThrough": "2020-11-08T23:59:59+0000"}