{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-14T12:02:18+0100", "description": "&lt;p&gt;&lt;strong&gt;Birmingham Healthy Minds&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Psychological Wellbeing Practitioner (PWP’s).&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Base: Birmingham Healthy Minds, City wide &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Birmingham Healthy Minds (BHM) is the Improving Access to Psychological Therapies (IAPT) Service working in Birmingham Primary Care with GPs and we deliver psychological therapies to people with common mental health problems using the Stepped Care Model.&lt;br /&gt;&lt;br /&gt;Birmingham Healthy Minds is a well-established and excellent service that continues to offer high quality; evidence based psychological interventions for our identified populations working closely with our four local Clinical Commissioning Groups (CCG’s).&lt;br /&gt;&lt;br /&gt;We are looking to recruit Psychological Well-being practitioners (PWP’s) with energy, drive and ambition to provide excellent high quality and time limited psychological interventions in accordance with NICE guidelines to patients presenting with Depression and Anxiety Disorders at Step 2.&lt;br /&gt;&lt;br /&gt;Key features of the service are self-referral, telephone triage, walk-in service, access clinic and self-assessment as the main entry points. We are a recovery focused service who provide group work, both psycho-educational and therapeutic interventions to promote self-management techniques.&lt;br /&gt;&lt;br /&gt;BHM are seeking to appoint flexible and highly motivated PWPs to provide high volume, low intensity treatment options. As a PWP working for BHM you will be expected to deliver guided self-help interventions using a variety of mediums including cCBT, Psycho-educational workshops, one to one and telephone work. In response to the Covid-19 pandemic we have adapted our working pattern to include more flexibility in the way we deliver the valued interventions offered by our Psychological Wellbeing Practitioners. Part of the PWP role also includes actively reducing stigma of common mental health problems by mental health promotion in the wider community.&lt;br /&gt;&lt;br /&gt;BHM encourages professional development which includes internal and, where viable external training opportunities, as well as encouraging PWPs to become champions for specialist interests.&lt;br /&gt;&lt;br /&gt;We provide regular caseload management, excellent clinical skills supervision and believe that fidelity to the IAPT model along with highly motivated and skilled workforce are key components to our continuing success.&lt;br /&gt;&lt;br /&gt;The service has strong clinical and operational leadership and is very innovative in service planning and delivery. Our staff report that they feel part of a supportive team that fosters a nurturing and caring environment to work in. We believe that staff well-being is paramount to providing excellent patient care.&lt;br /&gt;&lt;br /&gt;Birmingham Healthy Minds is an extremely busy service that covers Birmingham GP practices. The service operates flexible working hours from 8am to 8pm Monday to Friday and some Saturdays.Commitment to being available to work some of these hours as per your contracted hours and service needs is necessary.&lt;br /&gt;&lt;br /&gt;We encourage applications from trainee PWP’s who are about to complete their course to apply, with posts being offered conditionally on confirmation of passing an IAPT approved training course.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachel BradleyJob titleSenior Psychological Wellbeing PractitionerEmail addressrachel.bradley5@nhs.netTelephone number0121 301 2525&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community, Birmingham", "postalCode": "B1 3RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4841", "longitude": "-1.91731"}}, "title": "Band 5 Psychological Well Being Practitioner - Birmingham Healthy Min", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226143", "validThrough": "2020-11-22T23:59:59+0000"}