{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "57583", "minValue": "57583", "unitText": "YEAR", "value": "57,583.00"}}, "datePosted": "2020-11-04T13:53:19+0000", "description": "&lt;p&gt;Are you an &lt;strong&gt;Advanced Clinical Practitioner&lt;/strong&gt; who wants to make a real difference? Tired of the old way of working? Partnering Health Limited are seeking &lt;strong&gt;Advanced Clinical Practitioners&lt;/strong&gt; &lt;strong&gt;Nurse or Paramedic&lt;/strong&gt; to join us in our Out of Hours service.&lt;/p&gt;\n&lt;p&gt;We are keen to offer flexibility to our employees so although we are ideally seeking candidates who would like to be contracted for hours each week (full time or part time) we also offer bank contracts which allow you to pick the shifts that suit your circumstances.&lt;/p&gt;\n&lt;p&gt;As an &lt;strong&gt;Advanced Nurse Practitioner&lt;/strong&gt;, working as part of a team you will provide an efficient integrated urgent care service to our patients with a caring and respectful disposition. Working independently via telephone, through face to face consultations or home visits, you will be accountable for delivering safe, clinical decision-making and expert care to a high standard. Acting within your professional boundaries, your duties will include all (or part) of the patient journey including initial history taking; clinical assessment; diagnosis; treatment; prescribing and evaluation of their care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There are a variety of opportunities across the county in our clinics, cars and our Whiteley contact centre.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Advanced Clinical Practitioners Nurse or Paramedic Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Through telephone clinical assessment, obtain a relevant and sequential history of the presenting complaint to determine a working diagnosis.&lt;/li&gt;\n&lt;li&gt;Formulate a management plan for the patient, using other sources of healthcare professionals (such as GP or Pharmacists) if required to support diagnosis or next course of action.&lt;/li&gt;\n&lt;li&gt;Prescribe medication as required within your clinical competence.&lt;/li&gt;\n&lt;li&gt;Recognise the need and initiate emergency treatment in order to save life or to safeguard the interests of the patient and refer to emergency services when appropriate ·&lt;/li&gt;\n&lt;li&gt;To be professionally and legally responsible and accountable for all aspects of clinical decision making within your clinical competence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Advanced Clinical Practitioners Nurse or Paramedic Key Skills and Experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualified non-medical prescriber.&lt;/li&gt;\n&lt;li&gt;Registered with NMC / HCPC&lt;/li&gt;\n&lt;li&gt;Experience working in a primary care and /or urgent care setting&lt;/li&gt;\n&lt;li&gt;At least three years post qualified&lt;/li&gt;\n&lt;li&gt;You must be competent at taking a clinical history face to face and on the telephone, excluding red flags and undertake a physical examination of the patient for patients presenting with undifferentiated conditions&lt;/li&gt;\n&lt;li&gt;Good clinical skills in assessment, diagnosis and management of acute Primary care presentations&lt;/li&gt;\n&lt;li&gt;Be able to clear an enhanced DBS check and be authorised to work in the EEC&lt;/li&gt;\n&lt;li&gt;Rates on this advert are based on a full-time basis plus enhancements for unsociable hours&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;We will consider applications fromcandidates seeking part time hours or casual hours, just let us know your availability when applying.&lt;/span&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135074.jpg", "name": "Partnering Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whiteley", "postalCode": "PO15 7FJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8792", "longitude": "-1.23861"}}, "title": "Nurse/Paramedic- Whiteley", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256080", "validThrough": "2020-11-18T23:59:59+0000"}