{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 2"}}, "datePosted": "2020-10-30T15:17:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Care Support Worker – Band 2&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Do you want first choice of shifts at a newly merged trust offering a range of highly specialist services to patients across the North East? Do you want more flexibility and a better work-life balance?  Would you like to earn some extra money at top of band 2 rates?&lt;/p&gt;\n&lt;p&gt;We are looking for motivated and enthusiastic Care Support Workers to join the NHSP staff bank at South Tyneside &amp; Sunderland NHS Foundation Trust. You will have access to first choice of shifts to suit your lifestyle, with the opportunity to bring your skills to a leading trust, renowned for their friendly culture, person-centred care, specialist services and convenient location.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Providing acute hospital and community-based healthcare services to a population of around 430,000 people in the North East, why not join a dedicated team of over 8000 staff who deliver outstanding care and work together to achieve the highest possible standards for their patients.&lt;/p&gt;\n&lt;p&gt; Be part of the Trusts shared visions:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide a wide range of high quality, safe and accessible healthcare services&lt;/li&gt;\n&lt;li&gt;Recruit, retain and motivate skilled and compassionate staff, who are proud to act as ambassadors of the service they provide&lt;/li&gt;\n&lt;li&gt;Be the employer of choice in the North East of England&lt;/li&gt;\n&lt;li&gt;Listen, learn and innovate&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Working for NHSP at South Tyneside &amp; Sunderland NHS Foundation Trust gives you the opportunity to work across a variety of wards, building rapport and improving your skills. Wards such as&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Respiratory&lt;/li&gt;\n&lt;li&gt;Emergency Assessment Unit&lt;/li&gt;\n&lt;li&gt;Elderly Care/ Palliative&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You can work one shift a week or 56 hours per week, the only minimum requirement is one shift every 6 months to remain on the system!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 2 Pay Rates&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;Days:  £9.89           Nights/Saturdays:  £13.94          Sundays/Bank Holidays:  £18.10&lt;/p&gt;\n&lt;p&gt;In return for your hard work and NHSP can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates - &lt;/strong&gt;Work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of shifts at your Trust&lt;/strong&gt; – Access to shifts before they are available to agency &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working to suit your lifestyle &lt;/strong&gt;– Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance for every shift you work &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book and manage your shifts on the go&lt;/strong&gt; – Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03332 407 552&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work Nationally across multiple Trusts – &lt;/strong&gt;Work across any Acute Trust NHSP work with (Subject to Trust specific training requirements)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To apply for this post, you will need to meet one of the following criteria:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;6 Months experience in a general acute nursing home within the last 2 years (October 2018 – Present) and a Level 2 or 3 NVQ in Health &amp; Social Care Dated 2011 onwards.&lt;/li&gt;\n&lt;li&gt;3 Months Paid Acute hospital experience within the last 2 years (October 2018 – Present) and a Level 2 or 3 NVQ in Health &amp; Social Care Dated 2011 onwards or a Care Certificate issued from an NHS Trust.&lt;/li&gt;\n&lt;li&gt;A Student Nurse with at least 10 weeks clinical placements&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note the following guidance:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You must meet both the experience and Qualification criteria.&lt;/li&gt;\n&lt;li&gt;Domiciliary/Community Care experience is not accepted, experience must be in a General Acute Care/Nursing home.&lt;/li&gt;\n&lt;li&gt;Proof of Certificate will be requested at Interview Stage, we cannot progress your application without this.&lt;/li&gt;\n&lt;li&gt;You will be required to complete a manual observations test at Interview Stage.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Register today for various flexible shifts, you choose when you want to work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information on the role or details on how to join NHS Professionals, simply get in touch with Paul McAdam, Trust Recruitment Coordinator, paul.mcadam@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Tyneside Or Sunderland", "postalCode": "NE34 0PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9719", "longitude": "-1.42994"}}, "title": "Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250730", "validThrough": "2020-11-13T23:59:59+0000"}