{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per Annum"}}, "datePosted": "2020-11-02T14:31:18+0000", "description": "&lt;p&gt;LYPFT is currently looking for a Consultant Psychiatrist to join our CONNECT service, a newly developed specialist adult eating disorders service which provides specialist care for adults with eating disorders across the West Yorkshire region. CONNECT is one of 11 pilot sites selected by NHS England to develop new services in line with the NHS Five Year Forward View.&lt;/p&gt;\n&lt;p&gt;The post holder will work as part of the inpatient team at the Yorkshire Centre for Eating Disorders in Leeds and will have a lead role within the wider MDT in the assessment and treatment of individuals with eating disorders requiring inpatient treatment.&lt;/p&gt;\n&lt;p&gt;You will be qualified with full registration with the GMC as well as have experience in working with indiviudals with eating disorders and within an inpatient MDT. You will have Approved Clinician status and S12 approval or be willing to achieve these within 3 months of appointment. Clinical experience in eating disorders psychiatry (including risk management, the use of the MHA and nasogastric feeding) is essential.&lt;/p&gt;\n&lt;p&gt;As well as working with an award-winning team, CONNECT and LYPFT offer a number of other benefits including a strong commitment to continuous personal development, research and service development.&lt;/p&gt;\n&lt;p&gt;This post allows for flexible working with the option of part time working (minimum 8PAs) being available.&lt;/p&gt;\n&lt;p&gt;**Please note any correspondence following application will be sent via trac.jobs &amp; the Trust&#39;s Resourcing Team**&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr. Monique Schelhase, Clinical Lead, CONNECT: The West Yorkshire and Harrogate Adult Eating Disorders Service - 0113 855 6400 (email preferable: m.schelhase@nhs.net)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS14 6UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8066", "longitude": "-1.47091"}}, "title": "Consultant in Eating Disorders", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252436", "validThrough": "2020-11-27T23:59:59+0000"}