{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "31,365 - 37,890"}}, "datePosted": "2020-10-29T10:48:19+0000", "description": "&lt;p&gt;&lt;strong&gt;SENIOR AUDIOLOGIST: Audiology &amp; Hearing Therapy Department, St Martin’s Hospital, Bath&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BAND: 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;LOCATION: Bath &amp; North East Somerset. Base is St Martin’s Hospital in Bath with peripheral clinics in Keynsham Health Centre, Bristol) and Paulton Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Inspired&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an Audiologist who loves rehab and is thoughtful and dedicated to your patients?&lt;/p&gt;\n&lt;p&gt;Do you like working in a service where you are given enough time to talk to your patients as well as complete your clinical tasks?&lt;/p&gt;\n&lt;p&gt;Do you like working in bespoke sound treated clinic rooms with windows and nice views?&lt;/p&gt;\n&lt;p&gt;Do you like fitting up-to-date hearing aids on equipment that is up-to-date and well maintained?&lt;/p&gt;\n&lt;p&gt;Do you like to be involved in discussions about the future of the service and how we can improve things?&lt;/p&gt;\n&lt;p&gt;Do you like to take part in research projects and work closely with hearing therapists and volunteers?&lt;/p&gt;\n&lt;p&gt;Do you like taking part in, or running, group sessions?&lt;/p&gt;\n&lt;p&gt;Our service already includes all these as part of our daily business and we have other projects that we want to develop. We are looking for an experienced audiologist to help improve and expand services for people in care homes, help us develop systems and processes that will sustain our service through the challenges of the coming years and take on students and research projects.&lt;/p&gt;\n&lt;p&gt;Our patient feedback is overwhelmingly positive with many people saying it’s the best Audiology service they have ever used.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Senior Audiologist delivering a fully NHS commissioned service with us you will receive AfC salary and terms and conditions including an NHS pension.&lt;/p&gt;\n&lt;p&gt;We’ll provide regular internal and external training, send you to conferences and regional meetings, provide you with on- line training and information resources and regular peer group clinical supervision sessions.&lt;/p&gt;\n&lt;p&gt;We might ask you to work a slightly different pattern at busy times but will always do our very best to be reasonable about annual leave requests and your working pattern to ensure you feel valued and needed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have a BSc or BAAT qualifications in Audiology and be fully registered with the RCCP and/or HCPC.&lt;/p&gt;\n&lt;p&gt;As the Senior Audiologist you will perform diagnostics and fit hearing aids to adults from 18 years. This includes testing and providing full diagnostic reports for the ENT service, fitting Oticon hearing aids, supervising students if needed, supporting and training volunteers and care home staff, working alongside hearing therapists and associate audiologists. All this is ultimately to ensure that our patients and service users can access and make the very best of the many services we offer in order to reduce the impact of hearing loss.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working within the Audiology and Hearing Therapy team, you will see people in our sound treated clinic rooms, in care home sessions and occasionally in their own homes. You will be based in St Martins Hospital in the picturesque city of Bath, with additional clinics on the outskirts of Bristol and the rural location of Paulton.&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further please contact Melanie Ward via email to book a time to discuss the role or arrange to come in for an informal visit:melanie.ward@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt;We will always do our best to offer interviews on Saturdays to prevent people from having to take leave, let us know if you would prefer this option.&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA2 5RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3578", "longitude": "-2.37292"}}, "title": "Senior Audiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247986", "validThrough": "2020-11-12T23:59:59+0000"}