{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum/pro rata"}}, "datePosted": "2020-11-04T11:31:20+0000", "description": "&lt;p&gt;Staff Nurse - ICU&lt;/p&gt;\n&lt;p&gt;Division: Planned Care&lt;/p&gt;\n&lt;p&gt;Care Group: Peri-Operative &amp; Critical Care&lt;/p&gt;\n&lt;p&gt;Band: 5&lt;/p&gt;\n&lt;p&gt;Salary: £24,907 - £30,615 per annum/pro rata&lt;/p&gt;\n&lt;p&gt;Interview date: Week Commencing 30th November 2020&lt;/p&gt;\n&lt;p&gt;We are recruiting for a Registered Staff Nurse who shares our ambition and vision to deliver the &lt;em&gt;&lt;strong&gt;Best of Care by the Best People&lt;/strong&gt;&lt;/em&gt; and has the drive to take us forward, by ensuring that the Trust continues to be the first choice for patients and our staff.&lt;/p&gt;\n&lt;p&gt;We are looking for committed and enthusiastic nurses to work alongside our “CQC rated Outstanding” Critical Care Team for an opportunity to enhance and develop your skills within a challenging but positive environment, in our Level 3 Intensive Care Unit.&lt;/p&gt;\n&lt;p&gt;The critical care team is skilled, highly motivated and actively engaged with the multidisciplinary team to deliver high quality care. If successful you must be prepared to provide high quality evidence based care, flexible and be proactive in adapting to meet the needs of our service. Effective communication skills and the ability to work efficiently within a team are integral to this role. Our unit regonises the importance of staff health and well-being and the support that is necessary to maintain it.&lt;/p&gt;\n&lt;p&gt;This post offers an amazing opportunity for the successful applicant’s personal and professional development. You will commence with a 6 week local induction which focuses on the foundations of critical care nursing. The team coordinates individualised support and development based on the National Critical Care Competencies (STEPS) and into academic study. You will be part of our excellent rotational program between our Intensive Care and our High Dependency Unit to enhance your skills in both Level 2 and Level 3 care. We strive to provide you with opportunities to attend national conferences and study days to enhance and keep your knowledge up to date with current research and evidence based practice.&lt;/p&gt;\n&lt;p&gt;If this exciting opportunity sounds like this could be you then we like to hear from you. We would like you to arrange an informal visit to come and see what we can offer.&lt;/p&gt;\n&lt;p&gt;The Trust and its employees are all committed to creating and maintaining a fair and supportive working environment and culture.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to you, we will give you the opportunity to utilise and enhance your talents to assist us in the development of shaping the future of Medway NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Trust offers a number of apprenticeships and training opportunities in Leadership and Management, Business Services, Finance, Accounting, Human Resources, Clinical Support Work, Research and Innovation, Nursing Associate and Assistant Practitioner alongside our in-house comprehensive clinical pathways.&lt;/p&gt;\n&lt;p&gt;Our hope is that our education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the protection of children, young people, their families and vulnerable adults accessing its services. Promoting the message that “safeguarding is everyone’s business” is vital to ensure our patients are protected and safe from abuse. To this end you must comply with Trust’s and the Kent and Medway Safeguarding Board’s policies on safeguarding children, young people and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Point of Contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Susannah Johnson&lt;/p&gt;\n&lt;p&gt;Practice Development Nurse for Critical Care&lt;/p&gt;\n&lt;p&gt;susannah.johnson2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Staff Nurse - ICU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255620", "validThrough": "2020-11-24T23:59:59+0000"}