{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365- £38,890"}}, "datePosted": "2020-10-26T12:59:20+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;BeeU Children &amp; Young People Mental Health Service – Crisis Home Treatment Team&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Community Mental Health Practitioner&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Full-Time: 37.5 per week (you will be required to cover a 24 hr rota on a shift basis)&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; We are gathering a team of enthusiastic and experienced professionals to provide &lt;strong&gt;a 24 hour Crisis Home Treatment Team&lt;/strong&gt;. These Community Mental Health practitioner posts will join our existing Multi-Disciplinary team of professionals, headed by the Service Manager, Operational Leads, Clinical Leads. The BeeU service is a partnership between Midland Partnership Foundation Trust, The Children’s Society, Kooth and Healios working together in the interests of children and young people in Shropshire and Telford &amp; Wrekin.&lt;/p&gt;\n&lt;p&gt;The team will provide an active involvement in the assessment, development, implementation and evaluation of service user care which focuses on ensuring that the service users are supported to remain in their own homes wherever hospitalisation can be safely and appropriately avoided. The team will deliver home treatment 24/7 to an identified group of children and young people in Crisis by responding quickly to those referred with urgent and high-risk mental health needs, and provide collaborative, effective, evidence based interventions at the right time with the right person. This team will work within a multi-disciplinary framework, and work closely with other pathways and colleagues to ensure smooth transitions take place, and this includes transitions to adult services or alternative specialist providers and support for and facilitation of early discharge from hospital&lt;/p&gt;\n&lt;p&gt;There will be scope for creativity in this team, to develop evidence based interventions, to think systemically and work collaboratively with children, young people and families, informed by the local Transformation Plan, Future in Mind and the THRIVE framework. It really is time to think differently and creatively about how we can help more children and young people with their emotional wellbeing and mental health. You will be supported by some very lovely people in all parts of our service and the wider partnership.&lt;/p&gt;\n&lt;p&gt;If you are an appropriately qualified and experienced professional with a genuine passion and enjoyment for working as a team, in addition to helping children, young people and their families, then please do get in touch. Experience of working well in teams is essential but so too is being an all-round special sort of person (a few flaws are acceptable).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;You MUST be a fully registered Nurse, Social Worker or Allied Health Care Professional with appropriate mental health experience to apply.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We respect and are interested in skills and experience but we are also keen to embrace and develop the principles within the CYPIAPT, Future in Mind and the Thrive framework as well as the Trust’s Values. Whilst it will be challenging you will have the chance to help shape the new vision for the service and be part of something exciting from an early stage.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this role then please contact: &lt;span&gt;Leanne.harris@mpft.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Tel: 0300 124 0093 (option 2) Mobile: 07773582494&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury &amp; Telford", "postalCode": "SY3 8DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7076", "longitude": "-2.79477"}}, "title": "Band 6 CRHTT Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242540", "validThrough": "2020-11-17T23:59:59+0000"}