{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum inc."}}, "datePosted": "2020-10-26T15:47:13+0000", "description": "&lt;p&gt;An exciting opportunity has become available for the right person to cover the Lead Nurse position for the clinical support services at the Royal National Orthopaedic Hospital. This is a one year secondment to cover maternity leave.&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated, skilled, compassionate, and knowledgeable senior nurse to lead, support and work closely with the managers in the Outpatient Departments at both Stanmore and Bolsover Street, the Pre-operative Assessment Department and the Admissions &amp; Discharge Team.&lt;/p&gt;\n&lt;p&gt;The Lead Nurse is required to provide clinical leadership, professional education and training and to contribute to the Clinical Governance and the Research and Development Agenda. The daily challenge of 11am Discharge and achieving a reduced Length of Stay will be a key performance indicator for this role.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have significant experience of working in the NHS. Candidates should have excellent organisational and communications skills, be able to work under pressure whilst ensuring all deadlines are achieved.&lt;/p&gt;\n&lt;p&gt;Cross site working is expected with this post.&lt;/p&gt;\n&lt;p&gt;Are you an experienced Nurse who is currently looking for new opportunities?&lt;/p&gt;\n&lt;p&gt;NMC registration as an RN is essential as is a teaching and mentoring qualification or relevant experience. You will have a degree and preferably be working towards an MSc. Knowledge of orthopaedic conditions is desirable.&lt;/p&gt;\n&lt;p&gt;We look forward to meeting you to discuss what we can offer you here at the RNOH in return for your commitment, dedication and passion for nursing in this specialist area.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Clare Kehoe, Divisional Head of Nursing for Children, Outpatients, Imaging and Access on 0203 947 0063 or c.kehoe@.nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120878.png", "name": "Royal National Orthopaedic Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120878"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stanmore, Middlesex", "postalCode": "HA7 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6315", "longitude": "-.306607"}}, "title": "Lead Nurse for Clinical Support Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243236", "validThrough": "2020-11-09T23:59:59+0000"}