{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80554", "minValue": "70641", "unitText": "YEAR", "value": "£70,641 - £80,554 p.a. inc HCA"}}, "datePosted": "2020-10-20T14:16:56+0100", "description": "&lt;p&gt;There is an excellent opportunity to join the Evelina Children’s Community Directorate Management Team (DMT) as Head of Nursing for Children’s Community and Universal Children&#39;s Services. You will be an individual with an excellent record in nursing leadership, can demonstrate commitment, enthusiasm and excellent management skills to deliver our ambitious and exciting vision for children’s services for the families of Lambeth and Southwark.&lt;/p&gt;\n&lt;p&gt;Evelina London Children’s Healthcare brings together the Trust’s services for children and women’s including Evelina London Children’s Hospital. With an annual turnover of more than £310 million and 3,400 staff we are growing rapidly. We are the second largest provider of specialist children’s services in London and also provide a local child health service for Lambeth &amp; Southwark. Evelina London Children’s healthcare operates through four clinical directorates – Community, Surgical Services and Intensive Care, Medicine and Neonatology and Women’s services.&lt;/p&gt;\n&lt;p&gt;As the Head of Nursing for the Community Children’s Directorate you will provide nursing leadership and vision to the nursing teams for whom you will have direct responsibility which include school nursing, health visiting services, family nurse partnership, the sickle cell nursing team, and a shared responsibility for a new joint Children’s Community Services which now includes the complex needs nursing team. We are looking to recruit a talented and experienced Head of Nursing to lead and manage the outstanding community children&#39;s nursing workforce to provide high quality healthcare that makes a difference to children and their families.&lt;/p&gt;\n&lt;p&gt;The post holder will take a lead role in the services redesign and transformation, contributing strategic knowledge and professional insight into proposals and plans, and ensuring that community staff are engaged, supported with training and other specific requirements to contribute to new initiatives.&lt;/p&gt;\n&lt;p&gt;Your focus will be on working in partnership with multi-disciplinary teams, providing a strong nursing voice and leading the core elements of all aspects of nursing including service performance, development and improvement. The post reports directly to the Clinical Director and professionally to the Director of Nursing for Evelina London and is well supported by Community Matrons.&lt;/p&gt;\n&lt;p&gt;Closing date: Monday 4th January 2021&lt;/p&gt;\n&lt;p&gt;Interviews will take place in January (date TBC)&lt;/p&gt;\n&lt;p&gt;For further information and details on how to apply, please contact Helen Childs from Odgers Berndtson our recruitment partner.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Helen Childs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Consultant, Healthcare&lt;/p&gt;\n&lt;p&gt;Helen.Childs@odgersberndtson.com&lt;/p&gt;\n&lt;p&gt;+44 (0)77363 78474&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Head of Nursing Children’s Universal and Children’s Community Serivces", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234766", "validThrough": "2021-01-04T23:59:59+0000"}