{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-10-23T09:12:11+0100", "description": "&lt;p&gt;We are currently recruiting for an enthusiastic Principal Biomedical Scientist to help lead our fast paced and dynamic Histology team. The Principal Manager will closely be working with the Operations manager to lead the histology services across two general hospitals (Southend University/Basildon and Thurrock University Hospitals) and local GP community. You will be expected to provide expert leadership and knowledge for the scientific and technical advancement of Histopathology Services and to assist the lead consultants in areas of responsibility in the strategic development and delivery of this Clinical Service.When required be able to perform a range of highly specialised Healthcare Scientific activities including tissue dissection to IBMS/RCPath standards in specimen categories within competence and as agreed with consultant staff.&lt;/p&gt;\n&lt;p&gt;This an exciting time for us and our transition into our state-of-the-art laboratories that delivers 900 different tests across a multitude of disciplines.&lt;/p&gt;\n&lt;p&gt;As a vital member of our team, you will be the fundamental principle of making a positive difference to our healthcare service and in return you will receive regular training and coaching to develop your skills and to support you in your working life. Ideally, we seek candidates at this level who have previous experience in an equivalent role or comprehensive experience at team manager level, high degree of accuracy and numeracy skills, excellent problem-solving skills with great leadership qualities. Applications will be sought from self-efficient, self-motivated candidates who have achieved the following essential skills:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HCPC State Registration as a Biomedical Scientist, with evidence of Continued Professional Development&lt;/li&gt;\n&lt;li&gt;Management Qualification ILM level 3 or have relevant experience&lt;/li&gt;\n&lt;li&gt;Relevant M level qualification and IBMS Membership&lt;/li&gt;\n&lt;li&gt;High level working knowledge of biomedical techniques and practices at post honours degree level.&lt;/li&gt;\n&lt;li&gt;Expert interpretive and diagnostic skills.&lt;/li&gt;\n&lt;li&gt;Knowledge of National guidelines and protocols relating to specific discipline&lt;/li&gt;\n&lt;li&gt;Good knowledge of computer applications and LIMS including Word, Excel, PowerPoint, Access and Statistical Packages&lt;/li&gt;\n&lt;li&gt;Able to work with a high degree of accuracy, numeracy, interpretive skills and good problem-solving skills with leadership qualities.&lt;/li&gt;\n&lt;li&gt;Able to work across 3 different sites in a 24-7 work environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Desirable&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Higher management qualification&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "iPP Analytics Limited", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136414"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon", "postalCode": "SS14 3BY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.585", "longitude": ".457454"}}, "title": "Principal Biomedical Scientist - Band 8A - Histology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239760", "validThrough": "2020-11-06T23:59:59+0000"}