{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-13T15:46:08+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Histopathology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Replacement post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Brighton &amp; Sussex University Hospitals NHS Trust is looking for a Consultant Histopathologist with a sub-specialist interest in Gastrointestinal Pathology. The successful candidate will join an enthusiastic team of 13 consultants in the Department of Histopathology and Cytopathology at the Royal Sussex County Hospital in Brighton. This is a replacement, whole time equivalent post. The department has a large and varied workload and has a system of subspecialisation. An applicant with a subspecialist interest in Gastrointestinal Pathology is required, but also desirable would be an interest in Hepatopathology, Breast pathology or non-gynae cytopathology.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the Trust as it enters a new era of operation resulting from the 3Ts development programme and a forthcoming merger with Western Sussex Hospitals NHS Foundation Trust. The Pathology Department itself is involved in progressing network collaborations in digital pathology and genomics, while Brighton &amp; Sussex Medical School is building on the success of Project 200.&lt;/p&gt;\n&lt;p&gt;The histopathology department plays an important role in training of Histopathology trainees that rotate through the department and teaching at the Brighton and Sussex Medical School. Candidates with an interest in teaching, an academic interest, and experience of research in diagnostic pathology are encouraged to apply. Appointees will be supported in developing research interests.&lt;/p&gt;\n&lt;p&gt;Brighton and Sussex University Hospitals is the regional teaching hospital, providing general acute services to Brighton and Hove and Mid Sussex and tertiary services for patients across Sussex and the south east of England as a regional cancer centre. Working as one hospital across two sites in Brighton and Haywards Heath, we treat over half a million patients a year.&lt;/p&gt;\n&lt;p&gt;Please refer to the person specification in the job description with regards to CCT requirements.&lt;/p&gt;\n&lt;p&gt;When completing the application form please ensure you complete the section relating to your CCT date. If you have already have your CCT please confirm when you will be on the GMC Specialist Register. Please be aware you only have 12 months from your CCT to join the specialist registrar otherwise you will have to go through the CESR Route.&lt;/p&gt;\n&lt;p&gt;In addition to supplying us with your referee details for the last 3 years please also provide us with the contact details of your Responsible Officer for Appraisal and Revalidation&lt;/p&gt;\n&lt;p&gt;In the interest of equal opportunities, we want to make sure that information about candidates is provided in the same format so all applicants should fill in the standard application form on the NHS Jobs website and attach their CV.&lt;/p&gt;\n&lt;p&gt;Please be aware that candidates will be informed by email of the outcome of their application.&lt;/p&gt;\n&lt;p&gt;Closing date: 12th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;No Agencies&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMax WhibleyJob titleLead Consultant HistopathologistEmail addressmax.whibley@nhs.netTelephone number01273 664502Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Informal enquiries are welcome by contacting Dr Max Whibley (Consultant Cellular Pathologist) and Dr Kerry Sleigh (Consultant Cellular Pathologist) on 01273 664502; &lt;/span&gt;max.whibley@nhs.net&lt;span&gt; or &lt;/span&gt;k.sleigh@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Consultant Histopathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224922", "validThrough": "2020-11-12T23:59:59+0000"}