{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-29T17:01:10+0000", "description": "&lt;p&gt;&lt;strong&gt;An exciting job opportunity has arisen for a band 6 registered nurse in the Supported Care Team based in the South Norfolk area. Norfolk is well known for its beautiful beaches and access to the Norfolk Broads and the city of Norwich. The team is based in the market town of Wymondham. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Supported Care Service is a seven day service commissioned to provide an MDT approach to prevent unnecessary hospital admissions and to support timely discharges from acute and community hospitals. As a Supported Care Nurse, you will work closely with your colleagues to support patients in their home who are at risk of frailty, frequent admissions or at end of life. The team consists of Physiotherapists, Occupational Therapists, Nurses, Assistant Practitioners and HCA&#39;s working closely with Norfolk First Support as part of the Network of Escalation Avoidance Teams (NEAT) facilitation pathway. The successful candidate will be supported with clinical leadership and development in their role and will gain experience working in a multi-disciplinary team. There will also be a requirement to be involved in the training of fellow team members in the assessment and development of team multi-disciplinary competencies, as well as developing and maintaining their own inter-professional competencies.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting opportunity for a professional that wishes to work in a rewarding, fast-paced service, where joint MDT working and decision making is essential in the effective management of this cohort of patients. There are plenty of learning opportunities within NEAT and the Supported Care Service to develop further skills in the management of complex patients, within the community setting; so if you are interested in joining our team and developing your skills in a new and dynamic environment, then please consider applying. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply now to join an organisation that has been awarded an ‘Outstanding’ rating by the Care Quality Commission (CQC), the highest possible rating and the first stand-alone NHS community trust in the country to be awarded the title.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicola Samuels Clinical Operations Manager&lt;/p&gt;\n&lt;p&gt;nicola.samuels@nchc.nhs.uk&lt;/p&gt;\n&lt;p&gt;01953 609449&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk Community Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120940"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wymondham Health Centre, Wymondham", "postalCode": "NR18 0AT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5689", "longitude": "1.11258"}}, "title": "Supported Care Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249177", "validThrough": "2020-11-22T23:59:59+0000"}