{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa (plus HCAS)"}}, "datePosted": "2020-11-04T16:16:13+0000", "description": "&lt;p&gt;&lt;span&gt;Monet Ward is a male acute ward which provides a safe and supportive environment to aid patients in their recovery.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;People referred to the service may present a risk to themselves or others and/or their challenging behaviours may make it difficult for them to live at home or to make use of other services or community facilities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Three exciting Band 5 mental health staff nurse opportunities have arisen within Monet Ward.&lt;br /&gt;&lt;br /&gt;The post holders will be joining a multi-disciplinary team that is committed to the provision of highly quality patient centred care for all who use the service. The ward teams have strong nurse leadership including Band 6 Clinical Leads &amp; Deputy Ward Managers, Ward Manager as well as a Modern Matron who provides operational and clinical leadership across two wards. &lt;br /&gt;&lt;br /&gt;This nursing establishment seeks to ensure greater support to our junior staff and also optimises future career prospects of our Band 5 nurses within the acute care pathway.&lt;br /&gt;&lt;br /&gt;We therefore invite applications from compassionate and diligent Band 5 mental health nurses. &lt;br /&gt;&lt;br /&gt;You may already be in a Band 5 role and seeking a different challenge or you may be newly qualified and wish to join us on our Preceptee programme. &lt;br /&gt;&lt;br /&gt;Why work for NELFT?&lt;br /&gt;&lt;br /&gt;NELFT have a commitment to supporting our staff to provide the highest quality of care and have implemented a number of initiatives including:&lt;br /&gt;&lt;br /&gt;- Implementation of Safewards&lt;br /&gt;-A well- recognised Preceptee programme which includes a multi-disciplinary learning aspect&lt;br /&gt;-Development of a nurse rotational programme which incorporates mental and physical health care placements&lt;br /&gt;-Comprehensive training opportunities including physical health programme, working with personality disorder. varied and multifaceted Equalities &amp; Diversity course as well as a wide range of Safeguarding Adult and Children courses.&lt;br /&gt;- We are currently developing the role of Assistant Psychologists within our adult acute wards.&lt;br /&gt;- NELFT is recognised both nationally and internationally for a number of key clinical innovations including the acute care pathway and Open Dialogue.&lt;br /&gt;-NELFT has gained further national recognition for the implementation of the BME Network.&lt;br /&gt;&lt;br /&gt;Our Trust provides a wide range of mental health inpatient services including older adult, adult acute, Learning Disabilities, Psychiatric Intensive Care, Low secure services and young people. &lt;br /&gt;&lt;br /&gt;The inpatient teams are continually developing clinical care standards and are currently working on initiatives including Safewards, Safety Thermometer and Safety Crosses. &lt;br /&gt;&lt;br /&gt;In return for your hard work, NELFT is committed to promoting continued professional development and providing high quality supervision. NELFT is also committed to providing quality psychosocial interventions within acute and crisis services. For those with an interest in psychological interventions, opportunities will be available to staff in providing low intensity psychological interventions and to receive supervision from the psychology team. &lt;br /&gt;&lt;br /&gt;Mentoring and coaching including shadowing opportunities are available within the varied NELFT services as well as a range of courses in partnership with the local universities. &lt;br /&gt;&lt;br /&gt;The main responsibilities of the post: &lt;br /&gt;-To complete 5 days of Prevention and Management of Violence and Aggression course which is yearly updated and implement in practice as required.&lt;br /&gt;-To work shifts over a 365 day a year basis including night duty&lt;br /&gt;-To undertake assessment of client’s needs and support the MDT in formulating appropriate individual care plans, taking a holistic approach.&lt;br /&gt;- Ensure that relatives and carers of service users and feel supported and are able to communicate effectively with the clinical team &lt;br /&gt;- Appropriate IT skills to ensure accurate documentation and communication around care&lt;br /&gt;-Take steps to maintain the safety and welfare of staff, patients, visitors and to the ward.&lt;br /&gt;-Work alongside service users and carers/relatives to continually work towards improving and maintaining high standards.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opport&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sunflowers Court, Ilford", "postalCode": "IG3 8XJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.578", "longitude": ".110514"}}, "title": "Staff nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256590", "validThrough": "2020-11-18T23:59:59+0000"}