{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inc HCAS pro rata"}}, "datePosted": "2020-10-22T08:16:31+0100", "description": "&lt;p&gt;This is an exciting opportunity to join a well-established highly specialist multidisciplinary team on a one year fixed term contract, working with children between the ages of 5years and 13years. The service provides assessment, treatment and care for young people who are experiencing complex mental health difficulties and pose a significant risk to themselves or others. This could include direct physical violence, sexually harmful behaviour, fire-setting or self-harm.&lt;/p&gt;\n&lt;p&gt;This post, based in Kensington area of London, is to join a small, multidisciplinary and developing team . This is an exciting time to join the service as it continue to provide and maintain our good work during this difficult times.&lt;/p&gt;\n&lt;p&gt;The post holder will provide a qualified specialist clinical psychology service to children and young people with mental health problems across all sectors of care providing highly specialist psychological assessment and therapy to them and their families/carers, at the same time as offering advice and consultation on their psychological care to non-psychologist colleagues and to other, non professional carers, working autonomously within professional guidelines and the overall framework of the service’s policies and procedures. To utilise research skills for audit, policy and service development and research within the area served by the service of relevance to young people their families and carers.&lt;/p&gt;\n&lt;p&gt;The post holder will be a member of the multidisciplinary team and work autonomously providing highly specialist assessments to children with complex mental health presentations including ASD, OCD and Eating Disorders. Case formulation will contribute to multi-disciplinary treatment plans involving evidence-based interventions.&lt;/p&gt;\n&lt;p&gt;The post holder will provide advice and consultation to non-psychologists in the service on psychological interventions. They will take a lead in producing and implementing evidence-based guidelines for behavioural management on the inpatient unit.&lt;/p&gt;\n&lt;p&gt;The post holder will provide clinical supervision to less experienced clinical psychologists, trainees and non-psychologists.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameWayne PanouJob titleClinical Nurse ManagerEmail addresswayne.panou@nhs.netTelephone number02073617940&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Collingham Child and Family Centre, Kensington", "postalCode": "W8 5LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4967", "longitude": "-.191559"}}, "title": "Inpatient Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237567", "validThrough": "2020-11-12T23:59:59+0000"}