{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pr"}}, "datePosted": "2020-11-06T13:17:09+0000", "description": "&lt;p&gt;&lt;span&gt;Acting Deputy Sister/Charge Nurse&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for an experienced registered nurse to join the AMU, providing rapid assessment for acutely unwell patients as an acting role to cover maternity leave.&lt;/p&gt;\n&lt;p&gt;The Acute Medical Unit is a 30 bedded unit that receives patients directly from GP’s and Emergency Department. We can see around 1400 admissions per month so we have a high turnover of patients. We ensure all emergency admission patients receive seamless, high quality care at the point of admission. The AMU is a fast paced admissions unit and we see a variety of specialties including Cardiology, mental health, Gastroenterolgy, Respiratory.&lt;br /&gt;&lt;br /&gt;We seek to appoint a Acting Deputy Sister/Charge Nurse to join our busy, friendly team. You will be committed to the provision of high quality patient care, be an experienced Band 5 with evidence of related continuing professional development and contribution to quality of care work.&lt;/p&gt;\n&lt;p&gt;We offer lots of exciting opportunities and courses for further professional development and to advance your clinical knowledge and clinical skills within Acute Medicine.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;If you are highly motivated, and feel you can make a real difference to the quality of patient care delivery, then we would be very keen to hear from you. &lt;br /&gt;&lt;br /&gt;Additional skills and abilities should include:&lt;br /&gt;• Co-ordination of the AMU to ensure seamless flow. Also a team to ensure the delivery of skilled and effective nursing care to patients and their families reflecting the Poole Approach.&lt;br /&gt;• Understanding of, and commitment to, ways in which quality of care can be improved and monitored&lt;br /&gt;• Ability to deputise for the Ward Manager as and when required.&lt;br /&gt;• Assessment of care needs and the development, implementation and evaluation of programmes of care without supervision.&lt;br /&gt;• Provision of clinical and managerial leadership to nursing and support staff.&lt;br /&gt;• Ability to support Ward Manager in leading, monitoring and appraising the performance and work of the Nursing Team.&lt;/li&gt;\n&lt;li&gt;If HAPE assessed would be expected to rotate into our nurse-led DVT clinic.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will need to demonstrate excellent inter-personal and organisational skills, a willingness to be flexible with shift patterns, and a drive to promote a high standard of care for our patients.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: 22/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date: 03/12/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sister&#39;s Maria Griu-Tudose or Emma Bell on 0300 019 2056.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "University Hospitals Dorset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole Hospital, Poole, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Deputy Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259880", "validThrough": "2020-11-22T23:59:59+0000"}