{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-29T13:46:43+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a full-time motivated Band 5 Staff Nurse to work within our brand-new state of the art cataract theatre suite that is due to open late 2020 / early 2021 at The Royal Shrewsbury Hospital.&lt;/p&gt;\n&lt;p&gt;Currently the service is operating from the Wrekin Community Centre, Telford until the new theatre suite is opened. Therefore the role may initially require working at this site for a short period of time.&lt;/p&gt;\n&lt;p&gt;The nursing team within the cataract suite consists of a friendly, dedicated team including a Band 6 Sister, Staff Nurses, Ophthalmic technicians and Ophthalmic assistants.&lt;/p&gt;\n&lt;p&gt;You will be primarily based within the theatre suite assisting the ophthalmic clinician to undertake cataract surgery under local anaesthetic. The role will include scrubbing, escorting, admission and discharge of theatre patients, testing visual acuity as well as any other diagnostic tests that may be necessary.&lt;/p&gt;\n&lt;p&gt;In addition to working within the theatre suite, there will also be the opportunity to rotate into ophthalmology outpatients in Royal Shrewsbury Hospital that deals with several ophthalmic sub-specialities, making this a diverse, exciting opportunity for the right applicant.&lt;/p&gt;\n&lt;p&gt;Experience within a theatre setting would be extremely desirable, but training would be given for the right applicant who has the desire to make a difference and endeavour to maintain a high standard of care for our patients.&lt;/p&gt;\n&lt;p&gt;Ongoing support will be offered &amp; there will be a training package in place.&lt;/p&gt;\n&lt;p&gt;The permanent post offered is for 37.5 hours per week, working for four variable days Monday – Friday. Some weekend working may be necessary depending on the demands &amp; needs of the ophthalmic service.&lt;/p&gt;\n&lt;p&gt;Suitable newly qualified staff will be considered.&lt;/p&gt;\n&lt;p&gt;If you are interested in joining our team, why not pop along and see us, we would be happy to welcome you and answer any questions you may have.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Vicky Howells&lt;/p&gt;\n&lt;p&gt;Job title: Department Manager&lt;/p&gt;\n&lt;p&gt;Email address: vicky.howells@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01743 261000 extension 3209&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Emma Barber - Matron&lt;/p&gt;\n&lt;p&gt;01743 261000 extension 2531&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Telford", "postalCode": "TF3 4LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6814", "longitude": "-2.43794"}}, "title": "Staff Nurse - ICAT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248556", "validThrough": "2020-11-12T23:59:59+0000"}