{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 pa + enhancements"}}, "datePosted": "2020-11-04T13:55:37+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title: &lt;/strong&gt;Royal Surrey/Royal Marsden Joint Fellowship in Anaesthesia for Cancer Surgery, combining Oesophagogastric, Hepatobiliary &amp; Colorectal Surgery - suitable for ST 5, 6, 7 or post-CCT equivalent wishing to gain further experience in high risk anaesthesia.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Short Induction/ About the Department&lt;/strong&gt;&lt;strong&gt;                     &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A one-year clinical fellow post is available. This post will start at the Marsden Hospital for six months from Aug 2021 - Feb 2022 before rotating to the Royal Surrey NHS Foundation Trust for the second six months Feb 2022-Aug 2022 as part of a joint 12-month fellowship programme with the Royal Marsden Hospital.  The Royal Surrey is the regional oncological surgical hospital for much of Surrey and Sussex. Many of the highly specialized oncological surgical specialties are now established here and include oesophagogastric, hepatobiliary, laparoscopic gastrointestinal, urological, gynaecological, head and neck and maxillo facial oncology. The development of these surgical specialties has been associated with exciting opportunities for anaesthetists to gain extra exposure to the above areas.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Responsibilities/ about the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will focus on three major areas of interest:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Oesophagogastric surgery: The Royal Surrey is the regional centre for the SWSH cancer network, and is also the tertiary referral centre for complex benign and emergency oesophagogastric surgery. Approximately 75 oesophago-gastrectomies and 35 gastrectomies are performed per annum, with mortality and morbidity figures amongst the lowest in the country. A significant number of patients are also referred to the hospital for the management with oesophageal rupture. Thoracic epidural, invasive cardio vascular monitoring and goal directed therapy using either an oesophageal Doppler or Lidco Rapid system are routinely used.&lt;/li&gt;\n&lt;li&gt;Hepatobiliary surgery: The Royal Surrey is the regional centre and performing approximately 110 major liver resections and 60 Whipple’s. A significant number of patients are referred to the hospital for the management of complex pancreatitis, including both minimally invasive and open pancreatic necrosectomies. Again extensive use of neuro axial blockade and invasive cardiovascular monitoring with goal directed therapy is used.&lt;/li&gt;\n&lt;li&gt;Research: The department hosts the Surrey Perioperative, Anaesthetic &amp; Critical Care Collaborative Research Group (SPACeR Group), which has good links with various departments at the University of Surrey. The department is a site for multi-centre portfolio trials such as PRISM, PREVENTT, OPTIMISE, ENIGMA-2, LAS VEGAS, ETPOS &amp; DREAMS &amp; took part in the EUSOS study. There will also be opportunities to gain experience in CPET. Audit and original research are strongly encouraged by the members of the team. Previous post-holders have undertaken a RCT looking at the effect of introducing an enhanced recovery programme, combined with goal directed fluid therapy, for liver resections &amp; a multi-centre trial looking at implementing a quality improvement bundle for emergency laparotomies, the ELPQuIC Trial. Our fellows have had their work recognized for MDs under the supervision of the Postgraduate Medical School, University of Surrey. Also, surgical fellows looking at the effectiveness of goal directed therapy, the optimum use of regional blockade and the implementation of a rapid recovery pathway have carried out several large studies. Members of the team have hosted several seminars (including AAGBI) on advanced recovery in laparoscopic surgery and are involved in formulating national guidelines under the auspices of the Department of Health.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Skills/ Person Specification:&lt;/strong&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is suitable for ST 5, 6, 7 or post CCT equivalent wishing to gain further experience in high risk anaesthesia.  FRCA Fellowship of Royal College of Anaesthetists (GB) or equivalent higher specialist qualifications in anaesthetics are essential.  Evidence of ALS/other life support training is essential with it being desirable that candidates have and previous evidence of instructor status for ALS/ other life support training.  Experience in advanced airway projects desirable.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contact Details:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Candidates are encouraged to make arrangements to visit the department and contact Dr Leigh Kelliher, Consultant Anaesthetist and Lead Clinical Supervisor for RSFT Anaesthetic Fellowships on 01483 464116 or lkelliher@nhs.net  &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Royal Surrey/Royal Marsden Joint Fellowship in Anaesthesia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256090", "validThrough": "2020-11-18T23:59:59+0000"}