{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16810", "minValue": "16810", "unitText": "YEAR", "value": "10 PA Locum Consultant"}}, "datePosted": "2020-11-05T09:01:03+0000", "description": "&lt;p&gt;We require a Locum Consultant Thoracic Surgeon to join the Thoracic Surgery team, comprising of one Thoracic and three Consultant Cardiothoracic surgery colleagues. This will create a 1:5 on call rota, supported by 9 intermediate staff and 4 junior posts.&lt;/p&gt;\n&lt;p&gt;The Trust provides tertiary Cardiothoracic services for 1.6 million people of Lancashire and South Cumbria. The Trust executive team and divisional board are committed to supporting Thoracic Services and this new appointment is seen as an integral part of this support.&lt;/p&gt;\n&lt;p&gt;The department of Cardiothoracic Surgery provides services for adult patients throughout the NW region. The Lancashire Cardiac Centre was commissioned in July 2006 and is one of our four regional centres for Cardiothoracic surgery. It houses catheter labs, four operating rooms and 20 critical care beds, together with associated ward beds and dedicated educational and research facilities. A CT scanner has been sited within the wing recently.&lt;/p&gt;\n&lt;p&gt;Thoracic surgical services are provided through and MDT network of four regional district general hospitals. Approximately 600 cases are performed a year with 180 resections for lung cancer. A lung cancer screening programme targeting our two highest incidence areas will increase this by an estimated 50 cases annually. The department offers VATS procedures, endobronchial interventions, and chest wall surgery and is commencing a laser programme.&lt;/p&gt;\n&lt;p&gt;Applicants must be fully registered with the GMC, have FRCS or equivalent and be on the Specialist Register or be within 6 months of CCST.&lt;/p&gt;\n&lt;p&gt;Blackpool is a vibrant seaside holiday destination for around 16 million visitors a year and is surrounded by beautiful countryside, rural villages and market towns and has rapid access to the main motorway network. It is less than an hour’s drive to the highly acclaimed and beautiful lake district and Beacon Fell national parks, Manchester airport is within an hour’s drive with international connections. There are good rail connections through the nearby West Coast mainline.&lt;/p&gt;\n&lt;p&gt;The hospital itself has undergone significant investment in capital developments recently, including a new surgical wind, refurbishment of the women’s and children’s wing, a brand new multi storey carpark and main entrance completed in 2014.&lt;/p&gt;\n&lt;p&gt;If you are interested in having an informal introduction with the consultants, this can be arranged via Microsoft Teams/Skype upon request.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr. Amal BoseJob titleConsultant Cardiothoracic Surgeon and Head of DepartmentEmail addressamal.bose@nhs.netTelephone number01253 957853&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Locum Consultant Thoracic Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256976", "validThrough": "2020-11-26T23:59:59+0000"}