{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T09:46:28+0000", "description": "&lt;p&gt;&lt;span&gt;NHSX is leading the largest digital health and social care transformation programme in the world and has been created to give staff and citizens the technology they need. We are a joint unit made up of colleagues in the Department of Health and Social Care (DHSC) and NHS England and Improvement (NHSE/I). NHSX aims to create the most advanced health and care service in the world to diagnose diseases earlier, free up staff time and empower patients to take greater control of their own healthcare. With investment of more than £1 billion pounds a year nationally and a significant additional spend locally, we need the right people in our team to help us get the technology right for staff and citizens.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Join our team and you will be helping to deliver against our five missions;&lt;/span&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;&lt;span&gt;Reducing the burden on clinicians and staff, so they can focus on patients;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Giving people the tools to access information and services directly;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Ensuring clinical information can be safely accessed, wherever it is needed;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Improving patient safety across the NHS; and&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Improving NHS productivity with digital technology&lt;/span&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;span&gt;You will be joining us during an exciting time as we continue our journey both in leading the digital transformation programme, and in becoming an excellent place to work with a diverse, inclusive, compassionate workforce, which supports all our colleagues to achieve their potential. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more about what we do see our website.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Role&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is the perfect role for an organised, enthusiastic individual with a “can do” attitude who is keen to develop themselves personally and professionally. The successful candidate will be expected to provide comprehensive and high quality daily administrative support to the Director of Delivery, Assurance &amp; Operations and the wider DAO directorate. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role will be a six month fixed term contract up until 30 April 2021. Please note that the reason for the fixed term of your contract is to cover an internal secondment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In particular the post holder will: &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Provide effective diary management; organising and planning meetings/events as directed, including sending invitations, booking venues, making travel arrangements, arranging speakers and providing relevant papers and materials - proactively managing diary clashes and planning the diary in advance&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Handle travel and accommodation bookings, providing information and copies of documentation as required&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Acting as a key point of contact for internal and external stakeholders on behalf on the Director of Delivery, Assurance &amp; Operations&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Coordinate numerous diaries and liaise with other support staff/Diary Managers to build up credible working relationships&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Support team members within the wider DAO Private Office&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Have excellent communication skills and be comfortable in proactively making contact with a range of stakeholders and be adept at building close working relationships&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Exceptional attention to detail, comfortable in taking their own initiative and developing an autonomous working relationship with their Director&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Have a collaborative, team working and flexible approach&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;This vacancy may close earlier subject to the volume of applications received. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Carly Fothergill; carly.fothergill@nhsx.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Quarry House, Leeds", "postalCode": "LS2 7UA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Business Support- NHSX", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253321", "validThrough": "2020-11-17T23:59:59+0000"}