{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-30T12:45:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Do you wish to be a part of a team striving to make a difference in our community? Are you looking for a new challenge? Do you want to make a difference in patient care?&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;We are looking for Band 5 Community Nurses to work within our Neighbourhood Teams based in Cambridge.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;span&gt;The following Neighbourhood Teams are currently recruiting:&lt;/span&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Cambridge East - Sawston Medical Centre&lt;/li&gt;\n&lt;li&gt;Cambridge North Villages – Histon Police Station&lt;/li&gt;\n&lt;li&gt;Cambridge North City – Signet Court&lt;/li&gt;\n&lt;li&gt;Cambridge City South&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The permanent posts are eligible for a £1500 New Hire Bonus. An initial payment of £500 will be paid in the first 6 months and a final payment of £1000 will be paid 1 year after your start date. This will be pro-rata for part-time posts.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) provides integrated community health services. We aim to support people of all ages to achieve the very best they can for their health and well being. To ensure that we achieve this goal we are looking for skilled people who share our passion for delivering an excellent service and standard of care.&lt;/p&gt;\n&lt;p&gt;In these roles, you would be working at part of the Neighbourhood team which includes District Nurses, Community Nurses (RN), Community Matron, Physiotherapists, Occupational Therapists, Mental Health Nurses and Team coordinators. You will link closely with colleagues including general practitioners and other members of the multidisciplinary team to support excellent nursing care at home, reducing the necessity for acute hospital admission.&lt;/p&gt;\n&lt;p&gt;We welcome applications from those with current community nursing skills, newly qualified Nurses, Return to Practice Nurses and Registered Nurses wanting to develop these skills further and join our highly motivated and innovating service.&lt;/p&gt;\n&lt;p&gt;We are keen to support and develop our employees, allowing for career progression in encouraging promotional opportunities within the Trust. This includes the ability to develop and enhance clinical community skills such as wound management, palliative/end of life care, discharge support, diabetes management, catheter management and those living with long-term conditions at home. We offer a supportive preceptorship program for those newly qualified alongside an in-depth Clinical and trust induction for all employees.&lt;/p&gt;\n&lt;p&gt;For part-time posts - salary will be pro-rata.&lt;/p&gt;\n&lt;p&gt;We are looking for people who:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have experience of working in the Community&lt;/li&gt;\n&lt;li&gt;Are educated to RGN level 2&lt;/li&gt;\n&lt;li&gt;Are able to demonstrate a commitment to high quality care and service provision&lt;/li&gt;\n&lt;li&gt;Have the ability to work flexibly and as part of a team&lt;/li&gt;\n&lt;li&gt;Have the ability to assess and formulate care plans&lt;/li&gt;\n&lt;li&gt;Are able to teach and support student Nurses and Health Care Assistants&lt;/li&gt;\n&lt;li&gt;Have enhanced communication and inter personal skills&lt;/li&gt;\n&lt;li&gt;You will be responsible for:&lt;/li&gt;\n&lt;li&gt;Keeping the patient at the centre of care, ensuring patient and carer participation in decision making&lt;/li&gt;\n&lt;li&gt;Providing a high standard of care&lt;/li&gt;\n&lt;li&gt;Providing a high standard of nursing intervention within a patient&#39;s own home, with access to Specialist and Advanced Practitioners when required&lt;/li&gt;\n&lt;li&gt;Working as part of a 24/7 service and multidisciplinary team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If this sounds like the role for you then please apply!&lt;/p&gt;\n&lt;p&gt;The positions available for the successful candidates will be required to be flexible to work within any of the Cambridge and South Cambs Area Neighbourhood teams with the ability to travel to a variety of locations.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please specify in your application form which Neighborhood Team you are applying for from the list above if you have a preference.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Debbie Nikolova - Area Nursing Manager – Cambridge East and South City deborah.nikolova@cpft.nhs.uk – 07983344081&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Or&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nicola Zolnhofer - Area Nursing Manager – Cambridge North - Nicola.zolnhofer@cpft.nhs.uk - 07964345652&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge", "postalCode": "CB22 3HU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1152", "longitude": ".169102"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250244", "validThrough": "2020-11-15T23:59:59+0000"}