{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-30T16:19:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Head of Echocardiography &amp; Deputy Manager - Band 8a&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Birmingham Children’s Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post is based at our city centre children’s hospital, a leading UK specialist paediatric centre, offering expert care to 90,000 children and young people from across the country every year. Rated as ‘Outstanding’ by the CQC in February 2017, we are a world leader in some of the most advanced treatments, complex surgical procedures and cutting-edge research and development.&lt;/p&gt;\n&lt;p&gt;If you are ambitious, brave and compassionate we are excited to be able to offer the opportunity for you to join our team in our Heart Investigations Unit as our Head of Echo Service &amp; Deputy Manager.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Heart Investigations Unit currently provides a full range of cardiac investigations for outpatients, cardiac and non-cardiac inpatients and critical care patients. The successful candidate will take an active leadership role in HIU.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will demonstrate a passion for cardiac imaging with the relevant qualifications, clinical skills and accreditation (BSE/EACVI) to support our existing service. Registered Clinical Scientist status would be an advantage. Crucially, you will possess a track record in effective leadership within a healthcare setting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a new post and as such requires someone who is very self-motivated and has the skills, vision and ambition to drive our services forward.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for someone who can help us to grow, improve and quality assure our Echo service so that we can continue to be proud of the care we deliver while ensuring that our multidisciplinary team, our patients and their families have a service that they trust.&lt;/p&gt;\n&lt;p&gt;In terms of professional relationships you will lead and manage a small but experienced team of Echocardiographers. Your excellent communication and organisational skills will be crucial in motivating the team in continuous service improvement.&lt;/p&gt;\n&lt;p&gt;A good understanding of and the ability to implement a robust quality assurance program across our echo services is required.&lt;/p&gt;\n&lt;p&gt;We have ambitions to grow our workforce as well as the scope of our clinical practice.&lt;/p&gt;\n&lt;p&gt;As the leader of this team you would play a key role in recruitment, training and development and demonstrate a passionate for education.&lt;/p&gt;\n&lt;p&gt;Our ultimate goal is to achieve recognised departmental accreditation – You will be instrumental in leading our team to achieve this.&lt;/p&gt;\n&lt;p&gt;You will work amongst some of the leading specialists in congenital heart disease, inherited cardiac conditions and cardiac imaging. We have strong clinical input and support and you will have the ability to work with our medical colleagues to shape a service that meets their needs.&lt;/p&gt;\n&lt;p&gt;We have a well-equipped echo department and you will ensure that we are using the available technologies to their best advantage.&lt;/p&gt;\n&lt;p&gt;As a department we have links with an active research department as well as a wealth of access to clinical experience and data. You will have a passion for scientific research and use this along with the resources available to you to help shape the future direction of our patients care.&lt;/p&gt;\n&lt;p&gt;You will understand the unique nature of the services we provide and the challenges that go alongside this.&lt;/p&gt;\n&lt;p&gt;You will also work closely with the HIU department manager and deputise where necessary.&lt;/p&gt;\n&lt;p&gt;Our work in paediatric cardiac services is uniquely rewarding and varied.&lt;/p&gt;\n&lt;p&gt;Opportunities for personal development will be supported. We actively encourage continuous professional development with staff regularly attending both national and international courses and conferences.&lt;/p&gt;\n&lt;p&gt;There is scope to develop personal interests in advanced areas of echocardiography and potential to develop links within the paediatric/ACHD network.&lt;/p&gt;\n&lt;p&gt;If you feel you have the motivation, experience and passion to make a success of this role then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;Candidates are encouraged to arrange a visit to the department to find out more about what we can offer.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit to the HIU department, please contact Mr Krishnakumar Pillai, Professional Lead on 0121 333 9432. Email: krishna.kumar@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham Children&#39;s Hospital", "postalCode": "B4 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4852", "longitude": "-1.89446"}}, "title": "Head of Echo Service &amp; Deputy Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250933", "validThrough": "2020-11-30T23:59:59+0000"}