{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-26T08:45:19+0000", "description": "&lt;p&gt;Applications are invited for the post of Consultant Anesthetist with a Specialist Interest in Intensive Care Medicine from those who are on the Specialty Register or within 6 months of being eligible for entry onto the Register. Joint/Dual CCT for Anaesthetics and ICM is desirable but not essential. However, in addition to a CCT in Anaesthetics, a proven track record of interest and dedication to the subspecialty of Intensive Care Medicine is essential.&lt;br /&gt;&lt;br /&gt;The post is being advertised replace an outgoing colleague and to support the ongoing development of our recently opened 16 bedded Unit. The Unit was designed in house and forms part of the newly built Foundation Wing. It offers a spacious and well lit environment with excellent ergonomics to ensure an optimal experience for both patients and staff. The Unit functions as a combined ITU and HDU for both medical and surgical specialties and currently operates to a maximum dependency of 10 level 3 patients, with the intention of gradually increasing capacity over the coming years. Specifically, we intend to improve medical input to outreach, post ITU rehabilitation and medical education. The unit currently sees around 700 admissions per year, of which the majority are ITU level patients. The unit also hosts the haemodialysis service for the trust, using two of the beds located within the Unit. The Unit also serves as the first response for paediatric emergencies although ventilated paediatric cases will always be transferred to the regional centre. The paediatric department also has a two bedded paediatric HDU and a neonatal ITU, although these are managed by paediatrics. There is a ward based NIV service run by the respiratory physicians and an obstetric HDU run jointly by Obstetrics and Anaesthesia on site.&lt;br /&gt;&lt;br /&gt;The Unit has been an active participant in the ICNARC Case Mix Programme and has achieved very consistent results with regard to key quality indicators such as SMR for many years. Our current SMR sits at .96, broadly reflecting the figures we have obtained historically.&lt;br /&gt;&lt;br /&gt;The post holder will join the team consisting of 8 full time consultants who will provide daytime consultant cover and out of hours on-call service for ITU, supporting all disciplines within the trust including Accident and Emergency and Acute Cardiology. Other DCC activities include theatre sessions in general surgery, orthopaedics, ENT, Ophthalmics, maxillo-facial, plastics and urology.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Phil WattAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Phil Watt on 01536 492746&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120843.png", "name": "Kettering General Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120843"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hospital, Kettering General Hospital", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Consultant Anaesthetist with Special Interest in Intensive Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241777", "validThrough": "2020-11-26T23:59:59+0000"}