{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50400", "minValue": "50400", "unitText": "YEAR", "value": "Up to £50,400 Depending on Experience"}}, "datePosted": "2020-11-05T16:31:03+0000", "description": "&lt;p&gt;The Viapath Genetics Laboratories at Guy’s Hospital seek to employ a state-registered Clinical Scientist in Clinical Bioinformatics (Genomics) to join the Genome Informatics team&lt;/p&gt;\n&lt;p&gt;The Viapath Genetics Laboratories are the hub laboratory for the London South GLH, part of the new NHS Genomic Medicine Service. The successful candidate will develop and maintain data pipelines and software applications, with an emphasis on cloud-based, containerised clinical-grade software.&lt;/p&gt;\n&lt;p&gt;The role will support provision of the full and expansive diagnostic testing repertoire performed at the Genetics Laboratories, which serves a population of ~6 million people in collaboration with the Guy’s Genetics Clinic, and which includes preimplantation genetic diagnosis, prenatal diagnosis, single gene disease, copy number variation and whole exome and genome sequencing for rare disease and cancer.&lt;/p&gt;\n&lt;p&gt;Your development and learning:&lt;/p&gt;\n&lt;p&gt;The department is accredited to host a HSST trainee, and has submitted an application for a HSST post starting September 2021.&lt;/p&gt;\n&lt;p&gt;You will have a suite of learning opportunities available through the Scientific Learning and Development Fund and the ViAcademy through which you can receive funding for advanced qualifications.&lt;/p&gt;\n&lt;p&gt;Through our Innovation Fund, you can apply for finance to get that new innovative scientific project off the ground, and participate with the wider scientific community through symposiums, conferences and other peer group meetings.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; A little about the lab and us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Guy’s and St Thomas’ Hospital Foundation Trust is a major emergency and specialist teaching Trust which has all the specialties associated with a fascinating and career defining case load including: Women’s Services, Fetal Medicine, Haematology, Oncology, Transplantation, and is also home to the Evelina Children’s Hospital and the newly opened Cancer Centre on the Guy’s site.&lt;/p&gt;\n&lt;p&gt;You will be close to the vibrant Borough Market and the South Bank, which are exceptional London locations; perfect places to work and relax next to such iconic venues as Big Ben, The London Eye and The Shard!&lt;/p&gt;\n&lt;p&gt;To learn more about this opening, please see contact details below or simply apply through the application process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Aled Jones&lt;/p&gt;\n&lt;p&gt;Job title: Deputy Ops Lead Clinical Bioinformatics&lt;/p&gt;\n&lt;p&gt;Email address: aledjones@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Viapath Analytics LLP", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131534"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy’s Hospital, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Clinical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258568", "validThrough": "2020-11-19T23:59:59+0000"}