{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-27T09:45:51+0000", "description": "&lt;p&gt;Ever wanted to experience what it’s like working in a PICU?&lt;br /&gt;&lt;br /&gt;Are you a nurse looking for a new leadership opportunity? Would you like to work within the leader-leader model on a ward who won team of the year 2019 for NAPICU?&lt;/p&gt;\n&lt;p&gt;Amber Ward is looking for a charge nurse to join its motivated and dynamic team. Amber ward have gone through a remarkable journey the past 18 months and we are continuing to strive for more success. We want you to be a part of this!&lt;/p&gt;\n&lt;p&gt;We believe that staff who feel valued by their employers and are truly engaged, provide a better outcome for our service leaders. Amber Ward will also provide the opportunity to not only enhance ones knowledge of the PICU pathway but also works alongside forensic services and the Police for our 136 place of safety.&lt;br /&gt;&lt;br /&gt;We are a 12 bedded ward based within Langley Green Hospital in Crawley. Crawley is situated closely to London and Brighton and benefits from a thriving, vibrant and diverse community. Amber Ward has an experienced team and works collaboratively with other wards and services within the hospital and the wider community. &lt;br /&gt;&lt;br /&gt;In your application we would love to know what attributes you would bring to our team and we love to hear about what drives the nurses of today. Should you be successful for this post you would gain valuable experience in a unique mental health setting. We are committed to investing in our staff in order to provide you with further training and development to enhance those leadership skills.&lt;/p&gt;\n&lt;p&gt;This post offers a Golden Hello, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;If you want to work somewhere where your ideas are heard and your development supported- please apply and/or contact us. We welcome you to arrange a visit to Langley Green Hospital alongside your application or even give us a follow on our Twitter page: @LGH_AmberPICU&lt;/p&gt;\n&lt;p&gt;We will support you and invest in you- don&#39;t miss this exciting opportunity!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;br /&gt;&lt;br /&gt;Hinal Chudasama&lt;br /&gt;Amber- Ward Manager&lt;br /&gt;&lt;br /&gt;01293 590 431&lt;br /&gt;07552 277 498&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Langley Green Hospital, Crawley", "postalCode": "RH11 7EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1315", "longitude": "-.188818"}}, "title": "Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243877", "validThrough": "2020-11-10T23:59:59+0000"}