{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "BANK"}}, "datePosted": "2020-10-27T16:34:43+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;BANK Advanced Nurse Practitioner&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Location: Church Lane Surgery, Braintree&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you looking for flexible NHS bank opportunities to fit around your lifestyle? Do you want to decide when and where you work, and where currently 94% of those using our services would recommend us to care for their friend or family? If so, this could be the place for you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Bank Advanced Nurse Practitioner, you’ll be working as part of the NHS and Local Authority system.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As well as the attractive hourly rates of pay and out of hours’ enhancements, you’ll benefit from:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;span&gt;Working in an environment focused on the highest clinical and quality standards with 91% of our services being rated overallgoodby the CQC&lt;/span&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;span&gt;Flexible hours either full time or part time, allowing you to achieve the bestwork / life balance&lt;/span&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;span&gt;Opportunities to work in different areas and various different services to gain new knowledge and experience&lt;/span&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;span&gt;Access to our Strive for Better networks, a national support and professional network made up of NHS professionals like you, giving you the chance toconstantly develop industry-leading care and quality&lt;/span&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;span&gt;Free statutory and mandatory training, as well as access to a range of courses and e-learning to develop further skills,continuing your professional development&lt;/span&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;span&gt;Access to our free well-being service available 24/7/365 online and by telephone including; counsellors, post trauma incident support, legal, debt and practical life management helpline, guided self-help, telephonic career coaching and monthly well-being newsletter&lt;/span&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;span&gt;Access to NHS discount and access to information on permanent vacancies etc as well as extras such as free hot and cold drinks&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At our service you will be the face of our patient&#39;s journey. Your days will be varied and will include working with practice nursing team to provide high quality and evidence based nursing for patients including the achievement of the Quality and outcome framework and other key performance indicators.&lt;/p&gt;\n&lt;p&gt;“Here at Virgin Care, colleague recognition is important to us and we know that across our services there are colleagues who deserve acknowledgment for their commitment for going above and beyond to ensure that their colleagues and service users feel the difference.”&lt;/p&gt;\n&lt;p&gt;As a Bank Advanced Nurse Practitioner you will be working within the nursing and GP teams, you will work with service manager and clinical lead to deliver a robust clinical service.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We partner with the NHS and Local Authorities to deliver services which make a positive difference to the people working in them and relying on them. We don’t run private clinics, and Richard Branson has confirmed that if and when we make a profit in the future, he’ll re-invest it back into those services. In fact, we’ve never made a profit from publicly funded services and Virgin Group has invested £60m of additional funding which has helped ensure we can deliver high quality, sustainable and modern services and support the communities we serve.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If you are an Advanced Nurse Practitioner who has proven experience in primary care, you are NMC registered, hold a prescribing qualification and you are working towards or hold an Msc in Advanced Practice.&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or request the full job description, please contact Samantha Hamilton our Recruitment Advisor via email: Samantha.Hamilton@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Braintree", "postalCode": "CM7 5SN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8901", "longitude": ".558087"}}, "title": "Bank Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245442", "validThrough": "2020-11-10T23:59:59+0000"}