{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum plus HCAS"}}, "datePosted": "2020-10-28T11:18:06+0000", "description": "&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Are you an enthusiastic leader with a passion for excellent mental health service provision?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Can you plan and deliver integrated community mental health systems?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Would you like to manage Community Recovery Service at a time when the Trust is to set to receive &lt;/em&gt;&lt;em&gt;significant new investment to support the delivery of &lt;/em&gt;&lt;em&gt;best care to our service users?&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is an exciting opportunity to lead and develop two dynamic multi-disciplinary Community Recovery Teams and an Early Intervention in Psychosis Team, within the London Borough of Redbridge.&lt;/p&gt;\n&lt;p&gt;The person appointed will work very closely with the Assistant Integrated Care Director and deputise for this post when required, leading on the delivery of first class recovery orientated models of care to people with severe mental health problems.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be responsible for the overall management of the services, supervising the seniors within the teams, ensuring services are compliant with CQC standards, targets and spend, in line with the financial envelope. In addition the manager will have responsibility for monitoring key performance indicators, organising and managing recruitment and retention of staff and liaising with human resources to manage any performance or staffing issues.&lt;/p&gt;\n&lt;p&gt;The Community Services Manager will ensure the Trust maintains high standards of care planning and risk assessments of people who use the service and helps support the work of the Local Authority and other key stakeholders.&lt;/p&gt;\n&lt;p&gt;You will ensure the services are aware of local resources and be key to ensuring patient flows are effective to support admission avoidance and early supportive discharges.&lt;/p&gt;\n&lt;p&gt;You will be expected to oversee referrals meetings, zoning meetings, business meeting and implement governance structures and communication flows across the organisation and wider care community. Further supporting improvement and service development in line with the quality initiative framework.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, positive, motivated and highly committed individual who can work with us to support the work of these services. We encourage applicants who are keen to develop their skills in supporting and developing services and who enjoy working autonomously and with a ‘Quality Improvement’ mind-set. This post is open to both health and social care who registered with either Social Work England, HCPC or NMC. It is essential you have substantive experience of management within a mental health services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mellmead House, Wanstead, London", "postalCode": "E11 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5838", "longitude": ".028749"}}, "title": "Community Recovery Services Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246295", "validThrough": "2020-11-16T23:59:59+0000"}