{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum, pro rata"}}, "datePosted": "2020-11-05T13:16:20+0000", "description": "&lt;p&gt;#teamED are seeking a dynamic Unit Manger with a passion for emergency and trauma care, who’s looking for the real life 24 hours in A&amp;E!&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Lancashire Teaching Hospitals Trust is one of the biggest trusts in the North West.&lt;br /&gt;We are the regions provider of cancer services, neurosciences, mobility and rehabilitation, renal, vascular, plastics and of course the Major Trauma Centre for the Lancashire and South Cumbria Major Trauma Network.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;An opportunity has arisen for an experienced Emergency Department nurse to join our devoted team. You will work closely with the Matron and Clinical Educator to lead the team, ensure quality care is delivered and continually improve our service. &lt;br /&gt;We are a busy directorate seeing approximately 121,309 patients per year across the two sites, 27,360 of who were children. Last year over 700 major trauma patients were cared for at the Royal Preston site.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Our team consists of 19 consultants, 7 advanced nurse clinicians, a team of emergency nurse practitioners, experienced emergency nurses, trauma technicians and health care assistants.&lt;br /&gt;We are a forward thinking department who put the patient at the centre of our care. We believe that supporting our staff to grow and develop creates a great place to work and enables us to provide excellent care with compassion. You will assist with fostering this culture and supporting our staff and service flourish.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;#teamED values the personal skills, experiences and qualities that individuals bring to our department, creating a diverse and knowledgeable team who feel motivated and able to influence the future direction of our service.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;So, if you have experience of working in emergency care and are keen to further your career within emergency medicine then Lancashire Teaching Hospitals and #teamED is for you.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Informal enquiries&lt;br /&gt;Lynn Sime (Matron) lynn.sime@lthtr.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview date: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLynn SimeJob titleMatronEmail addresslynn.sime@lthtr.nhs.ukTelephone number07112 522877&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Unit Manager - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257834", "validThrough": "2020-11-19T23:59:59+0000"}