{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T16:01:43+0000", "description": "&lt;p&gt;The Let&#39;s Talk Wellbeing services within Leicester City and Leicestershire and Rutland provide Improving Access to Psychological Therapy (IAPT) services to the population across Leicestershire and Leicester City.&lt;/p&gt;\n&lt;p&gt;We have exciting opportunities for a number of qualified Psychological Wellbeing Practitioners to join our highly successful IAPT Let&#39;s Talk Wellbeing therapy services within Leicester City and Leicestershire and Rutland.&lt;/p&gt;\n&lt;p&gt;Psychological Wellbeing Practitioners provide high volume, low intensity, Step 2 interventions to patients who present with mild to moderate anxiety and depression.&lt;/p&gt;\n&lt;p&gt;You will provide initial assessments to patients accessing our services following referral. Candidates will also provide a range of Step 2 Cognitive Behavioural Therapy based interventions through various methods of delivery including telephone, groups, video, face to face and email. You will work under the supervision and direction of the Senior Psychological Wellbeing Practitioners.&lt;/p&gt;\n&lt;p&gt;Applicants should be qualified Psychological Wellbeing practitioners who have experience in working in a primary care mental health setting. Alternatively, we would welcome applications from Trainee Psychological Wellbeing Practitioners who are shortly due to qualify.&lt;/p&gt;\n&lt;p&gt;You will work with people from different cultural backgrounds and ages, using interpreters when necessary and should be committed to equal opportunities. We would particularly welcome applications from candidates who have experience/ interest in Long Term Conditions and integration of Mental Health.&lt;/p&gt;\n&lt;p&gt;The Leicester/ Leicestershire IAPT Services operate from bases within Beaumont Leys, Loughborough, Narborough, and Market Harborough and are supported by an administration team.&lt;/p&gt;\n&lt;p&gt;If you are enthusiastic and motivated to work in this exciting service and wish to discuss it further, you are welcome to contact us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jeanette Bevan - Senior Psychological Wellbeing Practitioner&lt;/p&gt;\n&lt;p&gt;Email address: Janette.Bevan@nottshc.nhs.uk / Telephone number: 0300 300 2200&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicestershire", "postalCode": "LE11 5RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7836", "longitude": "-1.22634"}}, "title": "Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258485", "validThrough": "2020-11-19T23:59:59+0000"}