{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inclusive"}}, "datePosted": "2020-10-30T10:17:08+0000", "description": "&lt;p&gt;Children’s services&lt;/p&gt;\n&lt;p&gt;Our busy Children’s Department covers two sites – Queens Hospital in Romford and King George’s Hospital in Ilford. We deliver a comprehensive range of general medical and surgical services to our local population and have two inpatient wards, one with a co-located 4 bedded HDU, a day unit with a POSCU and haematology service, two outpatients departments with a GP ‘hot clinic’, a team of Clinical Nurse Specialists and a Children’s Community Nursing team.&lt;/p&gt;\n&lt;p&gt;Our 32 cot level 2 NICU has community and outreach teams to support babies on discharge.&lt;/p&gt;\n&lt;p&gt;We have two ED’s for children, one on each site, and their combined attendances are among the busiest in the country with over 62,000 children’s attendances each year.&lt;/p&gt;\n&lt;p&gt;Our Children’s nursing team is expanding, and is led by our Director of Nursing for Child Health, a Trust wide role to ensure children and young people receive high quality care wherever they access services across our organisation.&lt;/p&gt;\n&lt;p&gt;When you come here you’ll always be learning; developing your knowledge and ensuring your skills are kept fully up to date. You will be supported by Clinical Nurse Educator, Advanced Neonatal Nurse Practitioners and Quality managers, together with a friendly multidisciplinary team and a corporate training and development team.&lt;/p&gt;\n&lt;p&gt;We have in house leadership programmes and work with a range of universities to ensure you can progress through academic pathways in order to support your career development.&lt;/p&gt;\n&lt;p&gt;We know it takes happy, motivated staff to produce patient satisfaction, so we’re investing in making our hospitals great places to work. It’s about living our values: Passion, Responsibility, Innovation, Drive and Empowerment – the PRIDE at the heart of all we do.&lt;/p&gt;\n&lt;p&gt;You’ll also be playing your part in preparing the NHS for the future. We’re proud to be one of only five Trusts in the country to secure a place on the ground-breaking Virginia Mason Institute Programme to transform patient care, and we’re also one of eight new, national Vanguard sites spearheading transformational change in urgent and emergency care.&lt;/p&gt;\n&lt;p&gt;Applications are then invited for a Band 5 – Hospital Play Specialist within The Child Health Department. The successful candidate must have excellent communication skills, an ability to work as part of the multi-disciplinary team offering a 7 day service and have a positive attitude to service developments. So if you are enthusiastic, dynamic and highly motivated Play Specialist who is committed, caring and compassionate come and join our fantastic team. Your professional development will be encouraged and supported.&lt;/p&gt;\n&lt;p&gt;For any informal enquires please contact Amy Taylor Interim Matron, on 01708 435000 ext. 6554 or email Amy.taylor42@nhs.net&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;br /&gt;&lt;br /&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Nadeem Arif, Recruitment Advisor, on 01708 435000 ext. 2289. Further details regarding the post may be obtained by contacting the manager as per the contact details above.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen&#39;s Hospital, Romford, Ilford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 5 Hospital Play Specialist-CYPAU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249694", "validThrough": "2020-11-13T23:59:59+0000"}