{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107000", "minValue": "100000", "unitText": "YEAR", "value": "£100,000 - £107,000 per annum"}}, "datePosted": "2020-10-20T11:26:55+0100", "description": "&lt;p&gt;&lt;span&gt;Surrey and Borders Partnership NHS Foundation Trust is one of the leading providers of mental health, learning disability and drug &amp; alcohol services for people of all ages in Southern England. We deliver high quality care across our 140 services, employing 2,600 staff across 39 sites, serving a population of 1.3 million. We have been recognised as ‘Good’ by CQC and have a strong reputation for innovation and partnership working. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As Director of Workforce, you will report to the Chief Executive as a key member of our senior leadership team, attending all Board meetings as a non-voting member. You will be supported by an experienced Deputy Director of Workforce and lead a team of 60 staff across our HR, Occupational Health and Nursery teams. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have an ambitious agenda for you. We have recently created a People Committee as a Sub-Committee of our Board and have just launched our new Strategic People Plan. You will provide the leadership to drive forwards this significant programme of work necessary to support our clinical, corporate and operational teams as we aim to move the quality of our services from CQC ‘Good’ to ‘Outstanding’. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As well as focusing within the Trust, you will play a key role externally, working closely with our NHS partners across the Frimley and Surrey Heartlands Integrated Care Systems to develop regional workforce initiatives and promote our services. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Key responsibilities include: &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Delivering our Strategic People Plan and helping to establish and develop the contribution from our new People Committee&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Supporting the Chief Executive with organisational development activity including developing compassionate leadership and high performing teams; enhanced selection and development processes; streamlined appraisals; and positive staff engagement mechanisms&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Promoting and developing equality, diversity and inclusion for all, creating a culture that encourages staff to speak up, and supporting those who whistle-blow.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Championing staff health and wellbeing, including leading our Occupational Health service&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Working closely with our Education Department to integrate the training and development of clinical and professional staff&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Contributing to the Trust’s annual plan, clinical strategy, quality improvement plan and growth aspirations.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Undertaking a significant external role, representing the Trust on several Boards and in other strategic partnerships across the regional NHS and wider healthcare systems.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;We are seeking an inspiring, collegiate, and compassionate leader with a broad background in HR, including experience of leading significant workforce programmes. You should have considerable recent experience as a senior manager or Director within a complex health or social care setting, or within an equivalent environment. You will need a track record of implementing transformational change within complex organisations, including service and workforce redesign. You will champion our aspiration to become a model employer, evolving a diverse and just climate which recognises and rewards achievement, challenges under performance and promotes a culture of kindness and respect.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For a recruitment pack with further information, please contact James Stephens at Morgan Law by emailing exec@morgan-law.com &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;Application for this post is made via NHS jobs where you will need to upload your CV which &lt;strong&gt;must&lt;/strong&gt; include a full Supporting Statement. Please create your CV and Supporting Statement as one document, with the CV at the front of the document. Your application will then be forwarded to Morgan Law who are longlisting this vacancy. In making this application, you are giving your consent to your details being shared with them to support our recruitment process.&lt;/em&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Closing Date for applications will be 11pm on Tuesday 10th November&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leatherhead", "postalCode": "KT22 7AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2976", "longitude": "-.335577"}}, "title": "Director of Workforce", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234122", "validThrough": "2020-11-10T23:59:59+0000"}