{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "VSM"}}, "datePosted": "2020-10-19T15:53:19+0100", "description": "&lt;p&gt;&lt;span&gt;We are on an exciting journey of improvement with a completely new Executive Team, significant investment being made in mental health and learning disability services and a new leadership structure aligned to our systems’ ICPs. We are committed to leading the integration of physical health, mental health, and social care services locally to deliver improved population health and tackle health inequalities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;With the full support of our Integrated Care System (ICS), we are now expanding our remit further with a Lead Provider Collaborative approach. The role of Chief Integration Officer is a critical and new Executive position on our Board and will establish our role as the lead provider for commissioning mental health and learning disability pathways across the region, working closely with our partners across the ICS and with NHS England/Improvement. This is a unique and broad leadership position central to our strategy with responsibilities for Partnerships, the Provider Collaborative, Integrated Commissioning, Population Health Management and Health Inequalities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking an ambitious and inclusive healthcare leader with Board level experience and wide system exposure. Thriving in a complex environment you will bring proven experience of delivering transformation in the commissioning and delivery of healthcare services through strong partnership working. An excellent communicator, you will be politically astute, quickly building credibility and trust at all levels of our system and be driven by patient-centred care with a leadership style that demonstrates our values ‘we are kind, respectful, always learning and a team’. This is an exceptional opportunity to join a new and dynamic Board and drive significant transformation in the delivery of services and outcomes across a significant and diverse geography. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To learn more about us, our ambitions, this exciting opportunity and how to apply, please see the attached How to Apply Document and not via NHS Jobs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more information please contact&lt;/span&gt;&lt;span&gt; &lt;strong&gt;Jim Canning, Emma Pickup or Michelle Shirley &lt;/strong&gt;of &lt;strong&gt;GatenbySanderson &lt;/strong&gt;on 07384 113 158 for an initial discussion. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Closing date: Monday 9 November&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Final interviews: Monday 14 December&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trust HQ, Preston", "postalCode": "PR5 6AW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7194", "longitude": "-2.63885"}}, "title": "Chief Integration Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233011", "validThrough": "2020-11-09T23:59:59+0000"}