{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 p.a inc HCA"}}, "datePosted": "2020-11-04T10:31:14+0000", "description": "&lt;p&gt;Evelina London Children’s Hospital is at the heart of a network of children’s health services across South East England, and the first children&#39;s hospital to be rated &#39;Outstanding&#39; by the Care Quality Commission. We provide a comprehensive range of children’s healthcare services and we continue to evolve and grow, transforming our services. So come and meet us and let us transform your career.&lt;/p&gt;\n&lt;p&gt;Snow Leopard provides a unique service looking after children who are on Long Term Ventilation, Neurorehabilitation or under the Children Sleep medicine department.&lt;/p&gt;\n&lt;p&gt;Long Term Ventilation consist of 6 beds and as a unit we pride ourselves on creating a Home from Home environment, helping to ease the move from hospital to home for long-term ventilated children and their families.&lt;/p&gt;\n&lt;p&gt;Neurorehabilitation have 2 dedicated beds, offering a programme of inpatient rehabilitation to children and young people up to 16 years of age with acquired brain and spinal cord injuries. Our focus is to develop or regain skills to minimise the impact of a brain or spinal cord injury on their everyday life.&lt;/p&gt;\n&lt;p&gt;Children’s Sleep Medicine consist of 5 beds. We work closely with our colleagues in the Children’s Sleep Medicine Department to support them in providing a range of sleep evaluations, from simple diagnostics to complex sleep studies. The department is one of the&lt;/p&gt;\n&lt;p&gt;We are looking for &lt;strong&gt;an experienced Band 5 RN&lt;/strong&gt; who is motivated and enthusiastic and who is willing to learn new skills, and share our passion to provide the best care to our children, young person and their families.&lt;/p&gt;\n&lt;p&gt;We have a reputation for running a dynamic nurse led, patient cantered service, where research, ideas and individuals are valued. We actively encourage staff development through education programmes and in-house training and provide training in all areas of the specialties we look after on Snow Leopard.&lt;/p&gt;\n&lt;p&gt;Have we interested you in the post? Is so- please apply today.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Unfortunately at present we cannot offer an informal visit&lt;/strong&gt; but we are happy to schedule a call so that we can talk to you about the opportunities our ward can offer, and answer any questions you may have.&lt;/p&gt;\n&lt;p&gt;All Interviews are Virtual,&lt;/p&gt;\n&lt;p&gt;We look forward to meeting you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: 22nd November 2020 (midnight)&lt;/p&gt;\n&lt;p&gt;Interview date: 3rd December 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ewa Benevides - Lead Nurse - Ewa.Benevides@gstt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Thomas&#39; Hospital, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Staff Nurse - Evelina London (Snow Leopard)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255370", "validThrough": "2020-11-22T23:59:59+0000"}