{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24926", "minValue": "23521", "unitText": "YEAR", "value": "£23,521 - £24,926 per annum, inc HCA"}}, "datePosted": "2020-11-02T17:01:07+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a vacancy for an enthusiastic, ambitious Radiology Department Assistant (RDA) to join our friendly and forward-thinking Radiology team at the Princess Royal University Hospital. This is an ideal opportunity for an experienced Health Care Assistant seeking career development within a supportive structure or a member of staff coming from another clinical support role seeking a new challenge.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for highly motivated candidates with an aptitude for hands on learning and a desire to deliver exceptional patient care. This role includes a clinical rotation through X-ray, CT scanning, MRI, Nuclear Medicine and Mammography* across our 3 southern sites, with full training provided.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In your day-to-day role you will liaise with ward staff, porters, radiographers, radiologists, sonographers and nurses to provide integrated and seamless patient care. Duties will include preparing patients for imaging examinations, coordinating the inpatient imaging schedule within the rostered clinical area, booking appointments, chaperoning patients, answering queries, restocking clinical areas, assisting with patient manual handling transfers, comforting and managing patient anxiety. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful applicants will need to demonstrate compassion, patient care, commitment, good organisation and effective communication skills. A high standard of IT, written and oral skills is essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an opportunity to be part of our dedicated workforce in a Trust where innovation and quality are at the forefront of our practice and strategic ambitions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates will also be expected to participate in the out of hour’s rota.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Part-time and job share will be considered.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSue FrancisJob titleSuperintendent RadiographerEmail addresssfrancis2@nhs.netTelephone number01689863659&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Radiology Department Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252968", "validThrough": "2020-11-16T23:59:59+0000"}