{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T11:15:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Forensic Maidstone TGU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Forensics – Trevor Gibbens Unit (Medium Secure Centre)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trevor Gibbens unit specialises in the assessment and treatment of mentally disordered offenders, serving the community of Kent and a population of approximately 1.6 million. This is a 65 beds unit with a range of clinical facilities based on patient need.&lt;/p&gt;\n&lt;p&gt;One area of our work deals specifically with people who have come into contact with the criminal justice system. Those received into our secure inpatient settings are mentally-disordered offenders who require detention during their care - assessment through treatment to the prospect of rehabilitation.&lt;/p&gt;\n&lt;p&gt;The Ministry of Justice oversees our work and our colleagues in the police and ambulance service partner closely with us on initiatives including street triage, designed to identify early warning signs and improve the response to people in a mental health crisis.&lt;/p&gt;\n&lt;p&gt;In 2020, we will pilot a new scheme, supporting eligible patients back into the community at the earliest opportunity, working with supportive employers and leading charitable organisations to offer second chances and a new future away from crime.&lt;/p&gt;\n&lt;p&gt;This is mirrored in our Criminal Justice and Liaison Service (CJLDS), a collaboration between KMPT, the county’s custody suites and the courts, using new technologies to offer swift assessments in the cells to identify a wealth of vulnerabilities, often for the first time, that can be the root cause of criminal activity and then the right support to help break the offending cycle.&lt;/p&gt;\n&lt;p&gt;We are also at the forefront of neuropsychiatry and neuropsychology. In 2019, we hosted a first, a conference in conjunction with our colleagues at the University of Kent highlighting the links between neuroimmunology and psychosis. The Encephalitis Society called it ground-breaking.&lt;/p&gt;\n&lt;p&gt;You can see the opportunities are varied, challenging, rewarding, and life-changing for everyone involved. Speak to us about a new career at KMPT.&lt;/p&gt;\n&lt;p&gt;We are looking for dedicated Staff Nurses to join us and be part of our forward thinking, progressive team that invests in staff through continuous development and career progression.&lt;/p&gt;\n&lt;p&gt;You might be a newly qualified RMN/RNLD nurse, a RMN looking to return to work or an experienced nurse looking for a new challenge. In addition, we are always happy to talk to you about your flexible working needs.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joe Donnelly, Recruitment Officer&lt;/p&gt;\n&lt;p&gt;Telephone: 01227812315&lt;/p&gt;\n&lt;p&gt;Email: joe.donnelly3@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trevor Gibbens Unit, Maidstone, Maidstone", "postalCode": "ME16 9PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2722", "longitude": ".488325"}}, "title": "Qualified Mental Health Nurse - Forensic (Medium Secure)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251739", "validThrough": "2020-11-22T23:59:59+0000"}