{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata, per annum"}}, "datePosted": "2020-11-03T16:16:18+0000", "description": "&lt;p&gt;Would you like to work for a Trust where you can be proud of the contribution you make to delivering high quality healthcare with a personal touch, come and join a Trust which recognises the contribution our Nursing, Midwifery and Operating Department Practitioners make, and values the work they do. This is reflected in our current strategy “Proud of Nursing and Midwifery in Newcastle; Compassion Quality and Excellence in all we do” 2013-2016 &lt;em&gt;(see link in Additional Information for full document)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;This is an opportunity to start your career in theatres or to enhance and learn new skills outside the ward environment. If you want to work in busy theatre suites then these may be the perfect opportunity for you.&lt;/p&gt;\n&lt;p&gt;Theatre posts are suitable for both newly qualified and experienced practitioners. You would work as part of a highly skilled team where you can gain a wealth of experience, supported by a Senior Team including a Clinical Educator. Candidates interested in developing a career in theatres will have the opportunity to develop a range of relevant skills, including, intravenous drug administration, scrubbing techniques.&lt;/p&gt;\n&lt;p&gt;We are particularly looking for:&lt;/p&gt;\n&lt;p&gt;Neuro Scrub &amp; Ophthalmology Scrub &amp; Children’s theatres RVI Radiotherapy RVI&lt;/p&gt;\n&lt;p&gt;Cardiac Scrub, Cardiac Anesthetics/recovery Freeman&lt;/p&gt;\n&lt;p&gt;Cardiac Cath Lab&lt;/p&gt;\n&lt;p&gt;General Surgery Scrub Freeman&lt;/p&gt;\n&lt;p&gt;We currently have a number of Trust wide vacancies, the size and complexity of the Trust means that the range and number of posts varies over the course of the period that this advert is live.&lt;/p&gt;\n&lt;p&gt;We recommend that candidates who are interested in an operating department practitioner or a nursing role within our Trust theatres contact the nuth.NursingRecruitmentQueries@nhs.net who will in turn direct you to the leads for those areas.&lt;/p&gt;\n&lt;p&gt;It is useful to know which specialist area/s you have a keen interest in, so we can direct you to the most appropriate Matron to answer all your questions regarding the vacancy, hours and shift patterns, etc.&lt;/p&gt;\n&lt;p&gt;Informal visits can also be arranged if requested.&lt;/p&gt;\n&lt;p&gt;You will have time at the interview to look at the full list of vacancies, as there may be a specialty or area you didn’t realize we could offer.&lt;/p&gt;\n&lt;p&gt;We look forward to your application.&lt;/p&gt;\n&lt;p&gt;The Trust do not offer alternative interview dates so candidates need to be available for the interview date shown on the current advert .&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Nurse, Midwife, Health Visitor or Operating Department Practitioner, in our Trust, we recruit staff who are committed to delivering a professional, caring and compassionate approach, putting patient care at the heart of all they do.&lt;/p&gt;\n&lt;p&gt;All of our clinical areas are supported and lead by experienced Matrons - contact details are available on our Trust website (&lt;em&gt;see link in Additional Information). &lt;/em&gt; Please make contact and perhaps arrange an informal visit? A full description of all our clinical directorates can be found in the Additional Information sheet attached to this advert.&lt;/p&gt;\n&lt;p&gt;At interview you will be asked to select your preference for working specialty including site, and we will endeavour to appoint to your first choice where possible. If you would like to contact us about any of the vacancies use the hyperlink within the Additional Information for direct line managers details or email: nuth.NursingRecruitmentQueries@nhs.net&lt;/p&gt;\n&lt;p&gt;Interview Date:- &lt;strong&gt;24/11/20 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;nuth.NursingRecruitmentQueries@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 Trustwide", "postalCode": "NE7 7DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0028", "longitude": "-1.59341"}}, "title": "Operating Department Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254742", "validThrough": "2020-11-15T23:59:59+0000"}