{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa HCA inclusive"}}, "datePosted": "2020-11-03T11:32:00+0000", "description": "&lt;p&gt;We’re looking for a confident and motivated Stakeholder Relations Manager to join our small but busy communications team.&lt;/p&gt;\n&lt;p&gt;Reporting to the Head of Communications, your role is to improve our relationship and communications with our key external stakeholders, helping them to better understand the work of our Trust, to listen and act on their concerns, and deliver a comprehensive programme of communications and engagement.&lt;/p&gt;\n&lt;p&gt;You will oversee the management of our primary written communications channels aimed at key influencers locally and nationally; across the political environment and in the broader heath sector. You will lead on delivering specific events and face-to-face engagement opportunities; and manage several of our key external engagement channels to ensure our important external partners are informed and up to date about our Trust.&lt;/p&gt;\n&lt;p&gt;As well as supporting our external stakeholder engagement, you will also manage several of our key internal face to face events and engagement channels, mainly on a monthly cycle, to support the senior leadership and ensure that staff have the opportunity to engage with our leaders.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTracey BeckJob titleHead of CommunicationsEmail addressTracey.beck@nhs.netTelephone number0208 869 2421&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital but with significant cross-site working and remote working, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Stakeholder Relations Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253756", "validThrough": "2020-11-15T23:59:59+0000"}