{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-26T15:16:18+0000", "description": "&lt;p&gt;&lt;span&gt;A unique opportunity has arisen for an experienced nurse to join the Urology Clinical Nurse Specialist team, as a Lead CNS, to lead and support the Urology CNS team in delivering high quality care for patients with Urological conditions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant must be a driven individual focused on delivering patient centred care with a commitment to providing a quality service that is responsive to the changing needs of patients accessing the service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will work as a skilled practitioner within the Urology Team, providing expert clinical knowledge and support as part of the clinical pathways for urology. They will provide highly specialised technical skills in urology and coordinate the provision of nurse led clinics which may be for benign conditions or cancer patients, as and when required. The post holder is required to ensure that patients and families are central to the delivery of care, implementing new innovations and practices facilitating and leading the team in the provision of education and support to other professionals and patients&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Understanding the need for change you must be a flexible leader, open and be able to support and motivate your team. This is an excellent opportunity to demonstrate your passion and drive for quality improvement. You will be able to promote your skills and experience in supporting and nurturing staff to deliver the highest quality of care and shape the strategy for urology services at UHCW moving forward..&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a highly motivated nurse with a passion for both patient care and the continual improvement of nursing standards. Evidence of leading change and care improvement is essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At UHCW you can achieve extraordinary things with extraordinary people. Become part of a vibrant team living our values – putting the patient first by empowering staff to deliver safer care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJo KeechJob titleGroup Director of Nursing &amp; Allied Health ProfessionalsEmail addressjo.keech@uhcw.nhs.ukTelephone number02476 966124&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHCW NHS TRUST, COVENTRY", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Lead Clinical Specialist Nurse - Urology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243097", "validThrough": "2020-11-09T23:59:59+0000"}