{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £51,668 pa pro rata"}}, "datePosted": "2020-11-03T10:58:29+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for an experienced, knowledgeable and highly competent individual to join our Acute Medicine, Advanced Clinical Practitioner (ACP) team. This is a fantastic opportunity to work within an established team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a Registered Practitioner in Nursing, Pharmacy, Physiotherapy or Paramedicine and hold current registration with NMC, HCPC or GPhC possessing the relevant qualifications stated (or willingness to complete them)? If you are knowledgeable, adaptable and experienced with an evident passion for clinical practice, you are invited to apply.&lt;/p&gt;\n&lt;p&gt;The ACP will be responsible for the provision of high quality patient care by assessing, treating and discharging patients with appropriate supervision. The successful individual must have experience within the specialty setting to recognise acutely ill patients and the need for urgent treatment from the streaming process and the ability to work autonomously and as part of a Multi-Disciplinary Team. This position is for 12 months, fixed term for maternity leave cover.&lt;/p&gt;\n&lt;p&gt;We are passionate about the delivery of high quality; safe patient care and Advanced Clinical Practice is seen as integral to this.&lt;/p&gt;\n&lt;p&gt;We will offer you support and the opportunity to personally and professionally develop your career and scope of practice.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; If you have not fully completed the MSc in Advanced Practice but have successfully completed the Level 7 Advanced Adult Health Assessment and a Non-Medical Prescribing qualification, we would encourage you to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Contact information:&lt;/p&gt;\n&lt;p&gt;Faye Davies; fay.davies@wvt.nhs.uk, 01432 355444 ext 4361 &lt;em&gt;&lt;strong&gt;or&lt;/strong&gt;&lt;/em&gt;&lt;br /&gt;Sarah Weale; sarah.weale@wvt.nhs.uk, 01432 355444 ext 4487&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Advanced Clinical Practitioner - Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253574", "validThrough": "2020-11-09T23:59:59+0000"}