{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-05T12:30:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Occupational Therapist Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community Team - City Team (Salisbury) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 Hours/Week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term - 12 Months &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a Qualified Band 5 OT to join our team.  You will be responsible for providing highly skilled therapy care to the residents within our geographical area, promoting the health of the population, reducing the effects of ill health and disability and maximising the individual’s potential for independence. You will be expected to work closely with General Practices, Social Services and other statutory and non-statutory services to meet the needs of the local population, so excellent communication skills are essential for this role.  &lt;/p&gt;\n&lt;p&gt;As well as bringing your clinical expertise, you will be a champion of integrated community care. You will be a strong team player, an excellent communicator who is adaptable, committed, organised and able to work well under pressure. You will support the development, implementation and maintenance of high quality safe and sustainable clinical and operational leadership under the direction of the team leaders and clinical lead.  The therapy team are expected to cover planned and urgent occupational therapy assessment and treatment as well as supporting the Home First, discharge to assess pathway.   Participation in the weekend therapy rota may also be required during your fixed term post.&lt;/p&gt;\n&lt;p&gt;We cover a large geographical area so access to a vehicle to travel to visit patients is essential.  We work a 7 day shift pattern from 08.30 – 16.30&lt;/p&gt;\n&lt;p&gt;For more information please contact, Elaine Allan on 07747 532716.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wiltshire Health and Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salisbury", "postalCode": "SP1 3SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.072", "longitude": "-1.79744"}}, "title": "Community Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257657", "validThrough": "2020-11-19T23:59:59+0000"}