{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20795", "minValue": "18813", "unitText": "YEAR", "value": "£18,813 to £20,795 pa"}}, "datePosted": "2020-10-23T16:00:04+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Reablement Support Worker - Band 2/3- up to 37.5hpw, full and part time available, Permanent&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Could you help West Suffolk Hospital to deliver the best quality and safest care to our local community?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;EARLY INTERVENTION TEAM – BAND 2 REABLEMENT SUPPORT WORKER/ BAND 3 SENIOR REABLEMENT SUPPORT WORKER&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We currently have vacancies for permanent Band 2 Reablement Support Workers (carers) and Band 3 Senior Reablement Support Workers to work as part of the Early Intervention Team (an integrated health, social care and voluntary sector service). The team provides a ‘wrap around’ service to prevent hospital admissions by assessing patients in their own homes, preventing admissions from the Emergency Department and providing early supported discharge from the Acute Medical Unit. The team is a multi- disciplinary team made up of: occupational therapists, physiotherapists, nurses, social workers, British Red Cross support workers, a Suffolk Family Carers link worker and reablement support workers.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates will be an integral part of the Early Intervention working alongside patients in their own homes to enable crisis management for a short period. Patient contact will form the basis of this post and you will be aiming to re-enable someone to be as independent as possible with daily tasks, such as: personal care, meals, mobility and general activities of daily living. The team also support patients at end of life.&lt;/p&gt;\n&lt;p&gt;An ability to travel to rural locations to carry out post is essential. Pool cars to travel to patients will be provided.&lt;/p&gt;\n&lt;p&gt;The posts are available full- time and part- time. The service works over 7 days and the reablement support worker service covers 24 hours. We would particularly welcome candidates looking to work overnight (21:30- 08:30) or a mixture of shifts.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a friendly and forward-thinking service with a well-developed appraisal system and structured support from senior staff. Training and development are actively encouraged.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would welcome informal visits to meet our team, so that you can find out further information about the post. Please contact 01284 713712 to arrange a visit. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact Anita Jilley or Gareth Blissett on 01284 713712.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does&lt;/strong&gt; entitle you to apply to park on the Hospital site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at Enhanced level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Reablement Support Worker - Band 2/3 - EIT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241194", "validThrough": "2020-12-18T23:59:59+0000"}