{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-26T12:30:42+0000", "description": "&lt;p&gt;South Central Ambulance Service NHS Foundation Trust (SCAS) covers the counties of Hampshire, Berkshire, Oxfordshire and Buckinghamshire, an area of c. 4,600 sq miles with a resident population of approximately four million. This is an exciting time for Ambulance Services as we move into a period of innovation and change, in particular developing services to support the wider urgent &amp; primary care agenda, through collaborative working partnerships. South Central Ambulance Service is committed to providing high levels of patient care in a pre-hospital environment and is focussed on delivering the right care at the right time to our patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key to the delivery of these services will be through the expansion of specialist clinical roles, one of which is the Qualified Specialist Practitioner – Primary Care (paramedic). &lt;/strong&gt;We are therefore seeking applications from registered paramedics who have the relevant pre-hospital operational clinical experience and hold a Specialist Qualification or equivalent.&lt;/p&gt;\n&lt;p&gt;We are looking for qualified specialist practitioners, who are enthusiastic, dynamic and highly motivated. Applicants need to be excellent communicators with effective influencing and negotiating skills. You will be working with multi-disciplinary teams across the NHS landscape in order to ensure that appropriate care is provided for patients.&lt;/p&gt;\n&lt;p&gt;This exciting opportunity involves the successful completion of a ‘Primary Care Development Programme’. The successful candidate will undertake the following development opportunities:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Portfolio of competencies in line with the ‘College of Paramedics - Primary and Urgent Care Core Capabilities Framework’&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Collaborative working partnerships across primary care (rotational working)&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Emergency Care – front line operations (rotational working)&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This exciting role will provide high quality, patient focused care and clinical leadership across the organisation. This role will also involve collaborative and portfolio working opportunities, across a multitude of primary care settings, to include urgent care centres, walk-in centres and GP surgeries.&lt;/p&gt;\n&lt;p&gt;To develop and build on this innovative model, the Trust is currently seeking applications from registered paramedics who have the relevant clinical experience and qualifications to apply for this new development programme. Successful candidates will undertake the above outlined educational programme. This will be a blended learning experience, which will include leadership training and clinical placements alongside operational practice.&lt;/p&gt;\n&lt;p&gt;Specialist Paramedics will use their knowledge and skills to independently provide healthcare, focused to patients with minor illness or injury, long term conditions, and other urgent and primary care needs&lt;strong&gt;. &lt;/strong&gt;As part of this role, new and exciting opportunities have arisen for rotational and collaborative working partnerships across the wider health care system; these include urgent care, primary care and community care settings.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can offer a wide range of flexibility/shift patterns to accommodate an effective work-life balance, as well as further development opportunities such as independent prescribing and advanced clinical practice modules at postgraduate level, for the right candidate.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Specialist will be responsible for the care of the patient including assessment, diagnosis, treatment, discharge and/or referral as well as administering and supplying medicines, in line with Patient Group Directions/Medicines management policy.&lt;/p&gt;\n&lt;p&gt;You will be expected to demonstrate evidence of taking personal responsibility for your own professional development, leadership in a clinical environment and have a strong desire to support and guide colleagues in other clinical roles. Applicants should be able to display sound clinical knowledge including evidence of history taking and clinical triage in a sensitive manner, providing assessment, advice and treatment in line with clinical protocols and using professional judgement, and to show that they can work as part of a team or autonomously.&lt;/p&gt;\n&lt;p&gt;The job description and person specification will provide further details. For further information or if you wish to discuss any element of this role please contact:&lt;/p&gt;\n&lt;p&gt;Craig Barlow&lt;/p&gt;\n&lt;p&gt;Operations &amp; Engagement Manager – Primary &amp; Urgent Integrated Care&lt;/p&gt;\n&lt;p&gt;craig.barlow@scas.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisted candidates will be required to attend a panel interview which will include external stakeholders and to provide evidence of their CPD portfolio.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This advert is part of a rolling programme of specialist training opportunities and we will endeavour to provide receive feedback upon request to assist development towards a specialist role for those who are unsuccessful in their applications.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122412.jpg", "name": "South Central Ambulance Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122412"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxfordshire, Buckinghamshire, Berkshire, Hampshire", "postalCode": "HP11 2JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.629", "longitude": "-.762384"}}, "title": "Specialist Practitioner - Paramedic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242432", "validThrough": "2020-11-15T23:59:59+0000"}