{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36982", "minValue": "36982", "unitText": "YEAR", "value": "£22 per hour (DOE)"}}, "datePosted": "2020-10-28T10:01:59+0000", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Radiographer in our Cambridge Hospital and play your part in building a healthier nation.&lt;br /&gt;&lt;br /&gt;The Role&lt;br /&gt;&lt;br /&gt;Whether you join us from the NHS or a private setting, you will find that we offer you an unrivalled opportunity to grow the respected career that you always wanted. You will benefit from our investment in state-of-the-art equipment and our commitment to give you more time with partners. As a Radiographer you will;&lt;br /&gt;&lt;br /&gt;- Deliver a high-quality diagnostic imaging service for a very varied caseload – within the department, on the ward and in theatre.&lt;br /&gt;&lt;br /&gt;- Working with leading practitioners and experiencing new practices, equipment and facilities.&lt;br /&gt;&lt;br /&gt;- Providing a service of the highest quality, delivered with sensitivity and compassion.&lt;br /&gt;&lt;br /&gt;The Person&lt;br /&gt;&lt;br /&gt;To succeed as a Radiographer you will have;&lt;br /&gt;&lt;br /&gt;- High levels of technical knowledge and the ability to work quickly and accurately, with a great eye for detail.&lt;br /&gt;&lt;br /&gt;- A caring nature – to see each patient as an individual and carry out this role with understanding and empathy.&lt;br /&gt;&lt;br /&gt;- A BSC degree in diagnostic radiography or equivalent to meet the registration requirements of the Health and Care Professions Council (HCPC)&lt;br /&gt;&lt;br /&gt;- A postgraduate qualification in an area of specialization.&lt;br /&gt;&lt;br /&gt;- Post registration experience relevant to the role.&lt;br /&gt;&lt;br /&gt;- Excellent communication and team working abilities.&lt;/p&gt;\n&lt;p&gt;The Benefits&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;•    Holiday in line with the Working Time Directive.&lt;br /&gt;•    Access to our Pension Scheme.&lt;br /&gt;•    Discounted gym membership at £15.00 a month that they need to set up directly with the club. Discount does not extend to partners and family members.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working on the bank means you are not contracted to a set number of hours per week but instead work on an ad-hoc basis to suit the needs of the business and your availability. &lt;br /&gt;&lt;br /&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary - Up to £22 per hour depending on experience&lt;br /&gt;Closing date - 20/11/2020&lt;/p&gt;\n&lt;p&gt;Bank Contract - Various Hours&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge", "postalCode": "CB2 8AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1903", "longitude": ".124295"}}, "title": "MRI - Radiographer - Bank", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245965", "validThrough": "2020-11-20T23:59:59+0000"}