{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 p.a inc. HCA"}}, "datePosted": "2020-11-02T12:02:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse – Day Surgery Units Experienced &lt;/strong&gt;&lt;strong&gt; - Theatres, Anaesthesia and Perioperative Medicine (TAP)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Located in two of London’s most sort after locations, Guy&#39;s and St Thomas’ TAP (Theatres Anaesthesia and Perioperative Medicine) Directorate is looking for experienced Band 5 Staff Nurses to join our highly skilled team in our Day Surgery Units. You will become a generic Day Surgery Practitioner through our Day Surgery rotational programme.&lt;/p&gt;\n&lt;p&gt;If you are an experienced staff nurse, and is looking to further develop your career and expand your skills within Day Surgery - this may be the area for you. Our long history of cutting edge surgery means that you could be involved in some of the worlds most advanced procedures&lt;/p&gt;\n&lt;p&gt;St Thomas’ Day Surgery Unit comprise of 6 theatres, Recovery, Admission &amp; Discharge Lounges. Specialities include Gynaecology, General Surgery, Colorectal, Upper &amp; Lower Gastrointestinal, Hand Trauma, Plastics and Pain Management.&lt;/p&gt;\n&lt;p&gt;Guy’s Day Surgery Unit &amp; Nuffield Theatres comprise of 5 theatres, Recovery, Lithotripsy (Stone), Admission &amp; Discharge Lounges. Specialities include Breast, Urology, ENT, Orthopaedics, Podiatry, Endourology, Pain Management, Renal &amp; Plastics.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be and would support you in achieving your goals through our in-house training programs and tertiary study at our affiliated universities.&lt;/p&gt;\n&lt;p&gt;Training and support is provided whilst we develop your existing skills and knowledge in each aspect of the Perioperative environment.&lt;/p&gt;\n&lt;p&gt;Personal and professional growth is encouraged through work based learning programmes. These programmes cover a broad range of clinical and non-clinical skills which will aid you in building your professional portfolio in advanced nursing, leadership, research and more.&lt;/p&gt;\n&lt;p&gt;Our TAP (Theatres, Anaesthesia and Perioperative Medicine) Academy aims to develop a team of practitioners, with knowledge and skills to care for patients, recognizing the commitments of our staff and rewarding achievements.&lt;/p&gt;\n&lt;p&gt;Further information on the directorate and TAP academy can be found in the Fact sheet and booklet attached.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be advised that all the interviews will be conducted online via Skype, and there will be no phone interviews. Please make sure that you have a Skype account and the video and audio functions are working.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews to be conducted online via Skype for Business or Microsoft Teams on the week commencing the 14th of December 2020.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "GSTT, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Band 5 Staff Nurse – Day Surgery Units Experienced", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251963", "validThrough": "2020-12-06T23:59:59+0000"}