{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum"}}, "datePosted": "2020-11-05T11:01:18+0000", "description": "&lt;p&gt;Can you inspire others, create hope and make positive connections to help people build a meaningful life in the community? Do you want to make a real difference to people placed in complex (locked) rehabilitation hospitals by providing an alternative? Do you want to be at the forefront of developing an exciting new regional community rehabilitation service, work collaboratively with service users, carers and be supportive by colleagues?&lt;/p&gt;\n&lt;p&gt;If yes, then this is the work for you.&lt;/p&gt;\n&lt;p&gt;The West Yorkshire Integrated Care System (WYICS) has been consulting widely to understand experiences of complex care. Service users describe being disconnected from home and lack hope for a meaningful future; describing a community model as “not just about keeping me safe – it’s about building a life worth living”.&lt;/p&gt;\n&lt;p&gt;This means that supporting discharge from hospital requires flexible and intensive transitional community support closer to home, in the least restrictive environment, providing consistent, recovery focussed and contemporary interventions and integrated pathways of care. With funding from NHS England we are now in an exciting position to pilot a new intensive community complex rehabilitation service to work across Leeds, Calderdale and Kirklees/Huddersfield. It will offer a seven day a week, 8am until 8pm service. Being multi-disciplinary and multi-agency in nature it will create psychologically informed flexible care packages to support discharge home.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a dynamic and committed team of multidisciplinary clinicians and peer and support roles to establish a new way of working in the community for people with complex mental health and intensive rehabilitation needs.&lt;/p&gt;\n&lt;p&gt;The aim of the service is to provide psychologically informed, flexible and intensive packages of support aimed at building service user confidence to live a meaningful life in the community as an alternative to a hospital complex rehabilitation placement. The service will also facilitate system change by providing a consistent approach to community rehabilitation and safety planning that supports more hospital providers to make discharge decisions. The team will work collaboratively with users and partners from local multi agency providers and services.&lt;/p&gt;\n&lt;p&gt;Our commitment to you if successful is that you will be offered strong support structures including reflective practice and clinical supervision, be supported to develop new skills, psychologically informed training and be supported by the WYICS project to evaluate of the service.&lt;/p&gt;\n&lt;p&gt;We recognise the importance of ensuring that our services are reflective of the communities we serve and champion diversity and inclusion. As part of a wider strategy to improve healthcare career opportunities for all, we would particularly welcome applicants from Black and Minority Ethnic (BAME) backgrounds. We are committed to implementing the NHS Workforce Race Equality Standards and welcome staff members from all racial backgrounds who commit to these standards.&lt;/p&gt;\n&lt;p&gt;We welcome applicants who may be seeking a secondment opportunity within the West Yorkshire ICS and strongly encourage informal inquiries.&lt;/p&gt;\n&lt;p&gt;**Please note any correspondence following application will be sent via trac.jobs &amp; the Trust&#39;s Resourcing Team**&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jeanette Lawson on 07985803968 or at jeanette.lawson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Yorkshire or Kirklees, Calderdale &amp; Leeds", "postalCode": "LS15 8ZB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7968", "longitude": "-1.4265"}}, "title": "Case Managers/Care Coordinators", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257346", "validThrough": "2020-11-19T23:59:59+0000"}