{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096- £11,0683"}}, "datePosted": "2020-10-16T12:02:05+0100", "description": "&lt;p&gt;ESNEFT (East Suffolk &amp; North Essex NHS Foundation Trust) is an ambitious Trust with a simple vision, to provide the communities we serve with excellent healthcare and build a better future for the people of East Suffolk and North Essex. To help us do this, we will work closely with our local partners to deliver more of the joined-up services and care our residents need.&lt;/p&gt;\n&lt;p&gt;For our staff and our patients we have the same philosophy: time matters. This new way of working will remove unnecessary stress and frustration caused by the systems we use and the way we work. We will concentrate on removing or improving the things we do that don&#39;t work for our patients. For our staff, this means more time to care for patients and greater opportunities to develop skills and experience.&lt;/p&gt;\n&lt;p&gt;To be the best, we need to attract and keep the best staff. Our size puts us in a strong position to grow, providing more of the latest services. Our scale provides exciting opportunities for development, innovation, research, education and training. Support from technology and logistics will help us see patients at the right time.&lt;/p&gt;\n&lt;p&gt;We have posts based at Colchester General Hospital and at Ipswich Hospital, although there is the potential to work across both sites.&lt;/p&gt;\n&lt;p&gt;Histopathology provides a reporting service to the Trust, the community and local private hospitals, with workload distributed using the RCPATH points system according to job plan. In addition there is opportunity to boast income from private work, which is shared equally between the consultant team, and an opportunity to participate in the Post Mortem Service which is provided to the local coroner (although this is not mandatory).&lt;/p&gt;\n&lt;p&gt;For Colchester, the Histopathology service is based on the main Colchester site and operates out of a modern, dedicated standalone unit. The building was fully modernised, specifically for Histopathology, in 2017, and offers modern bright and clean accommodation. Dedicated individual consultant offices are situated on the first floor of a two storey building above the well-equipped technical laboratory.&lt;/p&gt;\n&lt;p&gt;For Ipswich, the Histopathology service is situated on the main hospital site. All pathology disciplines are housed in the same purpose built building providing opportunity for close working with all pathology disciplines. The service participates in the training of specialist registrars as part of the East of England deanery, which has proven success record with training and educating the next generation of Histopathologists.&lt;/p&gt;\n&lt;p&gt;This is an exciting time for the service as the Colchester, and Ipswich sites work together to provide a modern and sustainable Histopathology service. Our aim is to incorporate the latest technologies and innovations to ensure the service is prepared for current and future challenges of the modern NHS. In addition the Trust is working towards a collaboration with Ningxia General Hospital, Ningxia, China, which is a teaching hospital and tertiary centre for the region. This will bring exciting opportunities to Histopathology and ESNEFT with regards research and teaching. There will be programmes of fellowship including histopathology, collaborated research projects are already started and in progress.&lt;/p&gt;\n&lt;p&gt;You’ll enjoy an enviable quality of life, based in the cultural capital of Colchester or the beautiful historic town of Ipswich. Both locations benefit from a wealth of affordable housing in one of the most attractive parts of Britain, yet are close to Stansted Airport and all the facilities of London. Your new home will also be great news if you’re bringing up a family, as this part of Essex is home to some excellent schools and great leisure facilities.&lt;/p&gt;\n&lt;p&gt;Applications will be considered for a locum post if you are not on the Specialist Register.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Colchester Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Soumadri Sen - Histopathology Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01206 748352 / 01206 748340&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ipswich Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Jason Wong&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01473 703735&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester &amp; Ipswich,", "postalCode": "CO4 5JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9102", "longitude": ".899214"}}, "title": "Consultant Histopathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230027", "validThrough": "2020-11-16T23:59:59+0000"}