{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-30T14:22:12+0000", "description": "&lt;p&gt;&lt;span&gt;Are you passionate for children to have the best start in Life? Do you have the qualities and skills to develop services to ensure children can access the right health service, in the right place, at the right time? NHS Dorset Clinical Commissioning Group is looking to recruit a part time programme officer  to work in the Children’s and Young Peoples  Community and Primary Care team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant will join a hard working but fun loving team to support health related transformation projects for the children and young people of Dorset.  We work across the system bringing together key stakeholders including our service users to coproduce new ways of working to the benefit of all. The role demands expert communication skills to ensure all voices are heard, project plans agreed and objectives met. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be an organised individual that can demonstate being a team player, confident to contribute to debate and challenge ways of working in a complex strategic environment to provide project support in various forms. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Administrative and IT skills are essential. You will need to be confident in where to find, access and use health and population data and use innovative ways to communicate this information to influence service design and project progress. The role will require you to take responsibility for the management of designated contracts within the team. You will be required to support the team by setting up systems for monitoring and reporting on projects and service redesign project and plans.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Experience of prioritising conflicting work demands is essential as you will be expected to work autonomously to progress projects and manage the day to day demands of the role. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are successful, you will join the third largest Clinical Commissioning Group in England which is keen to develop, grow and make a real difference to healthcare locally. We have a great reputation which we intend to build on by closely working with our clinical community and the population we serve. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This position is normally based in Vespasian House in Dorchester with travel expected across the county so a valid driving licence is essential. However, due to Covid-19 restrictions home working is necessary. You will need to have resliaince to maintain motivation to achieve your objectives and seek out colleagues to help you meet these. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for the right person to join our ambitious team, we are a supportive, enthusiastic, motivated and flexible in our approach to achieve our planned priorities. We intend to create a strong efficient health care syetm in Dorset and would welcome your application if you feel you can make a difference. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;span&gt;This is a permanent contract, 32 hours over 4 days per working week.&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128199.png", "name": "Dorset Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128199"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Vespasian House, Dorchester", "postalCode": "DT1 1TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7146", "longitude": "-2.44439"}}, "title": "Programme Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250554", "validThrough": "2020-11-15T23:59:59+0000"}