{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-27T11:02:53+0000", "description": "&lt;p&gt;Band 5 Paediatric long term ventilation team post&lt;/p&gt;\n&lt;p&gt;1 x 30 hour post&lt;/p&gt;\n&lt;p&gt;The Children&#39;s Continuing Care team at Stockport NHS Foundation Trust are based at and work out of Swanbourne Gardens in Edgeley Stockport. The team have undergone expansion over the past 5 years with the growth in the number of children receiving packages of care at home and respite/short breaks at our purpose built facility at Swanbourne Gardens.&lt;/p&gt;\n&lt;p&gt;We are looking for staff that is able to be flexible both around the working day and also across the working week; we work around the needs of the families and the children which means we need staff who can flex their hours to start early, finish late and work overnight too.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced Band 5 paediatric nurse who is ready for the challenge of a new post within a growing team of Children&#39;s Continuing Care nurses here in Stockport. The post holder will have post registration experience, preferably of working with children with complex health needs and disability, either in a hospital or community setting. We are looking for someone who is able to flex their working hours around the needs of the service and there will be the expectation that the post holder/s will participate in an on call service for children on end of life pathways.&lt;/p&gt;\n&lt;p&gt;Although based at Swanbourne Gardens, most of the work will be within the children&#39;s homes, at school or in the community with expectations that if the children are unwell the post holders will help care for them in hospital or within other care settings. There are lots of opportunities to accompany children and families to activities, on trips out and participate in therapies and outings.&lt;/p&gt;\n&lt;p&gt;This post holder will be at the forefront of teaching and assessing the Children&#39;s Support workers in delivering day to day care to children with complex health needs, including tracheostomies, gastrostomies and ventilatory support. Full training and supervision will be available from our existing senior team, but any previous experience would be desirable.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If successful, this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary. In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a very supportive team who can offer support and guidance to you in developing new skills and adapting to working in a new environment. If you are interested and feel you have the right skills and knowledge required to join our team then call and arrange an informal visit and meet the team. Rachel Rodgers, team leader for LTV on 0161 477 9556 rachel.rodgers@stockport.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachel RodgersJob titleteam leader LTVTEmail addressrachel.rodgers@stockport.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swanbourne Gardens, Stockport", "postalCode": "SK3 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3968", "longitude": "-2.17749"}}, "title": "Staff nurse LTVT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244155", "validThrough": "2020-11-10T23:59:59+0000"}