{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-10-28T14:12:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Board:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Medicine Board incorporates the specialties of Critical Care, Outpatients, Pathology, Emergency Services, Clinical Support, Medical Specialties, Infection and Integration, led by the Medical Director.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Camden Integrated Musculoskeletal Service (CIMS)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From 1 April 2017 UCLH became the Accountable Provider Entity responsible for a completely integrated musculoskeletal (MSK) service in Camden known as the Camden Integrated Musculoskeletal Service or CIMS. The service aims to improve overall MSK service provision in Camden and UCLH will work in partnership with other secondary care providers, GPs, community physiotherapists, community pain specialists, and diagnosticians to develop and provide the right care at the right time for patients via a single point of entry to make a seamless pathway for patients. The service has a strong emphasis on evidence based pathways, information gathering and performance transparency.&lt;/p&gt;\n&lt;p&gt;UCLH will both provide care and alongside our partners lead the transformation needed to achieve the necessary improvements to patient care. As the Accountable Provider Entity UCLH are also responsible for contract management and financial control of the CIMS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Purpose:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To provide an extended skills MSK service in the Camden MSK CATS Service including assessment, diagnosis and management planning as well as appropriate onward referral for complex MSK patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To work as an APP within GP practices in Camden to provide first contact MSK triage and management service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To carry out the triage of MSK referrals from GP’s in line with evidence based pathways ensuring optimal management strategies are adopted for each patient from receipt of referral.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To provide clinical leadership to staff to ensure safe and effective delivery of clinical interventions in line with professional standards and governance requirements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To facilitate an Integrated Pathway for the management of complex MSK conditions supporting between Secondary Care and Primary Care via MSK Pathway Transformation and Development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To carry a clinical caseload, specialising in highly complex and challenging MSK patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To work as an autonomous physiotherapy practitioner providing expert musculoskeletal assessment, clinical diagnosis and management of patients referred for MSK Out-Patient physiotherapy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To act as a source of expertise on the management of complex musculoskeletal cases supporting and advising other APP’s, senior physiotherapists, managers and other health professionals within the Camden MSK Partnership.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To assist the Service leads with and participate in the continuing education and training programme within the Camden MSK Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To provide highly specialised physiotherapy assessments and treatments for a range of complex patients within the Camden MSK department if required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If required to work as an APP in a Secondary Care Clinic on the Royal Free Hospital or University College Hospital site by MSK service using advanced assessment, diagnostic skills and Investigations and to be responsible for the overall management of those patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Working Relationships:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will coordinate services between the UCLH and RFH Therapy Services and other MSK service providers, with particular responsibility for Camden MSK CATS. Other responsibilities include: patient education sessions, supervision, training/sharing best practice within the department, audit, research and evaluation and further development of the service including extended scope clinics.&lt;/p&gt;\n&lt;p&gt;The job description is not intended to be exhaustive and it is likely that duties may be altered from time to time in the light of changing circumstances and after consultation with the post holder.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospital", "postalCode": "NW1 2BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5249", "longitude": "-.136987"}}, "title": "Bank Camden MSK CATS Advanced Physiotherapy Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246914", "validThrough": "2020-11-27T23:59:59+0000"}