{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-12T13:02:22+0100", "description": "&lt;p&gt;Are you looking for a challenge to work in a dynamic perioperative environment? This is an excellent opportunity to develop your skills and make a difference to perioperative patient care. We currently have exciting opportunity for a Band 6 Team Leader in Orthopaedic Scrub. We are looking for applicants with a solid background in orthopaedic specialities including joint replacement and spinal surgery.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced, enthusiastic and self-motivated individuals to work with us as part of the Theatre Team in the main operating theatre department at Chorley. You will be expected to have extensive experience in your area of theatre practice. Applicants must have excellent communication, influencing and leadership skills and thrive in a busy team environment. You will be encouraged and supported to further develop using the educational and experiential learning opportunities available. There is a structured orientation programme to support you development and you will be supported by your line manager and the education team.&lt;/p&gt;\n&lt;p&gt;We are an enthusiastic, passionate and caring ‘scrub’ team providing expert care in an elective surgical setting. We have educational opportunities to support your development. There is a comprehensive education strategy in place to underpin the development of all grades within theatres to facilitate career progression. We endeavour to provide a supportive learning environment which includes in-house leadership development.&lt;/p&gt;\n&lt;p&gt;Interview Date: 17th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lynn McGuirk Clinical Manager Tel: 01257 245701&lt;/p&gt;\n&lt;p&gt;Gillian Dearnaley Theatre Recruitment Officer. gillian.dearnaley@lthtr.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston", "postalCode": "PR7 1PP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6656", "longitude": "-2.63575"}}, "title": "Scrub Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222442", "validThrough": "2020-11-09T23:59:59+0000"}