{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 per annum"}}, "datePosted": "2020-11-04T15:28:54+0000", "description": "&lt;p&gt;Are you looking for a new challenge and an opportunity to shape the future?&lt;/p&gt;\n&lt;p&gt;East Lancs Teaching Hospitals NHS Trust is looking to appoint&lt;br /&gt;Consultants in Acute Medicine&lt;br /&gt;&lt;br /&gt;We are seeking consultants with drive, commitment and enthusiasm who will bring a consistent focus to high performance and quality of care, working collaboratively with colleagues and providing clinical leadership to the wider team. &lt;br /&gt;&lt;br /&gt;ELHT is one of four Trusts nationwide to be named as a development site for the Royal College of Physicians Future Hospitals programme.&lt;/p&gt;\n&lt;p&gt;The successful applicants will play a pivotal role in the care of the acutely ill patient, working alongside the 9 Consultants in Acute Medicine (with the planned expansion to 12 Acute Physicians and a number of Specialty Doctors). The Department of Acute Medicine is part of the Integrated Care Group Division of the Trust and works closely with the Emergency Department to provide high quality care to a catchment population of approximately 520,000. The department of Acute Medicine consists of an Acute Medical Unit and an Acute Ambulatory Assessment Unit, both based at the Royal Blackburn Teaching Hospital.&lt;br /&gt;&lt;br /&gt;Our Acute Medical Unit has significantly expanded to an 82-bedded unit in the last 18 months with improved facilities, additional staff, point-of-care ultrasound facilities, and newly recruited Advanced Nurse practitioners. There is ongoing expansion of ambulatory care services, and there are multiple in-reach services into AMU. We are one of the Future Hospitals sites and are working towards a future hospital model of acute care.&lt;br /&gt;&lt;br /&gt;We are keen to consider applications from candidates who have a medical specialty interest that may benefit the service. We do not just look at what you have achieved so far; we aim to support you through your future career aims and nurture your future development. You may want to be a research or an education lead, or bring fresh ideas on how to develop the service; we will do our utmost to help you achieve your potential. We take training and development seriously and encourage you to do the same and participate in a consultant leadership programme. &lt;br /&gt;&lt;br /&gt;Our main hospital sites Royal Blackburn Teaching Hospital and Burnley General Teaching Hospital are Teaching Hospitals. We are actively involved in education for both undergraduates and postgraduates and contribute to the Health Education North West training programme. &lt;br /&gt;&lt;br /&gt;These posts offer the opportunity to live in a multi-cultural area with beautiful locations including the Lake District, the Dales, and the Forest of Bowland on the doorstep. Cities such as Manchester, Leeds and Liverpool are readily accessible by public transport and by road. We have some excellent state and private schools in the area, and desirable areas to live where property is still at realistic prices.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr. Andreas Jostel MD FRCP&lt;/p&gt;\n&lt;p&gt;Consultant Physician (Acute Med/Endocr/Diab) &lt;br /&gt;Clinical Director Acute Medicine &lt;br /&gt;Tel: 01254 734469&lt;br /&gt;andreas.jostel@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Lancashire", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Consultant in Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256429", "validThrough": "2020-11-25T23:59:59+0000"}