{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-02T15:16:18+0100", "description": "&lt;p&gt;Our recently expanded Acute Medical Admissions and Short Stay unit is now looking for dynamic, flexible nurses who seek a fast-paced and acute environment to hone and grow their nursing skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Acute Medical Unit (AMU)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working closely with ED you will admit a variety of patients for assessment and treatment before they move on to their appropriate ward. You will have excellent communication and clinical skills in order to deliver excellent care in this varied and exciting environment. You will become an expert in Medical Admissions working alongside our Acute physicians and Advanced Clinical Practitioner. You will be thinking on your feet as you admit patients needing different and individual treatment which is short term but serious.&lt;/p&gt;\n&lt;p&gt;You will be encouraged to learn and you will be well-supported by our comprehensive team of highly-skilled Band 6 and band 7 nurses. No two days will be the same. This is an amazing opportunity to take your career up to the next level in the exciting field of Acute Medicine.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Medical Short Stay&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of this role you will rotate between AMU and our newly designed Medical Short Stay Unit. This 30 bedded area is supported by the Acute Physicians and Care of The Elderly consultants to provide an environment which can be as acute as it is varied. Patients who need a short period of treatment to get them well enough to go home will typically be seen here. The unit also specialises in the acute management of our older population who are cared for by specialists before a plan is made for their onward journey. This offers great variety and an opportunity to really expand your current skillset.&lt;/p&gt;\n&lt;p&gt;No Acute Medicine experience is required as you will be closely supported once in post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rory Spanton, Matron, rory.spanton@uhbw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact Jayne Coleman, Ward Manager, jayne.coleman@uhbw.nhs.uk or Rory Spanton, Matron, rory.spanton@uhbw.nhs.uk, for further details or an informal visit to the unit&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Staff Nurse Acute Medical Admissions and Short Stay Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916211231", "validThrough": "2020-12-31T23:59:59+0000"}