{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-26T11:01:42+0000", "description": "&lt;p&gt;The Adult Community Mental Health Division is seeking an enthusiastic and motivated Registered Nurse to join the Boston Community Mental Health Team.&lt;/p&gt;\n&lt;p&gt;The CMHT ‘s are part of the secondary care services, providing assessments and treatment packages for a range of service users aged from 18 years, with complex mental health needs. The team are committed to psychosocial interventions and follow the care programme approach with a focus on recovery and social inclusion.&lt;/p&gt;\n&lt;p&gt;The Team provides provision of assessment, support and treatment to service users who have a severe and enduring mental illness, who can be subject to Supervised Community Treatment Orders (CTO’s).&lt;/p&gt;\n&lt;p&gt;The Successful candidate will work effectively in the multidisciplinary team to provide high quality mental health assessments, treatment plans and manage risk. This work will involve working with service users and their carers in the delivery of evidence based interventions/treatments, recovery focused work. You will need to demonstrate enthusiasm and commitment to high quality care as well as possessing good therapeutic and interpersonal skills. The post holder will be required to work autonomously as well as within the MDT and with other LPFT teams, private healthcare providers and external / voluntary agencies.&lt;/p&gt;\n&lt;p&gt;You will have a strong sense of initiative, excellent team working ability and communication skills. You will be able to demonstrate knowledge of nursing interventions and community assessment skills. A willingness to undertake training relevant to the post is expected.&lt;/p&gt;\n&lt;p&gt;Experience of working with this service user group is desirable but not essential as training and supervision, both clinical and managerial, will be provided. The applicant will require an up to date working knowledge of current mental health legislation and issues around the care and treatment of community patients with complex needs.&lt;/p&gt;\n&lt;p&gt;The successful candidate must be a qualified Mental Health Nurse, registered with the Nursing &amp; Midwifery Council/Professional Health Council, with an appropriate level of post qualification experience. The post holder will provide Care Co-ordination for service users and as such a clear understanding and knowledge of the Care Programme Approach is essential. You will need to be able to travel independently within the county.&lt;/p&gt;\n&lt;p&gt;For further details please contact Mary O&#39;Sullivan on 01205 318075 or maryosullivan@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Boston", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242126", "validThrough": "2020-11-22T23:59:59+0000"}