{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 - £53,459 incl Fringe HCAS"}}, "datePosted": "2020-10-23T14:22:37+0100", "description": "&lt;p&gt;Surrey is rapidly building some of the best Acute Liaison services in the South East.&lt;/p&gt;\n&lt;p&gt;With enthusiastic and committed team members, excellent education programmes and commitment to achieve round the clock, all age services, we intend to be the best.&lt;/p&gt;\n&lt;p&gt;We are looking for a manager to run our CORE24 liaison service at East Surrey Hospital in Redhill.&lt;/p&gt;\n&lt;p&gt;This post requires a skilled and knowledgeable clinical background and someone who can show the kind of positivity which would match that found in the team.&lt;/p&gt;\n&lt;p&gt;Working as part of the wider liaison team, you will be one of four Band 8a liaison service managers in Surrey. You will lead on developing the CORE24 liaison psychiatry service at East Surrey, whilst being an integral part of both Surrey &amp; Borders Partnership Foundation NHS Trust and also of the wider liaison psychiatry team. Working alongside the other service managers, you will form part of an outstanding leadership tier promoting parity of esteem and collaboration between physical and mental health care within the Acute General hospitals in Surrey.&lt;/p&gt;\n&lt;p&gt;The successful candidate will use their unstoppable positivity to raise the profile of mental health care at East SurreyHospital and ensure that, through excellent partnership working, we improve health and social care outcomes for people using this service. The postholder will be flexible enough to put the needs of the people who use the service at the forefront of their decision making, they will be confident enough to achieve our Trust&#39;s visions and values consistently and they will be committed enough to ensure that we achieve not only the national standards of a core24, all age service, but also that we continually strive to exceed all expectations.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in Liaison is desirable but not essential.&lt;/p&gt;\n&lt;p&gt;The successful candidate will form a part of the management tier for the division and they will work closely with the Associate Director to realise the standards and visions of the Trust and the team. They will deputise for the Associate Director and will take management leads in a variety of areas and forums as required.&lt;/p&gt;\n&lt;p&gt;Please contact Matt Lamport, Associate Director for further details.&lt;/p&gt;\n&lt;p&gt;For further details please see the Job Description and Person Specification.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240907", "validThrough": "2020-11-15T23:59:59+0000"}