{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45000", "minValue": "40000", "unitText": "YEAR", "value": "£40,000 - £45,000 Pro Rata"}}, "datePosted": "2020-10-09T11:09:18+0100", "description": "&lt;p&gt;Are you an experienced Registered &amp; Chartered Psychologistlooking for a rewarding career where you can make a difference and changes lives for the better? Join the team at Victoria Gardens and enjoy support from a regional network of healthcare professionals.&lt;/p&gt;\n&lt;p&gt;Working 22.5 hours a week, you will join the team atVictoria Gardens, a specialist locked rehabilitation for people with complex mental health needs and behaviours that challenge, as well as a ward for older females. You will support the service to equip service users with the skills required for community living and increased independence.&lt;/p&gt;\n&lt;p&gt;Reporting directly to the Lead Psychologist, you will be responsible for individual and group interventions, diagnostic and cognitive assessments, MDT working and risk assessments. You will also facilitate staff reflective practice sessions and be requested to design and deliver training.&lt;/p&gt;\n&lt;p&gt;As aClinical/Forensic Psychologist, you will have experience and knowledge in carrying a service user’s caseload, including assessing complex needs and designing and delivering specialist psychological treatments to support their care plans.&lt;/p&gt;\n&lt;p&gt;A range of training opportunities are available that can see your career grow and you achieve your career aspirations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop evidence base for effective treatment of service users as part of a multidisciplinary team.&lt;/li&gt;\n&lt;li&gt;Contribute to the development of group work programmes under the co-ordination ,&lt;/li&gt;\n&lt;li&gt;Conduct research in line with the psychology department’s service delivery agreement and publish and present work to required standards under the co-ordination of the Lead Psychologist or designated other.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you&#39;ll need:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BPS recognised psychology degrees&lt;/li&gt;\n&lt;li&gt;HCPC Registration&lt;/li&gt;\n&lt;li&gt;Chartered Psychologist status&lt;/li&gt;\n&lt;li&gt;Appropriate post-graduate qualifications&lt;/li&gt;\n&lt;li&gt;To be an approved supervisor within the guidelines of the BPS and relevant division&lt;/li&gt;\n&lt;li&gt;Previous experience of conducting research and project working&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you will get:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £40,000 - £45,000 Pro Rata&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huyton", "postalCode": "L36"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4135", "longitude": "-2.8411"}}, "title": "Registered &amp; Chartered Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219919", "validThrough": "2020-12-09T23:59:59+0000"}