{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-23T15:46:06+0100", "description": "&lt;p&gt;We have an exciting opportunity for a CAMHS practitioner to join a small specialist team for young people and their families, carers referred to the North Derbyshire CAMHS eating disorder service with severe eating disorders and clinical complexity. &lt;br /&gt;&lt;br /&gt;Our work is in accordance with national and local priorities, clinical guidelines and is responsive to the needs and views of local children, young people and their families. As an integral part of the team in both clinical discussion and service delivery, and in the implementation and evaluation of specific care plans, you would join an established and supportive team based at Chesterfield Royal Hospital, offering care across North Derbyshire.&lt;/p&gt;\n&lt;p&gt;The team provides a time flexible service between the hours of 8am and 8pm.&lt;br /&gt;&lt;br /&gt;There will be opportunities to work closely with colleagues in Core CAMHS, Paediatrics, Children’s Social Care, Education and other partner services across the statutory and third sector agencies. &lt;br /&gt;&lt;br /&gt;You will have experience of working with children and young people who have mental health problems and of undertaking mental health assessments and interventions. Experience of assessing and managing risk is vital. You will have a core qualification eg Nurse, Social Worker, Occupational Therapist.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClare NicholsJob titleEating Disorders Team LeadEmail addressclare.nichols1@nhs.netTelephone number01246 514412&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124072.jpg", "name": "Chesterfield Royal Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124072"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CAMHS, The Den, Chesterfield Royal Hospital, Chesterfield", "postalCode": "S44 5BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2362", "longitude": "-1.40008"}}, "title": "CAMHS Eating Disorders Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241168", "validThrough": "2020-11-12T23:59:59+0000"}