{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa (RRP + Relocation Package)"}}, "datePosted": "2020-10-16T09:00:45+0100", "description": "&lt;p&gt;&lt;strong&gt;Love Emergency Medicine? Love Weston.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Emergency Medicine Consultant Vacancy.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There really has never been a more exciting time to join us; University Hospitals Bristol NHS Foundation Trust and Weston Area Health NHS Trust have merged together to become one ‘Outstanding’ organisation. The newly merged Trust has a combined workforce of over 13,000 staff, aiming to deliver exceptional local services for local people and specialist services across the South West and beyond. Together, we form one of the largest NHS trusts in the country.&lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol and Weston Foundation Trust (UHBW) are now looking to grow our talented emergency team based in our Weston-super-Mare division, with an ambitious but realistic vision for the future of ED in Weston, you really couldn’t pick a better time to make your move to the coast.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s in it for you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Apart from getting work within a talented team in a beautiful part of the country you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Get a competitive Relocation Package&lt;/li&gt;\n&lt;li&gt;RRP up to £15k negotiable!&lt;/li&gt;\n&lt;li&gt;Work in a state-of-the-art recently refurbished facility&lt;/li&gt;\n&lt;li&gt;Be offered cross-site working options with up to 2PAs in Bristol if desirable.&lt;/li&gt;\n&lt;li&gt;Access to CESR support once established (for locums)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Whilst we may be one of the smallest Acute Trusts in the UK we couldn’t be more committed to delivering the right care in the right place at the right time. The post is advertised as full-time 10 sessions per week however once settled into the department there is the opportunity to increase up to 13 sessions if you wish. Candidates wishing to be considered for a position with fewer sessions are also welcome to apply.&lt;/p&gt;\n&lt;p&gt;We embarked on a major transformation programme to change the way we deliver our services through the introduction of clinical best practice across medicine, this has led to significant quality and performance improvements over the last year. Since the implementation of the model ward and the new Urgent Care Centre, the Emergency Division has seen significant improvement in patient flow, bed occupancy and quality indicators. There is increased job satisfaction for medical and nursing staff through this programme which has emphasised team working and a multidisciplinary approach to top quality care to our patients.&lt;/p&gt;\n&lt;p&gt;Weston Super Mare and the surrounding county, has lovely coastline and hills finding yourself visiting the Mendip Hills, the Quantocks and Cheddar Gorge sooner or later. The large, diverse cities of Bristol and Bath are only a short journey by car or train and our convenient location just off Junction 21 of the M5 mean the rest of Somerset, Devon and the surfing beaches of Cornwall are virtually on the doorstep.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulia CartwrightEmail addressjulia.cartwright1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Weston General Hospital, Weston-super-Mare", "postalCode": "BS23 4TQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3223", "longitude": "-2.97141"}}, "title": "Consultant and Locum Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229389", "validThrough": "2020-11-23T23:59:59+0000"}