{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 to £35,207 pa inclusive of HCAS"}}, "datePosted": "2020-10-12T12:31:39+0100", "description": "&lt;p&gt;&lt;span&gt;Royal Brompton &amp; Harefield NHS Foundation Trust is the largest heart and lung centre in the UK and among the largest in Europe. We are a partnership of two specialist hospitals which are known throughout the world for their expertise, standard of care and research success.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are passionate about what we do and the patients we serve. We are an equal opportunities employer and our patients are rich in diversity. We recruit to ensure we build a similarly diverse mix across our workforce. We are a values led organisation and we are rightly proud of our world class reputation and our people.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;About Us&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Cherry Tree ward is a day case unit and falls under the ambulatory care umbrella. &lt;/span&gt;&lt;span&gt;We have 9 trolley beds, 6 cardiology lounge chairs and several additional patient chairs.&lt;/span&gt;&lt;span&gt;The ward provides patient focused, safe and effective care delivered to the highest standard by a team of experienced healthcare professionals.&lt;/span&gt;&lt;span&gt;We are predominantly ‘nurse led’, working alongside various nurse specialists to ensure the patient journey is as seamless as possible.&lt;/span&gt;&lt;span&gt;We care for thoracic, transplant, respiratory and cardiology patients, all of which attend for a variety of tests, procedures, treatments and &lt;/span&gt;&lt;span&gt;assessments.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The ward has a Charge Nurse and Deputy sister who work alongside the Matron, providing excellent support and training. &lt;/span&gt;&lt;span&gt;Each member of staff benefits from in-house training, with the opportunity to apply for post graduate courses when available. Staff are encouraged to attend the ward meetings that fall on clinical governance days each month. &lt;/span&gt;&lt;span&gt;The ward benefits with input from specialist nurses, who are an excellent source of information, to assist with development of your knowledge and skills .&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;About You&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We need enthusiastic, open minded nurses who are keen to work at the leading edge of cardiothoracic practice in a lively, fast-paced ward. &lt;/span&gt;&lt;span&gt;If you want to be a part of an exceptional team, share your experience with a supportive team and grow in the role, we would love to hear from you. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We would encourage enthusiastic candidates to make an appointment for an informal visit.&lt;/p&gt;\n&lt;p&gt;For an informal chat or to arrange a visit please contact&lt;strong&gt; Charge Nurse Adam Kelly on &lt;/strong&gt;&lt;strong&gt;01895 823737 Ext 85658 &lt;/strong&gt;or email&lt;strong&gt; a.kelly2@rbht.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121402.jpg", "name": "Royal Brompton and Harefield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121402"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Middlesex, Harefield", "postalCode": "UB9 6JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6067", "longitude": "-.482733"}}, "title": "Band 5 Staff Nurse - Cherry Tree", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222337", "validThrough": "2020-11-08T23:59:59+0000"}