{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-29T11:14:35+0000", "description": "&lt;h1&gt;&lt;span&gt;Clinical Nurse Specialist - Liaison Mental Health Nurse working within the Paediatric Neuromuscular team&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic individual to take up an innovative and exciting new post working with the Paediatric Neuromuscular team based in Leeds, providing support to families and clinical teams across the West and North Yorkshire and the Humber. &lt;/span&gt;&lt;span&gt;The post holder will support children, young people and their families at home being cared for by the tertiary NMD service at the Leeds Teaching Hospitals NHS Trust. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The NM Team carry a caseload of 400+ children with NM disorders and is one of the centres recognised by MDUK as a centre of excellence. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Comprehensive care of individuals with neuromuscular disorders should include surveillance and management of the psychosocial effect of the disease across the lifespan, which now extends well into adulthood for many patients. Living with a chronic illness and adjusting to the changes that define the disease require coping strategies and skills, and ongoing emotional support. &lt;/span&gt;&lt;span&gt;Within the current case load of patients there are a significant number of identified and documented psychological issues. Due to the nature of the conditions it is expected that all children on the case load will experience mental health issues as some point. This is currently an unmet need and the postholder will develop an integrated service for children and young people under the care of the Leeds Neuromuscular team, including those transitioning to adult services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The job will predominantly outpatient based, although some Children and young people with Neuromuscular disorders may require support to manage psychological and emotional distress during an admission to Leeds Children’s Hospital. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is envisaged that the postholder will see patients in both clinic and community settings, whichever is deemed the most appropriate setting for assessment and/or intervention. They will be supported in these activities by other members of the Neuromuscular MDT and maintain professional links with the child &amp; adolescent mental health service &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more information contact Dr Karen Pysden &lt;/span&gt;&lt;span&gt;Consultant Paediatric Neurologist or Katie Ward Children’s Neuromuscular Nurse specialist 07585985340&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122272.jpg", "name": "Leeds Children's Hospital", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122272"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Leeds General Infirmary", "postalCode": "LS1 3EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8015", "longitude": "-1.55175"}}, "title": "Clinical Nurse Specialist Liaison Mental Health (XR06)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248030", "validThrough": "2020-11-19T23:59:59+0000"}