{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 per annum pro rata"}}, "datePosted": "2020-10-29T14:15:35+0000", "description": "&lt;p&gt;&lt;span&gt;CDDFT are investing an additional £3m into Therapy services across the University Hospital of North Durham (UHND), Darlington Memorial Hospital (DMH) and Bishop Auckland Hospital (BAGH). There has never been a better time to come and join us in developing high quality, evidence based and compassionate therapy services. We are recruiting posts within Physiotherapy, Occupational Therapy, Speech and language Therapy, Podiatry, Dietetics and nutrition, Clinical Psychology and Psychological Practitioners. Look out for all our adverts on NHS jobs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of this MDT you will have the opportunity to influence the development of:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Integrated pathways across the health and care system&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Innovative new roles&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Training to up skill our workforce&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As Therapy services working together we will be able to ensure the care offered is individualised, evidenced based and builds a resilient workforce for the future.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We will also be investing further in our community services to further develop partnership working across the Health and Care System.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;2 posts Band 7 ITU Respiratory and Surgery - 1 x UHND and 1 x DMH&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for 2 clinical band 7 posts in the speciality of respiratory physiotherapy. One of these posts will be based at UHND and the other at DMH. The role will cover the areas of ITU, respiratory and surgical wards. We are looking for an enthusiastic individual with expert clinical knowledge in respiratory physiotherapy, extensive experience of working on ITU and with general surgical/medical patients. The post holder will work as part of the inpatient physiotherapy team at UHND or DMH working alongside the two team leads who operationally manage the team. The post holder will be responsible for supporting and developing the band 6 and band 5 members of the team who work on ITU, respiratory and surgical wards. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At UHND ITU consists of a ten bedded unit and a temporary isolation unit, there is one respiratory ward including NIV areas and a general surgical admissions unit, colorectal surgery ward and a gynaecology surgery ward. The post holder will be expected to work clinically as the lead physiotherapist on ITU and integrate as part of the MDT. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At DMH ITU consists of a 12 bedded unit and a temporary isolation unit, there is a 6 bed acute respiratory unit, general surgical ward, a respiratory ward, and 3 medical wards, including gastro, endocrine and haematology.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will provide on call training to the physiotherapy team trust wide, jointly with their equivalent at either UHND or DMH, as well as training and developing band 6 team members to provide such training. There is also opportunity for the post holder to provide respiratory training at a trust level. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post includes 7 day working and on overnight respiratory on- call requirement. One post is based at UHND and the other at DMH but there is an expectation for cross site working, as required. The trust provides robust in house training and there may be opportunities for the post holder to undertake external training on an individual basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please contact Jessica Mansfield for more information regarding the post at UHND, &lt;/span&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Jessica.mansfield@nhs.net &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please contact Kelly Huitson for more information regarding the post at DMH, &lt;/span&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;khuitson@nhs.net &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "1 x Darlington Memorial Hospital and 1 x University Hospital North Durham", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Specialist Physiotherapist ITU Respiratory and Surgery - Band 7 x 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248655", "validThrough": "2020-11-12T23:59:59+0000"}