{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pro rata per annum inclusive"}}, "datePosted": "2020-11-05T18:15:26+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Band 6 Specialist Palliative Care Development Clinical Nurse Specialist&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;BHRUT are seeking to recruit a highly motivated Registered General Nurse. This is an exciting opportunity to work with the SPCT and End of Life Care Team at Barking, Havering, and Redbridge University Hospitals Trust as an SPC development CNS post. The successful candidate must hold an RGN qualification; have a significant clinical practice in this field with experience of working alongside Palliative and End of Life patients.&lt;/p&gt;\n&lt;p&gt;The successful candidate will contribute to the provision of supporting patients, families and carers with life-limiting illnesses and to provide supportive education to clinical areas across both hospital sites. As well as aiming to optimise the palliative care for patients on all wards and strive to be creative in providing the best care for all patients. The successful candidate will work both autonomously and as part of the SPC team, striving to provide care that is both of a high standard and in line with National and local guidelines. The post holder will be responsible with guidance to manage their own caseload and feed into the wider MDT both within the team and across the Trust.&lt;br /&gt;&lt;br /&gt;You will support, develop and implement systems to improve the quality of palliative care across the whole Trust.&lt;/p&gt;\n&lt;p&gt;You will need to be self-motivated and have a flexible approach to work, have good organisational skills and the ability to influence others, acting as a role model across disciplines, and demonstrate excellent communication skills with good computer literacy.&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust. The post provides significant opportunities for development as an individual. This is a wonderful opportunity to be part of a developing, forward thinking and user facing department; which is an integral part of the clinical patient pathway and patient experience.&lt;/p&gt;\n&lt;p&gt;You will be required to support the delivery of a high quality SPC service across all areas. Therefore you must have a flexible approach to work, demonstrating organisational skills and be able to work to deadlines. You will be required to have good communication skills at all times.&lt;/p&gt;\n&lt;p&gt;The role is an exciting opportunity for those individuals seeking challenges and stimulation. This post will provide the chosen candidate with a unique opportunity to work with an excellent team. Join our team and make a difference.&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust will be subject to a 6 months probationary period. This will give new staff members an opportunity to become familiar with the culture and working environment of the Trust.&lt;/p&gt;\n&lt;p&gt;Applications should be made online, however, queries regarding the application process or assistance with the completion of the form (for applicants with a disability) can be made to Ashlyn Mathews Recruitment Department on 01708 435000 ext 2826. Further details regarding the post may be obtained by contacting the manager please see below.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHeather WrightJob titleMacmillan Specialist Palliative Care and EOLC Team LeaderEmail addressheather.wright3@nhs.netTelephone number01708 435026, Dect: 6846&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen&#39;s Hospital, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 6 Specialist Palliative Care Development CNS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258767", "validThrough": "2020-11-19T23:59:59+0000"}