{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21892", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 per annum (exclusive of HCAS)"}}, "datePosted": "2020-10-27T09:31:34+0000", "description": "&lt;p&gt;We are looking for a Workforce Information Analyst to join the HR Workforce Team at Health Education England. These are great opportunities for someone who may have previous experience in an analyst or similar role, to join the team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work as part of a small Workforce Team and will assist in the provision, analysis and presentation of accurate, complete, quality-assured and timely workforce information across the organisation. Data will be derived from a number of sources including Electronic Staff Record (ESR), Learning Management Systems (OLM) and Finance systems.&lt;/p&gt;\n&lt;p&gt;The role will include maintaining the ESR and its supporting work structures, Care Identity Service (CIS) user database, and HR input to HEE Integrated Performance reporting. The post holders will be required to run regular and ad hoc reports, and providing information to systems which interface with ESR.&lt;/p&gt;\n&lt;p&gt;The post holder will report to the Workforce Information Manager and will assist them in ensuring the workforce architecture within HEE is robust, fit for purpose and meets high quality standards.&lt;/p&gt;\n&lt;p&gt;The qualities we are looking for are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent IT Skills (working knowledge of Microsoft Office and o365 SharePoint)&lt;/li&gt;\n&lt;li&gt;Strong knowledge and experience of using full range of Excel software functionality&lt;/li&gt;\n&lt;li&gt;Strong analytical skills&lt;/li&gt;\n&lt;li&gt;Experience of collating information from many sources to contribute to reports&lt;/li&gt;\n&lt;li&gt;Demonstrable experience of working with an electronic system which records staff data (e.g. ESR, training system, payroll or finance system)&lt;/li&gt;\n&lt;li&gt;Working knowledge of virtual meeting technology (MS Teams, Skype, etc)&lt;/li&gt;\n&lt;li&gt;Methodical and reliable, with attention to detail and accuracy&lt;/li&gt;\n&lt;li&gt;Able to work under pressure and to tight deadlines&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The HRW team are home based although you may be required from time to time, to travel across the organisation to support the wider HR&amp;OD team.&lt;/p&gt;\n&lt;p&gt;This post is offered at NHS Terms and Conditions (2020) at Band 4. This is a permanent and full-time post (37.5 hours per week).&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 4 with a full-time starting salary of £21,892 with pay step increases as after 2 years’ service and 5 years&#39; service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;For posts based in Inner London, the above salaries will include the additional supplement of 20% of basic salary, subject to a minimum payment of £4,473 per annum and a maximum payment of £6,890 per annum. This is offered in accordance with NHS Terms and Conditions and is based on office location.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Health Education England has a bold ambition to be one of the best places to work. We listen to our colleagues carefully about what they seek from an employer in developing a healthy working environment and a rewarding career.&lt;/p&gt;\n&lt;p&gt;Health Education England’s vision is that everyone associated with health care will be committed to a lifetime of professional development, be proud of the care they provide, support and challenge one another and strive for ever-increasing standards of patient-centred care.&lt;/p&gt;\n&lt;p&gt;HEE supports the delivery of high-quality care for patients and high quality public health services by ensuring that the health workforce has the right skills, behaviours and training, and that health care staff are available in the right numbers to meet the needs of the public. It takes on leadership and oversight of healthcare workforce planning and will also be responsible for supporting and authorising Local Education and Training boards. HEE will maintain an effective system for professional education and training as part of a comprehensive health service.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today. We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The selection process will be in two stages.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Stage one will be telephone interviews , taking place w/c 16 November&lt;/li&gt;\n&lt;li&gt;Those successful at the first stage will be invited to a video interview during w/c 23 November&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name: Andy Morgan&lt;/p&gt;\n&lt;p&gt;Job title: Head of Workforce Intelligence &amp; Systems&lt;/p&gt;\n&lt;p&gt;Email address: andy.morgan@hee.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Any HEE Office", "postalCode": "LS1 4PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7988", "longitude": "-1.55967"}}, "title": "Workforce Information Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243846", "validThrough": "2020-11-10T23:59:59+0000"}