{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-26T11:01:23+0000", "description": "&lt;p&gt;We are looking for a Occupational Therapist, trained in paediatrics with wide ranging OT experience of working with children and within the NHS. This is an exciting position which includes working in schools and working with children and families at home.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to work with children and young people who have a wide range of complex physical and developmental needs including conditions such as Cerebral Palsy, Muscular Dystrophy and Autism.&lt;/p&gt;\n&lt;p&gt;The Children’s Community OT service works in partnership with young people and parents, Health, Education and Social Service professionals to provide a holistic quality service across the whole of Oxfordshire.&lt;/p&gt;\n&lt;p&gt;Within Oxfordshire there is a Children’s Integrated Service and you will have the opportunity to work in partnership with Physiotherapists and Speech and Language Therapists within the Children’s Integrated therapy team and be involved in developing policies based on best practice, evidence and positive outcomes for the Children’s Occupational Therapy team.&lt;/p&gt;\n&lt;p&gt;This job is for an OT who is enthusiastic and motivated with very good assessment, communication, organisational and time management skills. There is regular supervision, training and support from the area OT lead and peers. The work also involves supporting new members of staff, running clinical supervision groups and other responsibilities as required and commensurate with this banding.&lt;/p&gt;\n&lt;p&gt;There is a well-established appraisal system with an excellent commitment to staff training and development. All staff receive regular clinical supervision, access to a variety of CPD sessions with Clinical Leads, clinical and caseload discussions with senior colleagues.&lt;/p&gt;\n&lt;p&gt;Access to car or ability to travel between county-wide locations is essential.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Helen Wakeling&lt;/p&gt;\n&lt;p&gt;Job title: Lead Children&#39;s Community OT&lt;/p&gt;\n&lt;p&gt;Email address: helen.wakeling@oxfordhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07810881402&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Witney", "postalCode": "OX28 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7874", "longitude": "-1.48983"}}, "title": "Children&#39;s Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242109", "validThrough": "2020-11-08T23:59:59+0000"}