{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata per annum"}}, "datePosted": "2020-11-05T09:31:07+0000", "description": "&lt;p&gt;You will be required to be registered with the Health and Care Professions Council as a Practitioner Psychologist. The Trust is committed to providing support and supervision for continuing professional development and we have an excellent track record for developing our psychology workforce.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the service as we have just had a reorganisation of the community teams which staff are positive about.&lt;/p&gt;\n&lt;p&gt;The key roles for the post will include; direct work with clients, supervision of staff, being an active member of the leadership team with the team leader, advance nurse practitioner and consultant psychiatrist and taking a lead for one of the governed psychological therapies. In addition you will participate in team meetings and take an active role in supporting governance of the team.&lt;/p&gt;\n&lt;p&gt;Applicants need to be motivated, enthusiastic, flexible and resilient. You will need at least 3 years post qualification experience. Knowledge and experience of working with people with complex mental health issues is essential.&lt;/p&gt;\n&lt;p&gt;Team work is an important element of the job. You will need to demonstrate working effectively in a team and offering supervision to other professionals.&lt;/p&gt;\n&lt;p&gt;Qualification in or interest in training in a governed psychological therapy is important&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We provide excellent opportunities for peer support/supervision, CPD, teaching/training, and research and audit in line with strategic developments. There are also strong links to the local Hull and Teesside D Clin Psy Programme as well as the York St. Johns Doctorate in Counselling Psychology as we are key providers of academic and clinical experience components both in terms of teaching and supervision.&lt;/p&gt;\n&lt;p&gt;Psychologists and Psychological Therapists provide key leadership roles within the Trust. To support this we have developed leadership profiles for each psychology band and the profile card associated with this post is attached on NHS Jobs. You can find more information about the NHS Leadership Academy’s Healthcare Leadership Model and the profiles at their website. We encourage you to look at these resources as they will play a part in the interview process.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karen Flowerdew (Consultant Clinical Psychologist, Locality Lead for Psychological Therapies) karen.flowerdew@nhs.net 07981 901 785&lt;/p&gt;\n&lt;p&gt;Stepehen Bainbridge (Clinical Psychologist who works part time in the team) stephenbainbridge@nhs.net 07388 372972&lt;/p&gt;\n&lt;p&gt;Gary Matfin (CMHT Manager) gary.matfin@nhs.net 07584 594446&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Acomb Garth, York", "postalCode": "YO24 4LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9562", "longitude": "-1.12667"}}, "title": "Highly Specialist Applied Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257063", "validThrough": "2020-11-19T23:59:59+0000"}