{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 p.a. pro rata"}}, "datePosted": "2020-11-05T13:31:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Come Nurse with us…&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals NHS Foundation Trust is one of the largest teaching Trusts in the country. It comprises Addenbrooke’s Hospital and the Rosie Hospital. We provide accessible high-quality healthcare for the local people of Cambridge and regional and national specialist services. It’s a great place to nurse, work and live.&lt;br /&gt;&lt;br /&gt;You will work on a vibrant hospital campus with a friendly community feel; we have excellent facilities to practise your skills and abilities to support your career pathway and development. Our values of &lt;strong&gt;Together – Safe, Kind, Excellent&lt;/strong&gt; support the delivery of outstanding care. We have a fully electronic patient record system that is improving health-care quality; this is transforming services, improving patient safety and clinical outcomes.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;An exciting opportunity has arisen for an experienced Matron with extensive Reproductive Medicine clinical experience combined with a proven commercial experience to join the team at CIVF based in Trumpington, Cambridge. Our state of the art NHS fertility centre offers a full range of diagnostic and treatment techniques including EmbryoScope culture, a successful elective Freeze All Embryos program, 3D diagnostic ultrasound and Magnetic Activated Cell Sorting of sperm (MACS).&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;We offer high quality evidence based treatment at exceptional value via our Pure IVF and Multicycle IVF programs.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;This is without doubt one of the most forward thinking units in the UK and with a commitment to high level research and development coupled with links into existing local research groups within the Cambridge Biomedical Campus and beyond, this is a very exciting time to be joining our team.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;You will possess a BSc degree in Nursing or equivalent, a MSc in Medical Ultrasound (to include Early Pregnancy &amp; Gynaecology), Non-Medical Prescriber, proven commercial experience and have held a Management position within an IVF clinic. The position will require some out of hours work and working in our satellite units in Ipswich, Peterborough and Hinchingbrooke hospitals.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;/p&gt;\n&lt;p&gt;Closing date: 15 November 2020&lt;br /&gt;&lt;br /&gt;Interviews are due to be held in the week commencing 30 November 2020&lt;strong&gt;&lt;br /&gt;&lt;br /&gt;Why choose Cambridge University Hospitals?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our values and reputation for outstanding care&lt;/li&gt;\n&lt;li&gt;Opportunities to experience a range of specialities&lt;/li&gt;\n&lt;li&gt;Career and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship and mentoring programmes delivered by a dedicated clinical education support team&lt;/li&gt;\n&lt;li&gt;Research experience and opportunities&lt;/li&gt;\n&lt;li&gt;Lovely location and quality of life&lt;/li&gt;\n&lt;li&gt;Excellent schools/colleges and transport links (road, rail and air)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name:  Chris White&lt;br /&gt;Job title:  Service Lead&lt;br /&gt;Email address:  chris.white@addenbrookes.nhs.uk&lt;br /&gt;Telephone number:  01223 349010&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division E, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Matron - Cambridge IVF", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257876", "validThrough": "2020-11-15T23:59:59+0000"}