{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34225", "minValue": "34225", "unitText": "YEAR", "value": "£20.36 per hour inclusive of HCAS"}}, "datePosted": "2020-10-27T10:45:48+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NEUROSCIENCES DIRECTORATE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wolfson outpatient cognitive rehabilitation service. (Queen Mary’s Hospital, Roehampton)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 WTE BANK Band 6 SPECIALIST OCCUPATIONAL THERAPIST (Full and part time opportunities available) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St George&#39;s University Hospitals NHS Foundation Trust is one of the country&#39;s leading teaching hospitals with an international reputation for patient care, education and research. As one of only four Major Trauma Centres in London St. George’s works as part of the South West London and Surrey Trauma network. St George’s is also recognised as a leading provider of stroke services which includes a regional Hyper Acute Stroke Unit, Stroke Unit and TIA service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Due to current developments an opportunity has arisen to employ a Bank Band 6 Occupational Therapist within the Wolfson Outpatient Cognitive Rehabilitation Service. The post offers the opportunity to continue to develop clinical specialist skills in the area of intensive cognitive rehabilitation, including group and individual sessions. The post is based at the Wolfson neurorehabilitation Centre at Queen Mary’s Hospital in Roehampton.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post is suitable for an experienced Occupational Therapist who is dynamic and flexible, with a commitment to new ways of working and has an innovative approach to patient centred care. The successful post holder will work closely with the multidisciplinary team and will be responsible for ensuring a high quality OT service within the Wolfson Outpatient Cognitive Neurorehabilitation Service at Queen Mary’s Hospital, Roehampton. The service delivers detailed cognitive MDT assessment, intensive day patient intervention, vocational rehabilitation and more recently development of a post-covid pathway.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information and enquiries, please contact Sarah Porter, Principal Occupational Therapist by email on sarah.porter@stgeorges.nhs.uk.sarah.porter@stgeorges.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah PorterJob titlePrincipal Occupational TherapistEmail addresssarah.porter@stgeorges.nhs.ukTelephone number020 8487 6358&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wolfson Neurorehabilitation Centre, Queen Mary&#39;s Hospital, Roehampton", "postalCode": "SW15 5PN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4555", "longitude": "-.241721"}}, "title": "BANK SPECIALIST OCCUPATIONAL THERAPIST", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244066", "validThrough": "2020-11-09T23:59:59+0000"}