{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inc"}}, "datePosted": "2020-11-05T15:31:20+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Access Child and Youth Mental Health Service is a multi-disciplinary service, developed as a partnership between the Trust and the Local Authority in Wandsworth. The Access CAMHS Service receives and screens referrals within Wandsworth of children and young people aged 5-18 experiencing a range of mental health, neurodevelopmental and emotional difficulties.&lt;/p&gt;\n&lt;p&gt;Clinicians provide screening telephone, e-consultation and face to face mental health assessments and brief family interventions, and signpost to other services for further support if appropriate. The service also operates a triage and duty rota to screen new referrals and to manage risk. There is also a Child-Wellbeing Practitioner (CWP) service attached to the team, which offers Guided Self-Help (GSH) to young people and parents.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a clinician who is keen to develop their assessment skills with children and young people. The post holder will be working within the Assessment arm of the service, providing screening telephone, e-consultation and face to face assessments to young people and their families who are referred to the service and signposting to relevant services if needed.&lt;/p&gt;\n&lt;p&gt;The candidate will also join the triage and duty arm of the service, to process new referrals and make initial contact with young people and families to understand their concerns and develop collaborative care plans.&lt;/p&gt;\n&lt;p&gt;The post-holder will also need to work alongside other team members and to liaise with multi-agency professionals as needed.&lt;/p&gt;\n&lt;p&gt;We seek clinicians with:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualifications and registration recognised in the UK:\n&lt;ul&gt;\n&lt;li&gt;For a Clinical or Counselling Psychologist HCPC registration is required&lt;/li&gt;\n&lt;li&gt;For any other professional such as a clinical nurse specialist, Social worker or occupational therapist, an additional qualification is required like an Msc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Sound risk management practices&lt;/li&gt;\n&lt;li&gt;Good experience of working in child mental health&lt;/li&gt;\n&lt;li&gt;Good ability to engage young people and families&lt;/li&gt;\n&lt;li&gt;Excellent organisational and IT skills&lt;/li&gt;\n&lt;li&gt;Strong personal skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Access team is located Harewood House, Springfield University Hospital, Tooting, SW17 7DJ&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located within the impressive grounds of Springfield University Hospital in Tooting and we also operate in nearly 100 other locations throughout the UK. This is easily accessible via the Northern Line (Tooting Bec Station) and via private transport. The Trust provides subsidised parking fares for all our substantive staff. Our main site is located immediately next to Tooting High Street where staff can easily access a range of shops, cafés, restaurants etc.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Clara Masuku, Service Manager&lt;/p&gt;\n&lt;p&gt;Telephone number 020 3513 6631/07814298565&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, London", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "CAMHS Mental Health Therapist - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258343", "validThrough": "2020-11-12T23:59:59+0000"}