{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inc"}}, "datePosted": "2020-11-03T12:01:13+0000", "description": "&lt;p&gt;We are seeking to appoint a highly motivated, innovative and enthusiastic haemoglobinopathy community specialist nurse with acute and community care experience to join the red cell team. The Haemoglobinopathy service offers specialist care for adults and children with red cell conditions, primarily sickle cell disease and thalassaemia. You would work with a wide range of professionals both within and outside of Haemoglobinopathies including Midwives, General practitioners, community nurse specialists, health visitors, school nurses and other relevant key stake holders in ensuring that the service provision is of high quality, and in line with the standards set by external regulatory bodies.&lt;/p&gt;\n&lt;p&gt;The post holder would offer support to residents of Tower Hamlets with inherited haemoglobin disorders. In addition the post holder will be expected to provide sickle cell and thalassaemia antenatal screening and counselling of couples, and provide support to families affected by the birth of a newborn with a red cell disorder. This would usually include home visits, and referring affected babies for follow up care. You would also participate in haemoglobinopathy workshops and midwifery teaching programmes. You are expected to have excellent communication and time management skills, and to work effectively within the team. You will be expected to meet deadlines for data collection required for reporting to Public Health England as part of t the antenatal and newborn screening programmes.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name:Edna Koomson&lt;/p&gt;\n&lt;p&gt;Job title:Haematology Day Unit Matron&lt;/p&gt;\n&lt;p&gt;Email address edna.koomson@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 02035940000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal London Hospital, London", "postalCode": "E1 1BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.519", "longitude": "-.058048"}}, "title": "Haemoglobinopathy Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253865", "validThrough": "2020-11-17T23:59:59+0000"}