{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa inc HCAS"}}, "datePosted": "2020-10-28T17:15:53+0000", "description": "&lt;p&gt;Sutton Health and Care is an innovative partnership of providers working across Sutton (GP Federation; Local Authority; Mental Health Trust and Acute Trust) to provide integrated services for the local community. As partners we have the exciting opportunity to put the shared vision for how health and care can be delivered into reality through the implementation of a service model for the provision of community services (adult and children) that truly integrates health and care, physical and mental health and primary and acute care.&lt;/p&gt;\n&lt;p&gt;We are committed to working with each other and commissioners to co-create a model which when implemented will transform the experience of the people who use services in Sutton and fit the vision of the Sutton Health and Care Plan and the national NHS Long Term Plan.&lt;/p&gt;\n&lt;p&gt;We firmly believe that the partnership will drive transformational change to the benefit of patients and the local health and care system, getting the system to deliver better person-centred outcomes and financial sustainability.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 Specialist Physiotherapist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic Physiotherapist of the Sutton Health and Care Domiciliary Physiotherapy service. You will be part of the community team that offers Physiotherapy to house bound patients. You will be working as part of the wider Home First MDT team that helps to prevent admission from community, accelerate discharge from emergency department and acute medical wards and provide supported discharge through bed and home based intermediate care. We are innovative and people focused with a &#39;one team&#39; ethos, which means better quality and more joined up care for our patients and families. The team strives to constantly improve service delivery and contributions from all staff are highly valued. We will provide professional development opportunities and support you to provide great care to our patients.&lt;/p&gt;\n&lt;p&gt;If you meet the required person specification criteria and have the appropriate clinical skills, together with commitment, energy and experience then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Binu Cherian –Head of Adult Interface Services, 07770 684 846, binu.cherian@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Eka Udoetuk , Highly Specialist Physiotherapist, 07393792106, Eka.udoetuk@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community, Sutton", "postalCode": "SM1 2RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.363", "longitude": "-.19693"}}, "title": "Band 6 Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247481", "validThrough": "2020-11-11T23:59:59+0000"}