{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata)"}}, "datePosted": "2020-10-23T09:50:23+0100", "description": "&lt;p&gt;&lt;span&gt;At Worcestershire Acute Hospitals NHS trust our Occupational Therapy service is recognised for its high quality patient care. We are excited to announce that we have the opportunity for &lt;strong&gt;Band 6s&lt;/strong&gt; to join our service, supporting the Trauma and Orthopaedics team at Worcester Royal Hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;These posts support our vision of a highly skilled, experienced, dynamic and flexible workforce that has knowledge and skills in delivering modernised Occupational Therapy, focusing on providing acute assessments of Trauma patients; this involves a variety of conditions including neck of femur, traumatic head injury and poly trauma cases. The variety of assessments facilitates compliance of post-surgery guidelines and to maximise functional independence. There is opportunity to develop clinical reasoning and practice in this area.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;One of our Service&#39;s top priorities is nurturing the next generation of leaders and supporting all those with capability and ambition to reach the most senior levels of the service. This post will allow us to play an essential role through creative leadership and practice, by delivering modernised Occupational Therapy and developing solutions for effective patient flow.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We are looking for highly motivated practitioners that will be able to demonstrate safe, patient centred approach to care, under pinned by sound clinical knowledge in evidence based assessment and management of a variety of Trauma conditions. We are looking for self-motivated practitioners with excellent communication skills and the ability to work autonomously. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will be working with and supported by a very skilled work force and expected to work within a multi professional environment. Staff will be nurtured and developed by a Band 7 Clinical Specialist and 8a Trauma and Orthopaedics Clinical Strategic Lead. The expert Clinical Strategic Lead will support and manage the Trauma and Orthopaedics team to enable them to deliver diagnostic and clinical care to patients with various Trauma and Orthopaedics presentations providing expert advice on any complex issues. The Clinical Strategic lead provides strong leadership in maintaining and improving all aspects of clinical governance, evidence based practice, quality assurance and to drive forward service developments.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will be expected to contribute to Bank holiday and 7 day working to ensure effective clinical delivery.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Please contact Beverley Phillips 8a Clinical Strategic Lead Occupational Therapist -Trauma and Orthopaedics, Tel 01905 760170 or email &lt;/span&gt;&lt;span&gt;beverley.phillips6@nhs.net&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcester Royal Hospital", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Trauma &amp; Orthopaedics Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239896", "validThrough": "2020-11-15T23:59:59+0000"}