{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-30T11:15:47+0000", "description": "&lt;p&gt;Service/Ward/Department Summary:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As part of the wider Older Peoples Mental Health Services an opportunity has arisen for a mental health support worker to join the Older Peoples Community Mental Health Liaison Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This award winning team is based at The Meadows within the borough of Stockport. The service provides a resource into a variety of settings to support a range of disciplines from health, social care and the third sector in order provide mental health liaison to meet the mental health needs of patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Role Summary:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The team is looking to recruit support workers with experience working in Mental Health Services. We will also consider applicants with limited mental health experience but who are willing to develop skills and participate in learning because of a special interest in the area of mental health.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Following a re-organisation of community and crisis services in the Stockport borough an exciting opportunity has arisen for Mental Health Support workers to work alongside qualified Mental Health Nurses to support the crisis tier in providing collaborative care for individuals who have developed or who are experiencing an exacerbation of mental health symptoms as a result of physical health or social change.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role includes providing timely mental health assessment, care planning and working effectively within a multi-agency team to prevent acute hospital admission and to ensure the individual’s mental health needs are supported effectively.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role is full time, over 7 days a week and hours of work are undertaken on a rotational basis.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As this is a new service under the Mental Health Liaison umbrella there will be an opportunity for development and engagement in establishing new working relationships and practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Key Responsibilities of the Post:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide support and promote recovery to older people who are experiencing mental health/psychological distress as a result of acute physical health or social change.&lt;/li&gt;\n&lt;li&gt;To assist the Liaison Team practitioners in assessment, planning, implementing and evaluating individual care plans.&lt;/li&gt;\n&lt;li&gt;To ensure that service users engage effectively with the agreed Plan of Care.&lt;/li&gt;\n&lt;li&gt;To work alongside colleagues within the Crisis Tier and establish a rapport.&lt;/li&gt;\n&lt;li&gt;To offer advice and support to non-mental health staff when dealing with patients with mental health problems.&lt;/li&gt;\n&lt;li&gt;Provide regular and practical support for service users and their carers in managing dignity and independence.&lt;/li&gt;\n&lt;li&gt;Promote a positive attitude to the care of service users.&lt;/li&gt;\n&lt;li&gt;Provide support with activities of daily living.&lt;/li&gt;\n&lt;li&gt;Provide information on health promotion/Health education.&lt;/li&gt;\n&lt;li&gt;Report on progress/ outcomes of care programmes to the rest of the team.&lt;/li&gt;\n&lt;li&gt;To have the service users’ needs at the fore at all times with an underpinning set of values and skills to promote independence and choice.&lt;/li&gt;\n&lt;li&gt;To maintain adequate records according to Trust Record Keeping Standards, entering appropriate details on the service users case notes as necessary.&lt;/li&gt;\n&lt;li&gt;To attend and actively participate in training sessions, team/care planning review meetings and supervision as appropriate.&lt;/li&gt;\n&lt;li&gt;To contribute to the ongoing development of the service and to actively participate in individual professional and personal development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To undertake such other duties as may be determined from time to time within the general scope of the post and to adhere to trust policy and procedures.Key Requirements of the Person Specification:&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Support Worker with experience of working with people who have a mental illness or a clear desire to work with this client group.&lt;/li&gt;\n&lt;li&gt;Evidence of experience relating to the care of older people or a clear desire to work with this client group.&lt;/li&gt;\n&lt;li&gt;Experience of working within inpatient, community or liaison settings.&lt;/li&gt;\n&lt;li&gt;Experience of supporting individuals with complex mental, physical and/or social needs.&lt;/li&gt;\n&lt;li&gt;Experience of working in multi-disciplinary teams.&lt;/li&gt;\n&lt;li&gt;Experience of identifying mental health conditions and understanding about associated risk issues.&lt;/li&gt;\n&lt;li&gt;Demonstrates effective written and verbal communication skills.&lt;/li&gt;\n&lt;li&gt;Willingness to undertake clinical supervision and to participate in team development and learning opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJanet ChallinorJob titleTeam ManagerEmail addressj.challinor@nhs.netTelephone number0161 716 4505 option 4&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Meadows, Stockport", "postalCode": "SK2 5EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3989", "longitude": "-2.121"}}, "title": "Community Mental Health Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249894", "validThrough": "2020-11-13T23:59:59+0000"}