{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890"}}, "datePosted": "2020-10-28T09:15:16+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Radiology Nurse, band 6. Fixed Term until May 2021&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We want you to come to NCIC, and stay at NCIC, because our success starts with you. All of our staff have been involved in developing our values. We believe that they make NCIC a better place for patients and staff alike.&lt;/p&gt;\n&lt;p&gt;Based in one of the most beautiful parts of the country, recently awarded World Heritage status, NCIC provides hospital and community health services to a half a million people. We’re responsible for delivering over 70 services across 15 main locations and we employ over 6500 members of staff. NCIC has two acute hospitals; the Cumberland Infirmary Carlisle (CIC) and the West Cumberland Hospital (WCH) in Whitehaven. NCIC NHS Foundation Trust is at a truly exciting time of transformation. Through our Trust Strategy we will achieve the delivery of safe, accessible, high quality and sustainable healthcare services in north Cumbria for the next generation.&lt;/p&gt;\n&lt;p&gt;The Trust has had to rise to a number of challenges in recent years and is now on a rapid path of improvement. The Trust is committed to the long term development of a culture of continuous improvement as a way of working across all areas of the organisation to respond to changes in health care need and demand.  The post holder will be expected to be flexible and open to changes, to identify opportunities for improvement and to play an active role in developing, implementing and sustaining improvements to working practices and patient services.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated experienced, knowledgeable Interventional Radiology nurse with advanced practice that encompasses aspects of education, research and management but is firmly grounded in direct care provision and clinical work.&lt;/p&gt;\n&lt;p&gt;The successful candidate;                                              &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Will be able to work autonomously to manage their own caseload of patients within a defined specialist group; able to make high level decisions to meet the health needs of the patients who use our services and ensure that the standards of nursing and patient care are of high quality.&lt;/li&gt;\n&lt;li&gt;Will be working within a large multidisciplinary team providing specialist nursing support, education, healthcare liaison, and high quality care across the both acute sites of NCIC. You will provide both clinical and professional leadership to junior staff within the services in order to facilitate and improve clinical standards.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Is currently working as band 6 or has working experience as an Interventional Radiology or Diagnostic Imaging nurse&lt;/li&gt;\n&lt;li&gt;Has experience in a surgical setting (Ward, Day Surgery, Paediatric/Adult Recovery and Operating Theatre) or critical care setting&lt;/li&gt;\n&lt;li&gt;Experience of collaborative working with Consultant level medical staff and operational teams&lt;/li&gt;\n&lt;li&gt;Has relevant post registration course e.g. Radiology Nursing, Critical Care course, Pre-assessment course and Mentorship Course&lt;/li&gt;\n&lt;li&gt;Experience in conducting audits and helping implement change&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Department is currently operational on Monday to Friday but you may be required to participate in on-call duties as the service develops.&lt;/p&gt;\n&lt;p&gt;Healthcare Professionals returning to practice, moving into new roles or changing clinical environments, may access an agreed preceptorship period.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure that you document evidence of meeting all the essential criteria in the supporting information.&lt;/li&gt;\n&lt;li&gt;If sufficient response is received this post could be closed earlier than the specified closing date, please apply as soon as possible to ensure that your application is considered.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding adults and children therefore if the post is subject to the Rehabilitation of Offenders Act (ROA) 1974 (Exceptions) Order 1975 (as amended) the successful candidate(s) will be subject to a criminal records check with the Disclosure and Barring Service (DBS). The cost of the DBS must be met by the successful candidate(s) through salary deduction. DBS charges are as follows &lt;strong&gt;if applicable to the post:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Standard Check: £26 + Administration cost of £4.20 = deducted at £10.20 from 1st month salary and £10 deducted from salary over following 2 months.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Enhanced Check: £44 + administration cost of £4.20 = £15.20 deducted from 1st month salary and £11 deducted from salary over following 3 months.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As part of the one of the largest employers in the UK NCIC future employees will have also access to the following benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A lease car may be available for this position; further details will be provided upon appointment if applicable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;27 day holiday scheme rising to 33 after 10 years&lt;/p&gt;\n&lt;p&gt;Flexible working Scheme&lt;/p&gt;\n&lt;p&gt;Excellent opportunities for development&lt;/p&gt;\n&lt;p&gt;Competitive NHS Pension scheme&lt;/p&gt;\n&lt;p&gt;Access to NHS discounts with retailers and leisure companies&lt;/p&gt;\n&lt;p&gt;EAP (Employee Assistance Programme) a free, confidential counselling and information service to assist with personal or work-related problems&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;These schemes are subject to availability&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cumberland Infirmary, Carlisle", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Radiology Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245785", "validThrough": "2020-11-18T23:59:59+0000"}