{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15600", "minValue": "15600", "unitText": "YEAR", "value": "15,600"}}, "datePosted": "2020-10-30T19:50:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Description: Deputy Reception Manager (General Practice)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be part of our forward thinking team and share our vision, willingness and drive to adapt to changes within the NHS. You will assist the GPs and other healthcare professionals in the service delivery and management of patients.&lt;/p&gt;\n&lt;p&gt;You will help lead a team of receptionists to ensure they are fully supported and can deliver the best possible service to both patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; Help lead a team of receptionists to ensure each patient receives the highest quality of care, consideration and compassion when contacting the practice.&lt;/p&gt;\n&lt;p&gt; Streamline processes to ensure that the patient journey is both effective and efficient&lt;/p&gt;\n&lt;p&gt; Co-ordinate all the flows of work into the practice to ensure they are managed in a timely manner.&lt;/p&gt;\n&lt;p&gt; Provide first line manger support , supervision and development to the reception team in the reception managers absence.&lt;/p&gt;\n&lt;p&gt; Supervise team tasks and ensure tasks are allocated to the most appropriate person and resolved within the agreed time frame.&lt;/p&gt;\n&lt;p&gt; Provide hands on support to the reception team as and when required.&lt;/p&gt;\n&lt;p&gt; Be an effective problem solver and use initiative to solve the unexpected day to day issues.&lt;/p&gt;\n&lt;p&gt; Request resource for the team to ensure that the team is fully resourced and capable of carrying out its duties effectively.&lt;/p&gt;\n&lt;p&gt; Advise the reception manager of any anticipated operational issues&lt;/p&gt;\n&lt;p&gt; Be the first point of contact when a patient raises a concern about patient services&lt;/p&gt;\n&lt;p&gt; Help monitor, evaluate and manage GP appointment capacity and demand&lt;/p&gt;\n&lt;p&gt; Manage reception team rotas&lt;/p&gt;\n&lt;p&gt; Work with thePractice and Reception Manager on organisational development and change projects&lt;/p&gt;\n&lt;p&gt; Conduct team return to work interviews&lt;/p&gt;\n&lt;p&gt; Help support the recruitment and retention of staff&lt;/p&gt;\n&lt;p&gt; Ensure there is effective communication between the team and the wider practice team&lt;/p&gt;\n&lt;p&gt; Ensure the practice’s wider objectives are supported. E.g. Clinical quality indicators achieved&lt;/p&gt;\n&lt;p&gt; Attend meetings you are requested to attend&lt;/p&gt;\n&lt;p&gt; Support the practice in maintaining its Good CQC rating and strive towards an outstanding rating.&lt;/p&gt;\n&lt;p&gt; Any other fair and reasonable task requested by a superior manager or clinician&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Communication&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; Communicate effectively and in a polite and friendly way to patients, colleagues and visitors&lt;/p&gt;\n&lt;p&gt; Maintain a high standard of professional oral and written communication&lt;/p&gt;\n&lt;p&gt; Recognise people’s need for alternative methods of communication and respond accordingly&lt;/p&gt;\n&lt;p&gt; Listen and respond appropriately to feedback from patients and colleagues whether this be a complaint, comment or compliment and if it cannot be dealt with, ensure it is reported to the&lt;br /&gt;Operations Manager.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Personal and Professional Development&lt;/strong&gt;&lt;br /&gt;You are expected to participate in any training programme implemented by the Practice as part of this employment. Such training includes but it not limited to:&lt;/p&gt;\n&lt;p&gt; Participation in an annual individual performance review. This includes taking responsibility for maintaining a record of own personal and/or professional development&lt;/p&gt;\n&lt;p&gt; Taking responsibility for own development, learning and performance&lt;/p&gt;\n&lt;p&gt; Demonstrate skills and activities to others who are undertaking similar work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Quality&lt;/strong&gt;&lt;br /&gt;You are expected to strive to maintain quality within the Practice and will:&lt;/p&gt;\n&lt;p&gt; Alert the Practice or Reception Manager to issues of quality and risk&lt;/p&gt;\n&lt;p&gt; Take proactive measures to minimise the risk of identified self-induced errors recurring&lt;/p&gt;\n&lt;p&gt; Assess own performance and take accountability for own actions&lt;/p&gt;\n&lt;p&gt; Contribute to the effectiveness of the team by reflecting on own and team activities and making suggestions on ways to improve and enhance the team’s performance.&lt;/p&gt;\n&lt;p&gt; Effectively manage own time, workload and resources.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality and Diversity&lt;/strong&gt;&lt;br /&gt;You are expected to support the equality, diversity and rights of patients, carers and colleagues by:&lt;/p&gt;\n&lt;p&gt; Acting in a way that recognises the importance of people’s rights and behaving in a way that is consistent with practice procedures, policies and current legislation&lt;/p&gt;\n&lt;p&gt; Respecting the privacy, dignity, needs and beliefs of patients, carers and colleagues&lt;/p&gt;\n&lt;p&gt; Behaving in a manner which is welcoming, fair, non-judgmental and respectful of individual differences&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Health, Safety and Security&lt;/strong&gt;&lt;br /&gt;You are expected to assist in promoting and maintaining your own own and others’ health, safety and security as defined in the Practice Health &amp; Safety Policy. This includes but is not limited to:&lt;/p&gt;\n&lt;p&gt; Using personal security systems within the workplace according to practice guidelines.&lt;/p&gt;\n&lt;p&gt; Identifying the risks involved in work activities and undertaking such activities in a way that manages those risks.&lt;/p&gt;\n&lt;p&gt; Be able to identify the risks to health of microbiological and chemical hazards within the working environment according to the Control of Substances Hazardous to Health.&lt;/p&gt;\n&lt;p&gt; Making effective use of training to update knowledge and skills.&lt;/p&gt;\n&lt;p&gt; Using appropriate infection control procedures and maintaining work areas in a tidy and safe way and free from hazards.&lt;/p&gt;\n&lt;p&gt; Reporting potential risks identified.&lt;/p&gt;\n&lt;p&gt; Know the general principles of first aid and resuscitation to be able to undertake initial actions as appropriate.&lt;/p&gt;\n&lt;p&gt;Benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;On-site parking&lt;/li&gt;\n&lt;li&gt;NHS discounts&lt;/li&gt;\n&lt;li&gt;30 hours per week&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;customer service experience: 2 years (Preferred)&lt;/li&gt;\n&lt;li&gt;/ Supervisory / Management: 1 year (Preferred)&lt;/li&gt;\n&lt;li&gt;Emis Web 1 year (Preferred)&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "High Wycombe", "postalCode": "HP14 4LG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6613", "longitude": "-.751108"}}, "title": "Deputy Reception Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251116", "validThrough": "2020-11-13T23:59:59+0000"}