{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 gross per annum"}}, "datePosted": "2020-11-02T17:35:54+0000", "description": "&lt;p&gt;I’m Sharon, Charge Nurse working in the LD Assessment and Treatment Team, based at Walker Close in Ipswich. I have worked here for 15 years and still love coming to work every day in this team, which wouldn’t exist without the combined energy, expertise and effort of my colleagues, providing care to a small group of vulnerable service users with complex needs. Are you a registered Mental Health Nurse or Learning Disability Nurse looking for a new challenge to support me and our service users through their journey to recovery?&lt;/p&gt;\n&lt;p&gt;The way we care for people with Learning Difficulties in Suffolk is changing at NSFT as we have recently benefited from £1.3 million of investment in our acute service. &lt;strong&gt;We are also investing in our staff and this post offers a welcome bonus of £3000*.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Learning Disability and Autism Specialist Service is not only being invested in financially, with a fresh approach to ideas and service delivery being supported by the Trust, we are confident our new model of care is the very best for the people we care for.&lt;/p&gt;\n&lt;p&gt;We invest heavily in training, provide first class support, promote collaborative teamwork and give everyone in our team the opportunities and resources to achieve their full potential. The teams are updating their Positive Behaviour Support skills with the British Institute for Learning Disability (BILD) and enjoy other training such as Makaton as part of a wide selection of subjects delivered at our monthly protected days. All staff are involved in a variety of Quality Improvement projects.&lt;/p&gt;\n&lt;p&gt;We are keen to benefit from your expertise and experience to help us develop a truly multi-disciplinary approach to patient care, in return for which we will enhance your nursing skills through career development programmes and a commitment to your continuing professional and career development.&lt;/p&gt;\n&lt;p&gt;The wards form part of the acute service for learning disability and autism, along with the Intensive Support Team (IST), who work with people in the community to prevent unnecessary hospital admissions or providing transitional support between services. The acute teams are part of a wider specialist service who all work closely together to create a seamless approach for the clients and their families. Staff can benefit from this close working relationship with the potential for rotational roles between teams.&lt;/p&gt;\n&lt;p&gt;We support flexible working within the team, to include opportunities for part-time, job-share and flexible working patterns.&lt;/p&gt;\n&lt;p&gt;Ipswich is the perfect commuter town with an excellent train service on the Norwich to London line. The town has a real city feel with a beautiful quay filled with bars and restaurants. If you always wanted to live near to the coast for those sunny days on sandy beaches, yet be a commuter distance from the Capital while doing the job you love - then this is the ideal role for you! Applications are welcome from people interested in full and part time hours.&lt;/p&gt;\n&lt;p&gt;This role is also open to Allied Health Professionals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Benefits included with this role are:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free car parking&lt;/li&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;a comprehensive in house &amp; external training programmes&lt;/li&gt;\n&lt;li&gt;career progression&lt;/li&gt;\n&lt;li&gt;starting annual leave of 27 days per annum increasing to 33 days pa based on length of service (plus paid bank holidays)&lt;/li&gt;\n&lt;li&gt;staff physiotherapy service&lt;/li&gt;\n&lt;li&gt;gym membership&lt;/li&gt;\n&lt;li&gt;NHS discounts and many more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;*This post attracts a recruitment premium of £3,000 (pro-rata for part time roles). This is a one off payment with half paid on appointment and half paid after the completion of a satisfactory probation period (6 months). The premium is taxable. Please note that should you leave employment, or choose to move to an alternative post within the Trust that does not attract this recruitment premium, you will be required to reimburse all or some it, as follows: 100% of the value of the premium in the first 12 months; 50% of the value of the premium in the period 12 months to 2 years following appointment. Please note this recruitment premium is for external nursing applicants only.&lt;/p&gt;\n&lt;p&gt;Here at NSFT we pride ourselves on being a welcoming, talented, friendly and supportive team who like nothing better than sharing their experiences and learning from each other.&lt;/p&gt;\n&lt;p&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/p&gt;\n&lt;p&gt;Interview dates are to be confirmed, candidates may only be given a minimum of 3 days’ notice, please note this date is provisional and may be subject to change. You will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/p&gt;\n&lt;p&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Becky Snelling or Susie Howlett on 01473 237028&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBecky SnellingJob titleCharge NurseEmail addressbecky.snelling@nsft.nhs.ukTelephone number01473 237028&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bungalow 2, Ipswich", "postalCode": "IP3 8LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0522", "longitude": "1.19717"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253027", "validThrough": "2020-11-15T23:59:59+0000"}