{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "140000", "minValue": "140000", "unitText": "YEAR", "value": "up to £140,000 per annum (pro rata)"}}, "datePosted": "2020-10-26T13:56:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you collaborative, caring and compassionate?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Do you want to lead and improve mental health services for a vulnerable population?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;HMP The Mount is a Category C men&#39;s prison, located on the outskirts of Bovingdon village in Hertfordshire, England.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are the Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;In return for the hard work you will…&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Receive an annual salary of up to £140,000 FTE per annum pro-rata - depending on experience, working 24 hours per week. (6 sessions)&lt;/p&gt;\n&lt;p&gt;You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays pro-rata, plus CPD and study leave. FTE equates to 40 hours per week.&lt;/p&gt;\n&lt;p&gt;Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt;Onsite benefits at HMP The Mount include access to an onsite gym, free parking and subsidised café/restaurant.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What will you be doing?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the Psychiatrist for HMP The Mount, you’ll provide dynamic leadership of the mental health profession across these services. You will be pivotal in engaging the mental health workforce to support the delivery of the organisation’s objectives, ensuring the provision of an effective high quality mental health workforce within the available resources.&lt;/p&gt;\n&lt;p&gt;As the Psychiatrist, you’ll support the Regional manager in shaping the policies and strategies for developing and modernising mental health practice across the sites in order to ensure high quality, safe and appropriate healthcare services for our patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Next steps&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by Alex Tigwell, the Internal Recruiter for this role.&lt;/p&gt;\n&lt;p&gt;The recruiter will submit your CV to the hiring manager and in turn Alex will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;More information&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The salary for this role is up to £140,000 FTE per annum pro-rata - dependent on experience, working 24 hours per week.&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hemel Hempstead", "postalCode": "HP3 0NZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7248", "longitude": "-.541331"}}, "title": "Clinical Psychologist - HMP The Mount", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242783", "validThrough": "2020-11-15T23:59:59+0000"}