{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-10-07T13:44:57+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Purpose &amp; Job Plan&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working Hours: Monday- Friday 9am-5pm / or part time cover, Ongoing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking to appoint a full time Consultant in Medicine for the Elderly. The appointee will support the existing team of experienced MFE consultants as we further develop a robust clinical service to provide excellent care for all frail patients across the Trust and to reach into the community.  The appointee will provide input to the acute inpatient geriatrics ward and to the acute frailty service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The consultant’s job plan is expected to comprise 10 Programmed Activities per week on average to be carried out on UCLH sites. The new post-holder will be expected to discuss and agree a detailed job plan including personal and professional objectives with the Clinical Director within three months of their start date; and the Consultant may be required to undertake a prospective diary exercise to inform this process.&lt;/p&gt;\n&lt;p&gt;The consultant’s job plan will comprise 7.5 PAs Direct Clinical Care and 2.5 PAs Supporting Professional Activities. The majority of the job plan - for programmed activities related to direct patient care - follows a team-based approach. The part of the job plan related to wider departmental activities, supporting professional activities and personal objectives is individually tailored.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;UCLH is committed to providing a 7-day consultant led service for all inpatient groups. The model for this has changed during the coronavirus outbreak but it is anticipated the post-holder will join colleagues in providing a weekend service for acute geriatrics or elderly inpatients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Inpatient ward work is supported by a team of junior doctors (2 specialist trainees, 1 trust grade registrar, 5 CMTs, 4 foundation year two doctors and 1 foundation year one who rotate between the inpatient areas) and specialist nurses for older people. The acute geriatric consultant is supported by junior doctors from the acute medical team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank Consultant in Medicine for the Elderly", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216726", "validThrough": "2020-11-30T23:59:59+0000"}