{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 Per Annum, Pro Rata"}}, "datePosted": "2020-10-30T15:45:53+0000", "description": "&lt;p&gt;Want to make an impact to our NHS – Well this is it!&lt;/p&gt;\n&lt;p&gt;Helping us project manage this once in a lifetime opportunity will be what really gets you fired up and raring to go. Your passion for transformation, organisation, sustainability, engagement and delivery will make the difference from just getting the job done to getting the job done on budget, within timescales and meeting all milestones all whilst ensuring our people are fully engaged in the process. We don’t want a passenger, we need a driver – we need you.&lt;/p&gt;\n&lt;p&gt;This is a collaboration between a number of NHS organisations and offers such a fabulous opportunity to work across them. Whilst Lancashire Teaching Hospitals NHS Foundation Trust (LTHT) are leading on the recruitment to this role, it’s very much a partnership with the University Hospitals of Morecambe Bay NHS Foundation Trust (UHMB) supported by our Clinical Commissioning Groups (CCGs) and the wider Integrated Care System (ICS). We have been successful in a bid for capital funding in the Health Infrastructure Programme (HIP2). A total of £10m has been allocated to our two Trusts to support development of the required business cases.&lt;/p&gt;\n&lt;p&gt;This isn’t a role for the feint hearted - you will be responsible for ensuring the digital workstream is aligned to the developing clinical models and the ICS digital strategy. The outcome of the programme is to achieve the best possible configuration of services across Lancashire and South Cumbria within available resources.&lt;/p&gt;\n&lt;p&gt;Describing it as an exciting, once in a lifetime opportunity for the people (patients, population and our workforce) of Lancashire and South Cumbria to design, develop and build the hospital(s) infrastructure and clinical models for the future feels like such an understatement. This is truly such an opportunity to be involved in such a ground-breaking, future proofing fundamental project that we want to shout it from the rooftops.&lt;/p&gt;\n&lt;p&gt;Whilst the flagship/output of the HIP2 programme will be hospital(s) infrastructure a programme of such complexity can only be successful via whole system input and transformation, you will be integral to leading the development of clinical service models across the Acute Trusts and the design of whole pathways.&lt;/p&gt;\n&lt;p&gt;You will be responsible for delivery of a digital strategy in support of the new ways of delivering services within the HIP2 programme. Working to the identified chair of the Digital Oversight Group and HIP2 Project Director you will be responsible for project managing the digital workstream to develop the digital element of the:&lt;/p&gt;\n&lt;p&gt;• Clinical case for change&lt;br /&gt;• Options appraisal&lt;br /&gt;• Business cases &lt;br /&gt;• Implementation plan&lt;/p&gt;\n&lt;p&gt;Also working across a range of projects reporting to executives as well as the HIP2 Project Director, in some areas you will lead work and in others will support and report. This is a complex environment and your significant experience to date will help you exercise judgement, leadership and ensure rational decision making on a daily basis.&lt;/p&gt;\n&lt;p&gt;You will use all the skills you have gleaned over years in project management and collaborative environments, supporting our clinicians in developing the future shape of health services in Lancashire and South Cumbria. We want you to bring your drive, enthusiasm and past experiences to manage a portfolio of clinical workstreams to a challenging timetable. Ideally we would like to talk to individuals with experience of large transformational change programmes across multiple health systems however the person with the right skills to manage people to deliver plans to very tight deadlines is also important.&lt;/p&gt;\n&lt;p&gt;So what’s in it for you? A once in a career opportunity to design the future of health services for a whole generation. Our HIP2 programme is a large, multi-million pound scheme unparalleled elsewhere. You will be joining a highly motivated, experienced and multi-disciplinary team from across the Lancashire and South Cumbria system. Working with such a team will provide personal development with the chance for you to hone existing skills and develop new ones.&lt;/p&gt;\n&lt;p&gt;Want to know more about our hospitals then follow us on Twitter (@LancsHosp and @UHMBT) and LinkedIn where you will be able to get an idea of who we are and all the things that make us so unique.&lt;/p&gt;\n&lt;p&gt;Interview Date: 4th December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJean WrightJob titleProject DirectorEmail addressjean.wright@lthtr.nhs.ukTelephone number07787417684Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It’s hard to cram it all into one advert, so if you are as excited by this programme as we are please get in touch by emailing our Project Director Jean Wright jean.wright@lthtr.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croston House Leyland, Preston", "postalCode": "PR26 6TU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7085", "longitude": "-2.6943"}}, "title": "Digital  Workstream Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250807", "validThrough": "2020-11-10T23:59:59+0000"}