{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25365", "minValue": "22987", "unitText": "YEAR", "value": "£22,987 to £25,365 pa inc HCAS"}}, "datePosted": "2020-10-21T11:45:20+0100", "description": "&lt;h1&gt;Adaptation Nurse Band 4 £21,892 - £24,157 per annum (plus 5% Higher Cost Living Payment)&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Are you interested in an Adaptation Nurse programme at Ashford and St Peter’s Hospitals NHS Foundation Trust, one of the UK’s top 40 NHS Trusts?&lt;/strong&gt;&lt;br /&gt;Ashford &amp; St Peter’s is the largest provider of acute hospital services in Surrey, serving a population of more than 380,000 people in the boroughs of Runnymede, Spelthorne, Woking and across Surrey. Our aim is to provide excellent experiences for our patients and staff. We will do this through compassionate, safe and excellent joined-up patient care. This demonstrates our ambition to join up care within our hospitals, and care into and out of hospital, emphasising our aim for excellence and putting patients at the centre of everything we do.&lt;br /&gt;If you are interested in applying, you should have completed your Nurse training overseas and be able to bring your enthusiasm and experience to our friendly and diverse nursing workforce. You will need to be eligible to register with the UK Nursing and Midwifery Council (NMC) which includes&lt;br /&gt;•Successfully passing the International English Language Test (IELTs) or Occupational English Test (OET) achieving the requirements set out by the NMC in all four components – reading, writing, speaking and listening&lt;br /&gt;•Have at least one year of practising as a registered nurse in your country of qualifying&lt;br /&gt;•Completing Part One of the Computer based Test of Competency&lt;br /&gt;•Permission to undertake Part Two Test of Competency Objective Structured Clinical Examination (OSCE)&lt;br /&gt;•If sponsorship is required to meet the requirements of a Tier 2 Visa application&lt;br /&gt;&lt;br /&gt;Further details on eligibility and costs can be found at the above the link. The Trust is able to cover the initial cost of the OSCE which will be reimbursed over the period of sponsorship.&lt;br /&gt;We welcome applicants from nurses currently overseas as well as nurses already in the UK. We are able to offer support to those looking for their first UK hospital experience, for example if you have been working in a nursing home we can provide the necessary training and support.&lt;br /&gt;The Trust is able to provide sponsorship and preparation training prior to the OSCE, as well as a thorough induction programme and ongoing career development and support. The Trust has supported a number of nurses through the OSCE and we are proud to have achieved a 100% pass rate for those that have joined the Trust in 2018 compared to the national average of 66%.&lt;br /&gt;Once successfully registered with the NMC you will then transfer to the role of band 5 staff nurse.&lt;br /&gt;We offer a range of staff benefits along with generous paid annual leave, NHS Pension Scheme.&lt;br /&gt;For further information or enquiries please contact Lisa Punter Lead Nurse for Workforce via email lisa.punter@nhs.net or telephone 01784 884276&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Adaptation Nurse - Band 4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236160", "validThrough": "2020-11-23T23:59:59+0000"}