{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22199", "minValue": "20771", "unitText": "YEAR", "value": "£20,771 - £22,199 pa inc HCAS pro rata"}}, "datePosted": "2020-10-29T12:15:44+0000", "description": "&lt;p&gt;We are looking for an enthusiastic, friendly , energetic, motivated with a &#39;can do&#39; attitude part-time housekeeping supervisor willing to work hard within a strong team. They will be required to provide a KEY service within the hospital for both staff and patients. The successful candidate will assist with all associated duties connected with the delivery of housekeeping services. They will deal with cleaning services in patients’ wards, clinical and non-clinical areas. The post-holder will be required to adhere to departmental standards and regulations. They will also act at all times in a manner that upholds the Trust’s values, working as part of a team to ensure efficiency and excellent customer care.&lt;/p&gt;\n&lt;p&gt;This is a challenging but rewarding job and would be ideally suited to a motivated team player. Supervisory experience is desirable along with a good level of English and maths. Knowledge of COSHH, BICs, Colour coding and infection control is also desirable though this is not essential, as full training will be given.&lt;/p&gt;\n&lt;p&gt;Shortlisted candidates will be invited to undertake a Maths and English test and formal interview.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role will not attract a visa please ensure you have the right to work in the UK before applying&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Frimley", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Housekeeping Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248271", "validThrough": "2020-11-12T23:59:59+0000"}