{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 gross per annum"}}, "datePosted": "2020-11-03T15:16:03+0000", "description": "&lt;p&gt;Is your passion working creatively with children and families? Looking for a role with flexible working opportunities?&lt;/p&gt;\n&lt;p&gt;We are excited to offer an opportunity to join our Crisis Assessment and Intensive Support Team (CAIST) as a Band 6 practitioner. The CAIST service has 3 teams based across Norfolk &amp; Waveney, CAIST currently offer an 08.00 to 20.00 service 7 days a week.&lt;/p&gt;\n&lt;p&gt;CAIST works with the wider Children Families Young People (CFYP) Core teams in Norfolk and Waveney, to provide specialist evidence based mental health interventions, for children/ young people under 18 in crisis. As a CAIST practitioner you will work with parents, children and partner agencies in both the statutory and voluntary sectors.&lt;/p&gt;\n&lt;p&gt;As part of this team, responsibilities would include taking part in a duty rota to assess mental state and risk, of children and young people at the local acute hospital or other safe community-based locations. The team offer community based intensive support to children/ young people and their families. CAIST aim to establish trusting therapeutic relationships, to reduce risks when children/ young people may be experiencing high levels of distress. The CAIST team work to help children and young people to avoid Tier 4 hospital admission, and when required to expedite safe and effective discharge.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to join an innovative and newly expanded service that is well thought of by commissioners and partner agencies alike. We are confident that being part of our small team, will assist you to be the practitioner you trained to be. You will be offered a full induction program, regular clinical and management supervision with opportunities to engage with post registration training.&lt;/p&gt;\n&lt;p&gt;The successful candidate will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hold a qualification and professional registration as either a nurse, social worker or occupational therapist.&lt;/li&gt;\n&lt;li&gt;Have some experience in working with young people and their families in high risk or crisis situations.&lt;/li&gt;\n&lt;li&gt;Be passionate about good quality services and outcomes for young people.&lt;/li&gt;\n&lt;li&gt;Be a skilled team player able to hold relationships within the team and with external agencies.&lt;/li&gt;\n&lt;li&gt;Be enthusiastic and flexible in their approach.&lt;/li&gt;\n&lt;li&gt;Interested and curious about the problems that young people face, and able to look at these in a broad and holistic way.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you would like to know more about the role click the job description, then click APPLY to start your candidate experience today!&lt;/p&gt;\n&lt;p&gt;We can offer you the full range of NHS benefits and in addition:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Financial support with relocation cost&lt;/li&gt;\n&lt;li&gt;Flexible working hours&lt;/li&gt;\n&lt;li&gt;Up to 307 hours holiday entitlement (subject to length of service)&lt;/li&gt;\n&lt;li&gt;FREE physio service&lt;/li&gt;\n&lt;li&gt;FREE Yoga and Pilate&lt;/li&gt;\n&lt;li&gt;Cycle scheme tax-free bikes and accessories&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Support with revalidation&lt;/li&gt;\n&lt;li&gt;Post graduate training opportunities&lt;/li&gt;\n&lt;li&gt;We will pay for your initial DBS check (excluding the annual update service charge of £13)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAl BaileyJob titleTransformation ManagerEmail addressal.bailey@nsft.nhs.ukTelephone number01603 272800&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Waveney, Norfolk", "postalCode": "NR6 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6596", "longitude": "1.25089"}}, "title": "CAIST Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254506", "validThrough": "2020-11-23T23:59:59+0000"}