{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50430", "minValue": "28577", "unitText": "YEAR", "value": "£17.00 - £30.00 per hour"}}, "datePosted": "2020-10-30T09:56:04+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your unfaltering dedication to quality is something you are very proud of; like us, you constantly strive to do things better for your patients. This ethos has led to you having a customer focused approach at all times when dealing with patients as part of a professional and compassionate team.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced Radiographer to join our Outstanding rated Hospital. As part of our friendly team you will do everything you can to ensure the patient’s treatment is of the highest standard.&lt;/p&gt;\n&lt;p&gt;Our focus at all times is on ensuring that our patients receive high quality treatment quickly, in clean and comfortable surroundings.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working as part of a welcoming and expert multi-disciplinary team supported by our experienced Diagnostic Imaging Manager, Fiona Nelson, to deliver clinically safe and high quality to patients.&lt;/p&gt;\n&lt;p&gt;You will be an HCPC registered Radiographer with MRI experience, recent post graduate experience and knowledge of current developments in radiographic techniques. It would be an advantage if you have experience in general radiography, theatre radiography, fluoroscopy and knowledge of cross-sectional imaging.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a bank team member you have flexibility to choose the shifts that work for you around your other commitments. When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. If you want to join our permanent team, we’ll support you. If you just want to stay as a bank practitioner, that’s fine too. We’ll help you be the best you can be.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded so we offer a competitive rates.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contact Sonia Sanghv&lt;strong&gt;i&lt;/strong&gt;in our friendly resourcing team.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidates but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shepton Mallet", "postalCode": "BA4 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1897", "longitude": "-2.56288"}}, "title": "Bank Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249563", "validThrough": "2020-11-27T23:59:59+0000"}