{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-20T15:15:23+0100", "description": "&lt;p&gt;&lt;strong&gt;Occupational Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Band 5 Occupational Therapistto be part of the newly developed Integrated Neighbourhood teams in Barnsley bringing community services together with general practice.&lt;/p&gt;\n&lt;p&gt;The Integrated Neighbourhood Team model has led to the development of 6 neighbourhoods teams across Barnsley, with the aim of improving outcomes for people and maximising access to services through integrated working. The Neighbourhood Teams aim to maintain people within their own homes/communities wherever possible and facilitate earlier discharge from hospital through delivering a more co-ordinated approach to care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We require a highly motivated Occupational Therapist to work within a multi professional team providing therapy input and high quality rehabilitation to people within their own homes and to rehabilitation beds within local care homes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be responsible for the assessment and provision of a specialised programme of rehabilitation, meeting the specific needs and agreed goals of your patients to facilitate their rehabilitation and optimise recovery potential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will work in close liaison with the wider MDT and other community therapy areas. The post holder will need to have good clinical, communication &amp; organisational skills and possess excellent time management skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There is a strong network of allied health professionals across the Trust with clear professional leadership and regular supervision within the profession. The Trust offers excellent opportunities for continuing development and training alongside specific In-Service training. We also have an active Band 5 support group.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The use of a vehicle to undertake any necessary travel in connection with the duties of the post is essential along with the ability to work flexibly including evenings, weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;If you are interested in this exciting new opportunity and would like an informal discussion regarding this role please contact Jane Illingworth 01226 644559 / jane.illingworth@swyt.nhs.uk or Lisa Lenton on 01226 644252 / lisa.lenton@swyt.nhs.uk&lt;/p&gt;\n&lt;p&gt;This vacancy may close early if sufficient applicants are received.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S70 6RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5465", "longitude": "-1.49729"}}, "title": "Rotational Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234946", "validThrough": "2020-11-11T23:59:59+0000"}