{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-09T14:15:36+0100", "description": "&lt;p&gt;&lt;strong&gt;The Rotherham NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;TB Nurse &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;TB Nursing Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 Hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent Contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an experienced nurse who is looking for the next challenge? Do you have an interest in public health nursing and a passion to work with a range of communities to improve health inequalities?&lt;/p&gt;\n&lt;p&gt;Rotherham Foundation trustTuberculosis(TB ) Nursing service is looking for a dynamic person for a new position as a Band6 Tuberculosis Nurse. We are looking for an experienced and enthusiastic, forward thinkingnurse for a diverse role in an established community TB service. You will need excellent communication skills and enjoy using your initiative and providing support to colleagues within the team. Full training and support will be provided for the right candidate.&lt;/p&gt;\n&lt;p&gt;The post holder will work in the community based TB service and will provide care across the Rotherham community predominantly working in patient’s homes. You will enjoy working with adults, young people and children from diverse communities and backgrounds, this includes those deemed to be from an underserved population. You will provide outpatient clinics, both in the community and hospital setting, working closely with other professionals as part of a multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;The TB service focus is about public health and the post holder will maintain an excellent knowledge of the physical aspects of the disease, the emotional, psychological and social impact on individuals, their families and friends. The rolewill involve contact tracing and screening, including mantoux testing, and supervision of treatment including directly observed therapy. The post holder will work closely with Public Health, developing relationships and present at Cohort Reviews. They will work closely with the acute respiratory physicians atRotherham Hospital andother trusts and demonstrate effective communication skills.&lt;/p&gt;\n&lt;p&gt;As this is a community post you must have a valid driving licence and access to an appropriate vehicle.&lt;/p&gt;\n&lt;p&gt;Please contact Tracy Turton - Service Lead if you have any questions:&lt;/p&gt;\n&lt;p&gt;traceyturton@nhs.net, 07818061525&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121484.png", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121484"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "TB Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916220588", "validThrough": "2020-11-06T23:59:59+0000"}