{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 - £53,459 inc 5% Fringe HCAS"}}, "datePosted": "2020-10-26T09:46:13+0000", "description": "&lt;p&gt;Surrey and Borders Partnership NHS Foundation Trust are looking for an innovative, motivated service manager to lead our well established Neurodevelopmental Service which covers Surrey, Hampshire and Portsmouth. Due to the locations of our service provision a car driver is essential, the main team base is in Epsom however consideration will be given to be located elsewhere in one of the exiting Trust Hubs. Reporting to the Associate Director of learning disabilities, the successful candidate will be responsible for overseeing developments, service performance and staff conduct within their portfolio.&lt;/p&gt;\n&lt;p&gt;The role provides an excellent career opportunity for someone keen to further develop their leadership and management skills, within quite a remarkable and highly skilled service.&lt;/p&gt;\n&lt;p&gt;You will work very closely with our commissioners in Surrey, Hampshire and Portsmouth ensure we are meeting the service specification and access to services is as smooth as possible and give people the best opportunity for diagnosis and treatment&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a minimum of 3 years of management experience, with evidence of working collaboratively with acute and primary care settings. The ability to build and maintain relationships with external peers is essential and requires a high level of confidence, professionalism and compassion.&lt;/p&gt;\n&lt;p&gt;The role is suitable for someone who has a passion for ensuring the development and delivery of high quality, accessible services and who enjoys leading and supporting staff to achieve their full potential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Jacqui Renfree, Associate Director on 01737 288800 or Raja Mukherjee, Consultant Psychiatrist, Clinical Lead Adult NDD on 01737 288813&lt;/p&gt;\n&lt;p&gt;Keywords: service manager, 8a, learning disability, ASD, ADHD, RNLD, RNMH, nurse, leadership, management, Neurodevelopmental, team&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom", "postalCode": "KT19 8PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3417", "longitude": "-.301644"}}, "title": "Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241894", "validThrough": "2020-11-12T23:59:59+0000"}