{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26970", "minValue": "24907", "unitText": "YEAR", "value": "£24,907/£26,970/£27,416/£30,615"}}, "datePosted": "2020-10-29T16:15:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Mental Health Nurse – Integrated Care Mental Health&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Band 5 Mental Health Nurse&lt;/p&gt;\n&lt;p&gt;Full time - 37.5 hours&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Not all Hero’s wear capes. Now more than ever, being a #NHSHero is something to be proud about. We’re currently looking for a &lt;strong&gt;Mental Health Nurse &lt;/strong&gt;&lt;/strong&gt;&lt;strong&gt;to join us.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We require an enthusiastic and motivated Mental Health Nurse with relevant post registration experience, to work within our Integrated Care Mental Health Team, which at present covers 33 Surgeries across Leicester City with plans to expand further in the coming months. ICMH provides a caring service to adults of all ages who have long term physical health conditions and co-existing mental health issues.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The team works alongside a variety of Health and Social Care Professionals including GPs, Practice Nurses, District Nurses, Specialist Nurses, Care Navigators, and also have established links with Adult Social Care, CMHTs and Memory Service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be an integral part of a small but expanding team which at present is made up of 1 x Band 7 RMN, 4 x Band 6 RMN&#39;s, 1 x Band 6 OT and 2 x Band 3 HCSWs.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You would need to demonstrate flexibility and a commitment to high standards of patient care. You should also demonstrate good assessment, risk assessment and communications skills and have the ability to work both alone and as part of a team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are a recognised learning Placement area and support both Nursing and Medical Students.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have a strong commitment to Supervision, training and regular appraisal, from which you will benefit.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An ability to be able to access a wide range of Community locations without relying on public transport is essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IT IS HIGHLY RECOMMENDED THAT IF YOU ARE INTERESTED IN THIS POST, PLEASE ARRANGE AN INFORMAL VISIT PRIOR TO INTERVIEW. THIS WILL HELP GIVE YOU AN IMPROVED INSIGHT INTO BOTH THE ROLE AND THE SERVICE.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that due to COVID 19, interviews will be done via Microsoft Teams. You will need to download this on to your laptop, computer or smart phone. Applicants who are invited for Interview will be sent an invite via Email one week before the interview date.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information, please contact either of the following:-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;David Shephard (Team Lead) - 07881625043&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Samantha Manley (Deputy Team Lead)07464644720&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Or ring the team base on 0116 2256779&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield Road, Leicester", "postalCode": "LE2 3BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6174", "longitude": "-1.11278"}}, "title": "Band 5 Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249039", "validThrough": "2020-11-10T23:59:59+0000"}