{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-27T13:45:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Organisational Development Practitioner - 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a specialist Learning &amp; Development role with responsibility for delivering learning and development activities across the Trust. The post holder will ensure the effective and efficient delivery of various training modules and programmes. This will involve the planning, preparation, procurement or delivery, assessment and evaluation of face to face training and facilitation, of both large and small groups of staff. It is expected that a significant proportion of post holder’s time will be allocated face to face delivery.&lt;/p&gt;\n&lt;p&gt;It is desirable that the post holder will have a good working knowledge of the apprenticeship levy, apprenticeship standards and employer provider status in the delivery of apprenticeships. In addition to substantial experience performing a leadership and/or management trainer role delivering leadership and / or management development. A proven track record in delivery of teaching, assessing, evaluating and adapting a wide range of programmes including ability to engage and adapt associated learning and development methodologies as required.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaymo JammehJob titleOrganisational Development ManagerEmail addresskaymo.jammeh@stockport.nhs.ukTelephone number01614194881&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pinewood House, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Organisational Development Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244782", "validThrough": "2020-11-15T23:59:59+0000"}