{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20000", "minValue": "20000", "unitText": "YEAR", "value": "Up to £20,000 depending on experience"}}, "datePosted": "2020-10-30T10:12:13+0000", "description": "&lt;p&gt;&lt;strong&gt;TSSU Sterile Services Technician | Theatre | Up to £20,000 depending on experience | Band 3 equivalent | Flexible hours – no nights&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Harpenden has an exciting and rewarding full time opportunity for an experienced Technician to join their Sterile Services Department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Harpenden Hospital offers comprehensive private hospital services in a comfortable and relaxed environment to patients from London and its northern counties - Hertfordshire, Bedfordshire and Buckinghamshire. As the largest employer in Harpenden, the hospital prides itself in offering excellence in clinical quality, customer service and cleanliness. We have 5 state of the art Theatres and modern Surgical and Day Care Wards covering all major surgery, orthopaedics, gynaecology, plastics and medical patients amongst others.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working as a part of team of sterile services technicians responsible for sterilizing all of the theatre instruments&lt;/li&gt;\n&lt;li&gt;Accurately checking back into the department instruments which have been used in patient operations&lt;/li&gt;\n&lt;li&gt;Decontamination, inspection, assembly, packing, sterilization and distribution of instruments&lt;/li&gt;\n&lt;li&gt;Undertake SSD routine tasks related to individual’s health and well being&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will hold a user course in sterile /decontamination services&lt;/li&gt;\n&lt;li&gt;Have experience in a Sterilisation or Decontamination unit&lt;/li&gt;\n&lt;li&gt;Good communication and interpersonal skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please email Sherine Lowes at sherine.lowers@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us,&lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harpenden", "postalCode": "AL5 4BP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8281", "longitude": "-.360368"}}, "title": "TSSU Sterile Services Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249648", "validThrough": "2020-11-30T23:59:59+0000"}