{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa (pro rata)"}}, "datePosted": "2020-11-04T16:15:23+0000", "description": "&lt;p&gt;&lt;span&gt;Are you a SCPHN School Nurse or Health Visitor who is looking for a new challenge; who strives to make a difference; who wants to be part of a great team? If your answer is a resounding YES then this is definitely the opportunity for you. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our 0-19 Public Health Integrated Nursing Service has a strong focus on our ‘amazing everyday’ staff as they make a real difference in improving the outcomes of children, young people and families in Leeds. Yes we have targets to meet - which we balance within an ethos of delivering the best possible care we can. Our practitioners are compassionate, they make strong friendships and connections; are forward thinking and innovative. They believe in a quality driven service – if you do too we would love you to work with us and make our ‘amazing’ service even better. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The COVID pandemic has brought its challenges yet has also offered us positive development opportunities to shape our service for the future. We are proud of our many achievements. These are too many to mention but include our: accreditation with the UNICEF Baby Friendly Gold Award; the ChatHealth anonymous texting service for 11-19 year olds: our virtual groups such as PBB and HENRY; Virtual well baby clinics; development of digital platforms to enhance our ways of working with children, young people and their families; evidence based pathways and interventions; Early Attachment Observations and Enquiry questions; School Readiness work; ACES work in identifying risk and vulnerability in everyday practice; Engagement with parents and young people in service design; integrated work with Children’s Centres, Healthy Schools and other key stakeholders in the city – we could go on… &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;When you join us you will have many development opportunities starting with a thorough and comprehensive induction and preceptorship programme, service wide 0-19 training, protected time for Clinical and Child Protection supervision, support through the revalidation process and the opportunity to become a lead in key aspects of service delivery. As we strive to meet the needs of all children across the 0-19 age range we are offering opportunities for practitioners to complete the differing field module – which involves training in the alternative field of School Nursing or Health Visiting. Practitioners currently completing the training have stated this is “A fantastic and challenging opportunity to widen my thinking and learn new skills&quot;. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are looking for a better work life balance - we can offer you flexible and agile working options - with a number of touchdown spaces available across the city to support you in your daily work. Primarily you will work within one 0-19 team, however you may be required to work with other 0-19 teams across the city to ensure equitable service delivery. Our core service hours are Monday to Friday 8.30 to 5pm with some aspects of service delivery being available from 8am to 8pm, to enable increased accessibility to the service for all our families. Take a look at our Website and Facebook page: 019PublicHealthIntegratedNursing / leedscommunityhealthcare. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Why wouldn’t you want to join us and be a crucial part of driving forward improved outcomes to meet the needs of children and young people in Leeds? Press apply now!&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122058.jpg", "name": "(CS) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122058"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS6 1PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8149", "longitude": "-1.56836"}}, "title": "0-19 Specialist Public Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256575", "validThrough": "2020-11-19T23:59:59+0000"}