{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-26T10:01:14+0000", "description": "&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having a ‘Good’ rating overall, being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Mental Health Team in our latest CQC inspection, which found that: ‘Managers across Berkshire Healthcare promoted a positive culture that supported and valued staff, creating a sense of common purpose based on shared values.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Team Leader will be a Community Specialist Practitioner who is able to direct and support staff in their clinical roles to promote a service which prevents inappropriate or unscheduled hospital admissions and facilitates timely discharge.&lt;/p&gt;\n&lt;p&gt;The Team Leader will also be responsible for all aspects of the leadership, development and management of designated teams of nurses. They will ensure high quality evidence based care is delivered to patients, their families and carers in the Community. The Team Leader will be proactive in promoting a positive image of Community Nursing, working closely with the organisation, integrated teams, key stakeholders and partners. They will promote a service which works within local and national directives&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call Sam McEndoo on &lt;strong&gt;07867800961 &lt;/strong&gt;or email: Samantha.Mcendoo@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to a car salary sacrifice scheme (available to all permanent staff over the age of 21), support with childcare and, as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSam McEndooEmail addresssamantha.mcendoo@berkshire.nhs.ukTelephone number07867 800961&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading, Berkshire", "postalCode": "RG1 8NQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4634", "longitude": "-.98216"}}, "title": "Community Nursing Team Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241939", "validThrough": "2020-11-23T23:59:59+0000"}