{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £30,401 - £37,267 p.a. (pro rata"}}, "datePosted": "2020-11-02T13:01:46+0000", "description": "&lt;p&gt;Macmillan Acute Oncology/Cancer of Unknown Primary Associate Nurse Specialist&lt;/p&gt;\n&lt;p&gt;Band 6, Full time- 37.5 hours, 12 month fixed term or secondment&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;An exciting opportunity has arisen at Wythenshawe Hospital, Manchester University NHS Foundation Trust (MFT) for a Macmillan Acute Oncology (AO)/Cancer of Unknown Primary (CUP) Associate Nurse Specialist to cover Maternity leave. The service is a 7 day service delivery model, with extended hours of working (8am-6pm) Monday-Friday.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holder will be part of the Macmillan Acute Oncology Team, facilitating timely care of patients presenting with acute oncology problems, including prompt recognition and treatment and early discharge in line with national quality indicators. They will support the coordination of rapid referrals onto other cancer specialities.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;They will support the identification of patients with CUP or Malignancy of Unknown Origin (MUO) and ensure these patients are presented at CUP MDT, in line with local Network guidelines and policy.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Additionally, the Macmillan AO/CUP Associate Nurse Specialist will participate in audit and research, and provide teaching and education to healthcare professionals within Wythenshawe Hospital on AO medical emergencies and care and raising the profile of CUP. They will support the representation of the Trust as required at local and national levels in relation to the AO and CUP agendas.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for enthusiastic individuals who will support the development of the AO/CUP service. They will need excellent communication skills and have experience of caring for people with cancer, chemotherapy experience is an advantage for this role.&lt;br /&gt;NHS and cancer nursing experience is essential for the band 6 post however competency-based training will be offered for the post.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJeena MathewAdditional contact information&lt;/p&gt;\n&lt;p&gt;Jeena Mathew, Macmillan AO/CUP CNS, Team Leader, 0161 291 2582 jeena.mathew@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Emily Unwin , Macmillan AO/CUP CNS, 0161 291 2582 emily.unwin@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Kath Hewitt Thoracic Oncology &amp; Surgery Matron kath.hewitt@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Hospital, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Macmillan Acute Oncology/Cancer of Unknown Primary Associate Nurse Sp", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252154", "validThrough": "2020-11-17T23:59:59+0000"}