{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa plus HCAS"}}, "datePosted": "2020-11-04T18:00:23+0000", "description": "&lt;p&gt;Job Title: CAMHS Children’s Wellbeing Practitioner (CWP) Supervisor / Service Development Lead&lt;br /&gt;Department: Ealing SAFE, Community CAMHS Team&lt;br /&gt;Band: 8a&lt;br /&gt;Term: 1 year fixed term&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Following a further successful bid to train Children’s Wellbeing Practitioners in West London NHS Trust, we are looking to recruit another CAMHS CWP Supervisor / Service Development Lead. This is an exciting time to join a large and dynamic new workforce in West London NHS Trust CAMHS. We offer high quality supervision, with excellent CPD and career development opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This newly appointed person will be responsible for the management and intensive supervision of the new cohort 6 trainee Children’s Wellbeing Practitioners (CWPs) who will be working as an integral part of Ealing SAFE Community CAMHS Team. This will include the coordination and appropriate delegation of work and necessary support within and between services, teams and projects.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The training the CWPs will receive will enable them to deliver - under intensive supervision - high quality brief, focused and evidence-based therapeutic interventions for children and young people experiencing mild to moderate mental health difficulties (low mood, self, anxiety and behavioural difficulties). This in turn will equip those in post to operate effectively in an inclusive, value driven mental health service.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This will be an exciting and varied role working as part of a supportive multidisciplinary team. It is a great opportunity to gain approved training and influence service developments in children and young people’s mental health services.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Applicants for these posts MUST complete an application for the training course at the same time as applying to West London Mental Health NHS Trust. Applications should be made through the KCL online portal. All the details on how to apply to KCL are contained within the attached information sheet about the university application process.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Applications to the programme will be reviewed against the following criteria:&lt;br /&gt;• Normally a minimum of a second-class Bachelor’s degree from a UK university or an overseas qualification of an equivalent standard in a relevant subject (e.g. psychology)&lt;br /&gt;• Candidates will need to have a minimum of 4 years professional experience in a CAMHS (or equivalent) setting and two years of experience supervising.&lt;br /&gt;• The course will consider candidates who do not meet these criteria on a case by case basis, please contact cyp-iapt@kcl.ac.uk to discuss. • If your education has not been conducted in the English language, you will be expected to demonstrate evidence of an adequate level of English proficiency.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The English language requirement for this programme is ‘Band D’.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The interviews are being held remotely via Microsoft Teams on 18th November 2020.&lt;br /&gt;Who to contact for further information and informal visits: Dr Ben Aveyard, Professional Lead for CAMHS Psychological Wellbeing Practitioners (07966 224 246).&lt;/p&gt;\n&lt;p&gt;We reserve the right to close adverts prior to the closing date stated should we receive a high volume of applications.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We will be requesting references. Please ensure you include email addresses and contact numbers for your referees which MUST be at supervisory or managerial capacity covering the last 3 years of employment to date to avoid delay in the recruitment process. If your current/most recent organisation is an NHS trust, we will be requesting one reference from your current line manager/HR department.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are keen to ensure that our workforce reflects the community it serves, particularly in terms of ethnicity, gender, disability and experience of mental illness.&lt;br /&gt;West London NHS Trust is committed to safeguarding all children and vulnerable adults and expects all staff and volunteers to share this commitment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Ben AveyardJob titleProfessional Lead for CAMHS Psychological WellbeingTelephone number07966 224 246Additional contact information&lt;/p&gt;\n&lt;p&gt;Flu vaccination – what we expect from our staff&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;At West London we look after patients who are vulnerable. Each year, seasonal flu affects thousands of people in the UK. Occurring mainly in winter, it is an infectious respiratory disease capable of producing symptoms ranging from those similar to the common cold, through to the very severe or even fatal disease.&lt;/p&gt;\n&lt;p&gt;The wellbeing of our staff and patients is of the utmost importance to us, and it is the expectation of the Trust that all patient-facing staff have an annual flu vaccination, provided free of charge by the Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Childrens IAPT Wave 4, Hounslow", "postalCode": "TW3 3EL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4683", "longitude": "-.371733"}}, "title": "CAMHS CWP Supervisor/Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256848", "validThrough": "2020-11-11T23:59:59+0000"}