{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-21T13:31:00+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a highly motivated, enthusiastic qualified nurse to join SWBH as part of the endoscopy workforce.&lt;/p&gt;\n&lt;p&gt;We are a busy inner city unit, working across Sandwell and City hospital; serving the local area. In 2022 the new Midland Metropolitan Hospital will open to support the expansion of our service and needs of our patients.&lt;/p&gt;\n&lt;p&gt;You will need to have excellent communication skills, and be able to work as part of the endoscopy MDT, alongside HCAs, Nurse Associates, Nurse Endoscopists, and Consultants from various specialities. You will need to be able to work flexibly and participate in an out of hour’s emergency service. This post is for a full time and staff nurse, working 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;This post offers an opportunity to develop knowledge of endoscopy procedures, and pre and post procedure delivery with outpatients and inpatients. Previous endoscopy nursing would be advantageous, but is not essential as training is given. Successful applicants will be supported to achieve endoscopy nurse competencies, which cover admission and recovery process, diagnostic and therapeutic procedures and delivery of high quality care to patients. If newly qualified; staff nurses are supported through our trusts preceptorship programme.&lt;/p&gt;\n&lt;p&gt;The Endoscopy department of SWBH has recently maintained our JAG accreditation, and we will continue to work to maintain this.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoelle SmithJob titleSenior SisterTelephone number0121 507 2409/2489/5800Additional contact information&lt;/p&gt;\n&lt;p&gt;Joelle Smith joelle.smith@nhs.net 0121 507 2409/2489&lt;/p&gt;\n&lt;p&gt;Rachael Allden rachael.dean@nhs.net 0121 507 5800&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Hospital, Birmingham", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236628", "validThrough": "2020-11-18T23:59:59+0000"}