{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45000", "minValue": "45000", "unitText": "YEAR", "value": "Up to £45,000 pa DOE"}}, "datePosted": "2020-11-02T14:09:31+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Clinical, Counselling or Forensic Psychologist to join our inpatient Service in Bradford. We are looking for an appropriately experienced individual who brings a compassionate and creative approach to working with adults presenting with a range of complex mental health difficulties.&lt;/p&gt;\n&lt;p&gt;The post offers excellent professional development opportunities including DBT training, access to specialist DBT supervision; Positive Behaviour Support training and participation in other relevant training, such as forensic risk assessment (e.g. HCR20; RSVP). We encourage and support project work, service evaluations and research.&lt;/p&gt;\n&lt;p&gt;Cygnet Hospital Bierley cares for up to 61 people presenting with a range of complex mental health difficulties, across four separate wards:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Female Specialist Personality Disorder Service (Complex trauma &amp; Relationship difficulties)&lt;/li&gt;\n&lt;li&gt;Low Secure Male Ward&lt;/li&gt;\n&lt;li&gt;Low Secure Female Ward&lt;/li&gt;\n&lt;li&gt;Female Psychiatric Intensive Care Unit&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will join an MDT for one of these wards, comprising Nursing colleagues, Occupational Therapists, Social Workers, Consultant Psychiatrists and Specialty Doctors. You will be the lead psychologist for one ward, yet still be able to input into the other wards. This will give you a manageable, diverse and interesting caseload of both forensic and non-forensic work. You will have protected time for a small caseload of service users participating in our award-winning DBT programme.&lt;/p&gt;\n&lt;p&gt;You will be supported to undertake the full breadth of activities comprising a psychologist’s role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Psychological assessments&lt;/li&gt;\n&lt;li&gt;Psychological therapy with individuals&lt;/li&gt;\n&lt;li&gt;Psychological therapy with groups&lt;/li&gt;\n&lt;li&gt;Consultation to teams &amp; facilitation of reflective practice&lt;/li&gt;\n&lt;li&gt;Provision of training and supervision&lt;/li&gt;\n&lt;li&gt;Service evaluation and clinical research, including dissemination of outcomes via conference presentations and publications&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be welcomed into a friendly and very supportive Psychology team that values innovation, excellence and teamwork. Our team consists of a Head of Psychology (Clinical), four other Practitioner Psychologists (Clinical and Forensic) and two Assistant Psychologists. We are committed to providing service users with a high standard of evidence-based care. We routinely evaluate our work and regularly present outcomes at conferences and in peer-reviewed journals. The skillset within the team includes post-qualification training in CBT, CAT and Dialectical Behaviour Therapy. You will have access to individual, group and peer supervision, and will be supported to further develop your own psychotherapeutic expertise.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;You will have…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Doctorate Level Qualification (or equivalent) in Clinical/Counselling/Forensic Psychology along with HCPC Registration.&lt;/li&gt;\n&lt;li&gt;Experience of working with adults in a mental health setting.&lt;/li&gt;\n&lt;li&gt;Experience of specialist psychological assessment and treatment of people with a wide range of mental health conditions, as well as planning and delivering psychological interventions.&lt;/li&gt;\n&lt;li&gt;A positive approach to working with people presenting with a range of difficulties including: psychosis, emotionally unstable personality traits; deliberate self-harm; physical and verbal aggression; history of sexual offending; drug and alcohol problems.&lt;/li&gt;\n&lt;li&gt;Experience of various psychological therapies/models and risk assessments.&lt;/li&gt;\n&lt;li&gt;The ability to work independently and as part of a multi-disciplinary team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet? We&#39;ll offer you...&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Starting salary: £40,000&lt;/li&gt;\n&lt;li&gt;Support from an onsite multi-disciplinary team, Psychology team and Head of Psychology.&lt;/li&gt;\n&lt;li&gt;Generous learning and development opportunities e.g. conferences, DBT training, PBS training&lt;/li&gt;\n&lt;li&gt;Opportunities for project / service – related research&lt;/li&gt;\n&lt;li&gt;Your own desk and computer (no hot-desking)&lt;/li&gt;\n&lt;li&gt;Free cooked lunch at work&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;Pension scheme&lt;/li&gt;\n&lt;li&gt;NHS and other employee discounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; Contracted hours are 37.5 per week. &lt;br /&gt; &lt;br /&gt; If you would like to arrange an informal discussion about the role, please contact Dr Kelly Elsegood (Consultant Clinical Psychologist) at kellyelsegood@cygnethealth.co.uk&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;br /&gt; Please note: successful candidates will be required to undergo an enhanced DBS check.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bradford", "postalCode": "BD4 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7685", "longitude": "-1.73212"}}, "title": "Clinical/Forensic/Counselling Psychologist - B7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252350", "validThrough": "2020-11-16T23:59:59+0000"}