{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 pa"}}, "datePosted": "2020-10-08T14:00:29+0100", "description": "&lt;p&gt;&lt;strong&gt;Head of Communications for Covid Response Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8b&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;5 Month Fixed Term (37.5 hours per week) – until 31.03.2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The National Covid Response Services (CRS) are seeking to recruit an experienced Communications professional, for a 5 month period to support with the on-going NHS111 Covid response services.&lt;/p&gt;\n&lt;p&gt;This is a fast-paced role where you will be given autonomy and the opportunity to make an impact and reporting directly to the National Operations Director, working closely with the Executive SRO.&lt;/p&gt;\n&lt;p&gt;You will need to display a real passion for all aspects of communications and media management, supporting teams and stakeholder management as well as working proactively, creating and embedding processes. You will be motivated and happy working remotely, across other NHS agencies, staffing groups as well as with other organisations.&lt;/p&gt;\n&lt;p&gt;This position requires someone who has strong media and stakeholder management skills, as this will be absolutely essential to deliver what is required within the Covid-19 evolving environment.&lt;/p&gt;\n&lt;p&gt;Additionally, you will ideally need to be someone who is currently working within or with the NHS, personally resilient, forward thinking, innovative in approach to all people issues, as well as being a problem solver and be able to work at pace.&lt;/p&gt;\n&lt;p&gt;The successful person must be confident working at all levels within a range of directors and stakeholder senior management colleagues, to build excellent, effective working relations internally and across the wider NHS.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be Graduate Masters degree qualified or equivalent relevant experience, and be able to demonstrate core commitment and competencies in terms of a collaborative approach to their work and hold a successful track record in managing complex Communications.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have experience in working on sensitive media briefings and be able to shape and manage media campaigns, securing appropriate buy in from journalists and media outlets.&lt;/p&gt;\n&lt;p&gt;If you need further information regarding this position, please contact 111jobs@scas.nhs.uk. Please note that CV applications are not accepted for this role.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122412.jpg", "name": "South Central Ambulance Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122412"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bicester", "postalCode": "OX26 6HR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8919", "longitude": "-1.14951"}}, "title": "Head of Communications", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218600", "validThrough": "2020-11-09T23:59:59+0000"}