{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per annum"}}, "datePosted": "2020-11-04T13:15:49+0000", "description": "&lt;p&gt;A fantastic opportunity has arisen for a new Fixed Term / Secondment 12 month post within the Warrington and Halton Early Intervention in Psychosis Team for a Band 7 CBTp Therapist Specialist in Psychosis to provide temporary staffing cover arrangements for the extended absence of an employee due to training purposes.&lt;/p&gt;\n&lt;p&gt;If you are applying for this role as a secondment, please ensure you have your current managers approval prior to applying.&lt;/p&gt;\n&lt;p&gt;The post holder will embrace the core values of the organisation and adopt the principles of recovery.&lt;/p&gt;\n&lt;p&gt;Essential criteria is that the applicant is BABCP Accredited or are working towards accreditation or are accreditable. A further essential criteria is that you MUST have a regulatory body. You must have experience of working and providing CBT care with complex SMI presentations.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be provided with high quality supervision.&lt;/p&gt;\n&lt;p&gt;If you wish to gain further information, you can ask to speak with James Dixon clinical psychologist, Graeme Reid consultant clinical psychologist and/or Stephanie Smith clinical team manager.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT: &lt;/strong&gt;The role will involve regular travel across multiple sites in the North West Boroughs Healthcare NHS Foundation Trust catchment area. Therefore, the post holder must be able to meet the travel requirements of this post. Please indicate on your application how you meet this requirement.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced with children’s and adults barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Stephanie Smith - Clinical Team Manager&lt;/p&gt;\n&lt;p&gt;stephanie.smith3@nwbh.nhs.uk / 0151 422 6826&lt;/p&gt;\n&lt;p&gt;Early Intervention in Psychosis Team&lt;/p&gt;\n&lt;p&gt;St Johns Unit&lt;/p&gt;\n&lt;p&gt;Widnes&lt;/p&gt;\n&lt;p&gt;Cheshire&lt;/p&gt;\n&lt;p&gt;WA8 7QA&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington and Halton Early Intervention in Psychosis Team, Widnes", "postalCode": "WA8 7QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3611", "longitude": "-2.73141"}}, "title": "Cognitive Behavioural Therapist Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255994", "validThrough": "2020-11-24T23:59:59+0000"}