{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "105000", "minValue": "95000", "unitText": "YEAR", "value": "£95,000 - £105,000 Pro Rata"}}, "datePosted": "2020-10-27T16:50:05+0000", "description": "&lt;p&gt;&lt;strong&gt;General Practitioner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Up to £105,000&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;6 sessions per week&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Sutherland Lodge Surgery&lt;/strong&gt;&lt;strong&gt;, Chelmsford, Essex&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an experienced General Practitioner looking to join a team who are continually identified and praised for their hard work and commitment to the organisation? Do you have a strong attention to detail along with excellent people skills? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes?&lt;/p&gt;\n&lt;p&gt;We are looking for a General Practitioner to join our Sutherland Lodge Surgery in the Great Baddow, Chelmsford.&lt;/p&gt;\n&lt;p&gt;Since 2016, Virgin Care has been delivering the NHS contract at Sutherland Lodge Surgery, where we have been delivering innovative and refreshing general practice health care services the community of Great Baddow where we have around 10,000 patients. We have developed our own unique approach where our patients are at the centre of everything we do and right now and this is an opportunity for you to be part of this change.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the General Practitioner you will receive a competitive salary along with a NHSpension and 25 days’ annual leave.&lt;/p&gt;\n&lt;p&gt;You will become part of the Virgin Tribe. This grants you access to premier offers such as up to discounted experience days, as well as savings on Virgin Products such as holidays, gyms and media!&lt;/p&gt;\n&lt;p&gt;Our colleagues are our most precious commodity and it’s important that we take good care of everyone within our organisation. As part of this, we offer a number of services which help us to ensure that everyone is fit and healthy at work, this includes access to our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health, along with complimentary annual eye tests.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working within our Sutherland Lodge Surgery, which is due to be refurbished, as the General Practitioner you will be the face of our patient&#39;s journey. Your days will be varied and will include working with practice nursing team to provide high quality and evidence based nursing for patients including the achievement of the Quality and outcome framework and other key performance indicators.&lt;/p&gt;\n&lt;p&gt;At Sutherland Lodge, we are proud of our team, they are welcoming, collaborative, hard-working and solution focused. We offer progression opportunities for those who are looking to take the next step in their career; such has training to lead in a specialism or progress to become a clinical lead.&lt;/p&gt;\n&lt;p&gt;To be eligible to apply, you will have proven experience in primary care, be GMC registered and be on the NHS performer list.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Inspired&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The team at Sutherland Lodge in Chelmsford have turned the practice from &quot;inadequate&quot; in all domains to &quot;good&quot; in two, in just a year.CQC said they “saw one area of outstanding practice – the surgery has created ‘positivity packs’ designed to help vulnerable patients such as those with mental health conditions and the homeless.”&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We partner with the NHS to make a real difference to people in Mid Essex and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelmsford", "postalCode": "CM2 7PY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7257", "longitude": ".482625"}}, "title": "General Practitioner (Salaried)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245491", "validThrough": "2020-11-10T23:59:59+0000"}