{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-10-29T10:01:45+0000", "description": "&lt;p&gt;Northamptonshire Healthcare Foundation Trust (NHFT) has a purpose built inpatient mental health unit for adults in Kettering, based at St Mary&#39;s Hospital.&lt;/p&gt;\n&lt;p&gt;This service incorporates the following:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;7 bedded female PICU service&lt;/li&gt;\n&lt;li&gt;16 bedded male Direct Admission, Assessment and Recovery Ward&lt;/li&gt;\n&lt;li&gt;16 bedded female Direct Admission, Assessment and Recovery Ward.&lt;/li&gt;\n&lt;li&gt;10 bedded mixed gender Assessment and Recovery Ward.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We currently have vacancies for &lt;strong&gt;Band 5 Mental Health Trained Staff Nurses.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pin pending can apply but please be aware that availability for your preferred start date may not be available.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are a successful applicant you can be part of our team in a Trust that is rated Outstanding for Caring.&lt;/p&gt;\n&lt;p&gt;If you want to make an impact in your Nursing career then we are the Trust to do it!&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;CQC outstanding for care – rated good overall&lt;/li&gt;\n&lt;li&gt;£3000 recruitment bonus or Salary matching&lt;/li&gt;\n&lt;li&gt;Overtime incentive&lt;/li&gt;\n&lt;li&gt;Bespoke training and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship package with follow-on mentorship training&lt;/li&gt;\n&lt;li&gt;Recovery principles are embedded in all our activities&lt;/li&gt;\n&lt;li&gt;All wards have achieved AIMS accreditation&lt;/li&gt;\n&lt;li&gt;We have fantastic opportunities for experienced nurses&lt;/li&gt;\n&lt;li&gt;At NHFT, we’ll give you every opportunity to realise your full potential and develop the stand-out career that’s right for you.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We have a Recovery and Co-production Focus including the SafeWards initiative, Structured Clinical Management and STORM.&lt;/p&gt;\n&lt;p&gt;Service Users and Carers are actively involved within the Trust at every level.&lt;/p&gt;\n&lt;p&gt;We offer a Preceptorship Programme, mandatory and area specific training programme including Teamwork and Personal Safety Course, opportunities for ongoing learning within NHFT through links with Northampton University and The Open University. There are also opportunities to rotate through the Welland Centre to gain full experience of all acute wards.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be able to prove their dedication, motivation and reliability through an interview and assessment process.&lt;/p&gt;\n&lt;p&gt;All applicants will be required to successfully undertake full patient restraint techniques (Teamwork) and update those yearly.&lt;/p&gt;\n&lt;p&gt;NHFT welcomes applications from people, regardless of age, disability, gender, gender reassignment, race, religion or belief, sexual orientation, marital or civil partnership status or pregnancy or maternity status.&lt;/p&gt;\n&lt;p&gt;We would encourage applications from groups who are currently underrepresented in the organisation. In particular, applications from disabled people (with both visible and non-visible disabilities), people from black and minority ethnic communities and lesbian, gay, bisexual or transgendered (LGBT) people.&lt;/p&gt;\n&lt;p&gt;NHFT is committed to building a diverse workforce, ensuring staff are treated fairly at work and ensuring all staff have the learning and development they need on equality in order to undertake their job role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Trish Ribano, Service Manager. Welland Centre. 07767890893&lt;/p&gt;\n&lt;p&gt;We are unable to process applications that previously were not shortlisted or unsuccessful at interview for this post&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Welland Centre, St Marys Hospital, Kettering", "postalCode": "NN15 7PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3941", "longitude": "-.722184"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247809", "validThrough": "2020-11-12T23:59:59+0000"}