{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "56133", "unitText": "YEAR", "value": "£56,133 - £107,668 pa pro rata"}}, "datePosted": "2020-11-05T15:16:05+0000", "description": "&lt;p&gt;&lt;strong&gt;UNIVERSITY HOSPITALS BRISTOL AND WESTON (UHBW) NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;UHBW – &lt;strong&gt;Consultant in Diabetes and Endocrinology with General Internal Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol and Weston NHS Trust is delighted to have the opportunity to be able to appoint a locum consultant (initially for a 12 month period) to join our well established multi-disciplinary diabetes team. This is a full-time (10PA) post and will offer exposure to specialist secondary and tertiary diabetes services in our dynamic and thriving teaching hospital. Applications from candidates wishing to work less than full time are also encouraged. Our Foundation Trust is committed to delivering healthcare, research and teaching of the very highest quality in the appealing, vibrant and cosmopolitan city of Bristol and Weston area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must hold a Certificate of Completion of Training (CCT), or have evidence of being within six months of award of CCT or equivalent by the date of interview. The post holder will also have full GMC registration. An application form, person specification, and job description can be found online at NHS jobs&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;UNIVERSITY HOPSITALS BRISTOL AND WESTON NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;BRISTOL ROYAL INFIRMARY – Associate Specialist in Internal General Medicine with a special interest in Diabetes Medicine&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Bristol Royal Infirmary is seeking to appoint a locum associate specialist in internal general medicine with an interest in diabetes medicine (initially for a 12 month period) to join our well established multi-disciplinary diabetes &amp; endocrinology team. This is a full-time (10PA) post and will offer exposure to specialist secondary and tertiary diabetes services in our dynamic and thriving teaching hospital. Our Foundation Trust is committed to delivering healthcare, research and teaching of the very highest quality in the appealing, vibrant and cosmopolitan city of Bristol.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must meet the criteria for an Associate Specialist. The post holder will also have full GMC registration.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please contact Dr Bushra Ahmad, Clinical Lead for Diabetes and Endocrine, (bushra.ahmad@uhbw.nhs.uk) Dr Kathryn Bateman, Clinical Chair, Head of Division for Medicine, (Kathryn.bateman@uhbw.nhs.uk) and Alice Woolstenholmes, Deputy Divisional Director for Medicine (alice.woolstenholmes@uhbw.nhs.uk) for further information .&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Locum Consultant in Diabetes and Endocrinology with General Internal", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258287", "validThrough": "2021-01-10T23:59:59+0000"}