{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-30T15:51:37+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Part Time Haemodialysis Nurse to work in the East Devon Satellite Kidney Unit at Honiton. Ideally, candidates should have at least six months post qualification experience in an acute setting although this is not essential.&lt;/p&gt;\n&lt;p&gt;This is a unique area of nursing that requires specialist training and skills. These are provided by our in house dedicated clinical facilitators in a prolonged supernumerary period that is tailored to each staff member’s individual needs. Due to this commitment and investment in our employees we strongly suggest that an informal visit to the unit is arranged to ensure you understand the role fully. The Royal Devon and Exeter Foundation Trust Renal Unit have extensive and varied renal services and rotation opportunities and development are available. We pride ourselves in delivering a fully patient centered approach and delivering exceptionally high standards of care.&lt;br /&gt; &lt;br /&gt; Candidates should display excellent communication skills and an enthusiastic and adaptable nature. If you think that a career in renal nursing is for you then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;For more information or to arrange an informal visit please contact Ali Collings (Clinical Nurse Manager) or Andrea Tucker (Sister) 01404 540582&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness,&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.**&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Honiton", "postalCode": "EX14 2DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7949", "longitude": "-3.18659"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250834", "validThrough": "2020-11-13T23:59:59+0000"}