{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15969", "minValue": "15515", "unitText": "YEAR", "value": "£9.23 - £9.50 per hour"}}, "datePosted": "2020-10-05T12:25:53+0100", "description": "&lt;p&gt;The Frenchay Brain Injury Rehabilitation Centre is a well renowned, 52 bed established brain injury rehabilitation unit providing specialist in-patient rehabilitation for adults and adolescents (16+) with a traumatic or acquired brain injury. The service aims to provide exceptional care and rehabilitation, achieving outcomes for patients that are consistently above the national average.&lt;br /&gt;&lt;br /&gt; REHABILITATION ASSISTANTS&lt;br /&gt; Night shifts&lt;br /&gt;&lt;br /&gt; Salary: £16,620 - £17,100&lt;br /&gt; (£9.13 - £9.39 per hour)&lt;br /&gt;&lt;br /&gt; Full Time / Part Time / Bank nights&lt;br /&gt;&lt;br /&gt;“Today I made a real difference in helping a patient to become more independent” Sarah – Rehab Assistant&lt;br /&gt;&lt;br /&gt; Calling all nursing carers / health care assistants – come and join our night team!&lt;br /&gt;&lt;br /&gt; We will give you a very warm welcome and all the support you need to settle in and enjoy life working at BIRU and a future full of opportunities.&lt;br /&gt;&lt;br /&gt; Please apply online or call us now on 01179 562697 to discuss our night nursing Rehab Assistant posts. You can book a time to come and meet members of the nursing team and to tour the unit and get a real feel for what it’s like to work in our unit. If you would like to apply we can interview you and get you started very quickly.&lt;br /&gt;&lt;br /&gt; Great rates of pay – Full-Time, Part-Time and Bank night hours available – flexible shift patterns and set nights available.&lt;br /&gt;&lt;br /&gt; ABOUT THE ROLE&lt;br /&gt;&lt;br /&gt; You will work as part of a very friendly, dedicated night nursing team and make a real difference to our patients by providing excellent care and taking a pride in treating each of our patients as an individual.&lt;br /&gt;&lt;br /&gt; As a Rehab Assistant at BIRU, you’ll help to deliver specialised nursing care to patients, implementing person-centred care plans and undertaking a broad range of nursing duties, which include supporting our patients with daily living, assisting with their physical and personal needs – every night shift at BIRU is different and rewarding!&lt;br /&gt;&lt;br /&gt; ABOUT YOU&lt;br /&gt;&lt;br /&gt; Some previous health care experience and a compassionate, caring nature are the only qualities you need to come and be part of our team!&lt;br /&gt;&lt;br /&gt; If the satisfaction of a rewarding job and making a difference to the lives of our patient’s is what you’re looking for, you should come and join a like-minded team at BIRU.&lt;br /&gt;&lt;br /&gt; We’re not looking for qualifications: we’ll give you all the training you need. Furthermore, we’ll give you all the support you need to progress and develop your career. There are opportunities to enhance your nursing skills and you will gain valuable experience of working with a great multi-disciplinary team in a hospital setting.&lt;br /&gt;&lt;br /&gt; If that sounds like you, we think you’ll love working at BIRU. We’re part of the Huntercombe Group, which is one of the UK’s leading providers of specialist brain injury care.&lt;br /&gt;&lt;br /&gt; For more information about the Rehabilitation Assistant post or if you have any questions please contact Pearl Griffiths, Head of Nursing or Kay Staite our HR Advisor on: 01179 562697.&lt;br /&gt; To learn more about The Huntercombe Group please visit our website.&lt;/p&gt;\n&lt;p&gt;About You&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please take a look at our progressive and rewarding benefits package &lt;br /&gt;&lt;/strong&gt;• Employee Assistance Programme (EAP) &lt;br /&gt;• Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;br /&gt;• 2 week’s paid paternity leave &lt;br /&gt;• Shared parental leave, matching the maternity leave benefit &lt;br /&gt;• A thorough Induction Programme tailored to the hospital where you will be working &lt;br /&gt;• Clear pay structure, with competitive rates &lt;br /&gt;• Sick pay of 4 weeks full pay and 4 weeks half pay &lt;br /&gt;• The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions &lt;br /&gt;• Death in service benefit equivalent to 2 x salary &lt;br /&gt;• A range of staff discounts &lt;br /&gt;• Continuing Professional Development (CPD)&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;br /&gt;&lt;br /&gt; For a more detailed job spec please take a look at our Website where you can also read some inspiring stories and find out why working at Huntercombe really sets us apart from the rest&lt;/p&gt;\n&lt;p&gt;Social care&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS16 1UU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4962", "longitude": "-2.5256"}}, "title": "Night Rehabilitation Assistants", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212671", "validThrough": "2020-11-09T23:59:59+0000"}