{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T12:31:19+0000", "description": "&lt;p&gt;Our Knowsley Intermediate Care Services are seeking a dedicated Band 6 Occupational Therapist (OT) to join our service. You will be working in a team that provides cover for the Community therapy (rehabilitation), Rapid hospital discharges and our Frailty service. Our intermediate care service consists of Physiotherapists, Occupational therapist, Assistant practitioners and Therapy assistants.&lt;/p&gt;&lt;p&gt;The Frailty and Rapid discharge service operates 7 days a week while the remainder of the service operates Monday to Friday. All staff are expected to participate in the Frailty Service / rapid discharge working alongside advanced clinicians to cover weekends on a rota.&lt;/p&gt;&lt;p&gt;The Intermediate Care service responds to the rehabilitation needs of adults 18+ who have multiple complex co-morbidities.&lt;/p&gt;&lt;p&gt;We are looking for an individual who can demonstrate experience within the OT role, who has the ability to work autonomously as well as part of a team, to have sound decision making skills and effective clinical reasoning. The successful candidate is somebody who is able to work creatively to develop the role and link with senior members of the team on service development. They will be required to demonstrate excellent assessment and interpersonal skills supporting the patients through shared decision making, to make choices about their treatment and conditions.&lt;/p&gt;&lt;p&gt;The successful applicant should demonstrate the Trust’s values and be committed to the delivery of outstanding care for our patients. The culture of shared decision making underpins the practice in Intermediate care and candidates will have the opportunity to use the shared decision making approach in line with the Mental Capacity Act to empower patient choice.&lt;/p&gt;&lt;p&gt;The ability means and willingness to travel across bases within Knowsley in the course of performing duties is essential in this post. Therefore, the post holder must be able to meet the travel requirements of this post. Please indicate on your application how you meet this requirement.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Suitable applicants will demonstrate the following:-&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Excellent communication skills – verbal, non-verbal and written.&lt;/p&gt;&lt;p&gt;A caring approach to meet the needs of the service users and their families&lt;/p&gt;&lt;p&gt;Use of initiative, flexibility and adaptability&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Joint occupational therapy / physiotherapy service offers&lt;/strong&gt;:&lt;/p&gt;&lt;p&gt;An in service training programme.&lt;/p&gt;&lt;p&gt;Excellent support and appraisal along with clinical supervision.&lt;/p&gt;&lt;p&gt;An individual personal development plan&lt;/p&gt;&lt;p&gt;This post is subject to an enhanced check with adult’s barred list Disclosure and Barring Service (DBS) Check.  Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50, the cost of which will be deducted from first salary.&lt;/p&gt;&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;&lt;p&gt;Paula Burke - Team Lead&lt;/p&gt;&lt;p&gt;0151 2443391 / paula.burke@nwbh.nhs.uk&lt;/p&gt;&lt;p&gt;Please liaise with the Duty Therapist to discuss the post if I am not available.&lt;/p&gt;&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Intermediate Care Knowsley, Knowsley", "postalCode": "L36 4PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4122", "longitude": "-2.85789"}}, "title": "Occupational Therapist Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250169", "validThrough": "2020-11-12T23:59:59+0000"}