{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum Pro Rata"}}, "datePosted": "2020-11-04T14:25:36+0000", "description": "&lt;p&gt;Are you looking to expand your nursing career and be an important part of an amazing team. Do you want a position where your ideas and creativity in providing patient care are listened to and valued.&lt;/p&gt;\n&lt;p&gt;Dementia is a growing challenge for communities and we, as healthcare professionals are at the forefront of providing the dignity, support and care that people deserve.&lt;/p&gt;\n&lt;p&gt;We have great plans and need you to help us bring them to life. We have great facilities and are looking at new and innovative ways of making our patients tie with us a rewarding and inspiring time. Rehabilitation and fostering independence is key to everything we do. There are challenges, it’s not always easy, but our successes are rewarding and each day’s challenges bring something new.&lt;/p&gt;\n&lt;p&gt;We need people who are creative, enthusiastic and have the compassion needed to provide a nurturing environment for those in our care. It takes people with big hearts to achieve the standards we require and if you feel that you do – then we’d love to hear from you! Values underpinning the 6 C’s of Nursing and a desire to improve patient care are essential for the post.&lt;/p&gt;\n&lt;p&gt;This is no ordinary ward – we’ve won over some distressed patients with hat making competitions, invited confused patients to team meetings where they’ve engaged and felt useful. We’ve had tea parties and memory boxes and plan to do much, much more! If you are the type of person who thrives on finding new approaches or has the instinct to resolve issues by ‘thinking outside the box’ then you’re the person we’re looking for!&lt;/p&gt;\n&lt;p&gt;Many of us have personal experience of family and friends who are elderly, have dementia, delirium and have periods of confusion. We all wish that their care and the services on offer to support their families, our families, are inspirational and supportive – that’s what we are working hard to improve! Do you believe you have something special to offer that will improve services while giving you the opportunity to develop your career. This experience will give you invaluable experience while providing a sense of worth often lacking in other areas of nursing. We value the time, effort and energy put in by our people – and this is a great opportunity to join ‘Team Amazing!’.&lt;/p&gt;\n&lt;p&gt;We offer flexible working patterns on a roster basis and a range of employee benefits on NHS terms and conditions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week: 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 19th November&lt;/strong&gt;&lt;strong&gt;2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;For details about the role and ward/informal visits contact:&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Katy Dunn, Senior Sister Ward 9&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;katy.dunn@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01625 661009 / 1220&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For queries regarding the application and or interview process, please contact the Recruitment Team either via email, ecn-tr.recruitment@nhs.net or telephone, 01625 656510&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We would like to inform you that if your application is successful, your interview will be held via SKYPE.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Victoria Road, Macclesfield, Cheshire", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Staff Nurse in Elderly Care Specialising in Dementia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256210", "validThrough": "2020-11-19T23:59:59+0000"}