{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-15T08:45:41+0100", "description": "&lt;p&gt;Fantastic opportunities have arisen to recruit passionate, dedicated and highly motivated mental health nurses that are excited to be part of the Forensic CAMHS service at Ardenleigh. You will be providing high quality and compassionate care, leadership and recovery focused care to young people who are experiencing complex mental ill health and/or Autistic disorders and who demonstrate challenging behavior as well as can act as a positive role model for staff in a manner that positively reflects the philosophy of the service and the values of the organisation. You will be working within the named nursing team and with the wider MDT.&lt;br /&gt;&lt;br /&gt;Successful applicants must be able to work with young people and understand the developmental needs as well be able to manage the challenging and dynamic environment. You will need to demonstrate a range of skills including effective communication, empathy, self-awareness, and critical self-reflection skills.&lt;br /&gt;&lt;br /&gt;As a service we promote the use of Positive Behavioural Support Plans with these assisting the workforce to design more supportive environments and to better support individuals in developing skills that will improve their quality of life.&lt;br /&gt;&lt;br /&gt;We currently have full time vacancies and are seeking to employ Registered Mental Health Nurses to work within our service that are committed and motivated to working as part of the Multi-Disciplinary Team in providing professional and compassionate nursing care to patients within a secure forensic environment.&lt;br /&gt;&lt;br /&gt;Forensic CAMHS is a fun and energetic place to work, we thrive on staff engagement in the service and always looking to change and adapt to new ways of practicing to ensure that we are delivering the best care possible. We as an ASD accredited service expect staff to have knowledge and understand of Autistic disorders. We offer a wide range of in house training covering ASD, child development, working with families, risk assessment and therapeutic working.&lt;br /&gt;&lt;br /&gt;What we’d like from you:&lt;br /&gt;• RMN Qualified willing to work in a busy challenging role&lt;br /&gt;• Excellent understanding of Safeguarding&lt;br /&gt;• Understanding of Multidisciplinary Services&lt;br /&gt;• NMC (Nursing &amp; Midwifery Council Registered)&lt;br /&gt;• Knowledge of the Mental Health Act&lt;br /&gt;• Patient centric &amp; commitment to delivering high quality care&lt;br /&gt;• Excellent organisational capability&lt;br /&gt;• Effective communication skills&lt;br /&gt;• Flexibility in approach to work and a strong “can do” attitude&lt;br /&gt;What we’d like to give you:&lt;br /&gt;• Comprehensive Induction and commitment to on-going training care and support.&lt;br /&gt;• Bespoke training in issues relevant to nursing women within medium security- Trauma Informed Care, Understanding Personality Disorder, Positive and Proactive Care, Positive Behavioural Support Plans.&lt;br /&gt;&lt;br /&gt;• Development in your risk management and assessment skills.&lt;br /&gt;• Development of leaderships skills&lt;br /&gt;• Buddy / mentor system&lt;br /&gt;• 27 days annual leave plus bank holidays – increasing to 33 days after 10 years’ service&lt;br /&gt;• Recognising nursing as a profession through nurse badge awards for all nursing at all levels&lt;br /&gt;• Free flu jabs&lt;br /&gt;• Free parking at specific sites only&lt;br /&gt;• Cycle to work scheme&lt;br /&gt;• Just drive scheme&lt;br /&gt;• SMART Childcare Vouchers&lt;br /&gt;• SMART Pension option&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNatasha MooreJob titleFCAMHS Ward ManagerEmail addressnatasha.draper1@nhs.netTelephone number01213014393Additional contact information&lt;/p&gt;\n&lt;p&gt;Natasha Moore&lt;br /&gt;&lt;br /&gt;0121 301 4400 / 0121 301 4393&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ardenleigh, Erdington", "postalCode": "B24 9SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5162", "longitude": "-1.83374"}}, "title": "Band 5 Staff Nurse - FCAMHS Ardenleigh", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227407", "validThrough": "2020-11-11T23:59:59+0000"}