{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-06T14:10:52+0000", "description": "&lt;h2&gt;Job Summary&lt;/h2&gt;\n&lt;p&gt;An exciting opportunity has arisen to join our Multi-discipline medical team. You will be a highly valued member of our team bringing your expertise and skills in ophthalmic procedures.&lt;/p&gt;\n&lt;p&gt;As a Practice Plus Group Consultant you will have access to great facilities in a well-structured and relaxed environment. We offer high quality day case treatment in a wide range of specialties and deliver excellent clinical care. As part of our professional, friendly and compassionate team you will do everything you can to ensure the patient’s treatment is of the highest standard.&lt;/p&gt;\n&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;You will support the Ophthalmology Lead Consultant in developing Practice Plus Group Surgical Centre, Portsmouth as a centre of excellence in Ophthalmology.&lt;/p&gt;\n&lt;p&gt;You will be required to perform a range of ophthalmology day case procedures on NHS and private patients referred to the treatment centre and provide supervision of the provision of adult community ophthalmology services delivered by allied healthcare professionals, working in accordance with Practice Plus Group treatment protocols and working practices. The post will include clinical sessions at Practice Plus Group Surgical Centre. Portsmouth and community health care facilities.&lt;/p&gt;\n&lt;p&gt;As a UK registered medical professional, with a listing on the Specialist GMC register, we will support you with your ongoing CPD and career development.&lt;/p&gt;\n&lt;h2&gt;Working at Practice Plus Group&lt;/h2&gt;\n&lt;p&gt;Everything we do is focused on providing a high standard of safe and effective patient care. Our facilities are modern, employing the latest technology with friendly and professional staff. We have strong control processes to ensure we maintain high standards of hygiene and above all, we’re passionate about giving our patients the best possible care and helping them feel better, faster.&lt;/p&gt;\n&lt;p&gt;When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. We’ll help you be the best you can be.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We will contact all shortlisted candidates but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;br /&gt;i&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO3 6DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7992", "longitude": "-1.06174"}}, "title": "Consultant Ophthalmologist - Portsmouth", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260061", "validThrough": "2020-11-20T23:59:59+0000"}