{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Minimum Wage for the Age"}}, "datePosted": "2020-10-30T11:31:37+0000", "description": "&lt;p&gt;&lt;strong&gt;Health Care Support Worker Apprentice&lt;/strong&gt; in &lt;em&gt;Lymphoedema and Leg Ulcer&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;East Coast Lincolnshire&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;A&lt;/em&gt; career in healthcare is dynamic, diverse and hugely rewarding. You will work with a range of patients, families and carers across a variety of healthcare services to make a positive difference to people’s lives by helping them to achieve their goals and live as independently as possible. We have a truly exciting opportunity for a caring and compassionate individual, who can demonstrate the LCHS behaviours, to start their career with us working within our Lymphoedema and Leg Ulcer teams.&lt;/p&gt;\n&lt;p&gt;The Lymphoedema and Leg Ulcer teams provide clinic-based services to patients with complex needs that require specialist assessment and treatment interventions. The focus of care is all about the individual, providing them with the knowledge and skills to identify their care needs and promote self-management, alongside hands-on treatment interventions. You will be assisting qualified nurses to deliver exceptional standards of care to patients whilst developing an array of clinical and social skills that will be critical to your healthcare career. You will learn how to interact effectively with patients and professionals and work successfully within a team. Preferably, you will be based within the Skegness/ surrounding areas and are able to travel to different clinics within this area.&lt;/p&gt;\n&lt;p&gt;You will be delighted to hear that you will also have the opportunity and be encouraged to shadow qualified nurses/ therapists in our other specialist services to gain even more experience; LCHS currently provide 16 different specialist services including Respiratory, Parkinson’s and Heart Failure.&lt;/p&gt;\n&lt;p&gt;During your learning journey with us you will also complete your HCSW Level 2 apprenticeship and care certificate with our in house Apprenticeship Centre, which will form the foundation to your career in health care.&lt;/p&gt;\n&lt;p&gt;We firmly believe that learning by doing is the cornerstone to development and we are very much focused on ‘growing our own’ by prioritising development opportunities and supporting growth. We are excited for you to come on-board and develop your career with us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLee GiffordJob titleApprentice LeadEmail addresslhnt.apprenticeshipenquiries@nhs.netTelephone number01522308775&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skegness Hospital, East Coast Lincolnshire", "postalCode": "PE25 2BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.145", "longitude": ".332188"}}, "title": "Healthcare Support Worker Apprentice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249954", "validThrough": "2020-11-22T23:59:59+0000"}