{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £51,668 per annum"}}, "datePosted": "2020-10-26T10:16:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7/8a Clinical/Counselling/Forensic Psychologist (1.0 wte / 37.5 hrs p/week)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;This is post is available at Band 7 or a Band 8a level dependent on experience. If appointed at Band 7 (newly qualified), this will be a developmental post and the post-holder will work through their preceptorship towards Band 8a level.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a qualified clinical, counselling or forensic psychologist to join the multidisciplinary team at Brockfield House in Wickford, Essex (a 98 bed medium and low secure forensic inpatiet Unit for male and female service users). The post-holder will take on the role of ward psychologist for one of the medium-secure or low-secure wards, providing psychological assessments as well as individual and group interventions to patients presenting with a range of complex mental health and forensic needs.&lt;/p&gt;\n&lt;p&gt;The post offers significant opportunities for training and development and the successful candidate would be supported to gain specialist skills in specialist forensic assessments required for the role, as well as to develop and expand upon appropriate therapeutic skills. The post represents an exciting opportunity to take an active role in service development and would suit qualified psychologists enthusiastic about developing in the field of forensic mental health.&lt;/p&gt;\n&lt;p&gt;In addition to being supported by the multidisciplinary team at Brockfield House, the successful candidate would also be part of the wider Secure Services Psychology Department, which includes Edward House (a 18 bed male Low Secure Unit in Chelmsford); Wood Lea Clinic (a 10 bed secure unit In Bedfordshire for males with learning disability); and Robin Pinto Unit (a 18 bed Low Secure Unit in Luton for males). Video conferencing facilities between sites are also used to assist departmental communication.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;“We will consider applications from trainees in their final year of training”&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Season Ticket Loans&lt;/li&gt;\n&lt;li&gt;NHS discounts for staff&lt;/li&gt;\n&lt;li&gt;Excellent Training facilities and opportunities&lt;/li&gt;\n&lt;li&gt;The opportunity to work bank shifts and expand knowledge and experience in other areas&lt;/li&gt;\n&lt;li&gt;Salary Sacrifice schemes including lease cars and Cycle to Work&lt;/li&gt;\n&lt;li&gt;Buying and Selling annual leave scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Kristoff Bonello ( Head of Psychology Secure Services; Consultant Psychologist &amp; Forensic Psychotherapist) at kristoff.bonello@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brockfield House, Wickford", "postalCode": "SS11 7FE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6199", "longitude": ".523616"}}, "title": "Band 7/8a Clinical/Counselling/Forensic Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241973", "validThrough": "2020-11-23T23:59:59+0000"}