{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 plus HCAS per annum"}}, "datePosted": "2020-11-05T14:01:25+0000", "description": "&lt;p&gt;Exciting opportunities for Staff Nurses to join the 0-19 Universal Childrens services in Redbridge.&lt;/p&gt;\n&lt;p&gt;We are looking for innovative, enthusiastic and motivated staff nurses who hold a Registered Nurse qualification and are able to assist us in delivering high quality care to children, young people and families within the community.&lt;/p&gt;\n&lt;p&gt;Do you want to develop in a progressive, innovative environment, and enhance your career? If so we would like you to join the Redbridge 0-19 team Universal Children Services and find out all about the possibilities that can be opened up for you.&lt;/p&gt;\n&lt;p&gt;We are very progressive in Redbridge and have developed partnership working across Children Services to ensure that we deliver the 0-19 Healthy Child Programme and quality healthcare services to improve the health and well-being within our diverse community.&lt;/p&gt;\n&lt;p&gt;Our vision for delivering the Healthy Child Programme, in partnership with key stakeholders is to ensure that every child in Redbridge has the very best start in life and grow up to be happy, safe, healthy, confident and resilient&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is eligible for the Trust &#39;Welcome to NELFT&#39; Payment, a lump sum of 10% of agreed basic salary excluding HCAS and is open to all &lt;strong&gt;new&lt;/strong&gt; applicants who are successfully appointed. Payment of the incentive is 50% of the lump sum at the end of the probationary period (typically six months) and then 50% at the end year two. This welcome package is applicable to &lt;strong&gt;external&lt;/strong&gt; candidates only.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement – London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAngela NuakoJob titleTeam LeadEmail addressangela.nuako@nelft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;for more details please contact:&lt;/p&gt;\n&lt;p&gt;angela.nuako@nelft.nhs.uk 07860782011&lt;/p&gt;\n&lt;p&gt;Nicky.wyatt@nelft.nhs.uk 07718 271491&lt;/p&gt;\n&lt;p&gt;Stacey.lawson@nelft.nhs.uk 07712302171&lt;/p&gt;\n&lt;p&gt;Redbridge 0-19 Universal Childrens services&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Loxford / Fairlop / South Woodford, Redbridge", "postalCode": "IG7 4DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6078", "longitude": ".104443"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258027", "validThrough": "2020-11-19T23:59:59+0000"}