{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17818", "minValue": "16641", "unitText": "YEAR", "value": "£9.90-£10.60 ph"}}, "datePosted": "2020-11-04T09:18:51+0000", "description": "&lt;p&gt;TEMPORARY FULL TIME POST COVERING MATERNITY LEAVE - 12 MONTH CONTRACT&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PART-TIME JOB SHARE APPLICATIONS ALSO WELCOME&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;French Weir Health Centre is a busy GP Practice in the heart of Taunton, Somerset. Our team of 10 doctors look after 16,000 patients and this is made possible with the support of our dedicated and committed nursing team comprising Practice Nurses and Healthcare Assistants.&lt;/p&gt;\n&lt;p&gt;Dur to maternity leave, we currently have a vacancy for a Healthcare Assistantwho preferably has prior experience of working in a primary care healthcare environment. We are looking for a reliable, enthusiastic, well motivated individual to fit into our friendly, forward-thinking team. The successful candidate will demonstrate excellent interpersonal, communication and organisational skills, together with the ability to work well under pressure.&lt;/p&gt;\n&lt;p&gt;The post is for 37.5 hours per week over 5 days. Competitive salary. 4.4 weeks&#39; annual leave, plus bank holidays and NHS pension scheme. Free parking.&lt;/p&gt;\n&lt;p&gt;Candidates must have a minimum of 5 x grade A-C GCSEs (or equivalent) and hold an NVQ in Healthcare. Venepuncture experience is essential. Please see the attached job description and personal specification for further details.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Healthcare Assistant GP Practice - 12 month maternity cover", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255168", "validThrough": "2020-11-18T23:59:59+0000"}