{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29888", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 per annum inclusive of HCAS"}}, "datePosted": "2020-10-28T10:46:09+0000", "description": "&lt;p&gt;This is a great opportunity to join the enthusiastic and collaborative Quality and Patient Safety and Commissioning Team in Health Education England (London). The department is responsible for ensuring that regulatory requirements of all the professional regulators are met and exceeded, further the team is responsible for ensuring that patient safety and the quality of training are priorities in all education and training matters, coordinating initiatives to continually drive up the delivery of high quality education and training across London&lt;/p&gt;\n&lt;p&gt;The Quality, Patient Safety and Commissioning Officer will working within the Primary Care team to ensure best practice with regard to health education and training. By acting as a fully integrated member of the team you will ensure that patient safety and quality of training are priorities for all work.&lt;/p&gt;\n&lt;p&gt;In addition, you will be responsible for providing a comprehensive support service to all members of the team in order to support the effective and efficient delivery of services across all areas of the teams’ responsibilities. You will be required to work flexibly across all areas of the team and with unit designated responsibilities, providing appropriate support where business needs require. The post holder will be responsible for undertaking a range of support functions in order to contribute to the successful achievement of outcomes for the team. The post holder will be a key member of the team whose overarching role is to work across the geography to improve the quality of health education and training, and ultimately patient care thus ensuring a first-class health system in London for today&#39;s and tomorrow’s health professionals and patients.&lt;/p&gt;\n&lt;p&gt;In your application must be able to demonstrate data analysis, developed communication skills, record management and minute taking, stakeholder management, time management skills, being able to work as part of a team and independently and the ability to use Excel to a high standard.&lt;/p&gt;\n&lt;p&gt;Please ensure that when applying you have read the additional information provided alongside this advertisement and that you use specific examples that show how you meet the requirements of the person specification for this role - generic applications will not be accepted.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please Note: Applicants from within the NHS will be offered on a secondment basis only, agreement should be obtained from their employer prior to submitting the application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 5 with a full-time starting salary of £29,888, with pay step increases after 2 years’ service and 4 years’ service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Maurean Austin, Deputy Quality, Patient Safety and Commissioning Manager&lt;/p&gt;\n&lt;p&gt;Email: maurean.austin@hee.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stewart House, London", "postalCode": "WC1B 5DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5211", "longitude": "-.127467"}}, "title": "Quality &amp; Commissioning Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246139", "validThrough": "2020-11-11T23:59:59+0000"}