{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15482", "minValue": "15482", "unitText": "YEAR", "value": "£9.21 PH"}}, "datePosted": "2020-11-04T09:42:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you the Booking Clerk we’re looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an experienced booking clerk to provide support to the Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;East and North Hertfordshire NHS Trust provide services to the local community to around 500,000 people, with the regional cancer centre supporting around 2 million people. They provide care to the community with an annual budget of around £350 million and more than 5,000 staff.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Who work as a team to provide a high-level service? If yes, East and North Hertfordshire NHS Trust is the place for you.&lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for a &lt;strong&gt;temporary booking clerk&lt;/strong&gt; available at &lt;strong&gt;Lister Hospital, Stevenage however travel across the Trust may be required.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Responsibilities will cover several areas such as;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide the first point of contact for Consultants and patients alike.&lt;/li&gt;\n&lt;li&gt;To manage, organise and prepare outpatient clinics as per the patient access policy, ensuring all documentation are in the agreed order and up to date which include pulling notes for clinics (across both sites), and finding missing notes.&lt;/li&gt;\n&lt;li&gt;Transporting prepped patient notes to clinics.&lt;/li&gt;\n&lt;li&gt;Responsible for data entry and retrieving information using:  Lorenzo, CMIS, Cronos, ICE, Cintas, Early Bird and IFIT.&lt;/li&gt;\n&lt;li&gt;Inputting sensitive information, such as referrals, making appointments within the trust guidelines, dealing with midwives and GP/midwife letters&lt;/li&gt;\n&lt;li&gt;Clinic outcome coding onto Lorenzo.&lt;/li&gt;\n&lt;li&gt;Inputting sensitive and important information regarding patients’ blood and nuchal results and highlighting any abnormalities to the blood screening co-ordinator immediately.&lt;/li&gt;\n&lt;li&gt;Allocating nuchal and quad testing appointments within the Trust guidelines&lt;/li&gt;\n&lt;li&gt;Allocating Glucose Tolerance Testing appointments.&lt;/li&gt;\n&lt;li&gt;Dealing with clinics that are cancelled at short notice and prioritising our daily consultant clinics situated at the Lister, HCH and the QEII hospitals.&lt;/li&gt;\n&lt;li&gt;Responsibility for giving patients guidance and information either at clinics or over the telephone advising them on what their options are and what course of action they should be taking in a clear and concise manner within both Obstetrics and Gynaecology&lt;/li&gt;\n&lt;li&gt;Dealing with distressed, aggressive and emotional patients in a caring, empathetic manner whilst advising them the best course of action to take and taking the correct information and highlighting this to a member of staff better suited.&lt;/li&gt;\n&lt;li&gt;Knowledge and understanding of NHS policies i.e. conforming to patient confidentiality within the Trust and dealing with patients from ethnic backgrounds.&lt;/li&gt;\n&lt;li&gt;Responsible for providing blood forms, patient information leaflets and inserts for patient notes from suppliers and sending documents to Banner.&lt;/li&gt;\n&lt;li&gt;Responsible for training temporary and permanent staff on the processes, how to deal with patients over the phone in a professional manner and covering a very busy reception.&lt;/li&gt;\n&lt;li&gt;You will be required to work with minimal supervision and have the ability to work under extreme pressure, and to be able to exercise sound judgement and decision making skills.&lt;/li&gt;\n&lt;li&gt;Dealing with overseas patients, when booking appointments and working with and informing the overseas liaison officer&lt;/li&gt;\n&lt;li&gt;Ensure patients are kept updated of waiting times and delays in clinics.&lt;/li&gt;\n&lt;li&gt;Ensure clinic and waiting area is kept clean and tidy at all times during clinic sessions.&lt;/li&gt;\n&lt;li&gt;Required to demonstrate a level of IT literacy skills as the use if IT is fundamental in delivering good quality efficient health care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;This role is full-time, Monday to Friday 9:00 – 17:00.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have the following skills …?&lt;/p&gt;\n\n\n\n\n\n&lt;ul&gt;\n&lt;li&gt;Previous administration and data entry experience is essential&lt;/li&gt;\n&lt;li&gt;Previous experience working in a healthcare setting desirable&lt;/li&gt;\n&lt;li&gt;Excellent communication skills&lt;/li&gt;\n&lt;li&gt;Excellent telephone manner&lt;/li&gt;\n&lt;li&gt;Excellent timekeeper&lt;/li&gt;\n&lt;li&gt;Flexible approach&lt;/li&gt;\n&lt;li&gt;Smart appearance&lt;/li&gt;\n&lt;li&gt;Good knowledge regarding services provided by the hospital&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n\n\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to hearing from you soon.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Booking Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255213", "validThrough": "2020-11-18T23:59:59+0000"}