{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-15T17:16:21+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title: &lt;/strong&gt;Consultant Gastroenterologist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; Gastroenterology&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Milton Keynes&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;&lt;strong&gt;£82,096 - £110,683 &lt;/strong&gt;per annum&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Programmed Activities: &lt;/strong&gt;10&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited to apply for a Consultant Gastroenterologist at Milton Keynes University Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;This post offers 10 programmed activities. Additional programmed activities may be available upon agreement.&lt;/p&gt;\n&lt;p&gt;The purpose of this replacement post is to maintain a dynamic gastroenterology service and expanding therapeutic endoscopy service with colleagues. The post will also enhance the provision of gastroenterology services and in meeting the demands of expanding endoscopy service. The department is also willing to support other interests like IBD. The role encompasses responsibilities gastroenterology clinics, endoscopy sessions, and care for in-patients under gastroenterology service. The candidate will be expected to embrace the other aspects of DGH gastroenterology including attendance and involvement with MDTs, and will be required to partake in the 1:6 out of hours GI bleeding endoscopy rota and a planned future expansion to a 7 day service. There is no commitment to general medical rota but we provide in-reach service to AMU 6 days a week.&lt;/p&gt;\n&lt;p&gt;We welcome candidates with CCT or equivalent in gastroenterology, a subspecialty interest would be supported.&lt;/p&gt;\n&lt;p&gt;There is a 25 bed gastroenterology ward (ward 8) looked after by 2 GI teams. Currently there is in-reach service to Medical assessment unit on Saturday mornings linked with out-of-hour GI bleeding rota on 1 in 6 basis. The in-reach service only supports the review of gastroenterology ill-patients in MAU.&lt;/p&gt;\n&lt;p&gt;The team is well complimented with 4 experienced middle-grades, 2 Oxford deanery registrars, 1 CMT, 2 SHOs/FY2 and 2 FY1 doctors. We also have 2.5 IBD nurse specialists, 2 UGI cancer nurses and 1.5 Nutrition nurses. We have 3 nurse endoscopists who take on the bowel scope screening. They also support the symptomatic service. Colorectal nurses and stoma nurses from surgical department also help support the colorectal cancer and IBD patients. We are the lead Bowel cancer screening centre for Buckinghamshire with 3 sites at Milton Keynes, Stoke Mandeville and High Wycombe.&lt;/p&gt;\n&lt;p&gt;The hospital is the premier teaching hospital for the newly created University of Buckingham Medical School. The first students graduated in 2019 and currently all years of medical students are being taught at the hospital. There are significant opportunities in the field of medical education both in the delivery and organisation of teaching. A teaching and research background would be highly advantageous when applying for this position.&lt;/p&gt;\n&lt;p&gt;We believe the continued growth of the hospital will allow us to expand and improve our services to offer the very best care to the people of Milton Keynes, and beyond.&lt;/p&gt;\n&lt;p&gt;Located just 50 miles north of London, Milton Keynes has excellent access to the capital whilst being centrally located for Oxford and Cambridge and having ease of access to the north. Lying in attractive countryside, Milton Keynes offers first class facilities for sport, theatre, music, shopping and dining.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please submit your CV by attaching it to your NHS Jobs application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for receipt of applications: &lt;/strong&gt;15th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: &lt;/strong&gt;25th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is subject to a Disclosure and Barring Service Check.&lt;/p&gt;\n&lt;p&gt;We are committed to equal opportunities and welcome applications from all sections of the community.&lt;/p&gt;\n&lt;p&gt;Milton Keynes is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Ravi Madhotra&lt;/p&gt;\n&lt;p&gt;Clinical lead for Gastroenterology&lt;/p&gt;\n&lt;p&gt;ravi.madhotra@mkuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;01908 997103&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120888.png", "name": "Milton Keynes University Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120888"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gastro - Med Staff (Dept), Milton Keynes", "postalCode": "MK6 5LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0264", "longitude": "-.735774"}}, "title": "Consultant Gastroenterologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229159", "validThrough": "2020-11-15T23:59:59+0000"}