{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-22T09:00:17+0100", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for two additional Clinical Leads to join the rapidly developing Community Services in Herefordshire. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Herefordshire has recently been successful in gaining new monies as a pilot site to develop community mental health services. The aim of these developments is to extend access to mental health services for those individuals whose needs are too complex for primary care services, but not complex enough for secondary care services. The model proposed will provide one community mental health team for each of the five Primary Care Networks in Herefordshire&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The advertised posts will both be based at Widemarsh Street in Hereford City. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Clinical Lead you will be responsible for the day to operational management of the team and supporting their ongoing development, providing effective leadership and supervision as well as having some clinical responsibilities. The successful candidates will play a key role in working with staff both within mental health services and with other partners/ agencies &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holders will also support the team to ensure performance targets are achieved within the framework of Clinical Governance and that this is supported by effective communication, staff development, supervision and support systems with all members of the team, service users and their relatives and/or carers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt; For further details / informal visits contact:&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Jean Hammond, Community Services Manager, on 01432 842222&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Herefordshire Mental Health and Learning Disabilities Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Clinical Lead - Community Mental Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237631", "validThrough": "2020-11-08T23:59:59+0000"}