{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 per annum"}}, "datePosted": "2020-11-04T12:16:09+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a dynamic, innovative, committed and highly skilled Junior Sister/Charge Nurse to assist in the leadership of Writtle Ward, one our Care of the Elderly Wards at Broomfield Hospital. You will be a Registered Nurse with demonstrable commitment to your own professional development and experience of running in a busy shift on a medical ward. Previous experience working in elderly care or medicine is desirable but not essential as training will be provided to the right applicant. In this role you will be working to support the Ward Manager in providing clinical, professional and managerial leadership to the medical ward.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to work with our extensive multidisciplinary team whilst supporting patients and their relatives through their journey from admission to discharge, providing them with the highest quality healthcare and patient experience. We pride ourselves in that along with our other Elderly Care Wards we came first nationally in the National Audit for Dementia Carers’ survey demonstrating that the care we provide to patients and their families is amongst the best in the country.&lt;/p&gt;\n&lt;p&gt;The role will be challenging but rewarding and is supported by a Matron and Assistant Director of Nursing and of course the Senior Ward Sister.&lt;/p&gt;\n&lt;p&gt;Part time available.&lt;/p&gt;\n&lt;p&gt;For an informal visit please contact the ward sister, Leanne Fox on 01245 514012.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Katie Potter   Job titleSenior Sister &lt;/p&gt;\n&lt;p&gt;Email address   katie.potter@meht.nhs.uk      Telephone numberExt 4012&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broomfield Hospital, Chelmsford", "postalCode": "CM1 7ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7746", "longitude": ".465452"}}, "title": "Junior Sister/Charge Nurse - Care of the Elderly", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255780", "validThrough": "2020-11-18T23:59:59+0000"}