{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a. inc."}}, "datePosted": "2020-11-03T12:01:19+0000", "description": "&lt;p&gt;Homerton University Hospital is an innovative Foundation Trust providing a wide range of services to the local community of Hackney and specialist services on a national level. Located in the multicultural east end of London we are situated close to the heart of the capital. The post holder will be working for the R&amp;I Directorate based at Homerton University Hospital NHS Trust and focus primarily on trials within the General Medical Departments but may also be asked to support other areas of research if required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is an exciting opportunity for &lt;strong&gt;one&lt;/strong&gt; &lt;strong&gt;NMC Registered Nurse&lt;/strong&gt; to participate in a broad based research programme (including both qualitative and quantitative studies) and in health research studies. You will be responsible for coordinating and supporting commercial academic and NIHR supported studies. You will need to be adaptable, confident and able to prioritise a combination of diverse demands on your time and able to work autonomously.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holder- &lt;strong&gt;NMC Registered Nurse&lt;/strong&gt; will be mentored by the lead research nurse through a well-designed induction programme with support and training in all areas of research governance. You will have the opportunity to develop as an independent Research Nurse working with all members of the multidisciplinary team of clinical and research staff. You will gain specialist knowledge and skills in the approval process for clinical trials, patient management along with the collection and monitoring of trial data. This is an exciting opportunity for candidates as we are looking for one Registered Nurse to develop their skills and begin a rewarding career in clinical research.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is offered as a full time position 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Hassina Furreed Lead Research Nurse / GCP facilitator on email: h.furreed@nhs.net or&lt;/p&gt;\n&lt;p&gt;Lisa Canclini Lead Research Midwife on email: lisa.canclini@nhs.net&lt;/p&gt;\n&lt;p&gt;Balinder Hans Lead Research Nurse on email: Balinder.hans@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Research Nurse/Clinical Trials Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253869", "validThrough": "2020-11-15T23:59:59+0000"}