{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6 training post/Band 7 upon completion of com"}}, "datePosted": "2020-11-02T13:30:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 aspiring to Band 7 Advanced Practice Radiographer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an enthusiastic, capable, hardworking and reliable Band 6 Radiographer to aspire to hold a position of Band 7 radiographer both in Advanced Practitioner for Fluoroscopy services along with CTC services at the University Hospital of North Midlands.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be committed to providing our patients and clinicians the very best quality of care and service with the UHNM trust values. The fluoroscopy requirement to this part of this role is likely to include but not limited to performing such procedure as Hysterosalpingography, Fluoroscopy Proctography and MRI Proctography along with potential career development opportunities to perform Dacrocystography &amp; Sialography. The career development route will be guided by clinical demand and service developments in line with patient and clinician requirements. The CT department across both sites perform on average 2795 CT Colonograms each year.&lt;/p&gt;\n&lt;p&gt;We are a large University Hospital located in Staffordshire with close links with Bangor University, Birmingham City University and Keele University. The University Hospitals of North Midlands NHS Trust (UHNM) is one of the largest and most modern in the country, with highly regarded facilities, teaching and research. Our goal is to be a world-class centre of achievement, where patients receive the highest standards of care and the best people come to learn, work and research.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, pro-active Radiographer to clinically join our friendly Fluoroscopy and CT Colonography team to provide an excellent service to the population of the North Midlands. You should be adaptable, have excellent work ethics, be able to demonstrate initiative, and possess good communication skills; the ability to work flexibly and as part of a multi-disciplinary team is essential.&lt;/p&gt;\n&lt;p&gt;CT Colonography post graduate qualification would be desirable but not essential as on-site training can be provided with the UHNM established CTC Short Course. You should have some previous experience of working in fluoroscopy and/or the CT Colonography environment and have a keen interest to progress. It is anticipated that further skills will develop from working alongside Advanced Practice radiographers currently in post, to attend courses and self-directed learning to facilitate competence. Evidence of any training, interest and experience will be required. The successful candidate will work closely with the MDT, the radiologists and other key stakeholders to demonstrate service excellence. Evidence of continuous professional development and audit of practice will be expected of the post holder.&lt;/p&gt;\n&lt;p&gt;Being part of the University Hospital of North Midlands brings with it excellent career development opportunities and contributing to the training of student Radiographers on their clinical placement and with junior radiographers keen to progress their career.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be provided with an induction period supported by a mentor, during which time it will be ensured that they are equipped to undertake all of the required skills.&lt;/p&gt;\n&lt;p&gt;Your day to day role would include: • Efficient and effective running of the CTC and fluoroscopy lists, ensuring that policies and procedures are adhered to provide a safe and efficient environment for the patient •Performing and first line reporting of the CTC and fluorography examinations. Participate in the supervision of student Radiographers and develop junior radiographers • Maintaining good working relationships with all Departments • Be proactive and keen to develop and fulfil the responsibilities of the Band 6 role as in the Job Description. This will be an aspiring role to a Band 7 Radiographer on successful completion of the required training and experience.&lt;/p&gt;\n&lt;p&gt;Research and development of services is likely to be included in this role.&lt;/p&gt;\n&lt;p&gt;Stoke-on-Trent and the surrounding area, has great access to local amenities, the Peak District and The Roaches. Manchester, Birmingham and Liverpool are all reachable within an hour. Housing prices in the area are reasonably competitive.&lt;/p&gt;\n&lt;p&gt;We are very proud to have achieved and maintain QSI accreditation.&lt;/p&gt;\n&lt;p&gt;You will be required to apply for SCoR Advanced Practitioner Accreditation.&lt;/p&gt;\n&lt;p&gt;We have dedicated research and audit Radiographers as part of an investment to ingrain good practice, to learn and continually improve the Imaging department.&lt;/p&gt;\n&lt;p&gt;There are excellent opportunities to progress and develop within the imaging department.&lt;/p&gt;\n&lt;p&gt;Role Summary&lt;/p&gt;\n&lt;p&gt;To work at the University Hospital of North Midlands NHS Trust as a CT Colonography and advanced practice fluoroscopy radiographer, at the Royal Stoke and County Hospital sites.&lt;/p&gt;\n&lt;p&gt;To attain clinical expertise in CT Colonography and fluoroscopy imaging in the radiographic departments of UHNM.&lt;/p&gt;\n&lt;p&gt;Qualifications:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BSc (Hons) Radiography or equivalent.&lt;/li&gt;\n&lt;li&gt;Post graduate study related to CTC ideally but not essential as training will be provided to the successful candidate&lt;/li&gt;\n&lt;li&gt;HCPC Registered.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Erica Savage&lt;/p&gt;\n&lt;p&gt;Superintendent Radiographer&lt;/p&gt;\n&lt;p&gt;erica.savage@uhnm.nhs.uk&lt;/p&gt;\n&lt;p&gt;01782 671237&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion please contact Carl Bradbury, Consultant Radiographer for CT and GI Advanced Practice Services 01782 671451 carl.bradbury@uhnm.nhs.uk.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHNM, Stoke on Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Advanced Practitioner Radiographer (Procedural Imaging)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252238", "validThrough": "2020-11-09T23:59:59+0000"}