{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 Per annum"}}, "datePosted": "2020-10-23T14:16:02+0100", "description": "&lt;p&gt;We are looking for a Young Person’s apprentice to join The Peninsular Liaison &amp; Diversion Service, to support the Children and Young Person’s pathway.&lt;/p&gt;\n&lt;p&gt;Young People have a different experience in criminal justice pathways and custodial settings. In the community they face different challenges to and so offending behaviour can often have different root causes. Young person specific apprentices themselves having lived experience can bring an understanding of the needs of such Young People moving through the criminal justice system.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a Young Person to join our team as a community support worker, working alongside our Support Time and Recovery Workers and wider team of Senior Mental Health practitioners.&lt;/p&gt;\n&lt;p&gt;This new apprenticeship scheme supports progression into employment, for individuals who have lived experience / and therein are expert by experience. This scheme has been initiated across Liaison &amp; Diversion teams in the South of England, with a view to improving services, and widens the pool of people who might enter into employment in the NHS, by establishing a vocational pathway. Lived experience of the criminal justice system and of mental health, or other associated vulnerabilities is essential.&lt;/p&gt;\n&lt;p&gt;Base will be at Bodmin Police Hub which is now the Central Police HQ for Cornwall and where we have a number of services working within the Centre for Mental Health and Justice and co-located with our Police colleagues.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be supported by the Trust to achieve a NVQ Level 3 in Health and Social Care (Senior Support Worker), through the Apprenticeship Programme.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJo GreenJob titleTeam and Service ManagerEmail addressjogreen1@nhs.netTelephone number01208 834747&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bodmin Police HQ for Cornwall, Bodmin", "postalCode": "PL31 2FJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4686", "longitude": "-4.70173"}}, "title": "Young Persons Apprentice ST&amp;R Worker - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240871", "validThrough": "2020-11-08T23:59:59+0000"}