{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 pro rata per annum"}}, "datePosted": "2020-11-06T15:46:45+0000", "description": "&lt;p&gt;Lister House Surgery&lt;/p&gt;\n&lt;p&gt;Somerset NHS Foundation Trust is currently looking for salaried GP’s to join Lister House Surgery. We are a 6600 patient, rural dispensing practice located in the historic market town of Wiveliscombe, set in wonderful surrounds on the edge of Exmoor in the Brendon Hills. We have a supportive team of GPs providing surgeries in our modern, purpose built premises, supported clinically by two Nurse Practitioners working as part of our acute team, Practice Nurses and Health Care Assistant. We are also supported by a Clinical Practice Pharmacist and we offer sessions with First Contact Physios and Mental Health Workers. This is an excellent time for you to join a developing and innovative practice.&lt;/p&gt;\n&lt;p&gt;We can offer you flexible working options up to 8 full time GP sessions working across local practices, competitive remuneration package, opportunities for paid professional development and study leave, and opportunities for cross working and joint training, the opportunity to develop specialist skills, along with the opportunity to have the support of a larger organization to develop your career.&lt;/p&gt;\n&lt;p&gt;We offer a firm commitment towards training, education and development and you would be joining a supportive, committed and friendly GP team who value team support and good communication. We are the only Trust to offer Primary Care, Mental Health and Acute services offering you a chance to build a portfolio career.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About the Trust &lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Somerset NHS Foundation Trust is the first NHS trust on the English mainland to provide community, mental health and acute hospital services. We work with health and social care partners in Somerset to ensure that we deliver outstanding services that meet the needs of our population.&lt;/p&gt;\n&lt;p&gt;Our trust was formed on 1 April 2020 when Somerset Partnership NHS Foundation Trust and Taunton and Somerset NHS Foundation Trust merged. We provide community and mental health services across the whole of Somerset and acute hospital services in the north, west and centre of the county and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Straddled between areas of outstanding natural beauty and the idyllic rolling hills of Exmoor, featuring national hotspots for cycling, surfing, and climbing such as Cheddar Gorge, there’s plenty to keep you occupied alongside the abundance of music festivals and local traditions. Somerset offers you the chance to live near some of the UK’s most desirable locations; from the beaches in North Devon and Cornwall, to the cosmopolitan centres of Bristol, Bath and Exeter, whilst also being less than 2 hours from London. The County town of Taunton has diverse shopping, restaurants, and regularly hosts international music and sporting fixtures.&lt;/p&gt;\n&lt;p&gt;The South West of England is a highly desirable place to live. Compared to other regions, house prices in the area are quite reasonable. Rural properties in many of the pretty villages in South Somerset and North Dorset are within easy commute to the hospital. Many properties have land or large gardens attached.&lt;/p&gt;\n&lt;p&gt;If you’ve got family commitments, or are looking to settle down, Somerset offers some of the best schools in the country ranging from Public institutions such as Millfield, Queens College, Taunton School, Kings College, Wellington, and Blundell’s, to award winning state schools such as Richard Huish College which has been ranked in the top 10 of A-level providers nationally for the last eight years, through to secondary’s ranking in the top 5% nationally such as The Castle school in Taunton.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information:&lt;/p&gt;\n&lt;p&gt;For enquiries and to arrange an informal visit please contact; Emma Spiller, Practice Manager e.spiller@nhs.net&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the application process for this role please contact Jordan Pollard, Medical Recruitment Consultant on 07765898212 or Jordan.Pollard@somersetft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lister House Surgery, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Salaried General Practitioner - Lister House Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260453", "validThrough": "2020-12-03T23:59:59+0000"}