{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T17:01:17+0000", "description": "&lt;p&gt;** Please note this vacancy may close prior to the advertised closing date **&lt;/p&gt;\n&lt;p&gt;The Talent Pipeline team in the Talent Management division is part of the People Directorate within NHS England and Improvement. The aim of the Talent Pipeline team is to deliver outstanding career and leader development for our people at various career stages through the High Potential Scheme and Executive Director Pathway in support of the NHS People Plan. We believe in the value of our work and want it to be the best it can be. We are driven to improve, keep things simple and efficient, and value developing ideas by collaborating, learning, researching or innovating.&lt;/p&gt;\n&lt;p&gt;Our work is evolving fast and being agile is key to managing changing priorities. What we do is highly rewarding, with plenty of opportunity to use a range of professional skills and knowledge, while also developing your professional expertise within your role. Ultimately, we work together with our colleagues across NHS England and Improvement to make a positive difference to the quality of care delivered to patients and service users.&lt;/p&gt;\n&lt;p&gt;We are looking for a self-motivated, driven professional to join our team as an Executive Pathway Officer who can bring a broad range of skills and support to the Talent Pipeline team. The successful candidate will be motivated and enthusiastic about providing high quality support to deliver the best possible experience for our participants. In this role, you get to work flexibly across the programmes of work, provide core project support and coordination, as well as deploying your planning and coordination experience to execute a broad range of other activities with accuracy and quality. You will own specific workstreams and activities, with a level of autonomy in delivering those.&lt;/p&gt;\n&lt;p&gt;In order to be successful for this position, you will have strong verbal and written communication skills, with the ability to liaise, collaborate, coordinate with and involve multi-professional internal and external stakeholders. As our team is located across England, we rely on technology to support effective team working. You will be comfortable using technology to conduct your work i.e. Microsoft Office applications, Microsoft Teams, project management tools and applicant tracking software. Excellent organisational and planning skills are required for the role, preferably with previous experience of working within a people development function, such as Talent/OD/HR and in a project environment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Kat Savage&lt;/p&gt;\n&lt;p&gt;Job title: Executive Pathway Project Manager&lt;/p&gt;\n&lt;p&gt;Email address: kat.savage@leadershipacademy.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07920 361 003&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National Leadership Academy, Leeds", "postalCode": "LS1 4BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7935", "longitude": "-1.54353"}}, "title": "Executive Pathway Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252975", "validThrough": "2020-11-16T23:59:59+0000"}