{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-21T14:31:46+0100", "description": "&lt;h1&gt;SANDWELL AND WEST BIRMINGHAM HOSPITALS NHS TRUST&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CITY HOSPITAL, BIRMINGHAM &amp; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SANDWELL GENERAL HOSPITAL WEST BROMWICH &lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONSULTANT PHYSICIAN – GENERAL AND GERIATRIC MEDICINE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(2 x Posts)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;SWBH is undergoing an exciting period of transformation and expansion. As we near the completion of our new state-of-the-art hospital (MMUH), we are delighted to be able to announce the opportunity for candidates to join our growing, friendly and enthusiastic elderly care team.&lt;/p&gt;\n&lt;p&gt;We are a department with a strong and proud identity. We believe our older population deserve the very best and are passionate about developing a truly responsive and integrative service that puts patient well-being at the very heart and soul of everything we do.&lt;/p&gt;\n&lt;p&gt;We are seeking like-minded, dynamic and forward thinking clinicians to join us as we continue to develop our high performing services. Successful applicants will join a team of 6 passionate, innovative and dedicated geriatricians, committed to providing high quality care and services within the region.&lt;/p&gt;\n&lt;p&gt;The post exists as part of rotational service model which can include experience in core geriatrics, front-door frailty, orthogeriatrics, movement disorders and surgical liaison. However, as a large and dynamic department, there is ample opportunity to negotiate job plans to fit specialist interests. We strongly believe that personal development enhances our services and drives change. As such, subspecialty interests are not only welcome, but fully supported and actively encouraged.&lt;/p&gt;\n&lt;p&gt;The Trust maintains an accessible, open and visible management structure and considers communication and collaboration as core values. As such, any successful appointee will be encouraged to participate in the development, planning, management and delivery of services in partnership with colleagues. Successful applicants will need to demonstrate a commitment to multidisciplinary working and be expected to participate alongside colleagues in the on-call rota for acute medical admissions.&lt;/p&gt;\n&lt;p&gt;SWBH enjoys an excellent reputation for undergraduate and postgraduate teaching, having strong links with both the University of Birmingham and Aston University Medical School. Successful candidates will have ample support and opportunity to develop their roles as clinical teachers and educational supervisors. The Trust’s commitment to education cannot be demonstrated more clearly than by its two state-of-the-art education centres, extensively stocked libraries and a recently refurbished simulation teaching suite. SWBH is home to a number of University departments that are involved in active research within the Trust.&lt;/p&gt;\n&lt;p&gt;SWBH also benefits from key partnerships with the local commissioning group and the local authorities in the Right Care Right Here program. This program involves investment in new facilities within acute and community sectors; including our brand new state-of-the-art Midland Metropolitan University Hospital (MMUH).&lt;/p&gt;\n&lt;p&gt;The Trust is also very advantageously situated, with excellent accommodation, leisure facilities and outstanding schools nearby. It exists in close proximity to Birmingham International Airport and enjoys the excellent shopping and cultural facilities of both Dudley and Birmingham City centre.&lt;/p&gt;\n&lt;p&gt;Despite the excellent location and facilities within SWBH, we are very proud to say that our accomplished, hard-working and energetic workforce is our greatest asset. The Care of the Elderly Department strives to provide clinical excellence to those in need of our services. So if you are a dynamic, innovative and forward thinking clinician who would like to contribute, have your voice heard and maximise your potential, then we would be very excited to welcome you to our team.&lt;/p&gt;\n&lt;p&gt;Applicants should hold full GMC registration and a Certificate of Completion of Training (CCT) in General Internal Medicine (GIM) and Geriatric Medicine, or be eligible for entry to the Specialist Register within six months of the interview date. Demonstration of a commitment to service development, education and training or other academic achievement will be considered an advantage. This is a full time post but we are happy to consider those who wish to work less than full time in this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This Trust offers a competitive relocation package.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact: Dr A Majeed Specialty Lead on 0121 507 3636, or Dr Chetan Varma, Group Director, via the Cardiology secretaries on 0121 507 5841.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 7th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Proposed Interview date: 15th January 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Sandwell and West Birmingham Hospitals NHS Trust is committed to equality of opportunity and is a no smoking organisation&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr A MajeedJob titleClinical LeadEmail addressasim.majeed@nhs.netTelephone numberMobile Via Switch Board&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham, West Bromwich, Birmingham, West Bromwich", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Consultant in Geriatric and General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236864", "validThrough": "2020-12-07T23:59:59+0000"}