{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-02T15:15:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Harrogate &amp; District NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant in General Internal Medicine (with an interest in Respiratory) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;10 PAs &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A vacancy has arisen for a Consultant in General Internal Medicine who has a particular interest in Respiratory Medicine, this is a full-time position. This is an exciting time to join the Respiratory Department at HDFT. The Trust has committed to a significant investment in the medical workforce through the development of a new consultant post. These will ensure that we can continue to deliver high quality patient care as well as help drive forward service developments.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join the Respiratory Team, consisting of 2 full-time Consultants, 2 Specialist Registrars, a Specialist Respiratory ACP, a Respiratory Nurse Consultant, 3 WTE Respiratory Nurse Specialists, a Specialist Respiratory Physiotherapist and Lung Cancer Nurse Specialist. The post holder will join a friendly, well-established and innovative multi-disciplinary team to support the delivery of high quality care to patients with specialist problems in respiratory medicine. We have a successful respiratory outreach team.&lt;/p&gt;\n&lt;p&gt;There are excellent opportunities for the post holders to develop new or existing services according to their clinical interests. Any interest useful to a DGH will be considered including the development of an EBUS service.&lt;/p&gt;\n&lt;p&gt;The post holders will participate in the acute unselected medical on call rota.&lt;/p&gt;\n&lt;p&gt;HDFT is committed to supporting its staff with their health and wellbeing. Staff can access a range of online and over the phone support, wellbeing lounges, Freedom to Speak Up Guardians, Fairness Champions, the Chaplaincy, Staff Networks and Staff Governors.&lt;/p&gt;\n&lt;p&gt;Applicants must hold, or expect to hold within six months of the date of interview, the appropriate CCT (or equivalent) and be listed on the General Medical Council’s Specialist Register. &lt;br /&gt;&lt;br /&gt;For further information or to arrange an informal visit please contact Dr Claire Taylor, Respiratory Physician on 01423 553394. Further enquiries can be made to Dr Matt Shepherd, Clinical Director on 01423 553083 or Mike Forster, Operational Director on 01423 553041&lt;/p&gt;\n&lt;p&gt;If you have any questions regarding the application process please contact the Medical Staffing department on (01423) 553130.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate District Hospital, Harrogate", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Consultant In General Medicine (with an interest in Respiratory)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252562", "validThrough": "2020-11-22T23:59:59+0000"}