{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37000", "minValue": "37000", "unitText": "YEAR", "value": "Up to £37,000 pro rata"}}, "datePosted": "2020-10-19T11:42:48+0100", "description": "&lt;p&gt;Nuffield Health is looking to recruit an enthusiastic and motivated Senior Physiotherapist to join the team in Plymouth.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As this is a part time role, there is potential that this could be an inpatient only post, for the right candidate or the post could be a mix of both inpatients and outpatients. In an outpatient setting you will see a wide range of musculoskeletal conditions from sports to workplace related injuries. There will be a requirement to cover the occasional orthopaedic weekend on the ward and also telephone triage consultations as part of the role. In each area you will play a key role in helping our patients achieve, maintain and recover to the level of health and wellbeing that they aspire to.&lt;br /&gt;&lt;br /&gt;The role may be based across any of our sites if a combined inpatient/outpatient role: Nuffield Health Plymouth Hospital, Nuffield Health Devonshire Gym and Nuffield Health Plymouth Gym.  You will have the exciting opportunity to treat your patients utilising state of the art gym equipment and rehabilitation facilities. You will work within a multidisciplinary team including fitness professionals and clinicians to optimise the health of our patients.&lt;br /&gt;&lt;br /&gt;We believe in our people and to help you develop your skills and progress your career in Nuffield Health you will be supported by your regional clinical lead, have protected CPD time, access to a local in-service training program and training events organised by the Nuffield Health Academy including both clinical and leadership courses.&lt;br /&gt;&lt;br /&gt;As Nuffield Health continues to grow you can choose to develop your career within clinical roles or by moving into managerial positions. We support and encourage post-graduate education and have formed a partnership with Manchester Metropolitan University which will offer fantastic learning and research opportunities in the future.&lt;br /&gt;&lt;br /&gt;About the Role&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will need to deliver high quality, effective clinical care. We strongly adhere to our values and beliefs at Nuffield Health, encouraging behaviour which is enterprising, passionate, independent and caring.&lt;/li&gt;\n&lt;li&gt;The role would suit individuals with a desire of making a positive impact across a large workforce, while looking to create &amp; build client relationships within a corporate setting.&lt;/li&gt;\n&lt;li&gt;We encourage flexible working, which can include triage working from home and flexibility with shift patterns.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;The Main Clinical Duties and Responsibilities are to&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deliver excellent clinical care that is evidence based, Safe, Effective, Caring, Well-led and responsive to our patient’s needs.&lt;/li&gt;\n&lt;li&gt;Ensure on-going monitoring of the standard of treatment provided.&lt;/li&gt;\n&lt;li&gt;Be compliant with all professional, clinical and integrated governance standards and participate in clinical audit and other quality assurance processes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;Your Qualifications, Experience, Skills and Values&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;With a BSc in Physiotherapy or equivalent, you’ll be registered with the Health and Care Professions Council. You will have evidence of further professional training and continual professional development, reflecting your desire to develop as a practitioner.&lt;/li&gt;\n&lt;li&gt;You’ll be a confident communicator with the ability to engage effectively with the general public and other healthcare professionals. With a commitment to the use of evidence-based practice, you’ll also be able to demonstrate excellent manual therapy skills.&lt;/li&gt;\n&lt;li&gt;We expect you to be a competent and confident IT user and to be well organised – you’ll have the ability to prioritise and deal with your varied workload in an effective and timely manner.&lt;/li&gt;\n&lt;li&gt;It’s equally important that you share our values. We believe in putting people first and providing personalised, holistic healthcare. That makes you part of a much wider team, working to create a healthier future for each individual client.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;Why Nuffield Health?&lt;br /&gt;&lt;br /&gt;At Nuffield Health, we help people live life to the full – not only our patients and clients, but our employees too. With our support, training, generous benefits package and respect for balance, you too can make the most of everything in life.&lt;br /&gt;&lt;br /&gt;This is an exciting time for us and it could be for you too. Our vision will help individuals achieve, maintain and recover to the level of health and wellbeing that they aspire to.&lt;br /&gt;&lt;br /&gt;Key Employee Benefits&lt;br /&gt;&lt;br /&gt;As a permanent employee you will be entitled to generous holiday and leave arrangements, a personal CPD budget for your own development, local in-service and development program, flexible pension options, Private healthcare and free gym membership, for more information all our benefits please see our website.&lt;br /&gt;&lt;br /&gt;Nuffield Health is committed to equal opportunities in the recruitment, training, and development of our employees.&lt;br /&gt;&lt;br /&gt;We have a duty to apply to the Disclosure and Barring Service (DBS) for disclosure on successful candidates.&lt;br /&gt;Unfortunately do not sponsor candidates for our Senior Physiotherapy positions.&lt;br /&gt;We may change the closing date if we receive a high number of responses for this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary - up to £37,000 pro rata (based on experience)&lt;/p&gt;\n&lt;p&gt;Location - Plymouth&lt;/p&gt;\n&lt;p&gt;Hours - Part time, 24 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL6 8BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4187", "longitude": "-4.11449"}}, "title": "Senior Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232067", "validThrough": "2020-11-30T23:59:59+0000"}