{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro-rata)"}}, "datePosted": "2020-10-27T10:01:36+0000", "description": "&lt;p&gt;Registered Nurse – Band 5&lt;/p&gt;\n&lt;p&gt;Full Time/Part Time Permanent contracts&lt;/p&gt;\n&lt;p&gt;Wythenshawe Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Be the Nurse you want to be&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Join an organisation that cares for everyone. Bringing together 10 hospitals as well as community services from across Manchester, Trafford and beyond; at Manchester University NHS Foundation Trust (MFT) we pool our knowledge, skills and resources to be the best for our patients, and each other.&lt;/p&gt;\n&lt;p&gt;Each and every colleague in MFT plays their part in providing outstanding care. Join us at Wythenshawe Hospital and we’ll give you every opportunity to build a hugely rewarding career with great job satisfaction in knowing your dedication and commitment has made a real difference to our patients – at a time right now that’s so important.&lt;/p&gt;\n&lt;p&gt;The Opportunity&lt;/p&gt;\n&lt;p&gt;Whatever you’re searching for in your next career move - whether you’re just graduating as a qualified nurse and looking for somewhere to support you for your exciting career ahead, whether you’re a nurse with experience looking to change your job or profession completely, whether you want to work full or part time - you’ll find real variety and fulfilment in the role of a Registered Nurse at MFT.&lt;/p&gt;\n&lt;p&gt;Wythenshawe Hospital&lt;/p&gt;\n&lt;p&gt;We’re a major acute teaching hospital and recognised as a centre of clinical excellence, providing district general and tertiary specialist services to our local community. Rated as outstanding for ‘caring’ in our 2019 CQC report, our fields of expertise include cardiology and cardiothoracic surgery, heart and lung transplantation, respiratory conditions, urology, burns and plastics &amp; cancer and breast care services. With this in mind, there really are endless opportunities to start to consider the type of nursing specialism you’d like to practice as you launch your new career.&lt;/p&gt;\n&lt;p&gt;Located in the heart of the community, our hospital has a real family feel where recruiting a workforce that is reflective of the patients we care for is fundamental to our values as a highly respected and trusted care provider. We have strong transports links to Manchester City Centre and inner city suburbs with regular Metro link and Bus Service routes being available 7 days a week. On site itself there’s discounted staff parking plus you’ll find some great amenities that means you don’t even need to step foot off campus during your breaks. These include an onsite Nursery, an ATM, Subway, Marks &amp; Spencer Food Hall, WHSmith, Costa Coffee, Lloyds Pharmacy, a dedicated on site eatery with ambient seating for your enjoyment, outdoor dining spaces and a large Education &amp; Research centre offering a wealth of teaching and learning facilities including a state of the art simulation suite plus a full Employee Health &amp; Well Being Programmes on offer.&lt;/p&gt;\n&lt;p&gt;The Role&lt;/p&gt;\n&lt;p&gt;To join us, you will be a Registered Nurse with valid registration on the appropriate part of the NMC register and have excellent written and verbal communication skills.&lt;/p&gt;\n&lt;p&gt;You’ll find working with us extremely rewarding as part of a team dedicated to providing the best possible care and experience to all our patients. You’ll be joining our Trust at an exciting time as we grow and improve our services, and we know you will make a positive contribution to its future success.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Support and Development&lt;/p&gt;\n&lt;p&gt;To support your career, we offer a wide range of development and educational initiatives that will assist you throughout your service here at MFT. We are strongly committed to all of our employees having a robust Personal Professional Development Plan throughout their career. We also offer pastoral support, recognising how important your health and wellbeing is, particularly during these unprecedented times. If you are a newly qualified member of staff, you will be supported in your transition to your new role with our dedicated preceptorship program which is second to none.&lt;/p&gt;\n&lt;p&gt;Interested? Apply now!&lt;/p&gt;\n&lt;p&gt;To apply for a career as a Registered Nurse at MFT, please submit an application via the ‘apply online now’ button at the bottom of the page.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRecruitment TeamEmail addressresourcing@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Staff Nurses - Wythenshawe Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243904", "validThrough": "2020-11-10T23:59:59+0000"}