{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "53733", "unitText": "YEAR", "value": "£53,733 - £74,661 per annum"}}, "datePosted": "2020-10-21T09:16:10+0100", "description": "&lt;p&gt;&lt;strong&gt;Specialty Doctor in General Adult Psychiatry&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cromwell House CMHT Salford&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;10 Programmed Activities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent positon&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cromwell House community mental health team, part of the Salford division of Greater Manchester Mental health foundation trust, are looking for an enthusiastic General Adult psychiatry speciality doctor colleague.&lt;/p&gt;\n&lt;p&gt;Greater Manchester Mental Health NHS Foundation Trust came into being in January 2017 and followed the acquisition of Manchester Mental Health and Social Care NHS Trust by Greater Manchester West Mental Health NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;The Trust provides a wide range of local services to Manchester, Bolton, Salford and Trafford residents. In addition, the Trust provides a number of specialist and secure mental health services supporting Greater Manchester, the North West and beyond. This means that we are well supported by specialist services and have multiple opportunities to develop special interests in sub specialities and research competencies.&lt;/p&gt;\n&lt;p&gt;The Chief Executive of the Trust is Neil Thwaite. The Chair is Mr Rupert Nichols. The Medical Director is Dr Alice Seabourne and Dr Chris Daly is the Deputy Medical Director. Responsible Officer for the Trust is Dr M Campbell.&lt;/p&gt;\n&lt;p&gt;This is a full time appointment for a specialty doctor to work within a community mental health team to support one of the team consultants. This is an established position that has become available due to the previous doctor leaving the post. It is a permanent positon&lt;/p&gt;\n&lt;p&gt;The post holder will work with Dr Kamal, acting consultant psychiatrist. The team comprises of care co-ordinators (CPNs, Social Workers and OTs), one band 7 psychologist, two senior practitioners for nursing and a senior practitioner for social work. There is also a nurse-led clinic run by the senior practitioner.&lt;/p&gt;\n&lt;p&gt;The Appointee will participate in the middle-tier on-call rota within Salford. Currently this is a 1 in 10 rota. The on-call would be pro-rata.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Matthew MillerAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Matthew Miller&lt;/p&gt;\n&lt;p&gt;Matthew.miller@gmmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford, Salford", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Speciality Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235634", "validThrough": "2020-11-11T23:59:59+0000"}