{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069"}}, "datePosted": "2020-11-02T12:01:47+0000", "description": "&lt;p&gt;Clinical Research Fellow in Early Phase Cancer Trials&lt;/p&gt;\n&lt;p&gt;Department of Oncology, University of Oxford, Churchill Hospital, OXFORD, OX3 7LE, United Kingdom&lt;/p&gt;\n&lt;p&gt;The Department of Oncology has an opportunity for a Clinical Research Fellow to work on the Early Phase Cancer Trials Unit at the University of Oxford from April 2021. The post holder will be working alongside staff in the Oxford NIHR Biomedical Research Centre, Oxford University Hospitals NHS Foundation Trust and the University of Oxford. As part of the training programme the applicant will have the opportunity to undertake a clinical or translational research project at the Oxford Cancer Centre.&lt;/p&gt;\n&lt;p&gt;The Early Phase Cancer Trials Unit at the University of Oxford is a specialist, dedicated clinical trials unit, supporting early phase research integrating oncology and haematology as a seamless service. Recruiting over 150 patient per year, our key remit is the testing of novel therapies, on a bespoke 15 bedded ward incorporating a sample handling laboratory. Under the direction of our Principle Investigators, who are world-leading clinicians and clinician scientists, a team of research nurses and clinical fellows work across the broad portfolio of studies, providing expertise in patient management and protocol compliance.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a GMC registered Medical Practitioner (or eligible for GMC registration), with relevant and substantial hospital service, including experience of managing cancer patients, and to have held specialist training hospital appointments in oncology or surgery.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSimon LordJob titleConsultant medical oncologistEmail addresssimon.lord@oncology.ox.ac.ukTelephone number01865 235315&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Early Phase Clinical Trials Unit, Churchill Hospital, Oxford", "postalCode": "OX3 7LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Clinical Research Fellow in Early Phase Cancer Clinical Trial", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251942", "validThrough": "2020-12-14T23:59:59+0000"}