{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38694", "minValue": "38694", "unitText": "YEAR", "value": "£38,694 pa pro rata"}}, "datePosted": "2020-10-26T16:31:27+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking to appoint a Clinical Fellow (CT1/2) doctor in General Medicine, to be based on our Harptree Unit (Endocrinology and Diabetes). This post is available immediately, for a period of 12 months at Weston General Hospital and will include participating in the general medicine junior rota. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Weston General Hospital is an associated teaching hospital of the University of Bristol and the post offers broad medical experience across the field of medical specialties. The holder of this post will usually work within one specialty team, however may be asked to cover in other areas across general medicine at times in order to maintain a safe effective service.&lt;/p&gt;\n&lt;p&gt;Within General Medicine, there are currently 19 Consultants, of which 13 are substantively employed with special interests in Respiratory Medicine, Cardiology, Gastroenterology, Diabetes and Endocrinology, Acute Medicine, Stroke, Rheumatology and Care of the Elderly. There is a firm commitment to continuing professional development and the opportunity to participate in specialist clinics or procedure lists will be available and can be discussed with the successful applicant(s).&lt;/p&gt;\n&lt;p&gt;Please note that the Clinical Fellow post is at CT1/2 level but is not recognised by the Royal College of Physicians.&lt;/p&gt;\n&lt;p&gt;Weston General Hospital may be one of the smallest Acute NHS Trusts in the UK but we couldn’t be more committed to delivering the right care in the right place at the right time.&lt;/p&gt;\n&lt;p&gt;An integrated service in general medicine and care of the elderly has matured within Weston General Hospital. The team of consultants are enthusiastic and forward thinking. In addition to an acute in-patient and out-patient medical service, specialist diabetic and non-invasive cardiology services are provided.&lt;/p&gt;\n&lt;p&gt;Acute medical work is focused on 195 beds at Weston General Hospital in eight wards. ITU/HDU facilities are based on five beds.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised as providing efficient and well-organised Cancer services. This has been supported by both Regional, and National Accreditation processes. As part of the Avon, Somerset and Wiltshire Cancer Network, the Trust provides a range of cancer services. Those services already accredited include, Breast Care and Urology.&lt;/p&gt;\n&lt;p&gt;We pride ourselves in being a small, friendly hospital, with real drive to improve both patient care and the working environment for our staff.&lt;/p&gt;\n&lt;p&gt;North Somerset, the surrounding county, has long coastlines with superb cliff tops and English countryside. You&#39;ll find yourself visiting the Mendip Hills, the Quantocks and Cheddar Gorge sooner or later. The large, diverse cities of Bristol and Bath are only a short journey by car or train and our convenient location just off Junction 21 of the M5 mean the rest of Somerset, Devon and Cornwall are virtually on the doorstep.&lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol and Weston NHS Foundation Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults. All staff must be aware of, and follow Weston Area Health Trust guidance and policies on Safeguarding Children and Vulnerable adults and it is your duty to report any concerns you may have through your line manager and the Trust’s designated Safeguarding Lead.&lt;/p&gt;\n&lt;p&gt;For more information about our Trust and the area in which we are based, please visit our hospital website.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLaura Jones / Jo WhitehouseJob titleSpecialty Managers for General MedicineEmail addresswnt-tr.westonmedicine@nhs.netTelephone number01934 636363&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Weston General Hospital, Weston-super-Mare", "postalCode": "BS23 4TQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3223", "longitude": "-2.97141"}}, "title": "Clinical Fellow (CT1/2) in General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243429", "validThrough": "2020-11-08T23:59:59+0000"}