{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-11-04T14:01:05+0000", "description": "&lt;p&gt;In line with the government’s priority to increase access and availability of mental health and wellbeing support for children and young people, the new Mental Health Support Teams (named by children and young people in the region as Wellbeing in Mind teams) are an exciting opportunity to deliver evidence-based early interventions for children and young people, working across both educational settings and healthcare sectors in England.&lt;/p&gt;\n&lt;p&gt;We currently have a partl-time vacancy (22.5 hpw) within our Scarborough Wellbeing in Mind team. The Wellbeing in Mind Senior Clinician plays a key role in:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Forming strong working relationships with a variety of stakeholders&lt;/li&gt;\n&lt;li&gt;Providing consultation to education colleagues and supporting education settings to embed a whole school approach to wellbeing&lt;/li&gt;\n&lt;li&gt;Developing and delivering evidence-based time limited interventions to young people within education settings&lt;/li&gt;\n&lt;li&gt;Developing and delivering training packages to education colleagues&lt;/li&gt;\n&lt;li&gt;Evidencing the outcomes of the Wellbeing in Mind service&lt;/li&gt;\n&lt;li&gt;Providing clinical supervision to trainee Education and Mental Health Practitioners.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Specific supervisory training for this role will be provided if successful candidates don’t already hold this qualification.&lt;/p&gt;\n&lt;p&gt;We are looking for a practitioner with experience of working in a setting where children and young people&#39;s mental health has been the primary focus. These posts are open to professionals with a variety of relevant backgrounds, but post holders must evidence meeting the essential criteria listed in the person specification within the job description.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;We would welcome conversations with anyone who is interested in the post. If you are interested please email the team, providing us with your contact details and we will be in touch as soon as possible.&lt;/p&gt;\n&lt;p&gt;Rob Berry, Service Manager or Phil Wilkins, Clinical Lead&lt;/p&gt;\n&lt;p&gt;tewv.wellbeinginmind@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scarborough and Ryedale, Scarborough &amp; Ryedale", "postalCode": "DL2 2TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5436", "longitude": "-1.59116"}}, "title": "MHST Senior Clinician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256128", "validThrough": "2020-11-18T23:59:59+0000"}