{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 per Annum"}}, "datePosted": "2020-10-21T16:16:13+0100", "description": "&lt;p&gt;NHFT are currently looking to appoint a Specialty Doctor in Rehabilitation Medicine and Elderly Care.  The role will is based at Corby Community Hospital in Corby, within the County of Northamptonshire. &lt;/p&gt;\n&lt;p&gt;The candidate must have UK experience in Rehabilitation Medicine and Elderly Care. &lt;/p&gt;\n&lt;p&gt;The post holder will demonstrate a commitment to clinical excellence and an ability to work as part of a multidisciplinary team.  You will need to be a born leader and a people person who loves to collaborate and innovate. You need to be MRCP or equivalent with full registration. The ability to travel to all locations within the Trust is essential.&lt;/p&gt;\n&lt;p&gt;There are many opportunities to be involved in clinical research and you will have access to the Trust research fellows to help develop research ideas.  The Trust already has a portfolio of research studies in Old Age Dementia and Physical Health.&lt;/p&gt;\n&lt;p&gt;The Trust hosts Undergraduates from Leicester and Norwich Medical schools with numerous opportunities to teach this cohort.&lt;/p&gt;\n&lt;p&gt;Northamptonshire Healthcare NHS Foundation Trust is an Employer which is committed to developing you and that prides itself on being a diverse and equal opportunity employer.  NHFT is rated as an Outstanding organisation by the CQC.  &lt;/p&gt;\n&lt;p&gt; Northamptonshire is a county with varied countryside and numerous small villages as well as a range of good housing, excellent rail and road connections to London and elsewhere and good schools making it an attractive place for family living.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Corby Community Hospital, Corby", "postalCode": "NN17 2UN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4913", "longitude": "-.710844"}}, "title": "Specialty Doctor in Rehabilitation Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237241", "validThrough": "2020-11-20T23:59:59+0000"}