{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa pro rata"}}, "datePosted": "2020-10-15T16:40:37+0100", "description": "&lt;p&gt;Applications are invited for a substantive consultant post in General Anaesthesia with a sub-specialty interest in Obstetric Anaesthesia. The successful applicant will join a group of 33 substantive consultants within the General Anaesthesia group. General anaesthesia at University Hospitals Bristol &amp; Weston sits within the Division of Surgery. The Sir Humphry Davy Department of Anaesthesia provides services for four clinical Divisions: Surgery (general anaesthesia and critical care), Specialised Services (cardiac anaesthesia), Women &amp; Children’s (paediatric and obstetric anaesthesia) and Weston. There are a total of over 90 consultants across the whole Department of Anaesthesia.&lt;/p&gt;\n&lt;p&gt;UHBW anaesthetic obstetric services are located at St. Michael’s Hospital geographically separate from but close to the main Bristol Royal Infirmary building. We have over 5,000 deliveries per annum on our delivery suite and on site midwifery led unit. There is also a midwifery led unit at Weston General Hospital.&lt;/p&gt;\n&lt;p&gt;St Michael’s Hospital is a tertiary referral centre accepting referrals from the whole of the South West region. We have excellent facilities to care for women with complex medical disorders in pregnancy as well as congenital and acquired cardiac conditions. We contribute to high risk cardiac and maternal medicine clinics, participate in the multidisciplinary team planning, and have close links with our Fetal Medicine Unit and the Bristol Heart Institute.&lt;/p&gt;\n&lt;p&gt;Applicants with an obstetric interest would work as part of a team of 10 consultants with regular obstetric sessions covering elective caesarean deliveries, delivery suite and emergency obstetric theatres. As a teaching hospital we provide training in obstetric anaesthesia for ST3 level and above and also have an advanced obstetric module. We participate in regular multidisciplinary training including Obstetric Emergency, Simulation and Enhanced Maternal Care.&lt;/p&gt;\n&lt;p&gt;This post will also address a flexible service requirement for maxillofacial, ENT, dental, obstetrics, gynaecology, thoracic, upper &amp; lower GI, ophthalmic, acute and chronic pain and pre-operative assessment. The post holder will be expected to contribute to the general on-call consultant rota (currently approximately 1:20).&lt;/p&gt;\n&lt;p&gt;The role will be split across the following hospital sites: adult general anaesthetic services provided at Bristol Royal Infirmary, Bristol Eye Hospital and St Michaels Hospital (obstetrics). In addition, we support ECT services at Callington Road Hospital and ambulatory anaesthesia services at the South Bristol Community Hospital. &lt;br /&gt;&lt;br /&gt;UHBW is a large inner-city teaching hospital with close links to the new Southmead Hospital and the University of Bristol. There is a strong tradition of teaching in the department and we support the running of Bristol Medical Simulation Centre, based at our site. &lt;br /&gt;&lt;br /&gt;The applicant must hold FRCA (UK) or equivalent and be within 6 months of their CCT date at the time of interview. Although there is opportunity to develop the specialist interest, we are looking for applicants who are prepared to work flexibly to ensure smooth service delivery. More detailed person specification is available with the job descriptions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Nilesh Chauhan&lt;/p&gt;\n&lt;p&gt;Deputy Divisional Director: Ms Victoria MacFarlane&lt;/p&gt;\n&lt;p&gt;Lead for Obstetric anaesthesia: Dr Issie Gardner&lt;/p&gt;\n&lt;p&gt;Contact Number: 0117 342 2163 contact Jane McClean&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Consultant in Anaesthesia, subspecialty interest Obstetric Anaesthesia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229039", "validThrough": "2020-11-30T23:59:59+0000"}