{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £30,615 dependant on experience/ per ann"}}, "datePosted": "2020-10-28T11:16:48+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Coder Band 3 - 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and motivated individual to join our established Clinical Coding Team.&lt;/p&gt;\n&lt;p&gt;The Clinical Coding Team is responsible for the extraction and translation of inpatient information using the ICD-10 and OPCS-4 Coding Classifications. This information is essential for the effective management of the Trust and crucial to the National Tariff Payment System that underpins Trust income. Coded data is also important for clinical audit, governance and research.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As part of this interesting and varied role you must have a logical approach and an eye for detail. Full training will be given and is also an ongoing requirement.&lt;/p&gt;\n&lt;p&gt;Initial training consists of both departmental training and attendance on a nationally recognised 21 day course.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Career progression is encouraged and fully supported throughout the pay bands. Successful completion of a department exam after a minimum of 1 year will result in progression to band 4. Following this attainment of band 5 is dependent on successful completion of the National Clinical Coding Qualification (NCCQ). Fully accredited Clinical Coders are encouraged to apply and providing they meet the essential requirements will be appointed on a band 5. Please contact us for these requirements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We strongly encourage any interested applicants to visit the team, when we will explain in more detail what clinical coders actually do and give you an opportunity to ask questions. Please phone to arrange a date and time to visit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please contact:&lt;/p&gt;\n&lt;p&gt;Rachel Franklin, Deputy Clinical Coding Manager on 01865 743156&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 11th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Franklin, Deputy Clinical Coding Manager, Rachel.franklin2@ouh.nhs.uk, 01865743156&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Headington, oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Clinical Coder", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246246", "validThrough": "2020-11-11T23:59:59+0000"}