{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum, pro rata"}}, "datePosted": "2020-11-06T11:46:15+0000", "description": "&lt;p&gt;Are you a motivated and innovative administrator looking to further develop your knowledge and skills within the Health Visiting service?&lt;/p&gt;\n&lt;p&gt;If so, Berkshire Healthcare Foundation Trust has an exciting opportunity to work across the richly diverse area of Reading supporting the Health Visiting Teams to deliver services to the children aged 0-5 and their families. The post holder will support the clinical teams and will be given a bespoke package of training and support.&lt;/p&gt;\n&lt;p&gt;Health Visiting is part of the Children, Young People and Families directorate, which was rated “Good” in the CQC inspection in July 2018. Our health visiting service is proud to fully Baby Friendly accredited.&lt;/p&gt;\n&lt;p&gt;Applicants are required to have excellent interpersonal skills, the ability to work in partnership with other teams and agencies, excellent communication skills and a passion for working with children and families. A commitment to team working, flexibility are essential.&lt;/p&gt;\n&lt;p&gt;We share the vision, values and goals of the organisation to ensure the delivery of safe and effective services to the local population.&lt;/p&gt;\n&lt;p&gt;As we grow and innovate, we maintain a team-focused approach that includes the benefits of working for a Trust at the forefront of using technology to support service delivery as a global digital exemplar. Robust induction, regular management supervision and a responsive appraisal process demonstrates an excellent range of internal and external training opportunities to support on-going professional development.&lt;/p&gt;\n&lt;p&gt;The successful applicant would be working with the South Reading Health Visiting team at Whitley Health &amp; Social Services Centre but flexibility around working from different sites within Reading would be required.&lt;/p&gt;\n&lt;p&gt;For an informal discussion/visit please call Nazia Khan, admin team leader on 07717 653885 or Nazia.khan@berkshire.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Health Visiting Reading, Reading", "postalCode": "RG2 7PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4314", "longitude": "-.962633"}}, "title": "Secretary for Health Visiting team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259478", "validThrough": "2020-11-15T23:59:59+0000"}