{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 ST1-3"}}, "datePosted": "2020-10-29T12:15:46+0000", "description": "&lt;p&gt;BRIGHTON &amp; SUSSEX UNIVERSITY HOSPITALS NHS TRUST&lt;br /&gt;CLINICAL FELLOW PAEDIATRIC SURGERY (ST1-3)&lt;br /&gt;1 POST AVAILABLE TO COMMENCE FEBRUARY 2020 UNTIL AUGUST 2020&lt;br /&gt;For 6 months&lt;br /&gt;(POST TO COVER A VACANCY)&lt;br /&gt;You will join a department of six Consultant Paediatric Surgeons, supported by a team of Consultant Paediatric Anaesthetists, Consultant Paediatricians, Neonatologists, Radiologists and Pathologists.&lt;br /&gt;The department operates as a regional service, networked with our partner organisations at East Sussex Hospitals, Western Sussex Hospitals, Surrey and Sussex Hospitals and Sussex Community NHS Trusts, including with Chailey Clinical Services.&lt;br /&gt;The department continues to actively pursue the repatriation of local children for surgery from London or other providers and will work collaboratively with all providers in South East Coast to deliver this in the interest of children and young people.&lt;br /&gt;Together with the Trevor Mann Baby Unit, the department provides a neonatal surgical service for the South East Coast region.&lt;br /&gt;Other key strengths of the department include laparoscopic surgery, urology and the regional intestinal failure service in collaboration with the paediatric gastroenterology and nutrition team.&lt;br /&gt;The department is recognised by the RCS as a teaching centre and currently hosts two numbered paediatric surgical trainee positions and one general surgical trainee position. &lt;br /&gt;Based at the Royal Alexandra Children’s Hospital, the department benefits from the facilities this award winning new hospital provides. This includes a paediatric theatre suite, critical care facility and a paediatric radiology service. &lt;br /&gt;There are related tertiary paediatric surgical specialties on site including ENT, ophthalmology, orthopaedics, maxillofacial, dentistry and orthodontics. We have a close and evolving relationship with the Queen Victoria regional plastics and burns service.&lt;br /&gt;The department is playing an active role in supporting the Trust’s ambition to develop as a regional trauma centre.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRuth HallowsJob titleClinical Lead - Paediatric SurgeryEmail addressruth.hallows@nhs.netTelephone number01273 696955Additional contact information&lt;/p&gt;\n&lt;p&gt;Miss Ruth Hallows, Clinical Lead, Paediatric Surgery&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Alexandra Children&#39;s Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Clinical Fellow Paediatric Surgery ST1-3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248272", "validThrough": "2020-11-22T23:59:59+0000"}