{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-10-28T10:02:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Fixed term/ Secondment until March 2021 (with possible extension)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have excellent interpersonal skills? Are you flexible, approachable and a team player? Do you have knowledge and experience of project management?&lt;/p&gt;\n&lt;p&gt;This Project Manager post is an exciting opportunity to pay a role in supporting an ambitious programme to transform the University Hospitals of Derby and Burton (UHDB) Histopathology into a Digital Service working 37.5 hours per week. This is a fixed term/secondment post and will continue through to March 2021 initially.&lt;/p&gt;\n&lt;p&gt;Derbyshire Pathology was formed on the 1st July 2018 of the laboratories at Chesterfield Royal Hospital and Royal Derby Hospital. There are many projects underway in Derbyshire Pathology requiring the services of a Projects Manager and the biggest is the replacement of the existing laboratory information system. Histology is also looking to implement a Digital Pathology System to enable the digitisation of stained slides to support the Consultant Histopathologist workforce.&lt;/p&gt;\n&lt;p&gt;As Project Manager for Digital Pathology, you will help ensure alignment and coordination of the project to enable delivery of key strategic objectives, You will assist with the development and implementation of a complex, high value project, taking responsibility for administrative and project support.&lt;/p&gt;\n&lt;p&gt;Assisting with coordinating resources effectively, you will ensure that project documentation is prepared and shared in line with project timetables and deadlines. This will involve coordinating with a wide range of stakeholders whilst being expected to arrange, administer and represent the team at meetings and workshops.&lt;/p&gt;\n&lt;p&gt;Your role will include organising meetings, preparing paperwork, preparing agendas and minutes, monitoring project progress, recording risks and issues, managing change and facilitating the timely achievement of objectives in conjunction with the Service Manager and wider implementation team.&lt;/p&gt;\n&lt;p&gt;We would like you to have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowledge of project management methodologies, administrative procedures and confident MS Office skills;&lt;/li&gt;\n&lt;li&gt;Experience of working with a wide range of stakeholder groups to develop and maintain strong working relationships;&lt;/li&gt;\n&lt;li&gt;Experience of working in a project management environment and used to delivering work at pace to a high standard;&lt;/li&gt;\n&lt;li&gt;Experience of coordinating a range of complex projects and initiatives, so that regular reporting arrangements are in place so colleagues, programme boards and key stakeholders are kept informed;&lt;/li&gt;\n&lt;li&gt;Ability to minute technical project meetings;&lt;/li&gt;\n&lt;li&gt;Exceptional organisational, information management and multi-tasking skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post is available as either a secondment or fixed term contract until March 2021&lt;strong&gt;. &lt;/strong&gt;If applying for a secondment, please ensure you have the support of your current manager for release on an early basis.&lt;/p&gt;\n&lt;p&gt;To further develop your existing skills and knowledge, you will be valued and be part of a supportive friendly and highly motivated team and gain insight into new ways of working across the Pathology Business Unit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development opportunities, including both professional and leadership development, together with an opportunity to work across some or all of our 5 sites depending on specialty&lt;/li&gt;\n&lt;li&gt;Support through every step of the way from recruitment to when you join our team and beyond&lt;/li&gt;\n&lt;li&gt;Friendly, supportive and caring colleagues&lt;/li&gt;\n&lt;li&gt;A variety of other staff benefits including employee assistance programme, discounted gym membership, onsite fitness classes, car schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key facts about our Trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Every day our hospitals see more than 4,000 outpatients&lt;/li&gt;\n&lt;li&gt;We see more Trauma &amp; Orthopaedic outpatients than any other Trust – over 3,300 per week&lt;/li&gt;\n&lt;li&gt;An average 860 patients are seen in A&amp;E every day – the 6th largest in the country&lt;/li&gt;\n&lt;li&gt;Our hospitals admit more than 220 emergency patients every day&lt;/li&gt;\n&lt;li&gt;We carry out more planned surgical operations than any other Trust in England with almost 50,000 operations taking place in our 52 operating theatres&lt;/li&gt;\n&lt;li&gt;We are one of only 5 Trusts nationally with more than 50 operating theatres&lt;/li&gt;\n&lt;li&gt;We carry out more than 300 elective procedures each working day&lt;/li&gt;\n&lt;li&gt;We employ 12,000 staff across our 5 hospital sites&lt;/li&gt;\n&lt;li&gt;We have a Director of Allied Health Professionals who is committed to provide leadership, progression and direction to AHPs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing date of applications: 11 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 25 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises. If you have Covid-19 related symptoms or are shielding and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;/p&gt;\n&lt;p&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gavin Regan - Cellular Pathology Service Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Emial: gavin.regan@nhs.net&lt;/p&gt;\n&lt;p&gt;Tel: 01332 788248&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Jamie Crees - Cellular Pathology Service Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tel: 01332 788248&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Nirav Gandhi - Associate Clinical Director Cellular Pathology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tel: 01332 789322&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Derby Hospital, Derby", "postalCode": "DE22 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9104", "longitude": "-1.51382"}}, "title": "Digital Pathology Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245966", "validThrough": "2020-11-11T23:59:59+0000"}