{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45000", "minValue": "140", "unitText": "YEAR", "value": "£45-£140.98 pr hour"}}, "datePosted": "2020-10-23T08:46:40+0100", "description": "&lt;p&gt;Portsmouth Hospitals NHS Trust has a vision to be recognised as a world-class hospital, leading the field through innovative healthcare solutions, focusing on the best outcomes for our patients, delivered in a safe, caring and inspiring environment.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint an enthusiastic, forward-thinking Emergency Department Doctors.&lt;/p&gt;\n&lt;p&gt;Emergency Medicine is at the heart of the hospital’s emergency care pathway. The department is led by a highly motivated group of Consultants who provide high quality care, support junior doctors as well as driving change. They are present on the shop floor for 16 hours a day. In addition, there is an excellent co-located Paediatric Emergency Department that has also has Consultant delivered care until midnight.&lt;/p&gt;\n&lt;p&gt;In the past year the department has been recognised nationally for the innovative QI approach to patient care. This includes&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Being part of the team that won the HSJ award for Consultancy partnership of the year, for the quality improvement work within the department.&lt;/li&gt;\n&lt;li&gt;Shortlisted in the BMJ awards in the Anaesthetic and perioperative team of the year for the QI work to improve pain relief for patient presenting with neck of femur fractures.&lt;/li&gt;\n&lt;li&gt;Daily 12 o’clock teaching vignettes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will be assigned a Consultant educational supervisor and will be encouraged to maintain an educational portfolio with appropriate assessments to their level of experience and participate in annual appraisal.&lt;/p&gt;\n&lt;p&gt;The successful candidate duties will include:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Delivery of shop floor care to patients arriving in the Emergency Department.&lt;/li&gt;\n&lt;li&gt;Participate in a 24/7 rota including weekend work and night shifts.&lt;/li&gt;\n&lt;li&gt;Ensure discharge summaries are completed in a timely manner and communicate with GPs and other clinical colleagues as required.&lt;/li&gt;\n&lt;li&gt;Maintain continued professional development.&lt;/li&gt;\n&lt;li&gt;Attend educational and multidisciplinary sessions.&lt;/li&gt;\n&lt;li&gt;Completion ofessential/mandatory training.&lt;/li&gt;\n&lt;li&gt;Comply with all local policies including, dress code, annual and study leave.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;If this sounds like it is for you, please apply with your CV here. Our dedicated Doctors recruiter will get in touch with you to answer any further questions you have and get the review and recruitment process started. For an initial chat please call our team on 0333 577 3316, option 2 or send us an email atjoin.portsmouth@bankpartners.co.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135154.jpg", "name": "Portsmouth Hospitals NHS Trust Staff Bank", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "SHO/SPR Emergency Department Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239724", "validThrough": "2020-11-25T23:59:59+0000"}