{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pa"}}, "datePosted": "2020-11-05T12:46:11+0000", "description": "&lt;p&gt;Ward 5 is an 18 bedded complex male recovery service that endeavours to deliver rehabilitation and recovery to service users with enduring mental illness. This exciting role will require a compassionate individual who has good organisational and people skills to support the service with administration skills. The ward provides a holistic bio-psychosocial approach to support service users to build up their life skills and to improve the quality of their life. The post suits an individual who thinks out of the box and one who works well in a team. You would join a dedicated and hardworking multi-disciplinary team who are eager to make a difference through providing an integrated service that focuses on recovery. As such we are looking for an individual who values team working, one who seeks to work in an inclusive manner. We are service user focused and we value the contributions from friends, families and carers of service users for this post we are seeking an individual who will work with us and our services users in respectful and kind manner. You will be supported via clinical and management supervision and you will have opportunities to develop yourself personally and professional. The vacancy will be closed earlier once a sufficient number of applications have been received.&lt;/p&gt;\n&lt;p&gt;Please be aware, this advert will close early if the maximum amount of applications is reached.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Danielle Lancaster on 07973 638223 or Samuel Jamera on 0113 8556410.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS14 6UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8066", "longitude": "-1.47091"}}, "title": "Ward Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257709", "validThrough": "2020-11-07T23:59:59+0000"}