{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T09:07:56+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Health Visitor,Band 6, Harlow - Essex,Full time &amp; Part-time&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a caring and committed registered Health Visitor looking to join an organisation focused on professional growth and development, whilst ensuring you feel valued each and every day?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We now have a full time (37.5 hours) position working within our friendly and close-knit team in the Treehouse Family Hub in Harlow.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Proud&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Health Visitor within Virgin Care Essex, you’ll join a team who are focused on focused on making an impact on the development and wellbeing of children in the local community and recently received a “good” CQC rating.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your days will be rewarding and varied and include: working with our multi-professional teams to facilitate multi-agency and interdisciplinary working, promote and maintain an effective service to clients, using the assessment framework, communication, negotiation and collaboration and prioritise own work in line with areas of highest risk, delegating work to the wider skill mix team appropriately&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a registered nurse / midwife with a Specialist Community Public Health Nursing qualification, witha caring and approachable demeanour in order to gain the trust of the local families you assist in Harlow.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Valued&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will feel valued as a Health Visitor with Virgin Care, receiving access to exclusive rewards and benefits including:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;AfC 2020/2021 salary and terms and conditions, including an NHS pension&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Flexible working to provide you with that true work / life balance&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to Virgin Tribe - our staff benefits scheme which grants you access to premier offers and discount off all Virgin products including flights, holidays, gyms and media, along with regular competitions and giveaways.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Feel the difference fund - a £100,000 fund to bring ‘Feel the difference’ to life, giving every employee a chance to have their thoughts and ideas heard.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to MyWellness – a health and lifestyle platform covering mental health awareness and support, healthy recipes &amp; activity challenges&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to bespoke career pathways and opportunities to continue your professional development&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Plus in Essex, we are continuously looking at new ways to improve our staff’s health and wellbeing including ‘wellbeing Wednesdays’ – a virtual yoga/ meditation class ran on a weekly basis.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel the Difference&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care partner with the NHS and local authorities, providing high quality care for more than 1 million people each year up and down the country. We are an ambitious, forward thinking and passionate company who strive to make a real difference to people and our colleagues. We re-invest all of the money we earn to improve the experience, deliver ambitious transformations and empower all of our colleagues to make the changes, no matter how big or small, that make a real difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;So why not click apply to find out where your journey with Virgin Care can take you! If you’d like to discuss the role further, please contact Natalie Jones via email: natalie.jones@virgincare.co.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Virgin Care&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care is committed to safeguarding and protecting the children and young people that we work with. As such, all posts are subject to a safer recruitment process, including the disclosure of criminal records and vetting checks. We ensure that we have a range of policies and procedures in place which promote safeguarding and safer working practice across our services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harlow", "postalCode": "CM18 7NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.751", "longitude": ".094069"}}, "title": "Health Visitor - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255150", "validThrough": "2020-11-18T23:59:59+0000"}