{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45753", "minValue": "45753", "unitText": "YEAR", "value": "From £45,753 per annum pro rata"}}, "datePosted": "2020-10-29T16:46:07+0000", "description": "&lt;p&gt;Are you passionate about improving access to psychological interventions for people with psychosis and Bipolar Disorder? Do you have a proven track record of providing compassionate, evidence based psychological interventions with this client group? Do you enjoy working with colleagues from other professional backgrounds? If so, then this new post could be for you.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a Highly Specialist Clinical, or Counselling Psychologist, to act as a lead for the development of access to psychological interventions for people with a diagnosis of psychosis and Bipolar Disorder. You should have significant post-qualification experience of providing psychological interventions for service users with these difficulties. Alongside carrying a clinical caseload, the role will also involve the provision of supervision and training to colleagues from other teams in NICE recommended interventions.&lt;/p&gt;\n&lt;p&gt;The post holder would receive line management and clinical supervision from the Swindon Psychological Therapies Service (PTS), based at Chatsworth House. We work closely with other teams in Swindon, offering consultancy, training and supervision in the delivery of psychological interventions. Swindon Psychological Therapies Service (PTS) comprises a supportive team of Clinical Psychologists, Counselling Psychologists, Clinical Nurse Specialists in CBT and Arts Psychotherapists. We offer a range of psychological interventions. We have established links with local training providers in Clinical and Counselling Psychology.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be enthusiastic and highly motivated to provide a good quality, evidence based psychological service within a changing environment. They will have significant post-qualification experience of working with individuals with complex psychological difficulties and risk issues within a secondary care setting.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:  Dr Imogen Reid, Head of Psychological Therapies Service, Swindon on 01793 715000 or 07879 440239&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chatsworth House, Swindon", "postalCode": "SN1 4BP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5527", "longitude": "-1.77806"}}, "title": "Band 8a Clinical Psychologist - Chatsworth House, Swindon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249145", "validThrough": "2020-11-12T23:59:59+0000"}