{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754"}}, "datePosted": "2020-11-06T10:46:56+0000", "description": "&lt;p&gt;Associate Director of Healthcare Intelligence&lt;/p&gt;\n&lt;p&gt;(12 months Maternity Leave Secondment Opportunity)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to lead the national award winning, Advanced Analytics Unit at the Arden and GEM Commissioning Support Unit for a period of 12 months, to cover maternity leave.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Operating at scale and pace, the advanced analytics team has doubled over the last 12 months and will be doubling again shortly, creating an agile team of 16 subject matter experts. An outstanding advanced analyst yourself, we are looking for a resilient, visionary, technical leader who can ensure we continue to optimise the return on the investment made through the provision of value-adding analytics.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This job isn’t for the faint hearted. The post holder will lead a vibrant team of analysts with experience from healthcare, public sector (e.g. Ministry of Justice) and the commercial sector with academic backgrounds in pure mathematics, health economics, statistics and physics. You will lead by example by actively undertaking key assignments as well as being responsible for team delivery and pastoral care. Our work is now progressively calling for predictive analytics (including time series forecasting, machine learning etc.). As such, we need an outstanding leader who can build on our learning to date and use it to identify new opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are up for this outstanding opportunity but would like to know more before submitting your application please contact&lt;/p&gt;\n&lt;p&gt;Ruth Swift Ruth.Swift2@nhs.net who will be happy to arrange a call with:&lt;/p&gt;\n&lt;p&gt;Jess Hicks, Associate Director of Healthcare Intelligence&lt;/p&gt;\n&lt;p&gt;Helen Seth, Executive Director of Business Intelligence and Provider Management&lt;/p&gt;\n&lt;p&gt;Ayub Bhayat, Chief Data Officer&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRuth SwiftEmail addressRuth.Swift2@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;If would like to know more before submitting your application please contact: Ruth.Swift2@nhs.net. Ruth would be happy to arrange the opportunity to speak to any of the following:&lt;/p&gt;\n&lt;p&gt;Jess Hicks, Associate Director of Healthcare Intelligence (post holder)&lt;/p&gt;\n&lt;p&gt;Helen Seth, Executive Director of Business Intelligence (line manager)&lt;/p&gt;\n&lt;p&gt;Ayub Bhayat, Chief Data Officer&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127894.jpg", "name": "NHS Arden and Greater East Midlands Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Johns House, Leicester", "postalCode": "LE1 6NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6316", "longitude": "-1.1271"}}, "title": "Associate Director of Healthcare Intelligence (Maternity Cover)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259299", "validThrough": "2020-11-20T23:59:59+0000"}