{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum, pro rata"}}, "datePosted": "2020-11-04T08:16:38+0000", "description": "&lt;p&gt;An exciting opportunity is available for a motivated and innovative Clinical Lead working in a busy Assertive Outreach Team in a culturally diverse area. It is essential you have experience working as a Band 6 clinician working in an Assertive Outreach Team or a clinician with substantial experience of managing people with severe and enduring mental illness and for those currently ‘at risk’ within the organisation. Applicants should have a particular interest in the long term management of people with severe and enduring mental illness.&lt;/p&gt;\n&lt;p&gt;This position would be suitable for a Registered Mental Health Nurse with a qualification at degree level or equivalent and registration with a relevant professional body i.e NMC with several years’ community experience and who is interested in team leadership. You must have clinical experience in working with service users with complex long term needs and their carers, ensuring services are delivered to the highest possible standard, with a team focus.&lt;/p&gt;\n&lt;p&gt;The post involves working alongside the team manager to ensure quality and standards within the team are set, monitored, maintained and evaluated. The post holder must develop a close working relationship with the multi-disciplinary team, supervise staff and oversee the team’s day to day processes to ensure they deliver its performance, trust targets as well as ensuring positive interfaces with partner services and stakeholders. You will require excellent communication skills and be expected to carry a small caseload.&lt;/p&gt;\n&lt;p&gt;The post holder will be an excellent team player with an ability to facilitate collaborative working. With excellent, proven leadership skills this person will provide on-going supervision to the nursing team, ensuring high standards of assessment, care and treatment for patients with schizophrenia, bi-polar, depression psychosis and dual diagnosis.&lt;/p&gt;\n&lt;p&gt;The successful candidate will:&lt;br /&gt;Facilitate and lead effective multi-disciplinary team working.&lt;br /&gt;Communicate effectively at all levels.&lt;br /&gt;Demonstrate own professional development.&lt;br /&gt;Promote development of staff through the creation of a learning environment committed to personal and professional enhancement.&lt;br /&gt;In return we can offer:&lt;br /&gt;Supervision and Mentorship&lt;br /&gt;Ongoing professional development&lt;br /&gt;A stimulating and challenging working environment.&lt;/p&gt;\n&lt;p&gt;The Assertive Outreach service operates over 7 days per week, 365 days per year. The successful applicant will be required to work a shift pattern consisting of day shifts (9:00am - 5:00pm), late shifts (12:00pm - 8:00pm) and weekends (9:00am - 5:00pm), as required.&lt;br /&gt;&lt;br /&gt;The ability and willingness to travel across the Birmingham &amp; Solihull area for work purposes is required for this role&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSteven MeddJob titleTeam ManagerEmail addresssteven.medd@nhs.netTelephone number0121 301 7222Additional contact information&lt;/p&gt;\n&lt;p&gt;Steven Medd is available 9-5 Monday to Friday to answer any questions.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Small Heath Health Centre, Birmingham", "postalCode": "B10 0PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4708", "longitude": "-1.86581"}}, "title": "Band 7 East AOT Clinical Lead - Small Heath Health Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255066", "validThrough": "2020-11-17T23:59:59+0000"}