{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa incl HCAS"}}, "datePosted": "2020-10-20T11:16:13+0100", "description": "&lt;p&gt;We have vacancy for a Band 6 Anaesthetic Staff Nurse/ ODP for the anaesthetic team.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic, motivated and enthusiastic Senior Staff Nurse/ODP to join our Operating department anaesthetic team.&lt;/p&gt;\n&lt;p&gt;You will be a registered nurse with a post registration qualification in anaesthetic practice or a qualified ODP. You will have experience as staff nurse/ODP at band 5 and be skilled in a number of anaesthetic techniques. You will have leadership qualities and good communication skills. You will be required to assist in anaesthetics in different departments of the trust.&lt;/p&gt;\n&lt;p&gt;The post involves late duty.&lt;/p&gt;\n&lt;p&gt;ACAD Operating Theatres department is in housed within ACAD (Ambulatory Care and Diagnostics) ACAD centre comprises six operating theatres, supporting General and Breast Surgery, Urology, ORAL , ENT and Ophthalmology surgery and 16 bed offering 24 hours care Monday to Friday.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Central Middlesex Hospital Operating is located in the new building with 3 modern theatre suites for major elective orthopaedic Surgery. Theatre is well-equipped recovery room consists of 5 bays providing immediate post-operative and high dependency care mainly for in patients.&lt;/p&gt;\n&lt;p&gt;On occasions you may be required to work cross site. We have a tradition of excellence and our vision is simple, to provide a high quality peri-operative care, and invest in you the people who deliver care. We are seeking enthusiastic and committed individuals to join our team. We offer excellent training and development opportunities, a friendly working environment. We welcome applications to reflect our diverse local populations of age, gender, race and disability. Please ensure you meet all the essential criteria in the Person Specification, as you will be judged against these. In line with the Department of Health&#39;s policy and in order to streamline the recruitment process, some of our vacancies may expire prior to the advertised closing date.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Matron Rose Amankwaah 020 8963 8872&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CMH, London", "postalCode": "NW10 7NS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5316", "longitude": "-.269746"}}, "title": "Perioperative Anaesthetic Senior Staff Nurse/ SODP Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234080", "validThrough": "2020-11-08T23:59:59+0000"}