{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T15:01:40+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM/SECONDMENT FOR 12 MONTHS DUE TO MATERNITY COVER &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IF YOU ARE INTERESTED IN APPLYING FOR THE SECONDMENT POSITION, YOU MUST OBTAIN PERMISSION FROM YOUR CURRENT LINE MANAGER PRIOR TO APPLYING FOR THIS POST. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen with Powys Teaching Health Board for a Clinical Pharmacist to join our team to cover an existing member of staff going on maternity leave. This post can be flexible in base within South or Mid Powys.&lt;/p&gt;\n&lt;p&gt;Are you looking for an exciting, but unique experience? We are looking for somebody to join us and work alongside our pharmacy service that supports our community resource teams and community hospitals. You will be at the forefront of further developing the service working alongside GP’s, community and district nurses, therapists, community and practice pharmacists and specialist nurses. You will be supported by experienced medicines management team of pharmacists, pharmacy technicians, MM nurse and administration staff.&lt;/p&gt;\n&lt;p&gt;The role will include supporting teams and patients in a variety of care environments – community hospitals, virtual wards and GP practices. Always ensuring that the best is obtained from medicines.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is motivated and passionate about patient care and wants to improve patient services. You will be a highly valued member of the team and we will provide ongoing personal development and training opportunities.&lt;/p&gt;\n&lt;p&gt;Please note this post is for 1 year.&lt;/p&gt;\n&lt;p&gt;This post is up to 37.5 hours per week, however there is flexibility if somebody would like to work part time/job share, also the base could be flexible within South or Mid Powys.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh applicants are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Emma Bayliss&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Pharmacist&lt;/p&gt;\n&lt;p&gt;Email address: emma.bayliss@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01874 712641&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Jayne Price - Deputy head of pharmacy&lt;br /&gt;Tel: 01874 712641&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123203.jpg", "name": "Powys Teaching Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123203"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brecon War Memorial, Brecon", "postalCode": "LD3 7NS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.949", "longitude": "-3.38482"}}, "title": "Ward Based Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247102", "validThrough": "2020-11-11T23:59:59+0000"}