{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa. Inclusive of HCAS [15%]"}}, "datePosted": "2020-11-02T17:15:45+0000", "description": "&lt;p&gt;The Wolverton is a well-established Contraception, Sexual Health and HIV service based at Kingston Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Clients contacting the service have access to virtual and telephone appointments for all aspects of care, medication collection services including PrEP and booked appointments as indicated by the client&#39;s need. Specialist services run by The Wolverton include routine and complex contraception, The Connect service for clients with learning disabilities, a psychology service and inclusion within a Trust wide vulval pain management model.&lt;/p&gt;\n&lt;p&gt;The Wolverton has adapted during the COVID - 19 pandemic and has maintained a core service throughout whilst now incorporating service innovations, initiated in response to the pandemic, into the routine service where this holds benefit for our clients.&lt;/p&gt;\n&lt;p&gt;Band 7 nurses within the service are central to the smooth running and excellent client care that we offer. The Band 7s undertake telephone, virtual and face to face sexual health and contraception consultations with clients. Staff will manage full episodes of clinical care with support from senior clinicians as indicated by their expertise or the client’s presentation. The Band 7s are key leaders within the department assisting in teaching and training all levels of clinical and medical staff. Band 7 nurses are also expected to provide Implant service support and are encouraged to progress towards Coil fitter status. Additional roles will be allocated to each individual to help in the management, provision and improvement of the service.&lt;/p&gt;\n&lt;p&gt;Previous experience in a busy sexual health clinic will be necessary to apply for the role however appropriate training may be provided if the right candidate wishes to expand into the role. If you feel you could work well within our team alongside dedicated colleagues please contact Judith Murray for more information judithmurray2@nhs.net or apply direct.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Judith Murray [Interim Nurse Lead] - Judithmurray2@nhs.net - 020 8934 2390&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston Hospital NHS Foundation Trust, Kingston Upon Thames", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Clinical Nurse Specialist in Sexual Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253008", "validThrough": "2020-11-13T23:59:59+0000"}