{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "per annum"}}, "datePosted": "2020-11-05T17:16:14+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a pro-active, highly motivated individual to join the Medicine Management Team at Dudley Group NHS Foundation Trust in the position of Assistant Directorate Manager, within the Specialist Medicine Directorate.&lt;/p&gt;\n&lt;p&gt;Specialties within this Directorate include Respiratory, Diabetes &amp; Endocrinology, Renal and Cardiology. These specialties have multiple sub-departments, are complex, busy and based at multiple sites so if you are someone who is looking for a challenge and to develop within a diverse and fast paced management role with opportunities to develop key skills this role could be for you.&lt;/p&gt;\n&lt;p&gt;This role would suit a either a junior manager looking for their next step up the ladder or an experienced individual looking to capitalise on their experience. As such the role will be banded at either a 5 or 6 accordingly.&lt;/p&gt;\n&lt;p&gt;You will directly report to and work closely with the Directorate Manager whilst also having to show initiative through managing key responsibilities to support with the achievement of national and local targets, providing a consistent high quality patient led service and through the daily running of the directorate. You will be involved in the monitoring and management of the RTT performance and cancer targets, assist with operational matters relating to patient flow and hospital capacity when required, financial management of your budgets and line management of administration staff and secretaries within the directorate.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who can demonstrate team leader and/or management skills and is passionate about service improvement and access to high quality patient care. You should have great communication skills and thrive working within a busy and changing environment. It would be beneficial if you have knowledge of the specialties within the directorate however this is not essential, you should have some knowledge around national targets/standards and this can be demonstrated in your application and interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lewis Kidd - Directorate Manager&lt;/p&gt;\n&lt;p&gt;Email address: lewis.kidd2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01384 456111 ext 2589&lt;/p&gt;\n&lt;p&gt;-&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Assistant Directorate Manager (Specialist Medicine)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258696", "validThrough": "2020-11-19T23:59:59+0000"}