{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum / pro rata"}}, "datePosted": "2020-10-26T12:46:45+0000", "description": "&lt;p&gt;Ward 27 is a fast paced, multi-disciplinary environment. With an objective to deliver excellent patient care. We specialise in acute medical patients and patients who are medically fit for discharge.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a motivated, caring and inspirational band 5 staff nurse to work within our team, focusing on providing the highest standard of care for our patients. You will work closely with all wards, departments and clinical site teams in order to ensure high standards of care.&lt;/p&gt;\n&lt;p&gt;Our Trust is committed to supporting you in your continued professional development and there will be learning opportunities in place to ensure you reach you maximum potential. Our Trust is one of five in the UK chosen to work with the Virginia mason institute in Seattle, you will have the opportunity to work alongside our transforming care institute and be a part of our value streams, which in turn will provide you with essential leadership skills and knowledge and ultimately improve patient care and experience.&lt;/p&gt;\n&lt;p&gt;You will also have the opportunity to shadow our clinical site management team, Centre management team including our Head of Nursing and corporate nursing team. This will provide you with insight into different roles within our Trust, thus helping you to make decisions about your future career journey within our Trust.&lt;/p&gt;\n&lt;p&gt;Ward 27 is a new dynamic, supportive multi-disciplinary team. If you would like to come and meet us please contact Ward Manager Claire Newby on 01743 261000 ext 1458&lt;/p&gt;\n&lt;p&gt;We look forward to working with you&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ward Manager Claire Newby&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Phone: &lt;/strong&gt;01743 261000 ext 1458&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email: &lt;/strong&gt;claire.newby1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury", "postalCode": "SY3 8XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Staff Nurse - Ward 27 RGN or RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242507", "validThrough": "2020-11-09T23:59:59+0000"}