{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 rising to a maximum of £"}}, "datePosted": "2020-10-30T09:00:41+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Staff Nurse - Specialist Cancer Services&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware this post is a rotational position based primarily at Weston Park Hospital however there is a requirement to work at the outreach services across the region.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: You may be required to undertake the duties of your role at any of the Hospital sites where Sheffield Teaching Hospitals is responsible for delivering cancer treatment related activity or post treatment follow up. This may include Barnsley, Chesterfield, Rotherham, Doncaster and any other sites within the Cancer Network.&lt;/p&gt;\n&lt;p&gt;Weston Park Hospital is one of the most forward-looking dedicated cancer hospitals in the country with a world-leading reputation as a centre of excellence for cancer care. It provides specialist curative and palliative treatments, including anti-cancer therapy and radiotherapy, for patients across South Yorkshire and beyond. Clinical care and research are integrated into our patient care, and the hospital is credited as a pioneer of modern advances in the field of cancer.&lt;/p&gt;\n&lt;p&gt;We have two in-patient wards and a dedicated teenage cancer unit alongside a busy day case treatment facility, research treatment suite and a newly opened outpatient department. We also have a dynamic assessment unit with a 24 hour telephone triage service for patients on cancer treatment across our region. As part of our nursing team you will be able to rotate between our clinical research unit, assessment unit and outpatients and assist in delivering treatments closer to patients’ homes. This will provide you with the opportunity to develop skills and knowledge in all aspects of cancer care, in a range of specialised clinical areas.&lt;/p&gt;\n&lt;p&gt;Our nurses tell us that Weston Park Hospital is an extremely rewarding place to work knowing that they are providing the best possible care to patients and their relatives.&lt;/p&gt;\n&lt;p&gt;Working at Weston Park you can really make a difference for patients and their families living with cancer.&lt;/p&gt;\n&lt;p&gt;Informal visits highly recommended to come and see what we can offer you if you come to join our forward looking and excellent team of nurses.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A comprehensive orientation programme giving you experience of the whole centre&lt;/li&gt;\n&lt;li&gt;Established Preceptorship, for newly qualified Nurses along with a named preceptor and a generous supernumerary period&lt;/li&gt;\n&lt;li&gt;Opportunities to develop your clinical skills including; Intravenous medications, venepuncture, cannulation, management of central lines and administration of anti cancer therapy&lt;/li&gt;\n&lt;li&gt;The opportunity to develop your core nursing abilities.&lt;/li&gt;\n&lt;li&gt;Opportunities to take on Link Worker Roles&lt;/li&gt;\n&lt;li&gt;Rotation to other specialist areas within the care group&lt;/li&gt;\n&lt;li&gt;Career development opportunities including&lt;/li&gt;\n&lt;li&gt;Caring for patients of all ages and backgrounds&lt;/li&gt;\n&lt;li&gt;A supportive and nurturing work environment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Informal visits recommended. In order to arrange a visit please liaise with our treatment suite on 0114 2265319 and ask to speak to the Sister in Charge.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;&lt;strong&gt;For those who are currently employed by the Trust as a Staff Nurse, you should instead apply through the Staff Nurse Transfer process via your line manager.&lt;/strong&gt;&lt;/em&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;&lt;strong&gt;If you are internal to Sheffield Teaching Hospitals, please discuss your interest with Pauline Pledge and apply for this vacancy via the internal transfer register.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;&lt;strong&gt;If you are a Newly Qualified applicant and are due to qualify before end of June 2020, you can apply. Please specify what month and year you are due to qualify. Please also specify the hours and list the three wards/areas you would prefer. &lt;/strong&gt;&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;&lt;strong&gt;If you are due to qualify between July and December 2020 please apply on our specific newly qualified advert.&lt;/strong&gt;&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Interviews will take place on 11th September 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Pauline Pledge - Outpatient and Chemotherapy Services Matron for Specialist Cancer Services&lt;br /&gt;Tel: 0114 2265000 &lt;br /&gt;Bleep: 3253&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Weston Park Hospital, Sheffield", "postalCode": "S10 2SJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3803", "longitude": "-1.49493"}}, "title": "Staff Nurse - Specialist Cancer Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249387", "validThrough": "2020-11-13T23:59:59+0000"}