{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competetive Bank Rates"}}, "datePosted": "2020-10-01T13:10:15+0100", "description": "&lt;p&gt;&lt;strong&gt;Imperial College Healthcare NHS Trust Staff Bank &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bank Doctor:  &lt;/strong&gt;&lt;strong&gt;Specialty Doctor – Occupational Health &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Staff Bank Department is a dedicated team providing support to Imperial College Healthcare NHS Trust across all staff groups. The Staff Bank strives to support our Hospitals with competent, reliable and registered workers who are able to provide the highest level of service to our patients.&lt;/p&gt;\n&lt;p&gt;More than just a healthcare provider, Imperial College Healthcare NHS Trust is on a mission to give our patients exemplary, compassionate and safe care. We&#39;re doing this through innovations in patient care, education and research. Every day our people work hard to bring us closer to where we want to be. Join us and you’ll be part of a community that recognises your contribution – and inspires you to achieve great things.&lt;/p&gt;\n&lt;p&gt;Five London hospitals make up Imperial College Healthcare NHS Trust.  We are one of the largest Trusts in the country, we are also the UK&#39;s first academic health science centre (AHSC), bringing together the benefits of cutting-edge research with high standards of patient care. With more than 50 specialties and one of the largest portfolios of services in the country, we are a place full of opportunity as well as inspiration.&lt;/p&gt;\n&lt;p&gt;As an Occupational Health Department bank doctor, you would become a Trust worker and have the flexibility to work when you want and where you prefer, from one of the three units in central London; St Mary’s Hospital, Charing Cross Hospital and Hammersmith Hospital. Our rates of pay are competitive and we pay weekly on a Friday. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bank Doctor:   &lt;/strong&gt;&lt;strong&gt;Specialty Doctor – Occupational Health &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting for qualified Occupational Health Specialty Doctorswishing to work flexibly with our Staff Bank. By joining the Staff Bank you put yourself top of the list for any shifts requiring extra staff throughout the Trust.  The shift pattern for this role is standard day shifts. Lines of work may also be available, should this be of interest. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rate of Pay: &lt;/strong&gt;Competitive rates of pay&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working Bank shifts is easy:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You are able to book shifts online or can contact our dedicated bookings team via phone, you only need to work 1 shift every 3 months to remain active on our bank; although we hope, you can work more. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits for you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Efficient, contact free recruitment process&lt;/li&gt;\n&lt;li&gt;Complimentary core skills training&lt;/li&gt;\n&lt;li&gt;Free required PPE provided&lt;/li&gt;\n&lt;li&gt;You can browse and book your own shifts on Patchwork&lt;/li&gt;\n&lt;li&gt;Competitive pay rates with weekly payment for the shifts you have worked&lt;/li&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;Electronic timesheets, making your pay fast and on time.&lt;/li&gt;\n&lt;li&gt;You can view your shifts on Patchwork&lt;/li&gt;\n&lt;li&gt;Great opportunity to progress within the Imperial College Healthcare NHS Trust and gain experience&lt;/li&gt;\n&lt;li&gt;Friendly team environment&lt;/li&gt;\n&lt;li&gt;Lines of work&lt;/li&gt;\n&lt;li&gt;All sites have easy access to various transport links&lt;/li&gt;\n&lt;li&gt;Free Trust hopper to commute between sites&lt;/li&gt;\n&lt;li&gt;Trust ID; enabling access to multiple offers and discounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your attributes and skills:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;GMC registered with a Licence to Practice&lt;/li&gt;\n&lt;li&gt;Diploma in Occupational Medicine&lt;/li&gt;\n&lt;li&gt;Minimum of 3 years practicing Occupational Medicine in the NHS&lt;/li&gt;\n&lt;li&gt;Ability to assess common conditions affecting fitness to work e.g. musculoskeletal disorders, common mental health problems and assessment and management of inoculation injuries&lt;/li&gt;\n&lt;li&gt;Leadership skills; decision making, ability to motivate and develop and manage performance of staff.    Good communication and interpersonal skills&lt;/li&gt;\n&lt;li&gt;Good IT skills&lt;/li&gt;\n&lt;li&gt;Understand the importance of maintaining patient safety and minimising risk in accordance with Trust policy and procedure.&lt;/li&gt;\n&lt;li&gt;Demonstrate a good understanding of the importance of supportive and flexible team working&lt;/li&gt;\n&lt;li&gt;Eligible to work in the UK.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Contact &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contact our recruitment team to start the process on &lt;strong&gt;0208 167 2493&lt;/strong&gt; or &lt;strong&gt;imperial.locums.admin@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;IMPORTANT:&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please ensure you check your emails regularly as this is how we will communicate with you throughout the recruitment process. Please note that due to a high volume of applications, if you have not been contacted in two weeks your application has been unsuccessful.&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Bank Doctor:  Specialty Doctor – Occupational Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916208623", "validThrough": "2021-03-31T23:59:59+0100"}