{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 pa inc fringe HCAS (HCAS can var"}}, "datePosted": "2020-10-20T10:31:19+0100", "description": "&lt;p&gt;&lt;em&gt;We are seeking two HCPC registered Clinical or Counselling Psychologists or Forensic Psychologists to join our dynamic team.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;This role is an exciting opportunity to become involved in a brand new project, supporting with research into gambling prevalence and delivering gambling interventions across the Surrey prison estate. You will work closely with The National Problem Gambling Clinic which is a highly specialist national NHS service for problem gamblers based in London. We pride ourselves on having acted as a centre of excellence and as a training clinic, having influenced policy and obtained a proven track record of publications.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be an energetic and robust individual with sophisticated and sensitive clinical skills, and a proven track record of delivering high quality services in either the NHS, social care or the private sector. Previous experience in delivering CBT and working in adult mental health and/or addiction are essential. Further experience in psychodynamic or systemic work would also be highly desirable. The post-holder will work autonomously within professional guidelines and the overall framework of the service’s policies and procedures and will be responsible for implementing a range of psychological interventions for individuals and groups. They will be a key part of the MDT and will liaise closely with colleagues from the prison and other community services to provide true partnership working and seamless care pathways.&lt;/p&gt;\n&lt;p&gt;CNWL Addictions Directorate is a large well-established NHS provider offering a wide range of high quality drug and alcohol treatment interventions to the diverse and multicultural population of Hillingdon, Harrow, Ealing, Brent, Hounslow, Hackney, Milton Keynes, HMP Woodhill and also includes a Club Drug Clinic and gambling service. We have an experienced and diverse nursing workforce and continuing to expand on specialist roles and advance practice.&lt;/p&gt;\n&lt;p&gt;There may be some expectation of evening work, to be discussed with the successful applicant.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMaxine LeeJob titleSector ManagerEmail addressmaxine.lee2@nhs.netTelephone number07930172727&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Surrey Prison Estate, Surrey", "postalCode": "GU24 9EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.323", "longitude": "-.642147"}}, "title": "Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233872", "validThrough": "2020-11-09T23:59:59+0000"}