{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-27T14:46:39+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the Medical Directorate at the Royal Liverpool University Hospital for dynamic, committed, compassionate and enthusiastic staff nurses to join a team of highly motivated and committed nursing staff within the medical ward specialising in infectious diseases. &lt;br /&gt;&lt;br /&gt;The post is for a full time position to work 37.5 hours per week on internal rotation. Shifts consist of long days, early shifts/late shifts and night shifts.&lt;br /&gt;&lt;br /&gt;Ward 3x has 13 isolation rooms managing patients with acute infections such as meningitis, CDT, Influenza, TB, food-borne infections and tropical infections experienced by returning travellers, also chronic conditions such as HIV.&lt;br /&gt;&lt;br /&gt;As part of the national response for managing Highly Contagious Infectious diseases , staff are prepared and ready to care for patients with suspected and confirmed conditions such as Ebola, MERS and other such like illnesses&lt;br /&gt;&lt;br /&gt;On 3x there is a supportive, friendly team making staff feel valued and motivated. We put patients at the heart of all that we do and working collaboratively to deliver the very best for our patients.&lt;br /&gt;&lt;br /&gt;There is an excellent preceptorship programme designed to facilitate efficient development of competence, confidence and expertise. Support will be given at a clinical level by a Preceptor, and from a wider organisational structure including the Preceptorship Lead, Clinical Skills team and Learning and Development. &lt;br /&gt;&lt;br /&gt;For experienced staff nurses we encourage the RLB programme. This involves competencies for staff to complete, which will cover all aspects of care within an infectious disease ward. This will enable staff to obtain the knowledge and skills required to provide the highest standard of evidence based practice to our patients.&lt;br /&gt;&lt;br /&gt;Individualised guidance and support will be provided from a Clinical Practice Development Nurse to all nurses, whether new to the trust or specialist area, or newly qualified, directing all learning and development needs in agreed plans that ensure goals are met in a timely fashion.&lt;br /&gt;&lt;br /&gt;You must possess a caring, compassionate and positive manner and have excellent communication skills. &lt;br /&gt;&lt;br /&gt;Liverpool University Hospital NHS Foundation Trust is a great place to work with on-going learning and is a top-rated organisation for the delivery of excellent patient care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSamantha ParkerJob titleWard ManagerEmail addressSamantha.Parker@liverpoolft.nhs.ukTelephone number01517062435Additional contact information&lt;/p&gt;\n&lt;p&gt;Samantha Parker, Charlene Connor &amp; Lauren Richards&lt;/p&gt;\n&lt;p&gt;0151 706 2435&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RLH, Liverpool", "postalCode": "L7 8XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.96481"}}, "title": "Staff Nurse - Infectious Diseases", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245034", "validThrough": "2020-11-10T23:59:59+0000"}