{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 plus Outer London HCAS"}}, "datePosted": "2020-10-30T17:30:22+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Deputy Chief Pharmacist&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Barnet Enfield and Haringey Mental Health Trust is a multiple award-winning, combined mental health and community Trust providing local, regional and national healthcare services. We are one of the largest employers in North London with over 3000 staff delivering a range of mental health and community services to a population of over one million.&lt;/p&gt;\n&lt;p&gt;In Enfield, we provide a full range of child and adult community health services, which over the last few years has been integrating with its mental health services to provide better and more holistic care.&lt;/p&gt;\n&lt;p&gt;BEH manages the renowned North London Forensic Services (NLFS), rated as &#39;Outstanding&#39; by the CQC. This service treats and cares for people within the criminal justice system who have mental health conditions. We have also been appointed as the lead provider of forensic mental health services across North London managing the devolved New Models of care budget of £170m from 2018/19. NLFS delivers mental health care across some of the prisons and provides mental health services as HM Young Offenders Institutions in Aylesbury.&lt;/p&gt;\n&lt;p&gt;We also provide one of the largest eating disorder services in England, as well as drug and alcohol services and mental health liaison services in North Middlesex University Hospitals Trust.&lt;/p&gt;\n&lt;p&gt;Our values and quality improvement are at the heart of everything we do, please consider joining us.&lt;/p&gt;\n&lt;p&gt;Are you a clinical pharmacy leader looking for the next challenge in your career? An exciting opportunity has arisen for an innovative and inspirational pharmacist to lead the clinical pharmacy service at Barnet Enfield and Haringey Mental Health Trust&lt;/p&gt;\n&lt;p&gt;The pharmacy service are seeking a Deputy Chief Pharmacist. The main responsibilities are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To lead the clinical pharmacy service within all divisions at an operational level&lt;/li&gt;\n&lt;li&gt;Research and development lead for pharmacy service&lt;/li&gt;\n&lt;li&gt;In personal charge of the registered pharmacy at St Ann’s and the stores and distribution service and the associated wholesale dealer’s licence&lt;/li&gt;\n&lt;li&gt;Lead pharmacy contact for audit and quality improvement initiatives&lt;/li&gt;\n&lt;li&gt;To deputise for the Chief Pharmacist in their absence&lt;/li&gt;\n&lt;li&gt;To integrate as a valuable member of the Trust senior leadership team&lt;/li&gt;\n&lt;li&gt;Responsible for business continuity processes in the pharmacy serviceWe are a friendly team, who are based across four main sites and are a truly Trust-wide service. We are looking for a system thinker who will help us to integrate and develop our services in line with the NHS Long Term Plan. Interested and considering applying?&lt;/li&gt;\n&lt;li&gt;We would encourage you to get in touch with us to arrange an informal discussion and/or visit. For further details / informal visits please contact Katherine Delargy katherinedelargy@nhs.net0208 702 5418&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatherine DelargyJob titleChief PharmacistEmail addressKatherinedelargy@nhs.netTelephone number020 8702 5418&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "- Trust Head Pharmacist, London", "postalCode": "N15 3TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5807", "longitude": "-.092156"}}, "title": "Deputy Chief Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251058", "validThrough": "2020-11-12T23:59:59+0000"}