{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 -  £44,503 Pro-rata"}}, "datePosted": "2020-10-16T09:58:19+0100", "description": "&lt;p&gt;Are you a senior OT with a passion for vocational rehabilitation? Experienced in working with patients following trauma? Interested in working with a varied caseload who are all military personnel?&lt;/p&gt;\n&lt;p&gt;If so, you might just be the Occupational Therapist we are looking for to join the Complex Trauma Service at the Defence Medical Rehabilitation Centre, Stanford Hall as a Vocational Occupational Therapist. Stanford Hall is a purpose-built world-class rehabilitation facility for members of the Armed Forces who have suffered major trauma or injury during their service.&lt;/p&gt;\n&lt;p&gt;We are looking for a 0.6 Whole Time Equivalent (WTE) Band 7 Vocational Occupational Therapist (22.5 hours a week) to join the Complex Trauma Service and be part of our team of 35 Occupational Therapy Staff across the whole unit.&lt;/p&gt;\n&lt;p&gt;We need the post holder to work some of these hours on a Monday or Tuesday and are happy to discuss the rest of your working pattern.&lt;/p&gt;\n&lt;p&gt;You will be part of an extensive interdisciplinary team and would provide vocational rehabilitation to injured serving military personnel. This group of patients come with a wide range of complex and multiple injuries that could include amputations, burns or other tissue loss, persistent pain following trauma, multiple fractures and spinal injuries.&lt;/p&gt;\n&lt;p&gt;In this environment you will have an opportunity to utilise all your skills and training and implement treatment programmes that consider all the biopsychosocial aspects of an individual’s condition to support their return to work or transition into civilian life. Vocational Occupational Therapy interventions include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Functional capacity assessment to identify abilities and limitations for future employment.&lt;/li&gt;\n&lt;li&gt;Job Demands Analysis (JDA) ranging from weapons handling to being able to get in and out of a tank.&lt;/li&gt;\n&lt;li&gt;Work place assessments.&lt;/li&gt;\n&lt;li&gt;Development of work hardening/work simulation programmes.&lt;/li&gt;\n&lt;li&gt;Planning transition to a civilian employment if unable to return to military job role.&lt;/li&gt;\n&lt;li&gt;Identification of transferable skills, interests &amp; career values to explore job roles and future training needs.&lt;/li&gt;\n&lt;li&gt;Networking with companies and voluntary organisations nationally to create vocational opportunities for patients who will be transitioning out of the military.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you want to join our team and have a wide range of assessment and treatment skills in a vocational rehabilitation setting and/or knowledge and experience of working with trauma patients we would be very interested in hearing from you. Experience of working with military personnel would be advantageous but not essential.&lt;/p&gt;\n&lt;p&gt;Occupational Therapy is very valued within the interdisciplinary team and you will work closely with a range of healthcare professionals including mental health and Regional Occupational Health Teams to provide further specialist support to our patients.&lt;/p&gt;\n&lt;p&gt;Developing our staff is very important to us and you will have access to regular supervision, an excellent induction package as well as a wide range of training opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Qualifications and Memberships&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to provide evidence of the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Professional knowledge acquired through degree supplemented by further training, short specialist courses, to master’s equivalent level.&lt;/li&gt;\n&lt;li&gt;HCPC Registered as an Occupational Therapist.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following NHS Competencies:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core – NHSC1 – Communication&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC2 – Personal and People Development&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC5 – Quality&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB6 – Assessment and Treatment Planning&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB7 – Interventions and Treatment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Further Information&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post does not offer relocation expenses (move of home, excess fares or temporary transfer). Non-Standard move applicants will be eligible for the full package. Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is Standard.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;From time to time The Ministry of Defence may advertise per regional Headquarters. To ensure your search yields the best results, search under MoD-Healthcare jobs from the home page or alternatively avoid completing the mileage section when using the search criteria based on your post code.&lt;/p&gt;\n&lt;p&gt;For details of which locations are in each region, please see attached Regional Layout document.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stanford Hall, Stanford on Soar, Loughborough, LE12 5BL", "postalCode": "LE12 5BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7931", "longitude": "-1.25541"}}, "title": "Part Time Band 7 Senior Vocational Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229507", "validThrough": "2020-11-10T23:59:59+0000"}