{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 p.a."}}, "datePosted": "2020-11-02T09:15:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time – 37.5 hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Endoscopy&lt;/strong&gt;: where else can you get a good work life balance, the excitement of an emergency situation with the structure of elective procedures and the support to develop personally and professionally?&lt;/p&gt;\n&lt;p&gt;You will receive extensive education and training from a team of experienced senior nurses, the Practice Based Educator and your unit manager. We are looking for motivated and enthusiastic individuals to work with a friendly and supportive team within a challenging and demanding environment. Experience in Endoscopy is desirable but not essential as on- the - job training will be provided.&lt;/p&gt;\n&lt;p&gt;With the exception of an on-call out of hour’s rota, the unit is open Monday to Saturday 7.30 am to 9.00 pm and is therefore ideal for candidates seeking a more friendly work pattern.&lt;/p&gt;\n&lt;p&gt;The endoscopy unit is based in the Treatment &amp; Diagnostic Centre at Wythenshawe Hospital, performing over 12,000 endoscopies each year. We enjoy a national reputation for excellence in medical and nursing innovation, with a culture of interdisciplinary working.&lt;/p&gt;\n&lt;p&gt;You will join a team where you will receive training and support to become a highly skilled practitioner, undertaking extended roles such as Nurse Consent, IV Cannulation, and ERCP. You will also be funded to complete the gastro-intestinal nursing (GIN) course- a nationally recognised qualification. Post-holders will also have access to the UHSM Academy and LEAD Training Programmes, a unique and innovative concept to develop skillsets, which brings together all of the education and training activities of the University Hospital of South Manchester under one umbrella. Our commitment is further reinforced by our robust Trust Nurse Revalidation Programme – offering an e-portfolio and dedicated individual support.&lt;/p&gt;\n&lt;p&gt;We offer support and a friendly and caring environment in which to work and provide a large number of staff benefits, which you will find listed in the additional information link attached to the vacancy.&lt;/p&gt;\n&lt;p&gt;If you require more information about this post or would like to arrange an informal visit please contact: Lian Hodges, Endoscopy Matron and Clare Saetta, Endoscopy Unit Manager on 0161 291 4966 or Mariam Nalumansi, Deputy Unit Manager on 0161 291 4892.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMariam NalumansiJob titleDeputy Unit ManagerTelephone number0161 291 4892Additional contact information&lt;/p&gt;\n&lt;p&gt;Lian Hodges, Endoscopy Matron and Clare Saetta, Endoscopy Unit Manager on 0161 291 4966 or Mariam Nalumansi, Deputy Unit Manager on 0161 291 4892.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Hospital, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Staff Nurse - Endoscopy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251385", "validThrough": "2020-11-16T23:59:59+0000"}