{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737-£21,142 pa (pro rata)"}}, "datePosted": "2020-11-05T10:16:30+0000", "description": "&lt;p&gt;We are looking to recruit a dynamic, motivated and enthusiastic Band 3 Healthcare Assistant who has a passion for delivering high quality care within a community setting. The post is 15 hours per week and will be with the Regis Rural Community team, based at Bognor Regis War Memorial Hospital. The post holder will need to be available to work shifts across seven days.&lt;/p&gt;\n&lt;p&gt;This is an ideal opportunity for anyone looking for a career within healthcare, or an existing Band 2 or 3 Healthcare Assistant who wants to develop their clinical knowledge and practice within the community. Community and healthcare experience is desirable but not essential, as training will be given to develop the skills and knowledge required for this role.&lt;/p&gt;\n&lt;p&gt;If you are looking to work as part of a multidisciplinary team with a focus on providing high quality compassionate care to the most vulnerable within our community, and you possess excellent caring, organisational and communication skills, we would love to hear from you. A “can do” attitude is a must as is a desire to be the best and provide the highest standard of care. If you are passionate about making a difference and want to contribute to a team that is continuously striving to achieve excellence then this could be the role for you.&lt;/p&gt;\n&lt;p&gt;In return we can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supportive learning environment&lt;/li&gt;\n&lt;li&gt;Dedicated career pathways and great opportunities for continuing professional development&lt;/li&gt;\n&lt;li&gt;Practice Development Nurses to support you in developing skills and competencies&lt;/li&gt;\n&lt;li&gt;Commitment to and support for your wellbeing&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;NHS discounts and salary sacrifice schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Mustard - Team Lead&lt;/p&gt;\n&lt;p&gt;helen.mustard@nhs.net&lt;/p&gt;\n&lt;p&gt;07984 918484&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bognor Regis War Memorial Hospital, Bognor Regis", "postalCode": "PO22 9PP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7934", "longitude": "-.675398"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257193", "validThrough": "2020-11-15T23:59:59+0000"}