{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 to £51,069 per annum plus LW"}}, "datePosted": "2020-11-04T14:46:05+0000", "description": "&lt;p&gt;Imperial Stroke Fellowship &lt;br /&gt;&lt;br /&gt;Charing Cross Hospital (6 months Fixed Term)&lt;br /&gt;&lt;br /&gt;The Imperial College Healthcare NHS Trust’s Imperial Stroke Centre is a nationally leading centre and offers cutting edge emergency stroke interventions and acute stroke treatments to over 1800 patients per annum within a 23-bedded Hyper-Acute Stroke Unit and a 22-bedded Acute Stroke Unit. There is 24/7 stroke and neurology consultant cover.&lt;br /&gt;&lt;br /&gt;Applications are invited for a registrar to join our stroke team. The successful applicant will join five other stroke registrars in our service. Applicants from the UK are welcomed from different base specialties including neurology, general internal medicine and geriatric medicine, rehabilitation medicine and acute medicine. International applicants with equivalent relevant specialty training and PLAB certification are very welcome to apply.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Successful applicants will receive comprehensive training in all aspects of stroke care, including thrombolysis for acute stroke, neuroradiological and neurovascular aspects of stroke, experience in patient selection for mechanical thrombectomy, as well as training in TIA, stroke rehabilitation, and stroke prevention in the outpatient setting. Trainees will benefit from a weekly consultant-delivered SpR teaching programme dedicated to covering the Stroke Sub-Specialty Curriculum 2010. Applicants will participate actively in international multicentre clinical trials, academic and teaching rota, local clinical governance projects, and managerial aspects of service development. On call duties will remain wholly within the stroke service. Six stroke registrars provide thrombolysis, hyper-acute and acute stroke unit cover, TIA and stroke clinic cover. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for this full-time post starting as soon as possible on an initial 6 month contract with potential for extension.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Enquiries about this post should be emailed to Dr Soma Banerjee, Head of Specialty for Stroke Medicine on soma.banerjee@nhs.net, or to Dr Joseph Kwan, Training Lead for Stroke, on joseph.kwan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charing Cross Hospital, London", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Clinical Fellow in Stroke Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256270", "validThrough": "2020-11-18T23:59:59+0000"}