{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34510", "minValue": "27785", "unitText": "YEAR", "value": "£27,785.70 - £34,510  DOE"}}, "datePosted": "2020-10-05T12:11:00+0100", "description": "&lt;p&gt;At Lakeside View, we pride ourselves on our family values and treating each other with respect, valuing contributions and a real team effort for improving patient experience.&lt;/p&gt;\n&lt;p&gt;Lakeside View is a 28 bedded hospital in Willenhall and our 3 small acute wards add to the community feel of the hospital:&lt;/p&gt;\n&lt;p&gt;         Finch Ward - 12 bedded male acute ward&lt;br /&gt;         Robin Ward - 8 bedded male acute ward&lt;br /&gt;         Swan Ward - 8 bedded female acute ward&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The aim at Lakeside View is to provide a person centered approach and therapeutic environment, which promotes collaborative care planning to optimise treatment goals. Right from the point of admission, our aim is to support patients to be discharged safely back into the community where they can continue to progress towards recovery in a less restrictive environment.&lt;/p&gt;\n&lt;p&gt;Patients are usually referred to Lakeside View from local NHS trusts and we pride ourselves on excellent working relationships with patient, families and external agencies to support collaborative working and ensure clear communication throughout the care pathway in order to promote individuals&#39; recovery and facilitate discharge. In order to maximise recovery, interventions offered include a wide range of therapeutic approaches, combining psychiatric and cognitive behavioural perspectives with occupational therapy, psychology, leisure and recreational activity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ready for the recognition and rewards you deserve?&lt;br /&gt;We don’t just talk about putting our employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort which is why we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Job Opportunity&lt;/p&gt;\n&lt;p&gt;A unique opportunity to work in a unit where extensive MDT support is offered to the patients and colleagues alike. You will work alongside a team of professionals including Ward Managers, Charge Nurses, Doctors, Support workers, Therapist, Activity Coordinators and the Senior Management Team. As a Nurse at Lakeside View, you will care for patients with acute mental health needs who are admitted to us for assessment and treatment.&lt;/p&gt;\n&lt;p&gt;Requirements:&lt;/p&gt;\n&lt;p&gt;         Valid NMC registration&lt;br /&gt;         Our Nurses work flexible shift patterns of long days (7:30am – 7:45pm) and nights (7:30pm – 7:45am), working 7 shifts over a 14 day period&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Evidence of post registration continuing professional development&lt;br /&gt;A positive attitude and commitment to change, improvement and quality&lt;br /&gt;Excellent verbal, interpersonal and written communication skills&lt;br /&gt;Knowledge of NMC standards guidelines and professional practices&lt;br /&gt;Knowledge of the Mental Health Act and Code of Practice&lt;/p&gt;\n&lt;p&gt;In return:&lt;/p&gt;\n&lt;p&gt;         You will be well supported within your role, with a strong focus on continuing professional development&lt;br /&gt;         6 month preceptorship programme for newly qualified nurses&lt;br /&gt;         Day shifts are supported by Ward Managers and Charge Nurses and night shifts are supported by Night Managers&lt;br /&gt;         There is a managers on call system (on call Manager and Senior Manager) our of hours&lt;br /&gt;         We have a Junior Doctor based on site 24/7 as well as Speciality Doctors and Consultant Psychiatrists within working hours, and an on call Consultant Psychiatrist (out of hours)&lt;br /&gt;         Access to funded CPD courses relevant to the role&lt;br /&gt;         Ability to undertake your Practice Supervisor and Practice Assessor training in partnership with Wolverhampton University&lt;br /&gt;         Extensive training through our online Priory Academy as well as face-to-face training&lt;br /&gt;         Free access to RCNi&lt;br /&gt;         Your NMC registration will be fully funded&lt;br /&gt;         Opportunity to support Nursing students&lt;br /&gt;         Opportunity to progress through our career pathway – opportunities include developing to Charge Nurse, Night Manager, Ward Manager&lt;br /&gt;         Opportunity to take a lead role within the hospital – eg. Safeguarding lead, equality &amp; diversity lead&lt;br /&gt;         Generous annual leave entitlement and study leave to attend CPD opportunities, conferences etc&lt;br /&gt;         Company pension scheme&lt;br /&gt;         An extra days holiday to have your birthday off&lt;br /&gt;         Free meals on duty&lt;br /&gt;         Access to a pooled wellbeing fund which is used to improve health and wellbeing of the team at Lakeside View&lt;br /&gt;         Access to kitchen with free hot and cold drinks, breakfast and fruit&lt;br /&gt;         Relocation package can also be offered&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "WILLENHALL", "postalCode": "WV13 3AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5927", "longitude": "-2.06873"}}, "title": "LEARNING DISABILITY NURSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212613", "validThrough": "2020-11-27T23:59:59+0000"}