{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T14:16:19+0000", "description": "&lt;p&gt;An opportunity has arisen for a compassionate and competent band 5 Podiatrist to join our team based in St Helens.&lt;/p&gt;\n&lt;p&gt;North West Boroughs Podiatry service offers care to patients at risk who suffer from metabolic, vascular or neurological disorders, e.g. diabetes that place the lower limb in a compromised situation.&lt;/p&gt;\n&lt;p&gt;You will be required to assess, diagnose, develop and implement individual treatment plans for patients with a wide variety of clinical needs whilst discharging those deemed low risk. You will be working in clinics across St Helens providing care in accordance with service criteria. This will include working independently in community clinics and GP practices providing high quality clinical care.&lt;/p&gt;\n&lt;p&gt;The ability, means and willingness to travel between multiple sites in the course of performing duties is essential. The role will involve regular travel across healthcare organisation sites in the North West Boroughs Healthcare NHS Foundation Trust catchment area. Therefore, the post holder must be able to meet the travel requirements of this post. Please indicate on your application how you meet this requirement.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced with children’s and adults barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Maria McEvoy - Podiatry Team Manager&lt;/p&gt;\n&lt;p&gt;maria.mcevoy@nwbh.nhs.uk / 0151 290 2000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The O&#39;Hanlon Centre, Peasley Cross Hospital, St Helens", "postalCode": "WA9 3DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4405", "longitude": "-2.71946"}}, "title": "Podiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254287", "validThrough": "2020-11-15T23:59:59+0000"}