{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80556", "minValue": "70643", "unitText": "YEAR", "value": "£70,643 - £80,556 p.a. inc."}}, "datePosted": "2020-11-03T16:30:21+0000", "description": "&lt;p&gt;Head of Information Governance and Data Protection - Permanent&lt;/p&gt;\n&lt;p&gt;Band: 8C&lt;/p&gt;\n&lt;p&gt;Salary:£70,643 - £80,556 per annum, inclusive of High Cost Area Supplement&lt;/p&gt;\n&lt;p&gt;Work Base: 15 Marylebone Road, NW1 5JD, London&lt;/p&gt;\n&lt;p&gt;37.5 hours per week&lt;/p&gt;\n&lt;p&gt;The North West London Collaboration of Clinical Commissioning Groups is looking for an excellent Head of Information Governance and Data Protection to join the organisation. We are looking for a self-motivated, dynamic, and enthusiastic individual with a proven track record of working in the fast-paced environment of Information Governance.&lt;/p&gt;\n&lt;p&gt;The post holder will support the team in ensuring that the CCGs and the General Practices across NWL comply with all elements of Information Rights Law including the Data Protection Act 2018, General Data Protection Regulation, Access to Health Records Act 1990, Common Law Duty of Confidentiality and National Data Guardian Security Standards and Information Security.&lt;/p&gt;\n&lt;p&gt;The post holder must possess excellent verbal and written communication skills along with relevant experience in an NHS governance environment or similar. Knowledge of NHS information systems would be extremely beneficial, as is the ability to engage confidently and professionally at all levels. You will be a dynamic, forward thinking individual with innovative solutions to deliver, implement and embed the IG strategy to ensure compliance with legal, regulatory and national requirements. You will be highly motivated with the ability to lead and provide an exceptional proactive Information Governance service working across the North West London CCGs. You will be required to be flexible and imaginative with your approach and you will need excellent communication skills with the ability to explain complex details to all stakeholders.&lt;/p&gt;\n&lt;p&gt;Currently performing a similar role elsewhere, you will have worked in the Health and Care sector. To this end, you will be familiar with relevant policies, statutory requirements and approaches to information management and governance and will be credible at all levels, able to inspire confidence and secure cooperation for excellence in information governance. You will play an important and highly visible role, responsible for all aspects of information governance and data protection during a period of significant transformation. To this end, you will be required to set and secure support for a future focused strategy and plan that will support innovation and partnership working.&lt;/p&gt;\n&lt;p&gt;If you have a real appetite for leading and delivering major IG projects, with a demonstrable “can do” attitude for implementing the IG strategy for NWL CCGs, we look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;You must hold recognised information governance or related qualifications, however, if you believe you possess relevant transferable skills and sufficient experience working in the field then we will also consider this.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Brent CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128395"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 5JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5228", "longitude": "-.151514"}}, "title": "Head of Information Governance &amp; Data Protection", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254785", "validThrough": "2020-11-12T23:59:59+0000"}