{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36326", "minValue": "36326", "unitText": "YEAR", "value": "£21.61 ph"}}, "datePosted": "2020-10-28T14:06:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Purpose&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To provide autonomous, advanced musculoskeletal Physiotherapy management to patients referred to the service by Consultants. To contribute to the education and supervision of qualified and unqualified staff and students. To contribute to the management of the department, audit, clinical governance and to maintain personal CPD. To participate in the provision of emergency weekend and public holiday services to Orthopaedic patients as required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main Duties and Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibility to patient/client care&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To be professionally and legally accountable for all aspects of professional activities, working as an autonomous practitioner and seeking advice from more senior staff where appropriate.&lt;/li&gt;\n&lt;li&gt;To undertake the comprehensive assessment of a wide range of patients, including those with diverse or complex musculoskeletal presentations, using advanced manual assessment techniques and clinical reasoning skills to determine impairments and disabilities and to formulate a diagnosis/hypothesis and prognosis.&lt;/li&gt;\n&lt;li&gt;To use knowledge of evidence-based practice and assessment findings to formulate, plan and deliver a specialised individual patient-centred physiotherapy management programme and to evaluate patient progress and alter treatment programmes on a daily basis.&lt;/li&gt;\n&lt;li&gt;To create soundly clinically reasoned prognoses and recommend best course intervention, based on evidence available, and develop negotiated goals. This can occur in situations where conflicting evidence is present&lt;/li&gt;\n&lt;li&gt;To develop advanced knowledge of anatomy and physiology, particular conditions, their contraindications and precautions, and patient types specific to individual musculoskeletal presentations or specific rotations.&lt;/li&gt;\n&lt;li&gt;To be involved in health promotion and to facilitate the understanding of the aims of rehabilitation package, to optimise patient management and to ensure a consistent approach to patient care.&lt;/li&gt;\n&lt;li&gt;To provide education to patients, carers, relatives and other health care professionals in the management of the patient’s condition&lt;/li&gt;\n&lt;li&gt;To have appropriate clinical knowledge to triage patients according to their clinical need under the occasional guidance of more senior staff.&lt;/li&gt;\n&lt;li&gt;To perform advanced assessments and treatments of musculoskeletal conditions on a daily basis as an advanced practitioner requiring daily moderate but variable physical effort during sessions lasting from 10 minutes to 60 minutes per patient.&lt;/li&gt;\n&lt;li&gt;To use highly developed physical skills including dexterity, co-ordination and sensory skills for manual therapy assessment and treatment.&lt;/li&gt;\n&lt;li&gt;To work in areas where the environment may have artificial lighting, variable temperatures, poor ventilation and inadequate ergonomics.&lt;/li&gt;\n&lt;li&gt;To work with the possibility of exposure to body fluids, unpleasant smells, infections, hydrotherapy chemicals, and exposure to verbal or physical aggression&lt;/li&gt;\n&lt;li&gt;To sensitively deal with distressing or emotional circumstances regarding patient care e.g. imparting news of poor prognoses such as chronic pain management or lifelong disability or conveying news of realistic outcomes following injury or surgery.&lt;/li&gt;\n&lt;li&gt;To be responsible for the safe and competent use of all equipment used in the course of patient management, including gym, electrotherapy and hydrotherapy equipment and to report any equipment faults to relevant agency&lt;/li&gt;\n&lt;li&gt;To work as a lone practitioner in clinics, on wards and hydrotherapy as required.&lt;/li&gt;\n&lt;li&gt;To be an active member of the Orthopaedic/respiratory weekend rota, assessing and treating patients post operative patients.&lt;/li&gt;\n&lt;li&gt;To assess and manage clinical risk within own patient caseload and to be aware of and advise on risks involved in the caseloads of other junior team members.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Communication&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To be effective in the use of a range of verbal and non-verbal communication tools required for patient care. There may be barriers to communication i.e. language with the use of interpreters and cultural diversity issues, cognitive impairment, visual/hearing impairment, lack of privacy, altered emotional state, .&lt;/li&gt;\n&lt;li&gt;To demonstrate the ability to communicate complex and sensitive information to patient, carers and other staff including conveying information which may cause distress and to be able to deal with challenging behaviours.&lt;/li&gt;\n&lt;li&gt;To be able to motivate and persuade patients through advanced communication skills and the use of appropriate interpersonal skills.&lt;/li&gt;\n&lt;li&gt;To seek specialist advice from more senior staff through planned case review sessions, watched assessments, on a regular basis of 2.5 hours per month on average.&lt;/li&gt;\n&lt;li&gt;To be responsible for maintaining accurate and comprehensive patient treatment records, using written and information technology e.g. electronic patient records (EPR), in line with legal requirements, local and national policies, guidelines and standards of practice.&lt;/li&gt;\n&lt;li&gt;To deal with patients suffering from various degrees of pain that may lead to anxiety or aggressive behaviour.&lt;/li&gt;\n&lt;li&gt;To understand the legal framework around informed consent for assessment and treatment and to implement appropriate procedures in line with Trust policies.&lt;/li&gt;\n&lt;li&gt;To ensure that all information is communicated in a professional, effective and diplomatic way, to staff, patients and relatives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The job description is not intended to be exhaustive and it is likely that duties may be altered from time to time in the light of changing circumstances and after consultation with the post holder&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospital", "postalCode": "NW1 2BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5249", "longitude": "-.136987"}}, "title": "Bank Rotational MSK Physiotherapist Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246910", "validThrough": "2020-11-27T23:59:59+0000"}