{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16944", "minValue": "16944", "unitText": "YEAR", "value": "Up to £10.08 PH + Benefits"}}, "datePosted": "2020-10-19T12:36:20+0100", "description": "&lt;p&gt;If you care for others without a second thought and are looking for a rewarding career where you can make a difference and changes lives for the better, then a Bank Healthcare Assistant at Wellesley Hospital could be the right choice for you.&lt;/p&gt;\n&lt;p&gt;Whether you are looking for a new career or already work in healthcare through the NHS or private care, you’ll receive training to join the team where you will be valued and supported, with career development opportunities available.&lt;/p&gt;\n&lt;p&gt;It’s a career that you can take pride in while enjoying the satisfaction of helping people and seeing them improve. It’s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What you will be doing&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will join the team that works well together to provide care to people with mental health conditions. Whether you are have been aSupport Worker or Care Worker, you will utilise your experience to support people to lead a valued and fulfilled life.&lt;/p&gt;\n&lt;p&gt;It can be quite a challenging environment at times, so a positive attitude, compassion, resilience and vigilance are important. But it is hugely rewarding to see people improve; being able to do something today that they couldn’t do last week because of you.&lt;/p&gt;\n&lt;p&gt;The Elysium Wellbeing team is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/p&gt;\n&lt;p&gt;There are also career development opportunities in abundance. With a huge range of courses that will see you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt;We can offer you flexible working - you will work 12.5 hour days, on a 0 hour contract.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Where you will be working&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: Westpark 26, Chelston,Wellington, Somerset,TA21 9FF&lt;/p&gt;\n&lt;p&gt;Join the multidisciplinary team at Wellesley Hospital providing care to men and women with mental health conditions in a modern and purpose-built hospital with low and medium secure environments.&lt;/p&gt;\n&lt;p&gt;The unit is one of NHS England’s pilot sites to test new approaches to delivering mental health care and works alongside local NHS trusts and private care providers in the South West.&lt;/p&gt;\n&lt;p&gt;Wellesley Hospital is conveniently located near Wellington, close to the M5 and commutable from Taunton, Exeter, Yeovil and surrounding areas.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What you will get&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An hourly rate of up to £10.08(including the 12.07% holiday allowance uplift)&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Mandatory training&lt;/li&gt;\n&lt;li&gt;Wellbeing support and Activities&lt;/li&gt;\n&lt;li&gt;Flexible working&lt;/li&gt;\n&lt;li&gt;Paid induction&lt;/li&gt;\n&lt;li&gt;Transfer to perm in the future (optional)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About your next employer&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington", "postalCode": "TA21 9AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.981", "longitude": "-3.20687"}}, "title": "Bank Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232286", "validThrough": "2020-11-30T23:59:59+0000"}