{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata per annum"}}, "datePosted": "2020-10-26T14:16:27+0000", "description": "&lt;p&gt;Are you looking for a new challenge and have a passion for learning and development? An exciting opportunity has arisen for an Educational Lead within Health Visiting. We have opportunities in both East and West of Kent.&lt;/p&gt;\n&lt;p&gt;If you are an experienced practice assessor, we would like to hear from you. We are looking for a highly motivated, innovative, health visitor with a passion for learning and development to support service delivery.&lt;/p&gt;\n&lt;p&gt;A key part of the role is to support the development of new policies and guidelines along with maintaining standards of education for students and staff training.&lt;/p&gt;\n&lt;p&gt;You will continue to work within a team to maintain your own clinical practice and competence.&lt;/p&gt;\n&lt;p&gt;Here are 10 great reasons to come and work for us:&lt;/p&gt;\n&lt;p&gt;1. We are committed to providing the best care for our clients and their families.&lt;/p&gt;\n&lt;p&gt;2. We listen to you, value you and embrace new ideas - we want all colleagues to contribute to the direction of the service.&lt;/p&gt;\n&lt;p&gt;3. We value our colleagues and are committed to your professional development - we want you, and your career, to flourish.&lt;/p&gt;\n&lt;p&gt;4. We offer excellent training and support further education.&lt;/p&gt;\n&lt;p&gt;5. We operate a flexible working policy and would welcome applications for both part-time and full-time hours.&lt;/p&gt;\n&lt;p&gt;6. We offer amazing benefits to our colleagues, such as: Salary sacrifice schemes for bikes, cars and home electronics, flofit – our very own fitness programme, childcare vouchers, discounts at a number of high street retailers and a fast-track physiotherapy service.&lt;/p&gt;\n&lt;p&gt;7. We pledge to change the way we think and act about mental health and have invested in our time to change champions.&lt;/p&gt;\n&lt;p&gt;8. We believe in using quality improvement tools to &#39;cut the red tape&#39;, implement news ideas and reduce bureaucracy.&lt;/p&gt;\n&lt;p&gt;9. We are rated ‘OUTSTANDING’ by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;10. We CARE. So if you are motivated, friendly, caring and ready to respond to the challenge of our growing population in Kent by providing amazing care, please come and join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews are planned to be held on 24th November 2020 (timings &amp; venue TBC).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Sue Sharman&lt;/p&gt;\n&lt;p&gt;Job title: Programme Manager&lt;/p&gt;\n&lt;p&gt;Email address: suesharman@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07747635257&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "To be agreed at interview- East and West locations, Kent", "postalCode": "ME16 9NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2784", "longitude": ".478824"}}, "title": "Education Lead Health Visiting", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242868", "validThrough": "2020-11-16T23:59:59+0000"}