{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-19T17:12:33+0100", "description": "&lt;p&gt;An opportunity to live and work in glorious Devon – balance the excitement and challenge of developing a new role with a lifestyle surrounded by beautiful beaches, dramatic coastlines and rambling moorland.&lt;/p&gt;\n&lt;p&gt;Following the publication of the Enhanced Health in Care Homes Framework, associated with the NHS GP contract, we have a new and exciting opportunity for a Band 7 Occupational Therapist or Physiotherapist, to lead the design and implementation of the framework requirements in collaboration with the locality community services, local Care Home Providers, the Honiton, Ottery St Mary and Sidmouth Primary Care Network ( PCN) and the third sector in East Devon.&lt;/p&gt;\n&lt;p&gt;This role will be based within the Multi Disciplinary Community Health and Social Care –working closely with Primary Care ,Care Home providers and the third sector.&lt;/p&gt;\n&lt;p&gt;The postholder will be responsible for building relationships between stakeholders, designing processes and outcome measures and implementing the new services to ensure all our Care Home clients receive:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;high-quality personalised care within care homes;&lt;/li&gt;\n&lt;li&gt;access to the right care and the right health services&lt;/li&gt;\n&lt;li&gt;a reduction in unnecessary conveyances to hospitals, hospital admissions, and bed days&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This will be achieved through joined up MDT working, the implementation of effective risk stratification tools, training, and preventative, pre-emptive care by the right people.&lt;/p&gt;\n&lt;p&gt;The suitable post-holder will have key experience of community services and an understanding of health and social care preventative work regarding frailty and hospital admission avoidance. They will have worked within MDTs in a clinical and management/leadership role delivering care and preventative work in the field of elderly care.&lt;/p&gt;\n&lt;p&gt;Suitable post holders will be able to demonstrate leadership and management skills, excellent communication skills and have some experience of project work&lt;/p&gt;\n&lt;p&gt;Understanding of PCN networks in relation to community services and the ability to engage, influence and collaborate will contribute to successful project outcomes&lt;/p&gt;\n&lt;p&gt;Resilience, Confidence and Motivation as well as the ability to work autonomously will be key personal attributes of the successful post holder.&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are:&lt;/p&gt;\n&lt;p&gt;Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Honiton", "postalCode": "EX14 2DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7949", "longitude": "-3.18659"}}, "title": "AHP Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233314", "validThrough": "2020-11-15T23:59:59+0000"}