{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum"}}, "datePosted": "2020-11-04T15:30:51+0000", "description": "&lt;p&gt;Lancashire and South Cumbria NHS Foundation Trust is an exciting place to be an occupational therapist, and be highly valued in our Trust’s approach to multi-disciplinary care. We have sound professional structures to lead and inspire our substantial occupational therapy workforce. We are committed to delivering excellent services, putting occupation at the centre of our work and championing peoples’ rights for occupational needs to be recognised and addressed.&lt;/p&gt;\n&lt;p&gt;We currently have a vacancy for a full time Band 6 Senior Occupational Therapist within the Women’s service at Guild Lodge.&lt;/p&gt;\n&lt;p&gt;Guild Lodge is a well-established secure unit, offering medium, low and step down facilities, on the outskirts of Preston. It is modern and purpose built unit, within pleasant surroundings and a staff group committed to effective multi-disciplinary collaboration and the delivery of high quality care to the service user group.&lt;/p&gt;\n&lt;p&gt;You will be involved in the maintenance and further development of the Women’s Service –as well working alongside a wider occupational therapy department, which provides assessment and treatment for all the service lines within Guild Lodge (Men’s &amp; Acquired Brain Injury).&lt;/p&gt;\n&lt;p&gt;Your role will include the coordination, implementation of tailored specific treatment programmes for your own caseload – as well as supervising a range of staff and students. We offer excellent facilities – ranging from ward based involvement, to a custom built therapeutic resources centre (with a range of facilities including a sports hall and gym), a vocational rehabilitation facility a social centre, as well as accessing the community.&lt;/p&gt;\n&lt;p&gt;Preston is a thriving university city, ideally situated for motorway links or access to the beautiful Fylde coast, the Pennines and the Lake District.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Jen Gardner , Acting Clinical Specialist OT for Women’s &amp; Men’s MSU Services &lt;/em&gt;&lt;em&gt;(&lt;/em&gt;&lt;em&gt; 01772 406693)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Mark Love, Clinical Specialist OT for ABI &amp; Men’s MSU/Stepdown Services &lt;/em&gt;&lt;em&gt;(&lt;/em&gt;&lt;em&gt; 01772 406693)&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guild Lodge, Preston", "postalCode": "PR3 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8165", "longitude": "-2.65834"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256438", "validThrough": "2020-11-18T23:59:59+0000"}