{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 per annum"}}, "datePosted": "2020-10-29T11:17:07+0000", "description": "&lt;p&gt;Band 6 OT Medicine &amp; Surgery&lt;/p&gt;\n&lt;p&gt;We have an exciting full time static Band 6 opportunity in our medicine &amp; surgery speciality team based at QMC. With us you will have a broad range of opportunities both in clinical skills and leadership development, working in a large dynamic team. We work within an effective MDT environment, where the OT role is widely valued and there are fantastic opportunities to review and change our service to meet the needs of our patients.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a broad range of clinical experience at band 5 level. This should include experience of working with patients who have undergone lower limb amputation surgery, carrying out home and access visits, assessing for wheelchair and equipment provision, co-ordinating safe and effective discharges and referring on to community teams for follow-up. The successful candidate will have excellent communication skills and the ability to build positive working relationships with MDT colleagues.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work closely with Band 4 assistant practitioners to plan and co-ordinate discharges for medical and surgical patients. The role will include liaising with community teams, supervising and supporting junior colleagues and acting as a clinical educator to students. A flexible approach, excellent team working, organisational and time management skills are all essential to this post.&lt;/p&gt;\n&lt;p&gt;NUH is one of the largest teaching NHS Trusts and delivers several regional specialist services including The Major Trauma Centre, Neurosurgery and Vascular surgery. This post offers the opportunity to provide quality services and promotes better care and treatment for service users to improve the health and well-being of Nottinghamshire residents.&lt;/p&gt;\n&lt;p&gt;You will need to have an enthusiastic approach, be forward thinking and have a problem solving approach to patient management. We are looking for individuals with excellent communication and interpersonal skills to facilitate working in close partnership with MDT colleagues to provide an effective OT service to our patients to support the Trusts objectives.&lt;/p&gt;\n&lt;p&gt;You will be provided with regular supervision by your team leader. We have received praise from Health Education England East Midlands regarding the quality of our learning environment.&lt;/p&gt;\n&lt;p&gt;NUH supports 7 day working and you will be required to work across seven days and across campuses as required to meet the needs of Therapy Services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAngela JamiesonJob titleTeam LeaderEmail addressangela.jamieson@nuh.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;All new employees starting work at NUH will be subject to a DBS check and liable for the cost.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Angela Jamieson - Team Leader&lt;/p&gt;\n&lt;p&gt;angela.jamieson@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;April Gartlan - Team Leader&lt;/p&gt;\n&lt;p&gt;april.gartlan@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;0115 9249924 Est 63273&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Medical Centre, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Occupational Therapist Med Surg", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248056", "validThrough": "2020-11-12T23:59:59+0000"}