{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "113349", "minValue": "113349", "unitText": "YEAR", "value": "Monday – Friday rate: £67.43 p/h"}}, "datePosted": "2020-11-06T16:17:38+0000", "description": "&lt;p&gt;In response to the Covid-19 pandemic, healthcare providers across Oxfordshire have responded and worked collaboratively to set up CALM clinics, visiting services and a monitoring service, together becoming the Community, Assessment, Liaison and Monitoring (CALM) Service.&lt;/p&gt;\n&lt;p&gt;CALM services provide a safer alternative facility, for primary care to see their Covid-19 affected patients requiring face to face assessment or treatment. As suggested by NHSE this is ‘likely to be the most effective option in managing cross contamination and protecting patients not affected by Covid (GREEN) and at risk (BLUE) patients.&lt;/p&gt;\n&lt;p&gt;The Service will be staffed by a variety of clinicians (dependent on need) including GPs, Nurses, Advanced Nurse Practitioners, Paramedics, Infection Control Coordinators and Service Administrators to enable the delegation of workload from GPs to other clinicians &amp; colleagues and to provide more specialised services to patients.&lt;/p&gt;\n&lt;p&gt;As a CALM service GP you will be offering a variety of care to patients referred by local GP practices on behalf of those practices.&lt;/p&gt;\n&lt;p&gt;Each of the CALM services has an Infection Control Coordinator who will take overall responsibility of the day to day infection prevention and control measures we have in place and ensure all Infection Control procedures are strictly followed. Appropriate PPE is provided for all staff working in CALM services and it is expected that the current guidance on its use is followed completely. All members of staff are encouraged to regularly review the latest guidelines to ensure their practice is current.&lt;/p&gt;\n&lt;p&gt;CALM clinics currently operate on a 5-7 day per week basis from 10.00am until 6.30pm. Shift durations may vary but to ensure the wellbeing of staff we require all members of the team who are working for longer than 6 hours to take a minimum of 1 x 30 minute unpaid break during their session.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Once we have received sufficient appropriate applications, we may withdraw the advertisement.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;No agencies please.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "OxFed Health & Care Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3 9RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7704", "longitude": "-1.22685"}}, "title": "CALM Clinic General Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260585", "validThrough": "2020-12-11T23:59:59+0000"}