{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890, per annum, pro rata"}}, "datePosted": "2020-11-05T13:16:29+0000", "description": "&lt;p&gt;We have one aim - to prevent unnecessary hospital admission or to reduce a prolonged length of stay as well as reducing the risk of patients being readmitted. We have a reputation of being a dedicated and dynamic MDT team and we would like to welcome you to join us to complement our existing service and drive it forwards.&lt;/p&gt;\n&lt;p&gt;However, don’t just take our word for it – this is what others think about the service our team provides and we are so proud to share this feedback with you.&lt;/p&gt;\n&lt;p&gt;“&lt;em&gt;Everyone showed compassion and understanding, did everything possible and extended outside care at home giving contact numbers etc- so I feel that I am not on my own coping with mum. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It’s all in a day’s work for this dedicated team, working with ED and community partners, proving yet again together we can achieve the best outcomes for patients.” &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;What better experience can be offered to patients/ carers at their first point of contact with Royal Preston Hospital?&lt;/p&gt;\n&lt;p&gt;The ethos of our acute specialist frailty team, known as ‘LIFT’ is both welcoming and supportive to ensure that patients, carers and staff are offered a first-class experience to ensure the best outcomes. We are an innovative team, providing a friendly, educational environment. This encourages positive staff learning opportunities to continually improve the effectiveness of the frailty service.&lt;/p&gt;\n&lt;p&gt;Our LIFT service was developed in 2012, providing high quality; specialist integrated assessment and intervention for frail patients. Our team has evolved over the years to become increasingly integrated, promoting a proactive and efficient service. Award winning, we have been acknowledged as being at the forefront of integrated frailty management which makes us so proud, and we are a member of the National Specialist Frailty Network. Our recent achievement has been to open an Acute Frailty Unit at Royal Preston Hospital, alongside the admission avoidance service to the Emergency department and the outreach service to the Virtual Frailty ward.&lt;/p&gt;\n&lt;p&gt;The team at present consists of Specialist Nurses, Occupational Therapy, Physiotherapy, Integrated Assistants and Consultant Geriatricians, with close affiliation with the Specialist Falls and Fracture Prevention Team. The integrated skills within the team are developed through cross learning amongst the disciplines, both formal and informal and through access to national and regional training events/ conferences. In addition, we have the weekly opportunity to work alongside the Consultant Geriatricians as another source of learning but also to provide the highest standards of patient care. So as you can see there are lots of different people to get to know and learn together all sharing our skills and experience collectively.&lt;/p&gt;\n&lt;p&gt;Our Trust is the recognized Regional Adult Major Trauma Centre with a ‘Silver trauma’ service, so working in the Emergency department and on the Acute Frailty unit can be challenging but is very rewarding with its varied, fast pace caseload. Clinical reasoning in these areas can be challenging but we will support the successful candidate in developing these skills.&lt;/p&gt;\n&lt;p&gt;As part of our ongoing service development, we are working alongside the Continuing Development, Trust Management , Care Commissioners and our Community Frailty team to develop seamless, effective care plans for patients and clear pathways for stakeholders. In order to ensure the ongoing provision of this fantastic service, we need the most innovative, enthusiastic but flexible person, preferably with experience in working with frail patients, maybe in a similar environment to an Emergency department.&lt;/p&gt;\n&lt;p&gt;LIFT currently works 8.30 to 16.30 Monday to Friday, however as part of these developments, there is exciting potential to expand the service to 7 days so flexible working is welcomed. Alongside these future developments, we are optimistic that therapy resource will be expanded in the near future to meet the increasing demand on our services. We are therefore inviting you to be a part of this forward thinking, enthusiastic team and will offer you the opportunity to not only grow as a professional but be actively involved in the ongoing developments.&lt;/p&gt;\n&lt;p&gt;Of course this advert only gives you a very small introduction to the role. We are sure you will have plenty of questions to ask so would like to invite you to visit or call us for a more informal chat about the service or what you can offer us.&lt;/p&gt;\n&lt;p&gt;Interview date: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulie BrownJob titleTeam Lead Occupational TherapistEmail addressjulie.brown@lthtr.nhs.ukTelephone number01772 524453Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to know more about this great opportunity please contact: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Julie Brown (Team Lead Occupational Therapist)&lt;/p&gt;\n&lt;p&gt;Donna Wolstenholme (Clinical Lead Physiotherapist)&lt;/p&gt;\n&lt;p&gt;Tel: 01772 524453&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "LIFT Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257841", "validThrough": "2020-11-20T23:59:59+0000"}