{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 gross per annum"}}, "datePosted": "2020-11-04T15:15:19+0000", "description": "&lt;p&gt;Do you have a passion for working with young people and their families?&lt;/p&gt;\n&lt;p&gt;Are you an experienced and motivated mental health nurse eager to develop your mental health nursing skills in a specialist clinical area?&lt;/p&gt;\n&lt;p&gt;Do you have the skills and enthusiasm to develop helpful therapeutic relationships with young people coping with the challenge of embarking on recovery from an eating disorder?&lt;/p&gt;\n&lt;p&gt;Are you interested in working in a supportive and enthusiastic specialist team with opportunity to provide community-based treatment utilising your key mental health nursing skills?&lt;/p&gt;\n&lt;p&gt;Can you collaborate with young people and their families to develop holistic plans of care to respond to the unique challenges of psychological and physical health risks presenting in this group of young people?&lt;/p&gt;\n&lt;p&gt;The Suffolk wide Childrens and Young Peoples community Eating Disorder Team has undergone a period of exciting expansion and service development following the investment of new national monies. This additional provision has significantly enhanced the current service available to young people with eating disorders and their families and is meeting national waiting time standards to provide assessment and treatment with a drive for early intervention and improved recovery outcomes.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting to a Band 6 nursing post covering the East of the county based with the team in Ipswich. This posts will be primarily working with children and adolescents but is based in an age inclusive team. This is an exciting time to join a committed and experienced team to play a key role in ongoing team and service development to meet the complex needs of this client group in this challenging area of practice.&lt;/p&gt;\n&lt;p&gt;Ideally you will have relevant experience with this client group or significant relevant transferable skills appropriate to this role. You will be working in a supportive multi-disciplinary team; providing assessments, contributing to and coordinating care plans, providing direct therapeutic interventions to children and young people as well as supporting their families and carers.&lt;/p&gt;\n&lt;p&gt;The team is committed to providing training in eating disorders to non-specialist mental health professionals around the Trust and with key partners and the post-holder would have a key role in this provision alongside other team members. We have an effective working relationship and admission pathway with our local paediatric inpatient unit, and you would play a key role in supporting admissions to this unit with which we have a successful track record of preventing specialist admissions.&lt;/p&gt;\n&lt;p&gt;We are looking for individuals who possess a combination of the professional skills, personal enthusiasm and energy to work with this group of young people and their families. In return we offer the opportunity to work with a supportive multi-disciplinary team at a point where new service developments remain underway including a co-produced carer support group, carer skills training and the clinical application of Routine Outcome measures. The team is engaged in ongoing service developments with the East of England ED Network with the national drive for improvement in the treatment available to young people with eating disorders.&lt;/p&gt;\n&lt;p&gt;We offer specialist clinical supervision and specialist training to deliver NICE concordant treatments including Family Based Treatment and CBT specific to eating disorders.&lt;/p&gt;\n&lt;p&gt;If this sounds like a challenge you are interested in learning more about, we look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah CrossJob titleClincial Team LeaderEmail addresssarah.cross@nsft.nhs.ukTelephone number01473 279200Additional contact information&lt;/p&gt;\n&lt;p&gt;If this sounds like a challenge you are interested in learning more about, we look forward to hearing from you. To discuss this opportunity further or arrange an informal visit to meet the team please contact Sarah Cross Clinical Team Leader on 01473 279200 or 07415337780.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Resource Centre, Walker Close, Ipswich", "postalCode": "IP3 8LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0522", "longitude": "1.19717"}}, "title": "Senior Community Eating Disorders Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256373", "validThrough": "2020-11-18T23:59:59+0000"}