{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-06T09:16:00+0000", "description": "&lt;p&gt;We are looking to recruit a Theatre administrator/ Receptionist to join our busy theatre team at the Lister Treatment centre.&lt;/p&gt;\n&lt;p&gt;The post holder will need to be an experienced receptionist/administrator and have good communication skills. You will need to be organised and have an ability to manage time effectively. You will need to be Lorenzo trained or have experience with other patient management systems, and be prepared to undertake further training as required.&lt;/p&gt;\n&lt;p&gt;The role will involve meeting and greeting patients coming to hospital for surgery, inputting patient details onto the patient administrative system, requesting and tracking patient notes, taking telephone calls and contacting patients with booking times, inputting data for clinics, admitting and discharging patients on the patient management systems. Experience with patient management systems is therefore essential for this role.&lt;/p&gt;\n&lt;p&gt;The successful post holder will be expected to have good interpersonal skills and communicate with the multi-disciplinary team. You will be working very closely with the nursing team to deliver exceptional service.&lt;/p&gt;\n&lt;p&gt;Working hours required for this role are various shifts between the hours of 0700 and 1800, we are recruiting for a 7 day service.&lt;/p&gt;\n&lt;p&gt;At East and North Hertfordshire NHS Trust we are looking to be amongst the best. The Trust has embarked upon a period of significant change enabled by a £150m investment; one of the biggest transformation and improvement programmes in the country. Since 2014 all acute services are now centralized at the Lister Hospital in Stevenage, Hertfordshire, placing the Trust in a position to deliver clinical services that are amongst the very best.&lt;/p&gt;\n&lt;p&gt;As we grow and promote better patient care and experience in our new facilities, we are looking to recruit highly motivated, experienced and innovative staff who will embrace our exciting service developments, whilst providing the best care possible to our patients.&lt;/p&gt;\n&lt;p&gt;We can offer you the benefit of comprehensive training and the chance to focus on your chosen specialty. The Trusts’ organizational development programme LEND aims to ensure that the benefits of reconfiguration are enhanced by high levels of staff engagement.&lt;/p&gt;\n&lt;p&gt;This modern state of the art building has 6 theatres, 2 recovery areas and a Discharge Lounge. We undertake various specialities including Orthopaedic, General Surgery, Urology, Plastic Surgery, Gynaecology, Plastics and Ophthalmology. The Treatment Centre cares for a range of day surgery and in-patient cases across all of our specialities.&lt;/p&gt;\n&lt;p&gt;We pride ourselves in our determination to go that extra mile for our patients.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please contact Theatre Team Manager Dawn Woods on dawn.woods2@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stevenage, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Theatre administrator/ Receptionist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258986", "validThrough": "2020-11-19T23:59:59+0000"}