{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata"}}, "datePosted": "2020-10-13T14:07:45+0100", "description": "&lt;p&gt;We are seeking to appoint a Senior Clinical Psychologist, (Grade 8a) to join the Department of Paediatric Psychology, to work into both a specialist Respiratory Team (LTV) and in our General work. The LTV team are keen to build and develop the role of psychology in their teams, having already had input over several years. The General work means working with children with a wide variety of physical health conditions including; allergies, gastroenterological and neurological conditions.&lt;/p&gt;\n&lt;p&gt;The post holder will offer a high quality specialist clinical psychology service to children, young people and their families referred by these teams. They will play a key role in the LTVl multi-disciplinary team and will offer supervision, consultation and training to the team members. This remit may also extend to other teams in the region. In addition the post holder will be required to undertake service evaluation and research regarding psychological outcomes.&lt;/p&gt;\n&lt;p&gt;The post holder will be based within the Department of Paediatric Psychology, but may be required to deliver services at the Leicester Royal Infirmary and from Community Clinics and other settings as appropriate.&lt;/p&gt;\n&lt;p&gt;We are a team of 13 and are continuing to grow. We are a specialist team in a larger CAMHS provision within Leicester and Leicestershire. There are plenty of opportunities for training and supervision is well provided for. We have a number of trainees from the DClinPsy course at University of Leicester so there would be opportunities to supervise trainees as well as other qualified staff.&lt;/p&gt;\n&lt;p&gt;We are keen to hear from enthusiastic, flexible and organised applicants.&lt;/p&gt;\n&lt;p&gt;Area of Work: Paediatric Psychology – General and Respiratory (Long Term Ventilation&lt;/p&gt;\n&lt;p&gt;Department: Paediatric Psychology, Artemis House, Westcotes Drive, Leicester&lt;/p&gt;\n&lt;p&gt;Hours: 30 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact Dr Camilla Watters (Consultant Clinical Psychologist/Clinical Team Lead) on 0116 295 2959&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE3 0QU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6301", "longitude": "-1.15792"}}, "title": "Band 8a Senior Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224638", "validThrough": "2020-11-06T23:59:59+0000"}