{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27414", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £27,414"}}, "datePosted": "2020-10-28T14:49:17+0000", "description": "&lt;p&gt;&lt;strong&gt;FOUNDRY HEALTHCARE LEWES&lt;/strong&gt; is a Primary Care Network of merged NHS GP Practices looking after the residents of Lewes and the surrounding villages.&lt;/p&gt;\n&lt;p&gt;Due to an organisational restructure we have an exciting opportunity for a Reception and Admin Manager to join our team. The successful candidate should ideally have GP Practice experience and an understanding of the changes taking place within primary care. They will be responsible for a large team who have recently undergone considerable changes as a result of the merge of three Lewes Practices and Ringmer branch. They will be required to work across all four sites.&lt;/p&gt;\n&lt;p&gt;We welcome both internal and external applicants.&lt;/p&gt;\n&lt;p&gt;This is a full time post but job share will be considered&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;JOB PURPOSE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;• Manage the Reception and Administration teams and ensure the continued smooth running of the practice for the benefit of clinicians and patients.&lt;/p&gt;\n&lt;p&gt;• Oversee the professional development and annual appraisals of the team, identifying training needs and using coaching and mentoring techniques to foster a proactive outcome.&lt;/p&gt;\n&lt;p&gt;• Review, initiate and embed processes that eliminate inconsistency, improve quality and increase productivity, specifically looking at ways to reduce the administrative workload for the Clinical staff&lt;/p&gt;\n&lt;p&gt;• Provide a first point of escalation for patient enquiries, problems and complaints.&lt;/p&gt;\n&lt;p&gt;• Enable the team to thrive during a time of transformation and rapid change.&lt;/p&gt;\n&lt;p&gt;• Co-ordinate staff to ensure all tasks are completed on a daily basis&lt;/p&gt;\n&lt;p&gt;• Act as first line of contact for the team, supporting, motivating, coaching, mentoring and promoting excellent staff relations&lt;/p&gt;\n&lt;p&gt;• Ensuring all practice protocols and standard operating procedures are understood and adhered to&lt;/p&gt;\n&lt;p&gt;• Continuous improvement and development of reception and administration protocols and standard operating procedures in conjunction with the practice manager and clinicians&lt;/p&gt;\n&lt;p&gt;• Ensure all staff are well aware of the disciplinary and grievance procedure and have an understanding of health and safety&lt;/p&gt;\n&lt;p&gt;• Maintaining staff rotas and coordinate adequate cover during sickness and holidays, helping to cover these duties where appropriate including extra hours&lt;/p&gt;\n&lt;p&gt;• Support the Operational Manager by overseeing the appropriate use of the appointment booking system by reception team and identify any areas for improvement&lt;/p&gt;\n&lt;p&gt;• Support the PCN Managers in reviewing and updating of practice policies and procedures&lt;/p&gt;\n&lt;p&gt;• Oversee and provide induction training for any new members of the reception &amp; administration team.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lewes", "postalCode": "BN7 2LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8733", "longitude": ".011859"}}, "title": "Reception and Admin Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247052", "validThrough": "2020-11-29T23:59:59+0000"}