{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T13:16:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Network Engineer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Up to £44,503&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Reading &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A fantastic opportunity to join one of the country’s most digitally advanced NHS Trusts as a Senior Network Engineer.&lt;/p&gt;\n&lt;p&gt;BHFT (Berkshire Healthcare NHS Foundation Trust) is one of the few Mental Health Trusts in the country to be given Global Digital Exemplar status, meaning we are internationally recognised as delivering exceptional care, efficiently, through the use of world-class digital technology and information.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will primarily be focused on ensuring the resolution of advanced, complex issues that might arise from our core desktops, server applications, systems &amp; network infrastructure, hardware and software. You will also be involved in network design and project work. Overall your responsibilities will split 70/30 between IT projects and BAU.&lt;/p&gt;\n&lt;p&gt;The role also covers maintenance and support of the core network infrastructure that runs the Trust’s systems both on premise and in the cloud (Azure). The network infrastructure includes multiple site connectivity, MPLS network, firewalls, routers, switch networking, load balancers, fibre switches and multiple site data centres.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have significant experience at Senior Network Engineer level (Level3) and in an IT support environment. This should include experience of providing diverse services to multiple customers within a large multi-faced, multi-site organisation&lt;/p&gt;\n&lt;p&gt;You technical expertise should include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;CCNA, CCNP or equivalent level of knowledge&lt;/li&gt;\n&lt;li&gt;A Foundation Certificate in PRINCE2 project management techniques&lt;/li&gt;\n&lt;li&gt;Detailed technical understanding of the theory and practice of networking; OSI model, TCP/IP, LAN, WAN, Firewalls, Routers and switches&lt;/li&gt;\n&lt;li&gt;Expert knowledge of Cisco and Fortinet Firewalls&lt;/li&gt;\n&lt;li&gt;Advanced knowledge of routing and tunnelling protocols including BGP, OSPF, EIGRP, IPSEC, GRE, and L2TPv3&lt;/li&gt;\n&lt;li&gt;Experience with design and implementation of network management tools. Experience installing, configuring, and maintaining all manners of network devices including fibre switches&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a fantastic opportunity to join this forward thinking and technology savvy Trust and to be a part of our success.&lt;/p&gt;\n&lt;p&gt;We are committed to equal opportunities and welcome applications from all sections of the community, regardless of any protected characteristics. Reasonable adjustments will be made for disabled applicants where&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "57-59 Bath Road, Reading", "postalCode": "RG30 2BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.447", "longitude": "-.998152"}}, "title": "Senior Network Engineer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252203", "validThrough": "2020-11-09T23:59:59+0000"}