{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005-£19,337"}}, "datePosted": "2020-11-05T14:57:28+0000", "description": "&lt;p&gt;Do you have excellent interpersonal skills? Are you flexible, approachable and a team player? We are recruiting receptionists to join our Podiatry Reception team at two locations.&lt;/p&gt;\n&lt;p&gt;We have a full time position avaible at Hartismere Hospital and a part time position avaialble at Haverhill Health Centre.&lt;/p&gt;\n&lt;p&gt;Ideally, applicants should have experience of working in the NHS however this is not essential. Applicants should be well organised, have excellent communicational skills and be a team player. As you will be the first point of contact for patients good customer service skills are a must. Computer literacy would be advantageous although full training will be given.&lt;/p&gt;\n&lt;p&gt;The Suffolk Podiatry Service is run by Suffolk GP Federation, a not-for-profit organisation owned by 57 GP practices. Our aim is to find innovative solutions to the challenges currently faced by the NHS, while at the same time protecting the interests of general practice and ensuring that patients continue to receive the very best care.&lt;/p&gt;\n&lt;p&gt;Here at Suffolk GP Federation we pride ourselves on recognising key players, and rewarding our hard working teams. As a result, we’re excited to be partnered with Perkbox – giving everyone access to their award winning employee experience platform. Team members will get hundreds of perks from some of the world’s biggest brands, and benefit from the great freebies on offer! Become part of our team today!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Suffolk GP Federation CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136254"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Haverhill/Eye", "postalCode": "CB9"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0838", "longitude": ".449983"}}, "title": "Receptionist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258206", "validThrough": "2020-11-25T23:59:59+0000"}