{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata, per annum"}}, "datePosted": "2020-11-02T14:16:40+0000", "description": "&lt;p&gt;If you are Newly Qualified Paediatric Nurse interested in working at University Hospital Coventry &amp; Warwickshire? Applications are invited from all students who are due to qualify in 2020. &lt;br /&gt;&lt;br /&gt;Nursing at UHCW is special; we have a team of over 3,000 nurses who have the passion and commitment to deliver outstanding care in the most challenging areas of clinical practice. We are one of the UK’s leading specialist teaching hospitals, providing world class healthcare to a population of over 1,000,000.&lt;br /&gt;&lt;br /&gt;Nursing at UHCW has developed strong links to Coventry University and our purpose built Clinical Sciences Building offers a whole range of facilities to aid your education and training including a modern library with excellent IT facilities.&lt;br /&gt;&lt;br /&gt;We offer major advances in patient care, clinical teaching and innovation. We&#39;re exceeding the national waiting times targets for our patients we have low incidence of healthcare associated infections such as MRSA and C. difficile.&lt;br /&gt;&lt;br /&gt;We value the contribution our nurses make to UHCW and are committed to providing support and mentorship to all of our employees.&lt;br /&gt;&lt;br /&gt;Our Paediatric services at University Hospitals Coventry and Warwickshire have the following ward/department:&lt;br /&gt;&lt;br /&gt;• Childrens Emergency Department (CED)&lt;br /&gt;• Ward 14 - The adolescent unit over 13 years&lt;br /&gt;• Ward 15 - Infant ward caring for 0-2 years &lt;br /&gt;• Ward 15a:- High Dependency Unit Paediatric HDU - 6 - 8 bedded Level I-II Paediatric Critical Care Unit caring for infants, children and young people aged 0-16/17 years of age from Coventry and Warwickshire.&lt;br /&gt;• Ward 16 - The Children&#39;s Ward caring for children aged 2-12 years&lt;br /&gt;• Paediatric Medical Day Unit is a 6 bedded area open from 8am-8pm and treats non-emergency day case patients, such as those requiring blood transfusions, allergy and endocrine testing and day case chemotherapy. &lt;br /&gt;• Outpatient Facilities - There is a Children’s Outpatient Department (COPD) based at University site with a smaller number of children’s clinics at Rugby Hospital of St. Cross. &lt;br /&gt;• Neonatal Unit&lt;br /&gt;&lt;br /&gt;Each area has bespoke nurse development and training plans with the support of a Paediatric Practice Educator.&lt;br /&gt;&lt;br /&gt;Following submission of your application you will be invited to undertake a one hour recruitment paper developed by Practice Educators that covers; drug calculations, pharmacology, situational judgements incorporating the 6c’s, UHCW Trust values, clinical skills and underpinning nursing knowledge.&lt;/p&gt;\n&lt;p&gt;Within our recently rated “Good by the CQC” (in all 5 domains) paediatric unit, we currently have Band 5 vacancies for newly qualified childrens nurses in all inpatient areas (Wards 14,15 and 16) and Childrens Emergency Department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Also rated “Good” is our PHDU after the “Care of the Critically Ill and Injured Child” peer review.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our employee benefits include:&lt;/p&gt;\n&lt;p&gt;Commence on band 4 pay rate until in receipt of NMC pin&lt;/p&gt;\n&lt;p&gt;Rotation programme available within the Paediatric Departments&lt;/p&gt;\n&lt;p&gt;Preceptorship programme.&lt;/p&gt;\n&lt;p&gt;Supernumary and supervisory shifts.&lt;/p&gt;\n&lt;p&gt;Various combinations of long and short days, nights and annually reviewed flexible working patterns can be discussed.&lt;/p&gt;\n&lt;p&gt;Possible relocation expenses (eligibility dependent on relocation)&lt;/p&gt;\n&lt;p&gt;NHS car lease scheme available&lt;/p&gt;\n&lt;p&gt;Excellent pension and maternity pay schemes.&lt;/p&gt;\n&lt;p&gt;Access to inhouse physiotherapy services.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;Recruiting to Values&lt;br /&gt;&lt;br /&gt;To ensure that we provide world-class patient care, we recruit people that can demonstrate the Trust’s Values and Behaviours in their everyday life. Therefore, if you are shortlisted, you will be undertaking a Values Based Interview/Assessment, which explores not only what you do but how and why you do it.&lt;br /&gt;&lt;br /&gt;Before applying, we encourage you to review the Trust’s Values and Behaviours Framework and Values Based Recruitment Factsheet which can be accessed on the right side of this page under the job description.&lt;br /&gt;&lt;br /&gt;The Supporting Information section in your application should therefore reflect your understanding of the Trust’s Values and associated behaviours. You will be expected to provide us with examples from work experience and/or personal life which demonstrate these values through your behaviour.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital Coventry and Hospital of St. Cross, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Newly Qualified Paediatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252395", "validThrough": "2020-11-16T23:59:59+0000"}