{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-03T09:16:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Paediatric Cleft Lip and Palate and Plastic Surgeon&lt;/strong&gt;&lt;strong&gt; (10 PAs)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a 10 PA Consultant post in Paediatric Cleft Lip and Palate Surgery with sessions in Paediatric Plastic Surgery, based at Great Ormond Street Hospital for Children NHS Trust. The surgeon, in conjunction with the current cleft team will be responsible for delivering the surgical service for the North Thames Cleft Network.&lt;/p&gt;\n&lt;p&gt;The job plan is presented as a 10 PA Consultant Paediatric Cleft Lip and Palate and Plastic Surgeon, however the Trust welcomes applications from those who wish to work part time in paediatric cleft surgery only, including those from a maxillofacial or ENT background.&lt;/p&gt;\n&lt;p&gt;Duties of the post will include delivery of a cleft surgical service with participation in the on call rota, working collaboratively within the multidisciplinary team, taking an active part in the undergraduate and postgraduate teaching of health care professionals and working to enhance the delivery of the service through structured Quality Improvement.&lt;/p&gt;\n&lt;p&gt;Great Ormond Street Hospital for Children NHS Trust is a postgraduate teaching hospital, linked with the Institute of Child Health (ICH).&lt;/p&gt;\n&lt;p&gt;The successful candidate must possess full GMC registration and be on specialist register for Plastic Surgery, Otolaryngology or Oral and Maxillofacial surgery (CCT or equivalent), or within 6 months of award of CCT (or equivalent) by date of interview.&lt;/p&gt;\n&lt;p&gt;The position is open to applicants who are able to work less than the full number of PAs. The Trust encourages applications from all sections of the community.&lt;/p&gt;\n&lt;p&gt;The basic salary range for this post is £82,096 to £110,683 per annum plus £2,162 per annum London Weighting.&lt;/p&gt;\n&lt;p&gt;All applicants should return their application forms electronically. You must register first before you can apply for the post. If you have any queries please contact us via email at vacancy@gosh.nhs.uk quoting the appropriate reference number.&lt;/p&gt;\n&lt;p&gt;We offer a range of flexible working patterns; contact us for more information.&lt;/p&gt;\n&lt;p&gt;Confirmation of enhanced disclosure will be required before appointment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interested applicants are invited to contact Mr Neil Bulstrode and/or Mr Norman Hay, Speciality Leads by telephone on 020 7405 9200 ext. 5222/8614.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Consultant Paediatric Cleft Lip and Palate and Plastic Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253236", "validThrough": "2020-11-17T23:59:59+0000"}