{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-23T10:46:37+0100", "description": "&lt;p&gt;&lt;span&gt;East Riding of Yorkshire CCG has been successful in achieving Delegated Commissioning responsibilities for Primary Care and is working closely with the other CCGs across east Humber Coast &amp; Vale Sustainable transformation Plan to deliver its primary care commissioning responsibilities. The Primary Care Commissioning Team works closely with organisations such as NHS England, Humberside LMC, NHS Property Services and Local Authorities in the commissioning of Primary Care services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;THIS POST IS FIXED TERM FOR 23 Months &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The NHS East Riding of Yorkshire is pleased to invite applications for the post of Primary care Project Manager within the Primary Care Team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Primary Care Team is responsible for planning and commissioning safe, effective and sustainable primary care services across East Riding of Yorkshire. This is an exciting opportunity to work with multidisciplinary teams to transform good ideas into sustainable workable solutions designed to improve the quality of primary care services for our patients and citizens.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The will have a pivotal role in improving quality and the development of a thriving primary care community. The successful candidate will manage multiple projects in a constantly changing, sometimes pressured environment, and the ability to build effective working relationships will be a key requirement.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To be successful in this role, we are looking for candidates with an appropriate educational background, with a proven track record of project and change management, including the ability:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;To analyse and interpret highly complex information and financial/performance data to influence decision making processes and objective setting at an individual practice level&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To be accountable for the successful delivery at scale of any project outcomes and benefit realisation, as defined by the business cases, at each stage of development.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To work with CCG colleagues to develop and facilitate stakeholder and public engagement as appropriate to promote/disseminate information on progress and outcomes.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To be where necessary persuasive, diplomatic and motivational in negotiations with all parties or groups working within the various teams; break down barriers of misunderstanding by employing a high level of interpersonal &amp; communication skills and to strive for a collaborative and early resolution of any potential highly contentious matters.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To Provide robust support and supervision on an ongoing basis to those practices requiring the CCG assistance.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be at the heart of transforming services for the benefit of local people resulting in real improvements to care, whilst developing your career in the NHS. The post holder must have extensive senior practice management experience over a number of years’&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS East Riding of Yorkshire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128381"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Willerby", "postalCode": "HU10 6DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7631", "longitude": "-.453549"}}, "title": "Primary Care Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240142", "validThrough": "2020-11-08T23:59:59+0000"}