{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-11-02T14:16:17+0000", "description": "&lt;p&gt;&lt;span&gt;Due to a vacated post, an exciting opportunity has arisen for an experienced Dietitian to join the dynamic Dietetic department and Community Stroke rehabilitation team at East Sussex Healthcare Trust. The post is based at the Bexhill Irvine Unit, Holliers Hill, Bexhill On Sea&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will work as part of the Community stroke rehabilitation interdisciplinary team (CSRT) and wider stroke MDT &amp; Dietetic team. The post holder will be responsible for managing a dietetic caseload in CSRT, support service review and development. This will enable the successful candidate to develop a wide knowledge and different skills. In addition, you will play a role in improving the dietetic and CSRT services and developing new resources.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;“Oh I do like to be beside the seaside”&lt;/p&gt;\n&lt;p&gt;Do you want to live on the sunshine coast and beside beautiful countryside? Do you want to have the option of a vibrant community with lots happening on your doorstep? Would you like a career with a great work life balance? Then come join ESHT!&lt;/p&gt;\n&lt;p&gt;We are an integrated healthcare trust embarking on a new phase of innovation in developing our services following an exciting time of new investment into the department. We are supported by strong operational and professional leadership, providing comprehensive support for your clinical and personal development. We are always striving to improve. Our community services and Conquest Hospital were rated outstanding at our recent CQC inspection with a Good rating overall.&lt;/p&gt;\n&lt;p&gt;Our team hold regular social events such as Bhangra nights, dinners, quiz nights, bring and share lunches and cake whenever possible! All this helps bond our team together, promoting trust between team members and looking out for one another so we can have fun inside and outside of work. We pride ourselves on being a friendly and supportive department. Our team and Trust have a keen focus on our values and behaviours, staff health and wellbeing, a supportive learning and quality improvement environment and regular opportunities to work with local and national bodies.&lt;/p&gt;\n&lt;p&gt;What our staff and students say:&lt;/p&gt;\n&lt;p&gt;“You guys are the best bunch and so supportive of me I honestly can’t thank you enough!!”&lt;/p&gt;\n&lt;p&gt;“I have thoroughly enjoyed placement! Everyone here have been so supportive, friendly and professional and I cannot thank you all enough.”&lt;/p&gt;\n&lt;p&gt;East Sussex is a beautiful and vibrant place to live which is steeped in history. We have stunning countryside, beaches and numerous different social activities, festivals and a fantastic music scene available offering a great work/life balance. Fancy a weekend away? It’s an easy hop to Europe and we’re close to Gatwick airport. We look forward to welcoming you to the Sunshine Coast! Give us a look on twitter and online @ESHTDietitians @ESHTPSD @ESHT_OOH @ESHTNHS @ESHTAHPs or on instagram @ESHTAHPs&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Maddy Honnor, Deputy Clinical and Operational Lead, Telephone number 07971 020 451&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Carol Widdows, Clinical and Operational Lead - 07773 483320&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bexhill Irvine Unit, Bexhill", "postalCode": "TN40 2DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8507", "longitude": ".475541"}}, "title": "Stroke Rehabilitation Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252378", "validThrough": "2020-11-16T23:59:59+0000"}