{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum pro rata inclusive"}}, "datePosted": "2020-10-28T15:46:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Critical Care Research Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 Year fixed term contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time: 37.5 hours per week (May be required to work weekends)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Are you a Paediatric/Neonatal/Cardiac Intensive Care Nurse?&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Would you like to learn more about critical care research and how it impacts on patient care, now and in the future?&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and motivated children’s nurse, with recent experience of working in critical care, to join our dynamic critical care research team at Great Ormond Street Hospital for Children NHS Foundation Trust (GOSH). This innovative team supports a range of research studies investigating new medications, devices and alternative approaches to current practice across PICU, NICU, CICU and the Children’s Acute Transport Service (CATS).&lt;/p&gt;\n&lt;p&gt;You will work as a skilled member of the team, providing a high standard of holistic, family-centred clinical care to children and their families participating in research studies. With support from the Senior Research Nurse, you will lead on the co-ordination and implementation of a number of critical care research studies, in addition to providing cover for all of the studies on the portfolio when required. You will be responsible for the recruitment of participants, facilitation of the consent process, administration of clinical interventions required by studies, observing and responding to side effects, whilst liaising with drug companies and other study sponsors to ensure the accurate collection and submission of data in line with the study protocols and research regulations.&lt;/p&gt;\n&lt;p&gt;The Critical Care Research team works closely with both the NIHR Clinical Research Facility and the Clinical Research Network: North Thames, which forms part of the National Institute of Health Research (NIHR). The NIHR aims to improve the speed, quality, and integration of clinical research, through the successful delivery of clinical trials in the NHS - this link provides excellent support from experienced research managers, coordinators and nurses. You must have effective organisational skills and be looking for a new and exciting challenge. You should demonstrate the ability to manage your own workload and to work as part of a team. The critical care research team operates in line with the nature of a 24 hour critical care environment&lt;strong&gt;&lt;em&gt;.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lauran O&#39;Neil and Holly Belfield&lt;/p&gt;\n&lt;p&gt;Senior Critical Care Research Nurse&lt;/p&gt;\n&lt;p&gt;Lauran.ONeill@gosh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Holly.Belfield@gosh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hopsital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Critical Care Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247236", "validThrough": "2020-11-08T23:59:59+0000"}