{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45000", "minValue": "45000", "unitText": "YEAR", "value": "£45,000"}}, "datePosted": "2020-10-28T12:58:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Service Manager / Clinical Service Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£45,000 plus benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North Kirklees and Wakefield&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are excited to be recruiting for the position of Service Manager / Clinical Service Manager in our North Kirklees and Wakefield service.&lt;/p&gt;\n&lt;p&gt;We’ve been treating patients with MSK disorders to keep them moving and improve their quality of life for over 30 years. We have grown to become a medium sized enterprise providing a range of community-based services to the NHS, alongside Occupational Health services to the corporate sector. We are continually evolving our proposition to patient care, and we’re building a highly skilled multi-disciplinary team where our clinical service provides care and expertise in chronic pain, rheumatology, and mental health alongside musculoskeletal therapy. Our talented clinical team make us who we are and are why we are proud of how we improve the lives of the patients.&lt;/p&gt;\n&lt;p&gt;The post requires the management and leadership of a community MSK and Pain service for the patients of North Kirklees and MSK CATS service in Wakefield.  It has been commissioned by the local CCGs to provide the highest standards of clinical care to patients utilising the service.  You will also have a responsibility to ensure the highest standards are met by our key stakeholders e.g. GP’s, patient groups, commissioners, secondary care providers.&lt;/p&gt;\n&lt;p&gt;You’ll be a people manager with a track record of delivering results in a field-based role, particularly in a healthcare/NHS related role.  You’ll be an excellent communicator and an assertive decision maker who is passionate about delivering and maintaining high standards of clinical care and service delivery.&lt;/p&gt;\n&lt;p&gt;We’re looking for you to have demonstrable experience of the ability to attract, develop and retain an engaged team.  This team will consist of administrative and clinical components and their well-being and performance will be your responsibility to not only maintain but to enhance.&lt;/p&gt;\n&lt;p&gt;You’ll have a strong commercial focus and commitment to delivering on KPIs and financial performance targets whilst maintaining the highest standards of clinical care within the service. This is a pro-active position, and you’ll need to achieve against a backdrop of a changing work environment and commercial pressures.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We would consider splitting the Service Manager role for the two services if combined with maintaining a clinical caseload within the service. For example, this could be a Service Manager across North Kirklees and Wakefield, or a Clinical Service Manager for North Kirklees &lt;span style=&quot;text-decoration: underline;&quot;&gt;and a&lt;/span&gt; Clinical Service Manager for Wakefield. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ideally you will have experience of leading and managing a team of clinical colleagues.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Connect&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Connect Health was founded in 1993 by Professor Andrew Walton, who remains as the Group Executive Director. Originally a Musculoskeletal service provider operating out of the North East of England, the business has grown to become a medium sized enterprise providing a range of Community-based services to the NHS, alongside Occupational Health services to the Corporate sector. We are continually evolving our proposition to patient care, and we’re building a highly skilled multi-disciplinary team where our clinical service provides care and expertise in chronic pain, rheumatology, and mental health alongside musculoskeletal therapy.&lt;/p&gt;\n&lt;p&gt;Within the NHS sector we deliver community services to over 10% of the population in England, commissioned by over 25 Clinical Commissioning Groups. Our growth over the last 5 years is a testament to the high quality, efficient and effective care we provide through our clinical and support colleagues. We are internationally recognised as an agent of change; driving innovation and transformation in collaboration with other NHS provider organisations that benefits our 3 stakeholders; patients, staff, and commissioners.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on offering people a great place to work that encourages an environment where people can be the best version of themselves every day. Connect Health people are energetic, passionate and believe wholeheartedly in aspiring to excellence in the way we provide care at the clinical/patient interface no matter our role in the business.&lt;/p&gt;\n&lt;p&gt;It’s been a ground breaking journey for us at Connect Health so far, and our growth continues to inspire and excite us&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of working for Connect&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•           up to 30 days’ holiday (plus public holidays)&lt;/p&gt;\n&lt;p&gt;•           option to buy additional annual leave&lt;/p&gt;\n&lt;p&gt;•           an additional day off for your birthday&lt;/p&gt;\n&lt;p&gt;•           personalised benefits package&lt;/p&gt;\n&lt;p&gt;•           online discounts portal&lt;/p&gt;\n&lt;p&gt;•           employer pension contributions&lt;/p&gt;\n&lt;p&gt;•           group life cover&lt;/p&gt;\n&lt;p&gt;•           an employee assistance programme&lt;/p&gt;\n&lt;p&gt;•           performance related pay rewards&lt;/p&gt;\n&lt;p&gt;•           reimbursement of HCPC membership fees for clinicians&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“The best thing about Connect Health? For me it’s the opportunity to develop”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;After applying via NHS Jobs, your submitted application will be imported into our Connect Health recruitment system.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;All subsequent information regarding your application will be managed through Connect Health. This means that you will not be able to track the progress of your application via NHS Jobs and we will not be able to respond to any e-mails you send to us via NHS Jobs. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;By applying for this post you are agreeing to Connect Health transferring the information contained in this application to our Connect Health recruitment system. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you are offered a job, information will also be transferred into the Connect Health Records system.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Further information about your privacy rights is available on our website.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Connect Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dewsbury", "postalCode": "WF13 1HN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6898", "longitude": "-1.63481"}}, "title": "Service Manager / Clinical Service Manager (NK13)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246668", "validThrough": "2020-11-11T23:59:59+0000"}