{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-27T13:30:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Description for Band 5 Mental Health Nurse or Occupational Therapist- Group Treatment Service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a Mental Health Nurse or Occupational Therapist, to join the Brighton and Hove Group Treatment Service for a full time permanent position.&lt;/p&gt;\n&lt;p&gt;The Brighton and Hove Group Treatment Service (GTS) is an ageless service offering a programme of accessible, safe, evidence-based group treatments using a cognitive behavioural approach, including mindfulness and self-compassion. There is a specialist later life group pathway alongside our group programme. The successful candidate will work within the multi-disciplinary team to deliver safe patient care focused on therapeutic relationships. Alongside the psycho-educational group programmes, the GTS offers a creative group pathway that provides a safe therapeutic space where service users can develop concentration, challenge social anxiety and practice new coping skills.&lt;/p&gt;\n&lt;p&gt;Currently we are running our group program using online platforms due to coronavirus (COVID-19) restrictions. However, this guidance is subject to change.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for assessing patients, to include risk assessment for suitability for acceptance onto a group treatment programme. He/she will facilitate groups, manage a clinical case load including having lead practitioner responsibility, and provide individual therapeutic support to enhance the group work. This is an excellent opportunity for a band 5 to develop skills in working within a psychological framework, and facilitating and developing groups. The GTS provides an excellent supervision package to facilitate this learning. The Brighton and Hove Group Treatment Service is based over two sites- East Brighton Community Mental Health Centre and Mill View Hospital. The post holder will be required to travel across sites, and this post is subject to include some homeworking.&lt;/p&gt;\n&lt;p&gt;This post offers a Golden Hello, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;For further information please contact&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Josie Webb&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Team Leader Brighton and Hove Group Treatment Service&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Email: josie.webb@sussexpartnership.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Tel. for East Brighton GTS 0300 304 0210&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt; For Mill View GTS 0300 304 0211 &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Mobile 07717 540474&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Brighton Community Mental Health Center, Brighton", "postalCode": "BN2 3EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8309", "longitude": "-.114138"}}, "title": "Mental Health Nurse or Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244726", "validThrough": "2020-11-10T23:59:59+0000"}