{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-05T14:46:29+0000", "description": "&lt;p&gt;The Northern Care Alliance NHS Group was created by bringing together staff and services from two NHS Trusts, Salford Royal NHS Foundation Trust and The Pennine Acute Hospitals NHS Trust. The sheer size, scale and potential of our combined service is huge. Together, we’ve a wealth of skills and resources to share and tap into and, a wide range of career paths for you to develop and explore. If you want to join a team of over 19,000 NHS experts in delivering high-quality, local care across Salford, Oldham, Bury and Rochdale and beyond – &lt;strong&gt;come and take your place with us. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salford Royal is a ground breaking Teaching Trust. The Trust has twice been rated Outstanding by the CQC and is one of the first integrated providers of hospital, community and primary care services, providing local services to the City of Salford and specialist services to Greater Manchester and beyond.&lt;/p&gt;\n&lt;p&gt;The Trust is consistently rated as one of the best places to work in the NHS and here are just a few of the reasons why:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Major teaching hospital for the Universities of Salford &amp; Manchester&lt;/li&gt;\n&lt;li&gt;the leading Major Trauma Centre for Greater Manchester&lt;/li&gt;\n&lt;li&gt;Host of the Greater Manchester Neuroscience Centre&lt;/li&gt;\n&lt;li&gt;One of only two designated Intestinal Failure Units in the UK&lt;/li&gt;\n&lt;li&gt;one of the largest Dermatology Centres in Europe&lt;/li&gt;\n&lt;li&gt;Identified as a Global Digital Examplar, a key part of the NHS Driving Digital Maturity programme.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Allied Health Professionals Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Allied Health Professional (AHP) Directorate is looking for a motivated individual to join the AHP Management Team which delivers Audiology, Dietetics, Occupational Therapy, Orthotics, Physiotherapy, Podiatry and Adult Speech and Language Therapy across acute, outpatients and community.&lt;/p&gt;\n&lt;p&gt;You must have a minimum of 12 months administrative experience within an acute, outpatient or community setting, have knowledge of 18 week targets, be proficient in IT especially Excel and Patient Centre, efficient and excellent organisational skills.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All communications to applicants will be via the email address provided on your application form and all further correspondence will be through email, therefore please ensure that you regularly check your emails after the closing date for this post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jane Steel&lt;/p&gt;\n&lt;p&gt;Senior Manager - AHP&#39;s&lt;/p&gt;\n&lt;p&gt;jane.steel@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt;0161 206 8960&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Emma Frost&lt;/p&gt;\n&lt;p&gt;07901893026&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "AHP Validator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258170", "validThrough": "2020-11-12T23:59:59+0000"}