{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-11-03T08:45:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Full &amp; Part time hours available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an enthusiastic and motivated nurse with relevant experience to join our established integrated intermediate care team. The Collaborative Care Teams have undergone developments and in the CQC report, our team is described as an outstanding example of community working.&lt;/p&gt;\n&lt;p&gt;The service receives referrals from a wide range of health and social care professionals, with the aim of supporting patients with a health related crisis at home. The goal is to avoid an acute hospital admission and/or support early discharge. We also provide support to patients who require out of hours district nursing and provide input to people accessing intermediate care beds in the community.&lt;/p&gt;\n&lt;p&gt;In addition, the Collaborative Care Teams provide support to patients within their own homes that require IV therapy, this includes clinical assessment of patients, management and escalation of unwell patients, patient centred care planning, administration of IV medication, peripheral cannulation and on-going care of cannulas, venepuncture and management of Central Venous Access Devices.&lt;/p&gt;\n&lt;p&gt;Our team is passionate about our service and take real pride in putting our patients at the heart of all we do, this is reflected in our collaborative approach to teamwork. The Collaborative Care Teams include registered nurses, physiotherapists, occuputional therapists, mental health nurses, community advanced practitioners and community support workers. To support our multi-disciplinary approach we actively support skill sharing with all staff working within a Competency Based Framework.&lt;/p&gt;\n&lt;p&gt;We offer a robust induction programme, on the job training, annual appraisal, 1:1 supervision and opportunities for development. We encourage applicants to contact us if they are interested in this post so you can see first-hand how the team functions and learn about this fantastic opportunity.&lt;/p&gt;\n&lt;p&gt;This is a 24 hour a day 7 days a week service operating 365 days a year therefore the post holder will be expected to work shift patterns to cover the service including Early, Lates, Long Days, Nights or a combination of both and have access to own transport.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name.Additional contact information&lt;/p&gt;\n&lt;p&gt;Cheryl Way, Acting Team Leader, 01756 793206&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Airedale NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120636"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Airedale General Hospital, Keighley", "postalCode": "BD20 6TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.898", "longitude": "-1.9627"}}, "title": "CCCT Community Staff Nurse (Band 5)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253174", "validThrough": "2020-11-16T23:59:59+0000"}