{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-30T10:30:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a dedicated Consultant Paediatrician with a special interest in Emergency Medicine?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work for a Trust who has set a clear strategy to further develop their existing paediatric services? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Come and join Team NNUH’s Children’s Emergency Department and Children’s Assessment Unit…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Jenny Lind Children’s Hospital (JLCH) within Norfolk and Norwich University Hospital (NNUH) is creating two new posts for consultants interested in acute paediatric presentations.&lt;/p&gt;\n&lt;p&gt;It is an incredibly exciting time for our JLCH team as we work towards establishing a single paediatric front door; with co-located departments, we aim for an integrated workforce and streamlined patient pathways.&lt;/p&gt;\n&lt;p&gt;The two new posts will be a unique collaboration between the &lt;strong&gt;Children’s Emergency Department (ChED)&lt;/strong&gt; and the &lt;strong&gt;Children’s Assessment Unit (CAU)&lt;/strong&gt; and are suitable for paediatricians with PEM competencies and qualifications or for those who would like to develop them in post.&lt;/p&gt;\n&lt;p&gt;Our division has undergone a radical period of development and growth and we are looking for talented individuals to join our team of 20 acute medical consultants. You will have acute paediatric sessions in both the CAU and ChED between 0830 and 2200 hours with weekday shifts 08:30-16:30 or 14:00-22:00 and weekends from 1400-2100. There is a maximum commitment to 1:8 weekends in total (CAU and ChED sessions combined).&lt;/p&gt;\n&lt;p&gt;The JLCH maintains a unique identity within the NNUH and our team are constantly striving to introduce new and improved operational processes to further develop our hospital and improve the care of our patients. CAU is based on Coltishall ward and has a large ambulatory area and 4 high-dependency beds, with plans to increase to 8 beds and locate in accordance to PICS standards. ChED is located in a purpose built unit in close proximity to the adult ED. It also comprises of an ambulatory (chair centric) minors bay accommodating 4 patients, a 6 ‘bedded’ majors/illness bay, two isolation rooms, an extended care bay (suitable for higher acuity cases) and a quiet room (anti-ligature). Resuscitation facilities are provided in main ED, with a dedicated Paediatric resuscitation bay. &lt;strong&gt;The Emergency Department is extremely busy and has over 140,000 attendances per year with around 25,000 paediatric attendances.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A career in Paediatric Emergency Medicine at our Trust offers you the chance to be part of a progressive team who have a shared passion for providing the best possible care to children and their parents when they need it most. If you want to work in a dynamic environment, provide support and training to our multi-disciplinary team and be encouraged to develop your special interests whilst earning an attractive salary and living in a beautiful county then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Name&lt;/strong&gt;: Mary-Anne Morris&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job title&lt;/strong&gt;: Paediatric Consultant&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email address&lt;/strong&gt;: mary-anne.morris@nnuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk &amp; Norwich University Hospital Trust, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Consultant in Acute Paediatric Medicine/Paediatric Emergency Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249738", "validThrough": "2020-11-30T23:59:59+0000"}