{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33098", "minValue": "17885", "unitText": "YEAR", "value": "£10.64 - £19.69"}}, "datePosted": "2020-11-04T16:37:37+0000", "description": "&lt;p&gt;Portsmouth University Hospitals NHS Trust is the largest non-teaching hospital trust in England. With strong local ties and serving around 675,000 residents in Portsmouth and South East Hampshire, they pride themselves on providing comprehensive acute and specialist services.&lt;/p&gt;\n&lt;p&gt;There are now opportunites for pro-active people to join the bank in order to to provide support to deliver the supply of pharmaceuticals to Portsmouth Hospitals NHS Trust (PHT) and carry out the receipt and distribution of wholesaling activities from the Regional Drug Purchasing Centre (RDPC) to external customers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Duties:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assisting in the receipt of pharmacy stock and checking against delivery notes or copy orders, highlighting discrepancies to the warehouse manager or office team.&lt;/li&gt;\n&lt;li&gt;Ensuring that stock is stored with due regard to storage requirements and stock rotation.&lt;/li&gt;\n&lt;li&gt;Creating picking lists for stock from orders generated by wards and departments served by PHT using computerised options including a bar code reader or keyboard data entry.&lt;/li&gt;\n&lt;li&gt;Picking and checking the issue of pharmaceutical products against picking lists.&lt;/li&gt;\n&lt;li&gt;Packing parcels in accordance with the demands of the delivery schedule, paying particular attention to the special handling and storage requirements of the products.&lt;/li&gt;\n&lt;li&gt;Checking stock against stock take reports to ensure that discrepancies, short dated stock or expired stock are identified and reported to the warehouse manager so that appropriate action can be taken.&lt;/li&gt;\n&lt;li&gt;Unloading delivery vehicles ensuring safe storage within the warehouse prior to receipt taking care to ensure the delivery is for RDPC and matches the driver’s drop sheet.&lt;/li&gt;\n&lt;li&gt;Loading courier vehicles, PHT transport and RDPC Van with outgoing deliveries taking care to ensure the load is appropriately positioned within the vehicle for the delivery schedule and that appropriate paperwork is accurately completed.&lt;/li&gt;\n&lt;li&gt;Disposing of waste packaging materials, clinical waste and confidential waste in accordance with the Trust’s waste management policy.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Essential Requriements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Good education standard e.g. GCSE’s in English and Mathematics or equivalent&lt;/li&gt;\n&lt;li&gt;Willingness to undertake in-house and Trust training essential for the post&lt;/li&gt;\n&lt;li&gt;Manual Handling skills – weights of up to 25kg regularly moved manually, greater weights by means of electrical or mechanical equipment - training provided&lt;/li&gt;\n&lt;li&gt;Ability to work using own initiative and without supervision&lt;/li&gt;\n&lt;li&gt;Good communication skills&lt;/li&gt;\n&lt;li&gt;Computer skills&lt;/li&gt;\n&lt;li&gt;Able to maintain high concentration for long periods&lt;/li&gt;\n&lt;li&gt;Safety/security awareness&lt;/li&gt;\n&lt;li&gt;Available for an immediate start&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Previous experience in a similar role&lt;/li&gt;\n&lt;li&gt;Experience of stock control/handling&lt;/li&gt;\n&lt;li&gt;Fork lift driving licence – training provided&lt;/li&gt;\n&lt;li&gt;Full clean UK driving licence&lt;/li&gt;\n&lt;li&gt;Previous experience working with pharmaceuticals&lt;/li&gt;\n&lt;li&gt;Customer care skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The warehouse is located in Segensworth therefore due to the shift times own transport is essential in this role.&lt;/p&gt;\n&lt;p&gt;Our Bank workers are invaluable to us and in return of your hard work and commitment we can offer the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive pay rates – enhanced payrates paid during the weekend and Bank Holidays&lt;/li&gt;\n&lt;li&gt;Flexible working pattern&lt;/li&gt;\n&lt;li&gt;Opportunities to work across sites, gaining invaluable knowledge and experience&lt;/li&gt;\n&lt;li&gt;Priority placements over an Agency Workers&lt;/li&gt;\n&lt;li&gt;A dedicated onsite bookings team&lt;/li&gt;\n&lt;li&gt;Electronic timesheet submission and weekly pay&lt;/li&gt;\n&lt;li&gt;An onsite office and designated Business Partners to offer daily support&lt;/li&gt;\n&lt;li&gt;A professional compliance team that will ensure you remain compliant to work&lt;/li&gt;\n&lt;li&gt;We also offer Core Skills Training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please apply directly to this advertisement, ensuring you upload a full and up to date CV. Successful applicants will be contacted shortly. If you require further information then please contact the Portsmouth Staff Bank Recruitment Team on 0333 577 3316.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135154.jpg", "name": "Portsmouth Hospitals NHS Trust Staff Bank", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fareham", "postalCode": "PO15 5AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8615", "longitude": "-1.24412"}}, "title": "Temporary Pharmacy Warehouse Operative Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256672", "validThrough": "2020-11-20T23:59:59+0000"}