{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 per annum"}}, "datePosted": "2020-10-13T11:31:54+0100", "description": "&lt;p&gt;Applications are invited for the post of Consultant Urological Surgeon with a special interest in pelvic oncology to be based at Mid and South Essex Trust (MSE). This is a permanent post based at Southend hospital.&lt;br /&gt;&lt;br /&gt;We are looking to appoint a dynamic and enthusiastic Locum Consultant in Urology to join a team of 8 Urological Surgeons. at Southend hospital&lt;br /&gt;&lt;br /&gt;Southend Hospital successfully bid for the Urology Specialist Cancer Centre in 2016, meaning that the Trust will provide specialised surgery for patients across Essex with prostate, bladder and kidney cancer.&lt;/p&gt;\n&lt;p&gt;The three urology departments across MSE (Southend, Basildon and Mid Essex Hospitals)have been working collaboratively for the last year and now have established cross-site operating lists, shared governance and MDT meetings. MSE have access to two Da Vinci X robots.&lt;/p&gt;\n&lt;p&gt;Centralising this specialist urological cancer surgery brings together clinical experts to share experience and further develop the service for the benefit of our patients. The specialist surgeons and nurse specialists are supported by a network of clinical and administrative staff, both at Southend and across Essex, providing multi-disciplinary care and guiding patients through their complex pathways.&lt;br /&gt;&lt;br /&gt;Joining this expanding team will provide invaluable experience within the field of complex urological cancers in addition to offering high quality multi-disciplinary team working. &lt;br /&gt;&lt;br /&gt;The Urology department has a specialist 30 bedded ward, a dedicated Urology Outpatient department / theatre teams and holds regular outreach clinics. &lt;br /&gt;&lt;br /&gt;The Trust has excellent Postgraduate Medical Centre facilities which carries a full programme of events and offers access to a Medical Library.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Peter Pietrzak - Clinical Lead&lt;br /&gt;Mr Peter Acher - Clinical Lead&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend on Sea", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Consultant Urologist with a special interest in pelvic oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224060", "validThrough": "2020-11-13T23:59:59+0000"}