{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 to £87,754 pa"}}, "datePosted": "2020-10-28T13:15:18+0000", "description": "&lt;p&gt;A unique opportunity has arisen in our Consultancy Team at North of England CSU (NECS) to help play a pivotal role in working across the UK to support health and social care customers in meeting strategic and operational challenges, to improve outcomes and increase efficiency. This role is Midlands based and office locations could include Birmingham, Northampton, and Leicester.&lt;/p&gt;\n&lt;p&gt;The Consultancy Team of over 100 staff offers bespoke consulting services to the public sector including NHS and local authorities across the country utilising the skills and expertise of NECS. We work with executive teams across the health economy to help them achieve their goals, to create real sustainable change and fundamentally improve services to transform people’s lives.&lt;/p&gt;\n&lt;p&gt;The Consultancy Team specialise in 7 key areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;System Wide Integration&lt;/li&gt;\n&lt;li&gt;Strategy and Policy&lt;/li&gt;\n&lt;li&gt;Digital Transformation&lt;/li&gt;\n&lt;li&gt;Analytics&lt;/li&gt;\n&lt;li&gt;Project Management&lt;/li&gt;\n&lt;li&gt;Rapid Response to Urgent Support&lt;/li&gt;\n&lt;li&gt;Urgent Care and Health &amp; Justice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for candidates from a diverse range of backgrounds that can evidence our roles specific responsibilities in your supporting statement. Experience in consultancy within a healthcare setting is desirable but not essential.&lt;/p&gt;\n&lt;p&gt;We aim to be an equal opportunities employer and we are determined to ensure that no applicant or employee receives less favourable treatment on the grounds of gender, age, disability, religion, belief, sexual orientation, marital status, or race. We encourage applications from diverse backgrounds.&lt;/p&gt;\n&lt;p&gt;This role is Midlands based and office locations could include Birmingham, Northampton, and Leicester.&lt;/p&gt;\n&lt;p&gt;Closing date for applications is Wednesday 11 November 2020&lt;/p&gt;\n&lt;p&gt;For further information about this role please contact Rachel Helmn, Senior Regional Lead - r.helmn@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North of England Commissioning Support", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B16 9RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4723", "longitude": "-1.93413"}}, "title": "Manager - Consultancy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246721", "validThrough": "2020-11-11T23:59:59+0000"}