{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-21T15:15:57+0100", "description": "&lt;p&gt;2 x posts - Senior Planning Manager&lt;/p&gt;\n&lt;p&gt;Leicester City, West Leicestershire and East Leicestershire and Rutland Clinical Commissioning Groups (CCGs) are employers in their own right that commission health care in Leicester City, Leicestershire and Rutland. Please note if you are successful in your application the CCG which has placed the advertisement will be your employer.&lt;/p&gt;\n&lt;p&gt;Further information on the CCGs can be found by visiting their individual websites:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS East Leicestershire and Rutland CCG&lt;/li&gt;\n&lt;li&gt;NHS Leicester City CCG&lt;/li&gt;\n&lt;li&gt;NHS West Leicestershire CCG&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Leicester City, West Leicestershire, and East Leicestershire and Rutland CCGs commission and provide health and care services for over a million people in Leicester, Leicestershire and Rutland (LLR) and have a combined budget of c. £1.5 billion. The population and budget broadly divide equally between the three CCGs. The combined total of Primary Care Networks is 25. The CCGs are accountable for all strategic commissioning and contract management arrangements for the provider contracts. The three LLR CCGs work collaboratively with the local authorities in addition to the borough/district councils in Leicestershire.&lt;/p&gt;\n&lt;p&gt;An exciting position has arisen as a Senior Planning Manager in the newly formed LLR Strategy and Planning Directorate. This is a newly formed directorate with a mandate to collaborate with partners across LLR to define the system strategic priorities. This will include developing plans at System, Place and Neighbourhood to deliver improvement in health outcomes, reducing health inequalities and responding to growth.&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the Directorate to identify opportunities for improved health outcomes and improved performance across the LLR system and work with system partners develop strategy and plans at a system, place and neighbourhood level&lt;/li&gt;\n&lt;li&gt;Co-ordinate and develop system-wide long term plans and annual operational plans which align to wider transformation plans and ICS delivery for the LLR system&lt;/li&gt;\n&lt;li&gt;Co-ordinate and develop place based plans in partnership with local authorities and other key stakeholders in order to reduce health inequalities and unwarranted variations&lt;/li&gt;\n&lt;li&gt;Through effective planning and PMO functions ensure that CCG resources are deployed efficiently and effectively in order that the CCGs has strong financial control over allocated budgets, and is able to commission the most effective services for the LLR Population.&lt;/li&gt;\n&lt;li&gt;Support production of the system-wide annual Operational Plan so that there are clear actions and milestones, that the plans are fit for purpose and comply with the requirements of the Governing Bodies and NHS England, including ensuring local and national deadlines for the production of plans and submission of information are met&lt;/li&gt;\n&lt;li&gt;Taking a lead role in developing and contributing to Place Based and District / Neighbourhood Level Plans with local and district / neighbourhood authorities / partners&lt;/li&gt;\n&lt;li&gt;Collaborating with local authorities to agree priority areas for joint and mutual working and then develop and implement joint plans to address these. This may include actions that impact on the wider determinants of health; sustainability and the development of the public sector as anchor institutions.&lt;/li&gt;\n&lt;li&gt;Ensuring plans deliver high quality, efficient health and care outcomes that reduce health inequalities, deliver value for money and support the wider organisation to embed innovative commissioning practice.&lt;/li&gt;\n&lt;li&gt;Working in partnership across all Directorates of the CCGs and across the system to provide support and effective translation of strategic plans into delivery through contracts across all providers, both NHS and non NHS.&lt;/li&gt;\n&lt;li&gt;Identifying and maximising opportunities created by integrated and collaborative working across the whole health care system including service integration, its delivery and outcomes for patients and the general public&lt;/li&gt;\n&lt;li&gt;Supporting the Head of Strategy and Planning to ensure plans are sufficiently ambitious and comprehensive in scale and scope to achieve stated objectives and are fully supported by robust implementation plans including overarching monitoring arrangement&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Desirable candidates will have previous experience in developing strategic plans with partner organisations, stakeholders and the public. Knowledge of the strategic developments expected of the NHS and Local Integrated System partners is essential as is a desire and ability to be a leader in this work across LLR.&lt;/p&gt;\n&lt;p&gt;The closing date for applications is November 6th 2020. Interviews will be held during mid–late November.&lt;/p&gt;\n&lt;p&gt;We would be delighted to have informal discussions with potential applicants wishing to know more about the role. Those wishing to discuss the requirements of the post should contact kanta.patel@leicestercityccg.nhs.uk (Executive Assistant, Strategy &amp; Planning Directorate, LLR CCG) to arrange a call with one of the senior team&lt;/p&gt;\n&lt;p&gt;LLR CCG staff are predominantly working from home, we anticipate this will continue for at least the coming months and potentially be an ongoing arrangement.&lt;br /&gt;Applicants are encouraged to note this when considering their application in relation to their current geographical location.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicester City, Leicestershire and Rutland CCG’s", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128398"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St John&#39;s House, Leicester", "postalCode": "LE1 6NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6316", "longitude": "-1.1271"}}, "title": "Senior Planning Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237039", "validThrough": "2020-11-06T23:59:59+0000"}