{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 pa pro rata"}}, "datePosted": "2020-11-05T17:15:59+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Paediatric Doctor to join our dynamic team at the Royal Bolton Hospital to help further develop our Acute Paediatric services.&lt;/p&gt;\n&lt;p&gt;The successful applicant would work at Middle Grade (Tier 2) level including contributing to the Middle Grade out-of-hours rota. This rota is currently a full-shift 8-person rota.&lt;/p&gt;\n&lt;p&gt;There is excellent scope to develop and consolidate paediatric skills.&lt;/p&gt;\n&lt;p&gt;The Royal Bolton Hospital is a busy acute hospital with an excellent reputation for teaching and senior support. We have a new purpose-built Paediatric inpatient unit with 28 beds, Paediatric HDU, daycase bay and short stay paediatric assessment unit as well as the Children&#39;s Outpatient Department at Bolton ONE.&lt;/p&gt;\n&lt;p&gt;Bolton NHS Foundation Trust provide services across the north west side of the Greater Manchester area ranging from hospital services in Bolton to community services across Bolton and Salford. We are a progressive, expanding organisation with great ambition around improving quality, integrating pathways and delivering high levels of productivity. We have recently been given a CQC rating of Good, achieving Outstanding for the Well Led catagory. Over 5,700 people work for the Trust and many of them have been here a long time. People find they don’t need to go elsewhere to find a fulfilling career in healthcare.&lt;/p&gt;\n&lt;p&gt;The Family Division aims to deliver the highest standards of care for maternity, sexual health, gynaecology and a range of acute and community children’s services. The Division is a Centre of Excellence for Women’s and Children’s services and has a credible and enviable reputation. We deliver over 6,000 babies and carry around 1500 gynaecological procedures each year, making us a specialist provider of health services for women, babies and their families in the North West Sector of Manchester and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&#39;This role may be suitable for non-UK or non-EEA job applicants wishing to apply for Home Office Tier 2 sponsorship&#39;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that, the Trust is a smoke free site, and therefore smoking will not be permitted anywhere within the grounds of the Trust.&lt;/p&gt;\n&lt;p&gt;This Trust is committed to safeguarding children, young people and vulnerable adults and requires all staff and volunteers to share this commitment.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be subject to appropriate disclosure by the Criminal Records Bureau.&lt;/p&gt;\n&lt;p&gt;The vision of this Trust is to be recognised by the people of Bolton and beyond as an excellent provider of health and care services and a great place to work. We are striving to attract, recruit and retain high calibre skilled staff which reflect our communities. We are an inclusive employer who trains and develops our staff in a positive learning environment. We aim to be consciously inclusive and therefore applications from all sectors of the community are welcomed. We would particularly encourage candidates from a black and minority ethnic (BAME) background and candidates with health conditions or impairments.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;From time to time we may need to close a vacancy early when in receipt of a sufficient number of applications. If you are interested in this post and wish to be considered, we strongly advise you to complete and submit your application as soon as possible. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jo Morgan- Consultant Paediatrician - Paediatric Clinical Lead&lt;/p&gt;\n&lt;p&gt;Email address jo.morgan@boltonft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01204 390551&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Laura Anton, Operational Business Manager, laura.anton@boltonft.nhs.uk, 01204 390279&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121713.png", "name": "Bolton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121713"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bolton NHS Foundation Trust, Bolton", "postalCode": "BL4 0JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.554", "longitude": "-2.42989"}}, "title": "Specialty Doctor - Acute Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258686", "validThrough": "2020-11-19T23:59:59+0000"}