{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa plus HCAS"}}, "datePosted": "2020-10-23T10:32:11+0100", "description": "&lt;p&gt;Do you want to be part of developing and shaping new community services in Ealing? Are you looking for a career as a Community Nurse?&lt;/p&gt;\n&lt;p&gt;If the answer is yes then come and join us in Ealing Community Partners!&lt;/p&gt;\n&lt;p&gt;Community-based health care in Ealing is about to undergo a transformation. West London NHS Trust, in partnership with Central and North West London NHS Trust, (CNWL) the Hillingdon Hospitals NHS Trust and some other smaller providers, including third sector, have formed a partnership to provide integrated community health services in Ealing. The total value of the new 10 year contract is about £50m per year.&lt;/p&gt;\n&lt;p&gt;West London NHS Trust is delighted to have been awarded the contract to provide community services in Ealing over the next 10 years. We have formed a partnership (Ealing Community Partners) with Central and North West London NHS Trust (CNWL), The Hillingdon Hospital NHS Trust and a number of other partners to provide community services throughout Ealing&lt;strong&gt;. &lt;/strong&gt;We have an ambitious vision for integrated health &amp; social care services across Ealing and will strive to deliver high standards of care with the aim of improving access to services and the quality of life for all of our patients.&lt;/p&gt;\n&lt;p&gt;Our staff are central to delivering the service vision and we are keen to recruit high calibre staff who will be offered the support required to fulfil their roles as well as being provided with the training and experience to further their skills and build a career of which they can be proud.&lt;/p&gt;\n&lt;p&gt;We are looking for dedicated, enthusiastic nurses who are highly motivated and caring professionals, who can provide the best possible care to our new service users. We welcome applications from newly qualified staff, to who we can offer an excellent preceptorship package as well as more experienced nurses for whom we are committed to develop in their careers. Opportunities of further study include District Nursing, Advanced Practice and Non-Medical Prescribing as well as the award winning BME leadership programme, encouraging you to become our aspiring future leaders.&lt;/p&gt;\n&lt;p&gt;Are you an excellent communicator who is adaptable, committed and well organised working well under pressure. Do you have the ability to work autonomously whilst being part of a team with an integrated approach to care, with well-developed clinical skills or have a commitment to develop these skills.&lt;/p&gt;\n&lt;p&gt;As a community nurse you will be required to travel between patients’ homes. It is preferable that you have access to a car and a full UK Driving License.&lt;/p&gt;\n&lt;p&gt;Make that move to change your career direction and join us in Ealing Community Partners.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Mission &lt;/strong&gt;“Promoting hope and wellbeing, together”&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Vision &lt;/strong&gt;Our vision is to be an outstanding healthcare provider, committed to improving quality, and caring with compassion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Values &lt;/strong&gt;As a member of West London, you can expect to be a respected member of staff at all times. We work to a set of Trust Values and uphold these in all of our interactions. Our Values are like our moral compass, reminding us of the things that matter most when we are caring for people in need. Our Trust Values are:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Togetherness &lt;/strong&gt;&lt;strong&gt; Responsibility Excellence Caring&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rewards&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer an extensive reward package to our staff alongside an exciting and fulfilling career with our Trust. Some of the benefits you can enjoy when you join our team are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive relocation package meaning you can claim up to £8k in expenses when moving over 40 miles to join the Trust.&lt;/li&gt;\n&lt;li&gt;Up to 33 days annual leave as well as the opportunity to buy even more days or sell some leave days that you don’t need.&lt;/li&gt;\n&lt;li&gt;As a member of staff you will be able to request up to six shifts off work per rota&lt;/li&gt;\n&lt;li&gt;Support towards career development and promotion opportunities within the Trust.&lt;/li&gt;\n&lt;li&gt;A supportive environment to develop clinical skills.&lt;/li&gt;\n&lt;li&gt;Access to a comprehensive online library of training, development, and resources.&lt;/li&gt;\n&lt;li&gt;Discounted gym membership – from £10 per month at our on-site gym! (St Bernard’s site)&lt;/li&gt;\n&lt;li&gt;Staff discounts at high street retailers.&lt;/li&gt;\n&lt;li&gt;Paid DBS application upon offer.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;We welcome enquiries about this role before or during your application process. If you would like to know more about this opportunity and working at West London NHS Trust, please contact:&lt;/p&gt;\n&lt;p&gt;Peter Wilde, Intermediate care &amp; community hospital: peter.wilde@nhs.net&lt;/p&gt;\n&lt;p&gt;Rosemary Gifford: rosemary.gifford@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you wish to have a discussion about other career opportunities within Ealing Community Partners email:&lt;/p&gt;\n&lt;p&gt;Susan McCabe, Head of Community Services; susan.mccabe7@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "14759 Out of Hospital Mobilisation, Ealing", "postalCode": "UB2 4SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5053", "longitude": "-.357689"}}, "title": "District Nurse/Senior Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240074", "validThrough": "2020-11-06T23:59:59+0000"}