{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T12:31:28+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Criminal Justice Liaison and Diversion Practitioner&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having a ‘Outstanding’ rating overall, having being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Community Mental Health Team in our latest CQC inspection, which found that: ‘There was a clear vision, underpinned by a set of values that were well understood by staff across the trust.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You are an experienced nurse, therapist or health visitor, with a degree level or equivalent qualification in mental health nursing, occupational therapy, speech and language therapy, social work or psychological therapy, and have a keen interest in criminal justice and offender health. With excellent communication and people skills, you will be emotionally resilient, confident discussing complex and sensitive information in a clear and empathetic manner, and adept at solving problems through creative engagement. An inspirational and highly-motivated member of our team, you will be eager to assist in the continual improvement of our work and collaborate to ensure we deliver a seamless service, collaborating with multiple agencies. Working with a complex and diverse range of clients with varying needs, you will be astute at assessing risk and committed to client safety. Working flexibly and autonomously, you will be comfortable adapting to changing situations, and travelling across multiple and varied locations. Your energy and drive will be rewarded with the support of a dedicated team that strives to create a progressive, responsive and respectful environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call Victoria Butterfield on 07827272053 or email: Victoria.Butterfield@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to a car salary sacrifice scheme (available to all permanent staff over the age of 21), and as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Golden hello!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role attracts a recruitment and retention package of £3,000, which is paid in £1,500 instalments. The successful candidate will receive their first instalment when they have successfully completed the probationary period at the start of the next financial year, and the second instalment the following year, with the caveat that they are committed to our service for three years.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 8NQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4634", "longitude": "-.98216"}}, "title": "Criminal Justice Liaison and Diversion Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250177", "validThrough": "2020-11-11T23:59:59+0000"}