{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa, pr"}}, "datePosted": "2020-11-04T09:00:15+0000", "description": "&lt;p&gt;&lt;strong&gt;#BeKnown&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;By us. By our patients. By our community.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff nurse – band 5 – medical and surgical wards&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our patients are at the heart of everything we do. We’re dedicated to delivering the best quality and safest care to our local communities and need dedicated and skilled people to help us achieve this.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to develop your nursing career and make a real difference to the lives of those who use our services.&lt;/p&gt;\n&lt;p&gt;We’re keen to employ staff nurses (both full and part-time roles are available), across a variety of medical and surgical wards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please add your ward preference to the ‘additional information’ section of your application form.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;What will you #BeKnown for?&lt;/p&gt;\n&lt;p&gt;We want to tell your story. We want to help develop your career. The opportunities are endless.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you can expect from us?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A supportive, friendly team that delivers outstanding care&lt;/li&gt;\n&lt;li&gt;A rewarding role in a busy, fast-paced team environment where you will be expected to think on your feet and use your initiative to deal with a variety of challenges&lt;/li&gt;\n&lt;li&gt;A comprehensive induction programme&lt;/li&gt;\n&lt;li&gt;Career progression and ongoing professional development&lt;/li&gt;\n&lt;li&gt;A minimum of 27 days annual leave per year plus bank holidays (pro rata for part-time staff)&lt;/li&gt;\n&lt;li&gt;The opportunity to join the NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;Access to a range of employee benefits including, staff discounts, salary sacrifice schemes, discounted staff restaurant.&lt;/li&gt;\n&lt;li&gt;Quality of life and super location in Suffolk.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we ask of you&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Compassion and empathy in your approach to caring for others&lt;/li&gt;\n&lt;li&gt;Treat our patients with the dignity and respect they have a right to expect&lt;/li&gt;\n&lt;li&gt;Make a positive difference to our patients’ experience&lt;/li&gt;\n&lt;li&gt;Solid communication and listening skills&lt;/li&gt;\n&lt;li&gt;A team player with the ability to work within a diverse multidisciplinary team&lt;/li&gt;\n&lt;li&gt;A problem solver with ability to plan, implement and evaluate individual patient care&lt;/li&gt;\n&lt;li&gt;Ability to supervise and deploy staff and ensure high standards of care are adhered to&lt;/li&gt;\n&lt;li&gt;Ability to work calmly in a demanding and busy environment&lt;/li&gt;\n&lt;li&gt;Able to commit to a flexible shift pattern.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;A little something extra&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Relocation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re making a big move and relocating to join us we promise you won’t be disappointed. We provide a relocation package of up to £2,000 to those appointed to band 6 roles and above, and band 5 staff nurses.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Overseas&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt; &lt;/strong&gt;If you’re an overseas applicant and need to complete the IELTS/OET exam to be able to register with the Nursing Midwifery Council, the Trust will fund one attempt at the exam. If required the Trust will fund the cost of one additional IELT / OET from Level 6.5 to Level 7 / OET grade C+ to grade B.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Accommodation&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt; &lt;/strong&gt;We have three new purpose-built accommodation blocks nestled in the woodland at the back of the West Suffolk Hospital. There are 160 quality furnished en-suite single occupancy bedrooms with modern communal living areas available to rent for all staff at competitive rates.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join us – what will you #Beknown for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion or to arrange a visit to the hospital, please contact Danielle Offord, nursing assistant workforce lead, on 01284 712792 or via email atdanielle.offord@wsh.nhs.uk.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional information&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt; &lt;/strong&gt;&lt;br /&gt; &lt;strong&gt;Tips for completing your application&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt; &lt;/strong&gt;To view the job description and person specification for this position, please click on the link to the right. Use the additional information section of your application to state how you meet the requirements of the person specification.&lt;/p&gt;\n&lt;p&gt;You can download top tips for completing your application in the ‘additional documentation’ section also to the right.&lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled ‘How will my application be processed?’ prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt; &lt;/strong&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Car parking&lt;/strong&gt;&lt;br /&gt; This post&lt;strong&gt;does&lt;/strong&gt;entitle you to apply to park on the West Suffolk Hospital site.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Removal and Accommodation Expenses policy&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt; &lt;/strong&gt;Please refer to our ‘Removal and Accommodations Expenses’ policy in the ‘additional documentation’ section to the right.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Correspondence via NHS Jobs email&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt; &lt;/strong&gt;All correspondence relating to this vacancy, including invitations to interview will be by email only, via NHS Jobs. Please ensure you check your emails on a regular basis.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form&lt;/strong&gt;, you authorise the Trust to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt; &lt;/strong&gt;The successful candidate for this post will be required to apply for a Disclosure and Barring Service (DBS) Disclosure at &lt;strong&gt;enhanced &lt;/strong&gt;level.&lt;/p&gt;\n&lt;p&gt;For posts at band 3 and above, the cost of the DBS will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Staff Nurse - Band 5 - Medical or Surgical wards", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255125", "validThrough": "2020-12-03T23:59:59+0000"}