{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T14:01:53+0000", "description": "&lt;p&gt;This advert is for &lt;strong&gt;University student Nurses&lt;/strong&gt; due to qualify in February 2021. If you are short-listed for this role you will be invited to attend a Recruitment Centre.&lt;/p&gt;\n&lt;p&gt;The Recruitment process is as follows:&lt;br /&gt;&lt;br /&gt;1st Stage&lt;br /&gt;&lt;br /&gt;Situational Judgement Test. &lt;br /&gt;&lt;br /&gt;University Hospitals Coventry and Warwickshire NHS Trust is one of the UK’s leading specialist teaching hospitals, we provide world class healthcare to a population of over 1,000,000. Located on two sites University Hospitals in Coventry and the Hospital of St Cross in Rugby, we offer major advances in patient care, clinical teaching and innovation. We&#39;re exceeding the national waiting times targets for our patients we have low incidence of healthcare associated infections such as MRSA and C. difficile.&lt;br /&gt;&lt;br /&gt;Our mission to Care, Achieve and Innovate……..&lt;br /&gt;&lt;br /&gt;CAREOur focus is on providing and improving quality of patient care&lt;br /&gt;&lt;br /&gt;ACHIEVEOur maternity services are rated as one of the best in the NHS&lt;br /&gt;&lt;br /&gt;INNOVATEThe first hospital to offer hip preserving surgery&lt;br /&gt;&lt;br /&gt;Nursing at University Hospitals Coventry and Warwickshire NHS Trust has developed strong links to Coventry University and our purpose built Clinical Sciences Building offers a whole range of facilities to aid your education and training including a modern library with excellent IT facilities.&lt;br /&gt;&lt;br /&gt;The Trust offers a range of specialties including:-&lt;br /&gt;&lt;br /&gt;Medical&lt;br /&gt;Surgical&lt;br /&gt;Trauma and Orthopedics&lt;br /&gt;Emergency care&lt;br /&gt;Neurosciences&lt;br /&gt;Respiratory Medicine&lt;br /&gt;Cardiology&lt;br /&gt;Cardiothoracic&lt;br /&gt;Oncology&lt;br /&gt;Haematology&lt;br /&gt;Renal Services&lt;br /&gt;Critical Care&lt;br /&gt;Care of the Elderly&lt;br /&gt;Gynaecology&lt;br /&gt;Theatre (both sites)&lt;br /&gt;Hospital of St Cross (elective orthopeadic surgery, medical and rehabilitation)&lt;br /&gt;We are currently offering a Trust Rotational Programme for Newly Qualified Nurses&lt;br /&gt;&lt;br /&gt;1. Trust Rotation Package - will involve rotating across any 2/3 specialties to enable individuals to explore the nursing roles in contrasting areas and enable them to decide which nursing pathway they wish to professional develop within. For example a medical ward and a surgical ward.&lt;br /&gt;&lt;br /&gt;2. Specialty Rotation Package – 2 -3 wards within one speciality for example Care of the Elderly and Neurosciences.&lt;br /&gt;&lt;br /&gt;It would assist us greatly if you could indicate on your application form your preference for the any of the specialties/rotations indicated above. This will enable us to match your form against any vacancies that are currently available. It would also help if you could indicate whether or not you are seeking full or part time hours.&lt;/p&gt;\n&lt;p&gt;Please Note - Upon submission and completion of your academic coursework you will be eligible to submit an application for your Nursing &amp; Midwifery (NMC) pin number. Following this, you will be able to commence with us in the capacity of a Band 4 pre-registration nurse, until you are in receipt of your pin, at such time you will then progress to a Band 5 Nurse. To assist you with your application, the Pre-Registration job description is attached to this vacancy on the right side of this page&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Coventry, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Newly Qualified Nurse Practitioners", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252330", "validThrough": "2020-11-16T23:59:59+0000"}