{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33568", "minValue": "27567", "unitText": "YEAR", "value": "£27567 - £33568.73 + OLW £1,961"}}, "datePosted": "2020-10-13T12:49:23+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Please note to be considered for this role you will need to apply via our company website, please search &#39;CGL Vacancies&#39; via google and then &#39;Health and Wellbeing Nurse&#39; to locate and apply for this role.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Do you want to work for a caring organisation that believes in people? Do you want to make a difference?&lt;/p&gt;\n&lt;p&gt;Come and work for Change Grow Live!!&lt;/p&gt;\n&lt;p&gt;At Change Grow Live we have an underpinning ethos that both celebrates success in harm reduction &amp; engagement along with the passionate belief that recovery from addiction can be self-defined and contagious. We truly believe that an addiction free lifestyle can be within the reaches of any individual, irrespective of their circumstances.&lt;/p&gt;\n&lt;p&gt;We want to build on our success and create more opportunities for service users to begin or continue their recovery journey, adding to this growing asset-based resource and support system. To help achieve this, we invite people who share our passion, to apply for an exciting opportunity as the Health &amp; Wellbeing Dual Diagnosis Nurse for our new Barnet service.&lt;/p&gt;\n&lt;p&gt;Our service aims to encourage and empower people to regain control of their lives and motivate them to improve their health and wellbeing. We are committed to reducing substance use related harm to the individual and wider community promoting healthier lifestyles and enabling service users to improve their own health and wellbeing.&lt;/p&gt;\n&lt;p&gt;The Health and Wellbeing Dual Diagnosis Nurse role is a varied one, the successful candidate will take a lead in working in partnership with Adult Mental Health and working to a Joint working protocol.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will identify and support those individuals who present with co-existing mental health and substance misuse problems i.e. dual diagnosis service users.&lt;/li&gt;\n&lt;li&gt;You will ensure our service users have parity of service both in AMH and in Addictions by actively engaging professionals and service users alike.&lt;/li&gt;\n&lt;li&gt;You will also participate in BBV screening and Hep B vaccination programme, conduct healthcare screening, carry out opiate and alcohol assessments, titrations and ambulatory alcohol detoxes.&lt;/li&gt;\n&lt;li&gt;You will work in partnership with other specialist healthcare providers and liaise with local GP’s.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please see the job description and role specifics sheet for more detailed information about the roles and responsibilities of this post.&lt;/p&gt;\n&lt;p&gt;If you would like to be part of a successful organisation delivering high quality services to those using substances and alcohol, then we look forward to receiving your application. You will be required to work flexibly as required and work openly to maintain the most appropriate level of service provision.&lt;/p&gt;\n&lt;p&gt;Change Grow Live actively supports their nurses with, revalidation, protected CPD time, access to personal wellbeing resources and time to focus on your wellbeing which totals up to 6 days per year on top of your annual leave, a wide range of educational opportunities including free access to the RCNi learning platform. Change Grow Live also reimburse your annual NMC fee!&lt;/p&gt;\n&lt;p&gt;In return for hard work, professionalism, and dedication we will offer excellent terms and conditions, a comprehensive career development plan and the support you need to really make a difference to service users’ lives.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to undergo an enhanced DBS check.&lt;/p&gt;\n&lt;p&gt;For further information please contact Regional Lead Nurse Naz Mahmud naz.mahmud@cgl.org.uk or Lead Nurse Charlie Venn charlie.venn@cgl.org.uk.&lt;/p&gt;\n&lt;p&gt;You will be required to work flexibly to maintain the most appropriate level of service provision. This will include some evening working.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132514.png", "name": "change, grow, live (CGL)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet", "postalCode": "HA8 0AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6058", "longitude": "-.271851"}}, "title": "Dual Diagnosis Nurse - 2441 -  Barnet", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224366", "validThrough": "2020-11-06T23:59:59+0000"}