{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22199", "minValue": "20771", "unitText": "YEAR", "value": "£20,771 - £22,199 pa inc HCA"}}, "datePosted": "2020-11-06T11:00:49+0000", "description": "&lt;p&gt;Band 3 - Medical Education Administrator, Medical Education Centre&lt;/p&gt;\n&lt;p&gt;The Watford Hospital Medical Education Department is looking for a Medical Education Administrator. This is an exciting opportunity to become involved with a significant and developing area of medical education. We are looking to recruit an enthusiastic and dynamic individual to provide a full range of administrative support to the Undergraduate and Resuscitation Training programmes within the department.&lt;/p&gt;\n&lt;p&gt;The Trust provides training schemes for Undergraduates from UCL and St Georges University and Postgraduate training schemes for trainees from the East of England. The successful applicant will be provide administrative support to these programmes with a range of tasks, which include assisting the Medical Education Fellows in the delivery of the curriculum to providing support to the students around placements and accommodation.&lt;/p&gt;\n&lt;p&gt;The post holder will be an integral part of the team and will also provide lead administrative support to the Resuscitation Training team and their nationally recognised courses. The Trust plans to increase the range of courses it offers and this role will play a key role in identifying and delivering these courses.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with strong interpersonal skills and who is a self-starter with a high attention to detail. NHS specific experience is desirable but not essential.&lt;/p&gt;\n&lt;p&gt;We would love to hear from you if you are interested in coming to work with our Medical Education Team and the Faculty.&lt;/p&gt;\n&lt;p&gt;The successful candidate would be expected to work normal working hours of 9am- 5pm (37.5 hours) Monday to Friday&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;david.goodier@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 3 - Medical Education Administrator, Medical Education Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259328", "validThrough": "2020-11-22T23:59:59+0000"}