{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T14:46:22+0000", "description": "&lt;p&gt;An opportunity has arisen for a dynamic Staff Nurse to join the team at Bracken House Rehabilitation unit. Bracken House is a busy 18 bedded rehabilitation unit for working age adults experiencing mental health problems.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, caring and highly motivated staff nurse to provide high quality care within our service. The posts is full time and features combinations of shift patterns including early, late and night shifts.&lt;/p&gt;\n&lt;p&gt;The post requires an individual with strong communication skills and who has the ability to work within a team. This role requires someone who can work under pressure and be adaptable.&lt;/p&gt;\n&lt;p&gt;Essential requirements:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Understand current mental health legislation&lt;/li&gt;\n&lt;li&gt;Understand Clinical Risk Assessment&lt;/li&gt;\n&lt;li&gt;Understand and utilise care plans and role of named nurse to effectively deliver care to patients&lt;/li&gt;\n&lt;li&gt;Ability to function within a team.&lt;/li&gt;\n&lt;li&gt;Good oral and written communication&lt;/li&gt;\n&lt;li&gt;Ability to develop professional working relationships with a challenging patient group.&lt;/li&gt;\n&lt;li&gt;An understanding of the importance of working closely with services users and their family/friends/carers.&lt;/li&gt;\n&lt;li&gt;Evidence of good skills in assessment intervention and evaluation of patients nursing care.&lt;/li&gt;\n&lt;li&gt;Evidence of ability to work within a multi-disciplinary team.&lt;/li&gt;\n&lt;li&gt;Evidence an understanding of recovery and the role of this within an acute healthcare setting.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You must be a RMN or equivalent and registered with the NMC. You must be able to work flexible hours on a 24hr rota including weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;Applicants must have some experience of working within the mental health setting, be flexible, hardworking and compassionate with a desire to work in a fast pace environment.&lt;/p&gt;\n&lt;p&gt;You will have access to training and development, annual appraisals and clinical supervision.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Darren Whitford - Unit Manager&lt;/p&gt;\n&lt;p&gt;Email address: darren.whitford@nottshc.nhs.uk / Telephone number: 01623404611&lt;/p&gt;\n&lt;p&gt;or ask for Amy Simmons and Krystle Thomas (Clinical Team Leaders)&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mansfield", "postalCode": "NG18 5QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1414", "longitude": "-1.20591"}}, "title": "Staff Nurse RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256280", "validThrough": "2020-11-15T23:59:59+0000"}