{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-30T14:15:24+0000", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Locum Consultant Cardiologist&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;An opportunity has arisen for a dynamic, enthusiastic Locum Consultant to join our Cardiology Team at Warrington and Halton Teaching Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Warrington Hospital is the larger acute hospital in the Warrington and Halton Trust, with 578 in-patient beds. The second hospital, Halton General, has 42 in-patient beds, extensive out-patient services and a newly opened Urgent Care Centre. The ED at Warrington serves a population of over 310,000 people; it is open 24 hours daily and sees 85,000 new patients per year. There are a wide range of specialties on site including medicine, surgery, orthopaedics, ENT, ophthalmology, paediatrics, obstetrics and gynaecology. Warrington and Halton Teaching Hospital has been rated ‘Good’ in its most recent CQC inspection.&lt;/p&gt;\n&lt;p&gt;The Cardiology team are looking to appoint a Locum Consultant Cardiologist ideally with a sub-specialist in cardiac imaging to join our existing team of Cardiologists. This is a 12 month fixed term post based at Warrington Hospital; the post holder will be encouraged to participate in the development of cardiac services as part of our cardiology transformation project. The appointee will play a key role in the development of our services and will contribute to acute cardiology and the provision of outpatient clinics.&lt;/p&gt;\n&lt;p&gt;Cardiac imaging has developed significantly at the Trust in the last 18 months and the services ambition is for at least two dedicated imaging Consultants. There is a considerable demand for outpatient Cardiology and the post holder is expected to hold at least two clinics per week. The jobs attract payment at 10 -12 PA per week. There is the option to undertake on-call for additional PA allocation.&lt;/p&gt;\n&lt;p&gt;All informal enquiries and visits may be arranged by contacting:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Ahmed Farag&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Consultant Cardiologist / Clinical lead/ Associate Medical Director for Recovery&lt;/p&gt;\n&lt;p&gt;ahmed.farag2@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Mark Forrest&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Clinical Director, Medical Care Clinical Business Unit&lt;/p&gt;\n&lt;p&gt;Mark.forrest1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121088.png", "name": "Warrington and Halton Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121088"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington", "postalCode": "WA5 1QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.394", "longitude": "-2.61073"}}, "title": "Locum Consultant Cardiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250495", "validThrough": "2020-11-16T23:59:59+0000"}