{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-03T14:49:13+0000", "description": "&lt;p&gt;North Hants CCG is looking for a highly motivated and enthusiastic individual to provide and coordinate an efficient and confidential administrative service to all teams at North Hampshire Clinical Commissioning Group.&lt;/p&gt;\n&lt;p&gt;This will include for example, the preparation of agendas, attending and taking of minutes for various meetings, administration support to Deputy Directors, deputising for the Executive Assistant to the Managing Director, providing extensive diary management, planning meetings and events, a variety of administrative duties including telephone work and working as part of a team to cover sickness/holiday. A major part of this role will include involvement with Modernising our Hospitals &amp; Health Services and the ICP.&lt;/p&gt;\n&lt;p&gt;If you have the attributes we need and you would like to work for a friendly, supportive team, then we look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;This is a full time position working a 37.5 hours per week, Monday – Friday.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we / what do we do?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ensuring patients receive the care they need, in the right place and at the right time is the top priority for the Hampshire and Isle of Wight Partnership of Clinical Commissioning Groups (the Partnership).&lt;/p&gt;\n&lt;p&gt;The Partnership serves a population of more than 1 million people and manages a budget of £1.4 billion. It is made up of various clinical commissioning groups from Fareham and Gosport and South Eastern Hampshire, to North Hampshire and the Isle of Wight.&lt;/p&gt;\n&lt;p&gt;The aim of the Partnership is to help accelerate improvements in patient care, be more effective and reduce duplication. By working together, we share capacity and skills and operate with greater consistency with our partners for the benefit of patients.&lt;/p&gt;\n&lt;p&gt;We offer excellent employment opportunities to new and existing staff and aim to be a model employer by embedding best HR practice and to support new ways of working.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on offering good working conditions, job security, lifelong learning, fair pay and benefits, staff involvement and a balance between work and personal life.&lt;/p&gt;\n&lt;p&gt;We enjoy a forward thinking and innovative culture and our vision is to have healthy people, living healthy lives in healthy communities. We understand the only way to deliver this is to have the right people with the right skills.&lt;/p&gt;\n&lt;p&gt;Here is a summary of some of the benefits and services which are on offer to staff:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days paid minimum holiday and bank holiday entitlement&lt;/li&gt;\n&lt;li&gt;NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Sick pay policy&lt;/li&gt;\n&lt;li&gt;Occupational health services including staff counselling services&lt;/li&gt;\n&lt;li&gt;Flexible working and family friendly policies&lt;/li&gt;\n&lt;li&gt;Flexible retirement&lt;/li&gt;\n&lt;li&gt;Health Service Discounts – offers for stores, travel, equipment etc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note, successful candidates will be subject to a six-month probationary period.&lt;/p&gt;\n&lt;p&gt;North Hants Clinical Commissioning Group, Chineham Business Park, Basingstoke BS25 8GU&lt;/p&gt;\n&lt;p&gt;Recruiting Manager: Michelle Johnson (Corporate Services Manager) – 01256 705503 / 07747 760584&lt;/p&gt;\n&lt;p&gt;If you would like to have an informal discussion about this role, please contact Michelle on the phone number above.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS North Hampshire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128556"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke", "postalCode": "RG24 8GU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2924", "longitude": "-1.06616"}}, "title": "Business Services Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254425", "validThrough": "2020-11-16T23:59:59+0000"}