{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 per annum"}}, "datePosted": "2020-10-28T15:46:31+0000", "description": "&lt;p&gt;We’re all about support. Support for you and your support for the patients. With this in mind, we have built a state of the art Emergency Assessment Unit (Nye Bevan building) and a new way of working to streamline and remove pressure where we are able. We’re working hard to make people feel supported in appraisals to keep everything on track, with study leave, with job plans with SPA time, with revalidation, with secretarial support and most importantly, supported in progressing you career at NGH as a Doctor and beyond if you chose. You will of course be working as part of an excellent wider MDT, but also autonomously. Support is one of the things we do really well here at Northampton General Hospital We are driven to help develop you and your experience at any level. We will support you in your role. Recently rated by CQC as a GOOD hospital, we are starting to see the rewards of our hard work and are now looking for doctors to join us on our journey to being rated as OUTSTANDING by the CQC.&lt;/p&gt;\n&lt;p&gt;This job is an exciting opportunity for an enthusiastic and well-motivated candidate to develop gynaecological and obstetric skills. There will be direct training and operative supervision throughout duration of the post. Candidates will work as part of the registrar rota to support the service in providing care across both obstetrics and gynaecological services&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sue Lloyd - Clinical Director ; Sue.lloyd@ngh.nhs.uk&lt;/p&gt;\n&lt;p&gt;We would be delighted to talk with you if this role is for you or you are interested in NGH in any other way. Please contact Mrs Sue Lloyd, Sue.lloyd@ngh.nhs.uk, to arrange an appointment to come a visit us.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton General Hospital, Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "Trust Grade in Obstetrics &amp; Gynaecology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247253", "validThrough": "2020-11-25T23:59:59+0000"}