{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-06T10:16:38+0000", "description": "&lt;p&gt;NHS Kernow CCG Planned Care commissioning team invites applications for a 6 month secondment carrying out the role of Project Assistant.&lt;/p&gt;\n&lt;p&gt;Delivery of planned care activity currently faces significant challenges in the wake of the national and local response to the Covid-19 pandemic, and the team is looking for an enthusiastic individual to support its work with key stakeholders across the healthcare system to drive the recovery and transformation of planned care services. This is a great opportunity for someone interested in developing commissioning and project experience and building relationships across several teams within the CCG (contracting, finance, quality etc) as well as with clinicians and a range of non-clinical colleagues in primary and secondary care organisations.&lt;/p&gt;\n&lt;p&gt;The planned care team will provide full support but is looking for someone who will support a range of projects including, quality improvements, service development and transformational redesign programmes from concept through to implementation in order to deliver pathway changes and savings associated with them. The ideal candidate will be skilled in building and maintaining relationships in different teams and organisation please see the job description for more details.&lt;/p&gt;\n&lt;p&gt;Virtual interviews to take place by Friday 20th November. The team is looking for the right candidate to start as soon as possible and we recommend you discuss applying with your line manager before submitting an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Andy Gordon, Senior Commissioning Manager,  Andy.gordon@nhs.net or 078818 05137&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128400.jpg", "name": "Kernow Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Austell", "postalCode": "PL25 5AS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3397", "longitude": "-4.79474"}}, "title": "Project Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259177", "validThrough": "2020-11-15T23:59:59+0000"}