{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-06T14:31:20+0000", "description": "&lt;p&gt;We think Sherwood is a great place to work and receive care and in the next couple of years we will continue to focus on these three areas;&lt;/p&gt;\n&lt;p&gt;• Working with partners to promote health and wellbeing and supporting people in their homes for as long as possible&lt;br /&gt;• Providing safe, personalised care through our three hospital sites&lt;br /&gt;• Working with partners to discharge patients in a safe, timely way&lt;/p&gt;\n&lt;p&gt;Underpinned by high levels of staff engagement, we want to provide safe, personalised care to local people, with every patient treated as if they are a member of our family. The continued delivery of this supports our commitment to outstanding care.&lt;/p&gt;\n&lt;p&gt;We are looking for a colleague to work with the Deputy Chief Operating Officer to provide key strategic and operational leadership to elective care recovery across the organisation and with external partners. We would like a leader who is values based, forward thinking, has vision and will inspire our teams. You will have an impressive track record in operational and service management, service delivery and service improvement, with well-developed interpersonal and communication skills. You will like working to ambitious goals and you will be adept at developing productive working relationships. Overall, the successful candidates will understand the critical role of a leader in healthcare is to provide support, creating a culture and environment to allow clinical colleagues to flourish and provide the best care they possibly can.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to be at the heart of elective recovery in a Trust rated ‘Good’ by the CQC and where the main acute site is rated as ‘Outstanding’. In return we will give you a challenging, yet fulfilling role, career support, and development. You will be working in a fantastic state of the art building and in an organisation with some of the most caring and friendliest colleagues you will ever meet in the NHS.&lt;/p&gt;\n&lt;p&gt;I hope this has you interested in working with us, if so please contact me on 01623 622515 ext. 4256 or Helenhendley@nhs.net.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s Mill Hospital, Sutton-In-Ashfield", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Head of Elective Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260142", "validThrough": "2020-11-20T23:59:59+0000"}