{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 pa incl. HCAS"}}, "datePosted": "2020-10-27T12:38:39+0000", "description": "&lt;h2&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Respiratory Senior Physiotherapist&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Band 6 - Full Time (37.5 hours) - Permanent&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a fantastic opportunity for someone with a particular interest in respiratory medicine and medical rehabilitation to become static within the medical area. We are looking for an enthusiastic and motivated physiotherapist with senior experience within the respiratory field. &lt;em&gt;Experienced juniors with a keen interest in respiratory and medicine would be considered.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We have an established physiotherapy led NIV service alongside general medical rehabilitation.&lt;/p&gt;\n&lt;p&gt;The medicine team covers several specialist wards: respiratory (including 2 high care bays), gastro/hepatic and cardiac (including CCU). The team also provides support for any respiratory patients in A&amp;E and the acute admissions unit.&lt;/p&gt;\n&lt;p&gt;The static senior physiotherapist would be required to work across all medical areas alongside the rotational respiratory seniors (NIV and cardiac). You will be required to deputise for the Team Lead therefore you will need to be able to demonstrate good leadership and management skills, as well as having sound clinical respiratory skills.&lt;/p&gt;\n&lt;p&gt;The medicine team run a seven day service, in addition to a department wide evening on-call service.&lt;/p&gt;\n&lt;p&gt;We pride ourselves in supporting staff with good team and department structures and morale. We run specialist clinical training, non-clinical training, and student training, as well as supporting external courses. You will be directly supported by the Team Lead in Medicine. We also have superb working relationships with our Consultants and Ward Teams.&lt;/p&gt;\n&lt;p&gt;Our clinical staff are involved in Trust level clinical and nonclinical projects and have opportunities to drive service development, audit and evidence based practice.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you are interested please contact Becky Kenyon – Superintendent Physiotherapist on 01483 464819.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;CLOSING DATE: 10/11/2020&lt;/p&gt;\n&lt;p&gt;INTERVIEW DATE: TBC&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Respiratory/Medicine Senior Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244550", "validThrough": "2020-11-10T23:59:59+0000"}