{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-26T12:31:20+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM FOR 12 MONTHS DUE TO THE NEEDS OF THE SERVICE.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a vital time for public health across the Cwm Taf Morgannwg region as the Health Board and local authorities work together with Public Health Wales and Welsh Government to respond to and manage the COVID19 pandemic. This post is a pivotal role to communicate and engage with our staff and communities about the work taking place to respond to COVID19 and the actions they need to take to manage and reduce the spread of the virus.&lt;/p&gt;\n&lt;p&gt;The post-holder will play a critical role in communicating and engaging with staff, stakeholders and communities to ensure they are aware of the behavioural change and individual actions which need to be taken to reduce and manage the spread of COVID19. These include measures such as social distancing and good hand hygiene, being tested if they develop symptoms of COVID19, contact tracing and the requirements around self-isolation should they test positive for COVID, be contacted as part of contact tracing or risk being exposed to COVID through travel to a high-risk area.&lt;/p&gt;\n&lt;p&gt;The post holder will work with closely with the Health Board’s public health team and local authorities to lead in the development, implementation and evaluation of robust communications and engagement plans to ensure they are tailored to the needs of a range of individuals and are put in place in an effective and timely manner. This will include implementing and evaluating a range of activities and the development of communications materials for this very high profile topic.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Julia Sumner - Interim Head of Communications&lt;/p&gt;\n&lt;p&gt;julia.sumner@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01443 744814&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ynysmeurig House, Abercynon", "postalCode": "CF45 4SN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6407", "longitude": "-3.32794"}}, "title": "Communications and Engagement Manager (COVID-19)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242445", "validThrough": "2020-11-08T23:59:59+0000"}