{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £31,365 to £37,890 pa"}}, "datePosted": "2020-11-04T10:01:09+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Come and join a Trust rated Outstanding by the CQC. South Warwickshire NHS Foundation have been rated as outstanding following our latest inspection by the CQC and we are recruiting new staff to come and help us improve even further.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and enthusiastic Midwife or Health Visitor with a passion for Infant Feeding. A focus on driving forward infant feeding training and development for our staff within the Family Health and Lifestyles 0-19 Service in Coventry will be priority. Experience in delivering staff training is essential as it is a major aspect of the role, you will be required to attend training to gain further skills and knowledge to ensure staff receive a high standard of evidence based, gold standard infant feeding education.&lt;/p&gt;\n&lt;p&gt;You will be required to support the UNICEF Baby friendly Initiative project manager/ Health and wellbeing Specialist in the maintenance of Baby Friendly Standards full accreditation, service development and innovation. The applicant must have commitment and awareness of the issues faced by new parents, particularly with regard to infant feeding and maternal wellbeing. You will be proactive and take a positive approach to establishing relationships with other professionals, volunteer peer supporters and new parents.&lt;/p&gt;\n&lt;p&gt;As an Infant feeding specialist you will be providing visionary leadership, with a clear focus on resource, team coordination and all matters relating to infant feeding. We are very proud of all our achievements to date: we are on an exciting improvement pathway and a journey towards the BFI UNICEF Gold award.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Carmen Baskerville Carmen.Baskerville@swft.nhs.uk&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Coventry", "postalCode": "CV4 8DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3933", "longitude": "-1.57458"}}, "title": "Infant Feeding Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255277", "validThrough": "2020-11-18T23:59:59+0000"}