{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-30T14:17:16+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Royal Surrey NHS Foundation Trust &lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Paediatric Emergency Medicine Consultant&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic Consultant in Paediatric Emergency Medicine to join the existing ED team. This is an exciting opportunity to join a strong team of consultants, medical and nursing staff who provide a truly excellent service. We are looking to appoint an outstanding individual with clear insight into the challenges of providing children’s acute care and with a clear vision of how we might deliver and shape our service for the future. The appointee would work to improve services for children and young people attending our ED.&lt;/p&gt;\n&lt;p&gt;This Emergency Department embraces change, and we are looking for an enthusiastic, dynamic and creative Consultant to join our innovative team.&lt;/p&gt;\n&lt;p&gt;It is an exciting time to join our team as the new ED £8M redevelopment plan has delivered a bigger footprint and new Paediatric, Major and CDU areas.&lt;/p&gt;\n&lt;p&gt;There is considerable scope for the successful candidate to be involved in service re-design and quality improvement projects, shaping the Departments future development and improvement of patient care.&lt;/p&gt;\n&lt;p&gt;Whilst the post has a strong emphasis on direct, consultant delivered emergency care, we are seeking applicants who will have the ability to make a major contribution to training and upskilling our junior medical staff, nursing staff and the wider professional team and to get involved and lead on QIP The department’s many attributes include regional accreditation as a Trauma Unit, established use of emergency bedside ultrasound and specific POCUS training, multi professional simulation sessions and teaching and a unique CESR programme which has been funded by HEE KSS.&lt;/p&gt;\n&lt;p&gt;The Consultant rota is semi-annualised with genuine flexibility to ensure a good work/life balance. Our existing team includes 12.5 WTE Consultants, 21 Specialty Trainees, Specialty Doctors, ACCS Trainees, FY2 &amp; Trust Doctors together with 8.75 WTE Emergency Nurse Practitioners.&lt;/p&gt;\n&lt;p&gt;Interested applicants are invited to contact our Clinical Director Dr Carlo Arrigo c.arrigo@nhs.net for further discussions.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Paediatric Emergency Medicine Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250538", "validThrough": "2020-11-18T23:59:59+0000"}