{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum, inc HCA"}}, "datePosted": "2020-11-04T16:30:48+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Emergency Department and Acute Medical OT Team at the Princess Royal University Hospital is looking for a motivated and enthusiastic band 6 OT to apply for a static post in Emergency Department and the Acute Medical Unit (AMU). The team is led by a clinical lead and ensures sound professional structures and clinical leadership is in place. Working on the ED and AMU offers excellent opportunities for developing clinical, managerial and educational skills within a supportive and fast paced learning environment. This is an exciting opportunity to join a developing service and further promote the role of OT within the multi-disciplinary team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King’s College Hospital has a large Therapy department with 250+ therapists from Occupational Therapy, Physiotherapy and Speech and Language Therapy. Each service is organised under a Head of Profession with a Director of Therapies heading up the services and representing Therapies across the Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is an established system for the delivery of clinical governance objectives, CPD and Evidence Based Practice across the service. CPD is encouraged through the Trust appraisal system, as well as through Team CPD Cycles. We encourage journal clubs, formal teaching, skills training and service development, with opportunities to lead and participate in these sessions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Band 6 OTs have regular cross department meetings as part of peer support and networking. There is also opportunity to develop your skills in clinical audit and supervision. Students are regularly on placement from local universities, and as a band 6 OT, this is a fantastic learning opportunity. If you are not yet a Practice Placement Educator, you can be supported in attending appropriate training.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must have a degree or equivalent in Occupational Therapy and be HCPC registered. Experience of consistently treating patients with complex physical needs will be essential to this post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder requires a flexible approach to working, including cross sites and be able to undertake weekend working commitments as part of a 7 day working rota.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Natasha Davies&lt;/p&gt;\n&lt;p&gt;Job title Team Lead Occupational Therapist&lt;/p&gt;\n&lt;p&gt;Email address Natashadavies@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01689863918&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Paul Nash, Clinical Lead Occupational Therapist&lt;span&gt; or Emily Tracy, Team Lead Occupational Therapists for Medicine (01689) 863918 / Paulnash@nhs.net / emily.tracy@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Senior Occupational Therapist, ED/Acute Medical Unit – Static Post", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256663", "validThrough": "2020-11-30T23:59:59+0000"}