{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 to £51,069 pa"}}, "datePosted": "2020-11-02T17:00:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Trust Speciality Registrar in Psychiatry&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(Neuropsychiatry Service at The Walton Centre)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Introduction:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to a recent investment in the Neuropsychiatry service an exciting job opportunity has arisen for a &lt;strong&gt;Trust Speciality Registrar in Psychiatry&lt;/strong&gt; in the Walton Centre NHSFT. This is a fixed term post for 12 months that welcomes flexible working candidates. This job is essentially suitable for a junior doctor who has recently finished their core training in Psychiatry and is looking to gain more experience in Liaison psychiatry and specialist experience in Neuropsychiatry. The hours have been approved to work upto a maximum of 28 hours per week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The Walton Centre NHS Foundation Trust :&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Walton Centre NHS Foundation Trust is the only specialist Neuroscience Centre within the UK. We pride ourselves on providing innovative services to support those in our care and have been rated Outstanding following the past 2 CQC visits. Recently, The Walton Centre was ranked 6th in the country for overall experience in the National Inpatient Survey.&lt;/p&gt;\n&lt;p&gt;The Walton Centre provides neurological, neurosurgical and pain services throughout the Northwest of England and also North Wales. The hospital offers treatment to diverse neurological problems including epilepsy, neurodegenerative disorders, acquired brain injury and brain tumours. It also host The Cheshire and Merseyside Rehabilitation Network(CMRN) which was set up in 2013 with the aims to streamline access to and provision of Neuro-rehabilitation within the Merseyside and Cheshire areas. The pathway consists of a hub rehabilitation unit based at the Walton Centre and also spoke rehabilitation units at Broadgreen and St Helens Hospitals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Current configuration of Neuropsychiatry :&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At present, Neuropsychiatry service within the Walton Centre consist of:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dr Antonio Da Costa, &lt;strong&gt;Consultant Neuropsychiatrist&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Vacancy(Current post), &lt;strong&gt;Specialist Registrar in Psychiatry&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Jon Smith, &lt;strong&gt;Specialist Neuropsychiatry Nurse&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Vacancy(Recruitment underway), &lt;strong&gt;Mental Health Liaison Nurse&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There are plans underway to increase this and develop the team further. The Neuropsychiatry service receives referrals from only Neuroscience specialists within The Walton Centre. It is not commissioned to receive referrals from other psychiatrist or GPs in the region. It covers the Cheshire and Merseyside Rehabilitation Pathway in addition to the Walton Centre. It provides both specialist Neuropsychiatry outpatients and inpatient psychiatry liaison cover to all the wards in the trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The Current Post:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is being recruited to provide Psychiatry input into the Walton Centre and also the Cheshire and Merseyside Rehabilitation Network.&lt;/p&gt;\n&lt;p&gt;The post holders primary role will be to provide psychiatry liaison with the support of the Consultant Neuropsychiatrist to inpatients on the wards. The post holder learning needs will be considered and based on their interest a provision for supervised neuropsychiatry outpatient clinics within the Walton Centre might be an option in the job plan. The referrals for the clinics are made by the in-house consultant staff. The Neuropsychiatry service is not commissioned to accept referrals from Primary Care. Weekly teaching and case conferences takes place in the Walton Centre.&lt;/p&gt;\n&lt;p&gt;The Cheshire and Merseyside Rehabilitation Network provides inpatient and outpatient rehabilitation across the two counties for individuals affected by trauma. The post holder will work into the trauma pathway and provide medical leadership to the rest of the neuropsychiatry team. They will also be expected to represent the Neuropsychiatry team at multidisciplinary meetings in other neuroscience speciality.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Antonio Da Costa&lt;/p&gt;\n&lt;p&gt;Consultant Neuropsychiatrist&lt;/p&gt;\n&lt;p&gt;Antonio.DaCosta@thewaltoncentre.nhs.uk&lt;/p&gt;\n&lt;p&gt;01515563523( Carla Worrall, Neuropsychiatry Secretary)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date – 2 weeks after insertion&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120725.JPG", "name": "Walton Centre NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120725"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L9 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4665", "longitude": "-2.93093"}}, "title": "Trust Grade StR in Neuropsychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252952", "validThrough": "2020-11-17T23:59:59+0000"}