{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum / pro rata"}}, "datePosted": "2020-11-05T13:16:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you looking for a more flexible work option, or to boost your income with additional shifts? If this sounds like you, come and join our Admin Bank!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at The Shrewsbury and Telford Hospital NHS Trust, we understand that a permanent full-time role may not suit everyone. Our Admin Bank can offer shifts in a variety of areas across both hospital sites with hours to suit you!&lt;/p&gt;\n&lt;p&gt;This post involves providing administrative and clerical support within our clinical teams. The successful applicant will need to have experience of delivering a high standard of customer service in a customer facing role; they will possess an in-depth knowledge of Microsoft programmes such as Word, Excel, PowerPoint and Outlook. You will be expected to organise meetings, prepare agendas, take and produce minutes in a timely manner and therefore have experience of diary management. The ability to audio type is desirable but not essential. You should be able to use bespoke IT systems such as Sema, Secretary Work station and a clinical portal although training will be given. You must be able to be to communicate and liaise with senior internal stakeholders such as Consultants, Nursing and Midwifery staff. Possess a good telephone manner, confidence and have a positive way of working is essential. You must be methodical and able to work and remain calm under pressure and to timescales. You will be required to work under your own initiative, have good interpersonal skills and to liaise with both staff within the Trust and external Organisations. This involves dealing with telephone enquiries, administration duties and photocopying as requested and ensuring that requests are dealt with appropriately.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a valued member of our Bank team we can also offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Weekly or monthly pay – you choose!&lt;/li&gt;\n&lt;li&gt;Flexibility to work the hours that suit you&lt;/li&gt;\n&lt;li&gt;Opportunities to work within different departments throughout the Trust and gain experience in a variety of areas&lt;/li&gt;\n&lt;li&gt;Paid Trust induction&lt;/li&gt;\n&lt;li&gt;Access to the same training and progression opportunities as substantive staff&lt;/li&gt;\n&lt;li&gt;Option to join the NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Various local and national discounts through the Blue Light Card and Health Service Discounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please note that this vacancy may close early if a high number of applications are received - early application is advised.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMelissa BirkettJob titleAdministration Manager Women and Children&#39;sTelephone number01952 641222 ext 5684&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury", "postalCode": "SY2 6LG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6918", "longitude": "-2.71556"}}, "title": "Bank Administration Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257835", "validThrough": "2020-11-12T23:59:59+0000"}