{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "5043", "minValue": "5043", "unitText": "YEAR", "value": "Salary Range 3 £18,681 pro rata fixed salary point"}}, "datePosted": "2020-11-02T14:54:00+0000", "description": "&lt;p&gt;CARE PLUS GROUP&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Intermediate Care at Home&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Vacancy based at Val Waterhouse Centre, Kent Street, Grimsby&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Reference Number: 814-20-205&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Scheduling Officer&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;20.5 Hours per week – You will be required to work Wednesday – Friday on a rota pattern working between 8 am and 6 pm and will be required to adjust hours to include monthly weekend working and Bank Holidays from 7 am – 3 pm&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary Range 3 £18,681 pro rata fixed salary point&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Care Plus Group is a Social Enterprise established since 2011 to deliver community healthcare services following the national separation of provider services from the commissioning arm of the local NHS. One of our core values is that staff and patients are integral to everything we do. As part of this all staff employed by Care Plus Group automatically become members of the Group which means you will be able to give your views and vote on important issues for the organisation. We welcome your application to join us.&lt;/p&gt;\n&lt;p&gt;Intermediate Care @ Home delivers a service of high quality and excellence over 7 days a week; 365 days a year providing support for people in their own homes within the boundary of North East Lincolnshire. The success of the service is dependent of robust resource management especially around allocation of staff hours. Diligence is required to ensure that staff are matched to areas that reduces the amount of time spent on travel to maximise actual contact time.&lt;/p&gt;\n&lt;p&gt;You will be required to: -&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Communicate effectively with patients/clients respecting diversity; backgrounds; chosen lifestyles; abilities and culture&lt;/li&gt;\n&lt;li&gt;Provide a range of electronic and administrative services to a specified section in accordance with Departmental practices and within defined delegation&lt;/li&gt;\n&lt;li&gt;Allocate staff required to meet service user needs and within prescribed standards of good practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To operate the Home Care Management System to assist the efficient delivery of Intermediate Care at Home within the community along with use of Systm 1&lt;/li&gt;\n&lt;li&gt;Co-ordinate services to facilitate the continued development and independence of the service user&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For this role, it is essential that you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hold a QCF/NVQ 2 in Business Administration (or equivalent)&lt;/li&gt;\n&lt;li&gt;Are proficient in the use of Excel; Word; Outlook and general data bases&lt;/li&gt;\n&lt;li&gt;Have the ability to communicate effectively both verbally and in writing&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;• &lt;/em&gt;&lt;/strong&gt;Have the ability to handle a demanding workload and meet tight deadlines&lt;/p&gt;\n&lt;p&gt;• Are able to work flexibly including week-ends and bank holidays as per rota&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will take place on 1st/2nd December 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information and an informal discussion please contact &lt;strong&gt;Sheena Chapman &lt;/strong&gt;on &lt;strong&gt;01472 256221&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CLOSING DATE: 15 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please refer to the Job Description and Person Specification for more information, and the criteria required to fulfil the role.&lt;/p&gt;\n&lt;p&gt;Please note that any offer of a post is subject to pre-employment screening.&lt;/p&gt;\n&lt;p&gt;We offer favourable terms and conditions including optional membership to a contributory pension scheme, lease cars, a full induction programme and CPD opportunities. We have Independent Provider closed access to the NHS pension scheme, for further details about eligibility please contact us.&lt;/p&gt;\n&lt;p&gt;Care Plus Group will interview all disabled candidates who meet the minimum criteria for any job vacancy.&lt;/p&gt;\n&lt;p&gt;Please note that if you have not heard from us within 6 weeks of the closing date we regret that you have not been short listed on this occasion.&lt;/p&gt;\n&lt;p&gt;Care Plus Group is an equal opportunities employer. It is our Policy to provide and ensure equal opportunities in the fields of recruitment, employment, training, promotion and job security irrespective of any characteristics which may place an applicant in any minority or disadvantaged group or groups.&lt;/p&gt;\n&lt;p&gt;We are committed to safeguarding the welfare of vulnerable adults and expect the same commitment from all staff and volunteers.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Care Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grimsby", "postalCode": "DN32 7DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5743", "longitude": "-.071666"}}, "title": "Scheduling Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252500", "validThrough": "2020-11-15T23:59:59+0000"}