{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33222", "minValue": "29171", "unitText": "YEAR", "value": "£29,171 to £33,222 pro rata"}}, "datePosted": "2020-10-18T14:19:42+0100", "description": "&lt;p&gt;&lt;strong&gt;Mental Health Practitioner – Cambian Whinfell School, Kendal&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: £29,171 to £33,222 pro rata&lt;/p&gt;\n&lt;p&gt;Permanent: Full Time, up to 40 hours per week (flexible options considered).&lt;/p&gt;\n&lt;p&gt;Location: Kendal, Cumbria, LA9 5EZ&lt;/p&gt;\n&lt;p&gt;Cambian Group, the UK’s largest provider of specialist services in children’s residential care, education, mental health rehabilitation and learning disabilities, is looking for a dedicated individual to join the company as a Mental Health Practitioner.&lt;/p&gt;\n&lt;p&gt;The post will require someone with previous experience of working with complex young people in either a CAMHS setting, Looked After Children’s services or residential settings and schools.&lt;/p&gt;\n&lt;p&gt;We offer excellent training and career progression opportunities as well as a variety of staff benefits.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cambian Whinfell School&lt;/strong&gt;is a 52-week education service that offers Ofsted rated &#39;Outstanding&#39; residential education and care for males aged 11-19. All of our young people have a diagnosis of Asperger Syndrome or high functioning Autism Spectrum Disorder and may have associated challenging behaviours and complex needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be providing a therapeutic service to children and young people placed within Cambian Whinfell School. You will assess and identify their needs and meet those needs through both a consultation approach and delivering direct therapeutic work. You will co-ordinate a clinical and therapeutic team and will deliver training to residential and education staff. An important aspect of the role is to continue to build the solution-focussed culture that already exists and to work with a range of stakeholders and colleagues to further build a holistic environment through which the needs of the young people can be met.&lt;/p&gt;\n&lt;p&gt;Dependant on your experience you may be required to supervise other Mental Health Practitioners, and Assistants within the Group.&lt;/p&gt;\n&lt;p&gt;A core role will be to provide specialist assessments of young people which can be developed into individual plans, targets and strategies. With colleagues you will use recognised assessment tools to gather and analyse data, track progress and establish further targets. This will be done across the waking curriculum with a focus on not just addressing ASD deficits but also on developing life skills and mental health resilience. You will need a good psychological understanding and be able to use current evidence-based best-practice.&lt;/p&gt;\n&lt;p&gt;Further duties are described in the attached Job Description.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidate Profile&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, motivated, forward thinking Mental Health Practitioner to join our friendly team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mental Health Practitioner, ideally with a background in psychology/CBT and relevant qualification in mental health&lt;/p&gt;\n&lt;p&gt;Registered and accredited with relevant professional organisation (HCPC etc)&lt;/p&gt;\n&lt;p&gt;Be a strong team player&lt;/p&gt;\n&lt;p&gt;Have excellent communication, organisational and time management skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Full support from a multi-disciplinary team&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Regular clinical supervision&lt;/li&gt;\n&lt;li&gt;Meetings and peer support&lt;/li&gt;\n&lt;li&gt;Developmental opportunities&lt;/li&gt;\n&lt;li&gt;Research opportunities &amp; support&lt;/li&gt;\n&lt;li&gt;Internal/external training on new initiatives&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will also learn from some of the most dedicated and inspirational people in our profession.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Note:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Successful candidates will need to meet the person specification in order to be offered this post.&lt;/p&gt;\n&lt;p&gt;Cambian is committed to Safeguarding and protecting the young people and service users within our care.&lt;/p&gt;\n&lt;p&gt;All candidates will be subject to an enhanced DBS check and reference checks.&lt;/p&gt;\n&lt;p&gt;Cambian is an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Company pension&lt;/li&gt;\n&lt;li&gt;Discounted or free lunch&lt;/li&gt;\n&lt;li&gt;Employee discount&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of working with young people on the autistic spectrum. Also knowledge of, and experience in, dealing with associated mental health conditions, attachment disorders, PDA, etc&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Required:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Driving Licence&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130935.png", "name": "Cambian Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kendal, Cumbria", "postalCode": "LA9 5EZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3356", "longitude": "-2.75947"}}, "title": "Mental Health Practitioner  - Cambian Whinfell School", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231411", "validThrough": "2020-11-08T23:59:59+0000"}