{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "38000", "unitText": "YEAR", "value": "£38,000 per annum"}}, "datePosted": "2020-11-04T12:20:47+0000", "description": "&lt;p&gt;If you care for others without a second thought and are looking for a rewarding career where you can make a difference and changes lives for the better, then take your care to next level by joining the team as a Deputy Ward Manager at Potters Bar Clinic.&lt;/p&gt;\n&lt;p&gt;As a Deputy Ward Manager you will have previous experience in a similar setting as a nurse, and have excellent knowledge in healthcare and managing people. You will be leading the nursing team and coordinating the wards, ensuring procedures are being followed and a safe environment is maintained.&lt;/p&gt;\n&lt;p&gt;You will have the responsibility of organising shifts, on call rotas and managing the ward budgets. You will be an integral member of the team, offering your peers on-going guidance and training to ensure they have the necessary support system and skillset.&lt;/p&gt;\n&lt;p&gt;You will be responsible for organising shifts, on-call rotas and managing the ward budgets. As aseniormemberof the nursing team, you will offer on-going guidance and training to ensure they have the necessary support system and skills.&lt;/p&gt;\n&lt;p&gt;Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society.&lt;/p&gt;\n&lt;p&gt;It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Managing and training of junior and nurse staff.&lt;/li&gt;\n&lt;li&gt;Supporting the implementation of local Clinical Governance Strategy.&lt;/li&gt;\n&lt;li&gt;Actively contributing to the Nursing Service Agreement, departmental Risk Matrix and action plan and monitoring their implementation&lt;/li&gt;\n&lt;li&gt;Lead in organisational clinical and nursing audit programmes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you will:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RMN Qualification&lt;/li&gt;\n&lt;li&gt;CAMHS Experience&lt;/li&gt;\n&lt;li&gt;Autistic Spectrum Disorder &amp; Learning Disorder experience&lt;/li&gt;\n&lt;li&gt;Experience of working similar environment&lt;/li&gt;\n&lt;li&gt;Relevant sufficient post registration experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;190 Barnet Road, Potters Bar, Hertfordshire, EN6 2SE&lt;/p&gt;\n&lt;p&gt;Join the team at Potters Bar Clinic providing care for young people and adults with acute mental health needs and personality disorders in an established 24-hour care environment. The CAMHS Tier 4 Low Secure services are for young people aged 13–18.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Potters Bar Clinic is located in a residential area, only one minute drive from the M25 and a short bus ride from Potters Bar Train Station – with a bus stop right outside, making it an easy commute for most.&lt;/p&gt;\n&lt;p&gt;This is a full time role and will be Monday – Friday 9am – 5pm&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What you will get&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £38,000 per annum depending on experience&lt;/li&gt;\n&lt;li&gt;Welcome Bonus £5,000&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About your next employer&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Potters Bar, Hertfordshire", "postalCode": "EN6 2SE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6861", "longitude": "-.178665"}}, "title": "Deputy Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255808", "validThrough": "2020-12-04T23:59:59+0000"}