{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-10-30T12:16:49+0000", "description": "&lt;p&gt;Do you have a sound knowledge of respiratory conditions and how integrated working can be used to support this client group?&lt;/p&gt;\n&lt;p&gt;Are you passionate about empowering your patients?&lt;/p&gt;\n&lt;p&gt;More emphasis on community-based care means there’s never been a better time to join our team. Having been awarded as ‘Outstanding’ in a recent CQC inspection, we are Kent’s leading provider of NHS services in the community and we are looking for a highly motivated occupational therapist to join our specialist respiratory team in East Kent.&lt;/p&gt;\n&lt;p&gt;If you successfully secure this post you would work alongside an established group of respiratory nurses/practitioners and in addition hold a caseload of complex patients with a range of respiratory conditions that require specialist input. You would autonomously manage the assessment, planning, delivery and evaluation of patient care and have a sound knowledge of theoretical frameworks and models that underpin your professional practice.&lt;/p&gt;\n&lt;p&gt;As a specialist nurse, you will deliver excellent patient care along a care pathway across organisational boundaries; your role will involve acting as a specialist resource and providing education to the wider multi-disciplinary team across the health economy. This will include putting in place management plans for patients who have complex respiratory conditions.&lt;/p&gt;\n&lt;p&gt;In return for your hard work we can offer you a flexible working environment; personal development and a comprehensive corporate and local induction programme. As a trust, we strongly believe in making sure you have the right support, resources and training to enjoy your job and we provide a range of services to keep you in the best of health.&lt;/p&gt;\n&lt;p&gt;We currently have bases in four localities across East Kent and whilst the successful applicant will be based in the Ashford/SKC locality, they will be expected to be flexible in their approach and travel to other areas within East Kent when required.&lt;/p&gt;\n&lt;p&gt;The post is for 37.5 hours per week , six month fixed term contract to support admission avoidance and an early discharge initiative.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews will take place on the 12th November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Clair Gough - Respiratory Specialist Practitioner - 07392863877&lt;/p&gt;\n&lt;p&gt;or Sheilagh McCrossan - East Kent Professional Lead on 07583001490.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Kent Coast or Ashford, Ashford", "postalCode": "TN25 4AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1718", "longitude": ".870966"}}, "title": "Respiratory Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250132", "validThrough": "2020-11-08T23:59:59+0000"}