{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35099", "minValue": "35099", "unitText": "YEAR", "value": "£20.88 ph"}}, "datePosted": "2020-10-27T13:29:25+0000", "description": "&lt;p&gt;&lt;strong&gt;We’re looking for an Assistant Trust Secretary/Office Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for someone to help provide the support for the staff in the Trust Head Office.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;West Hertfordshire Hospital Trust West Hertfordshire Hospitals NHS Trust provides acute healthcare services to a core catchment population of approximately half a million people living in west Hertfordshire and the surrounding area.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Who work as a team to provide a high-level service? If yes, West Hertfordshire Hospital Trust is the place for you.&lt;/p&gt;\n&lt;p&gt;We have placement opportunities available for an &lt;strong&gt;Assistant Trust Secretary / Office Manager&lt;/strong&gt; available at &lt;strong&gt;Watford General Hospital.&lt;/strong&gt; &lt;strong&gt;Starting 14th December.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Responsibilities will cover several areas such as;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full management of Board and Committee meeting arrangements, including the coordination of the corporate meetings schedule; setting, preparing and distributing high quality agendas and papers, in a timely manner, often under tight time restraints;&lt;/li&gt;\n&lt;li&gt;Quality checking agendas, reports and papers to ensure they meet with the Trust’s corporate governance standards;&lt;/li&gt;\n&lt;li&gt;Deputising for the Trust Secretary to provide advice on corporate governance issues and statutory and regularly requirements;&lt;/li&gt;\n&lt;li&gt;Line management responsibility for the executive secretariat, ensuring that a full and comprehensive service is maintained within the trust management offices. This includes providing support, setting and reviewing individual and team performance standards and managing training requirements, annual and sickness leave and appraisals;&lt;/li&gt;\n&lt;li&gt;Arranging presenters, organising refreshments and the preparation of the room on the day of a Board and committee meeting, as well as all other aspects which ensure that meetings run smoothly and efficiently;&lt;/li&gt;\n&lt;li&gt;Attending and taking complex minutes and action notes at high level meetings, such as Board and committees, transcribing them into a formal record of the meeting and dealing with any follow up actions;&lt;/li&gt;\n&lt;li&gt;Managing the corporate governance calendar, including the scheduling of forthcoming meetings for Board and committees and other key governance meetings, distributing e-invitations and updates;&lt;/li&gt;\n&lt;li&gt;Overseeing the overall management of the Trust head offices and undertaking regular inspections to ensure that the premises are maintained in accordance with agreed standards of repair and cleanliness;&lt;/li&gt;\n&lt;li&gt;Maintaining the Trust’s corporate governance structure charts and registers;&lt;/li&gt;\n&lt;li&gt;Drafting high quality documents, briefing papers, reports and presentations;&lt;/li&gt;\n&lt;li&gt;Maintaining the corporate governance web and intranet sites, uploading Board papers and updating information as required;&lt;/li&gt;\n&lt;li&gt;Building and maintaining relationships with senior internal staff, including executive directors and non executive directors.  Also extensive stakeholder liaison with external parties, including clinical commissioning groups, local authorities and other trusts&lt;/li&gt;\n&lt;li&gt;In the absence of the Trust Secretary, dealing with issues that arise, including advising on corporate governance issues, statutory and regulatory requirements and best practice standards;&lt;/li&gt;\n&lt;li&gt;Managing the Trust’s paperless software system by offering help to users, providing training to new users, as well as maintaining an asset register of users, licences and equipment;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Working with the Trust Secretary to draft a corporate governance handbook to provide advice and raise internal awareness of corporate governance arrangements; &lt;/li&gt;\n&lt;li&gt;Maintaining and publishing an up-to-date central conflicts of interest register, including requesting annual returns from directors and senior leader&lt;/li&gt;\n&lt;li&gt;Drafting the Trust’s annual report within the nationally mandated timeframe; &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;This is a temporary, full time role starting 14th December until February 2021 and the working hours are: Monday to Friday, 9 – 5.  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have the following skills …?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Educated to degree level or able to demonstrate equivalent level of knowledge, training and experience in corporate governance&lt;/li&gt;\n&lt;li&gt;ICSA qualified or equivalent level of knowledge, training and experience in corporate governance&lt;/li&gt;\n&lt;li&gt;Good understanding of corporate governance&lt;/li&gt;\n&lt;li&gt;Understanding of confidential and professional standards&lt;/li&gt;\n&lt;li&gt;Excellent working knowledge of Microsoft Office packages&lt;/li&gt;\n&lt;li&gt;Working within a corporate governance environment&lt;/li&gt;\n&lt;li&gt;Extensive experience of taking minutes at executive and senior level meetings&lt;/li&gt;\n&lt;li&gt;Experience of line management of staff&lt;/li&gt;\n&lt;li&gt;Experience of managing complex projects/event managements&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to hearing from you soon.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Assistant Trust Secretary/Office Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244721", "validThrough": "2020-11-10T23:59:59+0000"}