{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata)"}}, "datePosted": "2020-11-04T10:16:14+0000", "description": "&lt;p&gt;&lt;strong&gt;An excellent opportunity to work within Mental Health Crisis Services that has been rated as “OUTSTANDING” &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Access &amp; Home Treatment teams will soon be part of a new Crisis Care Centre, at Harplands Hospital, Stoke-on-Trent this has been designed to the highest level of specification. This modern purpose designed unit will be the central point for all those in need of a Crisis Assessment/Intervention, teams within the Crisis Care Centre will include Mental Health Access Team, Home Treatment Team, High Volume Users Team and to provide a place of safety for those detained on a Section 136.&lt;/p&gt;\n&lt;p&gt;Our Trust is on an incredible journey of innovation and we’d like you to be part of it. To excel you will be an enthusiastic, caring and compassionate registered professional who is looking to work within a Trust that is ambitious to perform well and has been told by the Care Quality Commission that it is the fastest improving mental health Trust in the country. Whether you are about to qualify, newly qualified or an experienced practitioner, we want to meet you and discuss the possibility of you joining this great multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Our vision is ‘To be Outstanding in all we do and how we do it.’ Our teams pride themselves on compassion, team work and resilience. The Trust supports you by offering a flexible shift system including twilight shifts and compressed hours to support working families and our staff parking is free on all our main sites.&lt;/p&gt;\n&lt;p&gt;The Centre opened in October 2019 and this new facility has state of the art facilities that offer the highest level of care. All our team members are trained and skilled to deliver comprehensive mental state assessment and evidence based interventions as well as having an awareness of services across the local landscape to support recovery. Individual personal development will be offered with regular values based supervision.&lt;/p&gt;\n&lt;p&gt;You can expect Continuing Professional Development (CPD) which is tailored to meet your professional development; individual CPD advice is available from our Practice Education Team. The CPD offer includes the option to rotate within the Trust to widen your breadth of experience, skills and knowledge.&lt;/p&gt;\n&lt;p&gt;On joining the Trust you will have access to our Preceptorship Programme to enable a smooth transition into your new role.&lt;/p&gt;\n&lt;p&gt;If you would like to arrange an informal visit prior to making an application please call Sandra Wright – details below. Otherwise please submit your application and we guarantee an interview for all Qualified practitioners with relevant mental health experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sandra Wright&lt;/p&gt;\n&lt;p&gt;Sandra.wright@combined.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120881.jpg", "name": "North Staffordshire Combined Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120881"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke-on-Trent", "postalCode": "ST4 6TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0007", "longitude": "-2.20991"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255339", "validThrough": "2020-11-18T23:59:59+0000"}