{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa inc"}}, "datePosted": "2020-10-23T15:31:20+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 7 IR/CT Radiographer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a fantastic opportunity for two enthusiastic and motivated Radiographers to join our IR/CT Team at Charing Cross Hospital. Our busy department houses 2 bi-plane interventional rooms (Philips Allura and Azurion) and 2 Siemens 128 slice Definition AS CT scanners.&lt;/p&gt;\n&lt;p&gt;You will form part of a dedicated IR/CT team providing excellent patient care and radiographic expertise in neurological and general interventional and CT procedures. This includes cerebral thrombectomy (we are proud to be the leading national provider), neuro embolisations, TACE and RFA. This specialised role will offer the opportunity to build and extend on your clinical expertise and also develop your management, training and leadership skills. You will work closely with radiologists, nurses and other multi-disciplinary teams within the Trust. We recognise that education and training is fundamental and support role extension and further learning.&lt;/p&gt;\n&lt;p&gt;The Imaging department at Charing Cross Hospital offers a comprehensive range of procedures over all modalities in both clinical and research fields. As part of the first Academic Health Science Centre, our aim is to provide world-class healthcare to our patients through excellence in research, education and training. The sites within the Trust are recognised as specialist centres for Renal Transplant, Cardiology, Major Trauma, Hyper-acute Stroke, Paediatrics, and Respiratory Medicine.&lt;/p&gt;\n&lt;p&gt;Imperial College Healthcare NHS Trust comprises of five hospitals – Charing Cross, Hammersmith, St Mary’s, Queen Charlottes and Chelsea and the Western Eye Hospital – and integrating with Imperial College London, offers 50 clinical specialties and has one of the largest portfolios in the country.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting: w/c 9/11/20&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: w/c 16/11/20&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Uyen Attrill, Lead IR Radiographer - Uyen.Attrill@nhs.net or Kannah Vasishtan, Lead CT Radiographer – Kannah.Vasishtan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charing Cross Hospital, London", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Band 7 IR/CT Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241118", "validThrough": "2020-11-08T23:59:59+0000"}