{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa pro rata"}}, "datePosted": "2020-10-30T09:37:02+0000", "description": "&lt;p&gt;We serve a population of 189,000 spread across 850 square miles of Herefordshire. We offer a wide range of in-patient and community mental health services covering all ages including Child &amp; Adolescent Mental Health, Perinatal, Working Age and Older People Services. In the most recent CQC inspection the organisation retained its overall rating of good amongst which several services were rated as outstanding.&lt;/p&gt;\n&lt;p&gt;Herefordshire Mental Health &amp; Learning Disability services employ approximately 400 staff currently.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Recent service developments have included perinatal mental health, personality disorder/complex trauma, liaison &amp; diversion services and Individual Placement and Support Services. We are an innovative forward looking organisation keen to work with people in our aim to improve outcomes for people with mental health and learning disabilities of all ages.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;BENET BUILDING, HEREFORD&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Psychologist – Neurodevelopmental Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;22.5 hours per week over 3 days per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a Clinical Psychologist looking to join a growing team of vibrant and supportive Psychologists who have a key role in delivering specialist psychological interventions, supervision, leadership and consultation/training. As a team of psychologists we are committed to supporting staff to maintain a health work-life balance, a culture of continuous learning and opportunities for staff to develop their skills and interests through training and innovative practice. As part of the psychology team you would work closely with psychology colleagues and offer psychological expertise to the neurodevelopmental team in the Herefordshire CAMHS Service, providing assessment, psychological intervention, consultation and training. We are currently reviewing our care pathway for ASD assessments and you would be integral in the review and development of the pathway. Whilst skills and experience in this area is desirable, applications from newly qualified Psychologists with a passion in this area would be welcome. The Trust offers perceptorship opportunities for newly qualified Psychologists. Training, supervision and leadership development is available to support the postholder.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder would be part of Herefordshire CAMHS which is a supportive and vibrant team which values innovative thinking, client centered care and a desire to make a difference. You would be working within a dedicated team of Psychologists and other professionals and have ample opportunity to receive and offer supervision, CPD and develop your leadership role. The services actively supports training and professional development and has expertise in a wide vary of therapeutic approaches including Systemic practice, ACT, CFT, CAT, CBT, EMDR, DDP and Theraplay. Psychologists are highly respected in the service and relationships are excellent between psychologists, our multi-disciplinary colleagues and senior management.&lt;/p&gt;\n&lt;p&gt;There are good links with local clinical training courses in Birmingham and Coventry &amp; Warwick Universities, and regular opportunities to supervise trainee psychologists and contribute to training on the training courses.&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced Clinical Psychologist, registered with HCPC, to work autonomously within professional guidelines and the overall framework of the team’s policies and procedures.&lt;/p&gt;\n&lt;p&gt;Herefordshire is a predominately rural county with small market towns and transport links to the city of Hereford. The area offers excellent living and working prospects and a rich cultural life. Nearby are the Wye Valley AONB, the Forest of Dean, the Malvern Hills, the Brecon Beacons National Park and easy access to the M50 and M5. A thriving Arts Centre (The Courtyard) and good schools and colleges contribute to making Herefordshire a great place to live.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all mandatory training including PBM (subject to Occupational Health Clearance). Any training requirements should also be including in the Job Description/Person Specification. In line with national developments and the Transformation of CAMHS, there is a possibility that there will be a requirement for some weekend on call working as part of an urgent care rota.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We welcome informal expressions of interest and would be keen to chat over what this exciting post involves and how it fits with our wider aspirations for our service.&lt;/p&gt;\n&lt;p&gt;Please get in contact with Claire Middle, 01432 842233, claire.middle@nhs.net if you would like to find out more about this opportunity or arrange an informal chat.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Herefordshire Mental Health and Learning Disabilities Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR2 9RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0391", "longitude": "-2.75472"}}, "title": "CAMHS - Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249513", "validThrough": "2020-11-16T23:59:59+0000"}