{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T14:01:30+0000", "description": "&lt;p&gt;&lt;span&gt;Applications are invited from enthusiastic, innovative, motivated and suitably qualified individuals for the post of Band 5 Clinical Shift Leader for the Swansea Bay University Health Board COVID Contact Testing Units. The roles will be based in the Liberty Stadium, Plasmarl, Swansea, SA1 2FA with the requirement to travel between sites across the Health Board.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role is full time 37.5 hours. Please note that the service currently runs over 7 days per week and some weekend working may be required. Service provision is subject to review and may change.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An understanding of confidentiality is essential. Experience of working within the NHS as well as knowledge of Health Systems is desirable, but an enthusiastic attitude and willingness to learn is also very important.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The applicant must be an &lt;/span&gt;NMC registered qualified nurse, educated to degree level or able to demonstrate the equivalent level of knowledge, skills and experience.&lt;/p&gt;\n&lt;p&gt;The ideal candidate would also have significant experience in relevant field at band 5, experience of managing clinical scenarios and experience of supervising others. The ability to travel between sites independently is critical.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful individual will need to be a hard working, team player with good verbal and written communication skills. The applicant will be required to have a flexible approach towards the needs of the service and be able to travel between sites in a timely manner.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ability to prioritise work to meet deadlines and the ability to work without supervision is essential for this post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ability to speak Welsh is desirable for this post; English and / or Welsh speakers are equally welcome to apply.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Ruth Gates&lt;/p&gt;\n&lt;p&gt;Job title: Learning and Development Project Manager&lt;/p&gt;\n&lt;p&gt;Email address: ruth.gates@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01792 530631&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SBUHB Headquarters, Neath Port Talbot", "postalCode": "SA12 7BR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6134", "longitude": "-3.81599"}}, "title": "Clinical Shift Leader - Covid Testing Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242809", "validThrough": "2020-11-09T23:59:59+0000"}