{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum excl HCAs"}}, "datePosted": "2020-10-30T14:46:13+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;District Nursing Deputy Team Manager, Band 6&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Whittington Health delivers District Nursing Services across the boroughs of Islington and Haringey. Both boroughs are diverse, vibrant and exciting places to work with excellent transport links and fantastic opportunities to develop your skills. Our District Nursing Service is forward thinking, hardworking and dynamic which we pride ourselves on. &lt;br /&gt;&lt;br /&gt;We are offering the following:&lt;br /&gt;&lt;br /&gt;• Additional payments for working out of hours and weekends&lt;br /&gt;• Leadership development opportunities &lt;br /&gt;• Full time part-time or flexible posts available &lt;br /&gt;• The option of working in either Haringey or Islington &lt;br /&gt;• The option of working in the day team or twilight team&lt;br /&gt;• Help to agree accommodation if required&lt;br /&gt;• Access to a fleet of electric cars&lt;br /&gt;• All community nurses are issued with IPADS and mobile phones&lt;br /&gt;&lt;br /&gt;The recent CQC report rated the Whittington NHS services as &#39;Good&#39; with &#39;Outstanding&#39; for caring. The District Nursing Service has received National Awards during 2018 for innovations to support all nurses using ground-breaking technology whilst mobile working.&lt;br /&gt;&lt;br /&gt;District and Community nurses visit people who are housebound of all ages 18+ in their own homes or residential homes, enabling them to self-manage where possible and implementing appropriate treatments and care pathways. Our service operates on a 24 hour basis so if you are looking for a working pattern that suits your life pattern. We currently have Deputy Team Manager posts in our day and evening teams and offer part time, full time and flexible working patterns. &lt;br /&gt;&lt;br /&gt;This is an excellent opportunity for nurses who have met their competencies at band 5 level. Those who have already worked in District Nursing or would like to make the move to the community setting and further develop both their management and senior clinical skills. You will need to be self-motivated, an excellent communicator, both a leader and a team player with the drive and determination in case management and supporting the team manager to lead delivery of high quality nursing care for your team within an integrated care organisation. &lt;br /&gt;&lt;br /&gt;All successful candidates will have the opportunity to develop skills in nurse prescribing, leadership and management as well as ongoing training, support, clinical supervision and a clear career pathway, with support from their team manager and Lead District Nurse and the District Nursing Professional Development Team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;We encourage informal visits and discussions about the post. If you would like to arrange this please contact our District Nursing recruitment line on 020 3074 2506 or email whh-tr.dnrecruitment@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Islington &amp; Haringey, District Nursing", "postalCode": "N19 5NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5667", "longitude": "-.138149"}}, "title": "District Nursing Deputy Team Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250622", "validThrough": "2020-11-15T23:59:59+0000"}