{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754"}}, "datePosted": "2020-11-06T10:46:47+0000", "description": "&lt;p&gt;We are seeking to appoint a Winter Manager within Operations. This is a key operational role within Northern Lincolnshire and Goole NHS Foundation Trust to lead and have overall responsibility for creating daily capacity. The successful candidate will work closely with divisional triumvirate teams and will provide expert advice to enable efficient patient flow through the hospital system and wider healthcare system. This may involve addressing barriers to discharge or working closely with internal and external teams to avoid admission&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for a suitably experienced leader to join our organisation and make a real difference for our patients by working closely with colleagues to ensure optimal hospital performance.&lt;/p&gt;\n&lt;p&gt;The Winter Manger will be central in managing escalation and surge, and will lead on all daily operational oversight on patient flow on behalf of the Deputy COO, ensuring that proactive plans are in place to anticipate peaks in demand. In addition to daily operational responsibilities the successful post holder will be responsible for strategic future planning of operational delivery spanning across peak pressure periods.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a credible and experienced healthcare leader, with experience of leading surge management winter planning, and will posses highly developed interpersonal skills.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Hansen, Deputy Director of Operations&lt;/p&gt;\n&lt;p&gt;claire.hansen@nhs.net&lt;/p&gt;\n&lt;p&gt;03033 305908&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe/Grimsby", "postalCode": "DN15 7BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5875", "longitude": "-.666943"}}, "title": "Winter Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259292", "validThrough": "2020-11-19T23:59:59+0000"}