{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. prorata"}}, "datePosted": "2020-10-23T13:00:58+0100", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An opportunity has arisen for two Project Managers to join the Capital Planning &amp; Development Team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Over recent years the wider team has successfully delivered a range of capital schemes including ward refurbishments, new operating theatres, replacement scanners and Linear Accelerators. Your role within the team will be to support the project lead, taking project management responsibility for designated items throughout the project life cycle.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an experienced, dedicated and enthusiastic individual who has past experience of working as part of a project team, ideally in a healthcare environment and have evidence of previous capital projects work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have experience of assisting with the management of projects through the full project life cycle and have an understanding of the commissioning process defined in the NHS Estates Capital Investment Manual.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have good communication skills, both written and verbal, be comfortable attending meetings and leading discussions relevant to your designated work streams.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You should be personable to maintain and develop relationships with key stakeholders, both internal and external, as these links are vital when delivering multiple projects within the Team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Above all else, you must recognise that all the projects we deliver ultimately impact our patients, be it directly or indirectly, therefore care and attention to detail is paramount to ensure health and safety standards throughout the project life cycle.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This vacancy closes on: 15th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;/p&gt;\n&lt;p&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;/p&gt;\n&lt;p&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/p&gt;\n&lt;p&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatherine FitzwilliamsJob titleCapital Programme ManagerEmail addressKatherine.Fitzwilliams@addenbrookes.nhs.ukTelephone number01223 216445&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital - Division Corporate, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240631", "validThrough": "2020-11-15T23:59:59+0000"}