{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-11-02T09:31:20+0000", "description": "&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for a senior nurse to manage a busy Haematology &amp; Oncology Day Unit. We are looking for an enthusiastic nurse who can work dynamically and at a fast pace to ensure safe and effective care delivery. We have close links with Hope for Tomorrow who support by the loan of 2 Mobile Cancer Care Units. The successful candidate will have a clear vision of how they will manage the unit through a period of change and ensure staff development is delivered as we continue to adapt to new ways of working. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Friday 13th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: Friday 20th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Any offer of employment for this post will be subject to the Trust being satisfied that the result of an enhanced disclosure of criminal convictions, including checks for the Protection of Children/Vulnerable adults, does not indicate that you are unsuitable for the post.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you are successful, as a condition of your employment you must provide us with your original DBS Disclosure Certificate prior to commencing in post as part of the pre-employment check process unless you are registered with the DBS Update Service in which case you can provide us with your surname, date of birth and certificate number to enable us to complete a status check.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you are offered a position which requires you to undertake a Disclosure &amp; Barring Service (DBS) check, the Trust will administer the DBS check on your behalf and will recover the cost (Enhanced £44 or Standard £26) from your first full months salary. This is a condition of your employment.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;You are encouraged to participate in the DBS Update Service and pay the £13 cost per year. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The Probation Policy is attached to all adverts on NHS Jobs as part of the job pack, in order that prospective candidates are aware of the need to complete a 6 month probation period and also the details of how the policy operates.&lt;/p&gt;\n&lt;p&gt;You should complete the application form as fully as possible, including any information which may help us judge your suitability for the post. Experience outside of paid employment, such as voluntary work or caring responsibilities, may be as relevant as paid employment. You will also need to ensure that the references you provide for this position cover the last three years of employment/voluntary work or training and that they are from someone who has had direct line management responsibility for yourself.&lt;/p&gt;\n&lt;p&gt;If you have a disability which makes it difficult for you to complete an application form, then we are happy to accept alternative methods of providing the required information. Please contact us to discuss this.&lt;/p&gt;\n&lt;p&gt;Forms received after the closing date will not usually be considered unless by prior agreement. In the event of exceptionally high levels of response, we reserve the right to close the post before the date stated above in order to prevent the number of applications received being unmanageable. You are advised to submit your completed application form as soon as possible to have the best chance of being considered.&lt;/p&gt;\n&lt;p&gt;Please note that if successfully shortlisted for this role, all communication will be in electronic format where possible (e.g. Invite to Interview). Therefore please ensure that you regularly check your email/NHS Jobs account. Please be aware that depending on your email provider these emails may automatically go into your junk folder.&lt;/p&gt;\n&lt;p&gt;In order to keep administration costs at a minimum, we do not write to candidates who are not shortlisted. May we take this opportunity, therefore, to thank you for your interest in working with us at Airedale NHS Foundation Trust and hope that, if you are unsuccessful on this occasion, it will not deter you from applying to us again in the future.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE READ THE ‘IMPORTANT INFORMATION FOR APPLICANTS’ DOCUMENT AVAILABLE ON NHS JOBS AS SUPPORTING INFORMATION.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicky DenbowJob titleMatronTelephone number01535 292128Additional contact information&lt;/p&gt;\n&lt;p&gt;Thank you for your interest in the above post. It is with pleasure that we enclose further details. If you would like to discuss the post in more detail or arrange an informal visit, please contact Nicola Denbow, Matron, 01535 292128&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Airedale NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120636"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Airedale General Hospital, Keighley", "postalCode": "BD20 6TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.898", "longitude": "-1.9627"}}, "title": "Senior Sister - Haematology &amp; Oncology Day Unit (Band 7)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251421", "validThrough": "2020-11-13T23:59:59+0000"}