{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-28T14:26:44+0000", "description": "&lt;p&gt;University College London Hospital are seeking a Band 7 MRI Radiographer to join their S. This is a Monday to Friday role, 9am to 5pm, working regular hours on a temporary basis.&lt;/p&gt;\n&lt;p&gt;Are you a highly motivated and skilled MRI radiographer with an extensive background in Neuro/MSK/general MRI to register with us and work shifts at UCLH NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Trust is one of the designated Hyper-Acute Stroke Units in London and imaging will form an integral part of the patient pathway. The Imaging Department has a comprehensive range of state of the art equipment, including 5 MRI scanners (three 1.5T and two 3T), 3 CT scanners, a digital Intervention Suite and 9 digital X-ray rooms all fully integrated with PACS allowing you to not only work with a highly reputable trust within the NHS, but also enable you to work with some of the most cutting edge technology and techniques.&lt;/p&gt;\n&lt;p&gt;Benefits of joining the UCLH Staff Bank include;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Opportunities to work across all UCLH services gaining invaluable experience&lt;/li&gt;\n&lt;li&gt;Access to “Lines of Work” (guaranteed short, medium or long term shifts)&lt;/li&gt;\n&lt;li&gt;Priority of shifts over agency workers, accommodating your availability&lt;/li&gt;\n&lt;li&gt;Self booking system&lt;/li&gt;\n&lt;li&gt;Weekly pay with electronically submitted timesheets&lt;/li&gt;\n&lt;li&gt;A designated onsite co-ordinator to offer on-going support&lt;/li&gt;\n&lt;li&gt;A professional compliance team ensuring you are always available to work&lt;/li&gt;\n&lt;li&gt;A bookings team to ensure you work when and wherever you want to&lt;/li&gt;\n&lt;li&gt;Free Mandatory Training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please apply directly a member of the recruitment team will contact you shortly.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank - MRI Radiographer Band 6/7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246971", "validThrough": "2020-11-27T23:59:59+0000"}