{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-23T10:32:14+0100", "description": "&lt;p&gt;&lt;strong&gt;Inpatient Occupational Therapist Orthopaedics and Surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a friendly, enthusiastic and innovative Occupational Therapist to join our sociable and dynamic team. Due to staff progression we have an opportunity to re design our service and have a post for Trauma,Orthopaedics and Surgery&lt;/p&gt;\n&lt;p&gt;If you are looking to specialise in Orthopaedics ,Trauma and Surgery we would love to hear from you. We would encourage applications from band 5’s looking for progression and Band 6’s looking to further develop within these specialities. As long as you have a willingness to learn and adapt to change, we can support you in managing the band 6 role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Trauma and Orthopaedic&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;These wards cover both trauma and elective cases which would include pre assessment of THR patients and complex elective cases as referred, and working closely with the Enhanced Recovery Team. You will also gain experience on the fractured NOF unit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; General surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;These wards include a caseload of colorectal, head and neck, urology and breast patients. We also receive patients post critical care for rehab.&lt;/p&gt;\n&lt;p&gt;There is an expectation that the successful candidate will provide cover across the specialities as needed and will be supported to upskill as required.&lt;/p&gt;\n&lt;p&gt;You will be required to work with other qualified and non-qualified staff to provide a seven day service including Bank Holidays, with a commitment of 1 in 4 weekends with days off in lieu. A service review to consider the provision of an extended service is currently ongoing.&lt;/p&gt;\n&lt;p&gt;This post will allow you to develop a wide range of clinical, managerial, organisational, teaching and supervision skills. You will play an active role in audits and service development. We offer a well-established supervision and appraisal structure. We encourage individual progression within the Band 6 role and have a firm commitment to in service training and CPD as well as supporting staff to attend relevant external courses and conferences.&lt;/p&gt;\n&lt;p&gt;The Luton and Dunstable Hospital Therapy Department are a friendly, forward thinking and innovative department with a well-established Clinical Governance programme and a focus on developing staff.&lt;/p&gt;\n&lt;p&gt;Interview date: will likely be 2 weeks after the job closes&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Cathy O’Mahony, Occupational Therapy and Physiotherapy Manager – In-Patients on 01582 497048 or e-mail cathryn.omahony@ldh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust (formerly known as The Luton and Dunstable NHS Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Luton and Dunstable Hospital, Luton", "postalCode": "LU4 0DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8942", "longitude": "-.474244"}}, "title": "Inpatient Senior Occupational Therapist - Orthopaedics/Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240076", "validThrough": "2020-11-06T23:59:59+0000"}