{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-27T13:16:04+0000", "description": "&lt;p&gt;This is an exciting opportunity to work as part of a multi-disciplinary team within Child and Adolescent Mental Health Services (CAMHS). As part of the team you will take a leadership role in the delivery of high quality service provision that promotes and improves the mental health and well-being of children and young people, their families and carers. Working within a systemic and holistic framework you will undertake needs led, evidence based, highly skilled assessments and therapeutic interventions with children and young people.&lt;/p&gt;\n&lt;p&gt;We are looking for a Registered Mental Health Nurse or experienced Social Worker to become part of a thriving Tier 3 CAMHS team that provides care across the North West of Wales. The successful candidate will be enthusiastic, self-motivating, have the ability to case manage, work autonomously and as part of a Multi Disciplinary Team (MDT) displaying excellent interpersonal and communication skills in order to establish good working relationships essential to the success of the service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will also be expected to meet the service need where appropriate and participate in additional service tasks such as the Single Point of Access and provide support to general Tier 3 CAMHS, completing assessments and partnership work in line with the Choice And Partnership Approach (CAPA) service model, and crisis cover over 7 days a week as service need requires.&lt;/p&gt;\n&lt;p&gt;A means of transport is essential and applicants must be willing to undergo an enhanced DBS check.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 10/11/2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Carys Ellis- Team Lead CAMHS&lt;/p&gt;\n&lt;p&gt;Carys.ellis@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 03000850037&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Talarfon Bangor, Bangor", "postalCode": "LL57 2EE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2255", "longitude": "-4.13486"}}, "title": "CAMHS Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244682", "validThrough": "2020-11-10T23:59:59+0000"}