{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-10-20T11:46:55+0100", "description": "&lt;p&gt;Are you a Secretary looking for a new challenge? Then read on…&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a part-time medical secretary to our Medium Secure Intensive Care and High Dependency Unit (MSICU). The MSICU provides enhanced care and treatment for patients who cannot be managed safely in an acute unit setting within conditions of medium security and/or cannot be managed within an intensive care unit setting, within adult intensive care services across the Midlands.&lt;/p&gt;\n&lt;p&gt;The role provides a comprehensive administrative support service to the Consultant Psychiatrist and the clinical team assisting them with the smooth delivery of their services to this important client group. It is a busy and varied post, which will be stimulating, rewarding and challenging, working for our Forensic Services.&lt;/p&gt;\n&lt;p&gt;The successful applicant must be resilient, flexible, able to work under pressure, possess excellent organisational, communication and interpersonal skills, together with the ability to prioritise workload on a daily basis and with the added ability to contend with various forms of distressing material.&lt;/p&gt;\n&lt;p&gt;BSMHFT is an employer committed to Equal Opportunity and Improving Working Lives for all our staff members.&lt;/p&gt;\n&lt;p&gt;So, if you have secretarial experience, proficient keyboard skills and able to transcribe notes from digital dictation, in addition to being able to handle telephone queries, hold a minimum of RSA II or equivalent and have experience of Microsoft Packages then this could be the role for you.&lt;/p&gt;\n&lt;p&gt;We will be willing to train and develop skills as appropriate. AMSPAR Diploma is desirable.&lt;/p&gt;\n&lt;p&gt;Please ensure you read the job description and person specification attached and that your supporting information reflects this, as your application will be judged against these criteria.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBarbara MillsJob titleAdmin ManagerEmail addressbarbaramills@nhs.netTelephone number0121 301 3171&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reaside Clinic, Birmingham", "postalCode": "B45 9BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4002", "longitude": "-2.00833"}}, "title": "Band 4 Forensic Psychiatric Medical Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234237", "validThrough": "2020-11-06T23:59:59+0000"}