{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30279", "minValue": "30279", "unitText": "YEAR", "value": "up to £30,279.24"}}, "datePosted": "2020-11-05T16:24:25+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Job Title: Staff Nurse &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Location: Whittington&lt;/p&gt;\n&lt;p&gt;Department: Advice and Referral Centre&lt;/p&gt;\n&lt;p&gt;Salary: up to £30,279.24&lt;/p&gt;\n&lt;p&gt;Working hours: Full time hours to be worked over a seven day week, to include evening working&lt;/p&gt;\n&lt;p&gt;Application review date: 27th November 2020&lt;/p&gt;\n&lt;p&gt;Interview Date: Tbc&lt;/p&gt;\n&lt;p&gt;About the role:&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Staff Nurse in the Advice and Referral Centre based at St Giles Hospice, Whittington. The Centre supports patient care through telephone triage of new patients who have palliative care needs. You will be the first point of contact for referrals into the hospice, providing initial telephone assessment to determine patient/family requirements, urgency and nature of need and direct to appropriate services.&lt;/p&gt;\n&lt;p&gt;You will provide telephone, email and face to face support and advice through the advice line to patients, carers, the public and health and social care professionals.&lt;/p&gt;\n&lt;p&gt;The Centre also plays a key role in coordination of admissions to the Inpatient Unit.&lt;/p&gt;\n&lt;p&gt;You will need to have excellent clinical and communication skills particularly in handling telephone calls in a timely and compassionate manner.&lt;/p&gt;\n&lt;p&gt;We would welcome applications from nurses with NMC Registration who have a commitment to provide expert palliative care, have strong team-working attributes and are calm under pressure. You will have good I.T. skills and be organised in your approach to your workload. Experience of hospice/palliative care is essential and applicants must have 12 months post registration experience working in a healthcare environment.&lt;/p&gt;\n&lt;p&gt;Company benefits:&lt;/p&gt;\n&lt;p&gt;To reward the hard work of our fantastic staff, St Giles Hospice offers an excellent benefits package as per the below&lt;/p&gt;\n&lt;p&gt;-27 days’ annual leave plus bank holidays (rising to 35 days with service)&lt;/p&gt;\n&lt;p&gt;-Contributory pension scheme&lt;/p&gt;\n&lt;p&gt;-Free car parking&lt;/p&gt;\n&lt;p&gt;-Training &amp; Development opportunities as well as progression within the organisation&lt;/p&gt;\n&lt;p&gt;About us:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;St Giles Hospice is a registered charity with a CQC rating of Outstanding&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;, &lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;providing high-quality medical and nursing care for local people living with cancer and other serious illnesses, as well as offering support for their families and helpers. Care is offered in a variety of ways according to the individual’s needs and is offered out in the community as well as from 3 sites, an inpatient unit at Whittington, with other day unit facilities at Sutton Coldfield, and Uttoxeter. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We receive funding from the NHS but primarily we rely on fundraising activities and legacies, together with trading activities (Shops, Lottery and other trading) to support our work. We employ more than 400 people across a broad range of roles – from direct patient care to fundraising and administration as well as support from over 1500 volunteers to provide our services.&lt;/p&gt;\n&lt;p&gt;Further details:&lt;/p&gt;\n&lt;p&gt;To find out more or have an informal chat please contact Jackie Sutton, Clinical Lead – Advice and Referral Centre on 0300 330 9410.&lt;/p&gt;\n&lt;p&gt;This post is subject to a Disclosure and Barring Service (DBS) check&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We may review applications before the application review date, however, if you apply after the application review date, your application may not be considered. We will accept applications until we have successfully filled the role&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;All correspondence in response to applications will be sent via email. Due to the number of applications received, it is not always possible to respond to every application. Therefore, applicants who do not receive a response within 14 days of the review date should assume that they have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;St Giles Hospice, Fisherwick Road, Whittington, Lichfield, WS14 9LH. Registered charity 509014 Company limited by guarantee 1430090&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130216.jpg", "name": "St Giles Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130216"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whittington", "postalCode": "WS14 9LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6712", "longitude": "-1.763"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258547", "validThrough": "2020-11-23T23:59:59+0000"}