{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-20T14:31:21+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a BHRS (or equivalent) qualified Clinical Physiologists, to assist in the delivery of a specialised Cardio Respiratory services to the Trust in particular in the area of Pacing services.&lt;/p&gt;\n&lt;p&gt;Although this is primarily a Pacing position, sessions / training in other areas such as Echo, non invasive and Cath lab (inc ACHD diagnostic catheters) can be offered.&lt;/p&gt;\n&lt;p&gt;You will be an effective member of the Cardio Respiratory team providing a high standard of Cardiac Physiological Services and excellent patient care. It is understood that the post holder may be required to participate in a flexible working hours system.&lt;/p&gt;\n&lt;p&gt;The organisation and control of the service is the responsibility of the Cardiology Clinical Director in conjunction with the Principal Clinical Physiologist. The post holder must report principally to the Lead Clinical Physiologist in charge of the section.&lt;/p&gt;\n&lt;p&gt;Within the Pacing service we undertake daily Pacemaker follow up clinics, remote follow up clinics &amp; Physiologist led pacing pre assessment clinics. We run a busy Brady implant service and a Physiologist lead ILR implant service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to become competent in Physiologist lead ILR implantation under the supervision of the service lead Physiologist / deputy lead Physiologist. Once competent they will then be expected to run their own lists.&lt;/p&gt;\n&lt;p&gt;We also currently provide adult TTE, TOE, DSE, exercise stress echo, contrast echo and Physiologist led bubble echo procedures to the trust. A Physiologist led valve clinic will be starting in the very near future. This is along with a whole host of other invasive and non invasive Cardio Respiratory physiological services in this very bust department.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChristopher StantonJob titlePrincipal PhysiologistEmail addresschristopher.stanton@liverpoolft.nhs.ukTelephone number0151 706 2710Additional contact information&lt;/p&gt;\n&lt;p&gt;Christopher Stanton or Kevin Bailey on 0151 706 2710&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Liverpool University Hospital, Liverpool", "postalCode": "L7 8XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.96481"}}, "title": "Highly Specialist Clinical Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234821", "validThrough": "2020-11-10T23:59:59+0000"}