{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-27T16:15:52+0000", "description": "&lt;p&gt;ISSW Band 5&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Would you value the opportunity to work within a multi-disciplinary integrated team?&lt;/li&gt;\n&lt;li&gt;Do you have experience providing health or social care support to patients in their own homes?&lt;/li&gt;\n&lt;li&gt;Do you have excellent communication skills, with experience prioritising a busy workload?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;An opportunity has arisen for individuals to join the Integrated Senior Support Worker team within the Crisis Response Service across East Sussex on a 6 month Fixed Term Contract.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be working with registered and non-registered colleagues in order to provide flexible and timely social care support to patients referred to the service. The post holders will be required to provide formal line management and supervision to designated Integrated Support Workers (ISW’s) within the team, and will support the shift co-ordinators with day to day operational management of the non-registered aspect of the Crisis Response Service.&lt;/p&gt;\n&lt;p&gt;We would welcome applications from registered and non-registered professionals who would like to develop their skills and experience assessing patients requiring social care support in their own homes. As a registered professional in this role, you would have the opportunity to develop your skills and experience with social care assessment practice and line-management of staff, while utilising your existing clinical skills as required to support the team.&lt;/p&gt;\n&lt;p&gt;The post holders will receive a comprehensive induction to the service in order to support their development into this role.&lt;/p&gt;\n&lt;p&gt;The service hours are 8am to 10pm, Monday to Sunday, and shift patterns offered with these posts are variable.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMagda BarkerJob titleService ManagerEmail addressmagda.barker@nhs.netTelephone number07974 191301&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastbourne and Hastings, Eastbourne and Hastings", "postalCode": "BN21 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.787", "longitude": ".271136"}}, "title": "Integrated Senior Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245379", "validThrough": "2020-11-17T23:59:59+0000"}