{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 pa"}}, "datePosted": "2020-10-21T09:09:04+0100", "description": "&lt;p&gt;Be part of building the future of microbiology services in Mid-Yorkshire!&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint a consultant microbiologist with the opportunity for an experienced consultant to become our Clinical Lead for our UKAS Accredited Department.&lt;/p&gt;\n&lt;p&gt;Our Microbiology department provides a bacteriology, serology and mycology service to the Trust and, from time to time, to our local CCGs (Wakefield and North Kirklees, who commission on behalf of with 400 GPs) as well as infection control support to the South West Yorkshire Partnership NHS Foundation Trust (mental health).&lt;/p&gt;\n&lt;p&gt;The Microbiology laboratory has full accreditation with UKAS ISO (achieved 2017). The laboratory undertakes internal audits and quality assurance, and participates in all relevant NEQAS schemes. The laboratory is accredited for BMS training.&lt;/p&gt;\n&lt;p&gt;We are part of the West Yorkshire Association of Acute Trusts and are working together along with NHSI on building future sustainable and aligned services across West Yorkshire and Harrogate including clinical microbiology. We work closely with infection control and pharmacy especially the Anti-Microbial Pharmacist.&lt;/p&gt;\n&lt;p&gt;This role is an ideal opportunity for personal development within a team and for our new clinical lead, building and developing both team and services in new and innovative ways to provide first rate microbiology services. The consultant post has Royal College approval; we will work with successful applicants to build a leadership portfolio for a consultant wishing to build a clinical lead role with us and are able to offer enhancement opportunities to support career development&lt;/p&gt;\n&lt;p&gt;We have a ‘state of art’, well-equipped purpose built laboratory. We have very experience and highly qualified Biomedical Scientist and we actively encourage training and development. We have a dedicated and highly efficiency team of support staff.&lt;/p&gt;\n&lt;p&gt;Applicants should possess, or be within 6 months of receiving a CCT at the time of the advisory appointments committee.&lt;/p&gt;\n&lt;p&gt;The appointment will be on the basis of the new consultant contract laid down by the Hospital Medical and Dental Staff Terms and Conditions of Service and will be remunerated as appropriate on the salary scale.&lt;/p&gt;\n&lt;p&gt;Should applicants be currently or recently employed in a medical capacity the Mid Yorkshire Hospitals NHS Trust reserves the right to request a reference from the Medical Director and/or Responsible Officer of any previous or current employing organisations.&lt;/p&gt;\n&lt;p&gt;For further information please contact in the first instance Dr. Jenny Thomas – Head of Clinical Service telephone: (01924) 816227&lt;/p&gt;\n&lt;p&gt;This post is subject to a Disclosure Barring Service (DBS) check.&lt;/p&gt;\n&lt;p&gt;The Trust is an equal opportunities employer and operates a no smoking policy.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "CONSULTANT IN MICROBIOLOGY", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235607", "validThrough": "2020-11-30T23:59:59+0000"}