{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inc HCAS"}}, "datePosted": "2020-11-03T09:16:22+0000", "description": "&lt;p&gt;We have a vacancy in Harrow for full time fixed term Band 5 community staff nurse in the School Nursing Team.&lt;/p&gt;\n&lt;p&gt;The School Nursing Service is part of the integrated 0-19 service in Harrow and recognised as delivering an &lt;strong&gt;innovative &lt;/strong&gt;and &lt;strong&gt;progressive&lt;/strong&gt; service. Harrow is a richly diverse outer London Borough, which brings challenges and rewards for practitioners. Harrow is an exciting, dynamic place to work with excellent partnership working with Schools, Children Centre&#39;s and other agencies. If you are enthusiastic and motivated about improving school nursing to ensure positive outcomes for children and young people we want to hear from you!&lt;/p&gt;\n&lt;p&gt;You will hold a first level registration together adult, mental health or child branch, if you are due to qualify in the next few months you are also welcome to apply.&lt;/p&gt;\n&lt;p&gt;You will have the ability to work autonomously as well as part of a skill mixed team.. You will also be flexible, responsive and keen to modernise practice and influence health and Trust polices. You will have enhanced interpersonal skills to identify low protective factors and indicators of abuse and neglect, or anxiety and low confidence in young people at the earliest opportunity and through your skills, you will develop strength based plans of care to build resilience, promote positive wellbeing and improved health outcomes for young people.&lt;/p&gt;\n&lt;p&gt;No two days will be the same when working with young people; every day will have its challenges and successes.&lt;/p&gt;\n&lt;p&gt;We invest in our staff and are passionate about providing the best for service users and our teams. So to support you in providing excellent child and young person centered evidence based practice we offer clinical and safeguarding supervision and a commitment to your on-going professional development. We offer a comprehensive package including&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Preceptorship programme for all newly qualified staff&lt;/li&gt;\n&lt;li&gt;Induction programme for all newly recruited staff&lt;/li&gt;\n&lt;li&gt;Flexible working in line with our Work Life Balance policy&lt;/li&gt;\n&lt;li&gt;Actively encourage staff development and career progression through partner Universities and our Learning &amp; Development team&lt;/li&gt;\n&lt;li&gt;Safeguarding supervision&lt;/li&gt;\n&lt;li&gt;Clinical supervision&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;MyTrust Benefits including; reduced rate membership of local leisure facilities and Child Care Voucher Schemes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;One of the essential criteria for this post is you must have full UK driving license and access to a car.&lt;/p&gt;\n&lt;p&gt;Interview Date: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnne-Marie Inkson-SmithJob titleSchool Nursing Team LeaderEmail addressainkson@nhs.netTelephone number07534266013Additional contact information&lt;/p&gt;\n&lt;p&gt;Anne-Marie Inkson-Smith - School Nurse Team Leader on ainkson@nhs.net or 07534 266013&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Milmans Resource Centre, Harrow", "postalCode": "HA5 5PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5894", "longitude": "-.38093"}}, "title": "Community School Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253244", "validThrough": "2020-11-25T23:59:59+0000"}