{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 per annum"}}, "datePosted": "2020-11-02T11:52:43+0000", "description": "&lt;p&gt;Mid Yorkshire Hospitals NHS Trust is pleased to announce the introduction of these new roles aimed at doctors who are passionate about their practice and their career outside traditional models.  Our posts will combine education and career development with practical patient-facing care.&lt;/p&gt;\n&lt;p&gt;These posts are not recognised UK training posts.  Nevertheless, MYDoc doctors will have a named supervisor and be supported in undertaking scheduled educational opportunities to consolidate and develop alongside their experiential learning, with certificated outcomes or credentialing to support career progression through other routes.&lt;strong&gt;An Introduction to the Division/Specialty from Head of Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for dynamic and motivated doctors to join our department until October 2021 in the first instance.&lt;/p&gt;\n&lt;p&gt;The Department offers a supportive and encouraging environment in which to develop technical and professional skills.&lt;/p&gt;\n&lt;p&gt;Acute General Surgery has recently been reconfigured with all Emergency Surgery based on the Wakefield site. The surgical registrars participate in a 1:14 rota on a full shift.&lt;/p&gt;\n&lt;p&gt;The post holder will work alongside the other speciality registrars and will be expected to actively participate in the day to day running of the General Surgical department and will have the opportunity to attend operating theatre sessions and out-patients clinics.&lt;/p&gt;\n&lt;p&gt;These posts will be part of our cross site “senior trainee” rota – which is compliant with working time regulations and the 2016 junior doctor’s contract, averaging 48 hours per week.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "MYDOC REGISTRAR - GENERAL SURGERY", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251908", "validThrough": "2020-11-30T23:59:59+0000"}