{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T15:01:18+0000", "description": "&lt;p&gt;Multi-skilled Dental Chair Technician&lt;/p&gt;\n&lt;p&gt;Estate &amp; Facilities services provide technical support to clinical services within the Birmingham Community Health Care at Birmingham Dental Hospital and other Community sites within the Trust. The service supports an asset of electro medical equipment covering many medical applications but mainly focused on Dental Chair and hand piece equipment.&lt;br /&gt;&lt;br /&gt;We are seeking to appoint an enthusiastic and self-motivated Dental Chair and Hand Piece Technician to maintain dental equipment. You will be based at Birmingham Dental Hospital, and will be required to support Dental services across all sites within (BCHC) trust&lt;br /&gt;&lt;br /&gt;Your technical medical engineering expertise will enable you to repair, calibrate and test dental chair and equipment used within BCHC premises, and other sites in which we support the operation of dental and medical services. You will be responsible for areas of allocated work i.e. Planned Preventative Maintenance (PPM) schedules which you will ensure are completed on time.&lt;br /&gt;&lt;br /&gt;You will be able to provide evidence of continuous personal development, be highly professional, well organised, solution orientated and capable of working well under pressure. You will be able to work on your own initiative, have good interpersonal skills and a developed ability to work well. You will have an adaptable approach to work and work well within a team as well as having a flexible approach to the needs of the service.&lt;/p&gt;\n&lt;p&gt;A polite and pleasant disposition and the ability to communicate with patients, hospital staff and other team members is essential.&lt;/p&gt;\n&lt;p&gt;You must be qualified with to either a minimum of City &amp; Guilds, HND or HNC in Mechanical - Electronic Engineering. It is essential you have previous specialist experience with the repair and maintenance of specialist medical dental equipment&lt;br /&gt;&lt;br /&gt;This post is 37.5 hours per week, Monday to Friday with the requirement to travel to other sites as necessary in a timely manner.&lt;/p&gt;\n&lt;p&gt;This post is either an internal secondment opportunity or a 12 months or an external opportunity for a fixed term of 12 months&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;IMPORTANT&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePhilip BuddJob titleHead of EstatesEmail addressphilip.budd@bhamcommunity.nhs.ukTelephone number0121 466 6478Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham Dental Hospital, Birmingham", "postalCode": "B5 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.464", "longitude": "-1.89969"}}, "title": "Band 5 Multi-Skilled Dental Chair Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258221", "validThrough": "2020-11-19T23:59:59+0000"}