{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum (dependent on experien"}}, "datePosted": "2020-11-03T10:16:56+0000", "description": "&lt;p&gt;As one of the largest acute Trusts in the UK – and with more than 20,000 employees – Manchester University NHS Foundation Trust (MFT) is on an exciting mission to deliver high-quality care to the people of Manchester, Trafford and beyond. Our vision is to create and deliver a seamless 24/7 service that extends beyond excellent care within our nine hospitals and community services within our Local Care Organisations.&lt;/p&gt;\n&lt;p&gt;Your role will be to lead on the separation, transition and integration of compliance, risk and governance and support the hospital redevelopment&lt;/p&gt;\n&lt;p&gt;You will support the Deputy Director of Facilities and Group Head of Compliance to ensure that the FM services to the whole of the MFT estate are provided in a compliant fashion, with all known risks recorded and appropriately managed; and that the Trust structure is statutorily compliant. Reporting to the Deputy Director of Facilities / Group Head of Compliance, provide processes, structures and procedures for the site-based Compliance Teams to ensure that the FM services (primarily Hard FM and decontamination services) are provided by the in-house teams and other FM service providers in a compliant manner.&lt;/p&gt;\n&lt;p&gt;You will support the development of compliance-based services in line with Department of Health strategy and guidelines and liaise with the Trust’s Property &amp; Estate Development team to ensure that development schemes and life-cycle replacement of the estate are carried out in a compliant fashion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTBC&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Compliance Manager Estates and Facilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253409", "validThrough": "2020-11-18T23:59:59+0000"}