{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £30,401 - £37,267 per annum"}}, "datePosted": "2020-10-23T13:30:47+0100", "description": "&lt;p&gt;Are you looking to join a thriving and friendly dietetic department within a large acute teaching hospital in the North West of England? This is an exciting opportunity for a highly motivated Dietitian to join our team and become a core member of the critical care dietetics team&lt;/p&gt;\n&lt;p&gt;Lancashire Teaching Hospitals provides district general hospital services to 370,000 people in Preston and Chorley, and tertiary care to 1.5 million people across Lancashire and South Cumbria. We are the regional specialist centre for major trauma, oncology, neurosurgery, neurology, plastic surgery and burns, vascular surgery and renal services. Preston is a lively University City with good motorway and train links to the North’s major cities of Manchester, Liverpool and the Lake District&lt;/p&gt;\n&lt;p&gt;The critical care unit which is on the Royal Preston hospital site currently has a bed base of 24 beds with on going expansion planned. The unit is now housed in a brand new building with state of the art facilities.&lt;/p&gt;\n&lt;p&gt;The Department of Nutrition and Dietetics is part of the Integrated Nutrition and Communication services which also includes the Nutrition Nurse Team and the Department of Speech and Language Therapy&lt;/p&gt;\n&lt;p&gt;You will be well supported by our team of over 30 enthusiastic and forward-thinking Registered Dietitians, Dietetic Support Workers and clerical staff to ensure that you are able to deliver safe and high quality patient care. Opportunities for continuing professional development are available. You will have the opportunity to contribute to service development though audit and patient involvement. You will also participate in the clinical education of B and C placements for Student Dietitians.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKate castelliJob titleteam leader dietitianEmail addresskate.castelli@lththr.nhs.ukTelephone number01772522467Additional contact information&lt;/p&gt;\n&lt;p&gt;Anne Carter : Adult Team Lead Dietitian - 01772 522467 / anne.carter@lthtr.nhs.uk&lt;/p&gt;\n&lt;p&gt;Pam Coulthurst : Head of dietetics - 01772522467 / Pamela.coulthurst@lthtr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Specialist Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240714", "validThrough": "2020-11-08T23:59:59+0000"}