{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "dependent on experience"}}, "datePosted": "2020-11-04T10:31:19+0000", "description": "&lt;p&gt;Be Part of Our Team ... A Great Place to Work&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) Trust Bank manages around 14,000 shift requests each month supporting over 100 clinical services, across our community in people&#39;s homes, health centres, clinics and a range of inpatient facilities.&lt;/p&gt;\n&lt;p&gt;The Trust’s Temporary Staffing Department (Trust Bank) re looking to recruit a Senior Clinical Manager who is passionate about supporting our Trust objective of delivering ‘Safe High Quality Care’ within our bank and agency workforce. The successful applicant will be responsible for bank worker engagement and monitoring standards of care, clinical leadership and Divisional engagement and ensuring that trust and professional standards are maintained at all times.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have the knowledge and experience to support with clinical decision making and supporting our clinical agenda within the Trust’s Temporary Staffing Department? &lt;/strong&gt;Do you have the passion to support the delivery of ‘Best Care in Healthy Communities’ within Temporary Staffing services. &lt;strong&gt; If so we would love to hear from you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for a Registered Senior Nurse to support the clinical management of bank and agency workers across a range of clinical services within BCHC. Do you have the passion to support the delivery of ‘Better Care in Healthier Communities’ within temporary staffing. The Trust Bank are looking to recruit a forward thinking clinical professional with a problem solving and inclusive approach to delivering a responsive and efficient Temporary Staffing Service. The successful candidate will be a Registered Nurse with a post graduate clinical qualification and evidence of continuing professional development.&lt;/p&gt;\n&lt;p&gt;For further information or an informed discussion please contact&lt;/p&gt;\n&lt;p&gt;Gail Hall Head of Temporary staffing on 0121 466 7274 or Jonathan Cassidy, Senior HR Business Partner (0121 466 7473).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust is committed to providing a safe working environment for all staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As part of the Trust’s on-going response to the management of COVID-19 secure workplaces, strict health and safety measures and infection prevention and control has been put into place. As with any healthcare setting that cares for patients, we are and remain committed to ensure that we adhere to nationally mandated infection prevention and control policies and practices, alongside the appropriate training to ensure we protect all our staff, visitors and patients and minimise/eliminate risk in line with NHS Health Governance standards. The Recruitment programmes we are undertaking are in accordance with these measures to ensure the safety of all candidates. We are committed to protecting our staff and services users from infection and encourage our staff to uptake their annual flu vaccination.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Trust, we offer and encourage staff to complete either a Black and Minority Ethnic (BME) risk assessments, regular COVID-19 risk assessments and/or working at home risk assessments to identify additional support measures or reasonable adjustments that may be required as appropriate. We encourage all staff to ensure they benefit from the various support measures which have been put into place which help us to support and protect our staff, visitors and patients to provide the Best Care in Healthy Communities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;These measures are within the provisions of Health and Safety and are in line with the Trust’s expectation that all staff will comply with the measures put in place and to ensure social distancing is adhered to&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGail HallJob titleHead of Temporary StaffingEmail addressgail.hall1@bhamcommunity.nhs.ukTelephone number07718575732&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Priestly Wharf, Birmingham", "postalCode": "B7 4BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4873", "longitude": "-1.88581"}}, "title": "Band 7 Clinical Leader/Clinical Business Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255373", "validThrough": "2020-11-17T23:59:59+0000"}