{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-09T10:58:59+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Mental Health Staff Nurse – Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Laurel House, Cheltenham &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £24,907 - £30,615 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Laurel House is a specialist 13 bedded Inpatient Recovery Unit, based in the community. It offers placements for a maximum of two years for individuals, often presenting with complex needs, who are recovering from a severe and enduring mental illness.(predominately psychosis) .&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A vacancy has arisen for a Mental Health Nurse to join our Multi-disciplinary team. We are looking to appoint an enthusiastic and motivated individual who has a good understanding, and is committed to the principles of recovery and social inclusion.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate will be responsible for the smooth running of the unit over a 3 shift / 24 hour shift pattern, acting as shift co-ordinator to ensure effective use of resources. Individually you will also have responsibility as named-nurse for up to a maximum of 4 patients at any one time, delivering all aspects of care from assessment, admission, up to and including organising and supporting discharge into the community. The ability to communicate well with a range of agencies is a distinct advantage. You will also be expected to have a good understanding of risk assessment and the potential challenges of working in a ‘stand-alone’ unit. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Laurel House provides a caring and relaxed place for people to recover from their illness, supported by a highly motivated multi-disciplinary clinical team , who feel passionate about the care they give.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 22nd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information regarding this opportunity, or to arrange a visit, please contact Brad Watkins, Unit Manager, Tel: 01242634217 / Email: Brad.Watkins@ghc.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;This post is eligible for the Trust’s Recommend a Friend scheme. If you have been recommended to apply for this role by an employee of the Trust you should include a short statement to this effect in your supporting information, including the name of the person who recommended you. If you are successful with your application the employee who recommended you needs to access the relevant forms to process this from the Trust’s intranet or the HR Recruitment Team.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cheltenham", "postalCode": "GL51 9EZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9071", "longitude": "-2.08289"}}, "title": "Mental Health Staff Nurse - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219846", "validThrough": "2020-11-22T23:59:59+0000"}