{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-29T16:00:55+0000", "description": "&lt;p&gt;Ward 14 / Surgical High Care is a 20 bedded acute general surgical ward incorporating surgical high care beds specialising in Colorectal and ENT surgery. We also care for a wider range of general surgical specialties both pre and post operatively including Urology, Gynecology, and Ophthalmology.&lt;/p&gt;\n&lt;p&gt;  &lt;/p&gt;\n&lt;p&gt;The vacant posts are at present on ward 14 but we are currently developing the Provision of Enhanced Surgical High Care beds which will see the ward relocating.  This new development will provide an interim level of Care between level 1 and level 2 creating a service for patients whose care needs fall into the gap between what can be provided on a normal ward and in critical care&lt;/p&gt;\n&lt;p&gt;With this new development the new ward environment will have 6 Elective Surgical high care beds (3 of these will provide Enhanced care – where we will care for elective patients who previously may have been cared for in High Dependency), We will also have 6 emergency high care beds. &lt;/p&gt;\n&lt;p&gt;Going forwards there will be opportunities within this role to rotate across the surgical division and/or critical care as you will work closely with both these teams.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, motivated, dedicated, forward thinking nurses who will be committed to the role with a determination to ensure patients on the ward receive the highest standards of care. Our patients have varying degrees of dependency which will mean organising and prioritising care accordingly whilst being able to recognise and manage deteriorating patients.&lt;/p&gt;\n&lt;p&gt;There are currently 3 full times posts available (part time would also be considered).  These posts are rotational consisting of days/nights &amp; weekends.  You must be punctual and flexible and will need to have excellent communication skills and be able to liaise with patients, relatives, colleagues and members of the multidisciplinary teams.&lt;/p&gt;\n&lt;p&gt;We require you to be committed to undertaking ongoing training and development and we will ensure you receive a full induction period to the ward as well as full support from the ward and practice development sister.&lt;/p&gt;\n&lt;p&gt;Post registration experience is preferable but not essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post is a rotational post consisting of days/nights &amp; weekends and you must be punctual and flexible. You will need to have excellent communication skills and be able to liaise with patients, relatives and other members of the multidisciplinary team as well as you colleagues on the ward.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We require you to be committed to undertaking ongoing training and development and we will ensure you receive a full induction period to the ward as well as full support from the ward and practice development sister.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Post registration experience is preferable but not essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa HalliwellJob titleWard ManagerTelephone number01253 953414Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Staff Nurse Ward 14", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248986", "validThrough": "2020-11-12T23:59:59+0000"}