{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35149", "minValue": "35149", "unitText": "YEAR", "value": "£20.91 PH Basic"}}, "datePosted": "2020-11-06T13:17:28+0000", "description": "&lt;p&gt;It is an exciting time to join our Respiratory service in Harrow&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Harrow Community Respiratory service is seeking a BANK band 7 respiratory physiotherapist to join the team for a period of 6-12 months. As a BANK band 7 respiratory physiotherapist you will have responsibility for provision of ongoing virtual pulmonary rehabilitation classes, also face to face when this resumes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As part of the team, the BANK band 7 respiratory physiotherapist will provide respiratory physiotherapy interventions predominantly breathlessness management and airway clearance to appropriate respiratory and heart failure patients within the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a BANK band 7 respiratory physiotherapist you will be expected undertake ambulatory assessment component of the home oxygen service provided by the service. Training will be provided to assess and manage patients on Long term Oxygen Therapy&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key &lt;/strong&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;strong&gt;:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The Bank band 7 respiratory physiotherapist will work with the Senior Respiratory Nurse/ Team Lead and other clinicians to plan, co-ordinate, implement and evaluate the physiotherapy and rehabilitation service provided to respiratory patients.&lt;/li&gt;\n&lt;li&gt;The BANK band 6 respiratory physiotherapist will work as an integral team member undertaking assessment and treatment of respiratory patients. This will include the delivering of community based respiratory physiotherapy care and pulmonary rehabilitation to expected contractual markers and the highest possible standard of evidence based care in line with the NICE / BTS guidance.&lt;/li&gt;\n&lt;li&gt;Good interpersonal and organisational skills are essential for this post .&lt;/li&gt;\n&lt;li&gt;A flexible approach and the ability to work under pressure, both as part of a team and independently is expected.&lt;/li&gt;\n&lt;li&gt;This job involves the safe moving and handling of patient equipment as well as travel to various locations which successful candidate will be expected to undertake.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer you&lt;/strong&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;First choice of shifts or Long tern assessment – Access to these before they are available to agency&lt;/li&gt;\n&lt;li&gt;Flexible working to suit your lifestyle –&lt;/li&gt;\n&lt;li&gt;Payment directly into your Bank account – no need for Umbrella companies&lt;/li&gt;\n&lt;li&gt;Access to NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Paid induction, mandatory updates and training&lt;/li&gt;\n&lt;li&gt;Register today for various flexible shifts and long-term placement opportunities&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;If you are excited by the above then we would love to hear from you! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our temporary staffing shifts are calculated hourly and paid weekly. You are paid only for the hours you actually work during any Assignment. Bank workers are paid on fixed third point based on the Agenda for Change (AFC) pay bands.&lt;br /&gt;&lt;br /&gt;Weekly pay will include: Basic pay + HCAS + 12.07% Holiday pay + Unsocial hours (If applicable)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Check out the CLCH trust Facebook, twitter &amp; LinkedIn webpages for more information about us&lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various, London", "postalCode": "SW1P 2PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4943", "longitude": "-.134014"}}, "title": "Respiratory Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259890", "validThrough": "2020-11-19T23:59:59+0000"}