{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inclusive HCA"}}, "datePosted": "2020-10-26T17:01:18+0000", "description": "&lt;p&gt;We are seeking to recruit an enthusiastic and motivated Band 8a Clinical, Counselling or Forensic Psychologist to join our Psychology Department in the Forensic Directorate. The post holder will be based in the medium secure service at the John Howard Centre. We are looking for someone who has some experience of working in a forensic inpatient setting and has skills in both direct work with service users and indirect work with clinical teams. The Trust actively promotes co-production and service user involvement and is committed to ongoing Quality Improvement, so there will be opportunities for development in these aspects of service planning and delivery.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Forensic Directorate has good links with the North Thames Clinical Psychology training courses and other academic institutions. There are opportunities to get involved in teaching and training as well as varied CPD opportunities. The John Howard Centre is based in the London Borough of Hackney and serves a catchment area which covers a large geographical area, including four East London Boroughs and parts of North East London. ELFT is an inclusive organisation and we welcome applicants from all backgrounds.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LONDON", "postalCode": "E9 5TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5481", "longitude": "-.037841"}}, "title": "Clinical/ Counselling / Forensic Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243529", "validThrough": "2020-11-06T23:59:59+0000"}