{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 £45,780 - £51,393 per annum incl"}}, "datePosted": "2020-11-05T12:46:24+0000", "description": "&lt;p&gt;St. George’s University Hospitals NHS Foundation Trust is the regional specialist care provider for South West London, Surrey and beyond. The trust provides a high quality, comprehensive range of health services from leading edge tertiary and trauma care to community services. With national and regional referrals added to our local 3.5m catchment, we serve a population of around 5m.&lt;br /&gt;&lt;br /&gt;Co-located with St George’s, University of London and with both organisations now in a formal strategic alliance with King’s Health Partners, the trust delivers with its partners high quality research and education both of which contribute to the healthcare provision of tomorrow. Acute and tertiary health services are delivered from over 1,000 beds across two sites, by around 8,000 staff.&lt;br /&gt;&lt;br /&gt;St. George’s University Hospitals NHS Foundation Trust is a major acute hospital that offers very specialist care for complex injuries and illnesses, including trauma, neurology, cardiac care, renal transplantation, cancer care and stroke. It has a helipad which opened in spring 2014 and the work of its emergency department can currently be seen on Channel 4’s ‘24 Hours in A&amp;E’ programme. The hospital also provides all the usual care you would expect from a local NHS district general hospital.&lt;br /&gt;&lt;br /&gt;We also provide services at Queen Mary’s Hospital in Roehampton. These include outpatient rapid diagnostic and treatment facilities, a minor injuries unit, limb fitting services and 70 elderly, intermediate care and rehabilitation beds.&lt;br /&gt;&lt;br /&gt;As well as hospital services, we provide a wide variety of specialist, maternity and community services to children, adults, older people and people with learning disabilities. These services are provided from St John’s Therapy Centre, 11 health centres and clinics, schools, nursing homes and people’s own homes. The trust also manages the healthcare service at HMP Wandsworth.&lt;/p&gt;\n&lt;p&gt;South West London Pathology is an award winning pathology partnership between three leading Hospital Trusts – St George’s University Hospitals NHS Foundation Trust, Kingston Hospital NHS Foundation Trust and Croydon Health Services NHS Trust – designed to provide an integrated, high quality pathology service for hospitals and GPs across South West London, by bringing together the best of each Trust’s service and providing them within a single organisation.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for an enthusiastic, self- motivated individual who has completed at least 3 years as a trainee clinical scientist and has ideally gained HCPC registration.&lt;br /&gt;&lt;br /&gt;You will participate in the clinical advisory and authorisation rota and will be encouraged to develop an area of specialised knowledge. In addition, you will contribute to research, development and audit relevant to the Clinical Biochemistry service. This post is based at St Georges University Hospitals NHS Foundation trust.&lt;/p&gt;\n&lt;p&gt;Find out more about South West London Pathology on our website&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Frances BoaJob titleConsultant Clinical ScientistEmail addressfrances.boa@stgeorges.nhs.ukTelephone number0208-725-2941Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Frances Boa on 0208 725 2941 or frances.boa@stgeorges.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George&#39;s Foundation NHS Hospital, Tooting", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Senior Clinical Scientist - Biochemistry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257716", "validThrough": "2020-11-19T23:59:59+0000"}