{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 per annum (pro-rata for part time)"}}, "datePosted": "2020-10-20T13:50:25+0100", "description": "&lt;p&gt;Are you looking to become a Band 5 Pharmacy Technician and work in a friendly and exciting environment? Then this is the job for you. Within this role you will be responsible for the sole running of the dispensary, with responsibility for the safe and accurate dispensing of all medicines and medicinal products as prescribed by authorised prescribers within the Medical and Dental Centre.&lt;/p&gt;\n&lt;p&gt;Benefits include free on-site parking and access to gym.&lt;/p&gt;\n&lt;p&gt;Your primary duties will include but not be limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Overall responsibility for the safe and accurate dispensing of all medicinal products to patients as prescribed by the Medical Practitioner.&lt;/li&gt;\n&lt;li&gt;Procurement, receipt, safe custody, storage, audit and dispensing of all medicinal products and equipment including Controlled and Accountable Drugs, in accordance with SOPs.&lt;/li&gt;\n&lt;li&gt;Stock management and pre-labelling of those medicinal products supplied by Nurses and Combat Medical Technicians.&lt;/li&gt;\n&lt;li&gt;Compliance with current legislation, policies and guidance regarding security, health and safety and patient confidentiality.&lt;/li&gt;\n&lt;li&gt;Assessment of potential pharmacy related hazards within the working environment.&lt;/li&gt;\n&lt;li&gt;Monitoring of all stock to ensure these are stored in accordance with manufacturers recommendations.&lt;/li&gt;\n&lt;li&gt;Undertake professional audits in line with DPHC requirements.&lt;/li&gt;\n&lt;li&gt;Submit reports and pharmacy related statistics as required by DPHC procedures.&lt;/li&gt;\n&lt;li&gt;Provision of advice to medical centre staff on pharmacy and prescribing issues within the scope of professional competence.&lt;/li&gt;\n&lt;li&gt;Mentoring personnel undertaking dispensary awareness training and Pharmacy Technician students.&lt;/li&gt;\n&lt;li&gt;Use of DMCIP and computer systems for dispensing and stock management, in accordance with SOPs.&lt;/li&gt;\n&lt;li&gt;Responsible for compliance with all appropriate Healthcare Governance policies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please read the attached Job Description for further information on the role and its requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Criteria&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Band 5 Pharmacy Technicians: Registrationwith GPhC (achieved via NVQ Level 3/BTEC Pharmaceutical science qualification, or grand-parenting) – plus other additional training for checking dispensed prescriptions without further reference. Practical experience to be able to operate in a singleton post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection Process&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following technical framework:&lt;/p&gt;\n&lt;p&gt;- NHS Core – NHSC1 – Communication&lt;/p&gt;\n&lt;p&gt;- NHS Core – NHSC4 – Service Improvement&lt;/p&gt;\n&lt;p&gt;- NHS Core – NHSC5 – Quality&lt;/p&gt;\n&lt;p&gt;- NHS Health &amp; Wellbeing – HWB10 – Products&lt;/p&gt;\n&lt;p&gt;- NHS Information &amp; Knowledge – NHS IK3 – Knowledge &amp; Info Resources&lt;/p&gt;\n&lt;p&gt;- NHS General – NHS G3 – Procurement &amp; Commissioning&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Regional Medical Centre, RAF Halton, Aylesbury", "postalCode": "HP22 5PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7749", "longitude": "-.727866"}}, "title": "Band 5 Civilian Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234627", "validThrough": "2020-11-18T23:59:59+0000"}