{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 Dependent Upon Experience"}}, "datePosted": "2020-11-03T15:00:58+0000", "description": "&lt;p&gt;We are looking for an experienced and dynamic Director for Infection Prevention and Control to join East Kent Hospitals. We would welcome applications from both Nursing and Medical applicants and separate job descriptions are attached depending on professional background&lt;/p&gt;\n&lt;p&gt;East Kent Hospitals University NHS Foundation Trust is one of the largest acute Trusts in England with three acute sites at Ashford, Canterbury and Margate providing a full range of acute services to our local population of around 800,000. The new Kent and Medway Medical School has now opened for the first cohort of students and close links have been developed with the trust.&lt;/p&gt;\n&lt;p&gt;The Director will be a member of the executive team and will work with colleagues including the Chief Nurse who is the executive lead for Quality. They will be responsible for the development and implementation of operational and strategic plans for the Infection Prevention and Control service, and for ensuring the development of a progressive and responsive service within a robust clinical governance framework, to ensure that the Trust continually improves its performance in reducing healthcare-associated infections. An effective leader, the DIPC will be a highly visible and authoritative individual who will lead on engagement of all groups of staff, patients and external organisations where appropriate.&lt;/p&gt;\n&lt;p&gt;The post will require close working relationships with colleagues at all levels throughout the Trust&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide strategic and operational leadership, professional expert advice and support for the IPC team and clinical and non-clinical staff in relation to IPC and communicable disease management. They will need excellent interpersonal, organisational and leadership skills to take the IPC agenda forwards, and the ability to act as a role model in promoting the IPC principles across the Trust, influencing and improving the quality of care delivered to our patients.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jenny Bledge,Business Support Officer&lt;/p&gt;\n&lt;p&gt;Email address:jennifer.bledge@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Kent Hospitals University Foundation Trust", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Director of Infection Prevention and Control", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254459", "validThrough": "2020-11-17T23:59:59+0000"}