{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. pro rata"}}, "datePosted": "2020-11-05T09:15:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Practice - Specialist Practitioner – Connection Telephone Service and Street Triage for Dorset Police.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting opportunity for an experienced Mental Health Nurse, Social Worker or Occupational Therapist to become a Specialist Practitioner within a newly developed service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Connection offers telephone support 24 hours a day, seven days a week to people of all ages living in Dorset, experiencing a mental health crisis. The service is accessed directly through a single phone number or via 111 and people in crisis can ring for help from trained staff, who can identify the most appropriate course of action.&lt;/p&gt;\n&lt;p&gt;As a Community Mental Health Practitioner you will be joining a dynamic, multi-disciplinary team of Mental Health nurses, Social Workers and Occupational Therapists, experienced Support Workers and Peer Specialists. This mix of professionals enables holistic and effective care to be delivered to the service users under the care of the team.&lt;/p&gt;\n&lt;p&gt;Our Connection staff will complete brief clinical risk and mental state assessments and provide brief interventions for people presenting in mental health crisis with a view to signposting them onto the most appropriate service to meet their care needs. Working via telephone, our qualified practitioners will be experts in validating, de-escalating crisis and coaching people in distress tolerance and emotional regulation strategies. You will also manage the Mental Health Support Workers on the team providing guidance and support. Using a range of brief interventions, you will empower patients, carers and families to manage distress and crisis effectively.&lt;/p&gt;\n&lt;p&gt;The role includes assessing service users in the community that are referred from a number of sources including. After assessment you will ascertain the most appropriate follow-up for the client. As the team is community based you will need to have a full driving license.&lt;/p&gt;\n&lt;p&gt;Continued training and education is a key objective at Dorset HealthCare for all staff. The Home Treatment Team offers continuous development for all our practitioners both from internal and external resources. Specialist training continues to be developed and offered for all disciplines within the team. This post is an opportunity for you to expand on your existing knowledge, skills and experience to become part of this specialist service and to play an active part in the remodelling exercise taking place as a result of the Acute Care Pathway Review&lt;/p&gt;\n&lt;p&gt;This post will require the applicant to do shifts in both Connection and Street Triage. Street Triage. This service provides telephone support and advice to Dorset Police and requires police vetting. You will receive full training on the Police Computer system.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s special about working in our service?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Connection is a new and developing service designed in collaboration with staff and service users to support them when in crisis. We work to a model of self-defined crisis meaning that there is no threshold for accessing the services. Anyone working for the team will become specialist in these assessments, especially risk assessment and management, finding alternative solutions to admission, understanding the way psychosocial factors affecting people’s mental health. We also have close links with the other services within Access Mental Health including Home Treatment teams, Psychiatric Liaison and the Retreat.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What support and training will people get in the team?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To enable clinicians to carry out specialist assessments we will provide a full induction. In addition, we will treat you as supernumerary on shifts where you will be shadowing other team members as they manage the caseload. There will also be the opportunity for “spoke” days where you will be able to spend time with other key linked services (like the Home Treatment, Retreat, CMHT, etc.) to better understand the overall Access Mental Health response service offered by Dorset HealthCare.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What opportunities will people have to use their skills?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Every month the team takes between 5000-6000 calls covering a wide variety of needs. The service works with clients with diagnosed mental health issues but also works with people who are previously unknown to mental health services who may need additional support in a distressing time. The service covers the entire of the county of Dorset. We also support service users with a range of risks, supporting them to take positive risks and assessing for capacity to allow service users to make unwise decisions and be responsible for their own recovery and safety where appropriate.&lt;/p&gt;\n&lt;p&gt;So if you are already a Band 6 practitioner looking direction or equally are an experienced band 5 looking for the next step in their career, we&#39;d like to hear from you.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Cassandra Burtenshaw,Team Leader at cassandra.burtenshaw@nhs.net / 0300 123 5440&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole", "postalCode": "BH13 7LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.6986", "longitude": "-1.92791"}}, "title": "Specialist Practitioner - Street Triage, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257023", "validThrough": "2020-11-19T23:59:59+0000"}