{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum"}}, "datePosted": "2020-10-20T15:30:35+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;MYDoc Locum Specialty Doctor in Oral Surgery (6 months)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Mid Yorkshire Hospitals NHS Trust is pleased to announce the introduction of these new roles aimed at doctors who are passionate about their practice and their career outside traditional models. Our posts will combine education and career development with practical patient-facing care.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This post isnot recognised a UK training posts. Nevertheless, MYDoc doctors will have a named supervisor and be supported in undertaking scheduled educational opportunities to consolidate and develop alongside their experiential learning, with certificated outcomes or credentialing to support career progression through other routes.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;An Introduction to the Division/Specialty from Mr Spencer &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The OFS department includes Oral and Maxillofacial Surgery, Orthodontics and the Community Dental Service. Our OFS team is made up of enthusiastic and highly motivated individuals supported a dedicated specialty-secretariat, with office and networked computer facilities. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Oral and Maxillofacial Surgery service currently has 3 consultants, 3 Specialty Doctors, 2 Specialty Registrars and 11 core trainees. The Orthodontic clinical team includes 2 consultants, 3 specialty registrars and an orthodontic therapist.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Community Dental Services cares for the population of Wakefield and District and work across 5 sites. The team comprises of a consultant in Paediatric Dentistry, 2 Senior Dental Officers and 2 Dental Officers &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We have excellent facilities across all our sites with up to date clinical, operating and teaching equipment. Our acute service and our in-patient services are based in modern and spacious facilities at Pinderfields Hospital in Wakefield, and we provide out-patient and day services on our Dewsbury Hospital and Pontefract Hospital sites.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We are a progressive teaching department and all our consultants are involved in teaching our dental students, dental core trainees and specialty registrars, as well as ongoing professional development and education within our service. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants will be eligible for the post of Specialty Doctor as described in Terms and Conditions of Service for Specialty Doctors – England (2008) and will be remunerated as appropriate on the salary scale MC46 (£41,158 to £76,751) per annum.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact in the first instance Mr James Spencer Consultant on telephone: (01924) 542542.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;For any queries please contact Medical Staffing on (01924) 543642.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Candidates are welcome to visit the department &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is subject to a Disclosure Barring Service (DBS) check.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Trust is an equal opportunities employer and operates a no smoking policy. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "MYDoc Locum Specialty Doctor in Oral Surgery (6 months)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235023", "validThrough": "2020-11-06T23:59:59+0000"}