{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa"}}, "datePosted": "2020-11-04T11:16:20+0000", "description": "&lt;p&gt;Are you passionate about customer service and focusing on the experiences of patients and their relatives?&lt;/p&gt;\n&lt;p&gt;We see every complaint as an opportunity for us to better understand and improve the quality of our services. Our central Complaints Team strives to provide an outstanding service so that people feel confident to speak up, find it easy to make a complaint or raise a concern, feel listened to and understood, and feel their complaint has made a difference.&lt;/p&gt;\n&lt;p&gt;Skills required:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent administrative skills&lt;/li&gt;\n&lt;li&gt;Communication&lt;/li&gt;\n&lt;li&gt;Customer service&lt;/li&gt;\n&lt;li&gt;Attention to detail&lt;/li&gt;\n&lt;li&gt;Organisational and office skills&lt;/li&gt;\n&lt;li&gt;English language –good knowledge of grammar &amp; punctuation&lt;/li&gt;\n&lt;li&gt;Excellent IT skills, including Microsoft Word, Excel and databases and data analysis/reporting&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will provide administrative support within the Complaints Team, including calendar and email management, processing correspondence and updating complaint records within the DATIX database. Your role will involve taking telephone calls from patients, public and staff and receiving visitors to the department. You will have excellent administrative skills and the ability to work flexibly within a challenging and changing environment to ensure timescales are met and a high level of service is provided. A good knowledge of IT packages is essential and experience of using databases would be beneficial.&lt;/p&gt;\n&lt;p&gt;Dealing with general enquiries concerning complaint investigations/handling will be part of your role and therefore excellent communication and organisational skills are essential. You will take pride in your work, and have the ability to empathise when faced with challenging or upset people in demanding and stressful circumstances.&lt;/p&gt;\n&lt;p&gt;Your organisational and communication skills will also be utilised when assisting with the arrangements for local resolution meetings.&lt;/p&gt;\n&lt;p&gt;You must have the ability to communicate and co-operate well with a team, and be willing to work flexibly within the Complaints team and the wider Advice &amp; Support Services to meet the needs of the service.&lt;/p&gt;\n&lt;p&gt;This is a full time, 37.5 hours per week role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development opportunities, including both professional and leadership development, together with an opportunity to work across some or all of our 5 sites depending on specialty&lt;/li&gt;\n&lt;li&gt;Support through every step of the way from recruitment to when you join our team and beyond&lt;/li&gt;\n&lt;li&gt;Friendly, supportive and caring colleagues&lt;/li&gt;\n&lt;li&gt;A variety of other staff benefits including employee assistance programme, discounted gym membership, onsite fitness classes, car schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key facts about our Trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Every day our hospitals see more than 4,000 outpatients&lt;/li&gt;\n&lt;li&gt;We see more Trauma &amp; Orthopaedic outpatients than any other Trust – over 3,300 per week&lt;/li&gt;\n&lt;li&gt;An average 860 patients are seen in A&amp;E every day – the 6th largest in the country&lt;/li&gt;\n&lt;li&gt;Our hospitals admit more than 220 emergency patients every day&lt;/li&gt;\n&lt;li&gt;We carry out more planned surgical operations than any other Trust in England with almost 50,000 operations taking place in our 52 operating theatres&lt;/li&gt;\n&lt;li&gt;We are one of only 5 Trusts nationally with more than 50 operating theatres&lt;/li&gt;\n&lt;li&gt;We carry out more than 300 elective procedures each working day&lt;/li&gt;\n&lt;li&gt;We employ 12,000 staff across our 5 hospital sites&lt;/li&gt;\n&lt;li&gt;We have a Director of Allied Health Professionals who is committed to provide leadership, progression and direction to AHPs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 11 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 25 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises; this includes Covid-19 secure areas. If you have Covid-19 related symptoms or you have been instructed to self-isolate by track and trace and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;/p&gt;\n&lt;p&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Harbinder Mahil - Customer Services Coordinator - Complaints&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Email: harbinder.mahil@nhs.net&lt;/p&gt;\n&lt;p&gt;Phone: 01332 783244&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Jackie Slowinski - Customer Services Coordinator - Complaints&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Email: Jackie.sklowinski@nhs.net&lt;/p&gt;\n&lt;p&gt;Tel: 01332 786945&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Derby Hospital, Derby", "postalCode": "DE22 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9104", "longitude": "-1.51382"}}, "title": "Customer Services Assistant - Complaints", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255574", "validThrough": "2020-11-11T23:59:59+0000"}