{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-27T15:45:47+0000", "description": "&lt;p&gt;The WTWA Estates Team provides a wide range of estate and property management services across Wythenshawe Hospital, Trafford Hospital, Withington Community Hospital and Altrincham Hospital (WTWA). The Team have an exciting opportunity for an Estates Manager to join the department to manage the delivery of Hard FM services across the estate.&lt;/p&gt;\n&lt;p&gt;The WTWA Estates Manager will be responsible for ensuring that all buildings, plant &amp; infrastructure are maintained safely and cost effectively within agreed statutory requirements, in accordance with NHS and the Trust’s policies and procedures.&lt;/p&gt;\n&lt;p&gt;The successful candidate will manage and monitor programmes of Planned and Reactive Maintenance, PFI Service Delivery and Compliance activity in accordance with Health &amp; Safety legislation, current industry standards and guidelines. The work programmes are delivered by the WTWA &#39;in house&#39; Operational Team, the PFI service provider and the Trust’s Energy &amp; Sustainability team to ensure efficient service delivery, use of energy, power and utilities services.&lt;/p&gt;\n&lt;p&gt;The successful candidate would enjoy working in a multi-disciplinary team environment with diverse healthcare professionals, as well as managing maintenance works, staff and contractors in a hospital environment. As part of this role you and the team will be providing different estates maintenance and compliance services each day to different service users across WTWA. In this department, each day, project or challenge will be different, so if variety is what keeps you motivated then this is the job for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarl HennikerJob titleWTWA Head of Operational EstatesEmail addresscarl.henniker@mft.nhs.ukTelephone number01612915265&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Hospital, Manchester", "postalCode": "M23 9GP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3928", "longitude": "-2.29376"}}, "title": "WTWA Estates Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245255", "validThrough": "2020-11-09T23:59:59+0000"}