{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 pa"}}, "datePosted": "2020-10-16T14:31:14+0100", "description": "&lt;p&gt;The newly created role of Chief Digital and Information Officer (CDIO) is an exciting and innovative opportunity to provide strategic leadership and drive transformation across our information, analytics and digital agenda at North West Anglia NHS FT.&lt;/p&gt;\n&lt;p&gt;We believe the development and management of the Trusts’ information, analytics and digital agendas should fundamentally enable the delivery of high quality and responsive clinical services to patients in our local communities.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is passionate about new and existing Information Technology and has a good experience and knowledge of variety of approaches, platforms and systems. You will be a skilled communicator and with strong negotiating skills alongside a deep empathy with the values of the Trust and the NHS.&lt;/p&gt;\n&lt;p&gt;You will be someone who understands the connection to service users and patients in all you do, and will strive for continual improvement, having the gravitas to influence across the organisation. Working closely with the Trust’s Chief Clinical Information Officer (CCIO), you will act as a Digital Champion within the Trust as well as representing the organisation externally, working with STP partners in Cambridgeshire and Peterborough, as well as Lincolnshire, to drive the digital agenda and support the provision of outstanding care to our local communities.&lt;/p&gt;\n&lt;p&gt;As part of a Trust-wide programme to improve our services, we have recently installed a new Patient Administration System, invested in improved infrastructure and are progressing with a programme to update and integrate clinical systems across all our sites. The successful candidate will be responsible for shaping innovations in information and technology, providing assurance and guidance to the Trust Board, ensuring the care and experience of our service users is improved through the introduction of new technologies. As CDIO, you will lead development of a new Digital Strategy to harness the opportunities new technologies present as well as introduce best practice and innovation.&lt;/p&gt;\n&lt;p&gt;As CDIO, you will also be the advocate for the Trust at regional and national level, working closely with NHSI/E and NHSX to ensure that our patients, staff and communities benefit from centrally supported initiatives.&lt;/p&gt;\n&lt;p&gt;The CDIO will be an inspirational leader with the vision and drive to take our digital agenda to the next level; working alongside clinicians and the Trust&#39;s supporting functions, with the focused aim of providing outstanding care for our local communities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joel Harrison - joelharrison@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number   01733 677907&lt;/p&gt;\n&lt;p&gt;Additional contact information:&lt;/p&gt;\n&lt;p&gt;Alec Dearden - alec.dearden1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121323.jpg", "name": "North West Anglia NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121323"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough City Hospital, Peterborough", "postalCode": "PE3 9GZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5848", "longitude": "-.278479"}}, "title": "Chief Digital and Information Officer - Peterborough", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230622", "validThrough": "2020-11-09T23:59:59+0000"}