{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20845", "minValue": "19734", "unitText": "YEAR", "value": "£19,734 to £20,845.50  per annum"}}, "datePosted": "2020-10-22T11:16:24+0100", "description": "&lt;p&gt;&lt;strong&gt;Team Administrator – Darlington – 6 months FTC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Huntercombe Group is one of the country’s leading specialist healthcare providers, with hospitals and centres throughout England and Scotland; delivering wide ranging services in adult mental health and learning disabilities, specialist brain injury, child and adolescent mental health services (CAMHS) including eating disorders, and social care for children with special needs.&lt;/p&gt;\n&lt;p&gt;We are now looking for an experienced Administrator to join our Administration and Finance team in the Darlington area to provide administrative assistance to the Bed Management Team and Fees Team. Additionally you will support with contract administration and contractual compliance along with reporting and data requirements.&lt;/p&gt;\n&lt;p&gt;The job involves using advanced Excel to collate data and produce complex and sensitive information and reports. You will be responsible for producing and distributing daily reports and invoices as well as allocating cash and managing and maintaining accurate records of patient movements.&lt;/p&gt;\n&lt;p&gt;This is a full time position for 6 months. The role is initially based from home, but there will be a requirement to attend meetings at the offices in Darlington and the plan is for the team to eventually return to the office permanently.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please take a look at our progressive and rewarding benefits package&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;• Employee Assistance Programme (EAP)&lt;/p&gt;\n&lt;p&gt;• Maternity leave at 3 month’s full pay and 3 month’s half pay, (up to a max salary of £50k)&lt;/p&gt;\n&lt;p&gt;• 2 week’s paid paternity leave&lt;/p&gt;\n&lt;p&gt;• Shared parental leave, matching the maternity leave benefit&lt;/p&gt;\n&lt;p&gt;• A thorough Induction Programme tailored to the hospital where you will be working&lt;/p&gt;\n&lt;p&gt;• Clear pay structure, with competitive rates&lt;/p&gt;\n&lt;p&gt;• Generous annual leave allowance&lt;/p&gt;\n&lt;p&gt;• Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/p&gt;\n&lt;p&gt;• The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/p&gt;\n&lt;p&gt;• Death in service benefit equivalent to 2 x salary&lt;/p&gt;\n&lt;p&gt;• A range of staff discounts&lt;/p&gt;\n&lt;p&gt;• Continuing Professional Development (CPD)&lt;/p&gt;\n&lt;p&gt;Huntercombe Group are one the leading specialist healthcare providers, with hospital and centres throughout England and Scotland, delivering wide ranging services in adult mental health and learning disabilities, specialist brain injury, child and adult mental health services (CAMHS) including eating disorders and social care for children with special needs.&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;Our aspiration is to nurture the world, one person at a time and that’s why everything we do is designed to provide the best care and recovery for our patients and residents&lt;/p&gt;\n&lt;p&gt;We’re proud to have recruited some of the most experienced doctors, nurses and therapists in their fields and alongside our supportive stable Management structure we hope that it’s you that can help make a difference to our excellent teams and workforce.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington", "postalCode": "DL1 1AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5221", "longitude": "-1.55076"}}, "title": "Team Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238112", "validThrough": "2020-11-09T23:59:59+0000"}