{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-10-26T10:45:30+0000", "description": "\n\n\n\n&lt;p&gt;These are new roles which forms part of the Frimley Integrated Care System (ICS) Incident Coordination Centre (ICC) team.&lt;/p&gt;\n&lt;p&gt;As part of the NHS response to Coronavirus pandemic, the Frimley ICS has established an Incident Coordination Centre to ensure a single overarching coordination role across all Health Partners within the System. The Frimley Incident Coordination Centre (ICC) was formally established in early March and provides an infrastructure which enables a robust system emergency planning and response to be coordinated via a single hub. &lt;/p&gt;\n&lt;p&gt;The work of the ICC is often fast paced and busy yet incredibly rewarding. Postholders will need to be available to work their contracted hours across the week including over weekends as part of a rota system and individuals may also be asked to work their rostered shift between the hours of 8am and 8pm as part of that rota as the need arises.  &lt;/p&gt;\n&lt;p&gt;We are now expanding our current team through the recruitment of additional roles, and are seeking individuals with strong organisational and problem solving skills to join our team. &lt;/p&gt;\n&lt;p&gt;If you would like to be part of our team and would like an informal discussion, please contact Fiona Slevin-Brown on 07768 133017 &lt;/p&gt;\n&lt;p&gt;Applicants should ensure they meet the minimum requirements in the role description before submitting an application &lt;/p&gt;\n&lt;p&gt;Interview date: 20th or 25th November 2020&lt;/p&gt;\n\n\n\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS North East Hampshire and Farnham CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128555"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aldershot/Home Working", "postalCode": "GU11 1AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2543", "longitude": "-.765632"}}, "title": "Incident Control Centre Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242035", "validThrough": "2020-11-06T23:59:59+0000"}