{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 per annum (incl of HCAS)"}}, "datePosted": "2020-10-21T14:31:56+0100", "description": "&lt;p&gt;&lt;strong&gt;*** Previous Applicants Need Not Apply ***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having a ‘Outstanding’ rating overall, having being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Community Mental Health Team in our latest CQC inspection, which found that: ‘There was a clear vision, underpinned by a set of values that were well understood by staff across the trust.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Wokingham Community Older Adults Mental Health Team is looking for ONE enthusiastic,&lt;br /&gt;caring and highly motivated Mental Health Practitioners to join our friendly and innovative Home&lt;br /&gt;Treatment Team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Home Treatment Team in Wokingham is a multi-disciplinary team with specialist skills in caring&lt;br /&gt;for older people with mental health needs in the community. The post holder will take responsibility&lt;br /&gt;for the assessment and implementation of intensive care and treatment in the home of people with&lt;br /&gt;functional mental health problems, as well as people with dementia.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful candidates must display a passion and understanding for working with Older&lt;br /&gt;People, but appropriate training and support will be provided as needed.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The normal rota hours are either 9-5pm or 11-7pm, including weekend shifts which are 9-3pm at&lt;br /&gt;least once a month, total 37.5hrs a week. (Appropriate supervision will be provided for weekend&lt;br /&gt;cover).&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holder will be well supported and guided by the Clinical Team Lead as necessary and&lt;br /&gt;have day to day responsibility for their own allocated caseload and HTT caseload. They will act as&lt;br /&gt;a keyworker assessing the patient’s needs and providing high quality mental health interventions&lt;br /&gt;appropriate to the individual.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Both full time and part time applicants will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call Clare Leask on 07917 326 761 or email: Clare.Leask@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to a car salary sacrifice scheme (available to all permanent staff over the age of 21), as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClare LeaskJob titleActing Joint Services ManagerEmail addressClare.Leask@berkshire.nhs.ukTelephone number07917326761&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "OPMH Services Wokingham, Wokingham", "postalCode": "RG41 2RE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4105", "longitude": "-.846196"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236871", "validThrough": "2020-11-15T23:59:59+0000"}