{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata"}}, "datePosted": "2020-10-30T17:01:31+0000", "description": "&lt;p&gt;We are recruiting to a fixed term Band 6 post specialising in adult gastroenterology within the adult dietetic team based at University Hospital Southampton NHS Foundation Trust (UHS). This post will be fixed term for approximately 9 months to cover maternity leave. The successful applicant will provide dietetic support to outpatient clinics and FODMAP sessions, with responsibility for developing the dietetic led FODMAP service, as well as providing cover to acute gastroenterology wards.&lt;/p&gt;\n&lt;p&gt;We are looking for an HCPC registered dietitian who is keen to build upon their experience and knowledge in the acute hospital setting and thrives in an acute and fast paced environment.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;UHS is a leading teaching hospital, hosting a wide range of specialist tertiary services and a nutrition biomedical research centre. The department of dietetics and speech and language therapy employs approximately 100 staff, with clinical experts working across the range of specialties, providing both acute and community services.&lt;/p&gt;\n&lt;p&gt;You will join the adult dietetic team at Southampton General Hospital. This is a busy, hardworking team known for its friendliness, support and development opportunities. You will be working within a close team and will receive support from other specialist gastroenterology dietitians. There are regular internal CPD sessions with regular gastro MDT education meetings and the opportunity to engage in service evaluation and improvement. As a regional centre for gastroenterology, research is ongoing to ensure we are up to date and providing the best service to our patients.&lt;/p&gt;\n&lt;p&gt;As a large teaching hospital Southampton covers far reaching areas and deals with complex cases which offer the opportunity to learn more specialist nutritional interventions.&lt;/p&gt;\n&lt;p&gt;Our service operates Monday to Friday.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;You will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Provide specialist dietary advice to in and outpatients with gastroenterological conditions including inflammatory bowel disease, coeliac disease, irritable bowel syndrome and other functional GI disorders and associated psychological issues, working closely with the consultant gastroenterologists and nurse specialists.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide a clinical service to the gastroenterology wards as a key member of the multidisciplinary team.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will have acute clinical experience, which must include significant expertise in managing all forms of oral and enteral nutrition support, and dealing with potential complications encountered.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be involved with the supervision and support of junior dietitians and dietetic assistants as well as student training for B and C placements from the University of Surrey.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be a key member of the multidisciplinary teams&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be involved with the supervision and support of junior dietitians and dietetic assistants as well as student training for B and C placements from the University of Surrey.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;We are looking for someone who has a keen interest in nutrition support and gastroenterology, with evidence of relevant, strong clinical skills. Flexibility and the ability to prioritise and manage a busy, complex caseload is essential. You must have excellent communication skills as well as an empathic nature. You must be able to demonstrate the ability to work within an MDT as a specialist dietitian, and have the confidence to present and discuss their professional opinion with colleagues. A good understanding of gastroenterology and the various dietetic and medical treatments available is essential along with the ability to independently plan and prioritise a busy caseload in an efficient and organised manner.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Wednesday 25th November 2020&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anna Wills 023 8120 6072&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Specialist Dietitian - Gastroenterology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251026", "validThrough": "2020-11-13T23:59:59+0000"}