{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata plus HCAS"}}, "datePosted": "2020-10-30T10:46:24+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;B5&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Mental Health / Staff Nurse (Full Time &amp; Part Time)&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Mayfield, Thurrock Community Hospital&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are the leading provider of Community Health Services in South West Essex and are part of the family of North East London NHS Foundation Trust (NELFT).&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for trained RMN’s and RN&#39;s who are motivated and enthusiastic about providing high quality care to join our friendly Inpatient Ward at Thurrock Community Hospital.&lt;/p&gt;\n&lt;p&gt;Mayfield provides inpatient beds that specialise in the rehabilitation of adults requiring general rehabilitation. We aim to provide safe, effective, high quality care by working closely with patients, relatives and a multi-disciplinary team. We offer an individual care pathway to improve and maintain each patient’s independence with a view to enabling a successful return to home life or agreed alternative accommodation.&lt;/p&gt;\n&lt;p&gt;If you have clinical experience, excellent inter-personal and communications skills, have the ability to work under pressure, and the drive to want to make a difference, we look forward to hearing from you&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;High Cost Area Supplement – Essex&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 5% of the basic salary (with a minimum of £1,034 to a maximum of £1,791)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please contact Phathi Nyathi 07713 089294 phathi.nyathi@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mayfield, Thurrock Community Hospital, Grays, Essex", "postalCode": "RM16 2PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.496", "longitude": ".336337"}}, "title": "Registered Nurse - Mayfield Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249780", "validThrough": "2020-11-13T23:59:59+0000"}