{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum inc HCAS pro rata"}}, "datePosted": "2020-10-20T10:02:07+0100", "description": "&lt;p&gt;Highly Specialist Systemic Psychotherapist Band 8a 18.75 hours (0.5WTE)&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a creative and motivated family and systemic psychotherapist to work in a secondary care adult mental health service. You will be based within Brent Adult and Family Psychotherapy Service in Kingsbury.&lt;/p&gt;\n&lt;p&gt;You will provide a high quality, evidence-based systemic psychotherapy service including clinical assessment, therapeutic intervention and consultation. You will be an experienced systemic psychotherapist able to work autonomously with individuals, couples and families affected by severe and enduring mental health difficulties. You will recruit and supervise trainee systemic and family psychotherapists on placement. You will also have an interest in supporting colleagues in community adult mental health secondary care services to ‘think family’ and apply systemic thinking in their work.&lt;/p&gt;\n&lt;p&gt;You will have a clear track record of working in adult secondary mental health care, have accreditation as a qualified systemic psychotherapist and have experience of providing supervision and consultation. This is a great opportunity for someone who can work autonomously and who wishes to promote the systemic model within an adult mental health setting.&lt;/p&gt;\n&lt;p&gt;You will be joining an established psychotherapy team with experienced colleagues from different disciplines. You will work closely with and be supervised by the Principal Systemic Therapist. You will also be able to participate in the CPD program offered by the systemic discipline across the Trust and have the opportunity to contribute to CNWL’s AFT accredited systemic training.&lt;/p&gt;\n&lt;p&gt;Interview Date Monday 30th November&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Dr Sarah Amoss&lt;/p&gt;\n&lt;p&gt;Job title Principal Family/Systemic Psychotherapist&lt;/p&gt;\n&lt;p&gt;Email address sarah.amoss@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 02082063941&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fairfields House, Kingsbury", "postalCode": "NW9 0PS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5865", "longitude": "-.263085"}}, "title": "Family/Systemic Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233721", "validThrough": "2020-11-10T23:59:59+0000"}