{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-30T13:31:21+0000", "description": "&lt;p&gt;This post is fixed term for 2 years. If you are a SBUHB employee you will first need to secure permission from your line manager before applying for this post.&lt;/p&gt;\n&lt;p&gt;The Speech and Language Therapy department has secured further funding to recruit an innovative and competent Speech and Language Therapist to work in Primary and Secondary Schools in the Neath Port Talbot area on a fixed-term contract for two years.&lt;/p&gt;\n&lt;p&gt;The post will provide an opportunity to facilitate the development of training packages and service delivery models in partnership with education staff and parents. You will work at a universal, targeted and specialist level supporting a variety of treatment models.&lt;/p&gt;\n&lt;p&gt;You will join a small team of SLTs working in close collaboration with the education department. There will be opportunities to network with other staff in education and health and to facilitate the development of innovative service delivery options to engage with children and young people with complex speech language and communication needs, alongside training opportunities.&lt;/p&gt;\n&lt;p&gt;You will also be part of the wider team of Speech &amp; Language Therapists working across the Health Board area to deliver Speech and Language Therapy in close cooperation with other professional colleagues.&lt;/p&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dedicated time and funding for appropriate CPD&lt;/li&gt;\n&lt;li&gt;Active support for research, audit and evidence-based practice&lt;/li&gt;\n&lt;li&gt;SLT Total Team meetings and Paediatric SLT Team meetings&lt;/li&gt;\n&lt;li&gt;Professional and Clinical support from Highly Specialist Therapists within the SLT team&lt;/li&gt;\n&lt;li&gt;Excellent resources&lt;/li&gt;\n&lt;li&gt;Administrative support&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ann Milligan Clinical Lead SLT - School Age Services&lt;/p&gt;\n&lt;p&gt;Telephone number 01792 517863&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Port Talbot Civic Centre, Port Talbot", "postalCode": "SA13 1PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5978", "longitude": "-3.78398"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250371", "validThrough": "2020-11-15T23:59:59+0000"}