{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-11-04T14:58:54+0000", "description": "&lt;p&gt;Due to continued expansion of the Single Point of Access, the Doncaster Care Group is looking to appoint a highly motivated and enthusiastic call handler within the team, supporting a large number of multi-disciplinary services, including mental health and physical health. Successful candidates would be required to work a variety of shifts covering a 24 hour rota to ensure effective service delivery.&lt;/p&gt;\n&lt;p&gt;As the first point of contact for our service users and other professionals, you will need to have excellent customer service skills and a helpful and friendly approach. &lt;br /&gt; It is important that you are able to work effectively in a fast paced office environment, handling large volumes of telephone calls, some of which may be challenging to deal with. You will need to be flexible and adaptable to the varying demands and changing circumstances and priorities of the services. Communication and team working are essential qualities to succeed in this role.&lt;/p&gt;\n&lt;p&gt;You should be able to use a PC and standard software packages including Outlook, Microsoft Word and Excel. SystmOne experience is desirable but not essential as full training will be given.&lt;/p&gt;\n&lt;p&gt;Essential requirements for this post are RSA II Typing/Word Processing (or equivalent), and a good standard of education (5 GCSE’s including Grade C or above in English and Mathematics or equivalent). Experience of working in a call handling environment or previous experience of working in the NHS would be advantageous.&lt;/p&gt;\n&lt;p&gt;For an informal discussion and further details, please contact Rosanna Howe (01302 566745) or Grace Kydd on (01302 566753) or email: rosanna.howe@nhs.net or Grace.Kydd@nhs.net&lt;/p&gt;\n&lt;p&gt;Interview Date: 27 November 2020&lt;/p&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN4 8QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4948", "longitude": "-1.14598"}}, "title": "Call Handler (Band 2)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256320", "validThrough": "2020-11-18T23:59:59+0000"}