{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "91881", "minValue": "91881", "unitText": "YEAR", "value": "£91,881 per annum"}}, "datePosted": "2020-10-26T15:16:29+0000", "description": "&lt;p&gt;Applications are invited to join a dynamic and forward looking Emergency Department&lt;/p&gt;\n&lt;p&gt;Bronglais General Hospital in Aberystwyth, Ceredigion, is uniquely situated in the middle of the West coast of Wales and stands as a model of rural healthcare being one of the smallest acute District General Hospitals in the UK. As well as serving the population of Ceredigion, it also serves the neighbouring counties of Powys and South Gwynedd.&lt;/p&gt;\n&lt;p&gt;The hospital has developed a reputation of innovation and forward-thinking and has led the way in adopting new technology to enhance clinical services. Cancer MDT’s, Neurology Clinics and other services utilise teleconferencing facilities to provide local access to Tertiary Services.&lt;/p&gt;\n&lt;p&gt;The Emergency and Urgent Care Centre (EUCC)in Bronglais Hospital is the access point for all accident and emergencies in the Mid Wales area. Open 365 days a year, the department provides a 24 hour unselected take for the population of Ceredigion, Powys and South Gwynedd. The Emergency Department is also a receiving centre for patients requiring stabilisation prior to transfer by road or air to specialist tertiary centres for high level intervention.&lt;/p&gt;\n&lt;p&gt;The new purpose built Front of House Scheme offers the opportunity to provide an integrated approach to caring for both emergency and unscheduled care admissions where the emergency and unscheduled care teams work closely together.&lt;/p&gt;\n&lt;p&gt;The facilities include:&lt;/p&gt;\n&lt;p&gt;2 resuscitation beds&lt;/p&gt;\n&lt;p&gt;6 urgent assessment beds (all single bays)&lt;/p&gt;\n&lt;p&gt;14 clinical decision unit beds including a mix 2, 4 and single bedded areas&lt;/p&gt;\n&lt;p&gt;All areas are spacious and are supported by IT terminals. Cardiac monitoring is available with all beds and the department has the full range of supportive equipment including a FAST US scanner.&lt;/p&gt;\n&lt;p&gt;The departmental structure is designed to deal with the demands of patient flow. We are fortunate to have experienced middle grade cover from 0900 until 2400 five days a week and 1000-2200 on the weekends. Our junior rota is filled with a mix of deanery appointed foundation posts, GPVTS and health board funded clinical fellows.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join this team and areas of specialist interest will be encouraged and supported. The successful candidate will be expected to have specialty training and relevant experience in Emergency Medicine and have MRCP or equivalent.&lt;/p&gt;\n&lt;p&gt;Hywel Dda University Health Board provides services to the 3 counties of Ceredigion, Pembrokeshire and Carmarthenshire which together cover a quarter of Wales. It is predominantly rural in nature with areas of outstanding beauty attracting National Park status. Llanelli on the south coast is the only major industrial town in the area. Aberystwyth, Lampeter and Carmarthen are University towns. Cardiff, the capital of Wales is approximately 125 miles away while Swansea is about 65 mile away from Aberystwyth.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMartin SawyerJob titleLocum Consultant in Emergency MedicineEmail addressmartin.sawyer@wales.nhs.ukTelephone number01970 623131Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Annette Snell&lt;/p&gt;\n&lt;p&gt;Clinical Hospital Director/Consultant Orthogeriatrician&lt;/p&gt;\n&lt;p&gt;Bronglais General Hospital&lt;/p&gt;\n&lt;p&gt;Caradoc Road&lt;/p&gt;\n&lt;p&gt;SY23 1ER&lt;/p&gt;\n&lt;p&gt;01970 623131&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bronglais General Hospital, Aberystwyth", "postalCode": "SY23 1ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4161", "longitude": "-4.07159"}}, "title": "Locum Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243104", "validThrough": "2020-11-23T23:59:59+0000"}