{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum including HCAS"}}, "datePosted": "2020-11-04T12:46:20+0000", "description": "&lt;p&gt;The resuscitation team at London North West University Healthcare is expanding its well established service and is therefore hoping to recruit for an enthusiastic, innovative and highly motivated healthcare professionals to join our team.&lt;/p&gt;\n&lt;p&gt;You must have a suitable professional clinical qualification (e.g. Registered General Nurse, Operating Department Practitioner or Registered Paramedic) and be registered with a professional body. Applicants will need at least three years clinical experience including the delivery of teaching clinical skills to range of healthcare professionals and will need to hold ALS provider or EPALS provider status.&lt;/p&gt;\n&lt;p&gt;Previous experience in resuscitation training would be advantageous.&lt;/p&gt;\n&lt;p&gt;The position offers the opportunity to develop high-quality teaching skills in resuscitation to all members of the multidisciplinary team. Participation as an active member of the cardiac arrest team is expected.&lt;/p&gt;\n&lt;p&gt;The posts will be based at Northwick Park Hospital but will also require travel to Central Middlesex Hospital and Ealing Hospital on a frequent basis.&lt;/p&gt;\n&lt;p&gt;You will be working within a friendly and supportive team who are committed to your professional development and the development of the resuscitation service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSteven RootJob titleLead Resuscitation OfficerEmail addresssteven.root@nhs.netTelephone number0208 869 5074&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital and Central Middlesex Hospital, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Resuscitation Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255918", "validThrough": "2020-11-18T23:59:59+0000"}