{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 per annum (incl of HCAS)"}}, "datePosted": "2020-11-03T11:46:17+0000", "description": "&lt;p&gt;&lt;strong&gt;INTERNAL BHFT STAFF ONLY PLEASE APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity is available within the Digital Transformation team. This is a full time permanent role for 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;Do you thrive in a digital change environment? Are you a proactive problem solver who enjoys a challenge? Do you enjoy engaging with varied staff groups? Do you have experience of digital change within clinical settings? If so then the role of Digital Transformation Specialist may be perfect for you.&lt;/p&gt;\n&lt;p&gt;The Digital Transformation team consists of Transformation Specialists with clinical and non-clinical backgrounds with a focus for delivering successful digital change projects within the organisation. Thr primary function is to support Trust staff to use and optimise current and future clinical systems and technologies by enabling and implementing Service led changes and IT enabled projects. Within the Digital Transformation team you will facilitate and implement changes to clinical systems, to ensure Service requirements are achieved and benefits are realised.&lt;/p&gt;\n&lt;p&gt;The Trust has been identified as a Global Digital Exemplar (GDE) by NHS England. We are extremely proud that we have been recognised for our digital maturity and Outstanding CQC rating which allows us to embark on exciting programmes of work to accelerate our digital roadmap through delivery of new innovative products and technologies supporting our Services to provide outstanding care.&lt;/p&gt;\n&lt;p&gt;You will be working directly with clinical services, both under your own initiative and as part of a team. The workload is varied and involves supporting business as usual (BAU) activities by taking forward requests for changes to RiO (the primary clinical record used within the Trust) in addition to supporting other digital systems that have been implemented within the Trust. Work within the Transformation team follows recognised change and benefits management methodology and focuses on people and processes to deliver successful change outcomes. The work may include meetings with Service Sponsors, to understand the problem to determine the change objectives and how current processes need to change; undertake ‘As Is’ and ‘To Be’ process analysis, options appraisals, stakeholder engagement, facilitating workshops, implementation planning, identifying risk and impact, understanding benefit measures, undertaking floor walking and supporting staff on go live.&lt;/p&gt;\n&lt;p&gt;You will be expected to demonstrate excellent IT knowledge, facilitation skills and have experience of delivering a successful change initiative. Training will be provided, including shadowing other Transformation Specialists, learning on the job, mentoring and by attending external courses. You will be working as part of a team and will have a mentor assigned who will assist you through your induction period.&lt;/p&gt;\n&lt;p&gt;For more information please contact cathy.climpson@berkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fitzwilliam House, Bracknell", "postalCode": "RG12 1BQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4168", "longitude": "-.754665"}}, "title": "Digital Transformation Lead - BHFT INTERNAL STAFF ONLY PLEASE APPLY", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253793", "validThrough": "2020-11-10T23:59:59+0000"}