{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24926", "minValue": "23521", "unitText": "YEAR", "value": "£23,521 - £24,926 pa inc"}}, "datePosted": "2020-10-23T16:01:38+0100", "description": "&lt;p&gt;&lt;strong&gt;Do you have your own personal lived experience of &lt;/strong&gt;&lt;strong&gt;recovery from mental health challenges and of accessing support from a Psychiatric Liaison Team?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to be part of an established, dynamic and friendly Psychiatric Liaison Team. We are seeking an enthusiastic and motivated individual who would be committed to working within a multi-disciplinary team (MDT) to support the recovery of the individuals being cared for in this context.&lt;/p&gt;\n&lt;p&gt;You must have your own personal lived experience of recovery from mental health challenges, have personal experience of accessing support from a Psychiatric Liaison Team, and have some experience of working in a related health or social care field. We are looking for people who are willing to positively share their personal experiences with others in order to support clients in their journey of recovery. &lt;br /&gt;&lt;br /&gt;You will be responsible for working with individuals, providing liaison and assessment and working towards the best outcome for the individual, inspiring hope and belief that recovery is possible.&lt;/p&gt;\n&lt;p&gt;You will need to be motivated, organised, energetic and a flexible team worker with effective communication and interpersonal skills in order to liaise with service users, carers, Psychiatric Liaison Team staff, members of the General Hospital Multidisciplinary Team (MDT) and Inpatient MDT, Bed Management Staff and other outside professionals / organisations. &lt;br /&gt;&lt;br /&gt;You will be fully supported in your personal and professional development through regular 1:1 supervision within the team line management structure, along with peer supervision and involvement in trust-wide peer support worker development events.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note only candidates who have personal experience of mental health difficulties and have accessed support from a Psychiatric Liaison Team should apply. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please refer to your recovery journey and experiences of accessing this type of service &lt;/strong&gt;&lt;strong&gt;within your application. You will also be asked to give a short presentation on your recovery story at interview, should you be invited.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: Thursday 10th December 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Fungayi Useya on 07703 886 936 or fungayi.useya@nhs.net&lt;/p&gt;\n&lt;p&gt;Francesca Lepori on 07415880943 or francesca.lepori@nhs.net&lt;/p&gt;\n&lt;p&gt;Cleo Boado - cleo.boado@nhs.net.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Liaison Psychiatry Peer support worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241222", "validThrough": "2020-11-13T23:59:59+0000"}