{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 pa"}}, "datePosted": "2020-10-26T11:33:12+0000", "description": "&lt;p&gt;&lt;strong&gt;JOB SUMMARY:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Lead Nurse for Infection Prevention &amp; Control (IPC) is responsible for providing Trust-wide strategic leadership in the management of healthcare-associated infection (HCAI). The Lead Nurse for Infection Prevention and Control will manage a team of infection, prevention and control staff and is accountable to the Chief Nurse/Director of Infection Prevention and Control (DIPC), and responsible to the Deputy Chief Nurse for the day-to-day strategic leadership, direction of the multi-disciplinary workforce, and to an on-going improvement in the quality of the patients experience.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder has delegated authority from the Chief Nurse and the Deputy Chief Nurse in line with the Trust’s commitment to Clinical Governance, to set, monitor and act upon standards of infection control that fall below the acceptable standard. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a key leadership position within the IPC team, assuming overall responsibility for ensuring that the Trust complies with the standards set out in the Health and Social Care Act (Hygiene Code 2008 updated 2015) and its legislative and licensing requirements, and for the provision of specialist advice and guidance, for all health care professionals and support staff across the Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a great package with inclusion in the following benefits to name but a few:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;NHS Pension Scheme&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Up to 6 weeks annual leave with the opportunity to purchase an additional 4 weeks annual leave &lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Access to a Staff Health &amp; Wellbeing Hub which offers advice, support and schemes including Occupational Health services which include self-referral access to medical assessment facilities, Physiotherapy and a Counselling Helpline service which can be accessed 24 hours a day, 7 days a week &lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Staff Salary Sacrifice Scheme including a Childcare Vouchers Scheme&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;A to Z list of staff benefits and discounts &lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Opportunities to join our Staff Champions and Staff Engagement Group&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Optional Annual Health Checks, Flu Vaccines and Healthy Lifestyle Initiatives&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Special leave provisions, including some over and above statutory entitlements&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Flexible working options to help staff achieve a work/life balance&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure that you read the Job Description which also includes the person specification before applying for this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal chat or further information regarding this post please contact: Susan Wynne: Lead Nurse for IPC susan.wynne@nhs.net or telephone 01925 946162&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If the advertised post requires a DBS check the successful candidate will incur the cost of the DBS check which will be taken in three equal monthly instalments from salary.&lt;/p&gt;\n&lt;p&gt;We advise that you complete and submit your application form as soon as possible, because should we experience a high level of interest in the post it may be closed early.&lt;/p&gt;\n&lt;p&gt;Any applicant who applies for a position online will be contacted thereafter using the email address provided upon login. Please ensure that after application you check your emails often to ensure that you do not miss any communications from Bridgewater Community Healthcare NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bridgewater is an equal opportunities employer: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We value and respect the diversity of our employees and aim to recruit a workforce that reflects our local communities, we therefore welcome applications from everyone with the necessary attributes for the job, irrespective of age, disability, gender/gender identity, sexual orientation, ethnicity, religious belief or other personal circumstance. We are committed to improving the working lives of our employees and we have an active flexible working policy and welcome applications for job share and flexible working. An interview is guaranteed to any applicant with a disability who meets the essential criteria of the person specification. If you require any reasonable adjustments to the application process please contact the Recruiting Manager for this post.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Bridgewater Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121090"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington", "postalCode": "WA5 7YS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4172", "longitude": "-2.6189"}}, "title": "Infection Prevention Control Lead Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242230", "validThrough": "2020-11-09T23:59:59+0000"}