{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40677", "minValue": "36192", "unitText": "YEAR", "value": "£36,192 to £40,677 per annum"}}, "datePosted": "2020-10-29T09:22:52+0000", "description": "&lt;p&gt;We are currently seeking a &lt;strong&gt;Senior Staff Nurse &lt;/strong&gt;to join our &lt;strong&gt;Adult Mental Health and Intellectual Disabilities Low Secure Service, &lt;/strong&gt;located in the village of &lt;strong&gt;Barham, &lt;/strong&gt;6 miles from &lt;strong&gt;Canterbury&lt;/strong&gt; and 10 miles from &lt;strong&gt;Dover&lt;/strong&gt;.  &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would like to welcome all nurses joining our permanent team with a ‘Welcome Bonus’ of £1000.00 and &lt;/strong&gt;would be delighted to speak to you If you’ve previously worked for the &lt;strong&gt;NHS. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The hospital is a 40 bed &lt;strong&gt;low secure hospital&lt;/strong&gt; that provides specialist assessments, treatment and care for adults with intellectual disabilities, personality disorders or autistic spectrum disorders, including those with challenging behaviours and forensic histories.&lt;/p&gt;\n&lt;p&gt;We work collaboratively with our patients and their families or carers and provide person-centred care and support. We employ staff in a variety of different roles and provide ongoing support with comprehensive training, learning and development opportunities.&lt;/p&gt;\n&lt;p&gt;When you join The Huntercombe Group as a &lt;strong&gt;Senior Staff Nurse&lt;/strong&gt;, you will be part of a company that is understanding, strives towards excellence, is innovative, reliable and accessible and above all puts people first.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;As a &lt;/span&gt;&lt;strong&gt;Senior Staff Nurse &lt;/strong&gt;&lt;strong&gt;your main duties will be:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To work according to the NMC Code of Professional Conduct and relevant professional guidelines as a named nurse or key worker for a defined group of patients.&lt;/li&gt;\n&lt;li&gt;To provide clinical leadership to a designated nursing team and ensure the provision of high quality.&lt;/li&gt;\n&lt;li&gt;To provide a high quality individualised standard of care to a defined group of patients, relatives and carers.&lt;/li&gt;\n&lt;li&gt;Ensure the effective supervision and development of staff .&lt;/li&gt;\n&lt;li&gt;To work and act as a key member of the team, supporting each patient with achieving their planned outcomes.&lt;/li&gt;\n&lt;li&gt;To act as the primary nurse in the assessment of needs and organising of care.&lt;/li&gt;\n&lt;li&gt;To take charge of a designated clinical area.&lt;/li&gt;\n&lt;li&gt;To adopt a flexible approach to hours of duty, in order to meet the needs of the service over a 24 hour period.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Key Accountabilities:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To be the clinical expert within the speciality&lt;/li&gt;\n&lt;li&gt;To act as an advocate to the child or adult ensuring the provision of appropriate information and support services.&lt;/li&gt;\n&lt;li&gt;To be an active participant in the multidisciplinary team, formulating care plans and utilising appropriate assessments.&lt;/li&gt;\n&lt;li&gt;In conjunction with the MDT, assess and manage risks identified through assessment of patients.&lt;/li&gt;\n&lt;li&gt;To regularly review risk factors and work in conjunction with the MDT to modify care plans as appropriate.&lt;/li&gt;\n&lt;li&gt;To act as the primary nurse for inpatient stay.&lt;/li&gt;\n&lt;li&gt;To ensure that clinical practice is evidenced based and consistent with relevant NICE guidelines and the organisations policies and procedures&lt;/li&gt;\n&lt;li&gt;To undertake clinical supervision to further develop competence and clinical practice.&lt;/li&gt;\n&lt;li&gt;To act as a mentor/preceptor to students/support workers as appropriate.&lt;/li&gt;\n&lt;li&gt;To supervise junior staff in carrying out their care plans.&lt;/li&gt;\n&lt;li&gt;To liaise effectively with all stakeholders in the care process, including carers and relatives, aspiring to provide an effective, seamless and integrated service to patients.&lt;/li&gt;\n&lt;li&gt;To maintain and update relevant knowledge and skills, maintain a professional portfolio and participate in further training as appropriate, in order to enhance quality of care for patients and carers.&lt;/li&gt;\n&lt;li&gt;To comply with the Huntercombe Group Health and Safety Policies and Protocols in order to contribute to safe working practices.&lt;/li&gt;\n&lt;li&gt;To protect vulnerable adults / children from internal/external elements and act as a Patient Advocate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Clinical Practice&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure a comprehensive assessment is completed for the patients journey&lt;/li&gt;\n&lt;li&gt;Ensure that each patient as an individual care plan and risk assessment, which takes into account the patient (if appropriate) and their carers views, with regular reviews&lt;/li&gt;\n&lt;li&gt;To administer medicine within the guidelines and framework of the Nursing and Midwifery Council and organisation protocols&lt;/li&gt;\n&lt;li&gt;Practice within the defined parameters under the Mental Health Act 1983/2007.&lt;/li&gt;\n&lt;li&gt;Provide clinical leadership and supervision for the rehab/support workers and students&lt;/li&gt;\n&lt;li&gt;Ensure all clinical documentation is of a high standard and patient notes are maintained and filed in the appropriate way&lt;/li&gt;\n&lt;li&gt;Provide a highly specialised range of clinical interventions and knowledge of evidence based models of practice relevant to the patients needs&lt;/li&gt;\n&lt;li&gt;Working autonomously with confidence and competence to provide a highly specialised and safe service to the patient&lt;/li&gt;\n&lt;li&gt;To take appropriate action when working with vulnerable adults and children following guidelines and Trust procedures, liaising with appropriate agencies as required&lt;/li&gt;\n&lt;li&gt;Maintain and contribute to the standards of professional care, ethics, policies and procedures&lt;/li&gt;\n&lt;li&gt;Maintain professional standards of practice at all times&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;In return we offer you:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A ‘Welcome Bonus’ of £1000.00&lt;/li&gt;\n&lt;li&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/li&gt;\n&lt;li&gt;2 weeks paid paternity leave&lt;/li&gt;\n&lt;li&gt;Shared parental leave, matching the maternity leave benefit&lt;/li&gt;\n&lt;li&gt;A fantastic preceptorship programme&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;Reimbursement for NMC registration fees&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Continuing Professional Development (CPD)&lt;/li&gt;\n&lt;li&gt;Support for revalidation&lt;/li&gt;\n&lt;li&gt;Support for BSc and MSc&lt;/li&gt;\n&lt;li&gt;Professional support through Nurses forum&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;li&gt;Relocation allowance of up to £8000.00&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Posting Date:29th October 2020&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Closing Date: 30th November 2020&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barham, nr canterbury", "postalCode": "CT4 6PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2019", "longitude": "1.17601"}}, "title": "Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247725", "validThrough": "2020-11-30T23:59:59+0000"}