{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum or pro rata"}}, "datePosted": "2020-10-22T11:32:27+0100", "description": "&lt;p&gt;About the Department: Ward 8a is a 29 bedded ward that cares for male and female patients. Ward 8A is a general medical, gastroenterology and endocrine ward. Caring for patients with a variety of disorders such as: liver disease, inflammatory bowel conditions, GI related cancer, diabetes and GI bleeds.&lt;/p&gt;\n&lt;p&gt;Attached to the ward is a NEW Medical Planned Investigation Unit which is open Monday to Friday 8am to 6pm. Staff nurses with skills in IV therapy, cannulation and phlebotomy are rota&#39;d for period in this clinic. The Unit cares for day patients needing infusions, biopsies, complex blood test etc.&lt;/p&gt;\n&lt;p&gt;The ward is very busy providing care to acutely unwell patients with that at times can be very demanding, but always rewarding.&lt;/p&gt;\n&lt;p&gt;The enthusiastic nursing team are very caring, friendly, and compassionate and provide a high standard of nursing care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit to the post of band 5 staff nurse to join our existing team . This is an exciting opportunity for either an experienced gastro nurse or a registered nurse looking to expand their practice as training will be given. Ward 8A is fast paced and varied, providing the candidate with plenty of opportunities to gain and build on clinical skills and share knowledge gained in previous areas. The position involves working a flexible shift pattern of both long and short shifts over days, nights and weekends. Training and career development will be available.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we’re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have recent experience of working within the medical setting. He/she will have experience of multidisciplinary working and will demonstrate excellent communication skills.&lt;/p&gt;\n&lt;p&gt;Pilgrim hospital is one of three hospitals over three sites, The award winning Vascular unit in the country is based at the hospital. Staff tell us that they join the hospital because they can see the opportunities open to them to develop services and make their mark. Further information about Pilgrim hospital is available on our website. Boston is a rural location with some interesting sites such as the Boston stump. Ward 8a staff welcome new starters and our keen to show off their ward and are happy to answer any questions or give guided tours around the ward.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Tiffin, telephone 01205 445677, email rachel.tiffin@ulh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pilgrim Hospital, Sibsey Road, Boston, Lincolnshire, PE21 9QS, Boston", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Staff Nurse - Ward 8A Gastro/Endocrine/Planned Investigation Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238187", "validThrough": "2020-11-12T23:59:59+0000"}