{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 pa inc"}}, "datePosted": "2020-11-02T16:16:42+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to appoint enthusiastic Staff Nurses to join our Gynaecology Oncology team at Queens Charlotte Hospital. We have permanent positions working 37.5 hours per week on a rotating roster of long days and nights, Monday-Sunday.&lt;/p&gt;\n&lt;p&gt;Victor Bonney is a 20 bedded inpatient ward and 6 bedded day unit mainly caring for women undergoing gynaecology oncology surgery.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to work in a team offering high quality nursing care to women with gynaecology problems, including major radical surgery for gynaecological cancers. You will work within a committed multi-disciplinary team and provide high quality individualised patient care. You will have the support of the clinical practice educator for gynaecology and work alongside the team of clinical nurse specialists led by the consultant nurse for gynaecology oncology. There will be opportunities for you to develop within your role and also the opportunity to undertake a rotation program within different gynaecology areas.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for newly qualified staff nurses or those with experience. You need to be passionate, dynamic and forward thinking with a desire to build your knowledge and skills within a supportive environment. You should have excellent communication and interpersonal skills with a genuine enthusiasm in caring for Women undergoing all aspects of gynaecological care. Gynaecology or surgical experience is desirable, but, not essential.&lt;/p&gt;\n&lt;p&gt;If you have a can do attitude and enjoy working on a fast paced and friendly ward then we would like to hear from you&lt;/p&gt;\n&lt;p&gt;The Trust reserves the right to close this vacancy prior to the closing date should we receive 50 applications prior to the advertised closing date.&lt;/p&gt;\n&lt;p&gt;We are committed to equal opportunities and improving the working lives of our staff and will consider applications to work flexibly, part-time or job share. Please talk to us at interview about the flexibility you may need&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Beverly Walcott-Douglas (Ward Manager) via email – b.walcott-douglas@nhs.net or telephone 02083833578&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Charlotte Hospital, London", "postalCode": "W12 0HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5165", "longitude": "-.236635"}}, "title": "Band 5 Staff Nurse, Gynaecology and Reproductive Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252801", "validThrough": "2020-11-15T23:59:59+0000"}