{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata for part time staff"}}, "datePosted": "2020-11-04T15:31:11+0000", "description": "&lt;p&gt;Research Radiographer&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced therapeutic radiographer with a keen interest in research and clinical trials for the opportunity to work with the Cancer Clinical Trials Team at Weston Park Cancer Centre, Sheffield Teaching Hospitals NHS Foundation Trust. The post holder will have responsibility for a portfolio of locally recruiting multi-centre cancer clinical trials including those involving radiotherapy. This involves the delivery of direct and indirect care for trial participants, including the informed consent process, and the collection of accurate data. An important aspect of the role will be to liaise with the radiotherapy team to ensure new trials are set up in a timely manner and radiotherapy treatments are planned and given as per trial protocol. This post could provide an opportunity for a therapeutic radiographer to develop clinical research skills. We are looking for someone who is keen to learn and has excellent communication skills.&lt;/p&gt;\n&lt;p&gt;The Radiotherapy Department is situated in a purpose built oncology hospital and is one of four hospitals comprising Sheffield Teaching Hospitals NHS Foundation Trust. There is easy access to the beautiful countryside of Derbyshire and shopping in Sheffield city centre and nearby Meadowhall.&lt;/p&gt;\n&lt;p&gt;The aim of this post is to provide sound, accurate clinical research data on patients who have been entered into local, national and international oncology clinical trials and be responsible for all trial documentation according to Good Clinical Practice guidelines/EU directive.&lt;/p&gt;\n&lt;p&gt;This modern department comprises of seven Varian linear accelerators, including four Truebeam (two of which are Truebeam STX). Intensity Modulated Radiotherapy, Image Guided Radiotherapy and Volumetric Modulated Arc Therapy are standard practice across the department. There is an orthovoltage &amp; superficial unit and two new Philips CT scanners with virtual simulation and Varian RGSC gating system.&lt;/p&gt;\n&lt;p&gt;We offer radiotherapy for paediatric patients and deliver SABR, CHART, DIBH and TBI.&lt;/p&gt;\n&lt;p&gt;The hospital adjoins the Sheffield University Clinical Trials Centre and there is a dedicated team of research and development radiographers who co-ordinate an active clinical trials portfolio and are developing an active local research programme.&lt;/p&gt;\n&lt;p&gt;The hospital adjoins the Cancer Clinical Trials Centre and there are dedicated research radiographers who co-ordinate an active clinical trials portfolio and are developing an active local research programme.&lt;/p&gt;\n&lt;p&gt;We are a clinical placement site for student radiographers from Sheffield Hallam University and all staff are actively involved in the education and assessment of student radiographers.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Karen Smith Job title Senior Manager, Radiation Services&lt;/p&gt;\n&lt;p&gt;Email address karen.smith239@nhs.net Telephone number 0114 2265291(Direct)&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Jan Johnson/Paula Rusby/Amy Taylor&lt;/p&gt;\n&lt;p&gt;Principal Therapeutic Radiographers&lt;/p&gt;\n&lt;p&gt;Tel: 0114 2265000 (via bleep system)&lt;/p&gt;\n&lt;p&gt;As part of the recruitment process at application stage, Sheffield Teaching Hospitals will assess applicants’ individual values and behaviours to ensure that these behaviours align with our PROUD values: Patient First, Respectful, Ownership, Unity and Deliver.&lt;/p&gt;\n&lt;p&gt;Our values are what help to make us different and ‘a Brilliant Place to Work’. We expect all our employees to share our values and demonstrate them in every aspect of their role.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake an online values assessment at application stage and the results of this assessment will be used as part of the on-going selection process to assess your suitability for the post.&lt;/p&gt;\n&lt;p&gt;The deadline for completing the online assessment is midnight 22/11/2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The link to the assessment can be found below, the address can be copied and pasted into a search engine e.g. google:&lt;/p&gt;\n&lt;p&gt;login.talentqgroup.com/Login/SelfService/QMMLERLNDP&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you have any queries, require any assistance to complete this assessment or have already completed it within the past 12 months, please contact the Trust Recruitment Team at &lt;strong&gt;sth.centralrecruitment@nhs.net&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Weston Park Hospital, Sheffield", "postalCode": "S10 2SJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3803", "longitude": "-1.49493"}}, "title": "Research Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256451", "validThrough": "2020-11-16T23:59:59+0000"}