{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 Per Annum"}}, "datePosted": "2020-10-23T11:30:22+0100", "description": "&lt;p&gt;&lt;strong&gt;Plymouth Dialysis Unit (PDU), Chronic kidney disease (CKD) and Acute kidney injury (AKI) Unit Nursing Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Grade: &lt;/strong&gt;8A&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Contract: &lt;/strong&gt;Permanent&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hours:&lt;/strong&gt;37.5 Per Week&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applications are invited for the appointment of a Plymouth Dialysis Unit (PDU), Chronic kidney disease (CKD) and Acute kidney injury (AKI) Unit Nursing Lead at University Hospital Plymouth NHS Trust to join an enthusiastic and committed team in providing a comprehensive inpatient and outpatient nephrology and renal transplantation service for University Hospitals Plymouth NHS Trust based at Derriford Hospital.&lt;/p&gt;\n&lt;p&gt;Derriford Hospital has been a centre for tertiary referrals for many years and hosts the South West Transplant Centre (SWTC), the renal transplant centre for the South West Peninsula. The catchment area for dialysis comprises a population of approximately 550,000 in South and North Devon and Cornwall.&lt;/p&gt;\n&lt;p&gt;Derriford Hospital is also the regional tertiary centre for about 1.6 million people in the South West of England, providing neurosurgery, stereotactic radiosurgery, cardiac and thoracic surgery, neonatal intensive care, bariatric surgery, hepatobiliary surgery, bone marrow transplantation and many other specialised services. In addition, the hospital was designated as a major trauma centre in 2012.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The work of the department&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Haemodialysis Provision&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust currently delivers its outpatient renal dialysis services through a main hub unit at the Eaton Business Park at Estover, which lies 2 miles from the hospital. There is a satellite dialysis unit in Torbay in Devon. This was opened in 2010 and is a shared facility with the Royal Devon and Exeter Hospital. There is also a private satellite unit in Bodmin which is a shared facility with the Royal Cornwall Hospital.&lt;/p&gt;\n&lt;p&gt;The Kingsbridge dialysis unit were opened in 2016 and a satellite unit in Holsworthy in North Devon was opened in December 2017. These units offer a patient centred service, choice of dialysis sites and reduction in travelling times as recommended by the Renal NSF.&lt;/p&gt;\n&lt;p&gt;Inpatient haemodialysis is provided in an acute unit within Mayflower ward, which is located on level 3. The acute dialysis unit has 6 stations and also provides a therapeutic plasma exchange service for the treatment of vasculitis, antibody-mediated transplant rejection and other immune- mediated conditions for all patients.&lt;/p&gt;\n&lt;p&gt;About 60 to 75 new patients begin renal replacement therapy each year. Currently, 175 patients are receiving dialysis with 40 on CAPD and 135 on haemodialysis. An average of 60 renal transplant are carried out annually.&lt;/p&gt;\n&lt;p&gt;For more information or an informal discussion, please contact:&lt;/p&gt;\n&lt;p&gt;Dr Kris Houlberg Service Line Director&lt;/p&gt;\n&lt;p&gt;Kenny Naughton General Manager on 01752 430034 or emailkennynaughton@nhs.net&lt;span style=&quot;text-decoration: underline;&quot;&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;***Preference will be given to internal Trust staff, as well as ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon who are able to display recent relevant experience as dictated by the Person Specification.***&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Dialysis Unit Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240310", "validThrough": "2020-11-08T23:59:59+0000"}