{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Volunteer"}}, "datePosted": "2020-10-30T13:41:04+0000", "description": "&lt;p&gt;Benenden Hospital has a proud history, dating back to 1907, when it was set up to treat postal workers with TB. It is now a modern, contemporary hospital situated in the heart of the Wealden countryside and provides a wide range of medical, surgical and healthcare services to private and NHS patients.&lt;/p&gt;\n&lt;p&gt;These are difficult times and we are seeking additional volunteers to join our family and help us with today&#39;s challenges. Our Meet and Greet team play a crucial part in keeping our patients and visitors safe and feel welcomed and supported during their visits, and we are looking for friendly people who want to make a difference.&lt;/p&gt;\n&lt;p&gt;Our spacious CQC Outstanding hospital has a rigorous hygiene and cleaning routine and is a COVID-secure workplace.  To keep you safe, we have all the required precautions in place including social distancing, protective screening, PPE and one-way systems.&lt;/p&gt;\n&lt;p&gt;If you can spare a few hours a week, we can use your talents.  Please apply to join our team of volunteers or give us a call to discuss further.&lt;/p&gt;", "employmentType": "VOLUNTEER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132614.png", "name": "Benenden Hospital", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132614"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cranbrook, Kent", "postalCode": "TN17 4AX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0867", "longitude": ".616131"}}, "title": "Volunteer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250379", "validThrough": "2020-11-27T23:59:59+0000"}