{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 Per Annum"}}, "datePosted": "2020-11-06T13:31:32+0000", "description": "&lt;p&gt;Surrey &amp; Sussex Healthcare NHS Trust are seeking to appoint a Specialty Doctor of middle grade level (ST3 level or above) to join our growing GIM/ Short stay team. The post-holders will join the well-established Department of GIM Short stay unit for one year in the first instance with the possibility to extend if mutually agreed.&lt;/p&gt;\n&lt;p&gt;We are looking for applicants with experience in acute and/or general internal medicine who also have excellent team-working skills with the abilities and professional skills to work well in a multi-professional team.&lt;/p&gt;\n&lt;p&gt;This post would suit doctors who have a keen interest in education and there will be opportunities for simulation training, teaching and quality improvement work.&lt;/p&gt;\n&lt;p&gt;Based at East Surrey Hospital, the post-holder will be a key senior member of the GIM team with a clear role in ensuring comprehensive care for their inpatients and providing acute assessment on presentation.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a team of multi-disciplinary staff in providing comprehensive care for their inpatients and emergency admissions. As part of a multidisciplinary team, you will be committed to delivering clinical and quality targets agreed both nationally and locally with the clinical teams and commissioners.&lt;/p&gt;\n&lt;p&gt;This post is based on the Godstone/ Chaldon short stay unit and its peripheral General Medical Wards under the supervision of the Consultants in Acute and general Medicine.&lt;/p&gt;\n&lt;p&gt;Doctors who are enthusiastic about working in a strong team of committed physicians to deliver excellent acute care to patients across a variety of clinical settings will be rewarded with a wide and rewarding clinical experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Hanadi Asalieh hanadi.asalieh@nhs.net 01737 768511&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Surrey Hospital, Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Specialty Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259939", "validThrough": "2020-11-20T23:59:59+0000"}