{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-10-30T10:02:26+0000", "description": "&lt;p&gt;Community Mental Health Support Worker (Band 4)&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a full-time support worker to join the East sector of the Assessment and Treatment service at St Mary’s House in Eastbourne.&lt;/p&gt;\n&lt;p&gt;The post covers clients living in Eastbourne, Seaford &amp; Hailsham with severe and&lt;br /&gt;enduring mental health needs. The role will involve working alongside Lead&lt;br /&gt;Practitioners supporting clients with complex needs as well as supporting their&lt;br /&gt;families. There will also be an element of supporting clients &amp; their carers whilst&lt;br /&gt;waiting for a more comprehensive assessment within the service, as well as&lt;br /&gt;monitoring some physical health needs that could be impacting on their mental&lt;br /&gt;health.&lt;/p&gt;\n&lt;p&gt;It is preferable that you have experience of working with people in a community&lt;br /&gt;mental health setting but this is not essential. You will need to be flexible and&lt;br /&gt;adaptable as modern mental health services are constantly changing in response to&lt;br /&gt;best practice.&lt;/p&gt;\n&lt;p&gt;You will need to be caring, compassionate and a good communicator, with a&lt;br /&gt;commitment to improving the lives of our service users through creative, evidence-&lt;br /&gt;based practice and support the transfer of the clients care to other service providers&lt;br /&gt;as appropriate.&lt;/p&gt;\n&lt;p&gt;You will be required to maintain records to a high standard, maintain the client’s&lt;br /&gt;safety whilst open to the team by reviewing care plans, risk assessments and&lt;br /&gt;interventions in collaboration with the Lead Practitioner, Client and Carers. You will&lt;br /&gt;support them to achieve these goals as identified and agreed, and when appropriate&lt;br /&gt;you will support the client, and their family to be discharged from secondary mental&lt;br /&gt;health services and maintain their mental health utilising support from alternative&lt;br /&gt;services.&lt;/p&gt;\n&lt;p&gt;To achieve this, you will need to be keen to embrace new ways of working and&lt;br /&gt;enthusiastic about improving clinical practice in line with the latest research and&lt;br /&gt;organisational learning. You will be required to have strong communication and&lt;br /&gt;people skills, as well as be able to demonstrate a desire and ability to meet&lt;br /&gt;community service demands in an ever-changing landscape.&lt;/p&gt;\n&lt;p&gt;In return we can offer a support from a well-established team in a supportive working&lt;br /&gt;environment; robust supervision of all staff on the team and access to training&lt;br /&gt;opportunities to assist you to realise your potential and achieve a greater degree of&lt;br /&gt;job satisfaction. As a Trust employee you will enjoy the standard NHS annual leave&lt;br /&gt;entitlement and pension schemes.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Jay Jameson-Allen&lt;/p&gt;\n&lt;p&gt;Job title Service Manager&lt;/p&gt;\n&lt;p&gt;Email address julianna.jameson-allen@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01323 747224&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;For further information, please contact Interim Team Leader Paula Weakford or&lt;br /&gt;Service Manager Jay Jameson-Allen on 01323 747224.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Marys&#39;s House, , Eastbourne", "postalCode": "BN21 3UU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7729", "longitude": ".28379"}}, "title": "Senior Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249630", "validThrough": "2020-11-11T23:59:59+0000"}