{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum plus Outer HCAS"}}, "datePosted": "2020-11-06T16:27:26+0000", "description": "&lt;p&gt;NHS South West LondonClinical Commissioning Group (CCG)is responsible for planning, commissioning and buying healthservices for people living and working in South West London. As a CCG, we’re a membership organisation made up of over 180 GP practices within South West London. We serve just under 1.5 million people across our six diverse boroughs: Croydon, Kingston, Merton, Richmond, Sutton and Wandsworth. We manage local healthcare budgets of over £2.3 billion andcommission a range of health services on behalf of our residents. The services that we’re responsible for include primary care (the services you receive at your GP practice), hospital treatment, rehabilitation services, urgent and emergency care, community health services, mental health and learning disability services.&lt;/p&gt;\n&lt;p&gt;Please note: applications from NHS staff in London at risk of redundancy will be given priority.&lt;/p&gt;\n&lt;p&gt;The Croydon Borough Team of NHS South West London CCG together with their health and social care partners have been at the forefront of NHS organisational innovation to support the design and oversight of integrated services that meet the needs of the borough’s diverse population.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and conciencious individual to support the leaders of this exciting work as part of the Corporate Borough Team. Previous experience in providing administrative support within a team is essential and involvement with projects would be an advantage.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Key responsibilities:&lt;/p&gt;\n&lt;p&gt;• Supporting a department of the CCG Croydon Borough team with a complex and demanding workload&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing some diary management to a senior officer&lt;/li&gt;\n&lt;li&gt;Scheduling meetings and arrange the timely distribution of papers&lt;/li&gt;\n&lt;li&gt;Producing high quality meeting notes and tracking progress/ updates&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;• Handling confidential organisation and personal information&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have strong time management skills and clear communication both written and verbal, presenting a highly professional approach to the busy and varied work. The post holder must have the ability to build and maintain good working relationships with a wider variety of people at all levels and work effectively as part of a team.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS South West London CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128178"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "2nd Floor Zone G, Mint Walk, Croydon CR0 1EA", "postalCode": "SW15 2SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4588", "longitude": "-.209997"}}, "title": "Support Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260606", "validThrough": "2020-11-20T23:59:59+0000"}