{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907- £30,615 per annum pro r"}}, "datePosted": "2020-11-03T15:31:01+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and highly motivated individual to support the General Surgery management team within the Surgical Division. As a member of the Care Group Team you will be responsible for providing staff management at St Richards as well as providing efficient, timely and responsive support in order to ensure the patients remain centric to all we do.&lt;/p&gt;\n&lt;p&gt;The role is varied and involves direct line management to the secretaries and administration support staff within the Care Group.&lt;/p&gt;\n&lt;p&gt;In addition the role will support all other aspect of administration to the Care Group including management of the General Surgery rota, clinic utilisation, theatre lists, on-call, RTT validation/performance, Colorectal cancer and PALS complaints. The successful candidate will be required to possess excellent interpersonal skills along with a varied knowledge of a number of hospitals IT systems.&lt;/p&gt;\n&lt;p&gt;This role requires an excellent eye for detail, accuracy and you must be able to work to tight deadlines and at times under pressure. The role is based at St Richards Hospital, Chichester but the successful applicant may be required to work across site at Worthing Hospital. If you think you have what it takes and want to join a dedicated and professional team of friendly staff who want to make a difference then please apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie MorganJob titleAssistant Care Group ManagerEmail addressdebra.morgan@nhs.netTelephone number07827 552652&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121075.png", "name": "Western Sussex Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Richards Hospital, Chichester", "postalCode": "PO19 6SE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8436", "longitude": "-.768008"}}, "title": "Care Group Support Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254558", "validThrough": "2020-11-17T23:59:59+0000"}