{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-05T16:01:34+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the Contracting team at Birmingham and Solihull CCG. We are looking for a fixed term Band 7 Assitant Contracts Manager to join our busy and energetic team. The Contracts team manage a variety of acute and mental health contracts with over 300 contracts within the portfolio.&lt;/p&gt;\n&lt;p&gt;Birmingham and Solihull CCG is the largest CCG in England and is responsible for the commissioning of health care services for a diverse population of 1.3m people. As a strong strategic commissioner working at scale, we are committed to improving the experience and health outcomes for local people and reducing health inequalities. We have a revenue budget of £1.8 billion and employ approximately 340 staff across a range of disciplines that support the commissioning agenda. Key to successful commissioning is our role as leader and partner within the development of safe and effective health care.&lt;/p&gt;\n&lt;p&gt;The Assistant Contracts Manager role will work to the Senior Contract Manager. The post holder will be responsible for supporting the day to day management of the CCGs Mental Health contract portfolio and will act as operational lead for a number of contracts as agreed with the Senior Contract Manager. Responsibilities will include tasks such as: managing and chairing contract review meetings; undertaking a key role in ongoing relationship management with both internal and external stakeholders; maintaining and development of contractual processes and mechanisms; and acting as lead negotiator for a number of small-medium sized contract during the annual planning round. As part of the Finance and Contracting team you will be based in Central Birmingham and will be required to travel across Birmingham and Solihull.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will possess some experience working within an NHS contracting environment, excellent written and verbal communication skills and will be a team player. You will be educated to degree level or possess equivalent previous proven experience.&lt;/p&gt;\n&lt;p&gt;If you are interested in this role, then we would be keen to hear from you. For any queries related to this post please contact Angela Szabo on &lt;span&gt;angela.szabo@nhs.net or 07736197204&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You are encouraged to submit applications at the earliest opportunity as we reserve the right to close this vacancy earlier than the closing date stated, if we receive a high number of applicants.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date - 13/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date - 18/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128734.jpg", "name": "Birmingham and Solihull CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128734"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wesleyan, Birmingham", "postalCode": "B4 6AR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4833", "longitude": "-1.8967"}}, "title": "Assistant Contracts Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258480", "validThrough": "2020-11-13T23:59:59+0000"}