{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-12T17:11:34+0100", "description": "&lt;h1&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h1&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Are you looking to progress your nursing career in one of the UK’s most respected mental health trusts?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to be part of a dedicated team committed to those with mental health problems enjoy a better future?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to do a job that makes a difference every day?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a Ward Manager to provide operational leadership within one of our Secure units based in Dawlish.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Directorate provides forensic mental health services for the south west region and has an excellent reputation - a recent CQC inspection rated our services as “Outstanding”.&lt;/strong&gt;We support people who, as a consequence of their mental health problems, have had contact with the legal system and require a safe and secure environment that enables them to receive a wide range of treatments, therapies and care to assist in their recovery.&lt;/p&gt;\n&lt;p&gt;Langdon Hospital is a 111 acre campus style site which includes the recently opened Dewnans Centre, a £27 million state of the art medium secure unit, as well as low secure and open wards.&lt;/p&gt;\n&lt;p&gt;As a Ward Manager, you will need excellent communication and leadership skills to ensure collaborative work with service users, utilising the well-being and recovery model, to provide the highest quality of care. This role will require the post-holder to provide strong, practical and clinical leadership with the highest regard to valuing and supporting your team.&lt;br /&gt;&lt;br /&gt;You will have the confidence and skills to support your team to respond to both the physical and mental well-being needs of your patients in partnership with a multi-disciplinary team and be a strong advocate for your patients. Successful candidates will need to demonstrate a sound experience of risk assessment and management and will be committed to the principles of service user and carer involvement; as well as showing expertise in budgetary management and being able to understand and meet performance criteria.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will be an Registered Nurse (Mental Health) with post registration experience, including significant experience in a Band 6 position. In return we offer a highly supportive and cohesive multi-disciplinary team with a range of opportunities to further develop your abilities and career.&lt;/p&gt;\n&lt;p&gt;Working as part of Devon Partnership NHS Trust, you will make a difference to people’s lives from the moment you start.&lt;/p&gt;\n&lt;p&gt;For an informal chat please contact Sarah Burford&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;The location&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Langdon Hospital, Dawlish&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Overall Devon Partnership NHS Trust has been rated as ‘Good’ by the Care Quality Commissioners and we have supported our medical leaders within national roles at the Royal College of Psychiatry and NHS England.&lt;/p&gt;\n&lt;p&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Our offer to you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive.&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;If you are looking to relocate to the fabulous county of Devon we have a relocation package that may be suitable for you. We offer up to £8,000 which can be used for renting or buying a property.&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working where this is possible&lt;/li&gt;\n&lt;li&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service with the NHS so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;li&gt;Free onsite parking, patient-led café and gym&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Refer a friend scheme applies – both earn up to £500&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt;&lt;strong&gt;Living here&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Living in Devon offers you a fantastic lifestyle and a beautiful place to live and work and particularly if you work at Langdon Hospital – even your commute to work can lead you alongside the coast or over the moors. Throughout the county there are exceptional schools, and you’ll never be short of activities to fill your evenings and weekends – from cycling, walking and water sports to city shopping trips, theatre trips, bustling nightlife and great restaurants.&lt;/p&gt;\n&lt;p&gt;If you’re looking for an innovative and rewarding place to work, plus a beautiful place to live, then joining Devon Partnership NHS Trust is the right place for you&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Great place to work. Great place to live&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dawlish", "postalCode": "EX7 0NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5997", "longitude": "-3.46819"}}, "title": "Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223312", "validThrough": "2020-11-30T23:59:59+0000"}