{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum, HCA Inc, pro rata par"}}, "datePosted": "2020-11-05T12:46:03+0000", "description": "&lt;p&gt;East London Community Eating Disorders Service for Children and Young People CAMHS &lt;br /&gt;Band 7 Eating Disorders Family &amp; Systemic Psychotherapist&lt;br /&gt;Permanent post&lt;br /&gt;5 days a week - 37.5 hours&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is an exciting opportunity to join our multi-disciplinary Community Eating Disorders Service for Children and Young People (CEDS-CYP) which serves young people with eating disorders and their families in the London Boroughs of Newham, Tower Hamlets and City &amp; Hackney; an ethnically-diverse population. We are an innovative service that was launched in 2016 and strives to contribute to continued improvement and towards eating disorder research.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for a family &amp; systemic psychotherapist who combines experience working with children and families with a special interest in eating disorder, and who would enjoy being part of a friendly and creative team. The post involves the opportunity to work with a broad range of eating disorder presentations as well as any comorbid mental health diagnosis to allow for the provision of a holistic care package for the young person. The post-holder will also have a key role in our systemic family therapy clinic.&lt;br /&gt;You will be part of a team of multidisciplinary professionals including Psychiatry, Psychology, Nursing, Paediatrics, and Dietetics. We are looking for a reflective family &amp; systemic psychotherapist who can work effectively within multi-disciplinary contexts, communicates well, enjoys working with individuals, families and groups, and will bring motivation, enthusiasm and commitment to the role. Training opportunities are available to develop specialist skills in eating disorder care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We welcome phone calls or visits from interested candidates. &lt;br /&gt;Applications are welcome from those due to complete their clinical training.&lt;br /&gt;Please contact Dr Laura Fialko 02082155270; l.fialko@nhs.net &lt;br /&gt;Interview date: 24th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLaura FialkoEmail addressl.fialko@nhs.netTelephone number02082155270Additional contact information&lt;/p&gt;\n&lt;p&gt;Laura Fialko, telephone 02082155270, email l.fialko@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SS Community Eating Disorders Service, LONDON", "postalCode": "E14 8HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5113", "longitude": "-.02872"}}, "title": "Eating Disorder Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257702", "validThrough": "2020-11-15T23:59:59+0000"}