{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "VSM"}}, "datePosted": "2020-10-23T16:16:58+0100", "description": "&lt;h1&gt;&lt;strong&gt;Chief Medical Officer – Hampshire and Isle of Wight ICS (Hosted by Southampton CCG)&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;The Hampshire and Isle of Wight Integrated Care System (ICS) is in a key stage of development. In establishing the ICS, we are evolving our culture and refining our leadership and partnership working arrangements to enhance our ability to deliver our vision and plan. We are enabling organisations and places to work even more effectively together to make the most of our resources, tackle the challenges we face, redesign care and ultimately improve the health and wellbeing of the population we serve.&lt;/p&gt;\n&lt;p&gt;The Chief Medical Officer is an integral part of the newly created ICS executive team, which will work together with our unified health and local government leadership community to implement our shared plans for the 1.8m people we serve.The Chief Medical Officer will lead the medical and wider clinical community of the Hampshire and Isle of Wight system, along with the Chief Nurse, to transform the quality of care and improve health outcomes. Candidates must be medically qualified with significant experience working across systems, delivering successful transformation and programmes of change. They must be credible, determined and able to empower and lead others to innovate and continually strive for improvement.Further information can be found within the job description and supporting information.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role, please contact Laura Malcolm, Head of Chair and Chief Executive’s office on 07341007416 or via email: laura.malcolm@nhs.net or Kim Haarhoff, Executive PA via kim.haarhoff@nhs.net. If you have any other, queries in relation to this vacancy please email: nhccg.hiowconsultation@nhs.net&lt;/p&gt;\n&lt;p&gt;Interview and assessment process: 23rd and 24th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Southampton CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128536"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester", "postalCode": "SO23"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.074", "longitude": "-1.31193"}}, "title": "Chief Medical Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241283", "validThrough": "2020-11-08T23:59:59+0000"}