{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-20T16:16:23+0100", "description": "&lt;p&gt;We have an exciting opportunity within an All Age Disability team for an Advanced Social Work Practitioner who will support the Team Manager to lead their team into further integration with our health colleagues.&lt;/p&gt;\n&lt;p&gt;As an Advanced Social Work Practitioner you will possess highly developed specialist knowledge of social work practice in children with disabilities and be registered with Social Work England. You will be experienced in child protection and will be able to demonstrate that you meet the essential criteria of the role included within the job description. You will be expected to deputise for the Team Manager in their absence.&lt;/p&gt;\n&lt;p&gt;As an ADSW you will have responsibility for overseeing the work of the team as well as co-ordinating safeguarding investigations for the people we support. You will support your less experienced colleagues and lead the team with practice improvement.&lt;/p&gt;\n&lt;p&gt;Our team works with children and young people who have complex needs. We are looking for an individual who is caring and compassionate who can support them, and their carers, to get the outcomes they need. We have statutory responsibilities for CIN, CP and LAC.&lt;/p&gt;\n&lt;p&gt;Our staff work closely with health colleagues and we are at the start of the process for integrating both teams to ultimately provide one responsive and cohesive service for the people we support. CWP is at the forefront of health and social care integration and this service lends itself to developing new, innovative ways of working together.&lt;/p&gt;\n&lt;p&gt;You will be a person centred practitioner and will carry out Children and family Assessments and Care Act assessments, develop personalised support plans, complete mental capacity assessments, be involved in court work and take the lead on safeguarding enquiries. Experience of working with people with complex needs is desirable but what is crucial is a genuine wish to work collaboratively with people to meet their goals and aspirations&lt;/p&gt;\n&lt;p&gt;If you are interested in the CWD Advanced social worker Practitioner position please contact Debbie Pearce on 0151 488 8090 .&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Millennium Centre, Wirral", "postalCode": "CH46 1PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4159", "longitude": "-3.09343"}}, "title": "Advanced Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235198", "validThrough": "2020-11-10T23:59:59+0000"}