{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17049", "minValue": "17049", "unitText": "YEAR", "value": "£17,049 per annum pro rata"}}, "datePosted": "2020-10-20T15:47:03+0100", "description": "&lt;p&gt;An opportunity has arisen for a Workforce Support Administrator Apprentice to join our team based in Whitchurch, Bristol. This is an interesting and varied full-time role, offered on a fixed term contract (18-24 months dependant on apprenticeship length) initially, with the possibility of moving into a permanent role following successful completion.&lt;/p&gt;\n&lt;p&gt;As a Workforce Support Administrator Apprentice at BrisDoc Healthcare Services, you will work as part of the Workforce Team providing an efficient and effective service to our colleagues across the organisation. You will gain experience of providing support within a busy, generalist human resources (HR) environment, from recruitment to retirement. You will learn about HR legislation and policy and develop the skills to handle sensitive situations professionally and confidentially. You will also use HR systems and Excel to ensure our data is up to date and accurate; all while being supported to study for your Level 3 apprenticeship.&lt;/p&gt;\n&lt;p&gt;BrisDoc has nearly 20 years’ experience of delivering primary health care across Bristol, North Somerset and South Gloucester, operating an Integrated Urgent Care service together with running two dedicated GP Practices in Bristol and the Homeless Health Service.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on being a fantastic place to work, somewhere that you will feel valued, supported, developed and part ofa family. We strive to make sure every member of the team feels proud of the work they do and the service that we offer to our patients.&lt;/p&gt;\n&lt;p&gt;Successful applicants in this role will have empathy, effective communication skills and a great work ethic. You will be reliable, flexible and able to competently manage conflicting priorities.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full-time (37.5 hours) with allowance for appropriate study time.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£17,049 per annum (pro rata)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Other benefits:&lt;/strong&gt; NHS Pension (offering 14.3% employers contribution)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 8th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Interviews held on: week commencing 16th November 2020&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To apply: &lt;/strong&gt;Please visit the BrisDoc website and click on the &#39;Work with us&#39; tab to download an application pack OR complete an NHS Jobs application. For more information contact HR team on 0117 9370901. For more information about the role or if you require additional guidance in completing the application form, please contact the Workforce Team on 0117 9370901.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applicants are advised that this advert will close as soon as we receive a sufficient number of applications. As a consequence, you are urged to submit your application as soon as possible. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;To enable us to deliver excellent patient care, we need people from all backgrounds, with a range of experiences, so that we are truly representative of the communities we serve. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are working hard to increase diversity and inclusion within our organisation including:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;people from Black, Asian and Minority Ethnic communities,&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;disabled people&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;LGBT+ communities&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;all ages, faiths, religions and genders&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;We want to encourage individuals from all backgrounds, experiences and beliefs, who share our mission of ‘patient care by people who care’ to work with us&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BrisDoc Healthcare Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130535"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS14 0BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4116", "longitude": "-2.59293"}}, "title": "Workforce Support (HR) Administrator Apprentice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235126", "validThrough": "2020-11-08T23:59:59+0000"}