{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28000", "minValue": "28000", "unitText": "YEAR", "value": "£28,000 per annum"}}, "datePosted": "2020-10-30T09:08:38+0000", "description": "&lt;p&gt;Are you a nurse looking for a rewarding role? Do you want to progress quickly in your career? You’ll find a friendly welcome and a home for your talents at Practice Plus Group. Whether you’re coming from an NHS or private hospital or another care setting, we’ll give you time to use your nursing skills – and help you build a fulfilling career.&lt;/p&gt;\n&lt;p&gt;We offer nurses clear career paths with lots of exciting options. Where you go is up to you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Day Surgery Nurse to join our team based in the CQC rated outstanding hospital in picturesque Plymouth. You will be part of a close knit collaborative team who pride themselves in providing the highest standard of care to our patients and their families. Our inpatients team a comprised of experienced nurses and healthcare assistance supported by our welcoming Day Surgery Manager, Linda. As well as undertaking basic ward duties you will oversee the new patient admissions, ensuring key documentation is completed and introducing them to the care team looking after them. All of our work is planned so you will be able to plan your week with ease knowing your work schedule won’t change.&lt;/p&gt;\n&lt;p&gt;You will liaise with the wider Practice Plus Group medical team to ensure the patient’s treatment is carried out whilst maintaining the principles of patient confidentiality.&lt;/p&gt;\n&lt;p&gt;Your sound clinical and infection control knowledge combined with your ability to solve problems and think both literally and laterally will enable you to coach and support others in your team. We encourage sharing of best practice across our site to develop your skills and take advantage of our excellent clinical leadership knowledge.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In turn we will support you to help you grow in your role and take your career in the direction you want to go. We’ll help you be the best you can be. When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career.&lt;/p&gt;\n&lt;p&gt;Everything we do is focused on providing a high standard of safe and effective patient care. As a CQC Outstanding rated hospital we believe in developing and nurturing our people.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contactglenn.coles@practiceplusgroup.comin our friendly resourcing team, or call 01189 521 951.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidates but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL6 5XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4124", "longitude": "-4.1177"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249413", "validThrough": "2020-11-26T23:59:59+0000"}