{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-06T09:16:09+0000", "description": "&lt;p&gt;This post is fixed term until the 31/03/2022.&lt;/p&gt;\n&lt;p&gt;This post is required for full-time duties to provide support and development on the Desktop Infrastructure used to deliver a range of ICT services and applications to end users of Hywel Dda University Health Board.&lt;/p&gt;\n&lt;p&gt;Provide second line support and incident resolution to users of I.T. systems and services within the Hywel Dda Health Board acting as an effective interface between end users and the various I.T. support teams at both a local and national level.&lt;/p&gt;\n&lt;p&gt;Undertake incident, change and problem recording on our Service Desk Tool and ensuring these are tracked effectively during their lifecycle.&lt;/p&gt;\n&lt;p&gt;Undertake installation and configuration of new computer hardware and software accurately recording relevant information and disseminating information to members of the team.&lt;/p&gt;\n&lt;p&gt;A customer service facing person is required with a practical approach to problem solving with excellent communication and telephone skills.&lt;/p&gt;\n&lt;p&gt;A HNC qualification in an IT or related discipline (or equivalent) is essential as well as relevant work experience.&lt;/p&gt;\n&lt;p&gt;As the role will cover multiple Health Board sites, the ability to travel between sites in a timely manner is essential.&lt;/p&gt;\n&lt;p&gt;Hywel Dda University Health Board offer a range of benefits for employees:-&lt;br /&gt;&lt;br /&gt;- NHS Pension Scheme&lt;br /&gt;- 27 days annual leave rising to a maximum of 33 days after 10 years’ service&lt;br /&gt;- Range of corporate benefits such as salary sacrifice schemes and discounts in restaurants and shopping outlets&lt;br /&gt;- Childcare Vouchers&lt;br /&gt;- Flexible Working&lt;br /&gt;- Occupational health and occupational well-being service&lt;br /&gt;&lt;br /&gt;Our Health Board is also based in a beautiful part of the world with an abundance of beaches, coastal paths and visitor attractions.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSteve LeeJob titleDesktop Team LeaderEmail addresssteve.lee@wales.nhs.ukTelephone number01267 283369&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "ICT Desktop Support Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258993", "validThrough": "2020-11-22T23:59:59+0000"}