{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80000", "minValue": "80000", "unitText": "YEAR", "value": "80,000"}}, "datePosted": "2020-11-02T08:54:17+0000", "description": "&lt;p&gt;The Priory Hospital Cheadle Royal has 14 different wards and cares for 151 patients. Each ward has a dedicated Multi Disciplinary Team which includes a Consultant Psychiatrist, Speciality Doctor, Ward Manager, Psychologist, Occupational Therapist and support services. Our primary aim is to support and care for our patients.&lt;/p&gt;\n&lt;p&gt;We operate a comprehensive inpatient mental health service for a range of differing service lines comprising acute, Eating Disorders, Rehabilitation and Recovery, personality disorder and psychiatric intensive care services.&lt;/p&gt;\n&lt;p&gt;Our PICU services consist of 2 Male PICUs and 1 Female PICU, specialising in the treatment of patients with highly complex psychiatric presentation and who cannot be managed in acute settings.&lt;/p&gt;\n&lt;p&gt;The EDU combines an in patient service as well as a day care service and is the principal provider to the NHS in the North of England focussing on positive physical and psychological outcomes.&lt;/p&gt;\n&lt;p&gt;The R&amp;R comprises of 2 services for males – an intense rehabilitation and a step-down service which provides a graded hierarchy of independent living designed to facilitate a seamless transition to community living.&lt;/p&gt;\n&lt;p&gt;The PD unit is relatively new to Priory Cheadle. It is a locked rehabilitation unit that runs a comprehensive Dialectical Behaviour Therapy programme for females with emotionally unstable personality disorders.&lt;/p&gt;\n&lt;p&gt;Our Acute service for males and females offer a 24 hour admission service to support local NHS services and PICU wards. The service has contracts with Pennine and Manchester NHS trusts. The ethos is to provide support in a crisis and offer therapeutic engagement during the patients stay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a specialty grade doctor working on any of our Adult wards, you will work alongside the experienced multidisciplinary team in aspiring to provide excellent bespoke care to enable our patients to fulfil their recovery goals and work towards discharge to the life they want. The Specialty Doctor has a key role in working cohesively with a supervising consultant, nursing team and wider MDT to deliver best outcomes for complex patients with challenging presentations.&lt;/p&gt;\n&lt;p&gt;Due to the specialist nature of these services, the Specialty Doctor has a key role in providing evidence-based assessment and treatment under direct supervision and support from the consultant. We have a national reputation for offering treatment for complex and challenging presentations in all our service users.&lt;/p&gt;\n&lt;p&gt;The post-holder reports to the supervising consultant and is expected to have formal supervision at a frequency compatible with Priory policy, and to be a member of a peer group within Priory. The post holder will also participate in a hospital academic program. Given the acuity and high turnover, post holder will be expected to take initiative within the remit of their role.&lt;/p&gt;\n&lt;p&gt;Working hours are 37.5 hours per week, which conventionally runs from 9am to 5pm and there is an on call requirement of 1:10.&lt;/p&gt;\n&lt;p&gt;It is expected that the post-holder will display flexibility around working hours if matters of clinical safety require this. Funding is available centrally for courses and conferences in line with requirements of your CPD. There is specified study leave for achieving PDP in line with CPD. Attendance at doctors meetings on site or within Priory is expected and encouraged.&lt;/p&gt;\n&lt;p&gt;Other benefits you can expect upon joining our Cheadle Royal Hospital include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;25 days annual leave (plus 8 Bank holidays) increasing with length of service&lt;/li&gt;\n&lt;li&gt;Birthday leave&lt;/li&gt;\n&lt;li&gt;Free on site parking&lt;/li&gt;\n&lt;li&gt;Subsidised meals&lt;/li&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Priory Perks discount portal&lt;/li&gt;\n&lt;li&gt;Dedicated career pathway&lt;/li&gt;\n&lt;li&gt;Enhanced sick/maternity pay after 1 years service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the UK’s leading providers of behavioural care and specialist support services to adults and young people, Priory Group promise a challenging and fulfilling career with the support of a world class organisation willing to invest in your development.&lt;/p&gt;\n&lt;p&gt;Across our network of hospitals, residential care homes, education facilities and supported living services, we are making a real and lasting difference to the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.Priory Group will cover the cost of a DBS check.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "SK8 3DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.375", "longitude": "-2.22149"}}, "title": "Speciality Doctor (Adult Services)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251355", "validThrough": "2020-11-30T23:59:59+0000"}