{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-06T09:15:57+0000", "description": "&lt;p&gt;We are looking for an enthusiastic and experienced Speech and Language Therapist (SLT) to work as part of the secure and specialist learning disability division. The post will be based in Rowan View Hospital, a new purpose-built medium secure unit for people with learning disabilities and mental illness. Rowan View represents our strong ambition for a new centre of excellence in forensic care:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Specialist learning disability and mental health services.&lt;/li&gt;\n&lt;li&gt;123 beds over eight wards: female learning disability (Delamere ward); male learning disability (Astley and Birkdale wards); female mental illness (Eden ward); male mental illness (Thornton, Rivington, Vale and Marbury wards).&lt;/li&gt;\n&lt;li&gt;An environment that will promote the integration of physical and mental wellbeing.&lt;/li&gt;\n&lt;li&gt;A social hub incorporating a café, therapy rooms, multi faith room, sports hall, gymnasium, music rooms, skills for life room, IT suite, bank and a physical health suite.&lt;/li&gt;\n&lt;li&gt;Use of therapeutic technology for the benefit of patients and staff including virtual reality and avatar therapy.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Rowan View represents a step change in care for service users, preparing them for life afterwards. It will deliver innovative treatments to improve recovery times for people with mental illness and learning disabilities.&lt;/p&gt;\n&lt;p&gt;As the Specialist Speech and Language Therapist, you will be responsible for managing a clinical caseload involving the assessment and management of dysphagia and communication difficulties with adults with learning disabilities and mental illness. You will provide support to the wider MDT, represent Speech and Language Therapy in projects or meetings within the hospital, and provide relevant training. You will offer interventions to support risk management, positive behaviour support plans and communication. You will work collaboratively with professional colleagues and provider services to deliver person-centred care. You will provide leadership and guidance on communication and dysphagia within the MDT, and to mainstream and provider services.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work within a new purpose-built medium secure hospital within an expanding and developing Speech and Language Therapy service. The division is lead by a Principle Speech and Language Therapist and there will be support and supervision from a Highly Specialist Speech and Language Therapist also working within the hospital. The service also includes a wider network of Speech and Language Therapists and assistants who meet regularly to discuss clinical cases and service improvement.&lt;/p&gt;\n&lt;p&gt;Mersey Care NHS Foundation Trust provides specialist inpatient and community mental health, learning disabilities, addiction and acquired brain injury services for the people of Liverpool, Sefton and Kirkby, Merseyside. We also provide community physical health services in Liverpool, Sefton, secure mental health services for the North West of England, the West Midlands and Wales and specialist learning disability services across Lancashire, Greater Manchester, Cheshire and Merseyside.&lt;/p&gt;\n&lt;p&gt;We work closely with service users, carers and partner organisations; we have been able to make real improvements to our diverse range of services, from health and social care, right through to high secure provision. This passion to improve has been recognised by the CQC who have recently rated us “Good”.&lt;/p&gt;\n&lt;p&gt;Mersey Care’s vision and values of Continuous Improvement, Accountability, Respect, Enthusiasm and Support (CARES) drive our organisation and the way we work together to deliver services. Applicants will be expected to demonstrate, during recruitment and any subsequent employment with the Trust, that their behaviour supports our values.&lt;/p&gt;\n&lt;p&gt;The CQC stated “It was clear that most staff across the organisation understood, and were committed to, the vision and values of the organisation. These were well communicated and the work to win both hearts and minds was apparent”.&lt;/p&gt;\n&lt;p&gt;We take positive action to support disadvantaged groups and also particularly encourage applications from BAME, disabled and LGBT people that are under-represented in our workforce. Furthermore we welcome applications from reservists and ex-armed forces as we recognise the benefits of the values, skills, training and experience that they bring to their work with us. We encourage all applicants to share their equality information with us.&lt;/p&gt;\n&lt;p&gt;Flexible working requests will be considered for all roles.&lt;/p&gt;\n&lt;p&gt;If you are interested in applying or would like to hear more about this role, please contact Krystina Crolla-Barker – Principle Speech and Language Therapist (07587 666 428) or Elizabeth Hargreaves – Highly Specialist Speech and Language Therapist (01254 821 533) to have an informal discussion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Shortlisting is planned for 24th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are planned for 1st December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKrystina Crolla-BarkerJob titlePrinciple Speech and Language TherapistEmail addresskrystina.crolla-barker@merseycare.nhs.ukTelephone number07587666428&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rowan View, Maghull", "postalCode": "L31 1HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5187", "longitude": "-2.91537"}}, "title": "Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258984", "validThrough": "2020-11-23T23:59:59+0000"}