{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 -  £36,738  per annum inc"}}, "datePosted": "2020-10-26T13:46:42+0000", "description": "&lt;p&gt;We are recruiting for experienced band 5 nurses with at least 6 months acute experience and IV accreditation to join our world class Adult Critical Care Unit at the Royal London Hospital.&lt;/p&gt;\n&lt;p&gt;We are extremely proud to have been rated as ‘outstanding’ for caring by the Care Quality Commission in 2016 and this year Barts Hero Award Winners:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@Team ACCU were:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Winner of: ‘Fund raising Team’ of the Year raising donations by competing in the Tough Mudder Challenge and from fund raising with patients families.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Highly recommended for Engaging with their patients&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As the UK’s largest trauma centre our ACCU unit leads the trauma network for North East London and Essex. It is a leading specialist centre with an international reputation for caring for some of the most seriously injured patients in London and beyond. In addition to trauma the Royal London Hospital also provides specialist care in neurosciences, a hyper-acute stroke centre, and acute general medical, along with surgical and obstetric services.&lt;/p&gt;\n&lt;p&gt;Working within a highly skilled, dynamic multi-disciplinary team, in our busy and energetic 44 bedded Adult Critical Care Unit (ACCU), which accommodates both level 3 and level 2 patients. This is an excellent opportunity for, energetic, enthusiastic staff nurses with at least 6 months acute experience, to provide a high standard of care to patients within a challenging, yet supportive acute hospital setting.&lt;/p&gt;\n&lt;p&gt;In return we will provide exciting learning opportunities within both the clinical and educational setting to enable you to continue to develop and grow.&lt;/p&gt;\n&lt;p&gt;Barts Health has a multi-cultural and ethnically diverse population. This offers a wide spectrum of healthcare challenges which can be both complex and rewarding.&lt;/p&gt;\n&lt;p&gt;As part of our Adult Critical Care commitment to enhance the working lives of our staff, we offer flexible working arrangements, childcare vouchers, family-friendly policies and staff benefits including an excellent pension scheme. We are committed to providing a culture of continuous learning, which actively supports the professional and personal development of our staff.&lt;/p&gt;\n&lt;p&gt;Would you like to join this dynamic Award Winning Team?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter @teammaccu to find out more about us.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisted applicants will be offered interview arrangements shortly after applying within a time frame that works for you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Hewitt, Matron, on helen.hewitt@bartshealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal London Hospital, London", "postalCode": "E1 1FR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.059802"}}, "title": "Critical Care Registered Nurse - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242741", "validThrough": "2020-11-08T23:59:59+0000"}