{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata per annum"}}, "datePosted": "2020-10-26T11:46:09+0000", "description": "&lt;p&gt;We are Manchester Local Care Organisation - an exciting, new public sector organisation that is bringing together NHS community health services and social care services in the city. We’re driven by the aim of improving the health of local people in Manchester by working across organisational boundaries.&lt;/p&gt;\n&lt;p&gt;The first health and social care staff have been deployed to us from April 2018 and are now starting to work in new ways across the city. Our teams work as one in the neighbourhoods they serve – delivering and designing services in partnership with local people. We also provide key services that work across wider localities and city-wide. We believe that our pioneering approach will make a massive difference to the health of people in our city and we are looking for you to join our team and help us do this.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Macmillan Clinical Nurse Specialist in Palliative Care Band 7 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has now arisen within Central Manchester Macmillan Palliative Support Service for a Clinical Nurse Specialist in Palliative Care.&lt;/p&gt;\n&lt;p&gt;The post holder will work as part of the Macmillan Specialist multi-disciplinary team comprising of Medics, Dietician, Occupational Therapist, Physiotherapist, Nurses, Speech and Language Therapist, Assistant Practitioners, Admin support and Volunteer Coordinators. The team aims to provide effective support palliative care and/or rehabilitation to patients with a life limiting condition requiring palliative intervention.&lt;/p&gt;\n&lt;p&gt;The post holder will provide supportive palliative care to enhance the quality of life for patients / carers with any life limiting illness requiring palliative care, including complex physical, psychological and emotional needs.&lt;/p&gt;\n&lt;p&gt;Recent investment by Macmillan has enabled the Manchester Macmillan Supportive and Palliative Care Service to develop substantially for the city of Manchester; this is an exciting time to join our innovative and expanding team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire RathmillJob titleMacmillan Service ManagerTelephone number0161 248 1252&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Longsight Health Centre, Longsight", "postalCode": "M13 0RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4576", "longitude": "-2.20187"}}, "title": "Macmillan Clinical Nurse Specialist in Supportive &amp; Palliative Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242254", "validThrough": "2020-11-09T23:59:59+0000"}