{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32203", "minValue": "26883", "unitText": "YEAR", "value": "£26,883 - £32,203 per annum (pro rata)"}}, "datePosted": "2020-10-27T14:30:56+0000", "description": "&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice. To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place.  Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition.  The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Public Health England (PHE) is an executive agency of the Department of Health providing; strategic leadership, research, advice and support for Government, local authorities and the NHS in protecting and improving the nation’s health.&lt;/p&gt;\n&lt;p&gt;The National Infection Service is a large and complex part of PHE with services running from sites across England.&lt;/p&gt;\n&lt;p&gt;Travel Health and IHR contributes to the health of British travellers to and from the UK through surveillance, information, advocacy, teaching and research. The section sits within the Tuberculosis, Acute Respiratory, Gastrointestinal, Emerging/Zoonotic Infections and Travel Health Division (T.A.R.G.E.T) in the National Infections Service in Colindale, London. The team also has a central role in supporting the PHE role of UK National Focal Point under International Health Regulations (IHR).&lt;/p&gt;\n&lt;p&gt;The duties of the post are related to supporting the function of the section in its two main areas of work: travel health and International Health Regulations. The job will involve: collecting, collating and entering data for enteric fever enhanced surveillance (ESEF) and travel- associated hepatitis A and producing reports as required. Routine surveillance of other travel- associated infections, managing the travel-associated infection incident database, managing the gastrointestinal infection database including analysis and report writing, managing the IHR and Travel Health mailboxes, providing administrative support in relation to the national focal point function of PHE under IHR, helping to update and maintain the relevant pages of the PHE website and intranet and performing other information officer tasks to support the section scientists and the consultant epidemiologist as required.&lt;/p&gt;\n&lt;p&gt;This is a 10-month fixed term post.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see job description for competencies.&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Parisha Katwa, Parisha.Katwa@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London, Colindale", "postalCode": "NW9 5EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5948", "longitude": "-.254078"}}, "title": "Information officer - Travel Health and IHR", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244960", "validThrough": "2020-11-10T23:59:59+0000"}