{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20405", "minValue": "20405", "unitText": "YEAR", "value": "20,405"}}, "datePosted": "2020-10-19T11:10:31+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Support Worker in Carlisle – Supported Living – Learning Disabilities&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Contract type&lt;/strong&gt;: full-time 37 or 45 hours per week / part-time / bank&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Salary:&lt;/strong&gt; 16,778 - £18,047 per annum – 37 hour contract (based on skills / experience and on satisfactory completion of a probation period)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;£20,405 - £21,949 per annum – 45 hour contract (based on skills / experience and on satisfactory completion of a probation period)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;£8.72- £9.38 per hour&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;Drivers are desirable but not essential.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Do you have genuine passion for supporting people with Autism and/or behaviour that challenges to help them work to achieving their potential in everyday life?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are motivated, enthusiastic, a creative thinker and problem solver with a real desire to support people to make positive choices, decisions, and take action we would really like to hear from YOU.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Job description&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;At Turning Point, we support people with Learning Disabilities across England.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Support Worker, you will make a real difference to people’s lives as you improve their daily living skills. Passionate about people, you will enjoy the scope and support to enhance your own life and career too, as you gain the experience and training you need to progress with us. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Where will I be working?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working in one of our Supported Living facilities in Carlisle.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We endeavour to create positive family relationships offering a good circle of support. There is a strong focus on supporting individuals&#39; lives in a person centred way which includes various activities, shopping, managing own budgets and cooking. We tailor our services to enable people to be as independent as possible.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;What will I be doing?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a hands-on job in which no two days are the same. Your duties will include:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* supporting adults with learning disabilities, autism, communication difficulties and challenging behaviour&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* supporting people with a person centred approach &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* providing and assisting people we support with personal care&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* supporting a full range of daily activities at home and accessing the community&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* supporting people to be as independent as possible and have control over their lives&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* investing time with people we support, understanding the most effective way to deliver positive support and improve person’s quality of life&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* delivering outcome focused support to improve skills, develop person interests and increase person independence&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* ensuring accurate recording keeping and documentation is maintain at required standards to enable effective reviewing of persons support to develop actions plan to help improve all aspects of a person’s life&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;What skills and qualities do I need to have?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Whilst knowledge of learning disabilities and complex needs would be beneficial, it isn&#39;t essential. What is essential is that you are:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;passionate, caring and enthusiastic&lt;/li&gt;\n&lt;li&gt;flexible, patient and non-judgemental&lt;/li&gt;\n&lt;li&gt;a great team player with lots of energy&lt;/li&gt;\n&lt;li&gt;able to demonstrate good communication skills&lt;/li&gt;\n&lt;li&gt;able to complete the physical aspects of the role such as manual handling where needed&lt;/li&gt;\n&lt;li&gt;transferable experience of helping people to manage anxiety&lt;/li&gt;\n&lt;li&gt;you should have the right attitude&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Shift Patterns&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Each service is 24 hour care therefore flexibility is essential. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working on a fair rota system.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that working hours may vary from service to service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;What benefits will I receive?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* A thorough 4 week induction programme and specialist training&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* Comprehensive Learning and Development opportunities - we are Investors in People Silver accredited&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* 28 days holiday, increasing with each year of service until 30 days. Plus the option to purchase additional holidays&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* Flexible benefit options including, bike to work schemes and season ticket loans&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* Competitive Pension and Life Assurance scheme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* Employee Assistance Programme and access to online Health and Wellbeing support&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* Flexible working patterns to support work/life balance &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;* Access to a wide range of discounts including Cinema, Groceries and Gym.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Why Turning Point?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We take pride in the services that we provide. There is one vision that everyone at Turning Point shares, which is held together by our values. These include believing in potential, communicating in a confident way, embracing change and treating each other as individuals.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Running services on a not-for-profit basis, we invest every penny back into our services - and, our people. So, if you are enthusiastic, motivated and committed to support people with Learning Disabilities to live fulfilling lives - here at Turning Point, we don&#39;t just offer you a job: we offer you a career.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;“The prospect of working with people with learning disabilities and autism was a bit daunting as I had no prior knowledge or experience of this. However, I soon found that with a thorough induction programme, approachable on site management and a supportive staff team that I was able to feel confident and effective in my role of a support worker. &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;The people we support are totally unique individuals, meaning that no two days are ever the same. I find them truly inspiring and this makes me want to provide the best support I can. &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Working for turning point has given me a job I am very proud of, of course no occupation is perfect and this one is as challenging as it is rewarding and best of all I get to be part of an amazing team who really make a difference.” &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Support Worker, Wood Street&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;“I enjoy working for Turning Point, Every day is different and you can never anticipate what is going to happen that day. You get to work with incredible people. They make you realise that nothing is impossible and life is amazing. The staff team and management are truly supportive and one of a kind that enables you to do your job effectively.”&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Support Worker, Wood Street &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlise", "postalCode": "CA1 2SF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8924", "longitude": "-2.9012"}}, "title": "Support Worker in Carlisle", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231968", "validThrough": "2020-11-19T23:59:59+0000"}