{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 Per Annum"}}, "datePosted": "2020-10-26T08:22:42+0000", "description": "&lt;p&gt;Lancashire and South Cumbria is situated in the North West of England and has a population of approximately 1.7 million people. It is served by five NHS provider organisations whose services are commissioned by eight Clinical Commissioning Groups with 236 general practices between them.&lt;/p&gt;\n&lt;p&gt;By working together across Lancashire and South Cumbria over the past few years we have made great progress within our Stroke Services supporting improved patient experience and outcomes. We work closely across the trusts to share good practice and support each other and as a system we focus on all aspects of the stroke patient pathway from prevention to acute treatment, rehabilitation and life after stroke.&lt;/p&gt;\n&lt;p&gt;We are continuously looking at how we can improve our services; our aspiration is for our stroke services to be amongst the best on offer in the UK. Whichever organisation you work for, you will find a local Stroke Improvement Plan which underpins a single Integrated Continuous Improvement Plan for Lancashire &amp; South Cumbria.&lt;/p&gt;\n&lt;p&gt;In addition to continuous improvement the key priorities for Lancashire &amp; South Cumbria are implementation of Integrated Community Stroke Rehabilitation, implementation of an Ambulatory Care Model (one-stop rapid assessment/diagnosis for TIA, minor stroke and stroke-like symptoms) and implementation of Hyper-Acute Stroke Units. The use of digital solutions to support the workforce and enable faster diagnosis and more efficient/effective treatment, rehabilitation and long-term support for patients post-stroke is also being progressed as a high priority.&lt;/p&gt;\n&lt;p&gt;We are using the Stroke-Specific Education Framework across the region to: support staff with assessing their level of knowledge and skills; identify and prioritise training needs; and to explore new roles and different ways of working to support our service improvement work.&lt;/p&gt;\n&lt;p&gt;Lancashire and South Cumbria is a great place to live and work and we have a team of passionate, committed staff who want to make a difference.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Acute Stroke Unit has an exciting opportunity for qualified nurses to join our friendly, supportive and dynamic acute nursing team.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be expected to maintain high standards of care which we strive for within our stroke unit, meeting national and local guidelines –the involvement of the stroke pathway begins in the emergency department and you will be contributing to the care and planning throughout the stroke pathway.&lt;/p&gt;\n&lt;p&gt;We are a 24 bedded acute stroke unit. We provide individualised care to all our patients working closely with our multi – disciplinary team. We offer bespoke stroke training to our staff supported by our 2 Stroke Consultant Nurses and stroke nurse practitioner’s.&lt;/p&gt;\n&lt;p&gt;For newly registered nurses we offer a full 12 months preceptorship course which is classroom based study days and in addition to this we offer a ward based competency training pack .&lt;/p&gt;\n&lt;p&gt;As a Band 5 nurse you will care for patients in the acute phase of their stroke and you will be supported by a highly motivated team. This is a busy multi-disciplinary stroke unit where the team is friendly and dedicated to promoting individualised stroke care. Being a band 5 nurse on the stroke unit is demanding, but on the whole is extremely rewarding.&lt;/p&gt;\n&lt;p&gt;We are very proud of our recent achievements - Clinical Team of the year 2019 at the ELHT STAR awards and maintaining ‘A’ status in SNAAP across the acute and Community. We are also in the process of developing a 10 bedded hyper acute stroke unit, which will be incorporated within the ward.&lt;/p&gt;\n&lt;p&gt;All posts are full/part time and all rotational to night duty.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dear Potential Applicant,&lt;/p&gt;\n&lt;p&gt;It is important you are made aware of the changes which East Lancashire Hospitals NHS Trust has implemented with regard to charging for the cost of undertaking Disclosure and Barring Scheme (DBS) Checks (previously known as Criminal Records Bureau or CRB) and how this may impact upon you.&lt;/p&gt;\n&lt;p&gt;As this position is exempted from the Rehabilitation of Offenders Act 1974 and involves work that is identified as a regulated activity as defined in the Safeguarding Vulnerable Groups Act (2006), any offer of employment is provisional upon a satisfactory DBS check being obtained.&lt;/p&gt;\n&lt;p&gt;The cost of an Enhanced Disclosure will be £48.00, which includes a small handling fee.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In line with other NHS organisations in the North West Region, the Trust is now passing the charge for undertaking a DBS check on to candidates in the event they are successfully appointed into the post for which they have applied. Candidates can choose whether to pay this over 1-3 months as a deduction from the monthly salary. By applying for this vacancy you are agreeing to this undertaking in the event you are successfully appointed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vicky Ramsden&lt;/p&gt;\n&lt;p&gt;01254 732080&lt;/p&gt;\n&lt;p&gt;Victoria.ramsden@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Blackburn Teaching Hospitals, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Staff Nurse - Acute Stroke Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241751", "validThrough": "2020-11-16T23:59:59+0000"}