{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum incl. HCAA"}}, "datePosted": "2020-10-28T09:31:32+0000", "description": "&lt;p&gt;An exciting opportunity has become available at the Hillingdon Hospitals NHS Foundation Trust, for a highly motivated and dynamic nurse leader, to undertake the role of Matron for Adult and Paediatric services in the Emergency Department.&lt;/p&gt;\n&lt;p&gt;The Emergency Department operates a round the clock service providing unplanned urgent and emergency care for the people of Hillingdon borough and the surrounding areas of North West London.&lt;/p&gt;\n&lt;p&gt;This is a very exciting time in the development of Hillingdon Hospital, with new build commenced, and plans for extension of the hospital, including the Emergency Department, well underway. In these challenging times, this is a post for someone who is enthused by change, and can think in new ways&lt;/p&gt;\n&lt;p&gt;The Matron will lead the staff to deliver high quality care for patients, using strategic thinking, to support the Trusts&#39; aims, underpinned, by the CARES values, expected of all employees of The Hillingdon Hospital Trust.&lt;/p&gt;\n&lt;p&gt;Strong clinical and professional leadership is an essential part of this role. The post holder will provide visible leadership, to deliver effective team working, good communication and excellent clinical and quality outcomes for our patients, ensuring that robust governance arrangements are in place.&lt;/p&gt;\n&lt;p&gt;As part of the senior management team of the Emergency department, you will work closely with the clinical director, senior medical staff, stakeholders and your peers.&lt;/p&gt;\n&lt;p&gt;For further information on this role, please contact: Margarida Pacheco on:&lt;/p&gt;\n&lt;p&gt;margarida.pacheco@nhs.net or &lt;br /&gt;&lt;span&gt;Phone: 01895 238 282&lt;br /&gt;&lt;/span&gt;&lt;span&gt;Mobile:&lt;/span&gt;&lt;span&gt; 07825063370&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMargarida PachecoJob titleClinical Lead Nurse for Emergency Care &amp; Transformation Co-Chair for the Urgent and Emergency Care workstream, Hillingdon RedevelopmentEmail addressmargarida.pacheco@nhs.netTelephone number07825063370&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Hillingdon Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120945"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hillingdon Hospital NHS Foundation Trust, Uxbridge", "postalCode": "UB8 3NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5255", "longitude": "-.460885"}}, "title": "Matron ED Adults", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245831", "validThrough": "2020-11-13T23:59:59+0000"}