{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-28T09:47:04+0000", "description": "&lt;p&gt;The Performance Analytical Team consists of three central analytical teams and seven regional teams. The East of England Performance Analytical Team are looking to recruit a Senior Analytical Lead. As a team, we are responsible for the collection, reporting and analysis of information about NHS operational activity and performance, and our team works with Regional Directors, Directors of Performance and many other directorates across the region to bring analysis to decision making. Examples of work include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Developing performance metrics to understand how patients experience the NHS – for example analysing statistics on A&amp;E 4hr performance and considering options for any replacement. This also includes putting in processes for monitoring and identifying reasons for its variation.&lt;/li&gt;\n&lt;li&gt;Assisting with how the NHS plans for its delivery of services – enabling the annual planning round, working with regional Sustainability and Transformation Partnerships to help complete the required stages for planning. This includes producing analysis of their results to ensure that plans are cohesive and realistic.&lt;/li&gt;\n&lt;li&gt;Deep dive pieces of analysis – these are multiple and varied in their topic and method applied. Previous areas include modelling the impact of COVID on waiting times for treatments, and where to locate NHS Nightingale sites.&lt;/li&gt;\n&lt;li&gt;Projecting demand for NHS services and required capacity over the course of the year and future years. For example, how might services such as changing outpatient appointments from face to face to video affect the required capacity and what other impacts (positive and negative) might this change in service have.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a Senior Analytical Lead, the post holder will work as part of a dynamic analytical community supporting managers and staff across all of NHS England and NHS Improvement’s functions.&lt;/p&gt;\n&lt;p&gt;The post holder will lead the provision of an efficient, effective and high quality professional and well co-ordinated analytical service capable of meeting all statutory, regulatory and NHS requirements ensuring alignment with the activity of the organisation.&lt;/p&gt;\n&lt;p&gt;In particular the post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be highly numerate, with experience and understanding of a wide variety of analytical methods (i.e. economics, statistics and operational research techniques) and their application, to provide high quality, timely analysis and intelligence;&lt;/li&gt;\n&lt;li&gt;Structure problems and develop appropriate analytical solutions, analysing and triangulating data in innovative ways, and adapting approaches to deal with ambiguity;&lt;/li&gt;\n&lt;li&gt;Take a practical approach to providing advice, giving persuasive explanations of complex concepts orally and in writing to a range of audiences, in a clear and accessible manner;&lt;/li&gt;\n&lt;li&gt;Take a strategic view of policy development and the impact of policies across the health sector, developing frameworks for such analyses and conveying results effectively to a wider audience;&lt;/li&gt;\n&lt;li&gt;Have good project management skills, including the ability to plan, manage and deliver a portfolio of projects, juggle competing priorities and tight deadlines for self and team, and work autonomously to drive own work programme and that of team members;&lt;/li&gt;\n&lt;li&gt;Build and manage collaborative relationships across the health system, including internal and external policy and analytical teams, providers and clinical experts, and senior and challenging external partners and stakeholders, to ensure analyses are relevant to their needs.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Clare Hensman&lt;/p&gt;\n&lt;p&gt;Job title: Deputy Director of PAT East of England&lt;/p&gt;\n&lt;p&gt;Email address: clare.hensman@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07702 415898&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester/Cambridge", "postalCode": "CB21 5XB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Senior Analytical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245898", "validThrough": "2020-11-15T23:59:59+0000"}