{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-22T10:31:35+0100", "description": "&lt;p&gt;Calling all Pharmacy Technicians! Are you interested in developing your leadership skills? If so then look no further. The Pharmacy Department at Lancashire Teaching Hospitals NHS Foundation Trust is delighted to be able to offer a vacancy for a new position of Band 5 Medicines Management Technician – Supply and Distribution Services.&lt;/p&gt;\n&lt;p&gt;We are one of the largest trusts in the country, providing district general hospital services to people in Preston and Chorley and specialist care (Neurology, Neurosurgery, Burns and Plastics, Oncology and Renal Medicine) to 1.5m people across Lancashire and South Cumbria in addition we are proud to be the regional Major Trauma Centre providing life and limb saving treatment for patients throughout Lancashire and South Cumbria.&lt;/p&gt;\n&lt;p&gt;At Lancashire Teaching Hospitals NHS Foundation Trust our aim is to always provide excellent care with compassion to deliver the highest quality of care our patients deserve. We value the personal skills, experiences and qualities that individuals bring to the Trust; creating an inclusive working environment to attract talented people who feel motivated, involved and able to influence the future direction of our services. The wellbeing of staff is important to us; we have a dedicated Health and Wellbeing team who provide support on a range of topics, run fitness classes and organise mindfulness sessions. As an employer we have earned a reputation for focusing on the development of our staff and for being an organisation people are proud to work for.&lt;/p&gt;\n&lt;p&gt;As a department, it is an innovative and exciting place to work and we are working to further enhance the high quality services provided and the roles of the pharmacy team. There are also regular opportunities for individuals to develop and progress.&lt;/p&gt;\n&lt;p&gt;Applicants should be enthusiastic, highly motivated, hardworking and demonstrate a desire to contribute towards developing our services. Previous experience of working in a supervisory or leadership role would be advantageous as well as an understanding of Good Distribution Practice. Candidates will also be registered with the General Pharmaceutical Council and either possess or be willing to work towards completing the BTEC Professional Diploma in Dispensing Checking or equivalent.&lt;/p&gt;\n&lt;p&gt;Core duties to include:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working in conjunction with the Senior Pharmacy Assistant under direction of the Stores and Distribution Team Leader to provide, monitor and evaluate high quality and cost effective services relevant to assigned areas&lt;/li&gt;\n&lt;li&gt;Providing leadership and direction to the Pharmacy and Medicines Management Assistants ensuring professional and service standards are met&lt;/li&gt;\n&lt;li&gt;Supporting the training and development of pharmacy personnel&lt;/li&gt;\n&lt;li&gt;Contributing towards the development of new services&lt;/li&gt;\n&lt;li&gt;To ensure all work is performed following MHRA and Good Distribution Practice Guidelines&lt;/li&gt;\n&lt;li&gt;Deputising for the Stores and Distribution Team Leader in their absence&lt;/li&gt;\n&lt;li&gt;Providing operational cover during staff absences&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;(Please note that as new services are developed within the pharmacy department, the post holder may be expected to supervise other teams of Pharmacy Assistants within the department.)&lt;/p&gt;\n&lt;p&gt;The core hours of duty are between 8:00am and 6:00pm Monday to Friday, 9:00am to 5:30pm Saturday and Sunday and 9:00am to 5:30pm Bank Holidays.&lt;/p&gt;\n&lt;p&gt;Depending on bed capacity within the hospital, there are occasions where the volume of work requires flexibility from the team on duty to stay late to ensure that patient care is not compromised. In these instances, team members are reimbursed with additional pay.&lt;/p&gt;\n&lt;p&gt;Interviews are to be held week commencing 16th November .2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Adam Scott, Pharmacy Stores and Distribution Team Leader on 01772 523024.&lt;/p&gt;\n&lt;p&gt;**&lt;strong&gt;PREVIOUS APPLICANTS NEED NOT APPLY**&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chorley District General Hospital/Royal Preston Hospital, Chorley/Preston", "postalCode": "PR7 1PP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6656", "longitude": "-2.63575"}}, "title": "Medicines Management Technician - Supply and Distribution Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237928", "validThrough": "2020-11-09T23:59:59+0000"}