{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-22T14:16:29+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Clinical Psychologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Older People’s Mental Health &lt;/strong&gt;&lt;strong&gt;Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Newbury/Reading/Wokingham – Host Locality to be determined&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8c, full or part-time (minimum 0.8wte) permanent post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an innovative and forward-looking clinical psychologist with a background in services for older people with dementia and complex mental health problems? Do you have experience of successfully leading psychological services, managing strategic projects, and of working effectively in multi-disciplinary settings? Are you energetic and ready for your next career move?&lt;/p&gt;\n&lt;p&gt;This is a rare opportunity to join a well-established multi-disciplinary service where psychologists and other professionals work closely together to offer high-quality care. The psychologists are working to improve access to evidence based psychological interventions and neuropsychological assessment for older adults. This is a great time to become involved to support and lead this work.&lt;/p&gt;\n&lt;p&gt;Working across localities and with colleagues from across the Trust and other agencies, you will have the opportunity to take a leading role in focussing and progressing our psychological provision for this growing group of people. You will be supported to develop your clinical leadership and change management skills, while continuing to use your supervision, consultation, training and governance skills to enhance patient and staff experience.&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare is committed to compassionate care and is rated ‘Outstanding’ by CQC. It offers the full range of mental health and community services, and psychologists contribute to these as integrated members of clinical teams. Whilst there is a strong ethos of multi-disciplinary team working, you will also be part of a network of psychologists and psychological therapists across Berkshire. We have excellent links with the Oxford Clinical Psychology Course, Reading University and the Charlie Waller Institute and provide regular trainee clinical and counselling psychologist, and psychotherapist placements.&lt;/p&gt;\n&lt;p&gt;Candidates must hold a UK recognised qualification in clinical psychology and and have current UK professional registration with the Health and Care Professions Council as such. In addition, they must have or be working towards qualification and accreditation in neuropsychological assessment. An enhanced DBS check is required, and you will need to travel between bases in Berkshire as required.&lt;/p&gt;\n&lt;p&gt;If you share our values and are ready to take on a leading role in our developing services we look forward to receiving your application. Please contact Dr Chris Allen, Consultant Lead Psychologist, on 07824 302454 chris.allen@berkshire.nhs.uk , or Vicki Matthews, Older People’s Mental Health Service Development Manager, on 07795 416572 for a conversation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "OPMH Services Reading, Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "Consultant Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238831", "validThrough": "2020-11-15T23:59:59+0000"}