{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 per annum pro rata"}}, "datePosted": "2020-10-26T03:31:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Health Care Assistant – Band 2&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Tewkesbury Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £18,005 to £19,337 per annum pro rata&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 18.75 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An opportunity has arisen for a highly motivated individual to join our small Outpatients’ team as a Healthcare Assistant at Tewkesbury Community Hospital.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Outpatients Department provides various consultant specialities. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experience of Outpatients work is desirable but not essential as a full induction and training will be provided.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post will require flexibility due to the service needs. Hours of work will be Monday-Friday from 08:00 to 18:00, variable shifts within these hours. You may be required work at the North Cotswolds Hospital in our Outpatients dept. so willingness to travel is essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tewkesbury Community Hospital provides an Outpatients department, a Minor Injury and Illness Unit, Physiotherapy, X-ray and a 20 bed Inpatients Ward.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can offer:-&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;A fully supported corporate induction programme &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Annual appraisal and personal development plans – linked to pay progression policy&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Easy free parking&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;When applying for this position, please try to ensure that, in your supporting statement, you make it clear as to how you meet the person specification especially the values and behaviours expected of all colleagues. This will figure largely in our short-listing criteria and the overall selection process.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to work for an Organisation that values its staff, aims to deliver the best care, offering compassion to all patients, their carers and families, and you can demonstrate this to us, we would like to hear from you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For information or enquires please contact Sister Terri Yates on 0300 421 8790 or email terri.yates@ghc.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 8th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 9th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Health Care Assistant/ Support Worker you will be responsible for participating and assisting in the delivery of care / services to patients and service users as part of a Mental Health and Social Care Health Service. Health Care Assistant, Social Care Workers and other Healthcare Support Workers employed by the Trust are required to follow the guidance set out in Code of Conduct for Health Care Assistants/ Health Care Support Workers to provide safe and compassionate care of a high standard, and to challenge others who are not. You will receive direct supervision and partake in reflective practice / training on a regular basis and be required to meet the Care Certificate standards.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moreton-in-Marsh", "postalCode": "GL56 0DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9841", "longitude": "-1.70564"}}, "title": "Health Care Assistant - Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241655", "validThrough": "2020-11-08T23:59:59+0000"}