{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 Pro rata"}}, "datePosted": "2020-11-02T15:31:47+0000", "description": "&lt;h2&gt;FACTT-LD (Forensic Assessment, Consultation, and Training Team) and Low Secure Autism Service&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Principal Clinical or Forensic Psychologist - Band 8b – Permanent, 30 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Looking for a new challenge? Looking to use your skills and experience in a new setting?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced Clinical or Forensic Psychologist to join the established and supportive team of Clinical and Forensic Psychologists already inputting into Secure Services at Brooklands Hospital. The post holder will provide a lead role within the new autism service at Brooklands and the Forensic Assessment, Consultation, and Training Team for people with Learning Disabilities (FACTT-LD). There is strong multi-disciplinary working within both of these services and the post would be split between the two roles.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FACTT-LD&lt;/strong&gt; is commissioned as part of the Transforming Care agenda. It is a consultation model that supports Community Learning Disability Teams (CLDTs) and Intensive Service Teams (IST’s) to develop the skills and confidence in working with and managing cases with forensic risk issues (behaviours that could lead to involvement in the Criminal Justice System). The successful applicant may also have a small case load where they work directly with individuals who may pose a forensic risk in the community. They will also provide supervision to other psychologists and disciplines within the FACTT-LD service and develop working relationships with other Criminal Justice agencies, such as the Police and Probation Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialist Male Autism Low Secure Service&lt;/strong&gt; - This is an exciting new development of a low secure provision for men with autism on the Brooklands site. The Approved Clinician is a clinical psychologist with national research reputation and the post offers the opportunity for the successful candidate to be part of developing this service from the start.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will input directly into the above services, which will involve a combination of direct and indirect work and will provide:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A lead role within a specified area of the service&lt;/li&gt;\n&lt;li&gt;A key role in developing the psychological provision across the secure services&lt;/li&gt;\n&lt;li&gt;Specialist clinical and risk assessments and advice on management of risk&lt;/li&gt;\n&lt;li&gt;Individual and group therapy&lt;/li&gt;\n&lt;li&gt;Facilitation of case discussion, team formulation and reflective practice sessions&lt;/li&gt;\n&lt;li&gt;Care planning, using a Positive Behavioural Support (PBS) approach&lt;/li&gt;\n&lt;li&gt;Support to staff from other disciplines to undertake psychological interventions&lt;/li&gt;\n&lt;li&gt;Supervision to psychology colleagues and other Allied Health Professionals&lt;/li&gt;\n&lt;li&gt;Undertaking audit and research&lt;/li&gt;\n&lt;li&gt;Providing supervision, consultation and training for others&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful applicants will receive support to further develop their skills and knowledge, through good quality supervision and training opportunities. The service has strong links with local clinical and forensic training courses, and regularly provides placements for trainee clinical and forensic psychologists, supervision for DClinPsy and DForPsy research, and teaching on the courses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful post holder will have considerable post qualification experience, including forensic experience and experience in working with autism. Experience of inpatient work would also be desirable. He/she will have clinically supervised qualified psychologists, effectively deployed resources and led on projects.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact Dr Joanne Lomas, Interim Consultant Clinical Psychologist, Secure Services, Brooklands on 0121 329 4981 or email joanne.lomas@covwarkpt.nhs.uk. Apply online:. If you have difficulties please contact the Partnership Trust Recruitment Team recruitment.department@covwarkpt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brooklands Hospital, Birmingham", "postalCode": "B37 7HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4694", "longitude": "-1.74281"}}, "title": "Pt Prinicipal Clinical Or Forensic Psychologist - Band 8b", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252618", "validThrough": "2020-11-22T23:59:59+0000"}