{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum inclusive"}}, "datePosted": "2020-10-26T08:16:37+0000", "description": "&lt;p&gt;A vacancy has arisen for an experienced and motivated nurse to join our Senior Team of Nurse&#39;s in Queens Hospital, Emergency Department. You would have the ability to work autonomously, be a creative thinker and have excellent communication skills. This is an excellent opportunity for an experienced emergency care nurse who wishes to extend their leadership, strategic and project management skills.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be part of the team helping to drive forward both the Trust and the Department&#39;s agenda for delivering high quality of care to our patients in a safe and timely manner. They will also ensure effective day to day management of the department, taking an active role in clinical governance.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be the leader of a team of nursing staff, providing guidance, support and learning. Collaborative working with the MDT will provide the opportunity to evolve the provision of emergency care for the local community to match the increasing demand and complexities of the services. This is a very exciting opportunity to lead and be a part of service transformation, if you are reading this advert then you knows that you&#39;re thinking about it, why not apply now!&lt;/p&gt;\n&lt;p&gt;For further details or to arrange an informal meeting please contact:&lt;/p&gt;\n&lt;p&gt;Nicola Loncke, ED Matron on 01708435000 ext. 6539 or email nicola.loncke@nhs.net&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;br /&gt;&lt;br /&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Oyinda Agoro, Recruitment Advisor, on 01708 435000 ext. 2291.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen&#39;s Hospital, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 7 Senior Sister/ Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241696", "validThrough": "2020-11-08T23:59:59+0000"}