{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Band 5/6"}}, "datePosted": "2020-11-04T10:29:04+0000", "description": "&lt;p&gt;&lt;strong&gt;Theatre Practitioner | Theatre | Band 5/6 | Blackpool | 37.5 hours| Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Fylde Coast is currently recruiting for an experienced theatre practitioner join our dedicated and friendly theatre team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Here at Spire Fylde Coast, we are committed to helping you to develop your skills and enabling you to achieve your career goals by providing protected time to complete training. You will also have the opportunity to work across Anaesthetic, Scrub and Recovery &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Fylde Coast Hospital is based in the seaside town of Blackpool. We have 3 operating theatres undertaking a wide range of procedures in Orthopaedics, ENT, Spines, Opthalmics, Urology, Vascular, Gynaecology, Endoscopy, Bariatrics, Plastics and General Surgery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working as part of a supportive team you will provide exemplary planned care for patients within the perioperative department&lt;/li&gt;\n&lt;li&gt;You will assist in the management and organisation of care provision within the Scrub teams in the operating department; acting as the Scrub Practitioner across a range of clinical specialities&lt;/li&gt;\n&lt;li&gt;You’ll discuss, agree and explain responsibilities for assessment of patients including their needs and any associated risks&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Operating Department Practitioner or Theatre Nurse with valid registration&lt;/li&gt;\n&lt;li&gt;Experience of applying clinical reasoning skills to a range of complex and varied patient case mixes although would consider newly qualified Nurse or ODP&lt;/li&gt;\n&lt;li&gt;Competence across a range of skills, supported by professional and clinical knowledge acquired through state registration/practitioner qualification and additional training.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free onsite car park&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals and 8 clinics across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please email Usman Masood at Usman.Masood@Spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it’s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool", "postalCode": "FY3 8BP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8261", "longitude": "-3.01957"}}, "title": "Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255362", "validThrough": "2020-12-04T23:59:59+0000"}