{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-29T11:15:26+0000", "description": "&lt;p&gt;CDDFT are investing an additional £3m into Therapy services across the University Hospital of North Durham (UHND), Darlington Memorial Hospital (DMH) and Bishop Auckland Hospital (BAGH). There has never been a better time to come and join us in developing high quality, evidence based and compassionate therapy services. We are recruiting posts within Physiotherapy, Occupational Therapy, Speech and language Therapy, Podiatry, Dietetics and nutrition, Clinical Psychology and Psychological Practitioners. Look out for all our adverts on NHS jobs.&lt;/p&gt;\n&lt;p&gt;As part of this MDT you will have the opportunity to influence the development of:&lt;/p&gt;\n&lt;p&gt;• Integrated pathways across the health and care system&lt;br /&gt;• Innovative new roles&lt;br /&gt;• Training to up skill our workforce&lt;/p&gt;\n&lt;p&gt;As Therapy services working together we will be able to ensure the care offered is individualised, evidenced based and builds a resilient workforce for the future.&lt;/p&gt;\n&lt;p&gt;We will also be investing further in our community services to further develop partnership working across the Health and Care System.&lt;/p&gt;\n&lt;p&gt;2 posts Band 6 Rehabilitation after Critical Illness (RaCi) UHND and DMH&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join the RACI (Rehabilitation After Critical Illness) Team in CDDFT. We are recruiting to two posts, one based at UHND and one based at DMH for a physiotherapist based on each site who will work clinically in and coordinate the RACI service in collaboration with the nurse coordinator role at each site. We are looking for a highly motivated individual who has the skills to work in ITU, inpatient and rehabilitation settings to provide physiotherapy treatment to critically ill patients and support them on their rehabilitation journey to recovery.&lt;/p&gt;\n&lt;p&gt;The posts based at UHND and DMH require a highly organised and innovative individual who is able to work autonomously in a clinical sense and efficiently, as part of a team to support the development of the new RACI service.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with the multidisciplinary team, all working towards the joint goal of improving the function of patients who are recovering from critical illness. The band 6 physiotherapist coordinator will collaborate with the nurse coordinator to support the objectives of the RACI team in providing their clients with the support they need to achieve their individual goals whilst in the acute hospital and in the community setting.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible to the physiotherapy team lead at either at UHND or DMH and be part of the wider physiotherapy team. The post holder will directly supervise the Band 4 RACI Team assistant, supporting their training, development and appraisal.&lt;/p&gt;\n&lt;p&gt;The post holder will carry out their duties, over a 7 day service mainly at the acute hospital site at UHND or DMH. They will also be part of the physiotherapy overnight respiratory on call service. There is also an expectation for the post holder to be able to travel to a community location to provide an outpatient clinic as part of the RACI team.&lt;/p&gt;\n&lt;p&gt;Please contact Jessica Mansfield for more information regarding the post at UHND, Jessica.mansfield@nhs.net.&lt;/p&gt;\n&lt;p&gt;Please contact Kelly Huitson for more information regarding the post at DMH, khuitson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington Memorial Hospital x 1, University Hospital of North Durham x 1", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Band 6 Specialist Physiotherapist (RACI) (2 posts)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248037", "validThrough": "2020-11-12T23:59:59+0000"}