{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-10-26T13:00:23+0000", "description": "&lt;h1&gt;&lt;strong&gt;Lead Pharmacist - Emergency Department B8a&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;We have a brand new exciting opportunity for a clinically experienced pharmacist to develop the clinical pharmacy service in the emergency department (ED) at Royal United Hospitals NHS Foundation Trust (RUH). We are looking for a highly motivated, innovated and enthusiastic individual that will help shape this new and exciting role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will work closely with the Chief Pharmacist and Clinical Services Lead to develop an ED clinical pharmacy service, ensuring that patients receive the best pharmaceutical care right from the front door and through transfer to other specialties.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role will include providing pharmaceutical support to the multidisciplinary team in ED and enhancing the patient’s experience by improving the quality, safety &amp; effectiveness of their medicine utilisation. You will aim to improve timely medicine reconciliation and prescribing of medicines, flow of patients through ED and transfer of medicines across the interface at admission, discharge and within the organisation.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a pharmacist with evidence of significant clinical experience and ideally an independent prescribing qualification (or be willing to work towards). We welcome applications from individuals with excellent communications skills, a patient-centered attitude, the ability to work independently as well as collaboratively, and who have the motivation to strive for continued improvement.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If successful you will benefit from working within a rapidly-transforming department with a firm interest in quality improvement and practice-based research. This is an exciting time for the RUH Pharmacy team as, with organisational support, we expand and embed advanced clinical services to deliver direct care to patients within the organisation.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We recognise that we can only achieve our vision for medicines optimisation with the dedication and collaboration of our colleagues, so if you’re looking for a position that will invest in your skills, provide opportunities to work across the wider healthcare system and allow you to influence and implement change in medicines use and optimisation, then this role could be right for you. Successful applicants will be actively encouraged to develop their skills and knowledge to meet both personal and service development needs.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are interested in the post above and have the drive to meet the challenge then you are encouraged to contact Dilesh Khandhia (Deputy Chief Pharmacist) or Uzo Ibechukwu (Chief Pharmacist) for an informal discussion or to arrange a visit to the department (01225 824631)&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Lead Pharmacist - Emergency Department B8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242545", "validThrough": "2020-11-09T23:59:59+0000"}