{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-04T10:15:53+0000", "description": "&lt;p&gt;Are you a caring and compassionate Registered Health Visitor? Why not come and work for CWP – we may have just the role for you.&lt;/p&gt;\n&lt;p&gt;Our 0-19 Starting Well Service is looking to appoint a full time Health Visitor on a fixed term temporary contract for one year to work across the Northwich and Winsford district (other hours may be considered).&lt;/p&gt;\n&lt;p&gt;You would become part of the integrated team delivering the key elements of the Healthy Child Programme to the Cheshire West and Chester 0-19 year old population and their families.&lt;/p&gt;\n&lt;p&gt;You will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be a qualified Health Visitor&lt;/li&gt;\n&lt;li&gt;Provide leadership within the 0-19 team&lt;/li&gt;\n&lt;li&gt;Demonstrate skills in service development, innovation and public health&lt;/li&gt;\n&lt;li&gt;Be flexible and solution focused in your approach to challenges&lt;/li&gt;\n&lt;li&gt;Facilitate integrated working&lt;/li&gt;\n&lt;li&gt;Build community capacity and resilience through partnership working&lt;/li&gt;\n&lt;li&gt;Be compassionate, competent and child focused in all that you do&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You should have an excellent knowledge of the Healthy Child Programme and demonstrate a commitment to multi agency/ collaborative and integrated team working. Safeguarding and case management are essential elements of this role and comprehensive training and support will be provided&lt;/p&gt;\n&lt;p&gt;You will also be involved in a range of public health activities within a geographical area, to include individuals, groups and communities. As a key professional in the protection of children, you will be required to work collaboratively with other agencies to meet their needs.&lt;/p&gt;\n&lt;p&gt;You will benefit from a full induction and preceptorship programme where appropriate. Regular clinical and safeguarding supervision will also be provided as will access to relevant internal and external training/development opportunities.&lt;/p&gt;\n&lt;p&gt;Location and Base will be discussed and agreed once a start date is established for the successful candidates which will take into account the needs of the service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vikki Seddon District Lead Email address victoria.seddon1@nhs.net Telephone number 01606 555285&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Base within locality, Winsford &amp; Northwich", "postalCode": "CW7 3HN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1949", "longitude": "-2.50391"}}, "title": "Starting Well Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255326", "validThrough": "2020-11-18T23:59:59+0000"}