{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-04T09:55:48+0000", "description": "&lt;h1&gt;Registered Staff Nurse - George Earle&lt;/h1&gt;\n&lt;p&gt;Are you seeking a new challenge in your nursing career? Are you a confident communicator? Do you have experience of providing high quality care? Are you forward thinking and keen to develop your own expertise and career?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If so, we would love to hear from you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for registered Nurses to join our Acute Stroke Unit at Torbay and South Devon NHS Foundation Trust. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Stoke service is well established and provides a comprehensive service to South Devon Community. The Service has all components of the national stroke pathway including an acute service with 24/7 thrombolysis, acute care, rehabilitation and TIA service; all provided and delivered locally. The service also has excellent links with Teign Ward at Newton Abbot Hospital, where many of our patients receive their stroke/neuro rehabilitation.&lt;/p&gt;\n&lt;p&gt;The main focus will be to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide high quality care to acutely ill patients&lt;/li&gt;\n&lt;li&gt;Work as part of a multidisciplinary team supporting patients and their families, during their acute hospital journey&lt;/li&gt;\n&lt;li&gt;Support the dedicated Stroke specialist nurse service&lt;/li&gt;\n&lt;li&gt;Promote a safe clinical environment for patients, carers, visitors and colleagues&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A range of benefits along with exciting opportunities to develop and preceptorship for newly qualified nurses. Whilst there is a requirement for day, night and weekend working we can offer flexible working options to support a healthy work/life balance.&lt;/li&gt;\n&lt;li&gt;A wonderful place to work and live. As one of the largest counties in the UK, Devon has a wonderful variety of landscapes and activities to enjoy as well as good transport links to the rest of the country.&lt;/li&gt;\n&lt;li&gt;We welcome part time or full time requests&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;If you are as excited as we are about these opportunities, please apply or for an informal discussion or visit contact Nikki Hughes-Jones (Ward Manager) George Earle ward on 01803 655735&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torbay Hospital", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Staff Nurse - George Earle", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255264", "validThrough": "2020-11-18T23:59:59+0000"}