{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T13:00:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Permanent Posts within Stockport Foundation Trust Community &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Exciting opportunities within the Stockport Active Recovery and Crisis Response Team – incorporating Discharge to Assess.&lt;/p&gt;\n&lt;p&gt;We need people who share our excitement, embrace different ways of working and are able to work flexibly across organisational boundaries .Opportunities have arisen for registered professionals – Band 6 to work flexibly within the Stockport Crisis Response , Active Recovery – including Discharge To Assess teams.&lt;/p&gt;\n&lt;p&gt;The Discharge To Assess element is multi-professional services who assess patients upon discharge from hospital in the community .We provide individualised care to meet the person’s needs and facilitates transfer for onward care into the appropriate service: Health, Adult Social care or partner agencies.&lt;/p&gt;\n&lt;p&gt;The Rehabilitation Element This element incorporates a free, short-term rehabilitation service for adults to help prevent unnecessary hospital admission, enable early discharge from hospital and prevent unnecessary admission to long-term residential care. The service is for adults who have been assessed as medically stable and who do not require hospital care.&lt;/p&gt;\n&lt;p&gt;The Response Element The aim of the Response element is to reduce unnecessary hospital admissions and prevent avoidable Emergency Department attendances by providing holistic multidisciplinary intervention and support in order to stabilise patients in their own home or usual residence.&lt;/p&gt;\n&lt;p&gt;This comprises a multi-disciplinary integrated team consisting of highly skilled senior nurses, Occupational Therapists ,Physiotherapists, Social Workers and Senior Support Workers, in collaboration with the Mental Health Liaison Team.&lt;/p&gt;\n&lt;p&gt;The whole service provides a person centred approach, which can be provided in a client’s own home or in a designated residential care home.&lt;/p&gt;\n&lt;p&gt;You will be working within a multi-professional team incorporating physiotherapists, occupational therapists, nurses, social workers and rehabilitation support workers, as well as liaising with other community health and social care teams.&lt;/p&gt;\n&lt;p&gt;The service is provided across 7 days a week covering core hours of 8 am – 8 pm.&lt;/p&gt;\n&lt;p&gt;You will be based at Regent House, Heaton Lane, Stockport, SK4 1BS.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful candidate will be expected to work independently, but also as an integral member of the multidisciplinary team. You will be offered regular 1:1s with a band 7 and the service promotes regular profession specific and MDT team meetings.&lt;/p&gt;\n&lt;p&gt;You will need to be a registered professional with an enthusiasm for working within the community. We place a great emphasis on training and personal development and will provide you with access to training and supervision. The candidate will be able to demonstrate sound clinical reasoning, excellent time management and advanced communication skills. &lt;br /&gt;There will be support available from clinical leads.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary&lt;/p&gt;\n&lt;p&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Carol Carr/Clare Redford - Lead Nurse/Team Lead or Liz Casson /Janet Wright, Therapy Team Lead&lt;/p&gt;\n&lt;p&gt;addresssnt-tr.d2a@nhs.net - 0161 204 4644&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Regent House, Heaton Lane, Stockport. SK4 1BS, Stockport", "postalCode": "SK4 1BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.16411"}}, "title": "Community Nurse Band 6 - Active recovery/Crisis Response/D2A", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259781", "validThrough": "2020-11-22T23:59:59+0000"}