{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30997", "minValue": "27652", "unitText": "YEAR", "value": "£16.45 Plus 12.1% Annual Leave (£18.44ph)"}}, "datePosted": "2020-10-09T16:16:23+0100", "description": "&lt;p&gt;We are looking for a Registered Mental Health Nurse / RMN or Learning Disability Nurse/ RNLD with a passion for delivering the best quality of care, to join us as aBankNight Staff Nurse, at our neuropsychiatric and neurodegenerative rehabilitation for men.&lt;/p&gt;\n&lt;p&gt;You will be working bank night shiftsat&lt;strong&gt;Cygnet Brunel - located in Bristol&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Brunel&lt;/strong&gt;is a 32 bed service designed specifically to provide a clinically led evidence based neuropsychiatric pathway Brunel Hospital supports individuals with an Acquired Brain Injury to maximise their quality of life. We create a therapeutic rich environment which engages our service users and offers them the opportunity to maximise their independence.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Day-to-Day…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Produce outstanding written reports based on your nursing assessments and observations&lt;/p&gt;\n&lt;p&gt;Work closely with the management team to develop the service, audit, and improve quality&lt;/p&gt;\n&lt;p&gt;Attend all training and engage in CPD to further knowledge and promote nursing&lt;/p&gt;\n&lt;p&gt;Under NMC guidelines, ensure that individual care plans are complete &amp; maintained collectively with residents, relatives and other healthcare professionals&lt;/p&gt;\n&lt;p&gt;Administer prescribed medicines with Healthcare procedure and Healthcare Commission guidelines&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet? We’ll offer you…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS and employee discount scheme&lt;/p&gt;\n&lt;p&gt;50% NMC registration renewal paid by Cygnet&lt;/p&gt;\n&lt;p&gt;Free meals on duty&lt;/p&gt;\n&lt;p&gt;Specialist Neurorehabilitation training&lt;/p&gt;\n&lt;p&gt;RCNi membership&lt;/p&gt;\n&lt;p&gt;Bespoke career pathways&lt;/p&gt;\n&lt;p&gt;Plus many more&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Experience as a Registered Nurse Mental Health Nurse / RMN or Learning Disability / RNLD with a current Pin Number&lt;/p&gt;\n&lt;p&gt;The ability to maintain documentation, undertake audits and demonstrate integrity in your role&lt;/p&gt;\n&lt;p&gt;A good understanding of the Mental Health Act 1983 and latest nursing practices&lt;/p&gt;\n&lt;p&gt;A commitment to patient recovery in order to effectively monitor, manage and reduce risk&lt;/p&gt;\n&lt;p&gt;Compassion, resilience and a dedication to empower and support service user independence&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The ability to deputise in a clinical lead role&lt;/p&gt;\n&lt;p&gt;An interest in leadership, research and assessment&lt;/p&gt;\n&lt;p&gt;Neuropsychiatric or Neurorehabilitation experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Cygnet Health Carehas been providing a national network of high quality specialist mental health services for 30 years.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Brunel&lt;/strong&gt; is a 32 bed service providing neuropsychiatric and neurodegenerative rehabilitation for men with mental health difficulties and acquired brain injury.&lt;/p&gt;\n&lt;p&gt;Our focus is on creating an environment that engages our service users and sets the tone for recovery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Brunel&lt;/strong&gt; has been designed and equipped with an all-integrated physical environment to aid our service user’s neurobehavioural rehabilitation process. Our specifically designed environment assists the men to manage visual, spatial and perceptual difficulties. There are four wards ensuring that individuals’ needs are met and where appropriate is a care pathway through the service prior to discharge.&lt;/p&gt;\n&lt;p&gt;Cygnet Brunel is rated &#39;Good&#39; by the CQC and proud to be members of the Independent Neurorehabilitation Providers Alliance.&lt;/p&gt;\n&lt;p&gt;What next?&lt;/p&gt;\n&lt;p&gt;If you care about making a difference – we want to talk to you!&lt;/p&gt;\n&lt;p&gt;Click the link to apply.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Henbury, Bristol", "postalCode": "BS10 7DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5092", "longitude": "-2.61881"}}, "title": "Bank Night Nurse (RMN / RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221061", "validThrough": "2020-11-16T23:59:59+0000"}