{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 per annum pro rata"}}, "datePosted": "2020-10-21T11:33:53+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Clinical Support Worker / Phlebotomist – Band 2&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – The Brownhill Centre, Cheltenham &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £18,005 to £19,337&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week –22.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 x Fixed Term contract/secondment opportunity for up to 12 months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*Internal applicants who wish to be considered for a secondment opportunity should discuss with their line manager the suitability of a possible secondment*&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Part Time Clinical Support Worker based at the Brownhill Eating Disorders Centre for 12 months.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and reliable individual to support our busy, but friendly multi professional teams who work with all age people with Eating Disorders. You will be working at Brownhills on the St Paul’s Medical Centre Complex where there is onsite car parking.&lt;/p&gt;\n&lt;p&gt;The post holder will have excellent communication and interpersonal skills and will need to be well organised and adaptable. The ability to maintain a calm, positive and flexible approach to your work is essential.&lt;/p&gt;\n&lt;p&gt;Your main duties will be supporting the clinical team in taking physical observations including venipuncture, ECG, blood pressure, pulse, temperature and blood glucose testing for our patients. You will have lead responsibility for the booking and smooth running of the blood clinics and clinical room as well as electronic and NEWS / PEWS recording.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be an enthusiastic, hard-working team player who can ensure excellent organisational skills, sustain quality in their document production, manage their own workload on a day-to-day basis and prioritise work to meet deadlines.&lt;/p&gt;\n&lt;p&gt;The Trust is very keen to support its staff’s personal development and various training is provided to assist staff along their career pathway.&lt;/p&gt;\n&lt;p&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/p&gt;\n&lt;p&gt;If you have any questions, would like to know more information, or to arrange a visit, please do not hesitate to contact Anne-Marie Whittaker, Service Manager, on 01241 634242 or via email anne-marie.whittaker@ghc.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 8th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 9th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CHELTENHAM", "postalCode": "GL51 9EZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9071", "longitude": "-2.08289"}}, "title": "Clinical Support Worker / Phlebotomist - Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236133", "validThrough": "2020-11-08T23:59:59+0000"}