{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-05T11:31:51+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title: Consultant Specialist Dermatopathologist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: Salford Royal NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: Cellular Pathology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working pattern: 10 PA&#39;s &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Number of Posts/location: 2 at Salford Royal Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £82,096 - £110,683 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Opportunities are available in the Northern Care Alliance (NCA) Cellular Pathology Department (based at Salford Royal Hospital) for experienced doctors who can provide demonstrable expertise in Dermatopathology in order to deliver a high quality independent service.&lt;/p&gt;\n&lt;p&gt;Salford Royal Hospital is a teaching hospital and all consultants are involved in teaching medical students and training medical staff. Development of management skills is actively encouraged with Trust based courses and the opportunity for career progression within divisional management is available to all colleagues. The department also offers tertiary Neuropathology and Dermatopathology referral diagnostic services.&lt;/p&gt;\n&lt;p&gt;This is an exciting time for two new consultant specialist dermatopathologists to support the delivery and transformation of histopathology services across the NCA and Wigan.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Putting your needs under the microscope&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to providing you with:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A consultant team with clear vision for the continued success of their department&lt;/li&gt;\n&lt;li&gt;Support for your own personal development utilising our strong links with external stakeholders&lt;/li&gt;\n&lt;li&gt;A flexible approach to job planning that delivers a working environment to best suit you and your team&lt;/li&gt;\n&lt;li&gt;An opportunity for additional PA’s&lt;/li&gt;\n&lt;li&gt;A workload that is distributed amongst the team using Royal College guidelines for Histopathology and Cytopathology departments&lt;/li&gt;\n&lt;li&gt;Opportunities to work with other local organisations to enhance your skills and experience&lt;/li&gt;\n&lt;li&gt;Participation and support with local and national clinical trials&lt;/li&gt;\n&lt;li&gt;Networking and development opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your valued contribution&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have a strong background in Cellular Pathology and be a team player able to work as part of a sub-specialised team. Candidates should have full GMC registration (with a licence to practice) and be on the Histopathology Specialist Register. In addition, prospective candidates should hold the FRCPath or equivalent higher professional qualification.&lt;/p&gt;\n&lt;p&gt;The appointee will be expected:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To deliver high quality diagnostic dermatopathology to the Division of Dermatology at Salford Royal Hospital and Stepping Hill Hospital, to the Dermatology Service at Wrightington, Wigan and Leigh NHS foundation Trust, to general practitioners across the NCA and several other specialist teams.&lt;/li&gt;\n&lt;li&gt;To participate in the dermatopathology rota including duties in specimen dissection supervision, microscopic reporting of dermatopathology specimens and multidisciplinary team meetings.&lt;/li&gt;\n&lt;li&gt;To regularly and systematically review all departmental policies and protocols in line with Trust policy and to actively contribute with their development.&lt;/li&gt;\n&lt;li&gt;To maintain effective communication and engagement with clinical colleagues and other service users.&lt;/li&gt;\n&lt;li&gt;To work with colleagues in setting and delivering the clinical governance agenda, including maintaining the accreditation of laboratory services.&lt;/li&gt;\n&lt;li&gt;To participate in clinical and laboratory audit and maintain an appropriate level of participation in a recognised programme of Continuing Professional Development.&lt;/li&gt;\n&lt;li&gt;To act as a clinical supervisor for Specialty Trainees in Histopathology and to participate in the teaching of other groups of healthcare staff.&lt;/li&gt;\n&lt;li&gt;To provide cover for consultant colleagues’ periods of leave.&lt;/li&gt;\n&lt;li&gt;To participate in job planning, appraisal and revalidation activities in accordance with NCA policy.&lt;/li&gt;\n&lt;li&gt;To make an appropriate contribution to setting and achieving directorate strategic goals and performance targets, aiming for year on year improvement.&lt;/li&gt;\n&lt;li&gt;To participate in all relevant EQA schemes - NSDEQA.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;This post provides an excellent opportunity to work with multi-disciplinary teams from a range of specialties so you will be someone who can create great relationships quickly and be adept at utilizing the skills of colleagues from other specialties within the organization and the community to provide a fully holistic approach to patient care.&lt;/p&gt;\n&lt;p&gt;You’ll be someone who remains calm under pressure, with an ability to take charge when needed with an encouraging and supportive approach. Your attention to detail and clear passion for delivering an efficient, high quality service will stand you out from the crowd.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups, individuals with disabilities and women are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Sami TitiJob titleClinical Director Cellular pathologyEmail addresssami.titi@pat.nhs.ukTelephone number0161 656 1364Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Lynne Jamieson, Consultant Dermatopathologist on 01612060314 or via email:&lt;/p&gt;\n&lt;p&gt;lynne.jamieson@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Sami Titi, NCA Clinical Director for Cellular Pathology on 0161 656 1364 or via email:&lt;/p&gt;\n&lt;p&gt;Sami.Tit&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Royal Hospital, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Consultant Dermatopathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212455", "validThrough": "2020-11-29T23:59:59+0000"}