{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T09:00:48+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the South Manchester Home Based Treatment team for 3 x experienced and enthusiastic Mental Health professionals to join our multidisciplinary team as Band 6 Mental Health Practitioners.&lt;/p&gt;\n&lt;p&gt;The Home Base Treatment Team provides a community based mental health service to people in South Manchester. We are committed to the delivery of high quality and intensive mental health care and treatment to people with severe and acute mental health needs.&lt;/p&gt;\n&lt;p&gt;Candidates will be expected to work as a keyworker, you will have strong skills, knowledge, and experience of working with patients with mental health needs. Your skill set will include mental health assessments, risk assessment and management plans, and be able to formulate collaborative care plans with service users.&lt;/p&gt;\n&lt;p&gt;The successful applicant will also be actively contributing to ongoing service developments.&lt;/p&gt;\n&lt;p&gt;Hours of work will include day duties and nights on rotation, working full time.&lt;/p&gt;\n&lt;p&gt;In return, the service is committed to the development of its workforce and will promote access to opportunities for personal development. We look forward to meeting you at interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmanda JacksonJob titleTeam ManagerEmail addressamanda.jackson@gmmh.nhs.ukTelephone number0161 271 0278&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Manchester Laureate House Wythenshawe Hospital, Manchester", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253204", "validThrough": "2020-11-20T23:59:59+0000"}