{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-26T12:16:41+0000", "description": "&lt;p&gt;Looking for the next step in your nursing career?&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Looking for a new an exciting challenge in a rural area? &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An opportunity has arisen for 3 Clinical Lead Nurses within Adult Mental Health Inpatient Services at Danby Ward, Cross Lane Hospital. Cross Lane Hospital is a purpose built ‘hub’ for mental health services in Whitby, Ryedale and Scarborough. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Danby Ward provides assessment and treatment services for adult males. You will work as part of the multi-disciplinary team delivering high quality, patient focused care in collaboration with family and in conjunction with partnership working.&lt;/p&gt;\n&lt;p&gt;This is an exciting and challenging role and will afford the opportunity to work as part of a supportive team that is focused on delivering high standards of care through evidenced based practice. As a Band 6 Nurse, you will work closely with patients and their relatives/ carers as part of a multi-disciplinary team to help plan, develop and implement behaviour support plans within a well-being focused model of working. You will also support and supervise staff within the multi-disciplinary team. Experience of working in a multi-disciplinary mental health setting is required for this post. We are looking for someone who is motivated, enthusiastic and compassionate about improving the lives of those with mental health needs.&lt;/p&gt;\n&lt;p&gt;If you&#39;re looking to relocate the Trust can offer you up to £8,000 relocation package&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kylie Staniforth&lt;/p&gt;\n&lt;p&gt;kylie.staniforth@nhs.net&lt;/p&gt;\n&lt;p&gt;01723 384673&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Danby Ward, Cross Lane Hospital, Scarborough", "postalCode": "YO12 6DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2967", "longitude": "-.424244"}}, "title": "Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242379", "validThrough": "2020-11-09T23:59:59+0000"}