{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "Band 5 £24,907 - £30,615 per ann"}}, "datePosted": "2020-10-12T14:31:15+0100", "description": "&lt;p&gt;Are you looking to continue your career in a friendly and dynamic children’s unit? We are looking for an enthusiastic, motivated and experienced staff nurse to join our team. We can offer the security of a permanent contract. The Children’s Treehouse Unit offers excellent opportunities to gain a wide range of experience in all areas of acute paediatric care all under one roof.&lt;/p&gt;\n&lt;p&gt;Variety is the spice of life and nursing within The Treehouse Unit will certainly give that. We care for children under all specialities including medicine, elective and emergency surgery and orthopaedics.&lt;/p&gt;\n&lt;p&gt;Do you want to increase your clinical assessment skills and ability to recognise and care for a sick child? With us, you could be supported to complete an AIMS, PLS or even APLS course.&lt;/p&gt;\n&lt;p&gt;Enjoy caring for a highly dependent child? Our 2 PHDU beds provide excellent opportunities to develop skills, together with an in-house bespoke teaching module and secondment to study at the local tertiary hospitals. You can also benefit from our strong existing links with the NWTS team.&lt;/p&gt;\n&lt;p&gt;We welcome you to join with us on our exciting Quality Improvement journey. We deliver care with pride, dignity, empathy and compassion. Join us in caring for our patients and we will care for you. We offer preceptorship and a strong supportive team of senior nurses who will support you on your career journey.&lt;/p&gt;\n&lt;p&gt;We believe that you have demonstrated enthusiasm and commitment in working hard to achieve your nursing registration. We look forward to welcoming you to this fast-paced and exciting teaching trust where We Care, We Respect, We Listen.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If successful this vacancy will require an enhanced DBS check at a cost of £48.43. This cost will be deducted from your first Trust salary.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Gibson , Deputy Matron / Ward Manager&lt;/p&gt;\n&lt;p&gt;claire.gibson@stockport.nhs.uk&lt;/p&gt;\n&lt;p&gt;0161 419 2107&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222766", "validThrough": "2020-11-09T23:59:59+0000"}