{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pro rata"}}, "datePosted": "2020-10-30T11:32:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Please note previous applicants need not apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 3 Children’s Carer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Part time &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Investment into The Birches Respite Team has created the opportunity to recruit Band 3 Children’s Carers. The team supports children with complex health needs in their own homes, school and The Birches Respite Unit. The service delivers care 7 days a week over 24 hours so a willingness to work shifts especially night shifts is essential.&lt;/p&gt;\n&lt;p&gt;You will need a good level of basic education including basic computer skills and at least NVQ level 3 in a child related subject. Experience working with children who are ventilated or have complex health problems would be beneficial but not essential. It is also important that the successful candidate is innovative in providing play and learning opportunities for the children and young people the team support so a sense of fun and enthusiasm is essential.&lt;/p&gt;\n&lt;p&gt;The role will involve delivering care to several children in a variety of settings. The successful candidate will be trained in a variety of clinical skills such as gastrostomy feeding, suction, oxygen therapy using a competency based framework. You will receive continuing support in the role.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with compassion and commitment. You will need to have excellent communication skills and enjoy working as part of a team. In return you will be part of a service that is warm and friendly and is committed to the children we support. The service recently received an overall rating of Good by the CQC and an Outstanding for care and compassion of which we are rightly proud. We have also been recognised both locally and nationally by receiving awards for the services we provide.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note Trust interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Carmel Ryan -Team Leader, email:carmel.ryan@covwarkpt.nhs.uk or Telephone 07968118373&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Coventry", "postalCode": "CV2 2BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4234", "longitude": "-1.43985"}}, "title": "Part time Children&#39;s Carer - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249972", "validThrough": "2020-11-15T23:59:59+0000"}