{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum (pro rata if part time"}}, "datePosted": "2020-10-30T12:16:18+0000", "description": "&lt;p&gt;This is an exciting opportunity for an enthusiastic and highly motivated pharmacist to join our team in providing a Clinical Pharmacy Service to a range of wards, on a rotational basis, as well as supporting the dispensary at Glangwili General Hospital.&lt;/p&gt;\n&lt;p&gt;Glangwili General Hospital is a busy District General Hospital with approximately 420 beds. It provides a range of medical and surgical specialities including coronary care, acute stoke, respiratory, urology, trauma &amp; orthopaedics, obstetrics &amp; gynaecology, critical care, paediatrics and the emergency department. The clinical pharmacy service is well established and provides high quality care across all specialities. You will be joining a team of experienced Pharmacists and Pharmacy Technicians and you will work as part of the multidisciplinary team to deliver a patient focused clinical pharmacy service. The successful applicants must have excellent clinical, communication and time management skills.&lt;/p&gt;\n&lt;p&gt;The Pharmacy Department has recently undergone major refurbishment including the installation of a new automated dispensing system. The department also provides a comprehensive medicines management service to all wards and uses the All Wales electronic discharge system (MTeD). Previous hospital experience is desirable.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply. We would encourage all applicants to contact the department for an informal chat or to organise a visit.&lt;/p&gt;\n&lt;p&gt;If the successful applicant does not meet the essential criteria Annex 21 will apply. This will affect the salary. It will be 70% of a Band 7 for the 1st year and 75% of a Band 7 for the 2nd year allowing the funding and support of the successful applicant to complete a post graduate diploma in clinical pharmacy.&lt;/p&gt;\n&lt;p&gt;Full, part time or job share hours considered.&lt;/p&gt;\n&lt;p&gt;Interviews for this post will be held on 24.11.2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDianne BurnettJob titlePharmacy Site ManagerEmail addressDianne.M.Burnett@wales.nhs.ukTelephone number01267 227463Additional contact information&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Specialist Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250110", "validThrough": "2020-11-16T23:59:59+0000"}