{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-26T09:15:40+0000", "description": "&lt;p&gt;Hours of work:  22.5 per week&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an experience therapist who wishes to expand and develop skills in leading a Team/ providing Clinical Expert management of specialist caseload within a small and supportive team. We are looking for a self-motivated, friendly and enthusiastic Speech and Language Therapist to join our established Children’s Therapy Team in North East Lincolnshire.&lt;/p&gt;\n&lt;p&gt;We are a small but dynamic multi professional team comprised of Physiotherapy, Occupational Therapy, Dietetics and Speech and Language Therapy. The team is based on the hospital site at Grimsby.&lt;/p&gt;\n&lt;p&gt;Your job clinically will be to provide expert clinical advice/ second opinions, intervention and management for a specialist caseload. There is scope for you to identify possible areas of Clinical Specialism which you might be interested in. You will work closely with the established team and that of other Health, Education and Social care practitioners with a range of community, inpatient and outpatient settings.&lt;/p&gt;\n&lt;p&gt;As part of this role you will be expected to co-lead a team of Speech and Language Therapists and non-registered staff. This will include managing performance, service development, audit and ensuring the smooth day to day running of the service. You will also be responsible for submission of quarterly monitoring reports for meetings with commissioners. You will also work alongside other Band 7 Team Leads across our wider Children’s Therapy team to support the development of the service as a whole. You will also work alongside another Band 7 Speech and Language Therapist to jointly lead the Speech and Language Team.&lt;/p&gt;\n&lt;p&gt;Applicants should have extensive experience of working with paediatrics in a Clinical capacity and experience working with complex communication difficulties, including providing second opinions, training and advice to other registered practitioners. Experience in Team leader responsibilities would be desirable; full supervision will be provided. We are able to offer this post as a development opportunity if applicants do not have the essential criteria, in which case full support would be provided and we would expect thatcompetencies would be developed within 12 months.&lt;/p&gt;\n&lt;p&gt;We are committed to offering a professionally led service, support from a friendly team, and opportunities for ongoing professional development, effective supervision as well as access to the support of administrative staff and an electronic patient record. Internal and external courses will be supported through an annual personal appraisal scheme&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah Howard, Operational Lead for Children&#39;s Therapy&lt;/p&gt;\n&lt;p&gt;sarah.howard7@nhs.net&lt;/p&gt;\n&lt;p&gt;03033 303758&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grimsby", "postalCode": "DN33 2BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5449", "longitude": "-.096217"}}, "title": "Paediatric Speech and Language Team Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241817", "validThrough": "2020-11-09T23:59:59+0000"}