{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Pro Rata"}}, "datePosted": "2020-11-05T16:56:02+0000", "description": "&lt;p&gt;Would you like to help make a difference to children and families living in Norfolk and Suffolk? We at the Compass Service have an exciting opportunity for an part-time Deputy Business Support Manager to join the busy &lt;strong&gt;Business Support Team for the Compass Service, &lt;/strong&gt;managing the administrative support team within &lt;strong&gt;Compass Outreach Service, Compass Schools, HSB and the CFYP LAAC Team, along with other exciting prospective projects within the service. &lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;In addition to managing and supporting the administrative team, the successful candidate will also need to produce and analyse performance reports using the Trust Business Intelligence system, liaising with the Clinical Team Leaders, Service Manager and Operational Manager to improve upon our current performance objectives. You will need to provide reports on a monthly basis and advise Team Leaders and individuals on ways to improve the clinical and data quality recording within the Service.&lt;/p&gt;\n&lt;p&gt;Our successful candidate must be a confident team leader, be able to respond to sudden and unexpected demands and possess excellent communication skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role will be based in Norwich, but you may be required to work across other Trust sites.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are pleased to offer this maternity cover as a one-year fixed term post, working 22.5 hours over 3 days.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that the interview date is provisional and may be subject to change.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are committed to delivering quality driven mental health services. Every individual makes a valuable contribution. We are proud of our staff who have been commended for the care they provide. Do you value working positively, respectfully and together? If so, we’d love you to join us!&lt;/p&gt;\n&lt;p&gt;If you have any questions, please contact Joe Dyer-Bunn, Deputy Business Support Manager on 01603 721616.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Compass Outreach, Schools &amp; CFYP LAAC, Little Plumstead", "postalCode": "NR13 5FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6499", "longitude": "1.40656"}}, "title": "Deputy Business Support Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258645", "validThrough": "2020-11-19T23:59:59+0000"}