{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38694", "minValue": "38694", "unitText": "YEAR", "value": "£38,694.00"}}, "datePosted": "2020-10-14T15:31:53+0100", "description": "&lt;p&gt;Applications are invited for Clinical Fellow’s (at ST1/ST2 Level) from doctors who would like to continue their professional training at a modern Foundation Trust that genuinely values its staff. The JPUH have been given an overall rating of “Good” rating following the Care Quality Commission (CQC) inspection which took place in December 2019.&lt;/p&gt;\n&lt;p&gt;This Full-time post will commence as soon as possible. The position available is within the JPUH and NNUH Urology Service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a Non-Training Post and Full GMC Registration is required&lt;/strong&gt;. Although this position does not carry Postgraduate Dean’s approval for training recognition, it offers full teaching and training opportunities. The successful candidates will be allocated a named clinical and educational supervisor to oversee their development and career. They will also be assisted and encouraged to perform audit projects and participate in research.&lt;/p&gt;\n&lt;p&gt;The James Paget University Hospitals NHS Foundation Trust (JPUH) provides medical services for a population of approximately 230,000 living in South East Norfolk and North East Suffolk, plus a large number of visitors to the coast and Broads National Park during the summer months.&lt;/p&gt;\n&lt;p&gt;The hospital is located less than a mile from long sandy beaches and is surrounded by the natural beauty of the Norfolk Broads and an abundance of outdoor, sporting and recreational activities. The cathedral city of Norwich is only 40 minutes away with excellent shops, restaurants and evening entertainment. The posts will appeal to candidates who seek a high quality of life combined with a practical clinical role within a secure and well-run hospital distinguished by its supportive and friendly culture.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Suresh Gupta, Clinical Lead for Urology, 01493 453636 suresh.gupta@jpaget.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121320.jpg", "name": "James Paget University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121320"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "JPUH, Gorleston", "postalCode": "NR31 6LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5617", "longitude": "1.718"}}, "title": "Clinical Fellow (ST1/ST2 level) in Urology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226916", "validThrough": "2020-11-14T23:59:59+0000"}