{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "92576", "minValue": "80736", "unitText": "YEAR", "value": "£80,736 - £92,576 per annum"}}, "datePosted": "2020-10-30T13:31:27+0000", "description": "&lt;p&gt;A fantastic opportunity has arisen for an experienced, dynamic and highly-motivated Trust Lead Consultant Psychologist to join London North West University Healthcare NHS Trust. The Trust recognise the importance of and are investing in the psychological health of patients and their families, their workforce and the wider organisation through this new post.&lt;/p&gt;\n&lt;p&gt;Offering Trust-wide leadership for Clinical Health Psychology, Clinical Neuropsychology and Occupational Health Psychology, the post holder will be professionally accountable to the Medical Director and line managed by the Clinical Director for the Division of Integrated Medicine. Early priorities will be to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide and establish professional support for Psychologists already employed by the Trust. London North West University Healthcare NHS Trust currently employs Psychologists who work into selected acute and community services, across various specialties in Clinical Health Psychology: specialist gastrointestinal diseases/disorders; cancer and palliative care; haematology (sickle cell); diabetes and in Clinical Neuropsychology via the Stroke Unit and the Regional Hyper-Acute Rehabilitation Unit.&lt;/li&gt;\n&lt;li&gt;Scope the need for further psychological provision across the Trust, producing a business case to develop existing services as well as new Clinical Health Psychology and Clinical Neuropsychology posts.&lt;/li&gt;\n&lt;li&gt;Provide and establish professional support for a new Occupational Health Psychology service, for which the business case has already been submitted.&lt;/li&gt;\n&lt;li&gt;Guide the development of a new, comprehensive, integrated clinical network of psychological provision for acute and community services and for staff support, which will meet the Trust’s vision, goals and objectives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants will have proven clinical and leadership expertise in adult acute Clinical Health Psychology and/or Clinical Neuropsychology services and experience of providing support to staff working acute or community services, in order to be able to provide professional guidance for senior Clinical Psychologists in the Occupational Health Psychology Service.&lt;/p&gt;\n&lt;p&gt;Specifically, candidates should be significantly experienced clinicians with the necessary skills and experience to undertake the clinical component of this post: 0.2 WTE has been designated to working as the Lead Consultant Clinical Psychologist for a new Clinical Psychology Service for the Intensive Care Units at Northwick Park Hospital and Ealing Hospital. The successful applicant will be managerially and clinically accountable for the new ICU/Critical Care psychology posts and hold budgetary responsibility for these services. Please note that the specialtyfor theclinical component of this post may be negotiable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust are looking to employ a Consultant Lead Clinical Psychologist who has the vision and capability to strategically develop the new Department of Clinical Health Psychology, Clinical Neuropsychology and Occupational Health Psychology within the Trust and with developments within the wider healthcare system in mind. The post holder will need to advise on the effectiveness of models of care and psychological interventions, contribute to decision-making processes about the efficient and effective use of resources, encourage integrated provision of care across acute and community care services, and lead on and participate in transformation of services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is expected that this will work will take place through close working with clinical and operational leads, senior management within the Trust, active membership of strategic groups within the Trust and wider healthcare system, via commissioners of local health services and through engaging service users to support this process. As such, the post holder will be experienced in working effectively with people from a diverse range of cultural/ethnic backgrounds and have a record of promoting equality, diversity and inclusion to ensure delivery of accessible, psychologically-informed care, embedded across the full range of acute and community services, which is of the highest quality.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Clare Stevenson (Macmillan Consultant Clinical Psychologist)&lt;/p&gt;\n&lt;p&gt;clare.stevenson@nhs.net&lt;/p&gt;\n&lt;p&gt;Tel: 0208 869 2542&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital, Harrow", "postalCode": "HA13UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Consultant Lead Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250375", "validThrough": "2020-12-14T23:59:59+0000"}