{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 pa"}}, "datePosted": "2020-10-27T12:00:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Planning Policy Officer - Band 8b&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent - 37.5 Hours Per Week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Planning Policy Officer the post holder will work as part of the Sustainability and Transformation Partnership (STP) in delivering an effective service in managing, coordinating, collating and preparing responses to Local Authority planning policy consultation documents, reflecting the views, strategic ambitions and mitigation requirements of the health and care economy within Mid and South Essex, to include primary, community and acute care providers.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for ensuring efficient and robust responses to all Local Authority planning policy consultation documents to include: Local Development Plans, Infrastructure Delivery Plans, Neighbourhood Plans and planning applications, including major development/strategic land allocations.&lt;/p&gt;\n&lt;p&gt;The role supports the NHS in driving transformation as well as value for money in planning, commissioning and service delivery. The role is designed to build a combination of subject matter expertise and technical skills to enable the post holder to represent the impact and needs of the NHS in response to development growth and changing demographics.&lt;/p&gt;\n&lt;p&gt;The role will require a close working relationship with public health colleagues and input into local and national planning guidance documents. Development of strong links with Local Planning Authorities (LPAs) and early engagement with LPA plans and master planning processes will provide a basis for clear understanding of the health agenda and the impact of development growth. This approached to joint working and information sharing will help to develop an evidence base for draft plans and ensure quality input to planning policy documents. Development of a strong evidence base will be key to understanding requirements for sustainable delivery of health care services and ensuring that opportunities for mitigation are maximised and fully support delivery of the STP Estates Strategy.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mid Essex Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128374"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelmsford", "postalCode": "CM2 5PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.75", "longitude": ".509112"}}, "title": "Planning Policy Officer - Band 8B", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244369", "validThrough": "2020-11-16T23:59:59+0000"}