{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum, pro rata"}}, "datePosted": "2020-11-02T09:46:29+0000", "description": "&lt;p&gt;We are looking to recruit a number of Nurse Associates. We are offering exciting opportunities in a range of settings, across our medical and surgical inpatient areas. As a newly qualified Nursing Associate you can expect to benefit from our established nursing induction, preceptorship and graduate programs. You will also be support by our clinical education team as you transition into the role of the Nursing Associate at CHFT.&lt;/p&gt;\n&lt;p&gt;We are looking for a Nursing Associate that has a breadth of knowledge across the fields of nursing, providing holistic and person centered care and support for people of all ages in a variety of settings. The successful candidate will work independently under the leadership of registered nurses, working within the sphere of nursing.&lt;/p&gt;\n&lt;p&gt;Nursing associates are equipped with the knowledge, understanding, skills attitudes and behaviours relevant to employment as a nursing associate and will work to a nationally recognised code of conduct. Nursing associates will be registered with Nursing and Midwifery Council. (NMC)&lt;/p&gt;\n&lt;p&gt;Nursing associates contribute to the health and well-being of patients and service users, and apply across all health and care settings. Integral to all of this is the ability to communicate effectively, with sensitivity and compassion, and to manage relationships with people.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;*** We also have positions available in Tissue Viability. ***&lt;/p&gt;\n&lt;p&gt;You will be working with a highly skilled specialist tissue viability nursing workforce and liaising closely with other members of the multidisciplinary team including community and hospital nurses, therapists and nurses in care homes.&lt;/p&gt;\n&lt;p&gt;This new and innovative position will offer you the opportunity to work as a Registered Nursing Associate supporting the Tissue Viability service reviewing patients in acute and community settings including patients’ own homes and care homes. As a role model, you will promote high standards of care through education and training.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Michelle Bamforth on 01484 355896, Michelle.bamforth@cht.nhs.uk or Vicki Power on 01484 342942. Victoria.Power@cht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield", "postalCode": "HD3 3EA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6555", "longitude": "-1.81634"}}, "title": "Nursing Associates", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251478", "validThrough": "2020-11-29T23:59:59+0000"}