{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26324", "minValue": "26324", "unitText": "YEAR", "value": "£15.66 per hour"}}, "datePosted": "2020-10-22T15:16:25+0100", "description": "&lt;p&gt;&lt;strong&gt;Permanent, Part-Time Contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;144 Hours Per Month&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date:TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Registered Nurse with Marie Curie, you&#39;ll be there for people in their time of greatest need. We provide free specialist care and support to patients with terminal illnesses whilst offering vital emotional support for their families. It&#39;s all about giving them the best possible quality of life. The support we offer is tailored to meet individuals&#39; medical, social, spiritual and emotional needs.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for enthusiastic Registered Nurses (RN&#39;s) to join our teams across Birmingham and Solihull. You will be working across all our commissioned services and will be part of a team providing excellent individualized care, enabling patients to be cared for and die in their own homes surrounded by their families and loved ones.&lt;/p&gt;\n&lt;p&gt;Please note this post is a night-shift only position, from 10pm until 7am.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;As an RN you will come with an RGN level 1 registration&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be able to demonstrate a sound understanding of palliative care and the needs of patients at the end of life, experience of community working is desirable.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;NVQ Assessor qualification or equivalent is also desirable or willingness to work towards.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;A driver&#39;s license and the use of a car insured for business use, are essential.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What&#39;s in it for you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Continued access to NHS Pension Scheme (subject to eligibility)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Marie Curie Group Personal Pension Scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Loan schemes for bikes; computers and satellite navigation systems&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Continuous development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Industry leading training programmes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible Working&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;There is also the opportunity to develop the role by supporting our team of Healthcare Assistants in delivering excellent care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For more information, or an informal discussion please contact Sarah Goode, Clinical Nurse Manager on 07515 133 259.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Every day of your life matters - from the first to the last. When you work for Marie Curie, you understand that better than ever. We&#39;re a passionate, committed and diverse team of more than 4,400 staff and 12,000 volunteers, here for people living with any terminal illness, and their families.&lt;/p&gt;\n&lt;p&gt;Marie Curie is committed to its values, which underpin our work. We take stringent steps to ensure that the people who join our organisation through employment or volunteering, are suitable for their roles and are committed to safeguarding all our people from harm. This includes our staff, volunteers and all those who use or come into contact with our services. We are dedicated to creating not just a safe place to work but also a supportive and rewarding one.&lt;/p&gt;\n&lt;p&gt;We are committed to a world where everyone can thrive and fulfil their potential. We are devoted to the social justice imperatives and organisational benefits of full diversity, inclusion and equity in the workplace, and are a Stonewall champion. We actively encourage and welcome applications from candidates of diverse cultures, perspectives and lived experiences.&lt;/p&gt;\n&lt;p&gt;This role will be subject to receiving a satisfactory Enhanced criminal record check.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We reserve the right to close this vacancy early. Agencies need not apply.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Marie Curie", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129502"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham and Solihull, West Midlands", "postalCode": "B91"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4143", "longitude": "-1.77356"}}, "title": "Registered Nurse - Planned Service - Birmingham and Solihull", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239115", "validThrough": "2020-11-19T23:59:59+0000"}