{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa Inc HCAS"}}, "datePosted": "2020-11-05T08:45:35+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Suitable candidates who do not fully meet the person specification should discuss the possibility of an initial training post at band 6.&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We are seeking a clinical nurse specialist at Royal Brompton Hospital with enthusiasm and skills to provide a supportive care service to patients who have been referred to the trust for treatment or investigation for cancer. The Royal Brompton is a nationally and internationally known tertiary hospital. The majority of our patients are referred for surgery for primary lung cancer. We also provide a specialist thoracic sarcoma service in conjunction with Royal Marsden and UCLH. Patients are also referred for management of secondary cancers or with more extensive disease. There is also a well-established interventional radiology service offering a lung tumour ablation. The post holder will work within the multidisciplinary team to support patients and their families through their treatment which includes diagnosis, potentially curative resection and palliative interventions.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The Royal Brompton &amp; Harefield NHS Foundation Trust is the UK’s largest specialist heart and lung centre. We are a world famous organisation with a proud history in the investigation, treatment and research of heart and lung disease. From our two sites – in Chelsea, London and Harefield, Middlesex – we strive to develop our staff both personally and professionally to ensure our patients get the first-class service they deserve.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;You will be an experienced nurse with a strong thoracic surgical and / or cancer care background. Excellent communication skills and an ability to work in a multidisciplinary environment are essential. In return we would be able to offer a supportive and cutting-edge work setting with great opportunities for professional development. Informal discussions are encouraged. Suitable candidates who do not fully meet the person specification should discuss the possibility of an initial training post at band 6.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information or an informal visit please contact Matthew Johnson, Macmillan Lead Cancer Nurse on 07531978548 or via email, m.johnson@rbht.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121402.jpg", "name": "Royal Brompton and Harefield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121402"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Brompton Hospital  London  SW3 6NP", "postalCode": "SW3 6NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4897", "longitude": "-.170831"}}, "title": "Band 7 Macmillan Clinical Nurse Specialist in Thoracic Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256950", "validThrough": "2020-11-21T23:59:59+0000"}