{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 + 5% HCAS + Welcome Benefit"}}, "datePosted": "2020-11-05T17:30:12+0000", "description": "&lt;p&gt;If you are an amazing health visitor that wants to positively impact the outcomes for children, young people and their families across East Surrey – then read on!&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a passionate, innovative and motivated health visitor to join our mixed skilled 0-19 team which forms a part of Children and Family Health Surrey, and help make our service even stronger.  We are particularly keen to hear from Health visitors who would be interested in primarily working on our 0-19 advice line which provides support to families on all aspects of child health, development and parenting. It also acts as a point of contact to our services from partner agencies.&lt;/p&gt;\n&lt;p&gt;We would welcome applications from health visitors that possess excellent clinical, interpersonal and communication skills, are able to use their initiative and value our strong approach to team working.&lt;/p&gt;\n&lt;p&gt;If you have a good understanding of children, young people and their families and could deliver the healthy child programme to the wonderfully diverse population across East Surrey we’d really like to hear from you.&lt;/p&gt;\n&lt;p&gt;Our health visitors are supported by our clinical specialists, clinical team leaders, service managers and our safeguarding team to provide excellent professional practice and to further develop their skills and knowledge.&lt;/p&gt;\n&lt;p&gt;As well as receiving a £2,000 welcome bonus (terms and conditions apply) the successful candidate can also benefit from flexible working - both full and part time positions are currently available – and a commitment to professional development through a stimulating training plan. We also have an excellent preceptorship model to support newly qualified health visitors.&lt;/p&gt;\n&lt;p&gt;Positions are available at a number of locations in East Surrey including Redhill, Caterham and Horley.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126974.jpg", "name": "First Community Health and Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126974"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill", "postalCode": "RH1 6YS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2356", "longitude": "-.170741"}}, "title": "Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258717", "validThrough": "2020-11-20T23:59:59+0000"}