{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-23T09:30:53+0100", "description": "&lt;p&gt;An opportunity has arisen for a Band 7 to join the Hospital Occupational Therapy &amp; Physiotherapy team at Blackpool Victoria Hospital.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic and enthusiastic therapist with a special interest in the management of Frailty to develop an exciting, new and innovative service managing patients who are receiving care across the unscheduled care wards.&lt;/p&gt;\n&lt;p&gt;We invite applications from Occupational Therapists &amp; Physiotherapists who have recent clinical experience with the management of frailty, along with expertise in assessing and treating this client group. The applicant should have an excellent understanding of the effects of Frailty on individual function &amp; quality of life, and interventions for both the physical and psychological well-being of patients.&lt;/p&gt;\n&lt;p&gt;The post holder will work jointly with the other Therapy Team Leads as well as collaborative working with the Frailty &amp; Care of the Older Person Consultants &amp; Advanced Care Practitioners for the in-patient service.&lt;/p&gt;\n&lt;p&gt;The post holder must be able to demonstrate the ability to take on new challenges, and lead on the continuous development of this new role. They must have knowledge and skills in developing therapy pathways, audit service effectiveness, and collect and report data.&lt;/p&gt;\n&lt;p&gt;This role requires the applicant to have significant post graduate NHS experience, a good understanding of risk management and moving and handling experience. In addition, excellent communication skills are essential and the ability to manage and prioritise a large caseload of patients with complex needs.&lt;/p&gt;\n&lt;p&gt;This role will be based within the Hospital Therapy Department. Successful candidates will have access to clinical supervision, CPD time and be supported in their role with an individualized job plan.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoanne Wild,Job titleClinical Lead Occupational TherapistEmail addressjoanne.wild1@nhs.netTelephone number01253 955172&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Victoria Hospital, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Clinical Specialist Frailty Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239829", "validThrough": "2020-11-06T23:59:59+0000"}