{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive + including NHS pension scheme"}}, "datePosted": "2020-10-30T10:53:00+0000", "description": "&lt;h1&gt;&lt;strong&gt;Practice Nurse &lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;Are you a Practice Nurse looking for an opportunity to work with supportive colleagues in a team environment?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;The main duties of the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 12px;&quot;&gt;Practice Nurses assess, screen, treat and educate all sections of the community, from babies to older people. The successful candidate will provide nursing care to patients in a Primary care setting, supported by a team of experienced GPs, Advanced Nurse Practitioners, Specialist Nurses and Practice Nurses.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;At Priory Medical Group, all our employees should enjoy coming to work and enjoy feeling a part of the team! We will ensure you are provided with a clinical supervisor and a supportive network around you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we look for in your application&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;It is not essential (desirable only) for the successful candidate to have a proven background in a General Practice setting;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Desirable not essential: Independent Prescribing&lt;/li&gt;\n&lt;li&gt;Desirable not essential: Previous experience of smear taking&lt;/li&gt;\n&lt;li&gt;Demonstrate excellent communication and listening skills, so you can work with people of all ages and backgrounds.&lt;/li&gt;\n&lt;li&gt;Demonstrate patience and empathy, so you can gain the trust of patients with a variety of health issues.&lt;/li&gt;\n&lt;li&gt;Registered General Nurse. Experience of cervical screening desirable and immunisations are essential.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt; So are you in?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;&lt;span style=&quot;font-size: 12px;&quot;&gt;Our intention is always for the Nurse to have two primary surgeries at which they are based for continuity of patient care and your surgery team, although we have nine surgeries across York, all of which you may be required to work from.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;Open to discussion - Full or Part time Negotiable and Family Friendly Working Hours Negotiable.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay:&lt;/strong&gt;&lt;span style=&quot;font-size: 12px;&quot;&gt;Competitive. Dependent upon the strength of the candidate + including NHS pension scheme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection for Interview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 12px;&quot;&gt;The Practice recognises that discrimination of any kind is both unlawful and would act as a barrier to finding the most talented individuals for our organisation. As such, our recruitment and selection procedures exist to ensure no job applicant, employee or worker is discriminated against either directly or indirectly on the grounds of age, disability, gender reassignment, marriage and civil partnership, pregnancy or maternity, race, religion or belief, sex or sexual orientation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 12px;&quot;&gt;A great deal of careful consideration has been invested in preparing the advert for this post based on the specification for this role and the person we are looking for. &lt;/span&gt;&lt;strong&gt;Our selection for interview process is designed to ensure individuals are selected for interview on the merit of their application only&lt;/strong&gt;&lt;span style=&quot;font-size: 12px;&quot;&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are applying through NHS Jobs, you will notice you are asked if you would like a guaranteed interview as part of the ‘Two Tick’ disability scheme. Whilst this is an admirable government initiative, please be aware we are not signed up to this scheme. This is a question on the NHS jobs application form which is outside of our own control. Our own process ensures we consider candidates on the merit of their application only and we do not ask any questions regarding a disability as part of our selection process. We only give candidates the opportunity to share information regarding any disability after candidates are invited to interview and only if the candidate feels they require adjustments in the interview process.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Medical Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO24 3WX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9495", "longitude": "-1.12943"}}, "title": "Practice Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249820", "validThrough": "2020-12-08T23:59:59+0000"}