{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-05T12:01:00+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Flow Coordinator within the Endoscopy service. We are looking for an organised and reliable individual with excellent problem solving skills to join our busy Endoscopy Department at University Hospital Southampton NHS Foundation Trust (UHS). Your main role would be the effective and efficient flow of elective day case, inpatients and emergency patients through the department reporting to the Nurse Coordinator, Senior Sisters and the Operational Manager.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE TEAM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Endoscopy service is accredited to the Joint Advisory Group (JAG) which provides quality assurance of the service offered to patients. The service offers both diagnostic and therapeutic procedures for gastrointestinal, hepatic/pancreatic and respiratory medical conditions, provided by a multidisciplinary group of consultants and clinicians. The post holders will be required to work flexibly Monday – Sunday between the hours of 8am and 8pm (usual hours between 8am and 5pm but you may on occasion be required to work an evening or weekend with prior notice).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT YOU’LL DO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be responsible for providing accurate information relating to patient flow within Endoscopy Department, highlighting when bottlenecks are likely to occur.&lt;/li&gt;\n&lt;li&gt;Be the point of contact for patients requiring emergency endoscopy procedures, liaising with clinicians, nursing staff, intensive care and Theatre Coordinators to ensure patients are seen within a suitable timeframe.&lt;/li&gt;\n&lt;li&gt;Identify and pre-empt daily endoscopic equipment issues and escalating to the nurse coordinator.&lt;/li&gt;\n&lt;li&gt;Be the point of contact for inpatient flow liaising with Endoscopy Clinicians, wards, ITU and theatre coordinators to facilitate patient procedures escalating to the Operational Team when demand on the service is problematic.&lt;/li&gt;\n&lt;li&gt;Be responsible for the bed booking process for elective day cases on a daily basis in conjunction with the Endoscopy Coordinator. You will ensure that site management and operational teams receive the daily bed requirements for Endoscopy escalating issues to the Operational Team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE’RE LOOKING FOR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who can demonstrate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowledge of data systems and previous experience with patient flow coordination or bed management would be an advantage.&lt;/li&gt;\n&lt;li&gt;You will need to be an excellent communicator, confident and appropriately assertive when dealing with clinical and managerial colleagues of all levels.&lt;/li&gt;\n&lt;li&gt;You will have the ability to remain calm under pressure whilst managing competing demands.&lt;/li&gt;\n&lt;li&gt;You will be able to work independently, show initiative and prioritise your workload, but be able to recognise when you need to escalate issues or seek support&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ADDITIONAL INFORMATION&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will be held provisionally on Tuesday, 08 December 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alex Goddard&lt;/p&gt;\n&lt;p&gt;Nurse Lead Endoscopy&lt;/p&gt;\n&lt;p&gt;Alex.Goddard@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381 203186&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Operational Manager&lt;/p&gt;\n&lt;p&gt;Sini Joseph&lt;/p&gt;\n&lt;p&gt;Sini.Joesph@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Adam Jackson&lt;/p&gt;\n&lt;p&gt;Adam.Jackson@uhs.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Flow Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257549", "validThrough": "2020-11-19T23:59:59+0000"}