{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 - £37,267 pa pr"}}, "datePosted": "2020-11-05T17:15:58+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Service Summary:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced Community Learning Disability Nurse to join a highly experienced multi-professional health care team working in the Learning Disabilities Directorate within the Specialist Services Division of Pennine Care NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The post-holder will be based within the Adult Learning Disability Team in Oldham.&lt;/p&gt;\n&lt;p&gt;Oldham learning disability team is multidisciplinary working with individuals with a learning disability from age 18. We deliver high quality health focused assessments and interventions to people with complex and challenging needs. The team comprises of community nurses, physiotherapists, social workers, speech and language therapists, psychologists and psychiatry input. The health team is integrated with Oldham Council&#39;s Adult Learning Disability Team based at the Oldham Civic Centre, in open plan office accommodation. The team works across the borough of Oldham.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Summary:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Delivery of evidence based health / behaviour assessments and interventions to adults with learning disabilities who may have complex and challenging needs. You will be working in a multi- disciplinary context with the expectation to be person centred, creative and innovative in meeting the complex needs of individuals whilst offering support to families and carers.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A key role is&lt;/span&gt;&lt;span&gt; the delivery of training and positive behaviourial support to a range of providers There are regular opportunities for continuing professional development and peer supervision with other community nurses working in the Directorate. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Evidence of supervisory skills is essential as the post-holder will be responsible for clinically supervising other qualified nurses and student nurses. The post holder will be involved in the development, implementation and review of care pathways alongside experienced clinicians from other areas of the directorate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities of the Post:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will work in partnership with all members of the Learning Disability Team to achieve the Good Health objectives of ‘Valuing People’&lt;/p&gt;\n&lt;p&gt;To provide an efficient, timely, high quality community nursing service to people with learning disabilities and their families and carers&lt;/p&gt;\n&lt;p&gt;To undertake a range of comprehensive assessments for individuals with complex and challenging needs. This assessment work requires a highly specialist knowledge base on which to practice&lt;/p&gt;\n&lt;p&gt;To develop a range of interventions and specialised care plans. To develop a range of person centred, specialist interventions to meet the needs of service users with a learning disability&lt;/p&gt;\n&lt;p&gt;To coordinate, monitor and evaluate complex interventions and packages of care within a defined caseload&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJohn KingJob titleClinical Team ManagerEmail addressjohnking@nhs.netTelephone number0161 770 2920Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact John King, Team Manager, on 0161 770 2920&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oldham Civic Centre, Oldham", "postalCode": "OL1 1UT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5423", "longitude": "-2.11722"}}, "title": "Community Learning Disability Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258685", "validThrough": "2020-11-19T23:59:59+0000"}