{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751  Per Annum"}}, "datePosted": "2020-11-03T12:16:26+0000", "description": "&lt;p&gt;An opportunity has arisen for a highly motivated and enthusiastic Specialty Doctor to work in the Emergency Department (ED) at Yeovil District Hospital (YDH).&lt;/p&gt;\n&lt;p&gt;This is a permanent or fixed term position and can be part time or full time working on an extremely flexible annualised rota, particularly suiting candidates who would benefit from regular paid time off to travel and candidates with young families.&lt;/p&gt;\n&lt;p&gt;We are a modern Foundation Trust, with a friendly supportive working environment; we have been repeatedly rated as one of the top-10 healthcare employers in the country. We are one of only a handful of Trusts in the country to consistently achieve the 4 hour standard, and for 2017 achieved more than 95% for a full 12 months. This was achieved by integrated working with the hospital wide Patient Flow team and extensive work within the Trust to develop robust pathways for patients requiring support and rehabilitation, meaning they do not stay in hospital as long as they used to.&lt;/p&gt;\n&lt;p&gt;Our diverse patient-mix of approximately 50,000 attendances per year (both adult and children) and responsibilities as an accredited Trauma Unit provide varied and interesting clinical challenges.&lt;/p&gt;\n&lt;p&gt;Our geographical location, which is approximately an hour and a half from the regional Major Trauma Centre (MTC) in Bristol, means that the department receives some trauma patients who due to the severity of their injuries would, if we were located closer, go directly to the MTC. The department therefore requires Doctors to be skilled to deal with a wide variety of trauma, some of whom are critically injured and support can be given for any candidate who wishes to improve their skills.&lt;/p&gt;\n&lt;p&gt;It is an extremely exciting time to join Yeovil District Hospital. We have been one of only a handful of acute trusts that have maintained flow throughout the Winter 2019/20 and now also the pandemic. We introduced standard PPE in all ED areas (hot or cold) before it was mandated by Public Health England. We have access to an award-winning Ambulatory Emergency Care Unit, which is co-located to the ED. We are naturally keen to expand this service. Despite the pandemic, our ED expansion plans has progressed, which will provide us with an enhanced ED footprint in time for Winter 2020/21. This will include a pandemic-ready Paediatric Assessment Unit, and an enhanced majors area with individualised cubicles. We already have access to frailty, occupational therapy, mental health (adult and paediatric), stroke services, as well as a Specialty Assessment Unit to support flow seven days a week. The support and engagement of the Trust management at all levels enables creative and rewarding leadership of the service; innovative thinking is the norm.&lt;/p&gt;\n&lt;p&gt;There is a purpose built education and clinical skills centre within the hospital available for use by all health professionals. A bespoke development programme will be tailored to the successful candidate’s needs. This will allow the successful candidate to achieve all the ED ACCS competencies and relevant life support courses over a two-year period. This will help the successful candidate to reach the competency required to progress into specialty training, or indeed the CESR programme (also provided locally). An e-portfolio is sponsored by the ED.&lt;/p&gt;\n&lt;p&gt;There is a high level of Consultant supervision and support with regular Clinical Governance meetings and bite size teaching sessions. Audit and research interests will be encouraged.&lt;/p&gt;\n&lt;p&gt;Yeovil District Hospital is located within pleasant countryside, only two hours from London and less than one hour from the world-famous Jurassic coast. Brand new single and family staff accommodation is located a few minutes away from the hospital.&lt;/p&gt;\n&lt;p&gt;Whether you are an established Specialty Doctor looking for a challenging new role or you think that life in a rural ED in one of the most beautiful parts of the UK might suit you, we would like to hear from you for a no-obligation chat. We can also offer taster locum sessions for a more immersive experience.&lt;/p&gt;\n&lt;p&gt;For further information about working for Yeovil District Hospital, please refer to our website:&lt;/p&gt;\n&lt;p&gt;We really value the impact that you as a specialty doctor will have on our patients and services; we therefore offer an enhanced benefits package (subject to criteria) which includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Welcome to Yeovil Payment&lt;/li&gt;\n&lt;li&gt;A generous relocation package, including Visa and travel costs&lt;/li&gt;\n&lt;li&gt;4 hours of paid time for professional development every week&lt;/li&gt;\n&lt;li&gt;£700 personal budget for training and development every year (excluding life support training and ePortfolio, which are separately funded)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For a no obligation chat, further information regarding the vacancy or to arrange a visit to the hospital please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Jon Tipping - Clinical Director on 01935 384784&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For information regarding our enhanced Benefits Package please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Carol Gill, Medical Recruitment Officer via email: carol.gill@ydh.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121892.jpg", "name": "Yeovil District Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121892"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Yeovil Hospital, Yeovil", "postalCode": "BA21 4AT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9453", "longitude": "-2.63391"}}, "title": "Specialty Doctor Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253926", "validThrough": "2020-11-17T23:59:59+0000"}