{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £51,668 per annum"}}, "datePosted": "2020-10-14T09:46:55+0100", "description": "&lt;p&gt;2 year Fixed Term/ Secondment Opportunity&lt;/p&gt;\n&lt;p&gt;Additional funding means that we now have a vacancy for a full-time Band 8a Clinical Psychologist in the Substance Misuse part of our S-CAMHS service in Hywel Dda University Health Board. We are also able to provide the opportunity for a development post and so newly qualified clinical psychologists are encouraged to apply and if successful, they would be appointed to Band 7 and move to Band 8a when the necessary competencies have been met via the PADR process.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have the role of developing a new provision for those young people who have experienced Adverse Childhood Experiences and are felt to be at risk of developing substance misuse problem, and this will include providing consultation to the system around the young person, as well as assessment, formulation and psychological intervention. They will work within the Substance Misuse Service within S-CAMHS and while based in Carmarthen (Glangwili Hospital), they will be required to provide a service across the Health Board footprint.&lt;/p&gt;\n&lt;p&gt;The post will initially be for a fixed term of 2 years but with the potential to stabilise the post in the future and it is an opportunity to be part of a welcoming, forward thinking and creative Specialist CAMHS service. The service has good links with the South Wales D Clin Psy training course and the service encourages developing areas of specialist interest in line with service needs. West Wales is a beautiful place to live, especially for those who enjoy outdoor activities. Applicants wanting full time or part time hours will be considered.&lt;/p&gt;\n&lt;p&gt;For any enquiries, please contact Dr Andrea Mowthorpe, Lead for Psychology in Sp CAMHS, on 01437 773774 or andrea.mowthorpe@wales.nhs.uk.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrea MowthorpeJob titlePsychology Lead in S-CAMHSEmail addressAndrea.Mowthorpe@wales.nhs.ukTelephone number01437 773774&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Clinical Psychologist S-CAMHS Substance Misuse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225548", "validThrough": "2020-11-10T23:59:59+0000"}