{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-26T10:01:05+0000", "description": "&lt;p&gt;The Division of Newborn Services is a neonatal managed clinical service (MCS) working across two sites.&lt;/p&gt;\n&lt;p&gt;We are looking for the right person to join an already established Junior Sister/Charge Nurse team. There is an opportunity to join the established neonatal nursing team across the Managed Clinical Service (MCS) in our busy newborn service.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Newborn Services, MCS is one service across two sites; the Newborn Intensive Care Unit (NICU) is based on the Oxford Road Campus (ORC) and the Local Neonatal Unit based at Saint Mary&#39;s at Wythenshawe. The NICU at Saint Mary&#39;s Hospital is a state of the art facility co-located with the maternity unit and Royal Manchester Children’s Hospital, renowned for high standards of clinical care, research and education. Saint Mary&#39;s is one of three NICU’s in Greater Manchester and as a tertiary unit is the only provider of neonatal surgery and specialist paediatric services. There is a strong emphasis on multidisciplinary working and family integrated care is a central element of the unit culture. This spreads across to our sister unit at Wythenshawe, designated as a local neonatal unit providing short term intensive, high dependency and special care to families residing in the local area.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;High quality, evidenced based care is the hallmark of our service and we pride ourselves in delivering excellent quality of care along with as positive an experience for families as possible. We provide a cutting edge service and this is your opportunity to influence the experience of infants and families by contributing to the leadership of a strong and dedicated workforce, role modelling positive behaviours, supporting the team to deliver the highest standards of safe and effective care. This post is pivotal within the unit nursing structure.&lt;/p&gt;\n&lt;p&gt;We are looking for a qualified in specificity nurse with significant neonatal experience at Band 5 or above within a neonatal intensive care unit and evidence of degree level study.&lt;/p&gt;\n&lt;p&gt;This post is pivotal within the unit nursing structure. You will have specialist clinical leadership and management skills and the knowledge to support the organisation in the delivery of the highest quality of care, supporting and teaching staff to become competent, autonomous practitioners.&lt;/p&gt;\n&lt;p&gt;You should hold both Qualification in Specialty and be in possession of a current NLS provider certificate.&lt;/p&gt;\n&lt;p&gt;Alongside the senior nursing team of senior sisters, Matrons and Lead Nurse you will contribute to the setting, monitoring and supporting maintenance of professional standards and support the development of staff through individual supervision and performance appraisals across the managed clinical service.&lt;/p&gt;\n&lt;p&gt;You must be a team player with exemplary communication and interpersonal skills. A caring, compassionate, skilled and knowledgeable neonatal nurse, who works well in a busy and fast paced environment. You will be committed to the support and development of self and others and driven and motivated to work collaboratively in order to achieve the highest standards of care for infants and families.&lt;/p&gt;\n&lt;p&gt;This is a highly successful and dynamic service with a reputation for the delivery of high standards of compassionate clinical care, education and research. We want to continue to progress these aspects of our service and want a post holder who shares our vision and will rise positively to the challenges the future will hold.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise Frampton and Dan FodenAdditional contact information&lt;/p&gt;\n&lt;p&gt;Charge Nurse Dan Foden daniel.foden@mft.nhs.uk 0161 291 2808&lt;/p&gt;\n&lt;p&gt;Senior Sister Louise Frampton, louise.frampton@mft.nhs.uk 0161 701 2700 (reception)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester University NHS Foundation Trust (formerly CMFT), Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Junior Sister/Charge Nurse - Newborn Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241933", "validThrough": "2020-11-09T23:59:59+0000"}