{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615. per annum"}}, "datePosted": "2020-10-15T12:31:12+0100", "description": "&lt;p&gt;&lt;span&gt;Our team cannot wait to welcome you with open arms to our fantastic colorectal ward. It&#39;s busy, it&#39;s fast-paced, it&#39;s challenging, however, we know you&#39;ll thrive in this environment, playing your part in the care and support of our patients who really do need us to be at the top of our game. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We won&#39;t shy away from saying that it will at times be a demanding role, and we are carrying a few more vacancies than we would like to be. However, we are confident if you come along and see what it&#39;s like here, you will soon be joining us and helping us encourage and welcome other like-minded colleagues to join our fab team too.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are so very proud of our work and our team spirit embodies everything we do, whether it&#39;s our &#39;2pm teach&#39; daily training sessions or our charity fundraising efforts, we do it as one team and it keeps us strong.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a full complement of skilled and dedicated support staff to help you in the role and our Consultants are highly motivated to provide the very best standard of care for our patients and have developed a unique system of ward –round safety check-lists and pro-formas. They will always be happy to teach the whole team about the work they do and very approachable, happy to learn a thing or two from you too.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you think you know what it&#39;s like on Ward 12, think again. We believe the best people to talk to you about our ward environment are our very own team, so we asked them and these are the kinds of things they said: &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;‘I have been made to feel so welcome since I moved to Ward 12&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;‘Love the team , love my job’&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;‘I moved from a completely different speciality, have loved developing my knowledge in this field.’&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We don’t care if you have never worked with colorectal patients before, we are more interested in your wider nursing skills, experience, behaviours and attributes, as only the best all round nurses will do for our patients and we don&#39;t apologise for that. We can teach you everything you need to know once you are here.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You may not know this, but our Colorectal surgery department here is widely seen as one of the best units in the region. No other North West unit can rival the range of sub-specialist surgery we offer.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our speciality areas include the full range of laparoscopic and open cancer surgery including advanced rectal and anal cancer, pelvic floor surgery, advanced robotic surgery of the rectum, Laparoscopic complex inflammatory bowel disease reconstructions, Trans anal microsurgery for complex rectal polyps, abdominal wall reconstruction and complex bowel endometriosis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have surgeons who are outstanding and leaders in their field as well as educational leaders regionally and nationally. The structure we have developed for 7 day consultant led ward rounds has reduced length of stay and provides the best possible medical care for our patients. Our unit is sought-after by surgical trainees who feel supported and supervised and educated, and the feedback is outstanding.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are immensely proud of our unit and work together seamlessly as a team for our patients. The inflammatory bowel service has been found to be amongst the highest performing units in the whole UK and a visit to our site is planned to use towards a benchmark.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Joining us provides a unique opportunity for learning, development and highly rewarding but challenging work as part of a friendly and cohesive colorectal team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Sister Kath Jackson would absolutely love you to get in touch to have an informal chat about the role, but better still would like to invite you to come along to the ward on to see what it’s like for yourself. Whilst you are here, you can spend time with our Clinical Educator learning about the topic of the day so you get valuable cpd time thrown in too.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;To arrange a chat or come and have a visit, please email &lt;/span&gt;&lt;span&gt;kath.jackson@lthtr.nhs.uk&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Staff Nurse - Colorectal Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228165", "validThrough": "2020-11-08T23:59:59+0000"}