{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa"}}, "datePosted": "2020-10-30T15:31:24+0000", "description": "&lt;p&gt;&lt;strong&gt;INFECTION PREVENTION &amp; CONTROL DEPARTMENT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;MATRON INFECTION PREVENTION &amp; CONTROL NURSE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8A&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Band 8a to join our Infection Prevention &amp; Control Team.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic, highly motivated and experienced nurse, to join our dedicated team which provides an Infection Prevention &amp; Control service for Buckinghamshire Healthcare NHS Trust. The Infection Prevention &amp; Control Team covers all our hospital sites, Amersham, Buckingham, Marlow, Stoke Mandeville, Thame, and Wycombe.&lt;/p&gt;\n&lt;p&gt;In the role of Matron you will manage a dynamic team of IPC Nurses across the organisation providing day to day line management and supervision.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with the Director of Infection Prevention &amp; Control, Deputy Director of Nursing and other members of the team to provide a cohesive and consistent approach to the prevention and control of infection across Buckinghamshire Healthcare NHS Trust.&lt;/p&gt;\n&lt;p&gt;You will be required to ensure that robust practices in Infection Prevention and Control are monitored and maintained within the Trust. You will do this by ensuring key processes are in place to support all Trust employees, patients and visitors in maintaining the required standards in order to deliver ‘harm free care’ to our users and protection of our employees.&lt;br /&gt;&lt;br /&gt;You will have an approachable personality, a strong commitment to team working, good communication and interpersonal skills with a sound track record in clinical practice, inter-professional working and the ability to motivate others.&lt;br /&gt;&lt;br /&gt;As a Registered Nurse you will have extensive clinical and ward/department management experience. You must have previous experience in Infection Prevention and be familiar with current Infection Prevention &amp; Control regulations and guidelines. A recognised teaching qualification is also required in order to undertake the educational aspects of this role.&lt;/p&gt;\n&lt;p&gt;A full driving licence and access to car for work purposes is essential&lt;/p&gt;\n&lt;p&gt;Interview date 20th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helene Anderson Deputy Chief Nurse&lt;/p&gt;\n&lt;p&gt;07824 606 857&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross-site working, Stoke Mandeville", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Matron - Infection Prevention &amp; Control Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250750", "validThrough": "2020-11-13T23:59:59+0000"}