{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-23T12:45:59+0100", "description": "&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a dynamic, motivated and experienced Speech and Language Therapist to join our team.&lt;/p&gt;\n&lt;p&gt;The role involves leading, coordinating and developing the clinical service to adults with acquired dysphagia and supporting the leadership and development of the SLT team. Applicants should have significant knowledge and experience of working with adults with acquired disorders of swallowing and communication in an acute setting and VFSS competency. Experience with tracheostomy management is preferred. You will be responsible for delivering high quality; evidence based care and be passionate about improving health outcomes. Excellent organisational and prioritisation skills and the ability to work effectively within a team are essential.&lt;/p&gt;\n&lt;p&gt;The role includes carrying out instrumental assessments (VFSS) and assisting in the training and supervision of other SLT staff in these assessments. The post holder will contribute to service developments and audits within their area of specialism plus provide specialist training and supervision to junior colleagues, assistants, students and other health professionals. You will lead on the development and coordination of dysphagia service provision and pathways at Fairfield General Hospital.&lt;/p&gt;\n&lt;p&gt;The Speech Therapy team hold regular team meetings and you will be part of a dynamic, forward thinking and professional service with a strong commitment to CPD and supervision. Therapists are encouraged to establish links and seek opportunities for continuing professional development through CEN networks, appropriate multidisciplinary networks and external courses.&lt;/p&gt;\n&lt;p&gt;You will be passionate about our business, creating a culture of continuous improvement, where patient welfare is at the heart of all you do. The selection process will be values based.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMichelle McCormackJob titleOperational &amp; Professional Lead, Speech &amp; Language TherapyEmail addressMichelle.McCormack@pat.nhs.ukTelephone number0161 918 8570&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fairfield General Hospital, Bury", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Highly Specialist Speech and Language Therapist - Dysphagia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240573", "validThrough": "2020-11-08T23:59:59+0000"}