{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15280", "minValue": "14826", "unitText": "YEAR", "value": "£8.82 - £9.09 per hour"}}, "datePosted": "2020-10-19T12:20:27+0100", "description": "&lt;p&gt;We, at The Huntercombe Group, are looking to recruit &lt;strong&gt;Residential Care Workers&lt;/strong&gt; for our Children’s Home in Stockton On Tees.&lt;/p&gt;\n&lt;p&gt;The Children’s Home offers both long term and short break care for children/young people who have a learning disability.&lt;/p&gt;\n&lt;p&gt;We currently have full time and part time vacancies for experienced, caring, qualified, skilled, motivated and energetic support workers. You will be working as part of a large team, planning and delivering the highest standards of individualized care and support to our children and young people promoting the very best outcomes across all areas of their lives.&lt;/p&gt;\n&lt;p&gt;We require someone who can empathize with children who have complex needs and manage a range of challenging behaviors.&lt;/p&gt;\n&lt;p&gt;The centre is located in the &lt;strong&gt;village of Norton&lt;/strong&gt;, one mile from&lt;strong&gt; Stockton-On-Tees&lt;/strong&gt; and within &lt;strong&gt;2miles of the A19.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Many of our patients arrive with complex and challenging needs. Huntercombe &lt;strong&gt;Care Workers&lt;/strong&gt; work in small teams with nurses, doctors, therapists and other experts, and together they make a world of difference to people’s lives.&lt;/p&gt;\n&lt;p&gt;When you join The Huntercombe Group as a &lt;strong&gt;Residential Care Worker&lt;/strong&gt;, you will be part of a company that is understanding, strives towards excellence, is innovative, reliable and accessible and above all puts people first.&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Residential Care Worker&lt;/strong&gt; working in our &lt;strong&gt;Child and Adolescent Mental Health Service (CAMHS) &lt;/strong&gt;your main duties will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;To be involved in maintaining and developing a high standard of the care by being aware of individual needs and care programmes&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Supporting the senior team in the running of the shift, whilst showing warmth and support to our patients/residents and their families&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Promoting independence and dignity and positively enhancing the lives of individuals in our care&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Providing practical assistance to the resident/patient, where needed in carrying out everyday living tasks&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To help in providing an environment which is helpful to people with varied and complex needs, realising their potential to live as independently as they can find possible&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Being actively involved with the day to day routine in both individual and group activities&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To Join The Huntercombe Group as Residential Care Worker you will be:&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Empathetic and have a desire to make a difference&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Diploma Level 3 in Children and Young People &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Passionate about forming therapeutic relationships&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Committed to a person-centred approach to recovery&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Enthusiastic about working as part of a dedicated team&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Resilient and able to work under pressure&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;An effective communicator with good written and verbal skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Willing to take ownership for the delivery of quality care and demonstrate leadership qualities&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Legally entitled to work in the UK&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Clear pay structure, with competitive rates&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Generous annual leave entitlement&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay, (up to a maximum salary of £50k)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;2 weeks paid paternity leave&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Shared parental leave, matching the maternity leave benefit&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Death in service benefit equivalent to 2 x salary&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A range of staff discounts&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Employee Assistance Programme (EAP)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click &lt;strong&gt;Apply&lt;/strong&gt; now.&lt;/p&gt;\n&lt;p&gt;To learn more about The Huntercombe Group please visit our website.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockton On Tees", "postalCode": "TS20 2BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.578", "longitude": "-1.31164"}}, "title": "Residential Care Workers", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232242", "validThrough": "2020-11-23T23:59:59+0000"}