{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "11068310", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 10 PA + on call at 5%"}}, "datePosted": "2020-10-30T16:16:58+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;LIVERPOOL UNIVERSITY HOSPITALS NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;AINTREE UNIVERSITY HOSPITAL SITE&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;CONSULTANT PHYSICIANS IN GERIATRIC MEDICINE AND ORTHOGERIATRICS&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Liverpool University Hospitals NHS Foundation Trust wishes to appoint 3 Consultant Physicians in Geriatric and General Medicine, with a special interest in Orthogeriatrics services. These will be full-time posts which attracts 10.8 PA’s, including acute geriatric on-calls.&lt;/p&gt;\n&lt;p&gt;These exciting opportunities have arisen due to the planned merger between the two large university trust hospitals in Liverpool, thus creating one of the country’s largest acute hip fracture services. We are looking for dynamic and enthusiastic individuals to join our current team of 12 Geriatricians, which includes established Orthogeriatricians. These posts offer the opportunity to work on the hip fracture unit to meet best practice tariff and to take responsibility for medical care and rehabilitation in the post-operative period. There will be opportunity to work on the acute geriatrics wards, or within the frailty services, dependent on the successful applicants’ specialist interests.&lt;/p&gt;\n&lt;p&gt;We have a well-established and innovative team of Geriatricians who provide general and sub specialty services including an Frailty Assessment Unit, Hyperacute Stroke Unit providing 24/7 thrombolysis and endovascular intervention, Orthogeriatrics providing Orthopaedic in-reach, Community Geriatrics working with Integrated care Teams, Metabolic Bone Disease services, Parkinson’s disease service, Falls service and a Day Hospital service.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be supported by junior doctors, specialist nurses, allied health professionals and secretarial staff.&lt;/p&gt;\n&lt;p&gt;Applicants must be eligible for inclusion in the GMC Specialist Register and should have CCT in Geriatric Medicine and General (Internal) Medicine (or equivalent), or be within six months of this at time of interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Anne Foley&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Director of Medicine for the Elderly&lt;/p&gt;\n&lt;p&gt;Telephone number: 0151 529 3655&lt;/p&gt;\n&lt;p&gt;Dr Neil Haslam, Divisional Medical Director on 0151 529 3678 or Dr Tristan Cope, Medical Director on 0151 529 2231&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Univertisty Hospital Aintree, Liverpool", "postalCode": "L9 7AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4679", "longitude": "-2.93513"}}, "title": "Consultant Geriatrician with Specialist interest in Orthogeriatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250916", "validThrough": "2020-11-27T23:59:59+0000"}