{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20760", "minValue": "20760", "unitText": "YEAR", "value": "£12.35 per hour"}}, "datePosted": "2020-11-03T15:46:51+0000", "description": "&lt;p&gt;The Nottinghamshire ICS are looking to recruit a core team of vaccinators that will lead the way with administering vaccination’s to the general public of Nottinghamshire.&lt;/p&gt;\n&lt;p&gt;The seasonal flu and pandemic immuniser will work as part of a dynamic team in delivering a safe and effective service for the mass delivery of vaccinations for both influenza and the COVID-19 vaccine(s). The post holder will be responsible for administering the vaccine to citizens within a team of staff working in a pod structure as part of the mass vaccination delivery model.&lt;/p&gt;\n&lt;p&gt;In particular the post holder will be responsible for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Configuration of their vaccination station&lt;/li&gt;\n&lt;li&gt;Administration of the vaccine&lt;/li&gt;\n&lt;li&gt;Disposal of clinical waste and change of PPE as per national guidelines&lt;/li&gt;\n&lt;li&gt;Adherence to infection control practices between individuals&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will need to be available to work various hours over 7 days, with times to be determined over a 12 hour period.&lt;/p&gt;\n&lt;p&gt;You will be based at one of two sites in either the city of Nottingham or the Mansfield area.&lt;/p&gt;\n&lt;p&gt;We would actively encourage applications from experienced vaccinators and those who can administer vaccines under PGD.&lt;/p&gt;\n&lt;p&gt;In line with legislation changes due to come in to place on the 6th November 2020, the following staff groups are also eligible to undertake immunisations following training and under supervision and are also encouraged to apply&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Health Students ( Medical and Dental)&lt;/li&gt;\n&lt;li&gt;St Johns volunteers&lt;/li&gt;\n&lt;li&gt;Those with some first aid training and who fulfil the education and experience requirements eg airline staff, lifeguards etc&lt;/li&gt;\n&lt;li&gt;HCSW&lt;/li&gt;\n&lt;li&gt;Pharmacy Technicians&lt;/li&gt;\n&lt;li&gt;Physician Associates&lt;/li&gt;\n&lt;li&gt;Phlebotomists&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;It is expected that you will be available to undertake the mandatory training package prior to commencing in these roles.&lt;/p&gt;\n&lt;p&gt;If you would like to be involved in this essential piece of work, please get in touch.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City of Nottingham or Mansfield Area, City of Nottingham or Mansfield Area", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Seasonal Flu and Pandemic Vaccinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254641", "validThrough": "2021-01-01T23:59:59+0000"}