{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-29T12:31:31+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM/SECONDMENT FOR TWELVE MONTHS &lt;/strong&gt;&lt;strong&gt;DUE TO FUNDING&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Risk &amp; Assurance Manager/OfW Project Manager&lt;/p&gt;\n&lt;p&gt;Are you an experienced project manager, dynamic and innovative, with a strong desire to improve patient experience in Swansea Bay?&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join the Patient Experience, Risk &amp; Legal team as the Risk &amp; Assurance Manager/Once for Wales (OfW) Project Manager on a 12 month secondment. The post holder will have a key role in supporting the delivery of the technical solution for the new Health Board’s Electronic Concerns Management System/s by implementing efficiently and effectively the new concerns management software packages across all sites of the Health Board, including primary and secondary care services and maintaining its development. The role will also support the Risk &amp; Assurance team to deliver and implement the risk management policy in the organisation by providing training, advice and support.&lt;/p&gt;\n&lt;p&gt;This role will suit a person with a background in project management within the NHS and an understanding of risk management, incident reporting and the diverse Patient Experience Agenda. We are looking for someone with a passion in improving the patient experience and can drive initiative and enthusiasm to support the implementation of the Once for Wales Concerns Management System to strengthen SBUHB’S risk management agenda.&lt;/p&gt;\n&lt;p&gt;If you have the skills described and wish to work in a dynamic progressive team, this is the post for you. We look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJacqueline EvansJob titleInterim Head of ComplianceEmail addressJacqueline.Evans@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swansea Bay Health Board, Baglan Port Talbot", "postalCode": "SA12 7BR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6134", "longitude": "-3.81599"}}, "title": "Risk &amp; Assurance Manager/Once for Wales Concerns Management System Pr", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248337", "validThrough": "2020-11-12T23:59:59+0000"}