{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24004", "minValue": "24004", "unitText": "YEAR", "value": "Up to £14.28 p/h"}}, "datePosted": "2020-10-21T01:09:46+0100", "description": "&lt;h1&gt;&lt;strong&gt;Bank yourself a new or additional position!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;Are you looking for some additional working hours or to gain experience working in a custodial setting? Have you ever thought about working within a prison?&lt;/p&gt;\n&lt;p&gt;We are currently looking for a Bank Pharmacy Technician within HMP Hewell, based in Redditch.&lt;/p&gt;\n&lt;p&gt;Working as a Bank Pharmacy Technician offers you flexibility and workplace variety. You would also be assisting the wider permanent team, covering for planned and unplanned absences.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;What will you be doing?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You&#39;ll be required to support the delivery of Pharmacy Services, which will be part be of a comprehensive healthcare package, based on the prison service’s needs. As a Pharmacy Technician, you will be an integral member of the Pharmacy Team, who forms part of the wider cluster of Healthcare Services. Care UK policies and procedures and statutory frameworks governing patient care in a prison setting, will be used in order to deliver the highest standard of care to patients in line with National Guidelines.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h2&gt;Next steps&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by Amelia Smith, the Internal Recruiter for this role.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Amelia will submit your CV to the hiring manager and then will arrange an interview for you to attend at HMP Hewell if the hiring manager feels that you are suitable for the job.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;The rate of pay is a flat rate of £14.28 per hour, working ad hoc shifts as and when required.&lt;br /&gt;&lt;br /&gt;Please note that this role will close early once a sufficient number of applications have been received.&lt;br /&gt;&lt;br /&gt;Please note that this role is subject to Care UK Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting (arranged locally by site).&lt;br /&gt;&lt;br /&gt;At Care UK, we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redditch", "postalCode": "B97 6QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3256", "longitude": "-1.9916"}}, "title": "Bank Pharmacy Technician - HMP Hewell", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235490", "validThrough": "2020-11-12T23:59:59+0000"}