{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "AfC Band 7 equivalent"}}, "datePosted": "2020-10-27T16:06:54+0000", "description": "&lt;p&gt;&lt;strong&gt;About The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: Equivalent to AfC Band 7&lt;/p&gt;\n&lt;p&gt;Job type: Fixed Term 12m contract&lt;/p&gt;\n&lt;p&gt;Working Pattern: 09:00 to 13:00 and 14:00 to 17:30&lt;/p&gt;\n&lt;p&gt;Days/Times: Monday to Friday&lt;/p&gt;\n&lt;p&gt;The successful candidate will benefit from this unique opportunity to develop effective communication and strong working relationships across our organisation and will be actively involved in how their role evolves over time.&lt;/p&gt;\n&lt;p&gt;The main responsibilities are:&lt;/p&gt;\n&lt;p&gt;To support the effective delivery of patient care in GP practices within a defined Primary Care Network (PCN) by utilising pharmaceutical skills to embed the principles of medicines optimisation within the wider practice teams, ensure safe patient care through regular review and monitoring of patients based on clinical need and support demand management through consultation with patients as appropriate.&lt;/p&gt;\n&lt;p&gt;Clinical Care includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Run clinics where medicines are the main interventions e.g. anticoagulant monitoring clinics.&lt;/li&gt;\n&lt;li&gt;Conduct spirometry, child immunisation, travel vaccination, diabetic foot checks and NHS Health Checks as well as other roles as required on completion of appropriate training.&lt;/li&gt;\n&lt;li&gt;Conduct care planning including mental health, admission avoidance schemes and End of Life patients.&lt;/li&gt;\n&lt;li&gt;Monitoring patients with complex long term conditions such as hypertension, diabetes and COPD, ensuring that medication is optimised, titrated, monitored and complied with.&lt;/li&gt;\n&lt;li&gt;Providing clinical advice and expertise on medication.&lt;/li&gt;\n&lt;li&gt;Deliver on and/or oversee relevant aspects of the PCN Directed Enhanced Service (DES).&lt;/li&gt;\n&lt;li&gt;Take a central role in the clinical aspects of shared care protocols, clinical research with medicines, liaison with specialist pharmacists&lt;/li&gt;\n&lt;li&gt;Manage the repeat prescribing reauthorisation process by reviewing requests for repeat prescriptions and medicines reaching review dates.&lt;/li&gt;\n&lt;li&gt;To contribute to the reduction of medicine wastage within practices across the PCN.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you would like to find out more information and discuss further, please contact practicemanager.ramseyhc@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have the right to close the vacancy earlier than the closing date, if we reach the maximum number of applications.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This role is also being advertised the Essex Primary Care Careers website please complete only one application, duplications will not be considered.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;NO AGENCIES PLEASE&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be a qualified Pharmacist with strong experience within Primary Care and have the following skills / qualifications:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Degree Pharmacy, and registration with the General Pharmaceutical Council&lt;/li&gt;\n&lt;li&gt;Ideally you will hold or be working towards a postgraduate pharmacy qualification&lt;/li&gt;\n&lt;li&gt;Post qualification experience in pharmacy (hospital, primary care or community).&lt;/li&gt;\n&lt;li&gt;Working towards/being an independent prescriber&lt;/li&gt;\n&lt;li&gt;Member of the Royal Pharmaceutical Society (RPS)&lt;/li&gt;\n&lt;li&gt;You will have awareness of the breadth of common acute and long term conditions that are likely to be seen in a general medical practice&lt;/li&gt;\n&lt;li&gt;Be able to demonstrate general pharmaceutical skills and knowledge in core areas&lt;/li&gt;\n&lt;li&gt;You will be able to plan, manage, monitor, advise and review general care plans for patients with long term conditions&lt;/li&gt;\n&lt;li&gt;Be able to demonstrateaccountability for delivering professional expertise and direct service provision as an individuals&lt;/li&gt;\n&lt;li&gt;Be able to recognise priorities when problem-solving and identifies deviations from the normal pattern and is able to refer to seniors or GPs with confidence when appropriate&lt;/li&gt;\n&lt;li&gt;Beable to follow legal, ethical, professional and organisational policies/procedures and codes of conduct&lt;/li&gt;\n&lt;li&gt;Assistpatients in decisions about prescribed medicines and supporting adherence as per NICE guidance&lt;/li&gt;\n&lt;li&gt;Mature and non-judgemental attitude and be flexible and adaptable&lt;/li&gt;\n&lt;li&gt;Self motivated with excellentcommunication skills&lt;/li&gt;\n&lt;li&gt;Understand the need for patient confidentiality&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About Us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full time post working 37.5 hours per week covering the Fenland PCN which is made up of the following practices:&lt;/p&gt;\n&lt;p&gt;Ramsey Health Centre&lt;/p&gt;\n&lt;p&gt;Cornerstone Practice&lt;/p&gt;\n&lt;p&gt;Mercheford House Surgery&lt;/p&gt;\n&lt;p&gt;The Riverside Practice&lt;/p&gt;\n&lt;p&gt;All flexible offers and working arrangements will be considered.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135914.JPG", "name": "Essex Primary Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridgeshire", "postalCode": "PE26 1BP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4485", "longitude": "-.108122"}}, "title": "PCN Clinical Pharmacist - Fixed Term", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245339", "validThrough": "2020-11-10T23:59:59+0000"}