{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28526", "minValue": "28526", "unitText": "YEAR", "value": "£16.97"}}, "datePosted": "2020-10-30T17:54:00+0000", "description": "&lt;p&gt;Job Title: Medical Device Training Coordinator&lt;/p&gt;\n&lt;p&gt;Location/Trust: Trafford General Hospital&lt;/p&gt;\n&lt;p&gt;Department: Medical Engineering&lt;/p&gt;\n&lt;p&gt;Band/Pay rate: £16.97phr&lt;/p&gt;\n&lt;p&gt;Hours: 30 Hours per week 8:00am 4:00pm or 9:00am 5:00pm Monday-Thursday Must be flexible as days could change (No weekends)&lt;/p&gt;\n&lt;p&gt;Placement Ref: 36032&lt;/p&gt;\n&lt;p&gt;The Role-&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Are you looking for a new challangfe? Have you clinincal and administration experience?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Can you bring your excellent Clinical skills and knowledge to our Medical Engineering department?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that works well together, always there to help each other? Would you like to work in a Trust that recently had good in their CQC report? This location is easily accessible by public transport and has onsite parking.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you answered yes, Manchester University NHS Foundation Trust would love to hear from you.&lt;/p&gt;\n&lt;p&gt;We have a temporary placement opportunity available for a Medical Device Training Coordinator at Trafford Hospital. (Please read full job description attached)&lt;/p&gt;\n&lt;p&gt;Provide support for the medical device management and training team that includes&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the Medical Device Management &amp; Training Coordinator with standardisation of medical device projects across all sites&lt;/li&gt;\n&lt;li&gt;Booking meetings, facilitating training and diary organisation.&lt;/li&gt;\n&lt;li&gt;To maintain an effective and appropriate filing, archiving, and training recording on to the training systems.&lt;/li&gt;\n&lt;li&gt;Support the creation of compliance reports for senior managers.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;You will help manage the monthly medical device training study days through scheduling, organising rooms, booking staff on, and booking manufacturers to provide the clinical training.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To manage enquiries from Trust staff, outside organisations and key stakeholders. To respond and act as appropriate, filtering, and escalating information where necessary.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Reporting on trust wide compliance of medical device training and contributing to audit.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The skills required are&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have access to own Transport as you may be required to visit other sites within the Trust.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Professional/intermediate use of Microsoft office products including Word, Excel, and Outlook&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Healthcare professional or equivalent experience in a clinical environment e.g. RN, ODP or AHP. NHS experience is preferable.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of working in a training support environment. Teaching qualification desirable e.g. ENB 998, mentorship or PTLLS.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To be able to work well in a team, communicate, prioritise, meet deadlines while maintaining a professional outlook and appearance and have a positive attitude.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Be able to demonstrate accurate and precise processing of information.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To be able to work flexibly and adapt to the needs of the service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trafford Hospital located in Davyhulme Greater Manchester and was the first hospital to offer free healthcare in the world back in 1948. It is easily accessible via both car and public transport. There is onsite parking (fees will apply). There is a range of cafés on site providing a selection of hot and cold food, drinks and refreshments. Everyone is welcome to use these facilities.&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trafford General Hospital", "postalCode": "M41 5SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4541", "longitude": "-2.37068"}}, "title": "Medical Device Training Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251084", "validThrough": "2020-11-13T23:59:59+0000"}