{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-11-02T03:46:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Be part of the movement to improve and provide mental health services for young people aged 0 to 25 years old in the city of Birmingham.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Forward Thinking Birmingham has been in existence since 2016 and continues to develop specialist services for young people with a range of mental health needs.&lt;/p&gt;\n&lt;p&gt;Be under no illusion we have work to do but rest assured FTB is a unique and truly individual service, which is continuously learning and evolving, whose primary aim is to meet the mental health needs of a multi-cultural city.&lt;/p&gt;\n&lt;p&gt;The role of the Senior Clinical Nurse Manager is vital in providing strong, inspirational professional and empowering leadership within Mental Health Services.&lt;/p&gt;\n&lt;p&gt;We need you to provide direct operational and clinical management of community nurse managers and their associated nursing teams.&lt;/p&gt;\n&lt;p&gt;Ultimately you will be responsible for team managers and their practitioners who hold complex case loads within a community setting and work safely and sensitively with our patients.&lt;/p&gt;\n&lt;p&gt;You will be an inspirational, innovative, high performing individual who is able to lead a team to make safe and confident decisions around patient care, working in close partnership with patients and their parents, families, carers and friends and a range of other stakeholders.&lt;/p&gt;\n&lt;p&gt;You will need to hit the ground running, therefore, you will have extensive post registration experience in mental health setting. We expect our staff to lead from their heart – have a passion for wanting to make a difference to people’s lives, acting as a vigorous advocate for the young people of Birmingham.&lt;/p&gt;\n&lt;p&gt;In return you will receive support and guidance and opportunities for learning and development.&lt;/p&gt;\n&lt;p&gt;You will have access to a range of specialists and professionals – ours is a truly multi-disciplinary approach to health care and if you have the stamina, courage and commitment, then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;Benefits of working with FTB (employed by BWC)&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;27 days holiday, plus bank holidays increasing to 33 days holiday with continuous service&lt;/li&gt;\n&lt;li&gt;Competitive pension scheme&lt;/li&gt;\n&lt;li&gt;Childcare Vouchers&lt;/li&gt;\n&lt;li&gt;NHS Discounts&lt;/li&gt;\n&lt;li&gt;Excellent opportunities for career development as we continue to develop new transformational services.&lt;/li&gt;\n&lt;li&gt;Expert clinical supervision&lt;/li&gt;\n&lt;li&gt;We are developing a new training strategy which will include psychological and health skills, recovery and leadership training.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Birmingham is a fantastic place to live and work and has been transformed over the last few years with developments such as Grand Central, the Bull Ring and Millennium Point. There are a range of lifestyle options from city apartments to suburbs with excellent housing and schools. With more projects on the horizon such as HS2, further City regeneration and hosting the Common Wealth games in 2022, Birmingham is becoming one of the most vibrant cities in the World. The Trust may pay relocation expenses to the successful applicant, if eligible.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B4 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4852", "longitude": "-1.89446"}}, "title": "Senior Clinical Nurse Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251243", "validThrough": "2020-11-18T23:59:59+0000"}