{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum plus Fringe HCAS"}}, "datePosted": "2020-11-03T13:02:06+0000", "description": "&lt;p&gt;Surrey Heartlands CCG are looking for a Urgent and Integrated Manager to support the commissioning, redesign, programme management and development of a portfolio of priorities across Urgent and Emergency care services within the East Surrey ICP and the CrESH system footprint.&lt;/p&gt;\n&lt;p&gt;We have an ambitious vision for transformation and continuous improvement of health and care across our footprint. We are in the unique position of having secured a devolution deal, which for the first time really brings together health and social care by allowing us to commission from a single budget. We are also developing four dynamic and sustainable Integrated Care Partnerships (across East Surrey, Guildford and Waverley, North West Surrey and Surrey Downs localities) based on co-operation with our component partners, and focusing on local population needs, priorities and decision making.&lt;/p&gt;\n&lt;p&gt;In addition, we have delegated responsibility from NHS England, for managing Primary Care contracts across the Surrey Heartlands footprint.&lt;/p&gt;\n&lt;p&gt;It is an exciting time to work in the East Surrey Urgent Integrated care commissioning team with an ambitious programme of work to deliver systems efficiency over the next 3-5 years and wider UEC Integrated agenda as part of NHS Long Term Plan. The work is varied and interesting with the opportunity to be part of redesigning services for the local population served by the CrESH system.&lt;/p&gt;\n&lt;p&gt;This post attracts a High Cost Area Supplement of 5% of the basic salary subject to a minimum and maximum payment per annum (pro rata where applicable) in line with Agenda for Change.&lt;/p&gt;\n&lt;p&gt;This is a full time post. However, flexible working arrangements would also be considered.&lt;/p&gt;\n&lt;p&gt;The ideal candidate for this opportunity will have a broad experience across the health and social care and have a demonstrable track record of successfully delivering change management programmes and urgent care improvements. They will have highly developed skills in stakeholder engagement and influencing skills and be able to work effectively under pressure and to tight deadlines.&lt;/p&gt;\n&lt;p&gt;We would warmly welcome any questions about this opportunity - please contact Aktar Deelawar –Head of Integrated Urgent Care and System Resilience on 07385 415335 or email on a.deelawar@nhs.net&lt;/p&gt;\n&lt;p&gt;Please note: due to the current COVID-19 situation the interviews will be undertaken virtually. Details of this will be shared with you should you be shortlisted for interview.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey Heartlands CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128537"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxted/Homebased", "postalCode": "KT22 9AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2931", "longitude": "-.335021"}}, "title": "Urgent and Integrated Care Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254080", "validThrough": "2020-11-17T23:59:59+0000"}