{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 £19,737 - £21,142  p.a. pro rata"}}, "datePosted": "2020-11-02T11:32:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 10000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Are you a reliable and hardworking person looking for a new and exciting challenge? We are currently looking to recruit a new Environmental Services Porter Team Leader. You will be responsible, following training, for the collections of all waste and laundry items from zoned areas of the hospital site and oversee a team actioning waste collection and equipment moves.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;You will be part of a small team to deliver this essential service to the Trust and have excellent customer service skills and lead by example in this operational role.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLeah-Anne WoodhouseJob titleSupport Services Administrator (Logistics)Telephone number01223 217808&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Environmental Services Porter Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251808", "validThrough": "2020-11-08T23:59:59+0000"}