{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26711", "minValue": "26711", "unitText": "YEAR", "value": "£15.89"}}, "datePosted": "2020-10-28T09:39:21+0000", "description": "&lt;span&gt;Are you a Registered Nurse looking for a new opportunity to work in an organisation that will help you to develop and achieve your goals to become the best you can be? &lt;/span&gt;\n&lt;span&gt;&lt;br /&gt;As a Nurse from the NHS or private care, you&#39;ll join the team as a Bank Staff Nurse where you&#39;ll receive your perfect work/life balance and will be able to book your shifts through the Temployer App.&lt;br /&gt; &lt;br /&gt;Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society. &lt;br /&gt; &lt;br /&gt;It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like.&lt;br /&gt;&lt;/span&gt;\n&lt;span&gt; &lt;/span&gt;\n&lt;span&gt;As a qualified RMN//RNLD/RGN nurse you will ensure young people with neurological conditions receive high-quality care, while also supporting your colleagues and promote good teamwork.&lt;/span&gt;\n&lt;span&gt; &lt;/span&gt;\n&lt;span&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine.  &lt;/span&gt;\n&lt;span&gt;You will have access to the Elysium Wellbeing team, which is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/span&gt;\n&lt;span&gt;&lt;br /&gt;There are also career development opportunities, with a huge range of courses that will help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/span&gt;\n&lt;span&gt;&lt;br /&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Things that you will have&lt;/span&gt;&lt;/strong&gt;:&lt;/span&gt;\n&lt;span&gt;&lt;br /&gt;•A relevant nursing qualification and registration&lt;br /&gt;•Strong team-working skills&lt;br /&gt;•A high level of self-motivation and a flexible approach&lt;br /&gt;•A positive attitude and be naturally caring and compassionate&lt;br /&gt;•A commitment to high-quality care and to values and evidence-based practice&lt;/span&gt;\n&lt;span&gt;&lt;br /&gt;We can offer you flexible working - you will work 12.5 hour days, on a 0 hour contract.&lt;/span&gt;\n&lt;span&gt; &lt;/span&gt;\n\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Where You Will be Working&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Cotswold Spa Hospital &lt;/span&gt;&lt;span&gt;Station Rd, Broadway WR12 7DE &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Cotswold Spa is a specialist eating disorder service located in Broadway, Worcestershire for young people aged between 13 and 25 years which offers both inpatient and day patient treatment programmes.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The hospital is situated in the picturesque village of Broadway, Worcestershire, close to the Cotswold Way, The area boasts natural beauty with Cheltenham to the South and Warwick to the North.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service is for young people of all genders with an eating disorder, predominantly:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Bulimia Nervosa&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Anorexia Nervosa&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Avoidant Restrictive Food Intake Disorder&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The hospital has been specifically designed with the adolescent and young adult in mind. The interior design of the hospital is both contemporary and comfortable incorporating young people’s art.&lt;/span&gt;&lt;/p&gt;\n&lt;span&gt; &lt;/span&gt;\n&lt;span&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What you will get&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;\n&lt;span&gt;&lt;br /&gt;•Hourly rate of £15.89 &lt;br /&gt;•Free meals and parking&lt;br /&gt;•Mandatory training&lt;br /&gt;•Wellbeing support and Activities&lt;br /&gt;•Flexible working&lt;br /&gt;•Paid induction&lt;br /&gt;•Transfer to perm in the future (optional)&lt;/span&gt;\n&lt;span&gt;&lt;br /&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About your next employer&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;\n \n\n&lt;span&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.  &lt;br /&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/span&gt;\n&lt;span&gt;&lt;br /&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/span&gt;\n&lt;span&gt;&lt;br /&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;br /&gt;&lt;/span&gt;\n \n&lt;span&gt;&lt;br /&gt;&lt;/span&gt;\n&lt;span&gt; &lt;/span&gt;\n\n&lt;span&gt; &lt;/span&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broadway", "postalCode": "WR12 7DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0402", "longitude": "-1.86961"}}, "title": "Bank Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245845", "validThrough": "2021-01-31T23:59:59+0000"}