{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "apprenticeship rate dependant on age"}}, "datePosted": "2020-10-28T16:30:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Level 3 Therapies Receptionist / Administration Apprentice&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UHNM apprentice pay rate (dependant on age)&lt;/p&gt;\n&lt;p&gt;Hours of work: 35 hours per week&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an enthusiastic Receptionist/Administrator to undertake a Level 3 Apprenticeship to work in our busy Reception area in Therapies, where you will be the first point of contact to all our patients and visitors.&lt;/p&gt;\n&lt;p&gt;The role will involve reception duties and administration support for the efficient and highly motivated administration team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work within an extremely busy and challenging environment therefore you must be confident, a good team player and have the ability to work well under pressure. Excellent communication and organisational skills are essential as is the ability to prioritise effectively whilst using initiative. This is role will involve multi-tasking with constantly changing priorities,.&lt;/p&gt;\n&lt;p&gt;Other qualities include the need to be punctual, reliable, of smart appearance and hard working with a professional can do approach. The ideal candidate will be confident, a team player and have excellent communication skills, both face to face, e-mail and telephone. The successful candidates will display a willingness to learn with the desire and commitment to undertake this apprenticeship.&lt;/p&gt;\n&lt;p&gt;This is a 18 month post working 35 hours with core working hours of 8.30am to 4.30pm, Monday to Friday.&lt;/p&gt;\n&lt;p&gt;Customer service skills are essential along with the ability to input data accurately whilst prioritising your workload to meet deadlines. IT skills are desirable, however full induction and training of our hospital systems will be given by our supportive team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Noeleen Hellis, Divisional Therapy Manager for Specialised Services&lt;/p&gt;\n&lt;p&gt;Email: noeleen.hellis@uhnm.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01782 675340&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Stoke Hospital, Stoke-on-Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Apprentice Level 3 Therapies Receptionist/Administration Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247388", "validThrough": "2020-11-11T23:59:59+0000"}