{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "32,478- 51,069"}}, "datePosted": "2020-11-02T16:31:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Simulation Fellow in Multi-Professional Simulation &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;Epsom and St Helier University Hospitals NHS Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;Post Graduate Medical Centre&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Epsom Hospital (will be expected to work cross site)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;40 hours per week, Mon - Fri, no on-call duties&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;MN37/39 £30,605- £48,123 plus LW (£2,162).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Epsom &amp; St Helier University Hospitals NHS Trust &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SENIOR SIMULATION FELLOW IN MULTIPROFESSIONAL SIMULATION &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;February 2021 – August 2021 (potential to extend to Feb/Aug 2022)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date 18th November &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Epsom and St Helier University Hospitals NHS Trust is looking to recruit a talented and enthusiastic doctor (from any specialty) with an interest in developing and delivering high quality Multi-Professional Simulation Training within the organisation. The Fellow will be supported by the Simulation Lead for the Trust, the Deputy Simulation Lead, Director of Medical Education and the Postgraduate Department.&lt;/p&gt;\n&lt;p&gt;This is an exciting time for Simulation Training in the Trust as we are committed to rolling out deteriorating patient simulation across the Trust and are involved in actively developing and delivering many new and innovative educational courses. The Fellow’s work on this project will be complimented by further opportunities to develop their organisational and leadership skills. The Fellow will be mentored by senior people within the organisation, including the Director of Medical Education.&lt;/p&gt;\n&lt;p&gt;The Fellow will also have (at the discretion of the simulation lead) up to &lt;strong&gt;2 Clinical sessions &lt;/strong&gt;dedicated to developing their clinical skills in their specialty of choice. The fellow may be supported if able to stay in post until 2022 (funding and study leave negotiated on successful appointment) to study for a post graduate certificate in clinical education, PGcert at Kings College London.&lt;/p&gt;\n&lt;p&gt;We welcome applications from doctors in medical training who have a proven interest in Clinical Education and have the motivation to develop and deliver an innovative Simulation Training Programme. Candidates with an interest in and experience with Simulation are particularly encouraged to apply although this is not essential. Candidates should be prepared to work closely with multi-disciplinary teams and engage with senior colleagues from a variety of disciplines to achieve the desired aims.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJessica WadsworthJob titleDeputy Lead for Simulation and Human FactorsEmail addressjessica.wadsworth@nhs.netTelephone number01372 735 440&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom Hospital, Epsom", "postalCode": "KT18 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.325", "longitude": "-.273383"}}, "title": "Senior Simulation Fellow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252877", "validThrough": "2020-11-11T23:59:59+0000"}