{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-23T11:44:58+0100", "description": "&lt;h2&gt;&lt;strong&gt;Awarded for this vacancy - £1,000 ‘Golden Hello’ Payment&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Apply now and if you are successfully recruited you will receive up to £1,000&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Terms &amp; Conditions Apply&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;NAViGO Health and Social Care CIC provide health and social care services to a population of 158,000. We are a progressive and ambitious organisation that aims to support those living with a mental health illness, their carers and families in the simplest and most effective ways. We are different because we know working with the same methods doesn’t work forever; and we will continue to challenge the way we do things to create the best services that are centred on the people who use them.&lt;/p&gt;\n&lt;p&gt;Working together across Humber, Coast and Vale&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Why should you work for us?&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;CQC overall rating GOOD 2018 – with two services rated Outstanding&lt;/li&gt;\n&lt;li&gt;We are the 25th Best Not-for-Profit Organisation to Work For in The Sunday Times Top 100 Best Not-for-profit UK Companies to work for 2019 - our fifth straight year in the top 100&lt;/li&gt;\n&lt;li&gt;Winners of The Sunday Times Wellbeing Award for commitment to employee health and welfare 2019&lt;/li&gt;\n&lt;li&gt;We are one of the top 75 best organisations to work for in Yorkshire and Humber region 2019&lt;/li&gt;\n&lt;li&gt;Outstanding national NHS Staff Survey 2018&lt;/li&gt;\n&lt;li&gt;Crisis Home Treatment service for older people accredited by the Royal College of Psychiatrists’ 2018&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Awarded for ‘Excellence in DBT’ from the Association for Psychological Therapies 2018&lt;/li&gt;\n&lt;li&gt;&#39;Highly Commended&#39; organisation in the James Legal Solicitors Inspiring Business 2019 Awards&lt;/li&gt;\n&lt;li&gt;NAViGO Simply You team crowned Heart Awards Business in Community winners 2018&lt;/li&gt;\n&lt;li&gt;Performance Team ‘highly commended’ in the best use of data category - Health Tech Awards 2018&lt;/li&gt;\n&lt;li&gt;Mental Health category winner - Medipex Awards 2018&lt;/li&gt;\n&lt;li&gt;Mental health services in North East Lincolnshire have been rated as amongst the best in the country by the people who use them&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;This is an exciting opportunity to join our IAPT team at Open Minds.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;37.5 hours/week Monday to Friday&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Open Minds is an Improving Access to Psychological Therapies (IAPT) service for people with common mental health problems registered to a GP within North East Lincolnshire. The service became operational in February 2008 and since 2009 Open minds has provided IAPT services. The service provides low and high intensity CBT interventions, as well as EMDR, couples counselling, counselling for depression and Interpersonal therapy. The clinical team consists of High Intensity therapists, Counsellors, Interpersonal Therapists, Psychological Wellbeing Practitioners and Senior Psychological Wellbeing Practitioners. In addition to the core team, we also have a long term conditions team and an employment advisors which launched on 1st March 2019.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, skilled and dedicated Psychological Wellbeing Practitioner. We have 2 x 37.5 hour posts available due to staff progression on to CBT training within Open Minds. The successful applicant will have the option of working in the core team, LTC team or between both. The role offers variety and comes with the opportunity to do further LTC top up training, and specialise in an area of interest e.g. autism, perinatal or older people.&lt;/p&gt;\n&lt;p&gt;You will need to have completed, or be near competition of a post-graduate certificate in low intensity interventions and provide proof of the qualification. You must have a post-graduate certificate in low intensity interventions to be shortlisted for interview.&lt;/p&gt;\n&lt;p&gt;In return, we offer you weekly case management and clinical supervision, monthly group supervision, yearly PDR reviews, as well as mentorship and training to develop your role. We host monthly team days, and yearly away days, as well as opportunities to be involved in NAViGO events. We are looking for candidates who will uphold the NAViGO philosophy of providing services we would be happy for our friends and family to use.&lt;/p&gt;\n&lt;p&gt;We support flexible working which includes condensed hours and some home working. During COVID we are offering remote working via zoom and telephone and some limited face to face appointments adhering to government guidelines. Here at Open Minds we are team that works together to meet the needs of the service users and to support each other in the challenges the roles can bring.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information, and an informal discussion please contact Katie Washington (Team Manager) on 01472 625100&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All positions are subject to the receipt of satisfactory references and medical clearance. Evidence of valid professional registration and appropriate DBS clearances will also be required where relevant. All posts will also be subject to successful completion of a 12 week probationary period.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that all new employees joining NAViGO will be able to contribute to the NHS pension.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is classed as exempted for the purposes of the Rehabilitation of Offenders Act 1974, even those convictions that are classed as spent must be declared on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;NAViGO CIC takes its responsibility for the Safeguarding of Children &amp; Adults at risk seriously. Every member of staff must comply with the NAViGO Safeguarding policies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We will ensure that all applicants are contacted within 2 weeks of the closing date.&lt;/p&gt;\n&lt;p&gt;Navigo will keep details of unsuccessful applicants on file for a period of 6 months. Where further positions arise which we believe may be suitable we may contact those applicants with information and to advise of the further vacancy, should they wish to apply. Application at this subsequent stage/position would be voluntary and via open competition. Applicants may opt out of this by informing the recruitment team via NHS Jobs if they do not wish for details to be retained for this purpose.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NAViGO CiC Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grimsby", "postalCode": "DN32 0QE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5631", "longitude": "-.088785"}}, "title": "Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240360", "validThrough": "2020-11-06T23:59:59+0000"}