{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum + 5% HCAS"}}, "datePosted": "2020-10-27T11:46:43+0000", "description": "&lt;p&gt;We are looking for nurses who want to join us on our Journey to Outstanding who are Respectful, Caring, Responsible and Committed!&lt;/p&gt;\n&lt;p&gt;If you are a Newly Qualified Nurse, Registered Nurse with experience or a Return to Practice Nurse we would welcome your application to work with us.&lt;/p&gt;\n&lt;p&gt;All of our newly recruited Nurses are offered a place on our well-established 12 month preceptorship programme. We also have a dedicated team for Practice Development to support and coordinate your educational needs. We are proud that most of our Student Nurses who had their placements with us choose to work with us once they qualify.&lt;/p&gt;\n&lt;p&gt;We are committed to developing all of our staff and offer an extensive range of leadership courses to support the development of our future leaders.&lt;/p&gt;\n&lt;p&gt;We have a team of registered Nurses and Midwives who have been trained to undertake the role of Professional Clinical Advocates. The role has been developed to support staff well-being and by using restorative clinical supervision, staff can build resilience and be signposted to additional support within the Trust&lt;/p&gt;\n&lt;p&gt;To ensure your application is directed to our correct nursing teams please state clearly the name of your preferred ward/working area at the beginning of your Supporting Statement in your application form.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121503.PNG", "name": "The Princess Alexandra Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121503"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PAH, Harlow", "postalCode": "CM20 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7713", "longitude": ".086331"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244309", "validThrough": "2020-11-10T23:59:59+0000"}