{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-10-30T12:16:29+0000", "description": "&lt;p&gt;The Pharmacy Department of East Lancashire Hospitals NHS Trust has dispensaries based at both Burnley General Hospital and the Royal Blackburn Hospital. The successful candidate will be expected to work at either site.&lt;/p&gt;\n&lt;p&gt;Pharmacy services at East Lancashire NHS Trust&lt;/p&gt;\n&lt;p&gt;We are looking for a Pharmacy Technician to join our friendly and innovative team. The department offers a wide variety of services, meaning you will have many opportunities to learn and develop. Our award winning services include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dedicated ward based clinical teams, working closely with a range of healthcare professionals to deliver medicines reconciliation and discharge at ward level for our patients&lt;/li&gt;\n&lt;li&gt;Referral of patients to community pharmacies for post-discharge medicines support&lt;/li&gt;\n&lt;li&gt;A wide range of dispensing for various specialities&lt;/li&gt;\n&lt;li&gt;A state of the art chemotherapy unit and aseptic unit, led by the technical team&lt;/li&gt;\n&lt;li&gt;Procurement and distribution services&lt;/li&gt;\n&lt;li&gt;Domiciliary medicines support service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role is rotational giving you the opportunity to gain skills in a wide range of areas of practice. A personal service, underpinned by strong governance is at the heart of what we do. We are constantly improving our service, and a culture of innovation is welcomed. Technology has meant we can develop our services further, and you will join a team that use personal hand held devices as part of your daily work.&lt;/p&gt;\n&lt;p&gt;The department is supportive and keen to develop people. For Pharmacy Technicians, this means we will support you through an accuracy checking qualification, train you in a range of clinical areas to complete ward based duties, help you dispense with and without a dispensing robot, and complete a training programme for aseptic and chemotherapy services. You will be supported by a skilled and supportive team of fellow Technicians, Pharmacists and support staff.&lt;/p&gt;\n&lt;p&gt;You must be enthusiastic, keen to learn and make a difference, be self-motivated, and be a team player. You must be registered with the GPhC or be approaching registration and able to fit the criteria of this post.&lt;/p&gt;\n&lt;p&gt;This is a full time post, working core hours Monday to Friday, with weekends and Bank Holidays worked on a rota basis. The post will predominantly be based at the Royal Blackburn site, with the need to be able to travel to work at our Burnley General site and community hospitals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoanne AllisonJob titleSenior Pharmacy TechnicianEmail addressjoanne.allison@elht.nhs.ukTelephone number01254 732256&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250118", "validThrough": "2020-11-06T23:59:59+0000"}