{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Per Annum (pro rata)"}}, "datePosted": "2020-10-30T11:46:27+0000", "description": "&lt;p&gt;Applied Psychologists are a respected and valued resource within the Nottinghamshire Adult Mental Health Community Services . We are delighted that we have received a significant investment in clinical psychology, and we are now therefore seeking to develop a more robust community service offer across all of our Local Mental Health Teams and are able to offer a range of full time and or part time opportunities at both Band 8a.&lt;/p&gt;\n&lt;p&gt;The Teams are based at community locations in Nottingham City (Stonebridge Centre, Marlow House, Highbury Hospital) ; County South (Gedling West Bridgford, Beeston) and also in mid- Nottinghamshire at both Mansfield and Newark .&lt;/p&gt;\n&lt;p&gt;You will have opportunities to work directly and indirectly with patients experiencing a range of mental health problems, including complex trauma, psychosis, depression, anxiety, dissociation, self-harm and life-threatening behaviour.&lt;/p&gt;\n&lt;p&gt;The Community services have good links to primary care, as well as our crisis teams and inpatient services. We have established psychosis, depression and personality disorder treatment pathways and we are keen to enhance and develop psychological interventions across all pathways to improve the therapeutic offer within the Community Services . These posts will offer opportunities to influence the development of such pathways for individual and group work. You will work directly with patients and indirectly to advise the multi-disciplinary team,&lt;/p&gt;\n&lt;p&gt;We are seeking candidates who can work in teams, and are adaptable and responsive to the needs of the service they are working in. There will be an emphasis on contributing to MDT formulation, risk assessment and care planning to address patient needs.&lt;/p&gt;\n&lt;p&gt;Our commitment to you is we will provide you with opportunities to develop professionally within committed and supportive adult mental health services and play an important role in supporting increasing access to psychological therapies within community settings. The posts are being supported by the professional lead for clinical psychology.&lt;/p&gt;\n&lt;p&gt;Nottinghamshire Healthcare NHS Foundation Trust has a strong commitment to staff well being and you will both benefit from this and have opportunities to contribute to this agenda within our community services.&lt;/p&gt;\n&lt;p&gt;We will be requesting references by email. Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Laura Humphrey, Team Manager Marlow House, LMHT North 0115 9555360&lt;/p&gt;\n&lt;p&gt;Roger Lloyd, Team Manager Stonebridge Centre, LMHT East 0115 876 0153&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLaura HumphreyJob titleTeam managerEmail addresslaura.humphrey@nottshc.nhs.ukTelephone number0115 9555360&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LMHT North Marlow House, Basford", "postalCode": "NG6 0DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9863", "longitude": "-1.17879"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250024", "validThrough": "2020-11-15T23:59:59+0000"}