{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-02T15:32:37+0000", "description": "&lt;p&gt;The HPFT CAMHS service has been at the forefront of national developments in CAMHS, including CAPA and CYP-IAPT, and Hertfordshire is both an i-Thrive accelerator and schools link pilot site. The HPFT CAMHS service includes four community based ‘tier 3’ teams, a crisis assessment/treatment team (C-CATT), an Eating Disorder Team, an inpatient unit (Forest House), and a Targeted Team for looked after or adopted children. We also have a Home Treatment Team and DBT service. We offer a range of psychological therapies across these teams. We have close links with other agencies including the local ‘tier 2’ CAMHS service, school link workers and children’s social services.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen in HPFT CAMHS North Tier 3 Team, based in Stevenage, for an enthusiastic part-time Band 7 Child and Adolescent Psychotherapist. The successful candidate will have a keen interest in working collaboratively with children and their families and with partner agencies to promote positive outcomes for children and families in Hertfordshire. The successful candidate will have a role in offering core interventions as well as specialist psychotherapy interventions to children and adolescents and their families, as well as consultation to the team and professional networks. They will working alongside more senior psychotherapists, both within the team and county wide, who are committed to supporting professional development and with a trainee Child and Adolescent Psychotherapist currently on placement in the team. They would attend regular county wide psychotherapy meetings.&lt;/p&gt;\n&lt;p&gt;The successful candidate must be eligible (or about to qualify in the next 2 to 3 months) for membership of the Association of Child Psychotherapist. We welcome applications from people who are due to qualify in September 2020.&lt;/p&gt;\n&lt;p&gt;Stevenage is a short train journey from London Kings Cross station and we are located in close proximity to the train station.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Daphne Storey (Child and Adolescent Psychotherapist) or Charlotte Train (CAMHS Manager) on 01438 792600&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Saffron Ground, Stevenage", "postalCode": "SG1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.906", "longitude": "-.206392"}}, "title": "Child and Adolescent Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252650", "validThrough": "2020-11-30T23:59:59+0000"}