{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 Per annum"}}, "datePosted": "2020-11-04T11:15:56+0000", "description": "&lt;p&gt;An exciting opportunity has arisen at Stockport NHS Foundation Trust within the Financial Accounting Team. We require a flexible, confident and motivated individual looking forward to a career in NHS finance.&lt;/p&gt;\n&lt;p&gt;The post holder will support the Chief Financial Accountant and Financial Services Manager in delivering all aspects of the Trust&#39;s Financial Accounting requirements including treasury management and balance sheet reconciliations and in the production of the Trust&#39;s statutory annual accounts and returns.&lt;/p&gt;\n&lt;p&gt;The post holder will support the Chief Financial Accountant and the rest of the Financial Accounting Team in the delivery of corporate tasks and objectives.&lt;/p&gt;\n&lt;p&gt;Applicants should be highly numerate with clear verbal and written communication skills and be capable of prioritising workload effectively. Candidates must possess excellent IT skills, and be willing to work individually and as part of a team. The successful applicant must be able to demonstrate a willingness to learn and develop personally and professionally.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sandra Platt - Financial Services Manager&lt;/p&gt;\n&lt;p&gt;Sandra.platt@stockport.nhs.uk&lt;/p&gt;\n&lt;p&gt;0161 419 5449&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Assistant Financial Accountant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255556", "validThrough": "2020-11-15T23:59:59+0000"}