{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 - £37,267"}}, "datePosted": "2020-10-30T14:16:30+0000", "description": "&lt;p&gt;Are you looking for a leadership role that will give you the opportunity to help develop a forward thinking nursing team who strive for excellence in everything we do?&lt;/p&gt;\n&lt;p&gt;AMU is looking to recruit Band 6 Junior Sister or Charge Nurse to help lead an enthusiastic team committed to delivering the highest standard of care to our patients. AMU is a busy acute medical unit based at Fairfield General Hospital site in Bury expanding from 40 to 60 beds.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can you expect from us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Becoming a part of this team will allow you to develop your existing leadership and management skills and you will be fully supported by the senior nursing team with all aspects of your professional development.&lt;/p&gt;\n&lt;p&gt;The unit is managed to support you to deliver a high standard of patient care but also gives you the chance to work towards developing your own skills in the best way for you. Having a new senior management team has meant there has been renewed focus on all aspects of running a safe ward and has made for an organised ward environment that allows all the staff to work well as a team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we expect from you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for a dedicated, committed and reliable individual who is keen to learn, willing to work together as a team but are self-motivated and can work independently when needed. This is a forward thinking team so you will need to be someone who can embrace change and get stuck in when needed.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be a professional who truly understands the need for care, consideration and respect for our patients but can also apply these qualities to your team members. Our patients and their families require someone with compassion and the ability to empathise with difficult situations and be willing to go the extra mile to do what’s right by them.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be a proven nurse leader, able to demonstrate effective skills in all aspects of team working and leadership along with excellent communication and interpersonal skills.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for individuals who have a proactive approach with managing patient flow through the hospital journey. You will be enthusiastic and motivated and have the organisational values of Pennine at the fore front of all that is encompassed within your role, thus Quality Driven, Responsible &amp; Compassionate.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name vikki dean Job title ward manager&lt;/p&gt;\n&lt;p&gt;Email address vikki.dean@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0161 778 2591&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fairfield General Hospital, Bury &amp; Rochdale Care Organisation, Bury", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Junior Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250509", "validThrough": "2020-11-15T23:59:59+0000"}