{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Term Time ONLY"}}, "datePosted": "2020-11-05T14:46:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Special School Nurse for &lt;/strong&gt;Chiltern Wood School,&lt;/p&gt;\n&lt;p&gt;13.5 hours per week &lt;strong&gt;Term Time only.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a permanent contract available from November 2020.&lt;/p&gt;\n&lt;p&gt;Based at the Downley site, (formerly Maplewood School) Faulkner Way, Downley,&lt;/p&gt;\n&lt;p&gt;High Wycombe, Buckinghamshire, HP13 5HB.&lt;/p&gt;\n&lt;p&gt;This is a &lt;strong&gt;term time ONLY&lt;/strong&gt; contract.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post is part of a job share. You will be based at the main site in Downley but will be expected to work across to the other site on the Cressex road. You will be a member of a wider dedicated and enthusiastic team of special school nurses working across the county in Buckinghamshire. The Downley site is a day school for pupils with severe, complex and profound learning disabilities (SLD/PMLD), some of who may have associated physical, sensory, emotional and behavioural difficulties. The school is co-educational and caters for pupils between the ages of 2 and 19 years.&lt;/p&gt;\n&lt;p&gt;The Cressex site provides special education for pupils with Communication and Interaction difficulties at primary age (4-11 years). These difficulties include Moderate Learning Disabilities (MLD), Speech, Language and Communication Needs (SLCN), Autism Spectrum Condition (ASC) and some associated behaviour difficulties.&lt;/p&gt;\n&lt;p&gt;The nurse will be responsible for assessing, planning, implementing, and evaluating the health needs of the children. There is a strong multidisciplinary team at both sites and the nurse would be expected to play a strong role within this team. The role will involve teaching and supporting the school staff in meeting and maintaining the health needs of the children for example by providing school staff with high quality training in epilepsy management, management of medication, gastrostomy or naso-gastric feeding, suctioning etc.&lt;/p&gt;\n&lt;p&gt;You must be an experienced Children’s and or Learning Disability trained nurse with current NMC Registration. Applicants will be expected to demonstrate knowledge and understanding of the needs of &lt;strong&gt;children with learning disabilities&lt;/strong&gt; and their families. We would welcome a team player who enjoys a challenge and is well used to &lt;strong&gt;lone working&lt;/strong&gt;. Self development is encouraged and mentoring support and supervision are available. The post holder will need to be a &lt;strong&gt;car driver and be able to travel around the county&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ann Poll, Team Lead children with a learning disability&lt;/p&gt;\n&lt;p&gt;Email address : ann.poll@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number : 07827 982198&lt;/p&gt;\n&lt;p&gt;You must be an experienced registered nurse, well used to lone working and have a good knowledge of children who have a learning disability and complex health needs.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chiltern Wood School, High Wycombe", "postalCode": "HP12 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6184", "longitude": "-.773476"}}, "title": "Special School Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258187", "validThrough": "2020-11-18T23:59:59+0000"}