{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-27T11:46:22+0000", "description": "&lt;p&gt;The Acute Heart Failure Nursing service at University Hospitals Coventry and Warwickshire NHS Trust is a highly respected service, offering an outreach service with a high turn over of patients. We are currently offering a very exciting opportunity for a band 6 level experienced nurse to join our existing team. We are seeking a highly motivated, innovative nurse who is passionate in their delivery of high quality care aiming to improve the quality of life and longevity of patients with a confirmed diagnosis of Heart Failure.&lt;/p&gt;\n&lt;p&gt;This role requires the successful candidate, with specialist training and clinical supervision, to work towards an autonomous level within agreed clinical protocols/guidelines within the acute Heart Failure Nurse Outreach Service and outpatient setting. A background in Cardiology nursing is therefore a prerequisite for the acute Heart Failure Nurse role. In offering a collaborative approach, effective liaison with the wider multidisciplinary teams across all specialties within the trust and community services is imperative to this role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCath WatsonJob titleLead Acute Heart Failure Specialist NurseEmail addresscatherine.watson2@uhcw.nhs.ukTelephone number024 76965814&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UNIVERSITY HOSPITALS COVENTRY AND WARWICKSHIRE NHS TRUST, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Heart Failure Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244294", "validThrough": "2020-11-10T23:59:59+0000"}