{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615"}}, "datePosted": "2020-11-02T13:23:18+0000", "description": "&lt;p&gt;Are you looking for a musculoskeletal career in the South West?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you looking to work in a musculoskeletal team covering both community and primary care, with shared goals, driven by evidence based practice, and integrated with the wider musculoskeletal pathway?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Sirona care &amp; health are looking to recruit a dynamic and enthusiastic static Band 5 musculoskeletal physiotherapist who will deliver a high quality service and thrive on the opportunities this post offers. From April 2020 Sirona engaged in a new 10 year NHS adult community contract, including the community musculoskeletal services, for Bristol, North Somerset, and South Gloucestershire (BNSSG). This post will therefore benefit from being fully integrated within the wider MSK pathway which includes first contact practitioners, interface service and secondary care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;When you join our friendly team you will have your own clinical caseload, assessing and rehabilitating patients through both face to face and virtual (video and telephone) consultations, and in gym settings. The team has an excellent induction, supervision and training framework which you will be engaged in immediately. You will also have the opportunity to support students, and be involved as we continually develop our university links and our placement models to better support student placements. We believe that developing good clinicians within a dynamic and enjoyable team environment is the best way to deliver a high quality and efficient service. You will also be part of the wider governance groups across the team which look at ways to innovate and improve how Sirona deliver physiotherapy services across BNSSG.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are excited to offer an opportunity to join our Bristol Musculoskeletal Physiotherapy team. The team works from various bases in Bristol, with the main bases being Hampton House and Knowle West Health Park. The post holder may be required to work from any of these bases. Further details regarding your base will be provided at interview. This may change during the course of their employment to meet service need and to enhance their own development. There may also be a requirement to support the South Gloucestershire and North Somerset Musculoskeletal Physiotherapy teams.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; If you are excited by the prospect of joining our forward thinking team and being a key figure in the shaping of MSK services within Sirona please get in touch or follow the link to complete the application form.&lt;/p&gt;\n&lt;p&gt;The MSK physiotherapy clinics run core hours from Monday - Friday 8-8pm, excluding bank holidays. In the future there may be a requirement to extend core working hours of the service to up to 7-day working; however, a formal consultation process would be undertaken at such time this was being considered. At times of organisational escalation you would be expected to work anywhere across the organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work well as part of a team. The ability to relate well to people and to show genuine warmth, kindness and understanding towards individuals who need our care and support is essential.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide a high standard of evidence based Physiotherapy for patients. This will include demonstrating a comprehensive assessment, clinical reasoning skills and assessment techniques to analyse and provide an accurate diagnosis of their condition.&lt;/li&gt;\n&lt;li&gt;Formulate an accurate prognosis and recommend the best course of intervention&lt;/li&gt;\n&lt;li&gt;Implement effective goal-orientated treatment and rehabilitation programmes&lt;/li&gt;\n&lt;li&gt;Be professionally and legally accountable for all aspects of own work and adhere to National, Professional and Organisational standards and guidelines.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Qualifications and training (Essential) &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Must hold a Physiotherapy degree or qualification recognised as equivalent by professional body and with the appropriate registrations (HCPC, Member of Chartered Society of Physiotherapy). This should include appropriate, in date, UK working permits and visas.&lt;/li&gt;\n&lt;li&gt;Evidence of continuing professional development (CPD) maintained in portfolio&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;Desirable&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Evidence of post graduate Musculoskeletal study/courses.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Skills, experience and knowledge (Essential)&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will already have a breadth of post-qualification experience, in both acute and community settings within the NHS, and be able to demonstrate an interest in, and aptitude for, the outpatient environment, including relevant continuing professional development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like to speak to someone in more detail about the role please contact:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bethan O’Rourke 07523 083617 / Bethan.orourke@nhs.net&lt;/li&gt;\n&lt;li&gt;Jeanette Hall 07798 692161 / jeanette.hall2@nhs.net&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS6 6AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4621", "longitude": "-2.60378"}}, "title": "Static Musculoskeletal Physiotherapist - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252225", "validThrough": "2020-11-15T23:59:59+0000"}