{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-04T12:00:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Post:        &lt;/strong&gt;Specialist Paediatric Dietitians&lt;strong&gt;                        &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:     &lt;/strong&gt;37.5 hours&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: P&lt;/strong&gt;ermanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band:       &lt;/strong&gt;AFC 6   &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Liverpool, paediatrics – a winning combination – come and join us.&lt;/p&gt;\n&lt;p&gt;1 wte – band 6 diabetes&lt;/p&gt;\n&lt;p&gt;1 wte – band 6 rotational post&lt;/p&gt;\n&lt;p&gt;These posts are a fantastic opportunity for you to develop your paediatric dietetic career and for you to contribute to the provision of a quality paediatric dietetic service in this busy and highly rated children&#39;s hospital. These roles will provide the successful candidates with wide ranging caseloads enabling you to consolidate your existing knowledge and expand your skills across a range of paediatric sub-specialities. &lt;/p&gt;\n&lt;p&gt;One post will be based within our well established diabetes service. The diabetes team at Alder Hey is a highly regarded multidisciplinary team consisting of   four diabetic consultants, diabetes nurses and a psychologist. You will be working alongside an experienced band 7 Diabetes dietitian to provide evidence based advice for children and young people (0-19 years) with Diabetes, including carbohydrate counting education and insulin pump therapy.&lt;/p&gt;\n&lt;p&gt;The other Specialist Paediatric Dietetic post will be a rotational post, working across the whole range of paediatric sub specialties including oncology, gastroenterology, neurology, cardiology, renal disease, critical care, surgery, general paediatric to name just a few.  At appointment your initial allocation within the rotation will be based on assessment of your knowledge, experience and learning needs at interview and in discussion with you regarding your specific areas of interest in paediatrics.&lt;/p&gt;\n&lt;p&gt;In addition to managing your own case load you will have the support of advanced specialist dietitians to enable you to manage complex cases and acquire knowledge of more complex disease management through clinical supervision. These posts will provide you with a solid foundation to become a future leading paediatric dietitian.&lt;/p&gt;\n&lt;p&gt;The team of 20 dietitians and 3 assistants provide dietetic care across the majority of paediatric sub-specialities with comprehensive nutritional support programmes across many of the specialities and excellent multi- disciplinary team working. We are well respected across the Trust for our commitment to clinical dietetics and nutrition support.  In addition we are a very supportive team and take seriously the development of paediatric dietitians. In addition to learning through clinical caseload management and clinical supervision there are wide ranging learning opportunities across the Trust and participation in the Masters programme in paediatric dietetics will be actively encouraged. We also have A placement students and there will be opportunities to be involved in their supervision.&lt;/p&gt;\n&lt;p&gt;To apply for these posts you should have a minimum of 2 years post registration clinical dietetic experience .Practical paediatric dietetic experience is desirable but not essential. Theoretical knowledge of paediatric dietetics, underpinned with a genuine interest in children&#39;s health care is a key requirement for these posts. The ability to communicate with children, young people and families as well as professionals at all levels of health and children&#39;s social care are essential.&lt;/p&gt;\n&lt;p&gt;To discuss this opportunity further or arrange a visit please contact Alice Sutton, Head of Dietetics on 0151 252 5231 or email alice.sutton@alderhey.nhs.uk.&lt;/p&gt;\n&lt;p&gt;Alternatively some of our current team of specialist paediatric dietitians would be happy to talk to you about the opportunities that this excellent dietetic department can offer you so please call 0151 252 5231 and ask to speak to Chris or Blaithin.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120727.jpg", "name": "Alder Hey Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120727"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L12 2AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4213", "longitude": "-2.8978"}}, "title": "Specialist Paediatric Dietician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255707", "validThrough": "2020-11-18T23:59:59+0000"}