{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa pro rata"}}, "datePosted": "2020-10-28T09:53:17+0000", "description": "&lt;h2&gt;&lt;strong&gt;&lt;span&gt;Have you recently qualified or about to qualify as a Nursing Associate with a Foundation Degree and are looking for an opportunity to help establish and develop this role within an Acute Trust?&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;If so we are looking to recruit forward thinking Nursing Associates with excellent communication skills to join our nursing teams at Wye Valley NHS Trust. The successful candidate will provide patient centred, evidence based care; maintain high care delivery standards and efficient, safe management of patients within our inpatient medical wards.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The nursing associate will provide support to the registered nurse by caring for patients and enhance the quality of hands on care offered. Nursing associates will be accountable for their own practice. You should possess good interpersonal and time management skills, be a good communicator, organised and able to prioritise and work well as a member of a team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A brand new frailty building is opening in January 2021 comprising three frailty wards: a general frailty ward on the ground floor, a short stay frailty assessment unit on the first floor incorporating an assessment area to provide same day emergency care for frail patients, and a Frailty/ orthopaedic ward on the top floor. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are proud of our current and developing service which supports the way we care for our frail and elderly patients. This includes in addition to the 72 inpatient frailty beds a front door frailty team consisting of Advanced Care Frailty Practitioners, therapy, medical and nursing colleagues to rapidly assess and facilitate appropriate pathways of care to prevent/minimise the need for an acute inpatient admission. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are posts in each of our frailty wards:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Aconbury – general Frailty&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Garway – short stay Frailty assessment &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dinmore – Frailty with orthopaedics&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information prior to application please contact – Matron Felicity Archer (&lt;/span&gt;&lt;span&gt;felicity.archer@wvt.nhs.uk&lt;/span&gt;&lt;span&gt;) &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Nursing Associates - Frailty Wards", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245915", "validThrough": "2020-11-11T23:59:59+0000"}