{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35745", "minValue": "32234", "unitText": "YEAR", "value": "£32,234 - £35,745"}}, "datePosted": "2020-10-20T10:28:14+0100", "description": "\n&lt;p&gt;Lincolnshire County Council has an exciting opportunity for a Children&#39;s Continence Deputy Nurse to join our Children and Young People&#39;s Community Continence Service who will assess and treat or manage both bladder and bowel (continence) problems for children and young people in the community through a multidisciplinary nurse-led approach.&lt;/p&gt;\n\n&lt;p&gt;The Children and Young People&#39;s Community Continence Service (CYPCCS) treats children and young people from 0-19 years (up to 25 SEND) with the full spectrum of bladder and bowel problems, is run by a multi-disciplinary team and is led by the Children&#39;s Health Locality Manager and the Children&#39;s Continence Lead Nurse. The key aim of the Service is to reduce inappropriate/unnecessary referral to secondary care and ensure the care received is closer to home and seamless.&lt;/p&gt;\n&lt;p&gt;With an advanced level of knowledge of children&#39;s bladder and bowel conditions and supervising staff in the tier one Children&#39;s Health Service you&#39;ll:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide continence, interventions, toileting strategies, advice and/or treatment as relevant to the child&#39;s needs and capability, taking into consideration any specific physical, mental or social needs of the parent/carer to engage with the service as delegated.&lt;/li&gt;\n&lt;li&gt;Conduct comprehensive and advanced continence assessments and follow an agreed care pathway to ensure effective treatment outcomes.&lt;/li&gt;\n&lt;li&gt;Work in conjunction with other community staff to delivery individually structured management plans (self-management), and risk assessments.&lt;/li&gt;\n&lt;li&gt;Evidence outcomes and the impact on the child and young people across Lincolnshire.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are we looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a registered Paediatric/Children&#39;s Nurse (RSCN or RN Child) or have a Nurse qualification of a different field and be capable of delivering a wide range of educational material in a variety of ways to health, educational and wider staff groups.&lt;/p&gt;\n&lt;p&gt;You&#39;ll have experience of working with children in the acute and/or community setting with a demonstrable theoretical knowledge base of all health conditions that can affect children and young people, with specialist knowledge of bowel and bladder conditions.&lt;/p&gt;\n&lt;p&gt;As a Children&#39;s Continence Deputy Nurse you will be able to conduct advanced assessments and develop care plans to evidence the management and/or treatment of the child/young person&#39;s condition and symptoms whilst evidencing the individual&#39;s voice and have a broad understanding of how conditions can impact the child or young person and the implications for the family as a whole.&lt;/p&gt;\n&lt;p&gt;If this sounds like the next step in your career, then please read through the full Job Description, to ensure that you can meet the required criteria and to help you do the best application possible, before clicking apply.&lt;/p&gt;\n&lt;p&gt;For a confidential and informal discussion about the role, please contact Lynn Wilkinson, Children&#39;s Health Locality Manager on 07741605844.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lincolnshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129675"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln", "postalCode": "LN2 1DY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2294", "longitude": "-.539362"}}, "title": "Children&#39;s Continence Deputy Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233847", "validThrough": "2020-11-08T23:59:59+0000"}