{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-06T10:31:17+0000", "description": "&lt;p&gt;&lt;em&gt;*Applications are welcome from candidates who are working towards registration with the Health &amp; Care Professions Council as a Clinical Scientist, in which case appointment will initially be under Agenda for Change Annex 21 terms and conditions, until full state registration has been achieved&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Clinical Biochemistry and Immunology is part the Blood Sciences Department within the Central Clinical Services Division. Sections within the Department include Automation, Toxicology, Special Chemistry, Immunology and First Trimester Combined Screening.&lt;/p&gt;\n&lt;p&gt;The busy Automation Section has Roche Diagnostics COBAS 8000 platforms. The Specialist Area offers a wide range of tests and is well equipped with instrumentation including a Helena electrophoresis system (for protein electrophoresis analysis) a Sebia electrophoresis system (for oligoclonal bands analysis), two LC/MS/MS systems, a GC, an FTIR spectrophotometer, a specific protein analyser, ELISA workstations and a flame/graphite furnace atomic absorption spectrophotometer (to be replaced by a newly purchased ICP/MS).&lt;/p&gt;\n&lt;p&gt;Brighton and Sussex University Hospitals (BSUH) comprises the Royal Sussex County Hospital in Brighton and the Princess Royal Hospital in Haywards Heath. The Trust has Teaching Hospital status and the department is an approved training laboratory with peer review body accreditation.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic HCPC Registered Clinical Scientist to work as part of the small clinical scientist team. Candidates who have nearly completed their registration will also be considered and will be supported to complete their training.&lt;/p&gt;\n&lt;p&gt;This post is initially for a fixed term and will be primarily based in the Specialist Section at the Brighton site. The post may become substantive, pending departmental restructure.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Gary Weaving&lt;/p&gt;\n&lt;p&gt;Job title Lead Clinical Scientist&lt;/p&gt;\n&lt;p&gt;Email address gary.weaving@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01273 696955 Ext 4156&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Tamsyn Cromwell&lt;/p&gt;\n&lt;p&gt;Clinical Scientist&lt;/p&gt;\n&lt;p&gt;tamsyn.cromwell@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;01273 696955 ext 64416&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Registered Clinical Scientist (Biochemist)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259234", "validThrough": "2020-11-15T23:59:59+0000"}