{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-03T12:46:19+0000", "description": "&lt;p&gt;The Mother and Infant Mental Health Service (MIMHS) is a Specialist Perinatal Mental Health Community service that covers the whole of Kent and Medway. MIMHS specialises in the assessment, diagnosis and short-term treatment of women aged 18 and above who are affected by a moderate to severe mental health illness in the preconception, antenatal and postnatal period.&lt;/p&gt;\n&lt;p&gt;The NHS Long Term Plan builds on the commitments outlined in the Five Year Forward View for Mental Health to transform specialist PMH services across England. As part of the proposed £2.3bn investment in mental health identified in the Long Term Plan, additional investment will support further service developments for perinatal mental health. Set out in detail in the Mental Health Implementation Plan, the aim is to ensure that by 2023/24, in Specialist Community Perinatal Mental Health Services:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 66,000 women with moderate to severe perinatal mental health difficulties will have access to specialist community care from pre-conception to 24 months (extended from 12 months) after birth, with increased availability of evidence-based psychological therapies.&lt;/li&gt;\n&lt;li&gt;Partners of women accessing specialist community care will be able to access evidence-based assessments for their mental health and signposting to support as required.&lt;/li&gt;\n&lt;li&gt;Maternal Mental Health Services will be available across the country; combining maternity, reproductive health and psychological therapy for women experiencing mental health difficulties directly arising from, or related to, the maternity experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;MIMHS is therefore expanding its multi-disciplinary team to include a Perinatal Senior Clinical Psychologist. The successful candidate will provide specialist psychological interventions to mothers, infants and families during the perinatal period. Delivering specialist psychological assessment, therapy, advice, supervision and consultation as required as well as providing professional supervision and leadership to Band 7 Clinical Psychologists within the service&lt;/p&gt;\n&lt;p&gt;The role will include the active involvement in the multi-disciplinary development of the specialist Community perinatal mental health service. The post holder will work autonomously within professional guidelines and the overall framework of the services policies and procedures. The post-holder may work in various settings including primary/secondary care community venues such as GP practices, maternity units, Children’s Centres, client’s homes and inpatient settings.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a professional with a a good honours degree in Psychology and a Post-graduate doctorate in clinical psychology (or its equivalent) as accredited by the BPS/ HCPC &lt;/span&gt;&lt;span&gt;who is highly experienced at working with people with complex presentations. The role will require highly specialist psychological treatment skills (such as a specialist therapy with a good evidence base for complex trauma, and/or specialist interventions for groups) EMDR and Trauma informed CBT training and experience in its application is essential as well as the ability to work with the parent and the infant, demonstrating solid skills in infant development as well as adult mental health presentations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will also require leadership experience and possess excellent knowledge, skills, experience and expertise in the provision of acute or perinatal mental health care.&lt;/p&gt;\n&lt;p&gt;This is a full time role, working in East Kent, Monday - Friday, 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Angela Shorter, Perinatal Mental Health Manager 01322 622101&lt;/p&gt;\n&lt;p&gt;angelashorter@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAngela ShorterAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr. Vaughn R. McGill, Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Clinical Lead for Specialist Psychological Practice, Specialist Services&lt;/p&gt;\n&lt;p&gt;01622 723148 / Mobile: 07770975691&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Angela Shorter, Perinatal Mental Health Manager&lt;/p&gt;\n&lt;p&gt;01322 622101&lt;/p&gt;\n&lt;p&gt;angelashorter@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Martins Canterbury, Canterbury", "postalCode": "CT1 1TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2769", "longitude": "1.1062"}}, "title": "Perinatal Senior Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254024", "validThrough": "2020-11-17T23:59:59+0000"}