{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa plus HCAS"}}, "datePosted": "2020-11-04T11:46:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 – Team Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Primary Care Recovery Service - Merton Uplift&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a highly motivated and committed senior clinician to step into a recently established Band 7 post, working as the Team Manager in the Merton Uplift Primary Care Recovery Service (PCRS).&lt;/p&gt;\n&lt;p&gt;Merton Uplift was launched on 1st April 2019 and provides primary mental health provision across the borough of Merton, which incorporates a Wellbeing Service, the Merton IAPT service and a Primary Care Recovery Service.&lt;/p&gt;\n&lt;p&gt;The Primary Care Recovery Service (PCRS) is an integral part of Merton Uplift, supporting individuals with complex mental health issues. The service offers both psychological and psychiatric support, with a multi-disciplinary team of professionals including nurses, recovery workers, a consultant psychiatrist and Clinical Psychologists. Service users are able to directly access other elements of the service as required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will need to demonstrate excellent communication skills, working closely with a variety of stakeholders and other professionals, as well as co-ordinate mental health referrals and lead with day to day problem solving and navigation, both within the service and at the interface with other trust services and external organisations. .&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to demonstrate excellent interpersonal skills, an aptitude for managing multiple demands and effective time management techniques whilst remaining calm under pressure. A positive outlook and ability to motivate others is a must! You will be given autonomy to develop the role and service, whilst being supported by a senior management team.&lt;/p&gt;\n&lt;p&gt;This is an ideal role for an experienced band 6 clinician wanting to step up into management. A secondment opportunity would also be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Based at Wilson Hospital, Cranmer Road, Mitcham, Surrey CT4 4TP&lt;/p&gt;\n&lt;p&gt;The post holder may be required to work in locations within the area served by the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Debbie Davies&lt;/p&gt;\n&lt;p&gt;Team Manager&lt;/p&gt;\n&lt;p&gt;Telephone number 07890 609647&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wilson Hospital, Mitcham", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Team Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255667", "validThrough": "2020-11-11T23:59:59+0000"}