{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-04T15:16:22+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a twelve-month secondment into the role of Head of Nursing / Quality covering our Out of Hospital services. As a Trust, we are committed to delivering outstanding care to our patients and public. To achieve this, we need our leaders to inspire, to motivate and to work collaboratively with colleagues, partner organisations and our public to ensure we are trusted to deliver safe, effective, compassionate care at all times.&lt;/p&gt;\n&lt;p&gt;The post holder will form part of the senior leadership team supporting the Associate Director of Operations and Associate Medical Directors. They will be responsibility for monitoring and improving the quality of care, safe staffing and CQC compliance for both adult and children’s services across the out of hospital division. They will play a key role in ensuring that service transformation programs and redesign plans are developed with the patient at the centre of every decision.&lt;/p&gt;\n&lt;p&gt;Out of hospital has evolved and is aligning services to Warwickshire’s place plans. A key objective during the twelve-month secondment, would be to support the development of a future PLACE based clinical leadership structure for Nursing and AHPs.&lt;/p&gt;\n&lt;p&gt;The post holders must have high emotional intelligence, excellent clinical skills, interpersonal and communication skills and have experience of working at a high clinical standard. Along with the ability to motivate, influence and inspire the workforce and partners.&lt;/p&gt;\n&lt;p&gt;This role would suit an experienced registered nurse or AHP who has a significant amount of experience leading clinical staff to deliver and develop patient services with a focus on quality improvement. Clinical credibility and evidence of collaboration across partner organisations to improve services across systems would also be beneficial.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Interview date: Tuesday 15&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; December 2020. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTracey SheridanJob titleAssociate Director of OperationsEmail addressTracey.Sheridan@swft.nhs.ukTelephone number07920703596Additional contact information&lt;/p&gt;\n&lt;p&gt;Fiona Burton Director of Nursing ext 8037&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Corporate Nursing C26127, Rugby", "postalCode": "CV21 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3703", "longitude": "-1.25262"}}, "title": "Head of Community Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256387", "validThrough": "2020-11-18T23:59:59+0000"}