{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-30T11:31:28+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the Health, Safety and Security Team to work with and support the Team in providing professional, timely and comprehensive advice and guidance to ensure the health, safety and security of staff, service users, property, equipment and materials to enable the trust to provide the best possible duty of care to its service users and staff&lt;strong&gt;.&lt;/strong&gt; The post also includes an element of support for the Emergency Planning and Business Continuity Manager where an awareness and understanding of Trust policy and procedures in this area would be desirable.&lt;/p&gt;\n&lt;p&gt;The Health, Safety and Security Team work within the Estates and Facilities Management Directorate across the Trust.&lt;/p&gt;\n&lt;p&gt;The main duties and responsibilities will include assisting with and producing, reviewing and monitoring compliance with Trust policies relating to health and safety issues, investigate and produce reports on RIDDOR incidents and participate in serious untoward incidents where identified. Assist in developing the health and safety training presentations and deliver across the trust in line with mandatory training programme. Assist with further development of the Health, Safety and Security Management system, conduct audits and analysis of results. Conduct assessments when required for DSE, return to work, workplace, new and expectant mothers, lone working or where identified by a service that assistance with assessment is required.&lt;/p&gt;\n&lt;p&gt;It is expected that the post holder will have NEBOSH Health and Safety Certificate, a NEBOSH Diploma or Diploma in Health and Safety. Minimum requirement would be the Level 4 or Vocational Qualification for Occupational Health and Safety Practice with at least substantial experience of working in health and safety. Knowledge of NHS is desirable.&lt;/p&gt;\n&lt;p&gt;Although the main office base is at Durham it is an expectation that the post holder will travel across the trust geographical area.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Cunningham, Health &amp; Safety Manager&lt;/p&gt;\n&lt;p&gt;h.cunningham1@nhs.net&lt;/p&gt;\n&lt;p&gt;07985234047&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lanchester Road, Durham, Durham", "postalCode": "DH1 5RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8009", "longitude": "-1.61141"}}, "title": "Health and Safety Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249948", "validThrough": "2020-11-09T23:59:59+0000"}