{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 p.a. pro rata"}}, "datePosted": "2020-11-05T15:01:59+0000", "description": "&lt;p&gt;Our Trust&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff Bank Services successfully provides temporary staffing throughout Cambridge University Hospitals NHS Foundation Trust via a variety of different assignments. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The CUH Finance team have a great opportunity for you to register with Staff Bank Services to work in the senior finance team supporting one of our clinical divisions to allow for the current post holder to work on our major project development. You will be an experienced senior finance professional who will lead the Divisional finance team to undertake monthly reporting, forecasting and the annual budget setting process all whilst building excellent relationships with the Division’s operational and clinical teams.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This vacancy closes on:- 10 November 2020&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Benefits to you&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel. For further details of our fantastic benefits please refer to the attachment below - CUH Benefits. Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered. We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: &lt;strong&gt;Beth Potton 01223 348294&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBeth PottonJob titleInterim Deputy Director of FinanceEmail addressbethany.potton@addenbrookes.nhs.ukTelephone number01223 348294&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital - Staff Bank, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Bank Divisional Head Of Finance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258250", "validThrough": "2020-11-10T23:59:59+0000"}