{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-10-26T08:45:23+0000", "description": "&lt;p&gt;Do you like working in a team, are you organised, and do you enjoy fostering good relationships?&lt;/p&gt;\n&lt;p&gt;We are looking for a part time (30 hours per week) Patient Flow Co-ordinator, in the Peterborough Neighbourhood Team based at City Care Centre, Peterborough.&lt;/p&gt;\n&lt;p&gt;The Patient Flow Co-ordinator is a fundamental role within the Neighbourhood team. The post holder will be responsible for the co-ordination and tracking of complex patients on the Neighbourhood team caseloads across health and social care teams such as acute hospitals, GP surgeries, social services, voluntary organisations and other CPFT services.&lt;/p&gt;\n&lt;p&gt;The successful applicant will co-ordinate clinical meetings, and liaise with teams, services, wards and GP practices to facilitate the provision of safe, timely, joined up care and services delivered by Neighbourhood teams. The role is key in supporting Neighbourhood teams to prevent hospital admissions and ensure safe hospital discharges.&lt;/p&gt;\n&lt;p&gt;The role requires significant understanding of complex community patient pathways, as well as analytical and judgement skills regarding patients’ clinical information and their treatment plans to ensure that Neighbourhood team services are delivered in a timely and efficient manner.&lt;/p&gt;\n&lt;p&gt;Day to day operational management support will be provided by the Locality Business Support Co-ordinator, with the Area Nurse Manager providing leadership and support regarding daily, weekly and monthly tasks and priorities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Louise Walton&lt;/strong&gt;, Area Nursing Manager - 07598555091&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Care Centre, Peterborough", "postalCode": "PE36DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5744", "longitude": "-.258806"}}, "title": "Patient Flow Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241778", "validThrough": "2020-11-09T23:59:59+0000"}