{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-10-27T16:45:52+0000", "description": "&lt;p&gt;Do you have a passion for learning and development and enjoy working with a wide range of people in different professions and organisations? If so, then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to support the Vocational Learning and Development Team to co-ordinate a range of learning experiences and workforce development programmes. This role includes administrative duties and assisting with clinical placement activity to ensure the provision of high quality multi-professional learning environments within East Cheshire NHS Trust. The post holder will be required to work locally within services and to work with stakeholders to support the breadth of student/learner experience, which may require cross boundary working.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work autonomously to provide support to the Vocational Learning and Development Team to deliver training, offer support for educators and learners in practice and also assist with the implementation of alternative models of learning in practice.&lt;/p&gt;\n&lt;p&gt;Additional tasks will include assisting in the coordination and facilitation of events, dealing with enquiries relating to programmes of work and developing and maintaining information gathering systems.&lt;/p&gt;\n&lt;p&gt;We are looking for a team player, who has a flexible approach to work and the drive to make a difference, in addition to improving their own skills and knowledge.&lt;/p&gt;\n&lt;p&gt;This post is Permanent&lt;/p&gt;\n&lt;p&gt;Hours per week: 22.5&lt;/p&gt;\n&lt;p&gt;Closing date: 10th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Morag Booth Job title Practice Education Facilitator Email address morag.booth@nhs.net Telephone number 01625 663028&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Vocational Learning and Development Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245468", "validThrough": "2020-11-10T23:59:59+0000"}