{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45753 - £51668"}}, "datePosted": "2020-11-05T10:31:59+0000", "description": "&lt;p&gt;Maternity High Dependency, Theatres &amp; Recovery Matron &lt;br /&gt; &lt;br /&gt; We are looking for an inspirational, dynamic and experienced leader who can bring enthusiasm and energy to this new Matron role within our busy maternity high dependency, recovery and theatre units to drive the development of these services with a focus on quality, efficiency and productivity while delivering on the better births agenda.&lt;br /&gt; &lt;br /&gt; This post requires substantial post registration experience of working in these settings, previous experience of leading teams and change management in order to be successful. Does this sound like you? Are you passionate, driven and innovative? Are you ready to take the next step in your career? Are you up for a challenge?&lt;br /&gt; &lt;br /&gt; If so, you may be ready to work in our large forward thinking Maternity Service at Imperial College Healthcare NHS Trust who are the first maternity service in London to be rated “outstanding” by the Care Quality Commission. We are a tertiary level referral centre for Obstetric and Fetal Medicine and as such provide you with unique opportunities and experiences within our high risk pathways that are not readily available in other trusts.&lt;br /&gt; &lt;br /&gt; As matron your responsibilities will encompass human resources management, cost improvement, service development, training and education and delivery of key performance indicators relating to the quality and safety standards for the areas within your remit including operational oversight of the Obstetric Medicine Clinics at QCCH. &lt;br /&gt; &lt;br /&gt; The post holder will be expected to be a credible midwifery clinician, authentic leader and team player committed to deliver outstanding maternity services.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Charlotte&#39;s and Chelsea Hospital", "postalCode": "W12 0HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5165", "longitude": "-.236635"}}, "title": "Band 8a Maternity High Dependency &amp; Theatres Matron - WCCS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257257", "validThrough": "2020-11-22T23:59:59+0000"}