{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19737", "minValue": "19737", "unitText": "YEAR", "value": "From £19,737 per annum"}}, "datePosted": "2020-11-05T15:01:39+0000", "description": "&lt;p&gt;Interested in supporting your local community? Come and join us at AWP Mental Health Trust and become an NHS hero. We are looking for new colleagues, with a passion for helping people, to join us as Healthcare Support Workers in our teams based in Weston Super Mare.&lt;/p&gt;\n&lt;p&gt;We are very proud of our amazing staff, who are continuing to work throughout the COVID19 pandemic, supporting people with mental health issues across the region.&lt;/p&gt;\n&lt;p&gt;Dune Ward, based at Weston General Hospital, which is part of Avon and Wiltshire Mental Health Partnership NHS Trust (AWP), is a 14 bed ward caring for those with a dementia illness for a short period of assessment and treatment whilst they are in hospital.&lt;/p&gt;\n&lt;p&gt;If you have a passion and experience with working with people with dementia, are committed to delivering a high standard of care and are committed to team working we would really like to meet you.&lt;/p&gt;\n&lt;p&gt;The role requires working a mixture of shifts and weekends (early shifts 07:00-15:00, late shifts 13:30-21:30 and night shifts 21:00-07:30).&lt;/p&gt;\n&lt;p&gt;Working closely with our multi disciplinary teams, supporting service users, you will receive a great induction, training to complete the NHS Care Certificate and a Level 3 Healthcare apprenticeship. If you have some experience of caring work already that would be great – but if not, we will support you to develop the skills and experience needed.&lt;/p&gt;\n&lt;p&gt;As an NHS employee you will have a wide range of benefits and discounts, the NHS pension scheme and a generous annual leave entitlement. Best of all you will have the reward of doing a job that really matters, with colleagues who care.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah PaveyJob Ward Manager&lt;/p&gt;\n&lt;p&gt;Telephone number 01934 836522 or 01934 836500&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Weston General Hospital, Weston Super Mare", "postalCode": "BS23 4TQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3223", "longitude": "-2.97141"}}, "title": "Band 3 Senior Healthcare Support Worker, Dune Ward, Weston Super Mare", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258236", "validThrough": "2020-11-15T23:59:59+0000"}