{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T18:30:21+0000", "description": "&lt;p&gt;A huge transformation programme in Essex is opening up a number of exciting opportunities for community mental health professionals who have an interest working as part of multi-disciplinary teams across acute, mental health and community services. The NHS Long Term Plan commits to grow investment in mental health services and these newly developed care pathways will support the aspirations identified in the Five Year Forward View and NHS Long Term Plan.&lt;/p&gt;\n&lt;p&gt;These opportunities will challenge traditional models of mental health provision to prevent escalation of mental health crises and develop true community-based, integrated and systemic services.&lt;/p&gt;\n&lt;p&gt;“&lt;strong&gt;Are you looking for a new challenge in your nursing career? Come and join us.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; *We have 4 positions available *&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an enthusiastic and proactive mental health Liaison nurse who is eager to develop their skills within older adults and adult services. The successful candidate must be able to demonstrate good clinical management skills and be committed in providing person-centred care for our patients with the ability to work as part of a multidisciplinary team. The candidate&lt;/strong&gt; is required to undertake the duties of the post without direct supervision to support the service to meet recommended response times and evidence based pathways.&lt;/p&gt;\n&lt;p&gt;You will be required to work as a member of a multi-disciplinary team in close co-operation with hospital based and primary health care based professionals. They will be responsible for the maintenance of standards of care within the Team and actively participate in the training and education of staff from allied agencies.&lt;/p&gt;\n&lt;p&gt;You would be working under the West Essex Mental Health Liaison Service that provides support, advice and assessment for patients on general wards at Princess Alexandra Hospital. We also provide services for both the West Essex and Hertfordshire catchment area and to those who are out of area”.&lt;/p&gt;\n&lt;p&gt;You will be able to demonstrate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Registration RMN Part 3&lt;/li&gt;\n&lt;li&gt;Understanding of current NHS/Social Care policies/practices relating to Mental Health&lt;/li&gt;\n&lt;li&gt;Appropriate post registration experience at qualified practitioner level within Mental Health of at least 2 years&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;EPUT are looking for motivated staff who shares our Trust values of Open, Compassionate and Empowering. In return, EPUT can offer you a range of benefits and development including;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Season Ticket Loans&lt;/li&gt;\n&lt;li&gt;NHS discounts for staff&lt;/li&gt;\n&lt;li&gt;Excellent Training facilities and opportunities&lt;/li&gt;\n&lt;li&gt;The opportunity to work bank shifts and expand knowledge and experience in other areas&lt;/li&gt;\n&lt;li&gt;Salary Sacrifice schemes including lease cars and Cycle to Work&lt;/li&gt;\n&lt;li&gt;Buying and Selling annual leave scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information, please contact&lt;/p&gt;\n&lt;p&gt;Maria Estuya&lt;/p&gt;\n&lt;p&gt;mobile 07875102795&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Derwent Centre, Harlow, Harlow", "postalCode": "CM20 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7713", "longitude": ".086331"}}, "title": "Mental Health Liaison Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258775", "validThrough": "2020-11-26T23:59:59+0000"}