{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "From £31,365 per annum"}}, "datePosted": "2020-10-27T15:00:54+0000", "description": "&lt;p&gt;&lt;strong&gt;About Applewood &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applewood House is a 16 bedded Acute Psychiatric admission ward based in Swindon, which is part of Avon and Wiltshire Partnership trust. We are a mixed ward which covers ages from 18 years upwards for a wide range of mental health conditions. &lt;br /&gt;We are a team made up of different disciplines, including registered and unregistered staff, Occupational therapists, Psychologist, Consultant psychiatrist, Medics, Activity support workers and many more. We offer a range of treatments and therapeutic interventions to ensure that a care pathway is tailor made for the patient who are admitted to our ward. &lt;br /&gt;We are passionate about promoting good mental health and wellbeing. We strive to use the expertise and resources within our organisation and through our locality to deliver a high quality services that are patient focused, having strong links with the Intensive team, recovery, rehabilitation unit and later life services.&lt;/p&gt;\n&lt;p&gt;We are located in Swindon, which is central to Wiltshire, Salisbury, Bristol and London. The train station is located a short bus journey from the ward. We are based on a large site with free parking at the front of the ward. There are buses that run on average every 10 minutes to and from town centre.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Values &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Pride – Doing my best all of the time &lt;br /&gt;Respect – Listening, understanding &lt;br /&gt;integrity – Be open, honest, straight forward and reliable&lt;br /&gt;Diversity – Relating to everyone as an individual&lt;br /&gt;Excellence – Striving to provide the highest quality support. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Are you looking for a new challenge, providing dynamic, high-quality inpatients care?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Can you put people first and provide nursing care that is person-centered, safe and compassionate?&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for a motivated and passionate deputy ward manager to join our team. Although this role is challenging, you will be allocated a buddy and a supervisor who will offer you additional support network alongside the team. &lt;br /&gt;From day one you will provide a comprehensive package of care to inpatients on our mixed gender ward. You will become part of a multi-disciplinary team, using your skills and experience to help define and deliver a package of care that helps these people on the road to recovery. This role is on a ward that operates on a 24/7 shift basis&lt;/p&gt;\n&lt;p&gt;Staff will qualify for unsocial enhancements in addition to their basic pay&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;What matters to us is your passion, commitment and determination to succeed.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication skills, and be happy to participate in the internal 24 hours, 7 day a week rota to meet the needs of people who use our services.&lt;/p&gt;\n&lt;p&gt;You will be a registered mental health or Learning disability nurse.&lt;/p&gt;\n&lt;p&gt;We expect you to be able to demonstrate how you have worked effectively in a multi-disciplinary team setting. You will need to demonstrate your commitment to personal development.&lt;/p&gt;\n&lt;p&gt;At Applewood, we deliver person-centered care. We believe that with our help, people can improve their mental health, to recover independence and return to the community. We expect you to share our vision for mental health care.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:  Pam Rogers, Ward Manager on pamrogers1@nhs.net or 01793836841&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Applewood, Sandalwood Court, Swindon", "postalCode": "SN3 4WF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5881", "longitude": "-1.74775"}}, "title": "Band 6 Charge Nurse - Sandalwood Court, Swindon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245103", "validThrough": "2020-11-10T23:59:59+0000"}