{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-28T08:10:21+0000", "description": "&lt;h1&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Business Development and Innovation Manager&lt;/strong&gt;&lt;br /&gt; Band 7 &lt;/span&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;Leeds Teaching Hospitals NHS Trust (LTHT) is one of the leading NHS Trusts in the country for research performance, recruiting over 20,000 patients into studies in 2018/19 and hosting multiple NIHR-funded programmes. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust works with a wide-range of industrial and academic partners and is developing new systems and processes to enable Trust resources to be aligned with needs of key stakeholders in industry, academia and partner organisations in a more coordinated and commercially-focused way. These systems and processes will assist in driving new business opportunities for the Trust, form part of the Trust’s response to the UK Life Sciences Industry Strategy and support wider strategic innovation objectives associated with the development of 2 new hospitals on the Leeds General Infirmary site.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working as part of the Business Development and Innovation team, the post holder will provide proactive support to all research business development activities within the Trust, developing strong relationships with the life sciences industry. This role will include networking extensively across the UK, Yorkshire &amp; Humber and Leeds City Regions, as well as attending events and visiting businesses to raise awareness of expertise and capabilities within LTHT. This role will also work closely with colleagues from a variety of strategic programmes funded by NIHR and InnovateUK to support their business development needs and signpost opportunities for new business towards them as appropriate. The role will also support interactions with the Clinical Research Network industry team, helping to manage the pipeline of opportunities for industry-funded trials that come via the network’s channels and ensuring that these are dealt with quickly and efficiently.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant will have an understanding of the NHS research infrastructure and the NHS innovation agenda. They will be capable of working with clinical &amp; non-clinical staff at all levels and be able to develop effective working relationships with professional contacts across all disciplines. They should have strong written and verbal communication skills and be innovative and adaptable to changing priorities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is initially for a 2 year fixed term, but with an option to extend further based on successful performance.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more information, please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr. Christopher Herbert&lt;br /&gt; Director of Operations: Research and Innovation&lt;br /&gt; Leeds Teaching Hospitals NHS Trust&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122055.jpg", "name": "Medical Directorate", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122055"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Business Development and Innovation Manager (XN07)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245701", "validThrough": "2020-11-11T23:59:59+0000"}