{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-11-03T16:16:52+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced Occupational Therapist with an interest in Acute Adult Occupational Therapy to work at St Mary’s Hospital. The post holder will support the Medical Occupational Therapy team, enhancing their knowledge and skills in frailty, complex discharge planning and client centred practice.&lt;br /&gt;We are looking for a dynamic, forward thinking and self-motivated Occupational Therapist with excellent time management and advanced communication skills to join the team and deliver high quality, timely care. You will possess the ability to remain calm and professional under pressure, and be responsive to the fluctuating demands typical of this environment. It is important that the successful applicant is a team player with a positive outlook, enthusiasm and ability to learn and develop new skills.&lt;br /&gt;You must be able to demonstrate sound knowledge and experience in a relevant clinical setting, possessing highly specialist assessment, treatment and risk management skills. The ability to work autonomously, but also well within a multi-disciplinary team is essential, as is the ability to promote the role of Therapies and the implementation of evidence-based practice. In addition to the clinical caseload, the post holder will have the opportunity to play a key part in the development of the Therapy service and the team.&lt;br /&gt;You will be supported by an assigned Occupational Therapy clinical supervisor with your clinical and professional development. We actively support continuing personal and professional development through an established performance development review (PDR) system, in-service training and external courses.&lt;br /&gt;You will be expected to work across two sites (St Mary’s Hospital and Charing Cross Hospital) at the start but will be made static at St Mary’s from April 2021.&lt;br /&gt;If you think you are a suitable candidate with dedication, passion and the ability to take on this role, please apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rangaprakash Muthukumarasamy rangaprakash.muthukumarasamy@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 6 Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254766", "validThrough": "2020-11-15T23:59:59+0000"}