{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "61222", "minValue": "38259", "unitText": "YEAR", "value": "£22.76 to £36.42"}}, "datePosted": "2020-11-03T15:04:26+0000", "description": "&lt;p&gt;&lt;strong&gt;**PLEASE NOTE THIS IS TO APPLY TO JOIN NHS PROFESSIONALS’ ALLIED HEALTH PROFESSIONALS BANK**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Band 6 Occupational Therapist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Oxfordshire, Headington, OX3 9DU / Oxfordshire University NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt; Therapies&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Days: £22.76 Saturdays/Nights: £29.59 Sunday/Bank Hols: £36.42&lt;/p&gt;\n&lt;p&gt;operates seven days a week within the hours of 0800 to 2000. Successful applicants will work 4 days in 7. Two of these days will be 0800 to 2000 with the remaining two days being 0800 to 1630 and 1200 to 2000.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: j11-36646-OT&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The John Radcliffe Hospital Frailty Intervention Team is seeking an additional Occupational Therapists or Physiotherapist to work within the Emergency Department and Ambulatory Assessment unit. Successful applicants will work shifts over a seven day roster. We are looking for an immediate start with work available up until the 31st of March 2021. On the job training will be provided. However, experience in the following would be desirable: -Acute and general medicine experience-Frailty Experience-Previous work within an ED, EAU, short stay ward or ambulatory assessment unit-Discharge planning&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Would you like to work for a trust whose values are learning, respect, delivery, excellence, compassion, and improvement? Then read on!&lt;/p&gt;\n&lt;p&gt;The four hospital sites (John Radcliffe, Churchill, NOC and Horton) provide an exceptionally high standard of clinical care to our patients. As well as being a renowned Cancer centre, we are also famous for our expertise in areas such as transplant and neurosciences. Central to the Trust&#39;s vision are its staff. We aim to recruit, train and retain the best people to enact its values and achieve our vision.&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you! &lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for a band 6 occupational therapist available at Oxfordshire University NHS Foundation Trust, specifically providing the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Gathers, interprets, and evaluates highly complex information from a variety of sources and specialised procedures.&lt;/li&gt;\n&lt;li&gt;Develops own knowledge and practice in specialist area of work and contributes to the development of others, providing supportive leadership, regularly teaching core training to OT staff, and OT students.&lt;/li&gt;\n&lt;li&gt;o be able to formulate and implement treatment plans for patients who have complex and multi pathological conditions, including mental health, respiratory, traumatic injuries, neurological and gerontology-related medical complications.&lt;/li&gt;\n&lt;li&gt;To be able to identify a range of strategies to address the problem and make an informed choice of strategy based on a sound understanding of the patient’s needs and goals.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The therapies team has an enviable reputation, great supportive team with a family feel, the post holder here will be pivotal in providing the best level of quality care to varying departments and their patient’s needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will:&lt;/p&gt;\n&lt;p&gt;On the job training will be provided. However, experience in the following would be desirable:&lt;/p&gt;\n&lt;p&gt;-Acute and general medicine experience.&lt;/p&gt;\n&lt;p&gt;-Frailty experience.&lt;/p&gt;\n&lt;p&gt;-Previous work within and ED, EAU, short stay ward or ambulatory unit.&lt;/p&gt;\n&lt;p&gt;-Rehabilitation&lt;/p&gt;\n&lt;p&gt;-Discharge planning.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You must have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Community&lt;/li&gt;\n&lt;li&gt;Two Years’ Experience&lt;/li&gt;\n&lt;li&gt;HCPC Registered&lt;/li&gt;\n&lt;li&gt;BSC Occupational Therapy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03330 144 370&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with Rais Kausar, Recruitment Consultant on 01442915242 or&lt;span style=&quot;text-decoration: underline;&quot;&gt; Rais.Kausar&lt;/span&gt;@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Headington", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Band 6 Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254476", "validThrough": "2021-01-25T23:59:59+0000"}