{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-22T15:02:10+0100", "description": "&lt;h2&gt;The role&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Are you someone looking for a career in one of the UK’s most respected mental health and learning disability trusts?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to be part of a dedicated team committed to helping those with mental health &amp; learning disability problems enjoy a better future?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to do a job that makes a difference every day?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; This is an exciting opportunity to join our newly expanded community forensic team at one of the country’s most respected providers of secure mental health services. Shortlisted in the Nursing Times 2020 ‘Team of the Year’ Award.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a Senior Community Mental Health Nurse within the Community Forensic Service within the Secure Services Directorate, you will be a core member of a multi-disciplinary team and be responsible for taking an active role in carrying out the functions of that team; including carrying a case load of varying complexity. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work in partnership with a Senior Occupational Therapist to provide holistic client centred care co-ordination. You will have a key role in our recovery pathway, providing direct nursing care and also engaging in a range of therapeutic interventions.&lt;/p&gt;\n&lt;p&gt;The overarching aim of the Community Forensic service is to deliver a model of integrated care and support across all elements of a service user’s pathway. With a specific focus on prevention through admission avoidance and early intervention through collaboration with other services. This includes training and support of staff, case consultation and formulation. For those in inpatient care there is an aim to support flow through the secure directorate and reduce re admission following discharge into the community. The team works with a relational approach with a focus on integration, meaningful roles and routines in the community.&lt;/p&gt;\n&lt;p&gt;Devon Partnership NHS Trust is growing as we establish ourselves us as one of the leading providers of mental health services in the country.&lt;/p&gt;\n&lt;p&gt;Working as part of Devon Partnership NHS Trust, you will make a difference to people’s lives from the moment you start.&lt;/p&gt;\n&lt;p&gt;£31,365 - £37,890 per annum (Band 6)&lt;/p&gt;\n&lt;h2&gt;About you&lt;/h2&gt;\n&lt;p&gt;You will be a qualified Registered Nurse (Mental Health), ideally with experience of working in forensic mental health and / or community. Your primary role will be to complete case management, provide specialist interventions and support individuals in their on-going recovery.&lt;/p&gt;\n&lt;p&gt;We would welcome interested parties contact Isabel Westwood Nursing manager on isabelwestwood@nhs.net or call 07816 400564. Visits are strongly recommended.&lt;/p&gt;\n&lt;p&gt;Community: Shortlisted, Nursing Times Awards 2020 &quot;Team of the Year&quot;&lt;/p&gt;\n&lt;h2&gt;The location&lt;/h2&gt;\n&lt;p&gt;We are based at Langdon Hospital in Dawlish, a 111 acre campus-style site which includes the recently-opened Dewnans Centre, a £27 million state-of-the-art ‘medium secure’ unit, as well as a number of ‘low secure’ and open wards, however under the current COVID-19 conditions this may be subject to alternative arrangements / change for example home working. Please be assured that any alternatives will be discussed fully with you and the organisation. Please ask the appointing manager if you have any questions.&lt;/p&gt;\n&lt;p&gt;Our mission is to become a recognised centre of excellence and expertise in mental health and learning disability within the next five years. As well as delivering consistently high quality care and treatment, our strategic objectives include our desire to challenge discrimination and stigma; to champion recovery and inclusion; to attract talented people and to create a great place to work with a shared sense of pride and ambition.&lt;/p&gt;\n&lt;h2&gt;About us&lt;/h2&gt;\n&lt;p&gt;The Forensic Directorate within Devon Partnerships Trust provides forensic mental health services for the south west region and has an excellent reputation. A recent CQC inspection rated us as “Outstanding”. Our Directorate employs over 320 staff and we have ambitious plans in place to expand and develop our existing services.&lt;/p&gt;\n&lt;p&gt;We support people who, as a consequence of their mental health needs, have had contact with the criminal justice system and require a safe and secure environment that enables them to receive a wide range of treatments, therapies and care to support their recovery. Recovery is at the heart of everything we do - it is about people building a meaningful life and represents a shift away from focusing on illness and symptoms towards a focus on personal health, strengths and wellness.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our offer to you&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. &lt;br /&gt; &lt;br /&gt; Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working where this is possible&lt;/li&gt;\n&lt;li&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service withtheNHS so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Refer a friend scheme applies – both earn up to £500* T&amp;C&#39;s apply - See info in links&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Living here&lt;/h2&gt;\n&lt;p&gt;Great place to work. Great place to live&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dawlish", "postalCode": "EX7 0NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5997", "longitude": "-3.46819"}}, "title": "Senior Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239047", "validThrough": "2020-11-30T23:59:59+0000"}