{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-05T16:16:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Specialist Physiotherapist Static on Medicine and Surgery - 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated, forward thinking and experienced Physiotherapist to join our dynamic Integrated Medicine and Surgery Inpatient Therapy Team at Stockport NHS Foundation Trust. We offer a rotational programme within our team working across a variety of different areas including Urgent Care, Critical Care, Surgical Wards and Speciality Medical Wards.&lt;/p&gt;\n&lt;p&gt;The post will involve assessment and treatment of patients to promote earlier hospital discharge with a home first ethos. You will work as a physiotherapist as part of an integrated team to improve flow and quality of the patient journey. Your caseload will be variable and comprise of some complex conditions; therefore applicants must demonstrate flexibility and have a broad range of previous experience including working in an acute NHS setting. An interest in a particular specialism for example, Frailty is also desirable.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Excellent communication, organisational and team working skills are required as well as the ability to work autonomously and under pressure. The successful candidate will require a flexible approach to working including weekends and bank holidays. You will have the opportunity to support and develop band 5 therapists within the team and act as a clinical educator to students.&lt;/p&gt;\n&lt;p&gt;We have a strong commitment to support all staff members with CPD opportunities. We offer regular supervision and annual appraisal with a regular in-service training programme. You will be supported by Therapy Team Leads, Clinical Leads, and Physiotherapy Professional Leads with clinical support time allocated.&lt;/p&gt;\n&lt;p&gt;There is a responsibility for Respiratory On Call evening and weekend duties, which is underpinned by teaching and a competency programme.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary. In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information, please contact Hannah Spurr, Professional Leads for Physiotherapists on 0161 419 5270.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258528", "validThrough": "2020-11-22T23:59:59+0000"}