{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-10-26T12:17:01+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking to employ Band 6 Radiotherapist to lead a team of radiotherapists on the treatment units and who can maximise resources and maintain a high quality service for the patients.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be recognised as a clinical expert in this field of practice, and will also be able to advise on radiotherapy techniques and oncological clinical radiotherapy issues.&lt;/p&gt;\n&lt;p&gt;Previous experience within image evaluation and knowledge of IGRT techniques would be an advantage. Students qualifying this year are welcome to apply.&lt;/p&gt;\n&lt;p&gt;The post will be linked to a professional development package which will assist the post holder to progress through a career pathway. You will be expected to undertake imaging assessment for all sites using both MV,kV and Cone Beam CT imaging modalities. We actively support training opportunities at an in-house and external levels. All posts are linked to a competency package which enables radiotherapists to progress through a career pathway.&lt;/p&gt;\n&lt;p&gt;Some training will be given to enable you to meet the requirements of the post. Kent Oncology Centre currently comprises:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;9 Linear Accelerators; 6 at Maidstone (all with OBI facilities) and 3 at Canterbury (2 with OBI facilities)&lt;/li&gt;\n&lt;li&gt;A range of Brachytherapy services on the Maidstone site.&lt;/li&gt;\n&lt;li&gt;A pre-treatment service with CT/Sim/3D planning with virtual simulation on both sites.&lt;/li&gt;\n&lt;li&gt;Macmillan site specialists for head and neck, urology, gynaecological and breast cancers.&lt;/li&gt;\n&lt;li&gt;Radiographer led services including on treatment reviews and informed consent .&lt;/li&gt;\n&lt;li&gt;2 Consultant Radiographers specialising in palliative radiotherapy.&lt;/li&gt;\n&lt;li&gt;Multi-disciplinary team working.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are currently involved in the treatment of RAIDER and SABR patients.&lt;/p&gt;\n&lt;p&gt;We cannot avoid that it is not easy working in the NHS at the moment, meaning your work/life balance is so much more important. So why not consider somewhere you can meander through the open countryside or take a stroll along the River Medway enjoying those moments to stop and reflect. Are you looking for an exciting new opportunity that offers access to both central London and France in less than an hour by train? Then look no further!&lt;/p&gt;\n&lt;p&gt;Kent, the Garden of England, has rolling hills and stunning coastline. With quaint villages housing traditional country pubs for those long, lazy Sunday lunches or medieval market towns for browsing the antique shops to modern towns with large shopping complexes and the usual high street eateries, Kent has it all.&lt;/p&gt;\n&lt;p&gt;The County has some very well respected and nationally renowned primary and secondary schools, including grammar and private schools.&lt;/p&gt;\n&lt;p&gt;You will be joining an experienced team who receive excellent patient satisfaction scores and deliver the highest, quality modern oncological services.&lt;/p&gt;\n&lt;p&gt;Radiotherapy services are provided at Maidstone Hospital and Kent &amp; Canterbury Hospital in Canterbury. Chemotherapy services are provided at Maidstone and Tunbridge Wells Hospitals. Outpatient clinics are provided by the Maidstone and Tunbridge Wells Consultants at all the acute hospitals in Kent and Medway. The Kent Oncology Centre has been successful in securing central funding to replace 4 linear accelerators, with the third currently being installed and planned to be operational in April 2019.&lt;/p&gt;\n&lt;p&gt;The Kent Oncology Centre has a history of promoting advanced and innovative practice with non-medical staff undertaking patient reviews and radiotherapy planning. A new haemato-oncology ambulatory unit has been established and the service is currently being grown. There is a locally developed Oncology electronic patient record known as the Kent Oncology Management System (KOMS) that everyone who uses it, wishes that they had something similar in other Oncology Units!&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/p&gt;\n&lt;p&gt;Closing Date: Wednesday 11th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: Week commencing 16th November 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaren RichJob titleDeputy Radiotherapy Services ManagerEmail addresskaren.rich@nhs.netTelephone number01622226154Additional contact information&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Canterbury, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Therapeutic Treatment Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242394", "validThrough": "2020-11-11T23:59:59+0000"}