{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45753", "minValue": "45753", "unitText": "YEAR", "value": "From £45,753 per annum, pro rata"}}, "datePosted": "2020-10-29T15:16:22+0000", "description": "&lt;p&gt;We are seeking a Band 8A Clinical Psychologist to be a part of a supportive and innovative Health and Wellbeing Team working into Swanwick Lodge Secure Children’s Home. It is a time of change and innovation across the service and your input and expertise will be valued and an important part of shaping the development of the provision and the care to our young people.&lt;/p&gt;\n&lt;p&gt;The Health and Wellbeing Team are looking for an energetic and motivated Clinical Psychologist who is passionate about working with vulnerable young people. The role is dynamic and offers a scope to make a real difference to young people at what is often a crucial turning point in their lives.&lt;/p&gt;\n&lt;p&gt;Whilst the unique nature of this role is outlined below, this post provides you with the opportunity to be part of a skilled and knowledgeable multi-disciplinary team within AWP Young People’s Secure Services, who will support you in your learning and development and your ability to deliver the best care you can to our young people. As part of the team, you will be involved in the implementation of a developmentally and trauma informed mental-health service model, based within the SECURE STAIRS framework. The implementation of Secure Stairs represents a new way of working, with associated culture change and opportunities for shaping service delivery. To further your professional development, you will receive specialist training in the Trauma Recovery Model, which is the model of care embedded throughout the system of care we all provide at Swanwick Lodge.&lt;/p&gt;\n&lt;p&gt;The primary aim of Swanwick Lodge is to provide welfare placements for those young people aged 10 – 17 years old who are detained under Section 25 of the Children’s Act 1989. Swanwick Lodge is a secure children’s home that provides a safe and child centred environment, in which children and young people can begin to stabilise, feel safe again and build trusting therapeutic relationships with the staff who are supporting them. This then enables them to begin addressing some of the issues that may have led to their loss of liberty and placement at Swanwick Lodge. We aim to consider all aspects of the young person’s well-being including physical, mental and emotional wellbeing, alongside health and possible substance misuse. AWP and Hanham Health work in partnership to provide both mental health and primary care services at Swanwick Lodge, Monday-Friday 8am-8pm.&lt;/p&gt;\n&lt;p&gt;The Clinical Psychologist will work as part of the wider Health and Wellbeing team offering leadership, supervision opportunities, consultation on young people&#39;s formulation and psychological management to other non- psychologist colleagues. You will work closely with the wider team to meet the needs of the young people, which will include taking a leading role in providing appropriate support and tailoring assessments and interventions as appropriate. This will be under the supervision of the Principal Clinical Psychologist. You will require specialist training and/or knowledge of an evidence based treatment for trauma and have experience working clinically with young people and the systems around them. You will help to provide integrated physical and mental healthcare to our young people, with a focus on person-centred, holistic care, informed by the Trauma Recovery Model.&lt;/p&gt;\n&lt;p&gt;An important part of your role will be to continue to work closely alongside Swanwick Lodge care staff to ensure healthcare is fully integrated into the Secure Children’s Home. You will also be central in thinking with the Health and Wellbeing Team about how we can continue to foster skilled and emotionally resilient staff and will be part of the group of professionals providing support and encouraging reflective practice. Also you will be responsible for leading on agreed aspects of service development embedding psychologically informed thinking into policies, practice and procedures across the wider service.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the post further or have any additional questions, please don’t hesitate to contact&lt;/p&gt;\n&lt;p&gt;Angela Balch, Team Manager Health and Wellbeing Team or Dr Kirsty Harrison, Clinical Lead on 01489 581913.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;angela.balch@nhs.net  Telephone number  07712544628&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO31 7HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8828", "longitude": "-1.28242"}}, "title": "Band 8a Clinical  Psychologist - Southampton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248839", "validThrough": "2020-11-15T23:59:59+0000"}