{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £28,050 to £36,644 pa"}}, "datePosted": "2020-10-30T11:16:01+0000", "description": "&lt;p&gt;This is an excellent opportunity for a highly motivated and enthusiastic nurse to join the Specialist Palliative Care Team at East Lancashire Hospital Trust on a permanent 37.5 hr contract. Whilst this vacancy is within the hospital team, please be advised that you may be asked to work in the acute hospital subject to service need and for your own role development; therefore you will need to have access to a car for work purposes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a dynamic, multidisciplinary team delivering highly specialist palliative care advice, support and monitoring to patients, their families and staff across the acute and community settings.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a very rewarding and emotionally demanding role caring for people and their families who require Specialist palliative Care services. You will be working in a team of Clinical Nurse Specialists, Consultants Palliative Medicine, End of Life facilitator and Lead Nurse across the trust.&lt;/p&gt;\n&lt;p&gt;You will play an active role, together with the existing members of the Specialist Palliative Care Team, in advancing high quality specialist palliative care services and promoting excellence in end of life care across ELHT.&lt;/p&gt;\n&lt;p&gt;In return, you’ll be supported by an expert team in an environment where training and development opportunities are actively encouraged in order to meet the clinical needs of the role. We offer a comprehensive induction programme and you will be appraised on a yearly basis with a view to developing your knowledge and skills where appropriate.&lt;/p&gt;\n&lt;p&gt;If you are ambitious to develop your specialist palliative care career in a dynamic team who strive to achieve the best palliative and end of life care outcomes for the people we care for then we are eager to talk to you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire LangtonJob titleLead Nurse Specialsit Palliative careEmail addressclaire.langton@elht.nhs.ukTelephone number07966415259Additional contact information&lt;/p&gt;\n&lt;p&gt;Claire Langton – claire.langton@elht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Leanne Smith- 01254 732317 Leanne.smith@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Lancashire Hospitals Trust, East Lancashire", "postalCode": "BB2 3NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.734", "longitude": "-2.47981"}}, "title": "Associate Clinical Nurse Specialist Palliative Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249904", "validThrough": "2020-11-13T23:59:59+0000"}