{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23053", "minValue": "21090", "unitText": "YEAR", "value": "£21,090 - £23,053"}}, "datePosted": "2020-10-28T12:26:32+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&#39;Open Mental Health&#39; is a Somerset alliance of local voluntary organisations and the NHS. We are working in partnership to ensure that residents of Somerset get the support they need, when they need it.&lt;/p&gt;\n&lt;p&gt;Our shared ambition is to ensure that people living with mental health problems get the right support at the right time. Working together, we support people to live a full life, by enabling access to specialist mental health services, housing support, debt and employment advice, volunteering opportunities, community activities and physical exercise, to help support and improve their wellbeing and quality of life.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Second Step &lt;/strong&gt;is a leading mental health charity in the South West offering housing, support and hope to thousands of people with mental health and other problems.  Our goal is to inspire hope and deliver change for everybody and every community we work with.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Recovery and Wellbeing Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37 hours over 5 days per week (flexible working required)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent post &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £21,090 - £23,053&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: CAB, High Street, Bridgwater, Somerset&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note home working and carrying out duties remotely will be required during Covid 19 restrictions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re looking for people to support us deliver a new service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The purpose of this service is to provide enhanced, non-clinical wrap around specialist support for people who ‘fall between’ primary and secondary care and those stepping back down into primary care. The post will be based in a central location in Sedgemoor.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Recovery and Wellbeing Worker is a key role in the new community mental health model across Somerset. This role will provide high quality support for people with moderate and serious mental health needs predominantly in a 1:1 capacity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your role will include connecting people to community resources, building resilience, improving wellbeing and coordinating and navigating social and clinical services around the individual. You will work within a recovery and psychologically informed approach, taking a holistic view to support people’s recovery to live fulfilling lives. Support will be tailored to individual cultural and social needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to have experience of supporting people with complex needs, including mental health, within a community setting.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You’ll be a good communicator, be great at building trust and be keen to work as part of a new team to contribute to the delivery of this valuable service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Second Step is a leading provider of mental health services.  We offer excellent training and support, and we acknowledge the commitment and dedication of our employees, which is the foundation of our success. We would like to hear from people who share the same belief and values.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date:    Tuesday 17 November 2020 at 12 midnight&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date:   Likely to be Wednesday 25 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information and to apply please see our website. Second Step is committed to Equal Opportunities and welcomes applicants from all sections of the community and from people who have personal experience of living with long term mental health needs and using mental health services.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Second Step", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sedgemoor", "postalCode": "TA6 3HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1305", "longitude": "-3.0021"}}, "title": "Recovery and Wellbeing Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246569", "validThrough": "2020-11-11T23:59:59+0000"}