{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18827", "minValue": "18827", "unitText": "YEAR", "value": "11.20"}}, "datePosted": "2020-11-04T10:12:01+0000", "description": "&lt;p&gt;Job Title: Undergraduate Administrator&lt;/p&gt;\n&lt;p&gt;Location/Trust: North Manchester General Hospital&lt;/p&gt;\n&lt;p&gt;Department: Medical and Dental Education&lt;/p&gt;\n&lt;p&gt;Band/Pay rate: £11.20 per hour&lt;/p&gt;\n&lt;p&gt;Hours: Monday – Monday – Thursday 08:30 – 16:30 Friday 08:00 – 16:00&lt;/p&gt;\n&lt;p&gt;Placement Ref: 36673&lt;/p&gt;\n&lt;p&gt;The Role-&lt;/p&gt;\n&lt;p&gt;Can you bring your excellent administration skills and knowledge to our Medical and Dental Education department?&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that works well together, always there to help each other?  Would you like to work in a Trust that recently had good in their CQC report? This location is easily accessible by public transport and has onsite parking.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you answered yes, The Pennine Acute Hospital Trust would love to hear from you.&lt;/p&gt;\n&lt;p&gt; We have a temporary placement opportunity available for an Undergraduate Administrator at North Manchester General Hospital. The administrator will be providing the following support to the Medical and Dental Education team.&lt;/p&gt;\n&lt;p&gt;To effectively administrate the varied teaching programmes offered to Year 3, 4 and 5 undergraduate medical and dental students. (Please read full job description)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;1.To provide effective administration of the Undergraduate Teaching provided across the Trust.&lt;/p&gt;\n&lt;p&gt;2.To ensure all teaching areas are maintained to designated standards, liaising with the Estates Department regarding essential repairs and maintenance.&lt;/p&gt;\n&lt;p&gt;3.To ensure all AV / teaching equipment is effectively utilised, stored and maintained, ensuring that  rooms are set up as appropriate for teaching sessions, and all equipment securely stored and rooms restored to original lay out on completion.&lt;/p&gt;\n&lt;p&gt;4.Book rooms for training, ensuring that room suitability and provision of appropriate equipment is fully considered and booked in advance.&lt;/p&gt;\n&lt;p&gt;5.Be a point of contact for undergraduate medical and dental students answering basic queries, providing appropriate support and liaising with appropriate University staff as required for more complex queries.&lt;/p&gt;\n&lt;p&gt;6.To work with the Line Manager to provide cover for other members of staff within the department for both postgraduate and undergraduate areas as appropriate, ensuring basic knowledge and ongoing current awareness to enable this to take place.&lt;/p&gt;\n&lt;p&gt;7.Collate statistical information as required (eg teaching activity, student participation and attendance) and produce reports and spreadsheets as required by the Medical Education Business Manager, Undergraduate Tutor, Assistant Manager Undergraduate Training and Directors of Medical Education.&lt;/p&gt;\n&lt;p&gt;8.To administer on behalf of the Manager the petty cash for the locker monies for students and take responsibility for the element of the budget pertaining to stationery.&lt;/p&gt;\n&lt;p&gt;9.Order stocks, stores and equipment as required for the day to day running of the Department within available resources, and checking with the Medical Education Business Manager or Assistant Manager Undergraduate Training (subject to budget) that sufficient budget is available, ordering all stationery and stock on line. By exception, if non-stock items are ordered the signature of the Medical Education Business Manager to be obtained.&lt;/p&gt;\n&lt;p&gt;10.Working from names provided by Undergraduate Year and Firm Leads, schedule and book speakers and trainers for Undergraduate Teaching provision.&lt;/p&gt;\n&lt;p&gt;11.Use MedLea / 1Med system to input the weekly timetable for medical students, as obtained from the Undergraduate Year and Firm Leads, and ensure MedLea / 1Med is kept up to date with any alterations and lectures at all times.  &lt;/p&gt;\n&lt;p&gt;13.To contact Consultants verbally and by email to book students into appropriate clinics and theatre sessions.&lt;/p&gt;\n&lt;p&gt;14.Provide a full range of secretarial/clerical/reception duties as required for Undergraduate Teaching programmes.&lt;/p&gt;\n&lt;p&gt;15. Act as the first point of contact for all Undergraduate Teaching enquiries (written or verbal) and deal independently with routine matters.&lt;/p&gt;\n&lt;p&gt;The skills required are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Good standard of general education to A level standard or equivalent work experience, Literacy and Numeracy to Level 2 minimum standard&lt;/li&gt;\n&lt;li&gt;ECDL/ITQ or equivalent&lt;/li&gt;\n&lt;li&gt;Advanced ECDL/ITQ&lt;/li&gt;\n&lt;li&gt;AMSPAR&lt;/li&gt;\n&lt;li&gt;Demonstrate significant experience in secretarial/clerical role&lt;/li&gt;\n&lt;li&gt;Production of reports&lt;/li&gt;\n&lt;li&gt;Maintenance of work schedules&lt;/li&gt;\n&lt;li&gt;Arranging meetings/room bookings&lt;/li&gt;\n&lt;li&gt;Preparation of audio-visual aids     &lt;/li&gt;\n&lt;li&gt;Well-developed organisational skills&lt;/li&gt;\n&lt;li&gt;Good Microsoft office experience of using all packages&lt;/li&gt;\n&lt;li&gt;Ability to work deadlines&lt;/li&gt;\n&lt;li&gt;Good time management skills&lt;/li&gt;\n&lt;li&gt;Able to use spreadsheets&lt;/li&gt;\n&lt;li&gt;Able to produce presentations&lt;/li&gt;\n&lt;li&gt;Excellent communication skills (verbal/written)&lt;/li&gt;\n&lt;li&gt;Produce reports, letters and memos        &lt;/li&gt;\n&lt;li&gt;Experience of stationery or stock control&lt;/li&gt;\n&lt;li&gt;Able to monitor expenditure against budget&lt;/li&gt;\n&lt;li&gt;Knowledge of office systems and protocols&lt;/li&gt;\n&lt;li&gt; Excellent attendance &amp; punctuality record&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Undergraduate Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255318", "validThrough": "2020-11-18T23:59:59+0000"}