{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 Per Annum"}}, "datePosted": "2020-10-30T12:30:17+0000", "description": "&lt;p&gt;We are very excited to be seeking a specialist clinical pharmacist in HIV to join our dynamic team of professionals. We are keen to hear from pharmacists who would like part-time hours, or those who would like full-time hours and complement this role with another from within our team.&lt;/p&gt;\n&lt;p&gt;In Plymouth we are continuously developing exciting and innovative opportunities for enthusiastic and motivated pharmacists to join our dedicated team delivering clinical pharmacy and medicines optimisation services across our large teaching hospital.&lt;/p&gt;\n&lt;p&gt;We are seeking likeminded pharmacists who are passionate about patient care and share our commitment to support and complement the multi-disciplinary team as we develop integration of clinical pharmacy services across all areas of the Trust. &lt;/p&gt;\n&lt;p&gt;In this evolving post, your personal and professional development will be key to achieving job satisfaction. Personal success in this role will contribute to the development of our profession, you will be at the forefront driving and shaping the role of the specialist clinical pharmacist in Plymouth. You would become a member of our diverse pharmacy team with potential for portfolio working across the healthcare system.&lt;/p&gt;\n&lt;p&gt;You will be supported in your clinical development by experienced senior clinicians. As a team we are truly committed to the development of our staff both personally and clinically and would support you to attain your goals.  We are very fortunate in Plymouth to provide the widest range of hospital based services in the Peninsula.  &lt;/p&gt;\n&lt;p&gt;We are steadfast in our values: putting people first, taking ownership, respecting others, being positive and to listen, learn and continuously improve. If you can relate to and embody these values then we would very much like to work with you.&lt;/p&gt;\n&lt;p&gt;You will be working with a Chief Pharmacist who is committed to you as an individual.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Alex Bosley Interim Deputy Chief Pharmacist 01752 437964 Alex.Bosley@nhs.net&lt;/p&gt;\n&lt;p&gt;***Preference will be given to internal Trust staff, as well as ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon who are able to display recent relevant experience as dictated by the Person Specification.***&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Advanced Specialist Pharmacist - HIV medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250156", "validThrough": "2020-11-17T23:59:59+0000"}