{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-19T16:46:16+0100", "description": "&lt;p&gt;&lt;span&gt;We are looking to recruit two Locum Consultant Paediatricians.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Post to cover for sickness absence, to commence as soon as possible. This is mainly to cover General Paediatrics, but opportunity to develop a special interest can be explored. Flexible working times would also be considered. This is an exciting opportunity to join our Trust, which was awarded NHS Foundation Trust status with effect from 1 April 2005. &lt;br /&gt;&lt;br /&gt;This post is full-time (10 PAs) for a period of twelve months and is to start as early as possible. You will join a thriving and fully integrated Child Health Directorate comprising of 21.5 WTE Consultants, including 2 Paediatric Neurologists and 6 WTE Consultant Community Paediatricians. The post is based mainly at Royal Preston Hospital. There will be close working relationship with the Paediatric Neurologists and other Paediatricians. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will participate in general paediatric on call rota doing 1 in 10 non-resident on calls and ‘Consultant of the week’ system. &lt;br /&gt;&lt;br /&gt;The post also includes an evening resident shift in the paediatric assessment unit (5 days in a 10 week cycle) working along with a junior and middle grade doctor. There is no responsibility for neonatal cover involved.&lt;br /&gt;&lt;br /&gt;The department is increasing its commitment to medical student teaching, being seconded to the Trust from the University of Manchester. Considerable opportunities exist for research and development within the Trust and there are active and developing links with the Universities of Manchester and Central Lancashire.&lt;br /&gt;&lt;br /&gt;Lancashire Teaching Hospitals NHS Foundation Trust forms one of the major acute Trusts in the North West with all of the usual specialties on site as well as being a Tertiary Centre for Lancashire and South Cumbria in the departments of Neurosciences, Oncology, Plastic Surgery and Burns and Renal Medicine.&lt;br /&gt;&lt;br /&gt;Interviews to be held within a week of closure of applications.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Clinical enquiries should be made to Dr Karnam Sugumar, Clinical Director on (01772) 523551.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Lancashire Teaching Hospitals NHS Foundation Trust forms one of the major acute Trusts in the North West with all of the usual specialties on site as well as being a Tertiary Centre for Lancashire and South Cumbria in the departments of Neurosciences, Oncology, Plastic Surgery and Burns and Renal Medicine.&lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Locum Consultant in Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233238", "validThrough": "2020-11-16T23:59:59+0000"}