{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 to £49,325 pa inc. HCAS"}}, "datePosted": "2020-11-04T15:16:53+0000", "description": "&lt;p&gt;Would you like to join a friendly, innovative, supportive department and participate in an interesting senior rotational post? If you want to broaden your experience of hospital Pharmacy, whilst contributing towards the work of a busy department, then this is the job for you. &lt;br /&gt;&lt;br /&gt;We have specialist rotations across all Trust sites to gain exceptional clinical skills in highly sort after areas and we are expanding these rotations every year. We currently have one or more rotations in the following areas:&lt;br /&gt;&lt;br /&gt;• Specialist Gastroenterology at an internationally renowned tertiary referral centre&lt;br /&gt;• Medicines Information in a Regional Medicines Information Centre&lt;br /&gt;• Infectious Diseases on two dedicated infectious disease wards and a tertiary referral centre for Multi drug Resistant TB and tropical medicine &lt;br /&gt;• Respiratory Medicine on a dedicated respiratory ward with common and restrictive diseases&lt;br /&gt;• Cardiology on our specialist Cardiology unit&lt;br /&gt;• Endocrine &amp; Rheumatology with our award winning multi-disciplinary team&lt;br /&gt;• Aseptic &amp; Cancer services alongside our Macmillan Cancer Pharmacist in our aseptic unit and dedicated haematology ward and parenteral nutrition unit&lt;br /&gt;• Elderly care &amp; rehabilitation (with the addition of palliative medicine at Ealing site) at our community rehabilitation hospital working with a growing team to support the medicines optimisation agenda&lt;br /&gt;• Short Term Rehabilitation and Re-enablement (STARRS) a new role with our skilled multi-disciplinary innovative team &lt;br /&gt;• Acute Medicine in our busy acute medical unit (AMU) working with an established multi-disciplinary team&lt;br /&gt;• Patient Services – supporting the role-out of electronic prescribing for chemotherapy and training of pre-reg and diploma Pharmacists&lt;br /&gt;•Medication Safety – support the medication safety officer to implement the medication safety strategy across the organisation&lt;br /&gt;•Surgery &amp; ITU – working closely with the specialist Pharmacist to optimise care for patients in this division &lt;br /&gt;•HIV &amp; Antimicrobials– work with the multi-disciplinary team in HIV and GUM medicine to improve medicines optimisation &lt;br /&gt;&lt;br /&gt;We are a department that believe in equipping our Band 7 Pharmacists with skills to carry out senior roles to aid their career progression. Rotations have been developed to ensure leadership roles are key with a high emphasis on delivering teaching and training to a wide range of healthcare professionals as well as managing teams. You will be able to develop senior roles and responsibilities and we encourage individuals to take on any new responsibilities to meet their development needs. This is a great opportunity to gain experience in various rotations and improve medicines optimisations for patients. Rotations are of 9 month duration and currently allocated by an ‘option’ process which allows individuals to build their own experience portfolio.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anisha Patel - Deputy Clinical Services Manager 020 8967 5668/3408&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "All Sites (Northwick Park Hospital/Ealing Hospital), London", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Senior Rotational Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256408", "validThrough": "2020-11-22T23:59:59+0000"}