{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "52036", "minValue": "31997", "unitText": "YEAR", "value": "£31,997 - £52,036"}}, "datePosted": "2020-10-28T10:19:11+0000", "description": "&lt;p&gt;Applications are invited for vacancies in the level 1 Paediatrics training programmes at ST1 level across Health Education England (HEE) Local offices, NHS Education for Scotland (NES), Northern Ireland Medical &amp; Dental Training Agency (NIMDTA) and Health Education and Improvement Wales (HEIW) starting Wednesday 4th August 2021.&lt;/p&gt;\n&lt;p&gt;The application window opens on Thursday 5th November 2020 at 10:00 UK time and closes on Tuesday 1st December 2020 at 16:00 UK time. You will not be able to submit your application after this time. Please ensure that you have completed all the relevant sections of the application form as missing information will deem your application incomplete and it will not be considered.&lt;/p&gt;\n&lt;p&gt;You must apply via our online recruitment system, &#39;New Oriel&#39;. the &#39;New Oriel&#39; can be accessed from the link provided. Registration is available to applicants from Monday 2nd November 2020.&lt;/p&gt;\n&lt;p&gt;The qualifications and professional registration requirements plus other eligibility criteria can be found in the Person Specification. The Person Specification for this speciality is available from the Speciality Training Website which can be accessed from Oriel.&lt;/p&gt;\n&lt;p&gt;Please visit the Royal College of Paediatrics and Child Health website (rcpch.ac.uk) to find out the following information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Indicative number of posts available&lt;/li&gt;\n&lt;li&gt;Online interview dates&lt;/li&gt;\n&lt;li&gt;Applicant guidance&lt;/li&gt;\n&lt;li&gt;Recruitment documents&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All medical practitioners have been added to the Shortage Occupation List in the UK. This means that all medical practitioners are exempt from the Resident Labour Market Test (RLMT) and can apply for any speciality in any recruitment round, subject to eligibility.&lt;/p&gt;\n&lt;p&gt;It is strongly suggested that you read the 2021 Medical Speciality Recruitment Applicant Handbook to familiarise yourself with the immigration information contained within.&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "West Midlands Workforce Deanery", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "England, Northern Ireland, Scotland and Wales", "postalCode": "B16 9RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4723", "longitude": "-1.93413"}}, "title": "Specialty Trainee - Level 1 ST1 Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246035", "validThrough": "2020-12-01T23:59:59+0000"}