{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48500", "minValue": "45000", "unitText": "YEAR", "value": "£45,000 - £48,500 per annum"}}, "datePosted": "2020-11-06T09:35:31+0000", "description": "&lt;p&gt;Do you have the passion to make a difference to patients who need MSK treatment? Are you looking for the next step in your career or are you looking to add extra skills to your portfolio? If so, look no further, as we could have the job for you!&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; An exciting opportunity has arisen for an Advanced Physiotherapy Practitioner (APP) to join our clinical team at the &lt;strong&gt;Practice Plus Group MSK &amp; Spinal Service, Lincolnshire&lt;/strong&gt; on a permanent part time or full time basis. We provide a specialist rapid access outpatient clinical assessment and treatment service for patients presenting with both peripheral and spinal musculoskeletal conditions.&lt;/p&gt;\n&lt;p&gt;You will work closely with our experienced clinical team, this includes the Clinical Operations Manager, Clinical Lead and a team of 6 Advanced Physiotherapy Practitioners. You will also have the opportunity to work with our Orthopaedic Consultant.  We offer regular department in-service training, funding for external clinical courses, and an excellent supportive learning environment in order to continually develop your own personal learning and CPD. &lt;/p&gt;\n&lt;p&gt;LCATS currently operates within 7 existing health centres and hospitals throughout Lincolnshire and we are developing further clinics throughout the region. Depending on your hours, you may need to travel between these locations, so having a full UK driving license and access to your own vehicle is essential. Expenses for travel will be covered.&lt;br /&gt; &lt;br /&gt; There is no on-call or compulsory weekend work to allow for a strong work life balance.&lt;br /&gt; &lt;br /&gt; Within this job, you will be responsible for:&lt;br /&gt; •Managing a case load of spinal and peripheral patients with varying diagnosis and/or highly complex needs using evidence based and/or patient centered principles.&lt;/p&gt;\n&lt;p&gt;• Be responsible for organising appropriate diagnostic workups for patients and referring them to an appropriate secondary care service when indicated.&lt;/p&gt;\n&lt;p&gt; •Working closely with the Clinical Lead and Clinical Operations Manager to achieve the service targets, including supporting clinical education and audit within the service&lt;br /&gt; •Acting as a source of expertise in the management of the service by providing advice to patients and other healthcare professionals, GP’s and Consultants&lt;br /&gt; •Performing steroid injections as appropriate&lt;br /&gt; * Taking part in MDT clinics with Orthopaedic Consultants&lt;br /&gt; * An opportunity to be involved in an FCP pilot if interested&lt;/p&gt;\nAbout Practice Plus Group\n&lt;p&gt;Practice Plus Group was founded in 1982. Today our healthcare services include treatment centres, prison health services, GP practices, NHS walk-in centres, GP out-of-hours and clinical assessment and diagnostics facilities. This means that we provide a greater range of specialist care services than any other organisation in the UK.&lt;br /&gt; &lt;br /&gt; Practice Plus Group is the largest independent provider of urgent care services in England incorporating OOH&#39;s, single point of access and referral management. We deliver excellent, high value patient care on behalf of the NHS for over eight million patients across England.&lt;br /&gt; &lt;br /&gt; We work with the NHS to deliver high quality healthcare services, reducing waiting times and giving the patient a greater level of choice. We also take healthcare services closer to where people live and work – increasing the efficiency and quality of the services we deliver and helping to reduce waiting times.&lt;/p&gt;\nThe Requirements\n&lt;p&gt;In order for you to be considered for the job, as a minimum we are looking for the following: &lt;br /&gt; • A qualified Physiotherapist with valid HCPC pin number&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;· Working towards or has completed an MSc in Physiotherapy&lt;/li&gt;\n&lt;li&gt;• Have recognised/validated orthopaedic musculoskeletal postgraduate training&lt;br /&gt; • Have a full UK Driving License and access to your own transport&lt;br /&gt; • Hold a qualification to administer peripheral joint/soft tissue injections&lt;/li&gt;\n&lt;li&gt;• Previous experience of orthopaedic triage&lt;/li&gt;\n&lt;/ul&gt;\nSalary &amp; Benefits\n&lt;p&gt;This is a part-time or full time permanent role.  We can offer a flexible working week with condensed hours if required.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; We can offer you: &lt;br /&gt; •A salary between £45,000 - £48,500 per annum pro-rata dependent on experience&lt;br /&gt; •25 days annual leave + 8 public holidays (pro rata for part time)&lt;br /&gt; •Contributory pension scheme &lt;br /&gt; •CPD (including free online and face-to-face training, we also offer support for external courses and provide regular in-service training) &lt;br /&gt; •Regional/National opportunities&lt;br /&gt; •Cycle to work scheme&lt;br /&gt; •Childcare vouchers and online discount&lt;/p&gt;\n \n ", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln", "postalCode": "LN6 3QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1965", "longitude": "-.598232"}}, "title": "Advanced Physiotherapy Practitioner – Lincoln", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259040", "validThrough": "2020-11-26T23:59:59+0000"}