{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro-rata y flwyddyn/per annum pr"}}, "datePosted": "2020-11-03T09:30:41+0000", "description": "&lt;p&gt;Rydym yn chwilio am staff switsfwrdd ychwanegol i ymuno â’r tîm yn Abertawe.&lt;/p&gt;\n&lt;p&gt;Bydd eich dyletswyddau yn cynnwys gweithredu consol switsfwrdd yn seiliedig ar gyfrifiadu, monitro ac ymateb i amrywiaeth o larymau a chyflyrau argyfwng. Bydd peth dyletswyddau gweinyddu hefyd ynghlwm â’r gwaith dydd i ddydd o weithio ar switsfwrdd prysur.&lt;/p&gt;\n&lt;p&gt;Dylai fod gan ymgeiswyr ar gyfer y swydd brofiad blaenorol o weithio mewn amgylchedd gwaith cyflym sy’n canolbwyntio ar y cwsmer. Yn ddelfrydol, dylai fod gan ymgeiswyr brofiad o weithredu switsfwrdd ffôn, ond er hynny, darperir hyfforddiant lawn.&lt;/p&gt;\n&lt;p&gt;Mae sgiliau cyfathrebu da, sylw i fanylder a’r gallu i weithio fel rhan o dîm yn hanfodol. Byddai profiad o weithio mewn amgylchedd cyflym cyffelyb yn fantais.&lt;/p&gt;\n&lt;p&gt;Bydd gofyn i ymgeiswyr llwyddiannus i weithio dyddiau, nosweithiau, nosau a gwyliau banc, a rhaid iddynt fod yn hyblyg i angenion y gwasanaeth ac yn barod i ddod i fewn ar fyr rybudd.&lt;br /&gt;&lt;br /&gt;Mae’r gallu i siarad Cymraeg yn dymunol ar gyfer y rôl yma.&lt;/p&gt;\n&lt;p&gt;We are looking for additional switchboard staff to join our team in Swansea.&lt;/p&gt;\n&lt;p&gt;Various hours available&lt;br /&gt;&lt;br /&gt;Your duties will include operation of a computer based switchboard console, monitoring and responding to a variety of alarms and emergency conditions. There will also be some administration duties involved with the day to day running of a busy switchboard.&lt;br /&gt;&lt;br /&gt;Candidates for the post should have previous experience of working in a fast paced customer focussed environment. Ideally candidates will have experience operating a telephone switchboard, however full training will be provided.&lt;br /&gt;&lt;br /&gt;Good communications skills, attention to detail and the ability to work as part of a team are essential. Experience of working in a similar, fast paced environment would be an advantage.&lt;br /&gt;&lt;br /&gt;Successful candidates will be required to work days, evenings, nights and bank holidays, and must be flexible to the needs of the service and be prepared to attend at short notice.&lt;br /&gt;&lt;br /&gt;We welcome informal enquiries regarding this role. Candidates are encouraged to visit the department prior to submitting their application.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is essential for this post&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gary O&#39;Brien&lt;/p&gt;\n&lt;p&gt;Rheolwr Switsfwrddtelep/Switchboard Manager&lt;/p&gt;\n&lt;p&gt;01792 516540&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Treforys/Singleton, Morriston Hospitals, Abertawe/Swansea", "postalCode": "SA2 8QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6092", "longitude": "-3.98528"}}, "title": "Teleffonydd/Telephonist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253275", "validThrough": "2020-11-17T23:59:59+0000"}