{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17657", "minValue": "17657", "unitText": "YEAR", "value": "£17.657.64"}}, "datePosted": "2020-11-04T09:07:10+0000", "description": "&lt;p&gt;If you care for others without a second thought and are looking for a rewarding career where you can make a difference and changes lives for the better, then join the team at Cotswold Spa as a Support Worker.&lt;/p&gt;\n&lt;p&gt;As an experienced Support Worker or Healthcare Assistant from the NHS or private care, you’ll join the team caring for young people and adults in this specialist inpatient and day patient eating disorder service, where you will be valued and supported, with career development opportunities available. &lt;/p&gt;\n&lt;p&gt;It’s a career that you can take pride in. It’s what delivering great healthcare should feel like. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will join the team that works well together to provide care for young people aged between 13 and 25 with eating disorder conditions. Whether you have been a Healthcare Assistant or Care Worker, you will utilise your experience to support people to lead a valued and fulfilled life. &lt;/p&gt;\n&lt;p&gt;It can be quite a challenging environment at times, so a positive attitude, compassion, resilience and vigilance are important. But it is hugely rewarding to see people improve because of you.&lt;/p&gt;\n&lt;p&gt;The Wellbeing team is on hand to keep you feeling great; be it a chat, massage or group activities, while career development opportunities provide a huge range of courses to help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the opportunities to help you achieve your career goals. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Where You Will be Working&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cotswold Spa Hospital Station Rd, Broadway WR12 7DE &lt;/p&gt;\n&lt;p&gt;Cotswold Spa is a specialist eating disorder service located in Broadway, Worcestershire for young people aged between 13 and 25 years which offers both inpatient and day patient treatment programmes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hospital is situated in the picturesque village of Broadway, Worcestershire, close to the Cotswold Way, The area boasts natural beauty with Cheltenham to the South and Warwick to the North.&lt;/p&gt;\n&lt;p&gt;The service is for young people of all genders with an eating disorder, predominantly:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bulimia Nervosa&lt;/li&gt;\n&lt;li&gt;Anorexia Nervosa&lt;/li&gt;\n&lt;li&gt;Avoidant Restrictive Food Intake Disorder&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The hospital has been specifically designed with the adolescent and young adult in mind. The interior design of the hospital is both contemporary and comfortable incorporating young people’s art.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £17.657.64 &lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off! &lt;/li&gt;\n&lt;li&gt;Free meals and parking &lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities &lt;/li&gt;\n&lt;li&gt;Career development and training &lt;/li&gt;\n&lt;li&gt;Pension contribution &lt;/li&gt;\n&lt;li&gt;Life Assurance &lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There are also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 75 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broadway", "postalCode": "WR12 7DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0402", "longitude": "-1.86961"}}, "title": "Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255149", "validThrough": "2020-12-10T23:59:59+0000"}