{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-22T10:16:47+0100", "description": "&lt;p&gt;Mental Health Older Adult &lt;strong&gt;Staff Nurse&lt;/strong&gt; – Orchid Ward, Prospect Park Hospital, Reading&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Whether you are newly qualified or an established Staff Nurse we can offer you some fantastic opportunities to build upon &amp; consolidate your learnings or help you strive towards your next career goal.&lt;/p&gt;\n&lt;p&gt;Our Preceptorship programme is designed to support your development into the mental health in-patients staff nurse role with a bespoke induction week, monthly supervision &amp; training sessions and a comprehensive structure of on-going support.&lt;/p&gt;\n&lt;p&gt;As an established staff nurse we are able to offer great learning opportunities to support your continued professional development.&lt;/p&gt;\n&lt;p&gt;Orchid is a mixed 20 bed Ward that provides care for older adults with functional mental health conditions. Based in Reading, located close to the amenities of the town centre and a leafy park, the ward works closely with patients and families to help them to identify their needs and participate actively in their care, providing a place of empathy, kindness and compassion. We have created a culture where everyone has a voice and where service users and staff collaborate to make positive change.&lt;/p&gt;\n&lt;p&gt;You are an enthusiastic registered mental health nurse with a passion for caring for vulnerable patients. With excellent communication and people skills and a warm personality, you will have a good understanding of inpatient mental health treatment and legislation.&lt;/p&gt;\n&lt;p&gt;Eager to share your knowledge when managing and mentoring more junior members of staff, you will be an inspirational member of our team, striving to be your very best and supporting colleagues in the delivery of compassionate, safe and structured care. You will be proactive, ensuring seamless delivery across a multi-disciplinary team and be able to work without direct supervision, showing initiative and a determination to support patients and their families through creative engagement.&lt;/p&gt;\n&lt;p&gt;A calming influence, you will be able to deal with difficult and distressing situations professionally. Your energy and drive will be rewarded with the support of an enthusiastic team that strives to create a warm, friendly and compassionate environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be clinically responsible for the co-ordination and implementation of effective nursing care on a Mental Health ward. You will liaise with other Professional Teams and with those providing support services&lt;/li&gt;\n&lt;li&gt;Occasionally as part of your professional development plan, take charge of the ward under the supervision of more senior qualified nursing staff member/colleague&lt;/li&gt;\n&lt;li&gt;You will ensure that the clinical, environmental and social needs of the patient are met by assessing, developing, implementing and evaluating programmes of care, seeking guidance and direction from senior nursing staff working in the unit where necessary&lt;/li&gt;\n&lt;li&gt;To be the best you can be, you’ll access our professional clinical and leadership development to ensure you are up to date, feel confident and develop as a nurse and leader, and manage and supervise a team of junior staff&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of joining our team:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Agenda for Change Salary ranging from &lt;strong&gt;£24,907 to £30,615 &lt;/strong&gt;per annum&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities and a strong emphasis on your work, life balance&lt;/li&gt;\n&lt;li&gt;Annual leave – 27 days for new starters, plus bank holidays. Increasing to 29 days after 5 years and 33 days after 10 years NHS service. Pro rata for part time staff&lt;/li&gt;\n&lt;li&gt;Excellent learning and development opportunities&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car&lt;/li&gt;\n&lt;li&gt;Access to onsite library&lt;/li&gt;\n&lt;li&gt;Generous maternity, paternity and adoption leave for eligible staff&lt;/li&gt;\n&lt;li&gt;Advanced IT enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent support and advice for staff.&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The “must haves” for you to be considered for this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Registered Mental Health&lt;/li&gt;\n&lt;li&gt;Previous experience working in a mental health care setting&lt;/li&gt;\n&lt;li&gt;Desire to undertake further training and self-improvement to support patient experience&lt;/li&gt;\n&lt;li&gt;Good oral and written communication&lt;/li&gt;\n&lt;li&gt;IT literate&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note we are unable to sponsor a Tier 2 visa for this vacancy.&lt;/p&gt;\n&lt;p&gt;If you recognise yourself in these requirements, we would recommend you apply today!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call: Leina Lejuta on 0118 960 5336 or email: Keitsesepe.Lejuta@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237864", "validThrough": "2020-11-08T23:59:59+0000"}