{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum + Outer London HCAS"}}, "datePosted": "2020-11-01T08:15:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical/Forensic/Counselling Psychologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NLFS Secure Inpatient Services &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 (full time, 37.5 hours) – Two posts &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that there is the opportunity to part-time or job share &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Or&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 Psychologist due to qualify within 6 months of starting the post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The North London Forensic Service is based on the Chase Farm Hospital site. It provides inpatient services to North Central London of both medium and low secure forensic care, including a women’s service and a service designated for male forensic patients with learning disabilities. Community services include a low secure unit, assertive outreach teams, criminal justice services including working with the Metropolitan and British Transport Police Forces and working in the area of fixated threat and stalking.&lt;/p&gt;\n&lt;p&gt;Due to several new developments within the service we are looking for enthusiastic clinical, forensic, or counselling psychologists to work within the secure inpatient service working across medium secure and low secure wards with some input to the learning disability and women’s services. There would also be opportunity to work within the Substance Misuse Team, a role which would give the successful applicant the opportunity to develop consultancy, supervision and service development skills.&lt;/p&gt;\n&lt;p&gt;The post holder would provide a range of assessments and interventions as part of a multidisciplinary team leading on the delivery of psychology within the team. The role includes direct clinical work as well as consultation and training with colleagues and other professionals. NLFS has a well-established group programme that includes a drug and alcohol service as well as the development of thinking skills and offender specific interventions. The ethos of the service is based on recovery and enablement with focus on individual service user needs.&lt;/p&gt;\n&lt;p&gt;The post requires a high level of written and verbal communication skills as well as an ability to engage well with both colleagues and service users. The role would also include supervision of more junior psychological staff as required.&lt;/p&gt;\n&lt;p&gt;The department is eclectic and a range of theoretical approaches are welcomed and provided, working individually, in groups and with families. There are also strong established links with the North London clinical psychology training universities, forensic psychology courses and regular teaching opportunities both in-house and at University College London and the University of Royal Holloway.&lt;/p&gt;\n&lt;p&gt;It is expected that the interview date will be on &lt;strong&gt;23rd of November 2020.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Filipa Alves-Costa&lt;/p&gt;\n&lt;p&gt;Job title: Forensic Psychologist&lt;/p&gt;\n&lt;p&gt;Email address: filipa.alves-costa@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 02082137730&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chase Farm Hospital, Enfield", "postalCode": "N15 3TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5807", "longitude": "-.092156"}}, "title": "Clinical/Forensic/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251164", "validThrough": "2020-11-15T23:59:59+0000"}