{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35500", "minValue": "35500", "unitText": "YEAR", "value": "£35,500 + Enhancements"}}, "datePosted": "2020-10-14T11:17:38+0100", "description": "&lt;p&gt;&lt;strong&gt;Senior Staff Nurse (RMN)- &lt;/strong&gt;&lt;strong&gt;Low Secure and Specialist Rehabilitation Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Northampton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: up to £35,500 plus enhancements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why St Andrew&#39;s Healthcare?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re a top 20 charity and the UK’s leading charity providing specialist NHS mental healthcare. Profits are re-invested into new services and new facilities, helping us to continue to do amazing work and transform mental healthcare.Our Integrated Practice Unit helps us to provide outstanding outcomes and will give you more opportunities to gain specialist experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our patients and your colleagues will expect you to live the St Andrew’s CARE values of Compassion, Accountability, Respect and Excellence every single day&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why the low secure and specialist rehabilitation service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our divisionis specially designed foradults over the age of 18 with Mental Health, Personality Disorders and challenging behaviour. These include patientswho might be a danger to themselves or others, or have committed serious offences. Thedivision provides treatment in both secure and specialist non-secure rehabilitation facilities. Our facilities, activities, therapies and services are designed with our patients, recovery and community reintegration in mind.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We believe every individual has strengths; our treatment programs build on these to help our service users recover. We want all patients in ourdivision to have the right care, treatment and support to be able to move into an environment of a lower security, and eventually return to the community.An exciting opportunity has arisen within thedivisionfora Senior Staff Nurse.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Some of the main duties of a Senior Staff Nurse are to:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plan, organise and deploy staff according to competencies and workload in order to meet patient needs.&lt;/li&gt;\n&lt;li&gt;Develop, implement, review and promote the importance of effective outcome focused care plans to meet individual preferences and needs, attending and contributing to ward rounds.&lt;/li&gt;\n&lt;li&gt;Effectively communicate with all MDT members, taking positive risks to manage the care environment and reduce the use of restrictive practices.&lt;/li&gt;\n&lt;li&gt;Build and monitor ongoing relationships with patients, their families and carers to encourage trust, whilst listening to and interpreting their needs and concerns.&lt;/li&gt;\n&lt;li&gt;Ensure all patient records, records of risk and interventions that have been taken, are up to date and accurate.&lt;/li&gt;\n&lt;li&gt;Use refection and supervision to learn from events and generate opportunities to improve patient outcomes.&lt;/li&gt;\n&lt;li&gt;Receive and provide clinical supervision.&lt;/li&gt;\n&lt;li&gt;Support the IPU to deliver specific outcome measures.&lt;/li&gt;\n&lt;li&gt;Complete required ward audits in line with the Clinical Governance strategy.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have in depth experience of working with challenging patients in a mental health service. Being a strong team player, you will be able to build and maintain effective relationships across clinical teams. You will have good interpersonal skills with the ability to develop rapport with patients. You will also be highly resilient, able to work under pressure and have good problem solving skills. You will have an active NMC registration and have completed your preceptorship.&lt;/p&gt;\n&lt;p&gt;There are many opportunities to progress within St Andrew’s healthcare so now is great time to join our organisation. We offer many excellent training and development opportunities for you to grow our career.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton", "postalCode": "NN1 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2382", "longitude": "-.873687"}}, "title": "Senior Staff Nurses RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225940", "validThrough": "2020-11-08T23:59:59+0000"}