{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-03T11:45:21+0000", "description": "&lt;p&gt;&lt;strong&gt;The Rotherham NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PHARMACY DEPARTMENT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Pharmacy Technician Medicines Optimisation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary Scale: A4C Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time: 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Rotherham NHS Foundation Trust is a combined acute and community Trust serving a population of over 260,000 with over 4,500 staff and income in excess of £250 million. Our vision is to be an outstanding Trust, delivering excellent care at home, in our community and in hospital. We will achieve this by working with patients, the public and partners to make a positive difference to the health and wellbeing of the people of Rotherham.  We are working successfully with partners across South Yorkshire and Bassetlaw as part of the Integrated Care System where we are leading and collaborating in several key work streams and service areas.&lt;/p&gt;\n&lt;p&gt;We set high standards for the services we deliver. We aim to be an outstanding Trust and we are enthusiastic about delivering excellent Health Care for our patients. We have high expectations of ourselves and others.&lt;/p&gt;\n&lt;p&gt;We embrace the importance of giving the highest possible quality of care for our patients. We also care for each other as colleagues and for the community, our resources, our environment and our future.&lt;/p&gt;\n&lt;p&gt;We value the importance of working together with patients, carers and families to ensure that we provide high quality patient centred care. We are committed to working with partners and stakeholders across Rotherham, South Yorkshire and Bassetlaw to develop sustainable services for the population we serve.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, motivated and committed registered pharmacy technician who is interested in working in the Pharmacy team as we participate in an intensive service improvement project within the pharmacy department.&lt;/p&gt;\n&lt;p&gt;The role of the successful candidate will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working with members of the multi-disciplinary team&lt;/li&gt;\n&lt;li&gt;Performing medicines reconciliation&lt;/li&gt;\n&lt;li&gt;Dispensing both on the wards and in the pharmacy department&lt;/li&gt;\n&lt;li&gt;Working closely with members of the medicines optimisation team&lt;/li&gt;\n&lt;li&gt;Ensuring medicines are in the right place at the right time&lt;/li&gt;\n&lt;li&gt;Educating nursing staff with regards to medicine matters on the ward&lt;/li&gt;\n&lt;li&gt;Training of junior members of the pharmacy department&lt;/li&gt;\n&lt;li&gt;Collecting data and auditing the results&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a full time position, working 37.5 hours a week, including weekend and bank holiday working on a rota basis. If you’re looking for a new challenge, or are just looking for a change we would be interested in talking to you. &lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact:&lt;/p&gt;\n&lt;p&gt;Jill Hudson on: jill.hudson3@nhs.net or Tel. No. 01709 424753&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121484.png", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121484"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Senior Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253786", "validThrough": "2020-11-13T23:59:59+0000"}