{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Dependant on Experience"}}, "datePosted": "2020-10-13T15:19:06+0100", "description": "&lt;p&gt;Senior Staff Nurse - Pre Assessment (Part-Time) - Cardiff and Vale&lt;/p&gt;\n&lt;p&gt;Do you want to work for a company that will truly invest in your nursing career? Do you want to work in an environment where you have the time to dedicate time &amp; care to your patients? Do you want to work for the UK’s leading not-for-profit healthcare provider? If so, Nuffield Health is looking for an exceptional Staff Nurse at their Cardiff and Vale Hospital. Get in touch or apply today! For a confidential chat, please email daen.fox@nuffieldhealth.com where we can answer any questions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Senior Staff Nurse- Pre Assessment in our Vale Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Role&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Whether you join us from the NHS or a private setting, we will give you the greatest opportunities to fulfil your passion for nursing and grow your career. You will have the chance to inspire others to deliver the highest standards of patient care. As a Senior Staff Nurse- Pre Assessment you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Lead by example and be an ambassador for the Nuffield Health way of caring.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Recognise talent, nurture junior members of staff and mentor them to be the best nurses they can be.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Use clinical skills and an empathetic approach to meet each individual patient’s need.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be part of a multidisciplinary team and work with some of the best clinical talent around to experience new practices, equipment and facilities.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide day-to-day supervision, including clinical supervision of junior nursing staff and students.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Work scheduling and rotas; involvement in recruitment, induction and performance reviews, training, development and mentoring.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Person&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To succeed as a Senior Staff Nurse- Pre Assessment you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Be NMC registered and be a qualified nurse.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Ideally have a qualification in teaching and assessment, together with some mentoring experience or a Level 2 or 3 management qualification.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have experience of multi-specialty surgical procedures, plus further professional training and experience. Preferably, a qualification in a specialist area.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have excellent clinical skills and experience in a mentoring role.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Benefits&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this, but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary - Competitive Dependant on Experience&lt;br /&gt;Location - Vale of Glamorgan&lt;br /&gt;Contract Type - Permanent&lt;/p&gt;\n&lt;p&gt;Weekly Hours - 22.5&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Vale of Glamorgan", "postalCode": "CF72 8JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5042", "longitude": "-3.36959"}}, "title": "Senior Staff Nurse (RGN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224851", "validThrough": "2020-11-12T23:59:59+0000"}