{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-27T10:31:46+0000", "description": "&lt;p&gt;An exciting, new opportunity has been created for an experienced LD clinician to take a lead on multi agency reviews. The role is based in the Integrated Disability Service (which is predominantly a social work team), and you will work closely with social work staff and colleagues in the Community Learning Disability Team to lead on a programme of reviews for people with complex needs. Your focus will be analysing information about provider services and working with others to complete reviews and improve outcomes for the people that we support. We aim to promote independence and lessen restriction wherever possible, which needs a balanced approach with managing risk. We also want to continue to improve on the health outcomes for the people we work with, and support providers to understand the support that people in their care need.&lt;/p&gt;\n&lt;p&gt;As well as planning the programme of reviews, you will also carry out many of the reviews in partnership with others and then collate changes to services and improvements that have been made for people. Experience of working with people with a learning disability is essential, ideally in a community setting. Knowledge of the Care Act 2014 and the Mental Capacity Act 2005 is also important however support and training can be offered as part of the role. What is essential is a genuine drive to improve outcomes for people with complex learning disabilities and to have a creative approach to how we can meet their needs and aspirations.&lt;/p&gt;\n&lt;p&gt;Given the focus on improving health outcomes and clinical risk assessment, you must be a registered LD nurse, OT or physiotherapist for this post.&lt;/p&gt;\n&lt;p&gt;This post is fixed term for 2 years due to funding&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:Judith Lambert, Senior Manager, Email:   judith.lambert1@nhs.net Tel:  0151 488 8091&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Millennium Centre, Leasowe", "postalCode": "CH46 1PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4159", "longitude": "-3.09343"}}, "title": "Learning Disability Review Co-Ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244028", "validThrough": "2020-11-10T23:59:59+0000"}