{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-11-04T11:00:34+0000", "description": "&lt;h1&gt;Healthcare Assistant, Waterhouse Ward - Band 2&lt;/h1&gt;\n&lt;p&gt;An exciting opportunity has risen on Waterhouse ward. Are you looking for a new challenge? Are you new to care and wanting to start your career in a rewarding and supportive environment? If yes, then Waterhouse is the place for you. &lt;/p&gt;\n&lt;p&gt;Hello my name is Niki, and I am proud to be the senior sister for Waterhouse ward. Waterhouse is a 24 bedded newly refurbished ward specialising in the complex care of older people. We are proud to have achieved a Gold rating for our dementia care and bronze for our ward accreditation. We are looking for full and/or part time band 2 healthcare assistant to join our patient centred, friendly and supportive team. We will strive to make you feel empowered, listened to and valued, whilst helping you expand your clinical knowledge and skills. &lt;/p&gt;\n&lt;p&gt;We welcome both new to care and those with experience to our team. Offering Mentor support in addition to the period of supernumerary working which will allow you to gain confidence and competence within your new place of work. The nursing team are encouraged and helped with continuing professional development. We also encourage our staff to become link nurses within an area of interest to them and provide designated time to allow this role to enhance practice within our area. &lt;/p&gt;\n&lt;p&gt;As a healthcare assistant you will be expected to care for patients with a variety of conditions, across the 24 hour period. Generally, you would be expected to work closely with a trained nurse with the delivery and evaluation of care for patient.  We aspire for all of our staff to display compassion, motivation and enthusiasm to be working on our ward. As ‘fresh eyes’ to the area, we always welcome challenges to existing practice with suggestions for innovative change. It is crucial that successful candidate is able to work effectively within a team, demonstrating consistent professionalism and focusing on patient centred care at all times. &lt;/p&gt;\n&lt;p&gt;We would welcome informal discussion or visit to the ward prior to interview. This can be arranged telephone – 01225 824097 or by email: Nichola.hartley@nhs.net . We look forward to hearing from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Healthcare Assistant, Waterhouse Ward - Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255491", "validThrough": "2020-11-18T23:59:59+0000"}