{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "66823", "minValue": "57990", "unitText": "YEAR", "value": "£57,990 - £66,823 pa incl HCAS"}}, "datePosted": "2020-11-02T09:46:06+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced, motivated and dynamic senior paediatric nurse to provide strategic, professional and operational nursing leadership at Epsom and St Helier NHS Trust. You will work closely with the Associate Director of Nursing for Neonates, Children and Young people to set and maintain standards of clinical excellence and continuously strive to improve quality and enhance the care for children and their families.&lt;/p&gt;\n&lt;p&gt;Epsom and St Helier NHS Trust has exciting times ahead and over the next few years you will be part of developing a new acute neonatal and paediatric facility in a purpose-built hospital, whilst maintaining services on district sites.&lt;/p&gt;\n&lt;p&gt;As a district general hospital, we provide Level 1 &amp; 2 neonatal services, general paediatric beds, children’s outpatients departments, paediatric assessment/minor investigations, paediatric ED, day surgery, community children’s nursing teams and specialist nursing roles and have good links with community providers and tertiary centres.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an experienced Paediatric nurse who is able to demonstrate success in delivering effective, safe and cost-efficient services in a complex healthcare environment, including financial, staff and workforce development, risk and change management.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom / Carshalton", "postalCode": "KT18 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.325", "longitude": "-.273383"}}, "title": "Head of Nursing - Neonates, Children &amp; Young People", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251462", "validThrough": "2020-11-16T23:59:59+0000"}