{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £23,023 - £29,608 pa"}}, "datePosted": "2020-11-02T14:31:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Intermediate Care Occupational Therapist – Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Band 5, Occupational Therapist&lt;/p&gt;\n&lt;p&gt;Intermediate Care, Blackpool&lt;/p&gt;\n&lt;p&gt;22.5 hours/week (including occasional weekends and bank holidays&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within Blackpool Teaching Hospitals NHS Foundation Trust, for a part time Band 5 Occupational Therapist to join our Intermediate Care team supporting the residents of Blackpool in our in-patient unit, at the Assessment &amp; Rehabilitation Centre (ARC). ARC is a 33 bedded rehabilitation unit, and consists of therapists, nurses and social services staff. The ARC is an integrated service between Blackpool Teaching Hospitals and Blackpool Council&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a flexible, enthusiastic and motivated Occupational Therapist, with an interest in rehabilitation, to work as part of our integrated team with health and social services staff to provide standardised and functional assessments and interventions for patients with a variety of long-term conditions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will be a registered Occupational Therapist, who will hold an extensive caseload, with responsibility for individualised assessments and treatment plans, including identifying appropriate equipment, and delegating to support staff as appropriate. The ability to effectively communicate, verbally and in writing, with colleagues, senior clinicians, carers and patients is essential. You must be both methodical and organised, with skills in working under pressure, both individually and as part of a wider team. You will have a close working relationship with a number of external services as well as internal colleagues. You will be expected to contribute to service development and will have a role in supervising and supporting other team members and students. This is a great opportunity to gain new skills and work in a dynamic and innovative team.&lt;/p&gt;\n&lt;p&gt;You will need to be able to travel around the local area to see patients in their own homes. To allow you to develop your knowledge and skills, we offer regular in-service training and supervision and we would expect the post holder to take an active role in both.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced DBS Disclosure.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca PearceJob titleClinical LeadEmail addressrebecca.pearce2@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;For more information or to arrange an informal visit, please contact Rebecca Pearce 01253 477855, rebecca.pearce2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ARC, Clifton Avenue, Blackpool, Blackpool", "postalCode": "FY4 4RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8018", "longitude": "-3.00291"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252435", "validThrough": "2020-11-16T23:59:59+0000"}