{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Agenda for change"}}, "datePosted": "2020-10-08T16:30:49+0100", "description": "&lt;p&gt;&lt;strong&gt;Candidate Highlights :- Band 2 Phlebotomist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Role :- Locum (Full time) | Duration :- 3 Months | Location :- Southampton&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Summary -&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The postholder will act as an experienced Phlebotomist who participates in the provision of a quality blood collection service.&lt;br /&gt;The postholder will be required to perform a range of venepuncture techniques in a variety of clinical settings and will work without direct supervision.&lt;br /&gt;The postholder is required to liaise with clinicians, other healthcare professionals including laboratory staff, with patients and their representatives and with commercial suppliers.&lt;br /&gt;Services are provided to hospital clinicians and general practioners (GP) and the postholder will be required to collect samples from inpatients, patients attending outpatient clinics or GP surgeries.&lt;/p&gt;\n&lt;p&gt;They will also be required to perform reception and telephone duties.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Join the bank for flexibility in how you work.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community, working in a location with all the benefits of coast and country living with the convenience of big city life?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt;We have a long term placement opportunities available for Band 2 Phlebotomist available at University Hospital Southampton NHS Foundation Trust, specifically providing the following:&lt;/p&gt;\n&lt;p&gt;Provide a phlebotomy service to patients who attend Outpatient clinics, are inpatients on wards, or direct access from General Practitioners in the community.&lt;br /&gt;Be competent in the selection of the appropriate sample bottle for all common laboratory investigations&lt;br /&gt;Ensure samples are correctly labelled for transportation to the laboratory in accordance with the Sample Labelling Policy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To receive all patients in a calm, courteous and reassuring manner and uphold the confidentiality, dignity and best customer care practice for all patients/clients at all times.&lt;br /&gt;To identify the correct patient against the blood request form/sample 360 and collect and accurately label blood samples from all patients according to Pathology Standard Operating Procedures (local policies).&lt;br /&gt;To visit wards regarding provision of a routine Phlebotomy services if and when required.&lt;br /&gt;To be familiar with all Standard Venesection and Cannulation Procedures, especially in relation to the control of infection (needle stick injury, disposal of sharps, blood borne viruses, using disposable gloves and tourniquets).&lt;/p&gt;\n&lt;p&gt;To ensure 100% compliance with Infection Control and Hand Hygiene Policy at all times.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;•Competitive Pay Rates- work this week, get paid next week!&lt;br /&gt;•First choice of placements at over 50 NHS Trusts in England&lt;br /&gt;•Dedicated consultants&lt;br /&gt;•Flexible working options&lt;br /&gt;•Free DBS and free training&lt;br /&gt;•Build holiday allowance&lt;br /&gt;•Support when you need it – 24/7 365 days– Call us anytime on 03330 144 370&lt;br /&gt;•Stakeholder pension scheme&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;br /&gt;We have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 6YD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.933", "longitude": "-1.4351"}}, "title": "Band 2 Phlebotomist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219140", "validThrough": "2020-12-31T23:59:59+0000"}