{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79890", "unitText": "YEAR", "value": "£79,890 - £107,668"}}, "datePosted": "2020-10-06T13:48:49+0100", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Adolescent/Adult Transition Consultant Service 15-25&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;1 year fixed term&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;This full-time post is an exciting opportunity for an ambitious psychiatrist to get involved in the development of modern Mental Health services to meet the needs of the local population. This new post will be key in the successful development of a transition service to enable achievement of the vision set out by the government in the green paper &#39;Transforming Children and Young People&#39;s Mental Health&#39; 2017 and NICE guidance. The Trust is working with an identified a mainland strategic partner to develop the service. The post-holder will be taking on an active role in the establishment of this service and the contract offers up to 2 PA service development time. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a Consultant Child and Adolescent Psychiatrist, or a Consultant Adult Psychiatrist, with enthusiasm to develop and lead clinical services for people with severe mental illness aged 16 to 20 years. This age range will represent the first stage in the Trust’s ambition to develop a more comprehensive transition service for young people aged up to 25 years. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a fixed term post initially but it is anticipated that this post will become part of the permanent team structure. Should the successful applicant have an interest in staying permanently he/she would be in an excellent position to apply. In order to be considered for the permanent position Specialist Registration will be required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This rewarding clinical and leadership role is situated in an environment that offers an excellent quality of life. The Isle of Wight is located off the south coast of England and has a population of 138,000. It is an area of outstanding beauty with miles of beautiful coastline with much to offer in the way of outdoor leisure pursuits and is a great place for family living. Connections to the mainland are frequent, fast and efficient, with a choice of crossings as foot passenger or by car ferry, from Southampton or Portsmouth, both of which are approximately 90 minutes by rail from London.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Isle of Wight NHS Trust is a unique NHS organisation, comprising inpatient medicine and surgery, community, ambulance, mental health and learning disability services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Single accommodation is available to rent in a modern residential block on the St Mary’s Hospital site. Family accommodation is subject to availability&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Other staff benefits include;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;· Discounted bus fares&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;· Staff discounts with local business&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;· Reduced travel costs on Wightlink and Red Funnel&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;· Cycle to Work and Home Computing Schemes&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must be eligible to hold full registration with the General Medical Council. Also applicants should be S12 approved and have Approved Clincian status, or be willing to work towards this. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more information please contact Dr Oliver Cramer, Clinical Director MH/LD on 01983 822099 ext 4264 or contact by e-mail on &lt;/span&gt;&lt;span&gt;Oliver.Cramer@iow.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isle of Wight NHS Trust - Medical Recruitment", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Consultant Psychiatrist Adolescent Transition Consultant Service 15-25", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214908", "validThrough": "2021-04-06T23:59:59+0100"}