{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £51,668 pro rata per annum"}}, "datePosted": "2020-10-26T12:00:54+0000", "description": "&lt;p&gt;Due to expansion we are looking for a Clinical Psychologist to join the Department of Healthcare Psychology at Airedale NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We welcome applications from current Band 7s who wish to work to Band 8a within this post or from those who are already working / able to work at Band 8a.&lt;/p&gt;\n&lt;p&gt;Applicants should have a genuine interest in the field of physical health conditions, post-qualification experience in delivering evidence-based psychological interventions, excellent clinical skills and an ability to provide supervision and consultation to multidisciplinary colleagues, junior staff and, depending on experience, clinical psychology doctorate trainees. The direct clinical work will focus on providing assessment, formulation and therapeutic interventions to individuals and groups of people experiencing psychological difficulties as a direct result of, or exacerbated by physical health conditions. Supervision will be provided by a senior Clinical Psychologist within the team.&lt;/p&gt;\n&lt;p&gt;The ability to work closely with multi-disciplinary professionals is essential and it would be desirable for applicants to have previous experience of working in or with an acute hospital. The service has strong links to the local clinical psychology training programme, providing training placements and facilitating doctoral research. Skills in research and service evaluation would be valuable.&lt;/p&gt;\n&lt;p&gt;The post-holder will be based at Airedale Hospital, which serves the Airedale, Wharfedale and Craven districts of Yorkshire, including the market towns of Ilkley, Keighley and Skipton.&lt;/p&gt;\n&lt;p&gt;Airedale NHS Foundation Trust is an acute services Trust based in Keighley, West Yorkshire. We are situated on the edge of the beautiful Yorkshire Dales and only 10 miles from the multicultural city of Bradford.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Rachael Brastock, Consultant Clinical Psychologist, Clinical &amp; Professional Lead for Medical &amp; Neuro Psychology 01535 292842&lt;/p&gt;\n&lt;p&gt;Laura Rowe, Operational Manager for Medical Psychology, 01535 294851 or laura.rowe9@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Airedale NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120636"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Airedale General Hospital, Steeton", "postalCode": "BD20 6TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.898", "longitude": "-1.9627"}}, "title": "Clinical Psychologist (Band 7 or 8a)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242312", "validThrough": "2020-11-18T23:59:59+0000"}