{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-05T16:07:27+0100", "description": "&lt;p&gt;Consultant Childs &amp; Adolescent Psychiatrists&lt;/p&gt;\n&lt;p&gt;North Bedfordshire CAMHS &lt;br /&gt;Emotional &amp; Behavioural Team&lt;br /&gt;10 PA&#39;s&lt;/p&gt;\n&lt;p&gt;A consultant child and adolescent psychiatrist is required for our two CAMHS Adolescent Emotional and Behavioural team (EBT), based in Bedford (split 50:50).&lt;/p&gt;\n&lt;p&gt;CAMHS are part of the ELFT Specialist Services directorate, providing assessment and treatment of young people with mental health disorders up to the age of 18 years.&lt;/p&gt;\n&lt;p&gt;All ELFT CAMH Services comprise a number of multidisciplinary teams based upon care pathways including:&lt;/p&gt;\n&lt;p&gt;- Adolescent Mental Health Team &lt;br /&gt;- Emotional &amp; Behavioural Team(s)&lt;br /&gt;- Neurodevelopmental Team (Learning Disability and Autism +/- ADHD)&lt;br /&gt;- LAC / Targeted Team&lt;/p&gt;\n&lt;p&gt;Our EBT provides assessment and treatment to young people (0-17 years) presenting with a range of significant and enduring mental health problems including psychosis, bipolar disorder, severe depression and OCD.&lt;/p&gt;\n&lt;p&gt;The post-holder will be expected to offer contributions to the wider clinical leadership, the multi-disciplinary team, to provide psychiatric assessment and treatment where clinically appropriate and case management of high risk presentations.&lt;/p&gt;\n&lt;p&gt;This vacancy has arisen following current staffing vacancies due to relocation and retirement; it is a substantive post.&lt;br /&gt;&lt;br /&gt;The Trust is a financially stable progressive mental health and community services trust with very strong clinical leadership at all levels of the organisation.&lt;/p&gt;\n&lt;p&gt;Following a recent CQC inspection the Trust was awarded an Outstanding rating. &lt;br /&gt;We have a focus on improving the experience of patients, carers and our staff. For the last two years we have been developing a special quality improvement programme that provides our clinical staff, patients and carers with skills to transform our services. We believe that our staff are the organisation&#39;s greatest asset and are the best agents for change. &lt;br /&gt;We encourage and will support applicants to undertake formal training in Quality Improvement methodology and take a lead on QI development within their respective services.&lt;/p&gt;\n&lt;p&gt;We have been rated as the best place to work in mental health in the country by the Health Service Journal and have received very high ratings in the national staff survey for staff being able to make a change at work. In 2015 we acquired mental health services in Luton and Bedfordshire.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Applications will be welcomed from candidates included in or eligible for the Specialist Register or within six months of obtaining their CCT.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;br /&gt;Dr Cathy Lavelle, Clinical Director Childrens Services &lt;br /&gt;cathy.lavelle@nhs.net&lt;/p&gt;\n&lt;p&gt;Jo Meehan, Associate Director CAMHS&lt;br /&gt;jo.meehan1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SS BED Emotional and Behavioural Team, BEDFORD", "postalCode": "MK40 3JT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1388", "longitude": "-.462907"}}, "title": "Consultant Psychiatrist – Child and Adolescent Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213510", "validThrough": "2020-11-29T23:59:59+0000"}