{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-27T16:45:27+0000", "description": "&lt;p&gt;This is an exciting opportunity for a motivated individual with experience in managing and improving day-to-day processes to join South Central and West Commissioning Support Unit Clinical Policy Implementation Service (CPIS) team.&lt;/p&gt;\n&lt;p&gt;This role will support the CPIS senior managers particularly the Head of Prior Approval and Assurance and their team to ensure that their work stream of programmes are planned and managed effectively and take the lead in assisting in the successful delivery of the high quality service that CPIS provides to SCW customers.&lt;/p&gt;\n&lt;p&gt;The post holder will be the lead manager for effective delivery of all day-to-day business processes associated with funding requests within the geography of the CSU. They will also provide an expert resource within the geography of the CSU, in relation to the Clinical Commissioning Policies, Individual Funding Requests and the associated processes.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have some knowledge of NHS Commissioning, in particular clinical policies and service improvement. The post requires great attention to detail, excellent organisational skills, the ability to work across professional groups and to develop relationships that will enable you to excel in this role. You will be working within a challenging new NHS environment and will need to be creative and proactive in your approach.&lt;/p&gt;\n&lt;p&gt;This role primarily supports the work of our Clinical Commissioning Group customers, as well as the Clinical Policy Implementation Service work across the SCW footprint. Access to a car or ability to travel between county-wide locations is essential.&lt;/p&gt;\n&lt;p&gt;Closing date: 11th November 2020&lt;/p&gt;\n&lt;p&gt;For further information, please contact Funmi Fajemisin, Clinical Policy Implementation Service Programme Lead or Marion Mason Interim Head of Prior Approval and Assurance NHS South, Central and West Commissioning Support Unit.&lt;/p&gt;\n&lt;p&gt;Tel: 07770 703454 Email: funmi.fajemisin1@nhs.net&lt;/p&gt;\n&lt;p&gt;Tel: 07825 023881 Email: marion.mason1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127935.jpg", "name": "South, Central and West Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "High Wycombe/Reading/Oxford/Eastleigh", "postalCode": "HP11 1AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6272", "longitude": "-.747682"}}, "title": "Prior Approval (PA) and Audit Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245466", "validThrough": "2020-11-11T23:59:59+0000"}