{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-05T14:16:31+0000", "description": "&lt;p&gt;An exciting opportunity has arisen at University Hospital Southampton NHS Foundation Trust (UHS) for an efficient and committed person to join the Pharmacy Clinical Trials Team as a Clinical Trial Administrator.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;The post holder will work in the busy pharmacy clinical trials team based at Southampton General Hospital. UHS is very research active, with over 250 clinical trials currently recruiting. We support both commercial and non-commercial NIHR adopted clinical trials within our dedicated department.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;The role involves collation of data for clinical trial activities performed in each study and creating invoices accordingly, creating credit notes as necessary and organising monitoring and close out visits as required by the trial sponsor. The post holder will also be involved in liaising with oncology/haematology staff over patient identification and treatment schedule, prescription requirements; ensuring sufficient IMP supplies are available as well as processing of deliveries.&lt;/p&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;Post holders must be numerate and literate, with good keyboard skills and a working knowledge of computer software packages. Candidates should possess a professional attitude to their work and have the ability to work flexibly in a busy environment. Ideally candidates will have proven experience within a clinical trials or an office environment. They will be required to work as part of a team as well as being able to use their initiative and prioritise their workload to meet deadlines.&lt;/p&gt;\n&lt;p&gt;We welcome interested applicants to contact the department for more information or an informal visit. Please contact Shirine Roberts on 023 8120 6799 or Liliana Cordeiro, Clinical Trial Team Manager on 023 8120 6433.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Wednesday, 27 November 2019.&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Shirine Roberts&lt;/p&gt;\n&lt;p&gt;Clinical Trial Administrator&lt;/p&gt;\n&lt;p&gt;Shirine.Roberts@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381206355&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Clinical Trial Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258082", "validThrough": "2020-11-19T23:59:59+0000"}