{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. (pro rata)"}}, "datePosted": "2020-11-03T16:31:01+0000", "description": "&lt;p&gt;We are Manchester Local Care Organisation - an exciting, new public sector organisation that is bringing together NHS community health services and social care services in the city. We’re driven by the aim of improving the health of local people in Manchester by working across organisational boundaries.&lt;/p&gt;\n&lt;p&gt;The first health and social care staff have been deployed to us from April 2018 and are now starting to work in new ways across the city. Our teams work as one in the neighbourhoods they serve – delivering and designing services in partnership with local people. We also provide key services that work across wider localities and city-wide. We believe that our pioneering approach will make a massive difference to the health of people in our city and we are looking for you to join our team and help us do this.&lt;/p&gt;\n&lt;p&gt;MFT is a major acute teaching Trust which is recognised as a centre of clinical excellence and provides a wide range of health services to the areas of South Manchester. &lt;br /&gt;&lt;br /&gt;As a registered General Nurse you will be required to work as part of our developing Neighbourhood team to lead and co-ordinate nursing teams to provide complex nursing care to adults in their own home and in a variety of settings within the community. You will work closely with the MDT (Social Workers, GP’s and Allied Health Professionals) to ensure that patient care is effectively co-ordinated, demonstrating a positive impact on our patients. &lt;br /&gt;&lt;br /&gt;&lt;br /&gt;You will enjoy the chance to develop new and existing clinical skills, as well as a range of training opportunities for personal development. We will be looking for proven leadership skills and the ability to work within and lead and develop more junior members of staff, as well as work autonomously. &lt;br /&gt;&lt;br /&gt;You must hold the Community Specialist Practitioner Qualification, and have the relevant community nursing experience as set out in the job description. You will be an excellent communicator and be willing to work in an integrated way with our partners in health and social care. With patient centred care as your main focus, you will deliver our values and nurse with pride, respect, empathy, consideration, compassion and dignity.&lt;br /&gt;&lt;br /&gt;The Community Nursing Day Service is a 7 day service with variable shift patterns between 8am-10pm. To join us, you will need to demonstrate a keen interest in the field of Community Nursing, together with a genuine desire to develop both the service and yourself. Due to the nature of the role, it is essential that you possess a full driving licence and have access to a car.&lt;br /&gt;&lt;br /&gt;In return for your commitment, we show our care for our staff through excellent development and progression opportunities. This includes a comprehensive induction programme and to enhance your skills in your speciality, we also offer a range of internal and external courses. &lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Faye Whelan - Team lead - 07816485665&lt;/p&gt;\n&lt;p&gt;Sue Berry Community Matron - 07989 958 404/susan.berry@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northenden Health Centre, Manchester", "postalCode": "M22 4DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4065", "longitude": "-2.26607"}}, "title": "Senior Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254801", "validThrough": "2020-11-17T23:59:59+0000"}