{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-27T17:00:47+0000", "description": "&lt;p&gt;A great opportunity has arisen for an enthusiastic and motivated physiotherapist to join our in-patient team as a specialist physiotherapist on a 6 month contract. Royal Lancaster Infirmary is part of the University of Morecambe Bay Trust, situated south of the Lake District with easy access to large cities such as Preston and Manchester via the M6.&lt;/p&gt;\n&lt;p&gt;This opportunity has been created to assist with the winter pressures and bed expansion on the acute site of RLI.&lt;/p&gt;\n&lt;p&gt;There will be opportunities to develop clinical skills and specialise within one of our in-patient/rehab/supported discharge rotations. Which include, surgery/ICU, medicine and orthopaedics. You will also participate in the weekend working and respiratory on call service.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the support and development of band 5 physiotherapists and supervision of technical instructors, with opportunities to develop your role as a clinical educator and taking responsibility for undergraduate students. You will also be encouraged and supported to engage in, and lead training as required. Good communication and team working skills are essential for this post.&lt;/p&gt;\n&lt;p&gt;You will be part of a very friendly and welcoming team who support each other and work very closely to provide the best care for our patients in the Morecambe Bay area.&lt;/p&gt;\n&lt;p&gt;Successful candidates newly appointed to the Trust will undergo a 6month probationary period, through which they will be supported to achieve all relevant competencies for this role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameElizabeth LawJob titleInpatient physiotherapy team managerEmail addresselizabeth.law@mbht.nhs.ukTelephone number01524 516177Additional contact information&lt;/p&gt;\n&lt;p&gt;Elizabeth Law, Physiotherapy Team Manager, Clinical Lead Orthopaedics, RLI elizabeth.law@mbht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01524 583359&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Lancaster Infirmary, Lancaster", "postalCode": "LA1 4RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0429", "longitude": "-2.79902"}}, "title": "Specialist Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245510", "validThrough": "2020-11-10T23:59:59+0000"}