{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pro rata"}}, "datePosted": "2020-10-27T10:46:05+0000", "description": "&lt;p&gt;Hours per week: 22.5 Hours&lt;/p&gt;\n&lt;p&gt;Contract Type: Permanent&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Principal Clinical Psychologist/ Neuropsychologist to join a thriving clinical and academic department at York Teaching Hospital.The post is within the Outpatient Neuropsychology Service based at The Old Chapel within the Department of Psychological Medicine.&lt;/p&gt;\n&lt;p&gt;The outpatient service receives referrals from neurology, Specialist Nurses within the Neurosciences Team and local GPs. We offer specialist neuropsychological assessment and therapeutic work across a wide range of neurological presentations, including functional neurological disorders. The role will include direct clinical work, consultation, research, teaching and other duties as the post requires. Supervision of Clinical Psychologists within the department is a key part of this role, and the post-holder will be taking a lead on supervising clinical and Senior Clinical Psychologists within the department.&lt;/p&gt;\n&lt;p&gt;We are pleased to be looking for an experienced, qualified Clinical Psychologist/Neuropsychologist who is motivated to work psychologically in medical settings, and is comfortable at both a team and individual client level to join our well established Psychological Medicine department.&lt;/p&gt;\n&lt;p&gt;Experience with clients in acute hospital settings is needed, along with familiarity of psychological assessment and formulation in health care, as well as planning and delivering neuropsychological interventions to clients FND presentations. It is important that the post holder has started their professional training in Clinical Neuropsychology or equivalent CPD and has worked for a minimum four years post qualification experience, ideally in an NHS health/neuro setting. A significant part of the role will be supporting the team with acute inpatient work and ongoing development of the neuropsychology care pathway will form part of the role. Experience in inpatient or community inpatient neuropsychology work is desirable and the ability to work effectively within an MDT setting is crucial for the role.&lt;/p&gt;\n&lt;p&gt;The Department of Psychological Medicine is academically ambitious with strong links to the regional clinical training programme and schools of psychology, medicine and healthcare at the University of Hull. There are opportunities for research, service-evaluation, audit, teaching and delivering supervision.&lt;/p&gt;\n&lt;p&gt;York is a lovely city to live and work with many fine attractions and shops within walking distance of the department. &lt;em&gt;But&lt;/em&gt; i&lt;em&gt;t&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We very much look forward to meeting potential candidates and we will warmly welcome the successful individual to our team.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For more information or informal enquiries, please contact Mrs Ruth Bulmer or Ms Jo Barker (Admin) or for clinical enquiries Dr Stephen Evans, (Lead Consultant Psychologist for Neuropsychology)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note, interviews will be held on Tuesday 1st December 2020 remotely via Webex due to the ongoing Covid 19 crisis.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Name: Dr Stephen Evans - Consultnat Clinical Neuropsychologist&lt;/p&gt;\n&lt;p&gt;Email address: stephen.evans11@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: (01904) 725353&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Additional contact information&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Ruth Bulmer - Admin Manager: (01904) 725353&lt;/p&gt;\n&lt;p&gt;Jo Barker - PA to Head of Department: ( 01904) 725353&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO30 7BY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9681", "longitude": "-1.08561"}}, "title": "Principal Clinical Psychologist: Neuropsychology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244076", "validThrough": "2020-11-16T23:59:59+0000"}