{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38693", "minValue": "38693", "unitText": "YEAR", "value": "£38,693 p.a excl. LZ"}}, "datePosted": "2020-11-05T11:16:27+0000", "description": "&lt;p&gt;&lt;strong&gt;GUY’S AND ST. THOMAS’ HOSPITAL NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Integrated Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FY3 in Integrated Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nodal Point – 3 - £38,693 p.a excl. LZ&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time – 40 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term – 12 months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Applications are invited from individuals at FY3+ or equivalent with full GMC registration for this unique roles in our out-of-programme training rotations working across integrated care pathways in Lambeth and Southwark. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This clinical post rotates 6 months in each service designed to provide experience of practicing medicine within the hospital @ home team and the palliative care team. The hospital @ home team is a multidisciplinary team providing acute and semi-acute care to patients in their own home. The Palliative Care team provides specialist palliative care services throughout the hospital and community in Lambeth and Southwark.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This post is ideal for a doctor unsure as to which speciality path they wish to enter as they provide experience across general medicine, elderly care and palliative care in the hospital and community. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The rotations started in 2017 and have been highly successful with previous ICFs going on to specialist training in Medicine, GP, Radiology and Public Health. All posts involve clinical duties but have time for individuals to do teaching, quality improvement projects and research.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Guy’s and St Thomas’ NHS Foundation Trust is made up of two of London’s best known teaching hospitals. &lt;/span&gt;&lt;span&gt;&lt;span&gt;The Integrated Care Strategic Business Unit consists two directorates of Integrated Therapies and Medicine and Integrated Local Services. Palliative Care and Ageing and Health are part of these and work across services provided by both directorates.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Participation in quality improvement programmes is actively encouraged and all ICFs are expected to participate in at least one project.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;There is a monthly training programme specifically for the ICF programme and a wealth of departmental and directorate educational meetings.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The role will participate in an on call rota currently without night shifts. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This post provides excellent palliative care and general and geriatrics community working experience. They are ideal for those seeking to determine whether they wish to follow a career in General Medicine, Acute Medicine, Geriatric Medicine, Palliative Care and General Practice.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information and to apply online, please go to our website quoting reference number &lt;strong&gt;MED2217.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 18th November 2020, by midnight. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an organisation we are committed to developing our services in ways that best suit the needs of our patients. This means that some staff groups will increasingly be asked to work a more flexible shift pattern so that we can offer services in the evenings or at weekends.&lt;/p&gt;\n&lt;p&gt;Creating a world-leading Academic Health Sciences Centre.&lt;/p&gt;\n&lt;p&gt;All our vacancies can be viewed on our website.&lt;/p&gt;\n&lt;p&gt;Our excellent benefits include final salary pension scheme. Please visit our website to find out more.&lt;/p&gt;\n&lt;p&gt;Equality of opportunity is our Policy. The Trust provides health services to a diverse community.&lt;/p&gt;\n&lt;p&gt;Please note that successful completion of the International English Language Testing System (IELTS) is our accepted minimum language requirement.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Rebekah Schiff and Dr Vandana VoraAdditional contact information&lt;/p&gt;\n&lt;p&gt;For an informal discussion, please contact Dr Rebekah Schiff Rebekah.Schiff@gstt.nhs.uk ICF programme lead and Dr Vandana Vora Vandana.vora@gstt.nhs.uk Medical lead for Palliative Care.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s and St Thomas&#39; NHS Foundation Trust, Guy&#39;s and St Thomas&#39; NHS Foundation Trust", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "FY3 in Integrated Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257418", "validThrough": "2020-11-18T23:59:59+0000"}