{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum excluding Fringe"}}, "datePosted": "2020-10-30T16:16:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Dartford and Gravesham NHS Trust&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Accident and Emergency Directorate&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Consultant in Emergency Medicine&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;From-£82,096 to £110,683 per annum&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Permanent&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Full Time - 10 PA&#39;s&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited for an experienced specialist for the post of Consultant in Emergency Medicine to join our high performing Accident and Emergency Department&lt;strong&gt;. Successful applicant, experience permitting, may also be invited for an interview for the Clinical Director of Emergency Department upon the commencement of the post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a team of hard working, dedicated and highly skilled professionals in one of the busiest yet highest performing departments in Kent, seeing more than 100,000 patients per year. Over the past 3 years there has been a modernisation process with a dedicated Clinical Decision Unit and an extension of the minors waiting area to improve patient experience. The introduction of a new Primary Care Streaming Service has led to further improvement in patient flow. Our most recent Care Quality Commission inspection noted that the Trust has a culture of caring and that staff in ED are caring and responsive about patients’ needs.&lt;/p&gt;\n&lt;p&gt;We’re proud of our education and training support to medical staff. There are regular opportunities to access a well-developed monthly CPD programme, receive regular structured supervision and be fully supported in the appraisal and revalidation process. All doctors within the Trust receive weekly protected CPD with flexible rotas and study leave to permit attendance at day release training schemes, and are encouraged and supported to get involved in clinical audit and research.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to ensuring that flexible working policies are in place to promote a healthy work life balance. This enables the Trust to consider and support applications for flexible working such as term time, part time and job sharing.&lt;/p&gt;\n&lt;p&gt;Darent Valley Hospital is a busy, expanding district general hospital with excellent transport links to central London and Kent. Our ED offers a range of different facilities, including a paediatric ED, Ambulatory Emergency Care and GP streaming hub.&lt;/p&gt;\n&lt;p&gt;This post is offered on a full-time basis. The candidate should possess a CCT (or be within three months of obtaining), and should be listed on the Specialist Register at the time of taking up the post. Active participation in Research, Audit and Teaching is encouraged and supported. The candidate will need to demonstrate professional excellence and ability to deliver effective care.&lt;/p&gt;\n&lt;p&gt;The Trust has a strong commitment to equality and diversity. We aim to employ a representative workforce that reflects the communities we serve. &#39;Positive action&#39; initiatives can be used whenever an under-represented group is identified. Our workforce is currently under-represented by women consultants and we welcome female applications for this post.&lt;/p&gt;\n&lt;p&gt;For enquiries, please contact Dr Jonathan Kwan, Divisional Medical Director on: +44 7502270032 or via email: jonathankwan@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 06th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AAC Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Jonathan KwanJob titleDivisional Medical DirectorEmail addressjonathankwan@nhs.netTelephone number07502270032Additional contact information&lt;/p&gt;\n&lt;p&gt;For enquiries, please contact Dr Jonathan Kwan, Divisional Medical Director on: +44 7502270032 or via email: jonathankwan@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121400.png", "name": "Dartford and Gravesham NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dartford and Gravesham NHS trust, Dartford", "postalCode": "DA2 8DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4351", "longitude": ".25819"}}, "title": "Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250912", "validThrough": "2020-12-06T23:59:59+0000"}