{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35301", "minValue": "35301", "unitText": "YEAR", "value": "£18,005 per annum (Annex 21)"}}, "datePosted": "2020-10-26T13:17:16+0000", "description": "&lt;p&gt;Health Education England (HEE) has a fantastic opportunity for a motivated, ambitious and responsible individual to join our South West Business Team as a Business Support Apprentice in our Plymouth office.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note;&lt;/strong&gt; due to COVID-19 restrictions, all staff are currently working from home but are supplied with the relevant equipment to cover the role.&lt;/p&gt;\n&lt;p&gt;This apprentice role is suitable for those that have already achieved a Level 2 qualification or equivalent, E.G. NVQ 2 and would like to further develop their skills and career in business administration.&lt;/p&gt;\n&lt;p&gt;The apprenticeship is a fixed term agreement lasting 12-18 months in duration, working towards a Level 3 Diploma in Business Administration through Paragon Skills.&lt;/p&gt;\n&lt;p&gt;This post will give the successful applicant an opportunity to learn the skills associated with business administration, whilst studying for a nationally recognised qualification which may be a gateway to further career opportunities.&lt;/p&gt;\n&lt;p&gt;The post-holder will be flexible, capable and self-motivated, with a ‘can-do’ attitude and the ability to deal with rapidly changing priorities. We need a person who is efficient, well-organised, and able to respond positively to a fast moving and dynamic environment.&lt;/p&gt;\n&lt;p&gt;The post holder will work on multiple projects, providing administrative support to various teams, managers and colleagues with confidence, requiring excellent verbal and written communication skills. The day to day work will include diary management, organising events, data entry, minute taking, updating action notes and other documents.&lt;/p&gt;\n&lt;p&gt;The recruitment process will be held online via Microsoft Teams and applicants invited to interview will also be required to complete a short assessment task. Therefore, it is advisable not to use mobile devices. We recommend that applicants have access to suitable IT equipment that includes a webcam.&lt;/p&gt;\n&lt;p&gt;To be eligible to apply you must be at least 16 years of age and not in full-time education (when commencing in post). Applicants should have lived in the UK or EU for the last 3 years and cannot already hold a Business Administration qualification at level 3 or above or any qualifications higher than a level 4.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name: Evette May&lt;/p&gt;\n&lt;p&gt;Job title: Business Support Officer&lt;/p&gt;\n&lt;p&gt;Email address: evette.may@hee.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plumer House, Plymouth", "postalCode": "PL6 5HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4081", "longitude": "-4.1315"}}, "title": "Business Support Administrator (Apprentice)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242640", "validThrough": "2020-11-09T23:59:59+0000"}