{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T15:30:24+0000", "description": "&lt;p&gt;NHS Northamptonshire CCG is seeking a highly organised and focused individual to join our Corporate Affairs Team, supporting the Corporate Committees for the organisation. We are looking for someone who can hit the ground running with in-depth knowledge of corporate governance and a proven track record of servicing Board level committees.&lt;/p&gt;\n&lt;p&gt;The post holder will be part of an experienced and professional Board Secretariat team, as part of the wider Corporate Affairs Team, but will be expected to be self-motivated and able to thrive in an environment of competing demands, with excellent attention to detail. Advanced keyboard and computer skills as well as good interpersonal and communication skills are essential.&lt;br /&gt; &lt;br /&gt; This role is primarily focused on providing robust administrative support to the Board’s Committees, in order to ensure the smooth functioning of its activities in accordance with the CCG’s Corporate Governance Framework. Reporting to the Board Secretary and working closely with the relevant Executive Director Leads and independent Lay Member Committee Chairs, the role will entail providing administrative support for the servicing of the Board’s Committees including the development of committee work programmes.&lt;/p&gt;\n&lt;p&gt;This is a challenging role which will include preparing, collating and disseminating of committee papers, as well as taking and transcribing formal minutes. The ability to maintain confidentiality and demonstrate tact and diplomacy at all times is essential. The post holder will also demonstrate commitment to the team by working flexibly to cover annual leave, sickness and training.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Interviews for the role will take place on Monday 23 November 2020. Please note that the interviews will be held virtually over Microsoft Teams.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you would like an informal discussion about the post please contact Sarah McKenzie, Board Secretary via email Sarah.McKenzie8@nhs.net to arrange a mutually convenient time.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128417.png", "name": "NHS Northamptonshire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128417"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Francis Crick House, Northampton", "postalCode": "NN3 6BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2768", "longitude": "-.872766"}}, "title": "Assistant Board Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258333", "validThrough": "2020-11-16T23:59:59+0000"}