{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-26T09:31:09+0000", "description": "&lt;p&gt;University Hospitals of Morecambe Bay NHS Foundation Trust covers a large geographic area which encompasses the Furness peninsula, the city of Lancaster and the Lake District. We provide a comprehensive range of acute and support hospital services to a population of 350,000 based around Morecambe Bay. One of the largest employers in the area, we have approximately 6,000 staff working across five sites; Furness General Hospital (Barrow in Furness), Royal Lancaster Infirmary, Westmorland General Hospital (Kendal), Ulverston Community Health Centre and Queen Victoria Centre (Morecambe). By joining us you will be part of a progressive team committed to diversity, excellence and achievement&lt;/p&gt;\n&lt;p&gt;Ward 20 comprises of 24 beds and is supported by a varied multidisciplinary team. Our patients experience a variety of acute and long term conditions and our staff are professional, committed, caring and friendly.&lt;/p&gt;\n&lt;p&gt;Are you interested? Read on....&lt;/p&gt;\n&lt;p&gt;We are recruiting for a secondment opportunity. Therefore we need an enthusiastic, highly motivated nurse, to join our dedicated, forward thinking professional team to lead and develop our service moving into the future.&lt;/p&gt;\n&lt;p&gt;This is your opportunity to learn and develop band 6 clinical leader skills amongst a supportive team.&lt;/p&gt;\n&lt;p&gt;You will be reliable, flexible, motivated, have excellent clinical and leadership skills, a commitment to ongoing learning and development, to build confidence within this role with a commitment to delivering high quality care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJane WattsJob titleWard ManagerEmail addressjane.watts@mbht.nhs.ukTelephone number01524583458Additional contact information&lt;/p&gt;\n&lt;p&gt;Jane Watts - Ward Manager 01524583458&lt;/p&gt;\n&lt;p&gt;Hayley Reading - Matron for Medicine 01524516341&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Lancaster Infirmary, Lancaster", "postalCode": "LA1 4RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0429", "longitude": "-2.79902"}}, "title": "Clinical Leader Ward 20", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241866", "validThrough": "2020-11-09T23:59:59+0000"}