{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 Pa Inc"}}, "datePosted": "2020-10-23T16:46:13+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Band 8a Lead Research Nurse and CTU Manager, White Cell Haematology Clinical Trials Unit&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an opportunity for an experienced, dynamic and self-motivated senior research nurse to join the White Cell CTU Team within the Surgery, Cancer and Cardiovascular Division at Imperial College Healthcare NHS Trust. You will lead a team of research delivery staff, who support a portfolio of mainly complex commercial studies but also academic studies.&lt;/p&gt;\n&lt;p&gt;You will be a key part of the Senior Divisional Research Management team. You will lead, in conjunction with the Unit’s Director of Research and the Divisional Research Manager, on various initiatives to help deliver an ambitious research strategy for the growth and development of the unit, with a vision to make the unit one of a kind, noteworthy of global attention. You will also be responsible for the leadership and management of the CTUs Team – this includes Research Nurses, CTU Operational Manager, Data Manager’s, Set Up staff and Finance Assistants.&lt;/p&gt;\n&lt;p&gt;You will lead on the active integration of research into clinical services within the haematology directorate, actively engaging in Divisional nursing initiatives to enhance communication and collaboration between clinical research staff and clinical staff.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be an experienced research nurse, who will operate a visible and inspirational leadership model, with excellent influencing and interpersonal skills. The ability to manage, motivate and develop staff is crucial, recognising and responding to factors which impinge upon staff morale and delivery of research. The post holder will be politically astute and able to nurture and maintain close working relationships with PIs, engaging clinicians and clinical areas in research and ensuring the appreciation of your team. The role is also patient facing and you will have your own caseload; the ability to advise on and be proficient in clinical skills relevant to research practice are essential. Experience of white cell haematology is essential and ability to delivery chemotherapy is desirable.&lt;/p&gt;\n&lt;p&gt;All applicants are advised to speak with the unit’s Director of Research (Dragana Milojkovic dragana.milojkovic@nhs.net) to ensure they fully understand the scope and remit of the role, team and unit’s ambitions.&lt;/p&gt;\n&lt;p&gt;We offer a flexible approach to working hours to meet the needs of the individual and the service. Please talk to us at interview about the flexibility you may need.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Name: &lt;/strong&gt;&lt;/em&gt;Dragana Milojkovic and Donna Copeland&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Email: &lt;/strong&gt;&lt;/em&gt;dragana.milojkovic@nhs.net / donna.copeland@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hammersmith Hospital, London", "postalCode": "W12 0HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5165", "longitude": "-.236635"}}, "title": "Band 8 Lead Research Nurse and CTU Manager, White Cell Haematology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241363", "validThrough": "2020-11-06T23:59:59+0000"}