{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Per annum"}}, "datePosted": "2020-10-29T16:30:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Workforce Strategy and Planning Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SALARY BAND: 8a&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Workforce Strategy and Planning team in Health Education and Improvement Wales is growing and an opportunity has arisen for an experienced Learning and Development professional to join us to lead and develop a new approach to the development of workforce planning skills and knowledge across NHS Wales. HEIW oversees the strategic development of the health workforce in Wales, including workforce planning, leadership development and education commissioning. It sits alongside existing Health Boards and Trusts to be the eleventh member of the NHS Wales family.&lt;/p&gt;\n&lt;p&gt;This role will be pivotal in improving workforce planning skills and knowledge across Wales by providing easy access to a range of learning and development resources and opportunities for managers and leaders. You will scope and devise plans to develop learning and development resources that are accessible and tailored to the different needs of people. Using your experience in the development of training and learning opportunities, you will oversee the build and delivery of innovative, virtual and on line learning and development targeted at different learning levels, staff groups and sectors.&lt;/p&gt;\n&lt;p&gt;The successful candidate will also work with the Head of Workforce Strategy and Planning on a number of workforce strategy and planning programmes of work, providing highly specialist Workforce advice and input into national meetings and discussions. The successful candidate will have the opportunity to work at a national level and contribute to the delivery of the Workforce Strategy for Health and Social Care.&lt;/p&gt;\n&lt;p&gt;You will have experience of developing competence based learning and development and the ability to engage with a wide range of stakeholders to elicit their requirements and influence direction. You will also be able to research, scope and identify best approaches that will have the greatest impact on increasing the skills, knowledge and competence in workforce planning across both health and social care.&lt;/p&gt;\n&lt;p&gt;To apply please complete the application form on NHS Jobs which must include evidence to support the required behaviours set out in the person specification.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal discussion please contact – Clem Price, Head of Workforce Strategy &amp; Planning (Clem.Price@wales.nhs.uk)&lt;/p&gt;\n&lt;p&gt;Closing date: 12th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews will be held on: 23rd November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135014.jpg", "name": "Health Education and Improvement Wales (HEIW)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ty Dysgu, Cardiff", "postalCode": "CF157QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.563", "longitude": "-3.27209"}}, "title": "Workforce Strategy &amp; Planning Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249095", "validThrough": "2020-11-12T23:59:59+0000"}