{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum/pro rata"}}, "datePosted": "2020-11-03T11:46:16+0000", "description": "&lt;p&gt;Staff Nurse&lt;/p&gt;\n&lt;p&gt;Division: Unplanned &amp; Integrated Care&lt;/p&gt;\n&lt;p&gt;Care Group: Therapies &amp; Older Persons&lt;/p&gt;\n&lt;p&gt;Band: 5&lt;/p&gt;\n&lt;p&gt;Salary: £24,907 - £30,615 per annum/pro rata&lt;/p&gt;\n&lt;p&gt;Interview date: Virtual Assessment - Tuesday 1st December 2020&lt;/p&gt;\n&lt;p&gt;                         Interview - Tuesday 15th December 2020&lt;/p&gt;\n&lt;p&gt;We are recruiting Staff Nurses for our Frailty services who share our ambition and vision to deliver the &lt;em&gt;&lt;strong&gt;Best of Care by the Best People&lt;/strong&gt;&lt;/em&gt; and have the drive to take us forward, by ensuring that the Trust continues to be the first choice for patients and our staff.&lt;/p&gt;\n&lt;p&gt;Medway’s Frailty Programme is a large, busy and a highly supportive place to work. As a Staff Nurse you will be expected to ensure that patients’ receive high quality clinical care and a good patient experience, having regard for their customs, religious beliefs and principles.&lt;/p&gt;\n&lt;p&gt;Within this role we will offer you the opportunity to undertake our fantastic Preceptorship Programme. This programme has been designed to support you through training to progress to you to a Band 6 within the Unplanned &amp; Integrated Care Directorate.&lt;/p&gt;\n&lt;p&gt;Rotations within the department is actively encouraged, we are able to offer opportunities to rotate through other modalities such Ambulatory Care, Care of the Elderly (&lt;strong&gt;Byron, Milton &amp; Tennyson Wards&lt;/strong&gt;) and Stroke.&lt;/p&gt;\n&lt;p&gt;There are also opportunities to work with our Acute Frailty Service to help improve emergency care for frail elderly patients. The service aims to ensure frail elderly patients are seen by a specialist team, including a geriatric consultant and specialist nurse, upon their arrival.&lt;/p&gt;\n&lt;p&gt;Our frailty service is a prime example of how Medway NHS Foundation Trust is taking proactive steps to improve patient care by minimising the number of different doctors that patients see.&lt;/p&gt;\n&lt;p&gt;The department has a good working relationship with our colleagues across the Trust, our patients and importantly their friends and families. Our ward staff work closely with the end of life care team to ensure that we are able to offer excellent advanced care planning. We pride ourselves in delivery excellent patient care.&lt;/p&gt;\n&lt;p&gt;Within the department we are committed to treating all our patients with compassion dignity and respect.&lt;/p&gt;\n&lt;p&gt;Medway NHS Foundation Trust has as joined the ‘End PJ Paralysis’ initiative (#endpjparalysis). Our aim is to get our patients up, dressed and moving while they are in hospital so we can prevent the problems caused by staying in bed too long and, hopefully, get them home quicker.&lt;/p&gt;\n&lt;p&gt;The Trust and its employees are all committed to creating and maintaining a fair and supportive working environment and culture.&lt;/p&gt;\n&lt;p&gt;As part of our ongoing commitment to professional development we are offering a number of apprenticeships and training opportunities in Leadership and Management, Business Services, Finance, Accounting and HR, Clinical Support Work, Research and Innovation, Nursing Associate and Assistant Practitioner alongside our in-house comprehensive clinical pathways.&lt;/p&gt;\n&lt;p&gt;Our hope is that our education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the protection of children, young people, their families and vulnerable adults accessing its services. Promoting the message that “safeguarding is everyone’s business” is vital to ensure our patients are protected and safe from abuse. To this end you must comply with Trust’s and the Kent and Medway Safeguarding Board’s policies on safeguarding children, young people and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nursing Workforce and Education - medwayft.nursingworkforcemft@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Staff Nurse - Therapies &amp; Older Persons", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253792", "validThrough": "2020-11-09T23:59:59+0000"}