{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-05T13:01:51+0000", "description": "&lt;p&gt;Mental Health Practitioner – Home Treatment Team&lt;/p&gt;\n&lt;p&gt;Band 6&lt;/p&gt;\n&lt;p&gt;Permanent&lt;/p&gt;\n&lt;p&gt;Base: Chester, Congleton or Wirral&lt;/p&gt;\n&lt;p&gt;If you relish a challenge, are caring and compassionate and have a passion to help others or simply fancy a fresh start, then we need people who share our values and vision to join us as Mental Health Practitioners in our Community Home Treatment Teams.&lt;/p&gt;\n&lt;p&gt;Cheshire &amp; Wirral Partnership NHS Foundation Trust (CWP) are looking to develop and strengthen our existing three Home Treatment Teams in the Wirral, Chester and Congleton areas by expanding our provision of crisis mental health care for adults and children.&lt;/p&gt;\n&lt;p&gt;CWP recognises our Home Treatment and Crisis service provision as a pivotal part of the acute care pathway for people with acute mental health difficulties, and is investing substantially in them to improve care. Your experience and enthusiasm could be just what we need to expand our teams.&lt;/p&gt;\n&lt;p&gt;Work includes assessing people in a mental health crisis, liaising with other services, arranging appropriate care, supporting people intensively at home and handing them over to appropriate services once they are recovered. The work is varied and sometimes intense, but always rewarding and well-supported.&lt;/p&gt;\n&lt;p&gt;Practitioners will rotate into Liaison, Street Triage, Crisis Line and Home Treatment Team.&lt;/p&gt;\n&lt;p&gt;The Teams provide 24 hour access to mental health services for people who identify, or have been identified as being in a mental health crisis. It is an all age service. The service will be delivered by three teams in Wirral, Chester and Congleton. We are offering an opportunity for 3 mental health practitioners to join each team who have a passion and enthusiasm to develop and to work in partnership with other senior clinicians to lead these teams.&lt;/p&gt;\n&lt;p&gt;You will have demonstrable post registration experience and have the ability to assess risk and make decisions autonomously as well as work as part of a multi-disciplinary team over a 24 hours on a 7 day a week rota.&lt;/p&gt;\n&lt;p&gt;In return we will provide the necessary support, training and supervision to ensure your development within your role.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be located within one team. Each team&#39;s main base will be discussed at interview however the post holder will be expected to travel within the communities served by the individual team.&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Jane Tyrer, Crisis/Home Treatment Manager Central and East number: 01260 292901 or West number: 01244 397497&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chester/Congleton/Wirral, Chester/Congleton/Wirral", "postalCode": "CH2 1BQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2118", "longitude": "-2.89903"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257777", "validThrough": "2020-11-19T23:59:59+0000"}