{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-02T10:57:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Regional Deputy Head of Infection Prevention and Control (IPC)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Secondment opportunity until 31st March 2022&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated individual to join our nursing and quality teams to provide delivery of a highly functioning Infection Prevention and Control team across the North East and Yorkshire regions.&lt;/p&gt;\n&lt;p&gt;As the Regional Deputy Head of IPC Lead (North East and Yorkshire), you will work as part of a dynamic team in delivering a highly effective service supporting the delivery of quality improvement, surveillance and assurance to support system transformation in relation to IPC.&lt;/p&gt;\n&lt;p&gt;As the Regional Deputy Head of IPC you will be expected to work effectively and autonomously with all stakeholders within the organisation and externally with system leaders and demonstrate highly effective leadership skills.&lt;/p&gt;\n&lt;p&gt;As Regional Deputy Head of IPC you will be part of the Nursing team across the North East and Yorkshire Region and working to the Head of Infection Prevention and Control. You will be a member of the Regional leadership team and accountable through the Clinical Quality Director to the Regional Chief Nurses and will help steer the IPC assurance and improvement agenda. &lt;br /&gt;&lt;br /&gt;The Regional Deputy Head of IPC will support the leadership and development of IPC support in organisations and systems across North East and Yorkshire, working with the regional and national team.&lt;/p&gt;\n&lt;p&gt;You will be an experienced IPC professional, with a track record of leading excellence in quality, assurance and improvement. Key is the relentless pursuit of excellence in the quality of healthcare delivery, with patient safety and patient experience at its heart. This role represents an outstanding opportunity to join our regional team working closely across the local systems and partnerships and contribute to our future success.&lt;/p&gt;\n&lt;p&gt;Key priorities of the role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the developing regional IPC strategy ensuring alignment across systems.&lt;/li&gt;\n&lt;li&gt;Actively seek out opportunity to identify and promote continuous infection prevention improvements across the region.&lt;/li&gt;\n&lt;li&gt;To organise, lead and contribute to new health care initiatives in the management of healthcare associated infections.&lt;/li&gt;\n&lt;li&gt;Engage with key PHE regional and national colleagues to inform delivery of the IPC agenda&lt;/li&gt;\n&lt;li&gt;Support development of IPC capacity and capability across system partners&lt;/li&gt;\n&lt;li&gt;Support the identification and sharing of best practice in infection prevention and control to support improvements across the systems&lt;/li&gt;\n&lt;li&gt;Provide expertise of best practice methodologies, regulatory requirements, policy imperatives, innovation and technological developments and stakeholders knowledge.&lt;/li&gt;\n&lt;li&gt;Work with system leads to drive the strategy for quality standards to support system transformation in IPC&lt;/li&gt;\n&lt;li&gt;Support organisational improvement and uptake of initiatives that support excellence in IPC&lt;/li&gt;\n&lt;li&gt;Support the development of and communicate the vision for the role of innovation, and the development of strategy and operational policies to support this vision.&lt;/li&gt;\n&lt;li&gt;Identify examples of national and international best practice to ensure that systems are aware of relevant innovations in healthcare and IPC practice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that the reason for the secondment/FTC of your contract is because we have funding agreed until 2022.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;David Charlesworth&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Head of Infection Prevention and Control - North East and Yorkshire region&lt;/p&gt;\n&lt;p&gt;NHS England and NHS Improvement&lt;/p&gt;\n&lt;p&gt;T: 07714846150&lt;/p&gt;\n&lt;p&gt;E: David.Charlesworth@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Emma Nunez&lt;/p&gt;\n&lt;p&gt;Clinical Quality Director&lt;/p&gt;\n&lt;p&gt;NHS England &amp; NHS Improvement, North East and Yorkshire&lt;/p&gt;\n&lt;p&gt;Mobile: 07900715504&lt;/p&gt;\n&lt;p&gt;Emma.nunez@nhs.net&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS2 7UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Regional Deputy Head of Infection Prevention and Control (IPC)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251665", "validThrough": "2020-11-09T23:59:59+0000"}