{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890"}}, "datePosted": "2020-10-27T15:31:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5/6 Static Outpatient Paediatric Physiotherapist in Rheumatology and Chronic Pain&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced and dynamic Physiotherapist to join our Paediatric Therapy team working in the Paediatric Rheumatology and Chronic Pain team at the Nuffield Orthopaedic Centre in Headington.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated Physiotherapist with the ability to work with a significant degree of professional autonomy to join the paediatric physiotherapy outpatient team, working within the Rheumatology and Chronic Pain service. The candidate will be able to demonstrate an appropriate level of Physiotherapy skill and expertise and be expected to use sound clinical reasoning skills to provide specialist assessment and treatment of Paediatric patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The candidate will be expected to work with the wider multi-disciplinary team including Psychologists, Occupational Therapists, Consultants and hospital schools within the Rheumatology and Chronic Pain service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There will be opportunities to supervise the clinical placement of physiotherapy students from Oxford Brookes and Coventry Universities. There are excellent opportunities for Continued Professional Development through in-service training, and on-going peer support and clinical supervision.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful applicants will have relevant postgraduate experience and will be expected to participate in the Acute on-call Respiratory and weekend paediatric orthopaedic service based at the Children’s Hospital on the JR site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Oxford University Hospitals NHS Trust has a world-class reputation for teaching and research. It provides a wide range of general and specialist services as well as playing a central role in the local community. Being based in the city of Oxford, the hospital is easy to reach and has excellent access to London.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact Joanna Sheehan or Julia Smith B7 Children’s Physiotherapists&lt;/p&gt;\n&lt;p&gt;01865 737266 / 738087&lt;/p&gt;\n&lt;p&gt;Joanna.sheehan@ouh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Julia.smith@ouh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Paediatric Physiotherapist – Rheumatology and Chronic Pain Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245226", "validThrough": "2020-11-20T23:59:59+0000"}