{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36500", "minValue": "36500", "unitText": "YEAR", "value": "Up to £36,500 FTE - DOE + Golden Hello"}}, "datePosted": "2020-11-04T14:17:00+0000", "description": "&lt;p&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Are you looking for something different?&lt;br /&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work. If you are a qualified nurse, or soon to qualify, and want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;Interested in clinical development?&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;We offer opportunities to develop in to a specialist role of your interest which in turn benefits the service. Examples include ANP, BBV, sexual health, plastering, ILS (intermediate life support), health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;As a Registered Nurse (Adult) you’ll be an integral part of the healthcare team by bringing your top notch clinical skills and passion for care. You could be involved in anything from developing and leading clinics, undertaking examinations and tests as well as answering emergency bells and potentially being the first person to attend an emergency.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;You’ll receive an annual salary up to £36,500 FTE - depending on skills and experience + 2 year Golden Hello (£2,000 in Year 1 of service and £1,500 in Year 2 of service - conditions apply); free DBS check, free uniform, free mandatory training, indemnity cover, CPD and re-validation support.&lt;br /&gt;As well as a number of benefits including a company pension scheme, 25 days annual leave plus 8 public bank holidays (pro-rata for part-time) plus other benefits including cycle to work scheme and clinical development opportunities.&lt;br /&gt;&lt;br /&gt;Onsite benefits at HMP Bullingdon include access to an onsite gym, free parking and subsidised café/restaurant.&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;How will we support you?&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;• Bespoke induction&lt;br /&gt;• Competency framework&lt;br /&gt;• Preceptorship (newly qualified practitioners)&lt;br /&gt;• Regular clinical supervision&lt;br /&gt;• Supported development into specialities such as diabetes or asthma&lt;br /&gt;• Regional and national career development opportunities&lt;br /&gt;• Our bespoke Learning Management System to address your learning needs&lt;br /&gt;• Support from the wider team&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;If you are shortlisted, you will be contacted by an Internal Recruiter for this role. They will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at HMP Bullingdon if the hiring manager feels that you are suitable for the job.&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;More information&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;HMP Bullingdon operates as a local prison holding both remanded and sentenced prisoners. It has a dedicated healthcare unit, specialising in supporting patients with complex medical requirements, mental health issues and primary care needs. Healthcare is provided 24/7, including first and second reception screening for new arrivals, triage and phlebotomy and vaccination clinics. Long term condition clinics are a core clinical activity. The roles are varied, involving assessing and treating patients and carrying out effective care in an ever changing environment; responding to both their physical and mental well-being needs. Our team includes GP’s, Clinical Leads, Nurses and HCA’s; emergency care is supported by our paramedic and all our clinical staff are trained to deliver intermediate life support (ILS). Pharmacy is managed by our pharmacist and supported by technicians and assistants.&lt;br /&gt;&lt;br /&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bicester, Oxfordshire", "postalCode": "OX25 1PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8526", "longitude": "-1.09436"}}, "title": "Primary Care Nurse - HMP Bullingdon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256193", "validThrough": "2020-11-18T23:59:59+0000"}