{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Minimum Wage for the Age"}}, "datePosted": "2020-10-30T11:46:19+0000", "description": "&lt;p&gt;&lt;strong&gt;‘Get In’ to the LCHS NHS Level 3 Business Administration Apprenticeship role in the Quality Systems Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to start a new and exciting career within the NHS? Are you enthusiastic, motivated with a desire to learn new skills? Do you want to get paid whilst making a really difference to the experience of our patients? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hello, we are Lincolnshire Community Health Services NHS Trust. Thank you for having a look at our vacancies for apprenticeships. We think this is a great place to work and hope that by looking through our information you will agree.&lt;/p&gt;\n&lt;p&gt;Lincolnshire Community Health Services NHS Trust (LCHS) delivers community healthcare services for the population of Lincolnshire, one of the largest healthcare communities in the country.&lt;/p&gt;\n&lt;p&gt;The services we provide enable patients and families to access care and support at, or as close to, home as possible. We work in partnership with health and social care providers to maintain patients’ independent lifestyles for as long as they can. We are committed to helping everyone we care for remain as healthy as possible and making their experience with us the best it can be.&lt;/p&gt;\n&lt;p&gt;Lincolnshire Community Health Services employs 2000 staff and many of them have spent most of their career progressing within our organisation, find a fulfilling career within healthcare. We would like to invite you to join us in our journey to deliver high quality care across Lincolnshire. We are pleased to offer an opportunity to join the quality team within Lincolnshire Community health services as an Apprentice.&lt;/p&gt;\n&lt;p&gt;As an organisation we take our values seriously. Our values can be summed up in one sentence. ‘We listen, We Care, We Act, We improve’. Throughout the recruitment process you will be asked to think about how you demonstrate these values and how they impact on you. It doesn’t matter what role you do, whether it is patient facing or not, we are all working in the same way with our values at the core. All staff within the NHS, regardless of role has a responsibility to ensure that our patients and those who use our services are protected from abuse and harm. Safeguarding means protecting peoples&#39; health, wellbeing and human rights, and enabling them to live free from harm, abuse and neglect. It is a key part of providing high-quality health services. These exciting roles will involve working with, and supporting the safeguarding team to ensure that we discharge our safeguarding duties effectively.&lt;/p&gt;\n&lt;p&gt;We believe that our values underpin everything we do. If you have these values we can provide an environment, support and relevant training to allow you to use these values to directly influence patient care, as well as support personal growth and achievement.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role could provide a stepping stone for you to ‘Get In’ to your future NHS career, where you can really make a difference to the patient experience.&lt;/p&gt;\n&lt;p&gt;The programme has been designed to give our apprentice the opportunity to obtain defined vocational qualifications, alongside the development of a greater understanding of working in a community health service, whilst receiving a wage. The programme lasts 21 months and will be achieved through a combination of work-based practice, achievement of a B-Tec Level 3 Diploma in Business Administration and Apprenticeship Standard via a combination of in house group workshops and Trust insight days.&lt;/p&gt;\n&lt;p&gt;Completion of this apprenticeship would be a great step for someone wanting to progress their career in the NHS in a Business and Administration role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Apprenticeship Programme&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Following your organisational induction you, you will be enrolled onto the Your Workplace Essentials programme to give you a sound grounding in all key business areas within the LCHS quality team. During this time you will spend time with different members of the core team to gain a general understanding of the Quality Team’s role and bespoke functions and develop awareness understanding and practical knowledge on core aspects of quality clinical governance, compliance to maintain patient safety and management of risk.&lt;/p&gt;\n&lt;p&gt;Experience of working within a Quality Team as well as communications and working with other health partners, patients, colleagues from other departments and external agencies will be integral to your initial learning opportunities. Knowledge of compliance, assurance and learning within a healthcare environment, to ensure safe and effective care delivery will remain fundamental to the in work programme focus. Experience of gaining general administration skills (Microsoft office) as well as enhanced knowledge of both local and national systems and reporting will be promoted. This will then be followed by your enrolment onto the nationally recognised Level 3 Business and Administration LCHS apprenticeship.&lt;/p&gt;\n&lt;p&gt;As an apprentice within our team you will work alongside a variety of key team members and following initial work placement experience you will begin to work on more bespoke work activities to gain a deeper knowledge and understanding of the keys functions of the quality team to include safeguarding, quality improvement, patient safety, quality governance and patient experience. Key areas within the wider team related to medicine management, clinical education, external compliance and patient experience will then become enhanced. Opportunity’s to support bespoke work projects and quality improvement initiatives will be a core skill gained.&lt;/p&gt;\n&lt;p&gt;There will then be ongoing support and learning opportunities provided through regular group apprentice workshops and one-to-one meetings with your mentor. Time will be spent on developing your skills set attending in-house and job relevant training will be given in line with the service area requirements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beech House HQ, Lincoln, Various location options across Lincolnshire with options for some remote working", "postalCode": "LN5 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2265", "longitude": "-.524149"}}, "title": "Quality Systems Business Administration Apprentice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250019", "validThrough": "2020-11-16T23:59:59+0000"}