{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-23T11:31:19+0100", "description": "&lt;p&gt;Do you want to be part of an innovative, dynamic organisation that is committed to delivering the best care by the best people? We are looking to appoint people who are as passionate about high quality care as we are.&lt;/p&gt;\n&lt;p&gt;NELFT’s Vision is ‘delivering the best services through the best people’. Key to achieving this is recruiting high quality staff that support our values. The post-holder will be expected to support their team, department and organisation to achieve the Trust’s Values in their day to day work.&lt;/p&gt;\n&lt;p&gt;These are the 5P’s:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Putting people first&lt;/li&gt;\n&lt;li&gt;Prioritising quality&lt;/li&gt;\n&lt;li&gt;Being progressive, innovative and continually improving&lt;/li&gt;\n&lt;li&gt;Being professional and honest&lt;/li&gt;\n&lt;li&gt;Promoting what is possible – independence, opportunity and choice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post is for 5 PAs Consultant Post based in the Child Development Centre, Groveland’s, Grove Road, Romford, RM6 4XH.&lt;/p&gt;\n&lt;p&gt;The post holder will be line managed by the locality Associate Medical Director (AMD) for Redbridge Dr Shweta Anand.&lt;/p&gt;\n&lt;p&gt;There is currently 1.8 WTE consultant psychiatry and there are 2.0 WTE specialty doctors. A CT2-3 training post is attached to the unit, a post which is filled.&lt;/p&gt;\n&lt;p&gt;The post holder will also form part of a consultant peer consultation (supervision) group created by the trust, which the post holder will be expected to attend on a monthly basis in keeping with the Trust’s Supervision Policy.&lt;/p&gt;\n&lt;p&gt;The post holder will be take a lead for EWMHS and be part of the monthly Integrated Leads meeting as part of the integrated service.&lt;/p&gt;\n&lt;p&gt;The post holder’s Prescribed Connection will be to NELFT for Medical Appraisal and Revalidation purposes. NELFT will finance one Multisource Feedback exercise for peers and patients per post holder if this is required in advance of their GMC Revalidation date. In&lt;/p&gt;\n&lt;p&gt;keeping with NELFT’s Appraisal and Revalidation Policy, post holders will have a choice of medical appraiser and will be expected to use the NELFT Revalidation Management System – Prep&lt;/p&gt;\n&lt;p&gt;The post will be subject to a job planning process where the Trust’s requirements and the post holder’s preferences will be negotiated. The post holder’s Designated Body will be NELFT for the purposes of Revalidation.&lt;/p&gt;\n&lt;p&gt;Redbridge CAMHS/Emotional Mental Health and Well Being Services&lt;/p&gt;\n&lt;p&gt;Redbridge EWMHS offer an outpatient assessment and treatment service for a broad range of mental health problems. These services are available for children and young people 0 –18 yr. old. Children are seen within the context of their families and there is a culture of collaborative working with Schools, Social Services and Voluntary Agencies in addition to close liaison with other health professionals. We offer a fast track service for looked after children and can also refer to our NELFT parent infant mental health services and Eating Disorder service.&lt;/p&gt;\n&lt;p&gt;There is close liaison and joint assessments with the eating disorder service, with the new drugs and alcohol service (WDP), and the early intervention for psychosis service. With regards to transferring young people to the adult mental health services monthly meetings are held with a representative of that service where those within 6 months of needing a transfer to adult mental health services are discussed.&lt;/p&gt;\n&lt;p&gt;The newly established Emotional Wellbeing Mental Health Service is informed by the national Thrive framework. Our transformation is underpinned by our plan for a multidisciplinary and multiagency service model that aims to support children and young people with a variety of needs using the Thrive needs based groupings. Thrive is an integrated person centered and needs led approach to delivering a mental health service.&lt;/p&gt;\n&lt;p&gt;The Redbridge Emotional Wellbeing and Mental Health Service is now part of the Integrated Redbridge specialist community health services for children and young people The specialist services are now delivered from The Grove, based in Chadwell Health and co-located with Child Development Centre Services which includes Paediatrician, Occupational Therapists, Physiotherapists, SALT and Specialist Nursing services which includes Peadiatric Continence, Looked After Children, Specialist Health Visitor and School Nurses and Community Children’s Nursing. There are regular Integrated MDT meetings to discuss complex referrals and cases as well as specific CAMHS Complex case meetings and Diagnostic meetings.&lt;/p&gt;\n&lt;p&gt;Philosophy of the service:&lt;/p&gt;\n&lt;p&gt;The following strategic drivers underpin the direction of service developments:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NSF for children&lt;/li&gt;\n&lt;li&gt;Every child matters&lt;/li&gt;\n&lt;li&gt;Standards for better health&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Service developments have been further influenced by recent changes in the NHS, such as patient choice, practice based commissioning and payment by results. The following service changes were introduced:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Triage&lt;/li&gt;\n&lt;li&gt;Child IAPT&lt;/li&gt;\n&lt;li&gt;Specialist clinics for specific patients groups based on evidence, such as ADHD clinics, Autism clinics, etc.&lt;/li&gt;\n&lt;li&gt;Development of care pathways which will facilitate the development of payment by result arrangements in the future with commissioners&lt;/li&gt;\n&lt;li&gt;Greater involvement of users in service development and the introduction of user satisfaction questionnaires.&lt;/li&gt;\n&lt;li&gt;Introduction of outcome studies to compare the service against national standards.&lt;/li&gt;\n&lt;li&gt;Increase in multi-agency work with better networks and linking.&lt;/li&gt;\n&lt;li&gt;Participation in the discussions with other agencies with regards to common assessment framework and information sharing.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details regarding the post please contact or to arrange an informal visit:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Basit Hussain&lt;/p&gt;\n&lt;p&gt;Basit.Hussain@nelft.nhs.uk&lt;/p&gt;\n&lt;p&gt;0300 3001706&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Grove, Redbridge", "postalCode": "RM6 4XH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.577", "longitude": ".121305"}}, "title": "Consultant Psychiatrist CAMHS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240330", "validThrough": "2020-11-24T23:59:59+0000"}