{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T11:16:11+0000", "description": "&lt;p&gt;Service/Ward/Department Summary:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Early Intervention Team provides support and intervention to individuals who are experiencing their first episode of psychosis. The team is based in an office with purpose built clinical space in the centre of Ashton-Under-Lyne covering the Tameside and Glossop area and has access to remote working systems. This is an exciting opportunity for an experienced Band 6 &lt;strong&gt;Care coordinator&lt;/strong&gt; (RMN, Social Worker, Occupational Therapist) to work within this established specialist service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Role Summary:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Care Coordinator you will hold a caseload for service users identified as being in the early phase of a psychotic illness or at risk mental state. This will include the assessment of needs and delivery of interventions in line with currently identified best practice and in line with NICE guidance. Supported by the team manager you will support the day to day organisation of the team and ensure that work priorities are met providing advice and supervision as required to other mental health professionals within the multi-disciplinary team and contributing to ongoing service developments.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Key Responsibilities of the Post:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To act as a Care Co-ordinator carrying a complex caseload, meeting the criteria for the service delivering comprehensive support for identified needs.&lt;/li&gt;\n&lt;li&gt;To carry out interventions in line with the psychosocial approach of the overall service focussing on recovery and re: enablement.&lt;/li&gt;\n&lt;li&gt;Offer advice and supervision to other mental health professionals within the multi-disciplinary team.&lt;/li&gt;\n&lt;li&gt;Support the development of the service including promotion of the service to other agenciesKey Requirements of the Person Specification:&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Professional registration as a nurse, social worker or occupational therapist.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working with clients with serious mental illness.&lt;/li&gt;\n&lt;li&gt;Knowledge and skills in assessment, planning, implementation and evaluation of the care of clients with serious mental illness&lt;/li&gt;\n&lt;li&gt;Use of a car or access to a means of mobility and ability to travel is essential to the post.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLesley FreemanJob titleTeam ManagerEmail addresslesley.freeman3@nhs.netTelephone number0161 7163280&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tameside Early Intervention Team, Ashton-Under-Lyne", "postalCode": "OL6 7SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4858", "longitude": "-2.09998"}}, "title": "Care Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249910", "validThrough": "2020-11-13T23:59:59+0000"}