{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "75645", "minValue": "75645", "unitText": "YEAR", "value": "IG4 5PZ"}}, "datePosted": "2020-10-19T13:47:18+0100", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse | Pre-Assessment | Band 6 | London East | Full Time | | Fully funded training programs and career progression opportunities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire London East Hospital has an exciting opportunity for a motivated Pre – assessment Nurse to join our highly skilled and patient focused Pre-assessment department.&lt;/p&gt;\n&lt;p&gt;Spire London East Hospital (formerly Spire Roding) is located in Redbridge, on the borders of East London and Essex.  We offer comprehensive private hospital services, ranging from outpatient clinics and physiotherapy to surgery and diagnostic tests in a relaxed, clean and comfortable environment.&lt;/p&gt;\n&lt;p&gt;The hospital has 24 inpatient beds and 16 day case rooms called ‘pods’. Facilities include 4 operating theatres, an endoscopy suite, 2 extended recovery units, pharmacy, x-ray, outpatient and diagnostic facilities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will take responsibility by making accurate patient observations, completing medical history and giving medication advice and act appropriately.  You will be part of a very supportive team delivering a best in class service, ensuring the health and wellbeing needs of our patients are met in the run up to their operation. You will be trusted and supported to make decisions that are deemed the best for our patients care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC registration&lt;/li&gt;\n&lt;li&gt;At least 1 years Pre-Assessment experience&lt;/li&gt;\n&lt;li&gt;General surgical experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Jodie Walsh on 07935 755240  jodie.walsh@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East London", "postalCode": "EC4Y 8EN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5131", "longitude": "-.105587"}}, "title": "Staff Nurse - Pre-Assessment", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232562", "validThrough": "2020-11-19T23:59:59+0000"}