{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-26T12:01:19+0000", "description": "&lt;p&gt;The Pre-operative Assessment Unit is currently looking to recruit full time or part time Registered Nurses. Experience in pre-operative assessment is preferred however, applicants with experience of working on a surgical ward or in a perioperative environment would be considered.&lt;br /&gt;&lt;br /&gt;The role requires excellent communication and organisational skills and a willingness to work with the multidisciplinary team.&lt;br /&gt;&lt;br /&gt;Your clinical responsibilities will include history taking, ordering and reviewing clinically indicated investigations and advising patients how to prepare for surgery and planning for discharge to ensure they have a safe perioperative experience.&lt;br /&gt;The Pre-operative Assessment Department is based in Hickstead Unit at Princess Royal Hospital. The department currently provides a combination of telephone, video and face to face appointments.&lt;br /&gt;&lt;br /&gt;We are looking for an organised person with good problem solving skills and excellent time management skills. If you have a passion for surgery and would like to guide the patient through the perioperative pathway then we would like you to join our friendly team.&lt;br /&gt;&lt;br /&gt;At present, the Pre-operative Assessment Unit is open Monday to Friday from 8 am to 6 pm.&lt;/p&gt;\n&lt;p&gt;We are proud to be able to offer a variety of flexible working options and contracts. For further information please refer to the Flexible Working for Registered Nurses document which is attached to this advert.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMary DalyJob titlePre-operative Assessment ManagerEmail addressmary.daly@nhs.netTelephone number01444 441881 ext. 65830&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal Hospital, Haywards Heath", "postalCode": "RH16 4EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9912", "longitude": "-.09105"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242329", "validThrough": "2020-11-08T23:59:59+0000"}