{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "55000", "minValue": "55000", "unitText": "YEAR", "value": "Up to £55,000"}}, "datePosted": "2020-10-29T11:39:50+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Break into prison healthcare!&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt;Have you ever thought about working within the prison environment?&lt;br /&gt; &lt;br /&gt;Are you looking for an opportunity to gain experience in a challenging and rewarding role?&lt;br /&gt; &lt;br /&gt;Then look no further…&lt;br /&gt; &lt;br /&gt;Practice Plus Group are the Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care. What will you be doing? As a development advanced nurse practitioner with independent prescribing, you&#39;ll deliver face to face services, enabling patients to obtain health information from the appropriate health care professional. Providing safe and effective health assessments and treatment of patients within the establishment.&lt;br /&gt; &lt;br /&gt;You&#39;ll be accountable for your own practice including the assessment, diagnosis, treatment and discharge or referral of patients, independent of medical intervention. Practising within your own sphere of competence and agreed acceptable limits of practice, you&#39;ll assess patients, and order and interpret investigations, diagnose and treat patients who wish to be seen by an Advanced Nurse Practitioner. You&#39;ll be responsible for the assessment of care needs the development, implementation and evaluation of programmes of care, without supervision, and to teach other nursing and non-nursing staff.&lt;br /&gt; &lt;br /&gt;Working as part of the multi-disciplinary team in providing quality, evidence-based health care to meet the immediate needs of the patient, you&#39;ll take an active role within the cross-disciplinary, multi-skilled team to ensure service quality in line with corporate goals and strategy; to assist in the implementation of the wellbeing approach which have a positive impact on the health economy.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt; &lt;br /&gt;You&#39;ll be a 1st level Registered Nurse (RGN/RMN) with current registration with the UK Nursing Midwifery Council (NMC). You will be willing to work Postgraduate qualification in Advanced Nurse Practice (MSc) and already have an Independent Nurse Prescribing qualification, and have proven experience in acute/primary care nursing.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;More Information&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt; &lt;br /&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF2 9AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6823", "longitude": "-1.50617"}}, "title": "Advanced Nurse Practitioner - HMP Wakefield", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248141", "validThrough": "2020-11-29T23:59:59+0000"}