{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 pa"}}, "datePosted": "2020-11-02T13:16:14+0000", "description": "&lt;p&gt;The formation of Diagnostics and Pharmacy Group affords an exciting opportunity to develop and deliver a single Virology Service across the Northern Care Alliance (NCA). In order to lead and support these plans, we look to appoint an enthusiastic, energetic and patient-focused Consultant Medical Virologist / Consultant in Infectious Diseases &amp; Virology / Consultant in Medical Virology &amp; Microbiology /Consultant Clinical Scientist - Virology, to work with clinical teams across the NCA.&lt;/p&gt;\n&lt;p&gt;You will support the Microbiology teams within the laboratories at The Royal Oldham Hospital and Salford Royal Foundation Trust, and work with colleagues across five hospital sites within the NCA and with Wrightington, Wigan, and Leigh as part of the PAWS network.&lt;/p&gt;\n&lt;p&gt;You will join a vibrant team consisting of a Consultant Virologist, thirteen Consultant Microbiologists (three vacancies at present), and a range of laboratory and technical staff. You will work closely with multiple multidisciplinary teams based both within an acute and community environment.&lt;/p&gt;\n&lt;p&gt;We are a team with passion to deliver the best possible care for our patients and communities and we look forward to welcoming like-minded individuals to our team.&lt;/p&gt;\n&lt;p&gt;We offer a flexible job plan and would welcome applications for full or part time contracts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;OUR COMMITMENT TO YOU &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An energetic and dynamic leadership team with clear vision for the continued success of Diagnostics and Pharmacy Services across the NCA.&lt;/p&gt;\n&lt;p&gt;Opportunities to be involved in the training and mentoring of both junior doctors training in Virology and Microbiology.&lt;/p&gt;\n&lt;p&gt;Support for your own personal development utilising our strong links with local universities.&lt;/p&gt;\n&lt;p&gt;A flexible approach to job planning that delivers a working environment to best suit you and your team.&lt;/p&gt;\n&lt;p&gt;An opportunity to develop and be part of an innovative team benefitting from an excellent, purpose built facility.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;YOUR VALUED CONTRIBUTION &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a determined team with exciting plans for growth and development in the future. We are looking for a skilled professional with equal vision, tenacity and flexibility in their approach. A strong team player, you will be someone who remains calm under pressure, with an ability to take charge when needed in an encouraging and supportive style. Your clear passion for high quality and compassionate patient care will be second to none.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We’d welcome the opportunity to meet with you and show you what working with our brilliant team could mean for your future career. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups, individuals with disabilities and women are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Joel Paul&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Consultant Virologist / Clinical Lead for Virology&lt;/p&gt;\n&lt;p&gt;Tel: 0161 656 1641 (Int 71641)&lt;/p&gt;\n&lt;p&gt;email: joel.paul@pat.nhs.uk; joel.paul@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Andrew Evans&lt;/p&gt;\n&lt;p&gt;Associate Director - Pathology Services&lt;/p&gt;\n&lt;p&gt;email: andrew.evans@pat.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern Care Alliance, Oldham", "postalCode": "OL1 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5533", "longitude": "-2.12183"}}, "title": "Consultant - Virology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252193", "validThrough": "2020-11-30T23:59:59+0000"}