{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-14T16:46:00+0100", "description": "&lt;p&gt;&lt;span&gt;This post is being advertised to address a temporary need for 12 months, however the Trust has made the commitment to offer Registered Nurses a permanent contract with the Trust. In the event that the need for this post ends, a suitable alternative post will be offered (this does not apply to other registered professions). Applicants should be aware that alternatives may require some flexibility on role and/or location.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The North Yorkshire and York CAMHS Eating Disorder Service is looking for a Band 6 CAMHS (Child &amp; Adolescent Mental Health Services) Practitioner to join the team. This post is being advertised as a fixed term 12 month maternity cover opportunity.&lt;/p&gt;\n&lt;p&gt;The post holder will provide eating disorder services and treatment to young people and their families across North Yorkshire and York. The team operate out of Lime Trees, York and Dragon Parade Clinic, Harrogate, also providing outreach to Northallerton and Scarborough.&lt;/p&gt;\n&lt;p&gt;The post requires independent travel across the locality - travel expenses and travel time are included.&lt;/p&gt;\n&lt;p&gt;The team includes clinical psychologists, nurses, dietitians, psychiatrists and social workers. Therefore, the ability to work effectively within a multi-disciplinary team is a requirement.&lt;/p&gt;\n&lt;p&gt;The post holder will provide evidence based assessment and treatment based interventions as part of the clinical eating disorder pathways, and offer input to individuals, their families and carers in a clinic setting. The candidate will also provide supervision, and mentorship to students and junior staff working within the team. The post holder will support the team with service development using the Trust’s quality improvement methods .&lt;/p&gt;\n&lt;p&gt;The Eating Disorder service is looking to appoint an individual with a range of transferrable skills, who is highly motivated and enthusiastic about working with this client group. In exchange the successful candidate will be well supported within a friendly and supportive team, with continuing opportunities for their ongoing professional development.&lt;/p&gt;\n&lt;p&gt;Applicants must ensure that prior to applying they have agreement from their current line manager that they can be released on a secondment basis.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Stephanie Allerston - Clinical Team Manager 01423 726900 stephanie.allerston@nhs.net&lt;/p&gt;\n&lt;p&gt;Alice Wriglesworth - Clinical Lead 01423 726900&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lime Trees, York", "postalCode": "YO30 5RE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9725", "longitude": "-1.10408"}}, "title": "CAMHS Eating Disorder Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227153", "validThrough": "2020-11-17T23:59:59+0000"}