{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-11-05T15:01:48+0000", "description": "&lt;p&gt;WESTERN SUSSEX HOSPITALS NHS FOUNDATION TRUST&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONSULTANT HISTOPATHOLOGIST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(10 PAs)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited for the above post of Consultant in Histopathology based at St Richard’s Hospital or Worthing Hospital, parts of the Western Sussex NHS Foundation Trust to commence as soon as possible. This is a new post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will join the Cellular Pathology Department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Western Sussex Hospitals NHS Foundation Trust is the only CQC-rated “Outstanding” hospital trust on the south coast and one of only four in the country. We’re an ambitious organisation that champions our people, equipping them with new skills to continually improve services for patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The CQC recognised our leading approach continuous improvement which encourages and supports innovation at all levels. We are an acute trust with three hospitals; St Richard’s in Chichester and Worthing Hospital, where we provide emergency and inpatient care; and Southlands Hospital in Shoreham, where we provide out-patient care and day surgery. We are a forward looking and innovative trust whose purpose is to provide high quality emergency and elective care for the people of West Sussex. Foundation Trust Status was achieved in July 2013.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our hospitals are all situated along the beautiful Sussex coast, nestled against the South Downs National Park, and close to vibrant towns that are richly endowed with excellent cultural and sporting facilities, offering good transport links to London and Europe.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must be on the GMC Specialist Register, or eligible for entry within 6 months of the interview date.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact: Dr Mark Whittaker, Clinical Lead, Telephone number 01243 788122 ext 33545 or email markwhittaker@nhs.net&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Please note shortlisted applicants will be asked to provide an up to date CV for their interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants are required to provide the names and contact details of four referees; three will be clinical referees including one from the current employer (or most recent employer if not currently working) and the final referee will your current Responsible Officer for revalidation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applications from Agencies will NOT be considered, therefore please do not send any directly to the department or Medical HR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Mark WhittakerJob titleClinical LeadEmail addressmarkwhittaker@nhs.netTelephone number01243 788122 ext 33545&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121075.png", "name": "Western Sussex Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Richard&#39;s Hospital, Chichester", "postalCode": "PO19 6SE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8436", "longitude": "-.768008"}}, "title": "Consultant Histopathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258243", "validThrough": "2020-11-26T23:59:59+0000"}