{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13503", "minValue": "13503", "unitText": "YEAR", "value": "£13,503 per annum"}}, "datePosted": "2020-11-04T16:16:24+0000", "description": "&lt;p&gt;South Warwickshire NHS Foundation Trust (SWFT) is looking to recruit an enthusiastic and self-motivated apprentice within the Medical Staffing Department based at Warwick Hospital. This is a fantastic opportunity to develop administrate and customer service skills in the Medical Staffing Department, learning on the job whilst also having the opportunity to obtain a nationally recognised qualification.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for providing a high quality, comprehensive administrative support to Medical Staffing Department working alongside team members ensuring a high customer service level is maintained.&lt;/p&gt;\n&lt;p&gt;Support and training will be provided to enable the post holder to develop their skills in the area. This will be through regular supervision and will attend study sessions and meet with an assessor from the apprenticeship provider to gain an apprenticeship qualification in Level 2 Customer Service Practitioner.&lt;/p&gt;\n&lt;p&gt;The post is a 15 month fixed term contract on 37.5 hours per week (Monday-Friday) with time for formal study towards the apprenticeship framework and the candidate will be entitled to 27 days annual leave plus 8 statutory holidays.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent communication and customer-service skills, the ability to work alone and as part of a team, as well as meticulous attention to detail. You will also need to have excellent organisational/prioritisation skills and well as being proficient in the use of Word, Excel and email. Training will be given on the Hospital Systems used.&lt;/p&gt;\n&lt;p&gt;We will be looking for a willingness to learn, a can do attitude and you will need to be able to demonstrate that you are committed to completing an apprenticeship.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;SWFT is recognised as an ‘employer of choice’ and is highly recommended as a place to work. Our employees are as important to us as the care we give to our patients. We will ensure the right support is available to you throughout your apprenticeship, provide a friendly work environment alongside other benefits such as a generous holiday entitlement and access to a great pension scheme. There may also be opportunity for career development at the end of the apprenticeship but this is not guaranteed.&lt;/p&gt;\n&lt;p&gt;The key benefits of undertaking an ‘Apprenticeship Scheme’ will allow you to work alongside experienced staff, gain job specific skills, build confidence in the workplace, earn a wage and get holiday pay + work benefits.&lt;/p&gt;\n&lt;p&gt;We work in partnership with reputable training providers to ensure an inclusive and supportive learning environment is provided throughout your studies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Qualification&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The candidate is desirable to have at least 4 GCSE’s (grade A-D or 3-9) or equivalent (including Maths and English Language) and be willing to satisfactorily complete the formal training elements of the programme.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;On completion of your apprenticeship you will receive the Level 2 Apprenticeship in Customer Service Practitioner and Level 1 or 2 Functional Skills English, Maths (if applicable)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To help us achieve our vision of providing the best possible healthcare, South Warwickshire NHS Foundation Trust run Assessment Centres to select its future employees. These vary depending on the vacancy but their core purpose is to create an environment in which you, along with other candidates are able to demonstrate key workplace skills.&lt;/p&gt;\n&lt;p&gt;The Assessment Centre will be an opportunity for you get a feel for the culture and learning opportunities within South Warwickshire NHS Foundation Trust. Assessment will be based on a numeracy and literacy test, an individual interview and a group exercise which will be undertaken against the core values and behaviours that our employees pride themselves with.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMuhammad Saqib SattarJob titleMedical Staffing ManagerEmail addressMuhammad.Sattar@swft.nhs.ukTelephone number01926 495321 ext 3154Additional contact information&lt;/p&gt;\n&lt;p&gt;Andrew Millman 01926 495321 ext 8043&lt;/p&gt;\n&lt;p&gt;Leigh-Ann Johnston (Apprenticeship Co-Ordinator) on 01926495321 ext 8463&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Medical Workforce Dept C26118, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Medical Staffing Apprentice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256597", "validThrough": "2020-11-18T23:59:59+0000"}