{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T10:16:52+0000", "description": "&lt;p&gt;Lancashire and South Cumbria Foundation Trust are delivering award winning, dynamic and rapidly expanding Multidisciplinary Community Services across Southport &amp; Formby known as ICRAS (Integrated Community Reablement Assessment Service) and the Falls Prevention Team.&lt;/p&gt;\n&lt;p&gt;ICRAS is focused on delivering the best of care and reducing the risk to adults including frail elderly and those who may be in a health or social care crisis, improving quality of care in line with current evidence. ICRAS also provides bed based services within local residential and nursing homes, domiciliary care and rapid response. The Falls Prevention team is a multi -professional service offering falls prevention across the Southport and Formby area. The team offers a multifactorial assessment by offering a multidisciplinary clinic, balance clinic and home assessment for those over the age of 65 years who have fallen or who are at risk of falls. This opportunity to rotate around the diverse and varying aspects of the ICRAS service and the Falls Prevention Team affords therapists the opportunity for career development and progression. You may also be required to rotate into the acute setting in the future to support integrated working.&lt;/p&gt;\n&lt;p&gt;We wish to recruit Senior Physiotherapists who have a clear understanding of the developing role of the therapist within a community setting, working predominantly with older people. Candidates should demonstrate the ability to work across both teams who deliver innovative, responsive services to meet both the needs of patients and the organisation. We are committed to staff development and you will have a named supervisor, the support of clinical specialist physiotherapists and occupational therapists and the opportunity to attend courses and training including leadership development. You will be responsible for the supervision and support of qualified therapy staff and assistant practitioners.&lt;/p&gt;\n&lt;p&gt;The therapy service is delivered 8am – 8pm. Therapists work over a 7 day shift pattern to maintain an MDT approach and ensure they are responsive to patient and service needs.&lt;/p&gt;\n&lt;p&gt;Please get in touch if you wish to have a chat about the post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Zoe Skelton – Clinical Lead Physiotherapist – 07814 349800&lt;/p&gt;\n&lt;p&gt;Zoe.Skelton@lancashirecare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Curzon Road Clinic, Southport", "postalCode": "PR8 6PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6402", "longitude": "-2.98357"}}, "title": "Senior Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249683", "validThrough": "2020-11-15T23:59:59+0000"}