{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23180", "minValue": "23180", "unitText": "YEAR", "value": "£13.79 Weekly pay will include: Basic pay + HCAS +"}}, "datePosted": "2020-10-26T11:46:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Do you want to work for an organisation that is working together to give children a better start and adults greater independence?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a qualified Staff Nurse who is preferably paediatric trained?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for you to join one of our forward thinking and innovative integrated 0-19 Universal teams in Ealing.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Ealing Early Start 0-19 Service:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a unique integrated 0-19 service with a skill mix team of Health visitors, School nurses, Community Staff nurses, Community Nursery nurses, Early start workers, Early start SEND workers, Social workers, Family Nurse Partnership, Admin , Child healthy weight team and safeguarding advisors. We are integrated with Ealing Local Authority and are co-located within the Children Centres.&lt;/p&gt;\n&lt;p&gt;Children, young people and families are our focus and passion and we are seeking Community Staff Nurses to join our dynamic diverse School Nurse team. We champion the role of community health professionals to make sure our families get the best care closer to home. The current climate means this is more important than ever; supporting families to keep them well, to provide care to keep them out of hospital or allowing them to return home from hospital at the earliest opportunity through support and care.&lt;/p&gt;\n&lt;p&gt;The London of Ealing is a fantastic place in which to live and work. Located in the heart of West London and has the most vibrant and diverse communities in Britain. Working and living in Ealing provides the best of both worlds. It is within easy reach of central London. It is so well served by the rail, tube and bus networks making it easy to move around. Ealing boasts an impressive range of bars and cafés and restaurants with every possible type of dining experience and taste catered for.&lt;/p&gt;\n&lt;p&gt;You will be joining a &lt;strong&gt;friendly well established School Nurse team &lt;/strong&gt;who continually strive to work in partnership with children and young people, their families and schools to provide high quality care to achieve positive outcomes for families in Ealing.&lt;/p&gt;\n&lt;p&gt;Our teams, throughout the pandemic have continued to work with children and young people with new and innovative practices to keep them safe by agile working, provision of laptops and other technological solutions for all staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Central London Community Healthcare NHS Trust: Who Are We?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Central London Community Healthcare NHS Trust works across eleven London boroughs and Hertfordshire. Community healthcare is our focus and our passion. We champion the role of community health professionals to make sure our patients get great care closer to home.&lt;/p&gt;\n&lt;p&gt;That in itself is an achievement and is recognised by Care Quality Commission (CQC) with a rating of Good. We are at the forefront of changing the way NHS services are provided to benefit our patients, and our 3,000 health professionals and staff have over 1.5 million patient contacts every year.&lt;/p&gt;\n&lt;p&gt;Whether you are looking to start your career or use the valuable experience you have acquired to further your career we have opportunities at all levels, along with excellent career prospects you will be joining a progressive, collaborative and innovative team who put family care at the centre of all we do.&lt;/p&gt;\n&lt;p&gt;We value you and wish to support you in the best ways we can, offering compassionate and supportive leadership to enable you to be the best you in your role. Our Trust benefits include family friendly policies, health and wellbeing support, staff networks, travel schemes and more&lt;/p&gt;\n&lt;p&gt;We are ambitious and a forward-thinking employer and this is a great opportunity for the right individuals to join us in our success. Our CLCH Academy launched in April 2019 which provides training and education to our staff across community and primary care.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hertfordshire, Various", "postalCode": "SW1P 2PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4943", "longitude": "-.134014"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242261", "validThrough": "2020-11-09T23:59:59+0000"}