{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "387694", "minValue": "49036", "unitText": "YEAR", "value": "£387,694 - £49,036"}}, "datePosted": "2020-10-21T11:15:37+0100", "description": "&lt;p&gt;&lt;strong&gt;Oral Medicine (ACF) ST1 Recruitment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The University of Sheffield, in partnership with the Sheffield Teaching Hospitals NHS Foundation Trust (Charles Clifford Dental Hospital) and Health Education Yorkshire and the Humber (Sheffield locality) wish to offer an Academic Clinical Fellowship in Oral Medicine.&lt;/p&gt;\n&lt;p&gt;Applications are now invited for an Academic Clinical Fellowship in Oral Medicine (ACF) ST1 level in Sheffield from August 2021.&lt;/p&gt;\n&lt;p&gt;The following posts are available:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;One&lt;/strong&gt; post in &lt;strong&gt;Oral Medicine (ACF) ST1&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please read through all the relevant information available on the HEEYH Oral Medicine ACF Webpage and associated links before beginning your application (link available through Oriel).&lt;/p&gt;\n&lt;p&gt;Applications open at 10am on the 23rd October 2020 and the closing date is 4pm on the 20th November 2020. You will not be able to submit your application after this time. Please ensure that you have completed all the relevant sections of the application forms as missing information will deem your application incomplete and it will not be considered.&lt;/p&gt;\n&lt;p&gt;Academic Clinical Fellowships (ACFs) are 3-year fixed-term national training posts. They attract an NTN(A) and trainees undertake 75 % clinical and 25% academic training over the term of the post. They are employed by the NHS Trust (in this case Sheffield Teaching Hospitals NHS Foundation Trust) and have an honorary contract with the University of Sheffield. ACF trainees undergo training in the generic skills required for a clinical academic: scientific methods, statistics, research governance, critical appraisal of research publication, grant writing etc through postgraduate taught modules provided by the University of Sheffield and for which some funding is provided by NIHR. Academic Clinical Fellows may join with the well-established Sheffield medical ACF programme within the Graduate School of the Faculty of Medicine Dentistry and Health:&lt;/p&gt;\n&lt;p&gt;Trainees do not necessarily complete the whole Masters Programme in Research Methods; they can choose the modules most relevant to them, and also choose from the continuing development programme. The major part of the academic placement will be the preparation of scientific research proposal for a PhD project, funding for which will be sought from an external body such as the NIHR, MRC or the Wellcome Trust. Generally the preparation of the proposal is based on preliminary experimental data gathered while on the research placement. Trainees are also eligible for a £1,000 bursary per year to support research training activity (e.g. to attend academic conferences).&lt;/p&gt;\n&lt;p&gt;ACF trainees are expected to complete and submit an external funding application for a research fellowship to enable them to complete a higher degree (PhD) following the completion of their ACF fixed-term post, which would be completed as Out-of-Programme-Research (OOPR).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All Academic Clinical Fellowships are run-through posts, regardless of specialty. A trainee entering an ACF post would therefore be guaranteed continued training to CCST in Oral Medicine, as long as they progress satisfactorily (in both clinical and academic domains) through their training. We advise all applicants to read through all the relevant information available on the HEEYH Oral Medicine ACF Webpage and associated links before beginning your application through Oriel.&lt;/p&gt;\n&lt;p&gt;Including&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The Job Description&lt;/li&gt;\n&lt;li&gt;The Person Specification&lt;/li&gt;\n&lt;li&gt;The Timeline&lt;/li&gt;\n&lt;li&gt;Interview Structure and location&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The qualifications and professional registration requirements plus other eligibility criteria can be found in the person specification. The person specification for this specialty is available from the Job Description or the Specialty Training website.&lt;/p&gt;\n&lt;p&gt;Please upload all required evidence of competences to your online application form when completing the application form online. For those experiencing difficulties when uploading evidence, please ensure you email the evidence to the following email address by the application deadline:academicrec.yh@hee.nhs.uk with “your name” and “competencies” in the title of the email.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Eligibility requirements pertaining to UK Visas and Immigration are available on the &lt;/strong&gt;Specialty Training Websitein the 2021 Applicant Handbook&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;With effect from 6 October 2019, all medical practitioners are on the Shortage Occupation List. This means that with the exception of all applicants to Public Health, all specialty recruitment applicants will be exempt from the RLMT; there will be no restriction on their appointment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt; All applicants who do not already hold a National Training Number (NTN) or Deanery Reference Number (DRN) in the GMC specialty to which they are applying for will be required to undertake the national clinical recruitment process and attend an assessment/interview for that GMC specialty as appropriate.&lt;/p&gt;\n&lt;p&gt;The Postgraduate Dean confirms that this placement and / or programme has the required educational and Dean’s approval.&lt;/p&gt;\n&lt;p&gt;Applications are equally open to those who may, either from the outset or subsequently, wish to train less than full time or job share.&lt;/p&gt;\n&lt;p&gt;Please note that there is a strict application policy that applications cannot be accepted after the deadline.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay scales&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All trainees should be paid monthly at the rates set out in the national terms and conditions of service for hospital medical and dental staff and doctors in public health medicine and the community health service (England and Wales), “the TCS”, as amended from time to time. The pay scales are reviewed annually. Part-time posts will be paid pro-rata.&lt;/p&gt;\n&lt;p&gt;Current rates of pay for junior doctors may be viewed on theNHS Employers website&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Enquiries&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Further information regarding HEEYH ACF vacancies is available from the HEEYH Recruitment webpages&lt;/p&gt;\n&lt;p&gt;For any queries that cannot be answered by the methods above please contact;academicrec.yh@hee.nhs.uk with “your name” and the “Question area” in the title of the email.&lt;/p&gt;\n&lt;p&gt;For further national information please visit theSpecialty Training Website&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education Yorkshire and the Humber", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128516"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Yorkshire and the Humber", "postalCode": "S4 7UQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3941", "longitude": "-1.44614"}}, "title": "Academic Clinical Fellowship Oral Mecicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236067", "validThrough": "2020-11-24T23:59:59+0000"}