{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-04T17:37:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Derbyshire Healthcare Foundation NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Psychology Services&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Highly Specialist Clinical Psychologist&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Band 8a – full time – Permanent post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;South Derbyshire and South Dales Older Adult Community Mental Health Teams&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a qualified Clinical Psychologist who is committed to providing the full range of clinical psychological roles and interventions within well-established recovery focused Older Adult Community Mental Health teams that cover the South Derbyshire and South Dales areas. The role will include direct and indirect work with service users, family members, formal and informal carers, and providing consultation, formulation, training, and individual and group supervision to multidisciplinary team colleagues.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be welcomed into a vibrant and creative team of skilled Clinical Psychologists who are committed to working with older people and have extensive experience, knowledge and skill in working with both functional and organic difficulties, in a range of different settings including community teams, crisis teams, in-patient areas and a Memory Assessment Service.&lt;/p&gt;\n&lt;p&gt;Within our team we have Psychologists with further training and experience in a range of therapeutic models including ACT, CFT, family therapy, intensive short-term dynamic therapy, CAT and EMDR, and a number of Psychologists who have done further training in Neuropsychology and are qualified Clinical Neuropsychologists having completed the QiCN.&lt;/p&gt;\n&lt;p&gt;There are excellent opportunities for peer support, to join a range of specialist supervision groups (e.g. focusing on therapeutic models, dissociation, EMDR, neuropsychology) and to participate in regular in-house CPD. There are strong links with the Adult Psychology Service, and many of our projects and supervision groups run across the two specialities. We also have excellent links with local Clinical Psychology Training Courses, and provide regular placements and teaching.&lt;/p&gt;\n&lt;p&gt;The post therefore offers an excellent opportunity to use and further develop post&lt;br /&gt;qualification specialist skills in providing therapy to those presenting with complex mental health difficulties, neuropsychological assessment for individuals with a suspected cognitive impairment, individual and group supervision, and consultation.&lt;br /&gt;The successful candidate will have experience of working with people with a broad range of complex mental health problems and needs (including those arising from an organic impairment), with experience of evidence-based psychological interventions, and will be committed to multidisciplinary team working, have excellent relationship-building skills and be capable of managing varied work demands.&lt;/p&gt;\n&lt;p&gt;The South Derbyshire and South Dales areas include a mixture of towns, villages and more rural areas, including part of the Peak District, an area of outstanding natural beauty, and referrals to the CMHT’s reflect the diversity seen within these areas. For those looking to relocate, Derbyshire offers a good quality of life, good schools, easy access to city and rural areas, and beautiful countryside on your doorstep.&lt;/p&gt;\n&lt;p&gt;The post holder will need to be registered with the Health &amp; Care Professions Council (HCPC), chartered with the BPS, and must be able to meet the travel requirements of the post.&lt;/p&gt;\n&lt;p&gt;If you encounter any difficulty in applying online, please contact the Derbyshire Healthcare Foundation Trust, Recruitment Services Team on 01332 623582 (quoting the job reference number) who will provide the further support you require.&lt;/p&gt;\n&lt;p&gt;We are committed to equal opportunities and improving the working lives of all our staff.&lt;/p&gt;\n&lt;p&gt;We will consider applications to work flexibly.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that we have a provisional date for the interviews for this post of Wednesday 9 December, and anticipate that interviews will be held remotely via Microsoft Teams.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Helen Philpott&lt;br /&gt;Consultant Clinical Psychologist for Older People’s Services / Clinical Neuropsychologist&lt;br /&gt;Mobile: 07775 402 710&lt;br /&gt;Clinical Psychology admin telephone: 01332 268468&lt;br /&gt;Email: helen.philpott1@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Sarah Seale&lt;br /&gt;Service Manager and Dementia Lead&lt;br /&gt;South Derbyshire and Dales Older Adult Community Mental Health Team&lt;br /&gt;Telephone: 0300 123 3376&lt;br /&gt;E-mail: s.seale@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dale Bank View / St Oswald&#39;s Hospital, Swadlincote / Ashbourne", "postalCode": "DE11 0AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7743", "longitude": "-1.55828"}}, "title": "Highly Specialist Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256828", "validThrough": "2020-11-18T23:59:59+0000"}