{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata)"}}, "datePosted": "2020-11-02T14:33:28+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;An exciting opportunity has arisen within our Access Booking and Choice team for a Performance Lead (Band 5) Fixed Term 12 months.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post offers the chance to work within a supportive team, the role will help you develop and strengthen your skills and abilities, whilst giving you the autonomy to shine. This is an excellent opportunity for the right person to take ownership of managing and implementing training of new staff alongside looking for and recommending improvements in current processes working towards embedding these new ways of working.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The right candidate will take ownership for managing and implementing staff performance reporting and analysis of this within the Access Booking and Choice Team. This will include regular audits and liaising with the Data Quality Team for support and discussion. We expect you to have great interpersonal skills and confidence in your communication skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for someone who is highly organised with excellent IT skills and an ability to motivate and engage with staff. The right person will possess a high standard of quality in their work and a high level of attention to detail. If you are this candidate you will operate calmly under pressure and be able to manage a busy workload.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a new and exciting role and a great opportunity for development and learning. This post is suitable for those looking for the opportunity of a secondment however fixed term is also an option.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A presentation will be required as part of your interview. If you are shortlisted, presentation details will be provided to you prior to interview.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information or to arrange an informal discussion about the post, please contact: Roisin Conboy on 01924 543063 or email to roisin.conboy@nhs.net or contact Kerrie Spencer on 01924 543170 or email to kerrie.spencer1@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Access Booking and Choice Performance Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252459", "validThrough": "2020-11-16T23:59:59+0000"}