{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata, pa"}}, "datePosted": "2020-10-26T13:16:29+0000", "description": "&lt;p&gt;NHS Derby and Derbyshire Clinical Commissioning Group (CCGs) is responsible for commissioning health services for the population of Derbyshire, and now have an opportunity for an enthusiastic and forward thinking Clinical Quality Manager to join our Team.&lt;/p&gt;\n&lt;p&gt;Our Team works with our Derbyshire Providers to ensure we provide safe and high quality care which meet the standards expected, and set by the CQC and via commissioning and contracting processes.&lt;/p&gt;\n&lt;p&gt;To be a valued member of our team you will be an experienced clinical practitioner. You must hold a professional / nursing registration.&lt;/p&gt;\n&lt;p&gt;You will understand the strategic and policy direction of the NHS in relation to quality and be adaptive and flexible in your approach to work.&lt;/p&gt;\n&lt;p&gt;You will provide support and direction in the quality performance monitoring of CCG commissioned services; and working collaboratively within the Nursing and Quality Team, relevant programme boards, commissioners and providers you will ensure a consistent and co-ordinated approach to quality assurance and patient safety in commissioning.&lt;/p&gt;\n&lt;p&gt;As a Clinical Quality Manager you will work closely with colleagues within the CCG and also with external stakeholders. You will have excellent communication skills and be confident speaking to people at all levels.&lt;/p&gt;\n&lt;p&gt;Working autonomously, you will have the ability to lead and influence change and be able to motivate a range of professional group.&lt;/p&gt;\n&lt;p&gt;Interview will be held virtually using Microsoft Office Teams.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Chris HowlettJ&lt;/p&gt;\n&lt;p&gt;Senior Clinical Quality Manager&lt;/p&gt;\n&lt;p&gt;chris.howlett@nhs.net&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Please email if you would like to discuss this position on the phone.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128382.jpg", "name": "NHS Derby and Derbyshire Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128382"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cardinal Square (Derby), Derby", "postalCode": "DE1 3QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9256", "longitude": "-1.46833"}}, "title": "Clinical Quality Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242611", "validThrough": "2020-11-08T23:59:59+0000"}