{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-06T13:00:18+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Dietetics Assistant - Band 3 - Dietetics - 26 Hours per week - 1 Year Fixed Term Contract&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join the West Suffolk Dietetic service.  The team consists of 20 Dietitians and 11 Support staff providing an integrated service to West Suffolk Hospital and the wider community.  The West Suffolk Dietetic service is a forward thinking, innovative department that is currently involved in several large scale service development projects that aim to improve patient care and showcase the value of dietetics.  We fully support and encourage professional development opportunities within our service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking a passionate part-time Band 3 Dietetic Assistant to join our self-motivated department to assist the acute Dietetic team.  This is a fixed term post for 1 year and will incorporate clinical and non-clinical tasks.  The post holder will be expected to review patients requiring oral nutrition support under the supervision of the dietitian and oversee special dietary menu provision, as well as carry out some administrative tasks.  The successful candidate will have the opportunity to obtain competencies within their role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Experience of working within Nutrition and Dietetics is advantageous, but training opportunities are available and the successful candidate will be fully supported by the senior dietitians. There is a degree of flexibility available in terms of working days for this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please see job description and personal specification for further details.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like to discuss this role further please contact Clare Merchant Dietitian on 01284 713609 or Clare.Merchant@wsh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does not &lt;/strong&gt;entitle you to apply to park on the Hospital site.  The Trust offer parking off site at the Bury St Edmunds Rugby Club, which is serviced by a regular shuttle bus to and from the Hospital.  Details of the bus timetable can be found in the on-line starter pack.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If required to work on a weekend, the restriction does not apply.  Parking is allowed on site Saturday and Sunday provided a day ticket (£2.10) is clearly displayed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For posts that include “on call” duties successful candidates will need to   complete an application form for access through the barriers from the car park office.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at Enhanced level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Dietetic Assistant - Band 3 - Dietetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259778", "validThrough": "2020-11-20T23:59:59+0000"}