{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata"}}, "datePosted": "2020-11-02T10:46:04+0000", "description": "&lt;p&gt;An exciting opportunity has become available for an experienced and enthusiastic Clinical Psychologist to work within the Solihull Early Intervention team which is part of Solihull Early Intervention is part of Birmingham &amp; Solihull Mental health foundation trust&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Solihull Early Intervention is part of Birmingham &amp; Solihull Mental health foundation trust and are expanding our service to incorporate the at risk mental state(ARMs) and the over 35’s in line with the long term plan.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder should hold a special interest in working with people with psychosis and their families and have at least 18 months experience of assessment, formulation and evidenced based psychological interventions across a variety of people with psychosis or those who are at risk of developing Psychosis (ARMs).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This will be an excellent opportunity for an experienced clinical psychologist to develop their clinical, audit, training and supervisory skills, as well as developing areas of special interest as appropriate. The successful candidate will also be part of a friendly and supportive Psychology Department within Solihull that meets on a regular basis for both peer and professional support and development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Stephen Harrison, CYP HUB Clinical Services Manager (Solihull EIS) or Donna Haskayne (clinical Psychologist on 0121 301 4967.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStephen HarrisonJob titleCYP HUB Clinical Services managerEmail addressstephen.harrison10@nhs.netTelephone number0121 301 4967&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "maple leaf centre, Birmingham", "postalCode": "B37 7JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4696", "longitude": "-1.73925"}}, "title": "Band 8a Clinical Psychologist - Solihull Early Intervention", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251647", "validThrough": "2020-11-15T23:59:59+0000"}