{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27416", "minValue": "27416", "unitText": "YEAR", "value": "£27,416 pro rata per annum"}}, "datePosted": "2020-11-02T14:02:06+0000", "description": "&lt;p&gt;Flexibility is the key to a healthy work life balance, are you looking for work to fit in with your commitments or alternatively looking for a permanent position but not ready to commit just yet?&lt;br /&gt;&lt;br /&gt;If you have answered yes to any of the above questions then temporary staffing could be just what you are looking for:-&lt;br /&gt;&lt;br /&gt;The Trust’s temporary staffing offers a range of shifts including early, late, night and long day, you choose the shift that you want to work and when you want to work. You control your working pattern working as little or as often as you like. The Trust will offer training to support your core clinically skills if required, you will have the opportunity to discuss this at interview.&lt;br /&gt;&lt;br /&gt;Alternatively if your long term aim is to secure a permanent contract, then working for the temporary staffing offers you the opportunity to work in a range of different wards and departments. This could help you decide on the area that you would ultimately like to work on; temporary work is often the stepping stone into something more permanent.&lt;br /&gt;&lt;br /&gt;If you are a Children&#39;s Registered Nurse interested in joining our temporary staffing services please submit an application form. &lt;br /&gt;&lt;br /&gt;&lt;br /&gt;The Trust also offers other benefits:&lt;br /&gt;• Flexible working&lt;br /&gt;• Access to the NHS pension scheme&lt;br /&gt;• Paid induction/mandatory training&lt;br /&gt;• Free uniform&lt;br /&gt;• On site nursery&lt;br /&gt;&lt;br /&gt;&lt;span&gt;&lt;strong&gt; Please note that the Trust is unable to obtain sponsorship for temporary staffing positions&lt;/strong&gt;&lt;/span&gt;.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Recruitment Centre&lt;br /&gt;&lt;br /&gt;If your application is shortlisted, you will be invited to attend an Recruitment Centre.This Recruitment Centre is intended to provide you with the opportunity to demonstrate how you would treat our patients and staff for whom we care, with the compassion, courtesy, dignity and respect they deserve.&lt;/p&gt;\n&lt;p&gt;Recruiting to Values&lt;br /&gt;&lt;br /&gt;To ensure that we provide world-class patient care, UHCW recruits people that can demonstrate the Trust’s Values and Behaviours in their everyday life. Therefore, if you are invited to interview, you will be undertaking aValues Based Interview,which explores not only what you do but how and why you do it.&lt;br /&gt;&lt;br /&gt;Before applying, we encourage you to review the Trust’s Values and Behaviours Framework and Values Based Recruitment Factsheet which can be accessed on the right side of this page under the job description.&lt;br /&gt;&lt;br /&gt;The Supporting Information Section in your application should therefore reflect your understanding of the Trust’s Values and associated Behaviours. You will be expected to provide us with examples from work experience and/or personal life which demonstrate these values through your behaviour.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHCW, Coventry, CV2 2DX", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Registered Nurse - Temporary Staffing Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252339", "validThrough": "2020-11-16T23:59:59+0000"}