{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive"}}, "datePosted": "2020-11-03T08:45:53+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a busy tertiary level three neonatal intensive care unit (NICU) with close links to the other UCLH specialist hospitals and Great Ormond Street Hospital. Currently we care for 22 intensive / high dependency care babies including neurological cots for infant cooling, 12 special care babies and 12 transitional care cots&lt;/p&gt;\n&lt;p&gt;Our NICU is the Level 3 unit for the North Central London area which provides specialist intensive care for critically ill babies. We also have close links with an on-site fetal medicine unit which is a regional, national and international referral centre for fetal medicine, caring for more than 7,000 patients each year. In addition, they have an internationally recognised multidisciplinary team (MDT) who offers individualised care for pregnant women and their families, when there is a concern for the health of an unborn baby. We hence can provide a wealth and varied unique range of experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to develop your career in Neonatal Nursing this is an ideal time to come and join us.&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;You will gain valuable skills and experience being fully supported by a Practice Development team. There are an extensive range of opportunities for you to further your career for progression to Band 6. &lt;br /&gt;&lt;br /&gt;If you are committed to contributing to a team delivering excellence in neonatal care and serious about pursuing a rewarding career UCLH, neonatal services is definitely the place for you. You will be joining an enthusiastic, friendly, motivated multidisciplinary team working within a centre of excellence for neonatal and maternity care.&lt;/p&gt;\n&lt;p&gt;We have a strong commitment to staff development and service improvement, having commissioned links with City and South Bank Universities and can offer an accelerated career pathway for suitable candidates. &lt;br /&gt;&lt;br /&gt;&lt;span&gt;This is an exciting opportunity to join one of the largest Foundation Trusts in the UK with an international reputation and a tradition of innovation.&lt;/span&gt; &lt;br /&gt;&lt;br /&gt;We are situated in central London within easy commute of all major train stations, and have excellent tube links. And you’ll be perfectly positioned outside work too, as we’re located right in the heart of London’s West End.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For enquiries please contact Becky Shelley 07931249460&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253179", "validThrough": "2020-11-11T23:59:59+0000"}