{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum"}}, "datePosted": "2020-10-28T10:02:04+0000", "description": "&lt;p&gt;You can expect a warm welcome at Milton Keynes University Hospital, our staff are friendly and welcoming. We listen to each other and work together to embed our Trusts values and behaviours.  At MKUH we appreciate our staff and reward them with an outstanding benefits package including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free on-site parking&lt;/li&gt;\n&lt;li&gt;Free tea and coffee&lt;/li&gt;\n&lt;li&gt;Great flexible working opportunities&lt;/li&gt;\n&lt;li&gt;Discounted gym membership&lt;/li&gt;\n&lt;li&gt;Lease car scheme&lt;/li&gt;\n&lt;li&gt;Generous annual leave and pension scheme&lt;/li&gt;\n&lt;li&gt;On site nursery (chargeable)&lt;/li&gt;\n&lt;li&gt;Extensive staff health and well-being programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Milton Keynes University Hospital NHS Foundation Trust, in partnership with the University of Buckingham, is a University Teaching Hospital; we conduct research and teaching on site to improve the care of our patients. The hospital is undergoing significant investment, and we are proud to be rated good by the CQC. Visit our website to catch up on our latest news.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join a multidisciplinary team, which includes medical teams, physiotherapists, dietitians and specialist nurses, in the care of babies, children, young people and their families in a clinic setting.&lt;/p&gt;\n&lt;p&gt;There are a variety of follow-up clinics that support babies, children, young people and their families to manage their medical requirements at home. Paediatric Outpatients run across several sites and departments.&lt;/p&gt;\n&lt;p&gt;Across every area of the Paediatric Unit we continually strive, as a multidisciplinary team, to offer high quality, evidenced based and holistic care to all of our children. We believe that we have much to offer any candidate who joins our team. Indeed we recognise that it’s also about you!!&lt;/p&gt;\n&lt;p&gt;As a Unit we have an active preceptorship and an exciting education programme and we encourage all staff to undertake internal and external courses to ensure their continued development. Opportunities include both internal and external study days and University based courses such as Mentorship.&lt;/p&gt;\n&lt;p&gt;Successful candidates may be eligible for:&lt;br /&gt;• A recruitment and retention premium;&lt;br /&gt;• Relocation and accommodation assistance;&lt;br /&gt;• Funding support for tertiary level education.&lt;/p&gt;\n&lt;p&gt;We require an enthusiastic, caring and motivated individual to join our team and provide dynamic, high quality nursing care to children, young people and babies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The closing date for applications is 9th November 2020, interviews are due to take place either face to face or on MS Teams on 26th November at MKUHFT, social distancing will be adhered to as required by COVID -19 restrictions.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you’re interested in applying for this role, we’d encourage you to get in touch with: &lt;/strong&gt;&lt;strong&gt;Natalie Waters on 01908 996588 or natalie.waters@mkuh.nhs.uk &lt;/strong&gt;&lt;strong&gt;with any questions or if you would like to arrange a phone call or an informal visit.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120888.png", "name": "Milton Keynes University Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120888"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paediatric Assessment Unit (Dept), Milton Keynes", "postalCode": "MK6 5LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0264", "longitude": "-.735774"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245969", "validThrough": "2020-11-10T23:59:59+0000"}