{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754"}}, "datePosted": "2020-11-06T08:30:32+0000", "description": "&lt;p&gt;***Please note this is an INTERNAL VACANCY ONLY for NUH employees, therefore only current employees of Nottingham University Hospitals NHS Trust will be considered for the post.***&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pathology Lead Scientist.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a new role in the CAS Division, which seeks to strengthen scientist leadership within the Pathology Care Group. The post holder will work alongside the Deputy Divisional Director and Clinical Director for Pathology and the Pathology General Manager to lead Pathology services in the Division.&lt;/p&gt;\n&lt;p&gt;The CAS Division encompasses services on both QMC and City campuses, and consists of Oncology, Urology, Clinical Haematology, Renal and Transplant, Specialist Palliative Care, Thoracic Surgery, Burns and Plastics, Breast Services and Pathology Services and is a very busy and varied Division.&lt;/p&gt;\n&lt;p&gt;This role will support the provision of the strategic direction and expert leadership within the Pathology Care Group and you will be required to provide expert advice, opinion and leadership to other professionals and may act as clinical lead in a given area as necessary.&lt;/p&gt;\n&lt;p&gt;You will direct the development and innovation in service practice, research, teaching and training with specific focus on workforce planning, recruitment and retention and have an expert understanding of specialist healthcare science activities and management knowledge acquired through higher specialist training.&lt;/p&gt;\n&lt;p&gt;The post holder will represent the Division at internal and external meetings, with a specific focus on the transformational aspects of the services e.g. LIMS replacement, Sherwood Forest Partnership and Midlands East 2 Pathology Network, Cambridge University Hospitals as part of the National Genomics reconfiguration.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmanda KempJob titleCAS Divisional General ManagerEmail addressAmanda.kemp2@nuh.nhs.ukTelephone number07812 270167&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City campus, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "CAS Pathology Care Group Lead Scientist ***NUH APPLICANTS ONLY***", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258910", "validThrough": "2020-11-19T23:59:59+0000"}