{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa (pro rata)"}}, "datePosted": "2020-10-14T13:30:32+0100", "description": "&lt;p&gt;If you&#39;ve been spending the whole day looking for that perfect opportunity, your search is over.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for three infection prevention and control practitioners to be appointed. Applicants should be enthusiastic, motivated and hardworking healthcare professionals. You should have 2 years&#39; experience at Band 5 or above and a proven interest in infection prevention and control. We have plans in place to make a big impact over the coming year, as well as continuing to respond to the challenges of the COVID-19 pandemic.&lt;/p&gt;\n&lt;p&gt;You will be working as a member of a friendly, supportive specialised Infection Prevention and Control team and your role will include assisting in the citywide delivery of the infection prevention and control strategy which includes; surveillance and investigation of health care associated infections, educating and training staff in infection control practices, auditing, innovative preventative measures. There will also be the opportunity to carry out other specific IP&amp;C projects. We work citywide supporting LCH staff, patients and services, as well as services throughout the wider system such as schools and nurseries, GP Practices, Care Homes etc. &lt;br /&gt;&lt;br /&gt; The successful applicant requires the ability to make decisions, work well within a team in a fast paced environment and the ability to work independently when required is essential. You will have excellent communication skills, be able to work flexibly and be committed to meeting deadlines and targets. You must display a passion for high quality patient focused care. &lt;br /&gt;&lt;br /&gt; The post will be based at Chapeltown Health Centre, however post holders will be expected to work throughout the city as required, therefore being a car driver is essential.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123894.jpg", "name": "(CC) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS7 4BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8115", "longitude": "-1.52622"}}, "title": "Infection Prevention and Control Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226425", "validThrough": "2020-11-09T23:59:59+0000"}