{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 per annum"}}, "datePosted": "2020-10-12T10:59:04+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Specialist Practitioner CAMHS Harmful Sexual behaviour Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Evergreen House&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £38,890 to £44,503&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a specialist CAMHS role within Harmful Sexual Behaviour services in Gloucestershire. It is a new opportunity to join a small established team who offer a service to children and young people who have engaged in harmful sexual behaviours. The post holder undertakes specialist assessments, interventions and consultations for which training and regular supervision is provided and there is also the opportunity to do joint work with experienced clinicians. There is close interagency working and the specialist also sits within a broader multi- disciplinary team at our CAMHS base.&lt;/p&gt;\n&lt;p&gt;Ideally the candidate will have experience in delivering services to young people but specialist skills with adults may be transferable if the candidate can explain in their application their aptitude for this. Likewise, we would ideally seek someone who has some professional experience within harmful sexual behaviour but we would consider applicants who can demonstrate experience in closely allied specialisms and the capacity to learn the needed skills.&lt;/p&gt;\n&lt;p&gt;Key skills and ideal experience for the role are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of working professionally with children of all ages and their families/ carers&lt;/li&gt;\n&lt;li&gt;An understanding of child development and the factors that impact on HSB&lt;/li&gt;\n&lt;li&gt;Knowledge of evidence-based assessment and intervention models for children and young people with sexually harmful behaviour&lt;/li&gt;\n&lt;li&gt;Knowledge of risks and protective factors in relations to HSB&lt;/li&gt;\n&lt;li&gt;An ability to manage hearing and communicating sensitive and sometimes distressing information with children, families and professional networks&lt;/li&gt;\n&lt;li&gt;Confidence in delivering consultation, training and advice to multi-agency staff&lt;/li&gt;\n&lt;li&gt;Work well in a small, multi-professional team and be able to work independently across the county&lt;/li&gt;\n&lt;li&gt;Have the ability to think flexibly and respond to the unique demands of many different situations, cultures and contexts&lt;/li&gt;\n&lt;li&gt;Have expertise in assessing and acting upon risk, protective and resilience factors and developmental issues that have to be considered.&lt;/li&gt;\n&lt;li&gt;Be able to work in partnership with professionals from a range of agencies to safeguard children.&lt;/li&gt;\n&lt;li&gt;Have skills and confidence to contribute to CYPS service wide clinical tasks. This currently amounts to about 6 hours a month spent on tasks such as self harm follow up appointments and a duty type role. Full induction and training are given.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is not an exhaustive list and we would welcome any interested applicant phoning us to discuss the role in more detail. This role holds a generic CAMHS job description, however specialist skills and responsibilities related to this work role will be clearly reflected within a personalised job plan. Please note that the Band 7 Job Description and Person Specification can be found under the &#39;Additional Document&#39; link.&lt;/p&gt;\n&lt;p&gt;The HSB team sits within a wider CAMHS specialist service for vulnerable children. There is a strong, positive and supportive team culture where practitioners share formulations, care planning and develop skills and colleagues are pleased to support each other in practical and emotional terms. We have a programme of CAMHS in house training and robust clinical supervision and workload management support. We offer opportunities to develop specialist skills through a range of Continuing Professional Development activities both externally and internally and ensure our team is up to date with the latest specialist evidence-based practice.&lt;/p&gt;\n&lt;p&gt;The successful applicant must have a current registered professional qualification, for example, psychology, mental health nursing, social work, occupational therapy, etc, as outlined in the person specification.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are keen to develop a more representative diversity of our senior staff and particularly encourage applications from those individuals with protected characteristics - in particular from BAME, LGBTQ and disabled candidates.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 12th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 13th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information please contact: Andie Collins or Ruth Turnbull at Acorn House, Gloucester, 01452 894300 andie.collins@ghc.nhs.uk; ruthturnbull@ghc.nhs.uk;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional information:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cheltenham", "postalCode": "GL53 9DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8811", "longitude": "-2.07367"}}, "title": "Specialist Practitioner - CAHMS - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221969", "validThrough": "2020-11-12T23:59:59+0000"}