{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa (pro rata)"}}, "datePosted": "2020-10-30T10:01:46+0000", "description": "&lt;p&gt;Associate School Nurse&lt;/p&gt;\n&lt;p&gt;Paediatric Nurse, Band 5&lt;/p&gt;\n&lt;p&gt;37.5 hours Term time only&lt;/p&gt;\n&lt;p&gt;0-19 Core Team (Wirral) Integrated Children’s Division&lt;/p&gt;\n&lt;p&gt;Are you passionate about caring for and supporting some of the most vulnerable children and young people in the Wirral area who are equally inspirational and unique? Do you want to work in a supportive, quality driven, dynamic and friendly environment? If so this could be the job for you!&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen within the special school nursing team; The successful candidate will work 37.5 hours term time only over 5 days per week Term Time Only within a team that covers 4 special schools age ranging from 2-19.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and enthusiastic individual with excellent communication skills. Experience working with vulnerable children and young people is essential and the ability to work within a multi-agency partnership environment. We pride ourselves on delivering quality individualised care to children and young people with their families ensuring a holistic approach to their health needs. The successful candidate will share this commitment and demonstrate the trust values and vision.&lt;/p&gt;\n&lt;p&gt;As a special school nurse, you can make a real difference to children and families. Responsibilities will include supporting other team members to deliver a high quality standard of care, managing chronic health needs whilst assessing, planning, implementing and evaluating the needs of the school population. Preceptorship and support will be offered to the successful candidate(s).&lt;/p&gt;\n&lt;p&gt;If this sounds like the role for you, please contact us for further information or to answer any questions you may have. Please feel free to arrange an informal visit to meet the team you hopefully will be a part off.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Elly Wright&lt;/p&gt;\n&lt;p&gt;Job title: Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: elly.wright1@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07711 400 034&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126754.png", "name": "Wirral Community Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across four special schools located within the Wirral, Wirral", "postalCode": "CH42 0LQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3799", "longitude": "-3.02641"}}, "title": "Associate School Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249601", "validThrough": "2020-11-14T23:59:59+0000"}