{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £31,365 - £37,890 per annum"}}, "datePosted": "2020-10-15T17:30:27+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic full time Occupational Therapist to join our team working with people with dementia predominantly in an inpatient setting within our attractive and modern recently built Fosspark Hospital. With our new building comes fantastic new opportunities to grow into our space, make new connections with the community and provide exceptional care in a fresh therapeutically designed environment.&lt;/p&gt;\n&lt;p&gt;This is a great development opportunity for both experienced band 5 staff who want to experience added responsibility, and existing band 6 staff who wish to broaden their knowledge further in an alternate service area.&lt;/p&gt;\n&lt;p&gt;Occupational therapy will be provided as a deliverable intervention which aims to support users in personally meaningful recovery of ordinary lives and daily occupation/s. A commitment to assessment of occupational need and the therapeutic use of occupation based intervention as core to role is essential.&lt;/p&gt;\n&lt;p&gt;The occupational therapist will work as part of a multi-disciplinary team committed to collaborative working, and focusing on the provision of high quality evidence based services to individuals or groups.&lt;/p&gt;\n&lt;p&gt;The post will offer varied opportunities for training and development, with CPD needs being identified and monitored through appraisal. Well defined supervision systems are in place.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Trish Shaw, Lead Occupational Therapist pshaw4@nhs.net 07468354108&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Foss Park Hospital, York", "postalCode": "YO31 8TA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9746", "longitude": "-1.07582"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229173", "validThrough": "2020-11-11T23:59:59+0000"}