{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 £24,907 - £37,890 per annum This"}}, "datePosted": "2020-11-03T12:01:21+0000", "description": "&lt;p&gt;We have an exciting opportunity in our Adult Acute Mental Health Service in St Albans for a Band 5 to 6 Occupational Therapist. This is a developmental post and will form an integral part of the existing occupational therapy team at the Albany Lodge inpatient unit.&lt;/p&gt;\n&lt;p&gt;The postholder will provide occupational therapy expertise within the multi-disciplinary team,&lt;br /&gt;including specialist assessment, individual and group work intervention. The team further consists of a Highly Specialist Occupational Therapist, Assistant Therapy Practitioner, Recreational Worker, and a Horticultural Therapist. The ward also benefits from access to Psychology.&lt;/p&gt;\n&lt;p&gt;Robust supervision and support will be provided by the Band 7 Occupational Therapist and more widely by the Professional Lead Occupational Therapist for adult acute mental health services. A competency framework has been developed to support individuals to transition successfully from a Band 5 to Band 6 level and a bespoke training package will be offered in order to contribute to each individual’s development. Ideally individuals will make the transition to Band 6 within six months of starting in post however this will be assessed on an individual basis.&lt;/p&gt;\n&lt;p&gt;We are looking for an existing Band 5 Occupational Therapist who is looking to take that next step in their career, and who are passionate about providing excellent care to the adult acute mental health population. Potential candidates would have needed to have completed their initial 12 month preceptorship training, however exceptional candidates who are close to completing this will also be considered.&lt;/p&gt;\n&lt;p&gt;Please note that this post is also open to existing Band 6 OT’s and if successful, will commence post at the Band 6 level.&lt;/p&gt;\n&lt;p&gt;The postholder will play an integral role in the redesign of the acute mental health Occupational Therapy service in HPFT; ensuring that our interventions are robust and based on the best evidence available. A sound working knowledge of the Model of Human Occupation (MOHO) and its application to practice is essential. There are regular opportunities to network with other OT&#39;s in the Trust to share ideas and good practice. We also provide a CPD training programme and there are opportunities to apply for external courses.&lt;/p&gt;\n&lt;p&gt;Please note we will be holding interviews virtually on Friday the 20th November.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Stephanie Levene, Highly Specialist Occupational Therapist by phone on 01727 834 330, or by email at stephanie.levene@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Albany Lodge, St Albans", "postalCode": "AL3 5JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7551", "longitude": "-.343673"}}, "title": "Occupational Therapist Band 5 - 6  Development Post", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253870", "validThrough": "2020-11-10T23:59:59+0000"}