{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-23T11:02:20+0100", "description": "&lt;p&gt;&lt;strong&gt;Commissioning Team - North East and Yorkshire Region&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Primary Care Manager - Band 8a&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Substantive Post - 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As Primary Care Manager, the post holder will work as part of a dynamic team in delivering an effective service supporting managers and staff across the Commissioning Directorate to support the delivery of the direct commissioning of primary care in conjunction with delegated CCGs.&lt;/p&gt;\n&lt;p&gt;The Primary Care Team plays a key role in supporting the local STP/ICS with the delivery of local place-based delivery plans working in collaboration with all partners. The role therefore supports the ICS in driving transformation as well as value for money in planning, commissioning and service. The role is designed to build a combination of subject matter expertise and technical skills to develop a strong service delivery.&lt;/p&gt;\n&lt;p&gt;The post holder will be a key member of the North East and Yorkshire Primary Care GP Contract and Commissioning Team whose overarching goal is to deliver an exciting and challenging Primary Care commissioning agenda across the North East and Yorkshire.&lt;/p&gt;\n&lt;p&gt;The primary care contract manager will :-&lt;br /&gt;• Lead on the development of a portfolio of primary care contracts&lt;br /&gt;• To support the delivery of day to day activities and projects&lt;br /&gt;• To manage the team and drive delivery of a range of business initiatives and projects&lt;br /&gt;• Lead the team in the delivery of project plans, allocating tasks as appropriate, identifying risks, issues and dependencies, considering best practice and current options and ultimately making decisions in the best interest of the project.&lt;br /&gt;• Pro-actively manage stakeholders, respond to and resolve conflict when this arises through facilitation&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to be able to travel across North East and North Cumbria, in addition to the wider North East and Yorkshire region.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Jenny Long&lt;/p&gt;\n&lt;p&gt;Email address: jenniferlong@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Waterfront 4, Newcastle", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Primary Care Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240212", "validThrough": "2020-11-08T23:59:59+0000"}