{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-10-28T14:16:09+0000", "description": "&lt;p&gt;We are seeking to recruit an Apprentice receptionist to work in the Audiology Department based at Withington Community Hospital.&lt;/p&gt;\n&lt;p&gt;The Department also covers services at Wythenshawe Hospital and is comprised of an Audiology Manager, Clinical Scientists Audiologists, Assistant practitioners, Students and 2 other administration staff.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for providing Reception and administrative duties in Audiology at the Withington Community Hospital.&lt;/p&gt;\n&lt;p&gt;They will be communicating with a range of people including professional, administrative staff and patients with communication difficulties.&lt;/p&gt;\n&lt;p&gt;The duties will include dealing with patients attending the service clinic including hearing aid battery supply. Booking in patients attending appointments and arranging some appointments, telephone queries, sorting and distribution of mail (electronically and paper form), data entry, reception stock maintenance, dealing with telephone calls for the regional calibration services and other general office duties.&lt;/p&gt;\n&lt;p&gt;Experience of reception duties and using the Hospital Choose and Book and Patient Management System (PMS - Lorenzo) would be an advantage but training will be given. The department has an Audiology patient management system for which training will be given.&lt;/p&gt;\n&lt;p&gt;If you have transferable skills and experience but not the qualifications, we may be able to offer an apprenticeship role to support your development. Please note, this is subject to apprenticeship eligibility checks.&lt;/p&gt;\n&lt;p&gt;Applicants who are offered an apprenticeship will be paid at £17,051.04 per annum and will progress to Band 2 £18,005 - £19,337 per annum upon successful completion. If you are already qualified you will commence at the bottom of Band 2.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMrs Kathryn LewisJob titleHead of Audiology,Email addressKathryn.lewis@mft.nhs.ukTelephone number0161 217 3206&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Withington Community Hospital, West Didsbury", "postalCode": "M20 2LR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4252", "longitude": "-2.24522"}}, "title": "Receptionist and Clerical Support", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246939", "validThrough": "2020-11-08T23:59:59+0000"}