{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "90928", "minValue": "60257", "unitText": "YEAR", "value": "£60,257 - £90,928"}}, "datePosted": "2020-10-28T11:47:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an experienced GP with a passion for Quality patient care?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to be part of a new way of delivering primary care based on a nurse lead Multi-disciplinary team approach?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Then Hwb Iechyd Cybi would like to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Hwb Iechyd Cybi you will be working closely with other health board services, the community resource team, voluntary and charitable organisations to provide quality care for patients across three sites. You will have the opportunity to grow and develop your own skills, knowledge and network whilst making a difference to the lives of our patients.&lt;/p&gt;\n&lt;p&gt;Our passionate and caring team offers GPs a flexible approach to work patterns with full or part time contracts to ensure a healthy work life balance with a strong award winning team to support you.&lt;/p&gt;\n&lt;p&gt;You will find this fresh approach to primary care a rewarding and a positive way to grow. Utilising modern models of triage like e consult and engaging with patients via video consultations and Accurx we ensure our GPs time is directed where it needs to be, bringing back the focus on quality medicine, Care and compassion. With future plans to become a teaching practice there is so much a GP can gain from being part of the Hwb Iechyd Team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Sites:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hwb Iechyd Cybi is based across three sites. Two purpose built surgeries overlooking the sea and port just two minutes’ walk into the main town and also at the community hospital in the North of Anglesey.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We believe in trust, team work and communication. Our new way of working provides a modern primary care that helps us ensure that our staff feel valued, focused on their role and that they have the drive and ambition they need to achieve their own personal potential.&lt;/p&gt;\n&lt;p&gt;As a Health Board Managed Practice, with a list size of 11,000 patients you will receive an attractive salary, opportunities for training and support in any clinical specialist area you may have.&lt;/p&gt;\n&lt;p&gt;We’re looking for a number of GPs to join our team. The pay range we offer is £60,257 - £90,928 pro rata. Depending on experience and responsibilities within the role.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;We offer a generous relocation package of up to £8k.&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;We are able to be flexible on your contract with full, part or portfolio contacts available&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Generous annual leave allowance, of 30 days +10 bank holidays.&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;The potential opportunity to work from home&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full GMC Registration.&lt;/li&gt;\n&lt;li&gt;Certificate of Completion of Training (CCT) in General Practice / Certificate Confirming Eligibility for General Practice Registration (CEGPR), or equivalent.&lt;/li&gt;\n&lt;li&gt;Included on a Medical Performers List or eligible.&lt;/li&gt;\n&lt;li&gt;Evidence of continuous professional development.&lt;/li&gt;\n&lt;li&gt;Interest in learning the Welsh Language&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Undertake duties and responsibilities associated with a GP working in a Primary Care setting.&lt;/li&gt;\n&lt;li&gt;Act as a GP Consultant for the Advanced clinical nurse team and practice nursing team on a daily basis&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Location:&lt;/strong&gt; Caergybi (Holy Island) is the North end of Anglesey. A scenic and serene location with the famous south stack light house and popular beaches in Treaddur Bay and Port Dinas. With coastal walks, a nature reserve and a market town, Caergybi is a popular location for visitors from around the world.&lt;/p&gt;\n&lt;p&gt;With a wide range of villages on the outskirts of the town itself you will find extremely good value property to either purchase or rent. Either beach front or rural with mountain and or sea views the choices of locations are all very easily accessible with the A55 ending at the town and the practice sites are two minutes’ drive from the main A55 road.&lt;/p&gt;\n&lt;p&gt;This family friendly town is in an easy driving distance to number of great state and independent schools, a college with multiple sites across the Island that offers a huge variety of courses at varying levels, and we have an easy accessible University nearby (Bangor) and the A55 leads you to anywhere you would want to go in North Wales.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Should You Apply?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Being part of a multi service approach to patient care with a focus on excellence.&lt;/li&gt;\n&lt;li&gt;Opportunity to be involved in developing the services provided by Managed Practices and to focus on quality medicine.&lt;/li&gt;\n&lt;li&gt;Flexible working hours, with full or part time applications welcomed.&lt;/li&gt;\n&lt;li&gt;The opportunity to provide inspirational ideas and implement them with the full support of an excellent team.&lt;/li&gt;\n&lt;li&gt;Support in learning the Welsh Language ( not essential)&lt;/li&gt;\n&lt;li&gt;The opportunity to teach, train, coach and supervise clinicians for the future of the service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal no-obligation visit (in confidence) please contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Bethan Jone&lt;/span&gt;&lt;span&gt;s, Area Medical Director-West on 01286 674240 or e-mail Bethan.M.Jones&lt;/span&gt;@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Wyn Thomas, Assistant Area Director Primary Care - West on 01286 674243 or email Wyn.Thomas@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Keith Amos, Head of Service for Managed Practices (West) on 03000 852327 or email Keith.Amos@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hwb Iechyd Cybi, Holyhead", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Salaried GP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246431", "validThrough": "2020-11-29T23:59:59+0000"}