{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 £21,089 - £23,761 p.a"}}, "datePosted": "2020-10-28T11:00:47+0000", "description": "&lt;p&gt;A fantastic opportunity has arisen for a friendly and proactive individual to join our theatre team at Trafford General Hospital to help deliver our inpatient service. &lt;br /&gt;&lt;br /&gt;This person will be responsible for the day to day management and full utilisation of all theatre lists at the Trafford General Hospital site and close working with Wythenshawe Theatre Scheduler, ensuring that all targets are adhered to and met.&lt;br /&gt;&lt;br /&gt;You will need to demonstrate good communication, organisation and prioritisation skills and be able to work on your own initiative under minimal supervison. &lt;br /&gt;&lt;br /&gt;You will need to be a team player who will be able to show a tactful and sensitive role to the job as well as being showing a calm head under pressure. A knowledge of ORMIS is essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBernadette ShielsJob titleService ManagerEmail addressbernadette.shiels@mft.nhs.ukTelephone number01612912372Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Theatre Scheduler for Wythenshawe, Trafford, Withington and Altrincham Hospitals (WTWA)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A unique opportunity has arisen to join the Theatres Directorate in the pivotal role of Theatre Scheduler/ORMIS Administrator. The post holder will be based mainly at Trafford General Hospital but will be required to work at Wythenshawe to cover colleagues when required.&lt;/p&gt;\n&lt;p&gt;The post holder will have operational responsibility for the day-to-day administration of the Trust’s ORMIS theatre scheduling system, ensuring that services within Theatres are run as efficiently and effectively as possible. This will be achieved through excellent planning, organisation and collaborative working with all key stakeholders within the Theatre environment.&lt;/p&gt;\n&lt;p&gt;The post is key to driving forward improvements in productivity and efficiency within Theatres, and offers the successful candidate lots of opportunity for both personal development and the ability to make real impact and improvements to the way that Theatres currently operate.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent communication and organisation skills, as well as an ability to analyse and compute complex data. A proactive, professional, positive outlook and the flexibility to embrace change are also essential elements of this role.&lt;/p&gt;\n&lt;p&gt;For further details please contact:&lt;/p&gt;\n&lt;p&gt;Bernie Shiels, Specialty Lead Manager for Theatres either via telephone 01612912372 or email bernadette.shiels@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Hospital, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Theatre Scheduler", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246205", "validThrough": "2020-11-11T23:59:59+0000"}