{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-29T12:45:12+0000", "description": "&lt;p&gt;We are looking to appoint a highly motivated individual to work as part of the Management Accounting team based in Wakefield.&lt;/p&gt;\n&lt;p&gt;This is a rewarding and challenging role requiring financial and budgetary expertise, underpinned by excellent communication and negotiation skills. This post will suit someone keen to progress, who is enthusiastic, self-motivated and has the ability to work under pressure and meet deadlines.&lt;/p&gt;\n&lt;p&gt;The Senior Management Accountant will be working as part of a team responsible for supporting Trust’s Corporate Services by delivering a high quality and timely financial management service to all budget holders. The post holder will also be expected to support the senior Finance team as required including report writing, forecasting, costing, budget setting, annual planning and expenditure analysis.&lt;/p&gt;\n&lt;p&gt;The successful applicants will be AAT qualified or equivalent and will be confident of working on their own and liaising with budget holders to ensure an accurate financial position is reported whilst supporting managers to deliver and develop their service.&lt;/p&gt;\n&lt;p&gt;Contact Details:&lt;/p&gt;\n&lt;p&gt;Rob Adamson – Deputy Director of Finance - 07882 818856&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 3SP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6988", "longitude": "-1.49218"}}, "title": "Senior Management Accountant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248359", "validThrough": "2020-11-13T23:59:59+0000"}