{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-23T08:49:34+0100", "description": "&lt;p&gt;This is an exciting opportunity to join a busy Acute NHS Foundation Trust as Team Lead Specialist Occupational therapist for Stroke Rehabilitation on the Trust’s main site, the Royal Devon &amp; Exeter Hospital (Wonford), working on both the Acute Stroke Unit and the Stroke Rehabilitation Ward.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with the Team Lead Physiotherapist, Stroke MDT and Discharge Co-ordinator to provide an effective interdisciplinary service with specialist assessment, diagnosis, treatment and advice to patients and their carers. The caseload will include a wide range of acute and chronic stroke care cases, many having complex disabilities and needs.&lt;/p&gt;\n&lt;p&gt;The post holder will assess and formulate treatment plans for a caseload including patients with a range of physical &amp; cognitive deficits after stroke. The post holder will have skills in a variety of standard and non-standard assessments; and be able to support physical and cognitive recovery through functional rehabilitation activities.&lt;/p&gt;\n&lt;p&gt;The post holder will give direction to the rehabilitation support workers including the induction and training of this staff group and ensuring that all staff provide effective assessments and interventions through a process of objective setting, supervision and joint working. The post holder is responsible for ensuring that systems are in place to prioritise and manage the caseload within the context of the Stroke Sentinel Audit Programme (SSNAP) targets. Caseloads will be flexible and at times will involve the provision of service to other areas of the Trust. This post has a commitment to weekend and bank holiday working. The post-holder must be able to drive and have access to a road-worthy vehicle.&lt;/p&gt;\n&lt;p&gt;Typical Hours 8.15-16.30.&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Team Lead Occupational Therapist - Stroke", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239728", "validThrough": "2020-11-06T23:59:59+0000"}