{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 Per Annum"}}, "datePosted": "2020-10-09T16:16:21+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We welcome applications for a Consultant Radiologist to join the MSK Radiology Team at York. This opportunity has arisen due to imminent retirement.&lt;/p&gt;\n&lt;p&gt;The post is based at York Hospital and covers work across associated sites.&lt;/p&gt;\n&lt;p&gt;The role will focus on MSK ultrasound, CT (including dual energy) and MRI reporting and there will be opportunities to develop subspecialty interests. Excellent relationships with our Orthopaedic surgeons and Rheumatologists are maintained by weekly MDTs. A monthly infected arthroplasty MDT and 6 monthly sarcoma meeting provide added interest. The candidate will be encouraged and supported to strengthen the busy MSK interventional service covering a broad range of image-guided procedures, including bone biopsy and RF ablation. Equally there will be exciting teaching and research opportunities. A new orthopaedic centre of excellence in York is developing links with the Trust.&lt;/p&gt;\n&lt;p&gt;The role includes a commitment to general responsibilities in the department. Acute CT and MRI reporting is team-based within a recently established Acute Reporting Hub, allowing radiologists to focus on their subspecialty whilst supporting the general acute work. All radiologists contribute a 2-hour weekly session as the Duty Radiologist. On call is currently outsourced from 9pm and approval has been given to reduce the on-call commitment further.&lt;/p&gt;\n&lt;p&gt;York Hospital has 2 MRI scanners and 3 CT scanners. Scarborough Hospital has 1 MRI scanner (upgraded 2018) and I CT scanner with funding approved for a second. We will be submitting a bid for SPECT CT soon. There are 5 ultrasound machines at both sites&lt;/p&gt;\n&lt;p&gt;£40million has been guaranteed for development of ED at Scarborough Hospital.&lt;/p&gt;\n&lt;p&gt;The Radiology department is committed to teaching. We support radiology trainees from both Leeds and Hull rotations and the Department is consistently rated highly by trainees. We have strong links with Hull York Medical School, providing excellent opportunities for teaching and training.&lt;/p&gt;\n&lt;p&gt;The radiologists are a cohesive and friendly group, working well as a team and with clinical colleagues. Within the Department you will find a strong culture of sharing expertise and seeking advice. Our management team is supportive, forward thinking and progressive currently embarking on a wide ranging programme of development and modernisation.&lt;/p&gt;\n&lt;p&gt;York is world famous for its beauty and heritage and is considered one of the best places to live in the UK. It boasts a rich cultural heritage, magnificent architecture, historic attractions, shopping and a lively restaurant and bar scene. Excellent rail and road links ensure easy access to major cities (only 2 hours to London) and to the wonderful North Yorkshire countryside. An extensive cycle network allows a pleasant, alternative commute to work. York is a lovely place to raise a family and has a plethora of excellent schools. York University is a member of the prestigious Russell group and renowned globally for ground-breaking research.&lt;/p&gt;\n&lt;p&gt;On joining the Trust you will gain access to a wide range of staff benefits. We offer a competitive relocation package of up to £8,000 and a study leave budget of £3,000 across three years will be allocated.&lt;/p&gt;\n&lt;p&gt;Candidates must have a medical degree and be on the GMC Specialist Register or be within twelve months of obtaining their CCT (or equivalent) at the time of interview.&lt;/p&gt;\n&lt;p&gt;If you are an overseas candidate please contact our recruitment team to discuss opportunities for fixed term contracts if you are interested in working with us to gain your specialist registration.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are interested in joining our team or want to find out more, please contact us to arrange an informal visit or telephone conversation. We are looking forward to hearing from you. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact us by emailing &lt;/strong&gt;&lt;strong&gt;RadiologyMedicalSecretaries@York.NHS.uk&lt;/strong&gt;&lt;strong&gt;. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;telephone 01904 726675&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVictoria BirkettJob titleClinical DirectorEmail addressVictoria.Birkett@YORK.NHS. If you are interested in joining our team or want to find out more, please contact us to arrange an informal visit or telephone conversation. We are looking forward to hearing from you. Please contact us by emailing RadiologyMedicalSecretaries@York.NHS.uk. For Job Pack please see trac jobs vacancy number 2283765 - ID 2696525&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York Hospital, York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Consultant Radiologist - MSK", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221058", "validThrough": "2020-11-09T23:59:59+0000"}