{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T09:46:14+0000", "description": "&lt;p&gt;This is a good opportunity for a skilled communicator to learn what it’s like working in crisis communications and emergency response.&lt;/p&gt;\n&lt;p&gt;The Communications Response Team aims to improve the quality of NHS communications, specifically in response to major incidents, business continuity and other related events. They work alongside colleagues in the national and regional communications teams, with specific emphasis on the National EPRR Communications Lead and the Press Office.&lt;/p&gt;\n&lt;p&gt;This team sets out to create a centre of excellence for crisis communications within the NHS, ensuring that all organisations have the ability to respond to these types of incidents in a professionals and honest way that meets the needs of patients, staff and the wider public.&lt;/p&gt;\n&lt;p&gt;The role supports the Communications Response Team as they respond to major issues and incidents affecting the NHS, with the opportunity to get involved in project managing some of the communications approaches and supporting providers who are undergoing major incidents or significant reputational management challenges.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This role will give you loads of experience of crisis communications and the opportunity to help a the function develop within the NHS. You’ll need to already have experience of working in a communications role as well as excellent project management skills and attention to detail.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we’re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Good organisational skills&lt;/li&gt;\n&lt;li&gt;Someone who reacts well under pressure&lt;/li&gt;\n&lt;li&gt;Someone who can facilitate challenging conversations&lt;/li&gt;\n&lt;li&gt;The postholder should have a flexible attitude to work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Further information you should consider:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This is a short-term position starting as soon as possible and ending on 31st March 2021. The reason for this is to cover an internal secondment.&lt;/li&gt;\n&lt;li&gt;There will be a shift working pattern in place with the team and weekend working will be required&lt;/li&gt;\n&lt;li&gt;We are based in Skipton House in London. We’d prefer the postholder to be able to join use a number of days per week with the remainder home working&lt;/li&gt;\n&lt;li&gt;Note that Dealing with Covid and flu and any other emergencies the pressure may be considerable therefore at the end of the year therefore, annual leave around Christmas and New Year may be a challenge.&lt;/li&gt;\n&lt;li&gt;The postholder must have UK residency 5 years plus for working purposes&lt;/li&gt;\n&lt;li&gt;The role may require occasional travel and for the postholder to undergo additional security checks.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Phil Groves&lt;/p&gt;\n&lt;p&gt;Job title: Head of Communications Response Team&lt;/p&gt;\n&lt;p&gt;Email address: phil.groves@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07809 334921&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London (with home working)", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Communications Response Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251468", "validThrough": "2020-11-16T23:59:59+0000"}