{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T09:31:10+0000", "description": "&lt;p&gt;Lancashire and South Cumbria Foundation Trust (LSCFT) has an exciting opportunity for an enthusiastic and skilled Band 6 clinician to join our Community Adult Speech and Language Therapy Team. You will be highly motivated and a conscientious team player with excellent communication, interpersonal and analytical skills gained through previous acquired neurology experience.&lt;/p&gt;\n&lt;p&gt;You will be independently managing complex communication and swallowing impairments and will have completed your dysphagia competencies. You should have the ability to travel within East and Central Lancashire and be able to manage and prioritise your own caseload.&lt;/p&gt;\n&lt;p&gt;You will work within our Community Adult Speech and Language Therapy team providing assessment and treatment for patients with a range of acquired communication and swallowing difficulties including Dementia and Neurological conditions. You will also be required to contribute to SLT services at the Harbour, an acute in-patient mental health unit within Lancashire and South Cumbria NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to commit to working within an established team environment, close liaison and collaboration with other professionals and carers will be vital. In return, we will provide you with regular clinical supervision, support by senior therapists and opportunity to network with other SLT’s working within LCFT. This is an innovative team and support is offered to clinicians with new ideas and who are keen to keep updated on new evidence-based practice skills.&lt;/p&gt;\n&lt;p&gt;Appointment is by interview and successful applicants will need to undergo the usual NHS pre-employment checks.&lt;/p&gt;\n&lt;p&gt;All candidates must be registered with RCSLT and HCPC.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced DBS check at the cost of £50.00, this will be deducted from your salary over the first 3 months.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJanet HuddlestonJob titleClinical Team LeadTelephone number01772 777 720&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Speech and Language Therapist Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251413", "validThrough": "2020-11-16T23:59:59+0000"}