{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum"}}, "datePosted": "2020-10-20T17:49:30+0100", "description": "&lt;p&gt;Advert&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a motivated and dynamic individual to join the Blackpool Integrated Community Learning Disability Team. The team offers an integrated specialist health and social care service to people with a learning disability and their carer’s, living in community settings in Blackpool.&lt;/p&gt;\n&lt;p&gt;The successful candidate will take an active role in the day to day operation of the team, carrying a caseload and working as an allocated nurse to service users with complex challenging behaviours referred to the service and also in offering advice and guidance to other team members in relation to positive behaviour support. You will work closely with the team’s psychologists and Psychiatrist and will fulfil the key roles of the Behaviour Specialist Nurse and ensure that specialist assessment and care management is delivered to relevant timescales.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and motivated individuals who have excellent values, interpersonal and communication skills and who have the necessary skills and knowledge to promote the philosophy of positive behavioural support with members of the Learning Disability Team and also wider health, social care and third sector providers. Driving forward policy and practice to ensure that people with a learning disability and challenging behaviours access appropriate health care and support in a range of settings.&lt;/p&gt;\n&lt;p&gt;The service operates Monday to Friday between the hours of 8.45am to 17.00pm. Some flexible working is required.&lt;/p&gt;\n&lt;p&gt;Should the successful applicant not meet the requirements sufficiently they may be appointed at a lower grade than stated. The successful candidate would then have the opportunity to progress to the grade advertised once the necessary skills and knowledge have been developed and the post holder has demonstrated the ability to undertake the duties at the higher level.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLiz RussellJob titleIntregrated Team ManagerEmail addressliz.russell1@nhs.netTelephone number01253 477803Additional contact information&lt;/p&gt;\n&lt;p&gt;Sariya Sinzara&lt;/p&gt;\n&lt;p&gt;Lead Liaison Nurse&lt;/p&gt;\n&lt;p&gt;Community Learning Disability Team&lt;/p&gt;\n&lt;p&gt;01253 477803&lt;/p&gt;\n&lt;p&gt;sariya.sinzara@ns.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bickerstaff  House, Blackpool", "postalCode": "FY1 3AH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8148", "longitude": "-3.04237"}}, "title": "Behaviour Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235456", "validThrough": "2020-11-17T23:59:59+0000"}