{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 - £53,459 PA inc. HCAS"}}, "datePosted": "2020-11-05T13:16:09+0000", "description": "&lt;p&gt;Bladder and Bowel Service&lt;strong&gt;: Band 8a Clinical Lead Specialist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Did you know Central London Community Heath NHS Trust (CLCH) is now responsible for delivering Adult Community Healthcare Services across West Hertfordshire? We are a Trust that specialises in delivering community healthcare across Hertfordshire and 11 London Boroughs.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are seeking enthusiastic and skilled colleagues to join us as we build on existing models of care and introduce new ways of working. Our transformation plans over the next 12 months will include further integration with primary care, unplanned care models and a greater emphasis on population health. We are expanding the existing workforce by recruiting to the current service portfolio and to the new teams.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Would you like to be at the forefront of delivering new models of care through transformation that meets the needs of the population?&lt;br /&gt;&lt;br /&gt;Would you like to work with a Senior Management Team who will support and develop you?&lt;br /&gt;&lt;br /&gt;If you can answer yes to any of the above then we may just have the job for you!&lt;/p&gt;\n&lt;p&gt;We are currently recruiting to a Band 8a Clinical Lead Specialist position for Bladder and Bowel Service in West Hertfordshire.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with the team leads, clinicians to develop the service and maintain close working relationships with both acute and community services.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for the delivery of high quality evidence based care for patients with whilst developing the service.&lt;/p&gt;\n&lt;p&gt;As a Band 8a Clinical Lead Specialist, you will be expected to work flexibly and independently covering all aspects to deliver a first class Bladder and Bowel Service to patients in West Hertfordshire.&lt;/p&gt;\n&lt;p&gt;Our vision is to ensure that our patients are provided with an excellent experience and an excellent standard of care. We are a caring, dedicated and progressive team and aim to be the best in the field of continence. If you share our vision and have what it takes to lead and support a team on this exciting journey of excellence then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate effective leadership skills alongside significant experience managing multi-disciplinary teams; effective communication; be adept with data and business intelligence.&lt;/p&gt;\n&lt;p&gt;You will also be dynamic, innovative, hardworking, and have excellent written and verbal communication skills. We can offer you the opportunity to develop your clinical skills as well as supporting you to develop your leadership style and skills that will support you throughout your career.&lt;/p&gt;\n&lt;p&gt;We offer a range of staff benefits including travel loans, childcare vouchers and accommodation support.&lt;/p&gt;\n&lt;p&gt;We strongly encourage applications from all sections of the community including: disabled people, those from black and minority ethnic backgrounds and lesbian, gay, bisexual and transgender people.&lt;/p&gt;\n&lt;p&gt;This is a full time position of 37.5 hours a week.&lt;/p&gt;\n&lt;p&gt;You can look forward to an award-winning training and development, excellent benefits including assistance with transport, child care, parking and comprehensive pension and health care schemes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hemel One, Hemel Hempstead, London", "postalCode": "HP2 7YU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7648", "longitude": "-.430964"}}, "title": "Bladder and Bowel Clinical Lead Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257826", "validThrough": "2020-11-19T23:59:59+0000"}