{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-11-03T12:00:23+0000", "description": "&lt;p&gt;&lt;span&gt;We are looking for a Consultant Rheumatologists to join an enthusiastic and energetic team, providing a comprehensive service to a population of c. 600,000 across County Durham and Darlington in an area with a high prevalence of musculoskeletal disease. Joining a department that is developing a modern, multidisciplinary hub and spoke service model, the post holder will be encouraged and supported to develop Rheumatology services across County Durham and Darlington specifically through the implementation of a NICE compliant Early Arthritis Service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We provide Day Case and Inpatient care at both Darlington Memorial Hospital and University Hospital of North Durham. Out of hours care is provided by acute and general physicians therefore there is no commitment to the acute medical rota but the Trust would be willing to accommodate a dual accredited candidate and adjust their Job Plan accordingly. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The department has an innovative strategy to expand and develop a comprehensive multidisciplinary team of extended scope Physiotherapists and Pharmacists. Successful applicants will be encouraged and supported to follow or develop specialist interests. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The North East of England is a friendly region with many cultural attractions, including theatre, music, art and history.  Open, dramatic countryside and coastline are within easy distance.  The region is well connected from all directions by excellent rail, air and road links.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Any applicant who is unable for personal reasons to work whole time will be eligible for consideration for this post.  If such an appointment is made modification of the job content will be discussed on a personal basis.  Applicants must be fully registered with a licence to practice with the GMC as well as being on the Specialist Register or within six months of attaining their CCT at interview stage.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Consultant Rheumatologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253850", "validThrough": "2020-11-17T23:59:59+0000"}