{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T09:46:55+0000", "description": "&lt;p&gt;&lt;span&gt;The Pharmacy Department at South Warwickshire NHS Foundation Trust is looking to recruit a talented and enthusiastic senior pharmacy technician to work as a key member of our team in delivering excellent hospital pharmacy services. This post offers an exciting opportunity for experienced GPhC registered technicians looking to provide IT support and supervision, and information to other service users.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role requires the successful candidate to provide Pharmacy IT support to dispensaries run by Warwick Hospital, the Trust’s wholly owned subsidiary company – SWFT Clinical Services Ltd, and George Eliot Hospital in Nuneaton.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Experience with Pharmacy IT systems is essential, including robotic storage cabinets, procurement and prescribing systems.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will also be IT literate and possess familiarity with various IT systems and reporting software. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Although this post would be well suited to those with existing experience in a hospital pharmacy setting, applications from registered technicians with at least 1 year of relevant experience from other pharmacy settings would be considered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust is a strongly innovative ‘UK Top 40’ award-winning and CQC-rated Outstanding Trust, serving historic Warwick and rural Warwickshire. The site at Warwick Hospital offers close proximity to Warwick Train Station and local bus routes, and is easily accessible via Junction 15 of the M40.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Closing date is 2 weeks from advertising, but may close early when sufficient applications have been received. Interviews for shortlisted candidates will be arranged for 1 to 2 weeks after shortlisting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMike WyattJob titlePrincipal Technician – Electronic PrescribingEmail addressMike.Wyatt@swft.nhs.ukTelephone number07814 731363 or 01926 495321 ext. 4445&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pharmacy G24610, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Pharmacy IT Support Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245893", "validThrough": "2020-11-11T23:59:59+0000"}