{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13520", "minValue": "12491", "unitText": "YEAR", "value": "£12,491 to £13,520 per annum"}}, "datePosted": "2020-11-03T15:13:37+0000", "description": "&lt;p&gt;We are a supportive and friendly team working with clients from 18yrs onwards, who are at the Norfolk &amp; Norwich University Hospital. In Norfolk we have adopted “Home First” and the “Discharge to Assess” guidance. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Right now, we are looking for an Assistant Practitioner who is passionate about making a difference to join our dedicated Community Response Team. With a flexible base, either in a hospital/community setting/remote working, you will enjoy working in partnership with a wide range of health professionals in a time challenged and fast-paced environment. We are proud of our multi-disciplinary working environment and our positive working relationships with our Health colleagues.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will manage a case load working closely with colleagues and partners in the assessment process to achieve timely discharges in line with the Care Act. You will undertake a range of assessments such as Care Act Assessments, using the Discharge to Assess Process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is a great time to join us as we continue on our journey, using ‘living well’ agenda to support people to be independent, resilient and well.  We’re investing in social care and changing the conversation for social work to provide better outcomes, building on the strengths of individuals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The team provides a 7 day a week service and you would be expected to work some weekends on a rota basis. This averages at 1 weekend in 4 with 2 days off during the week.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129523"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Norwich University Hospital", "postalCode": "NR1 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6154", "longitude": "1.30769"}}, "title": "Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254489", "validThrough": "2020-11-17T23:59:59+0000"}