{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-20T15:15:30+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;University Hospitals Birmingham - Band 5 Registered Nurses for Trauma Repatriation Unit and Ambulatory Trauma Unit&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for Band 5 Staff Nurses to work within the trauma repatriation and ambulatory trauma units at &lt;strong&gt;Good Hope Hospital&lt;/strong&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The opportunity has arisen due to extension of services on the Good Hope Hospital site. The successful applicants would join an already well established team. The successful applicants would show excellent communication skills, be able to work individually as well as part of a wider team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The recent changes seen to the Trauma services offered at UHB has seen an exciting opportunity for staff to rotate across the two units.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ward 10 is made up of a 30 bedded unit where trauma patients transfer to following their surgery to continue their rehabilitation. It houses a therapy gym which enables group therapy sessions to motivate patients and promote independence. The Ambulatory Trauma Unit is open 7.30am until 8pm and sees trauma patients in a day case capacity. It is a new, nurse led unit which promotes staff to work independently and offers trauma patients the opportunity to have their surgery in a day case facility.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested in working with us and developing your career; we would love to hear from you. Please do not hesitate to contact Catherine Hough (Sister Senior) on 01214247210/01214249210 or catherine.hough@heartofengland.nhs.uk. &lt;strong&gt;Informal chats are welcomed.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Please note, currently the trust is not holding any face to face interviews. All interviews are via vidyo link. Interview date 17th November 2020.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sutton Coldfield", "postalCode": "B75 7RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5674", "longitude": "-1.81204"}}, "title": "Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234955", "validThrough": "2020-11-08T23:59:59+0000"}