{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-19T11:30:59+0100", "description": "&lt;p&gt;Applications are invited for the post of Clinical Information and Performance Facilitator within the Clinical Information Department, at St Helens &amp; Knowsley Hospitals Trust.&lt;/p&gt;\n&lt;p&gt;We require a highly motivated, team player with excellent communication skills in order to negotiate with, and motivate all members of the team to ensure audit and data needs are met. The post holder will be required to work on his/her own initiative and plan own workload and workload of the Clinical Information Team accordingly.&lt;/p&gt;\n&lt;p&gt;The post holder will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Significant experience in a line management/supervisory role, including objective setting.&lt;/li&gt;\n&lt;li&gt;Knowledge of the Somerset Cancer Register, its functionality and working processes.&lt;/li&gt;\n&lt;li&gt;Knowledge of cancer waiting times target definitions.&lt;/li&gt;\n&lt;li&gt;Knowledge of other Clinical information focus areas, including Stroke, NHFD etc. Skills in the analysis, presentation and interpretation of information.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder will provide a professional information service supporting the clinical data agenda and encompassing the management of the clinical information systems and Clinical Information Team to ensure the collection and analysis of appropriate and accurate data whilst adhering to all relevant deadlines. He/she will provide an analytical clinical information service for Trust management, clinicians, the cancer network and national clinical audit programme.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with the Senior Clinical Information Lead and clinical teams to devise accurate data collection tools. He/she will work closely with team members to provide high quality, professional administrative support, ensuring effective communication and meeting strict deadlines. The post holder will have proven team working skills and experience in the production of reports, documents and presentations. He/she will be proficient in the use of Trust systems&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to be part of the on-going development of data management for patients within the Trust. A willingness to learn new skills and the ability to work as a member of the Clinical Information Team whilst communicating effectively with staff at all levels will make the job an exciting and rewarding challenge.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please be aware, that we may close a vacancy earlier than stated, should a sufficient number of applications be received, you are therefore advised to apply at your earliest convenience.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Please note, interviews will include assessment tasks.&lt;/p&gt;\n&lt;p&gt;St Helens &amp; Knowsley Teaching Hospitals NHS Trust is the BEST acute Trusts in England for the THIRD year running!&lt;/p&gt;\n&lt;p&gt;The Trust is currently the only acute Trust in Cheshire and Merseyside, and is one of few in the entire country, to achieve the title of OUTSTANDING, rated by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;We provide a full range of acute adult services to our local population of circa 350,000 and provide tertiary services across a much wider area in the North West, North Wales and Isle of Man. We are also a Major Trauma Unit and the Mersey Regional Burns Unit.&lt;/p&gt;\n&lt;p&gt;Our &#39;5 Star Patient Care&#39; strategy is at the heart of all that we do; supporting our vision to provide world class services for all our patients by getting it right for every patient, every time.&lt;/p&gt;\n&lt;p&gt;Our latest achievements include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute Trust of the Year – HSJ Awards November 2019&lt;/li&gt;\n&lt;li&gt;Trust rates Outstanding by the CQC – March 2019&lt;/li&gt;\n&lt;li&gt;Best in the NHS, Patient Led Assessment of the Care Environment 2017 and 2018&lt;/li&gt;\n&lt;li&gt;The Trust achieved top marks in the country for areas including; cleanliness, food, privacy and dignity, facilities for patients living with dementia and disabilities, conditions, appearance and maintenance of the hospital buildings.&lt;/li&gt;\n&lt;li&gt;Top 100 places to work in the NHS (NHS Employers and Health Service Journal)&lt;/li&gt;\n&lt;li&gt;Best acute Trust in England (NHS Staff Survey 2017,2018 and 2019)&lt;/li&gt;\n&lt;li&gt;Best Patient Experience in the NHS (CHKS Top Hospitals Awards 2015)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In the NHS Staff Survey 2019 the Trust scored the highest marks in the following areas;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Best place to receive treatment in the NHS (for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Top Acute Trust for treating its staff fairly with regards to career progression (for 3rd year running)&lt;/li&gt;\n&lt;li&gt;Quality of care (best score for 5th year running)&lt;/li&gt;\n&lt;li&gt;Staff engagement (best score for 4th year running)&lt;/li&gt;\n&lt;li&gt;Staff morale (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Bullying and harassment (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Safety culture (best score for 2nd year running)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our staff rated our Trust as the best place to work and receive treatment. The Trust has also been recognised, for the third year running, as being the top acute Trust in the entire country for staff engagement, staff motivation, and pride in the quality of care we provide to patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVicky BannonJob titleCancer Data and Performance ManagerEmail addressvicky.bannon@sthk.nhs.ukTelephone number0151 676 5503&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121089.jpg", "name": "St Helens and Knowsley Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121089"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Alex Park, St Helens", "postalCode": "L35 5DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4201", "longitude": "-2.78641"}}, "title": "Clinical Information &amp; Performance Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232044", "validThrough": "2020-11-09T23:59:59+0000"}