{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "21,892-24,157"}}, "datePosted": "2020-10-16T13:11:25+0100", "description": "&lt;p&gt;We have created a new Band 4 Rehabilitation Assistant Practitioner post (22.5h) within our dynamic and supportive Integrated Rehabilitation Team.&lt;/p&gt;\n&lt;p&gt;The team provide rehabilitation for a varied caseload from falls and respiratory to neurological conditions, for people who reside in an attractive mix of towns and rural villages. We are looking for someone who has a commitment and passion for rehabilitation to work with Physiotherapists, Occupational Therapists, Rehabilitation Nurse and existing B3 and B4 Support Workers to provide high quality assessment and treatment for variety of patients.&lt;/p&gt;\n&lt;p&gt;We are currently developing our Band 4 post to enable you to hold your own caseload under the supervision of our specialist therapists. This will provide you with the opportunity to see a patient journey from assessment to discharge, progressing treatments as appropriate. The emphasis is to maximise their independence and quality of life through assessment and goal based rehabilitation to prevent hospital admissions and support the hospital discharge process. You will be well supported and encouraged to continuously develop to meet the needs of yourself and the service.&lt;/p&gt;\n&lt;p&gt;This post would be suitable for someone who was currently working at Band 3 level and would like to undergo further qualifications and training to support their development to Band 4.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information or to arrange a visit please call:&lt;/p&gt;\n&lt;p&gt;Heather Wolhuter (Therapy Manager) 07821813925&lt;/p&gt;\n&lt;p&gt;Leonie Winstanley (Occupational Therapy Clinical Team Lead) 07552267804&lt;/p&gt;\n&lt;p&gt;Gemma Cox (Physiotherapy Clinical Team Lead) 07770646167&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Honiton and Ottery St Mary", "postalCode": "EX14 2DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7949", "longitude": "-3.18659"}}, "title": "Rehabilitation Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230329", "validThrough": "2020-11-15T23:59:59+0000"}