{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per annum"}}, "datePosted": "2020-10-29T16:01:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Anaesthetics with a special interest in Anaesthesia for Vascular Surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for enthusiastic, motivated and committed individuals to join our friendly and dynamic team within the Anaesthetics department at Colchester Hospital, part of East Suffolk and North Essex NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;This is a new post and we are specifically looking for someone with an interest in anaesthesia for vascular surgery, to expand our team of 7 vascular anaesthetists.&lt;/p&gt;\n&lt;p&gt;East Suffolk and North Essex NHS Foundation Trust was formed on 1 July 2018 from a merger of Colchester Hospital University NHS Foundation Trust and The Ipswich Hospital NHS Trust&lt;/p&gt;\n&lt;p&gt;We are an ambitious forward thinking NHS trust committed to providing excellent healthcare for the communities we serve in East Suffolk and North Essex. We have exciting opportunities for our staff - enabling them to develop their skills and interests in areas of particular interest, education, research and training. The scale of the trust means that we are in a strong position to develop acquire and develop state-of-the-art facilities and services.&lt;/p&gt;\n&lt;p&gt;We are looking for a consultant anaesthetist with an interest in vascular surgery. As well as anaesthetising for theatre lists, the successful applicant will also attend vascular MDT and perform pre-assessment for vascular patients. There will be an opportunity to do CPET as part of the pre-assessment process. This skill can be developed if the applicant has not had prior experience. The department encourages the new appointees to develop areas of special interest and job planning will be reflective of this.&lt;/p&gt;\n&lt;p&gt;The post is for 10 PA’s per week including core SPAs of 1.5. The out-of-hours rota frequency is currently 1 in 13. The timetable will usually include 5-6 fixed or flexible DCC PAs for operating theatre sessions, pre-assessment, attendance at vascular MDT and performing CPET. The appointee will participate in the on call consultant rota, covering general emergencies and obstetrics. The job plan is agreed to include compensatory rest before and after to ensure safe working conditions. Flexible/part time applications will be considered.&lt;/p&gt;\n&lt;p&gt;The post-holder’s duties will be primarily at Colchester General Hospital although opportunities to arrange future working cross site can be negotiated should circumstances change or career development take a new direction.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Hugo Boyce - Clinical Director (Ipswich)&lt;/p&gt;\n&lt;p&gt;Email: Hugo.Boyce@esneft.nhs.uk&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Dr Kate Gardner - Clinical Lead (Colchester)&lt;/p&gt;\n&lt;p&gt;Email: Kate.Gardner@esneft.nhs.uk&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Dr Harsha Lakshman - Vascular Lead (Colchester)&lt;/p&gt;\n&lt;p&gt;Email: Weligamage.Lakshman@colchesterhospital.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01206 744287&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester Hospital, Colchester", "postalCode": "CO4 5JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9102", "longitude": ".899214"}}, "title": "Consultant Anaesthetist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248994", "validThrough": "2020-11-29T23:59:59+0000"}