{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa plus HCAS"}}, "datePosted": "2020-10-30T10:30:59+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Forensic Inpatient Service provides short and long term hospital admissions to both male and female patients suffering from serious mental health problems such as psychotic illness, bipolar affective disorder and obsessive compulsive disorder.&lt;/p&gt;\n&lt;p&gt;Each ward is staffed by a multidisciplinary team who are responsible for assessing, managing and reducing the risk to the person and community whilst in our care. The team comprises of mental health Nurses, Forensic Psychiatrists, Clinical Psychologists, Occupational Therapists, Dance and Movement Therapists, Recovery Workers and administrative staff.&lt;/p&gt;\n&lt;p&gt;The Forensic Inpatient Service provides admission under the Mental Health Act within both low and medium level of security which is generally agreed with the referring team/court/Ministry of Justice.&lt;/p&gt;\n&lt;p&gt;The Forensic Inpatient Service works in collaboration with referring teams to help the person move back to an appropriate community setting as soon as possible.&lt;/p&gt;\n&lt;p&gt;Hume is a 16 bed Male LSU ward, currently located on the Springfield Hospital site. Hume wards is part of the Forensic service with South West London and St Georges NHS Trust, Shaftesbury Clinic is a Forensic in-patient service providing specialised multi-disciplinary care to male and female mentally disordered offenders.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and dynamic Ward Manager to join our well-established team within a Low and Medium Secure Service.&lt;/p&gt;\n&lt;p&gt;The nursing service forms a substantial proportion of the entire Forensic service establishment. It is therefore pivotal to the quality of care delivery to our clients. The successful candidate is expected to work with the entire Forensic workforce in developing the highest standards of care possible and providing high quality nursing care. He/she will be a highly skilled and well-motivated individual with considerable experience of working in a dynamic secure mental health service.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for implementing and monitoring all policies and ensures that the ward functions in line with the Trust and Forensic service philosophy. The post holder will also ensure that supervision and appraisal systems are robustly implemented and that the care provided is of the highest possible standard in line with the service’s clinical governance framework. The Ward Manager is ultimately responsible for providing a safe environment within which all staff can deliver care and support to patients and their significant others. He/she must ensure effective deployment of resources within agreed budgets.&lt;/p&gt;\n&lt;p&gt;You will be expected to engage in on-going professional development and appraisal and there will be opportunities for training for example, KUF (Personality Disorder training) and HCR20 training. You will also be expected to contribute to the strategic development of the service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located within the impressive grounds of Springfield University Hospital in Tooting and we also operate in nearly 100 other locations throughout the UK. This is easily accessible via the Northern Line (Tooting Bec Station) and via private transport. The Trust provides subsidised parking fares for all our substantive staff. Our main site is located immediately next to Tooting High Street where staff can easily access a range of shops, cafés, restaurants etc.&lt;/p&gt;\n&lt;p&gt;Hume ward is located in Newton, Entrance 3 on Springfield University Hospital in Tooting&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Daniel Ibukun, Acting Service Manager/Matron&lt;/p&gt;\n&lt;p&gt;Email address Daniel.ibukun@swlstg.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, Tooting", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Ward Manager (Hume) - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249741", "validThrough": "2020-11-06T23:59:59+0000"}