{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum, pro rata"}}, "datePosted": "2020-10-20T15:00:27+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Experienced Senior Nurses/ Qualified District Nurses Wanted!&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for Qualified District Nurses or experienced Senior Nurses already working at a band 6 level who are looking for a new challenge.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a forward thinking organisation delivering care to our community, working within fully integrated Neighbourhood Teams. During this recent pandemic we have worked innovatively and collaboratively to quickly make the changes needed in order to continue to care for our patient population. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Whether you are a newly qualified or experienced District Nurse, or an experienced Senior Nurse in another setting we will fully support your future development and career progression.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are in the incredibly privileged position of caring for people in their own homes – generally, the place they prefer to be treated. Forging new relationships within Primary Care Networks and learning from our recent experiences has placed us in a valuable position to rapidly respond when needed. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;What&#39;s the job?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are recruiting Senior Nurses and District Nurses to provide clinical leadership and oversee the delivery of high quality care within a Neighbourhood Team. Working with a Community Matron or Associate Community Matron you will manage a clinical caseload and lead a caseload cluster of Staff Nurses and Neighbourhood Clinical Assistants, to provide excellent care for our patient population.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our integrated Neighbourhood Teams offer seamless proactive support and care in the community. The teams are made up of Nursing and Therapy professionals working closely with our social care partners. Our service runs from 7am to 10pm every day of the year. The focus at all times is on the individual – helping them stay at home, or to come home quickly from hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Who are you?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a nurse who is dynamic, innovative, passionate and committed with experience of case management and multidisciplinary working. We are looking for leaders who possess excellent communication skills and an ability to motivate others. We want individuals who are resilient and able to support others through change in order to maintain the delivery of high quality, compassionate, proactive and safe care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to the nature of the role it is essential that applicants are able to travel independently across the locality and have access to a suitable vehicle for business purposes. If necessary adjustments can be considered in accordance with the Equality Act 2010.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Who are we?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leeds Community Healthcare provides a range of community-based health services across the whole city. We treat people in their homes, local health centres and community hospitals, and work in partnership with primary care, other local Trusts, charities and Leeds City Council.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a strong culture based on deeply-held values, and our focus at all times is on delivering high quality care to the people of Leeds.&lt;strong&gt; In our most recent CQC evaluation, we were rated &quot;Good&quot;, with our Adult Services rated &quot;Outstanding&quot; for caring.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;What are the perks?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our benefits range from generous annual leave to access to NHS discount sites. Here are some of the most important ones:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Competitive salary in line with Agenda for Change banding&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;27-33 days annual leave plus bank holidays&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Highly regarded NHS Pension Scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A supportive environment, with daily caseload cluster handover.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Professional development opportunities including coaching, training and education support&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Salary sacrifice or lease car schemes&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;Health and wellbeing including gym membership, occupational health service and priority access to mental health services&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Why Leeds&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We&#39;re lucky to be based in the fantastic city of Leeds, with both city life and countryside calm on your doorstep. Leeds is a top destination for shopping, food &amp; drink, culture, sport and music, and is easily connected by train, road and plane to countless locations around the country and beyond.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The city has the goal to be the &quot;best city for health and wellbeing&quot;, and is home to multiple other NHS and healthcare organisations, including NHS England and NHS Employers. Put simply - if you want to work in healthcare, Leeds is the place to be.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;What now?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you feel like we&#39;re the place for you, why not click that apply button.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123892.jpg", "name": "(AS) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123892"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS6 1PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8149", "longitude": "-1.56836"}}, "title": "Senior Nurse/District Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234888", "validThrough": "2020-11-12T23:59:59+0000"}