{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-05T12:16:24+0000", "description": "&lt;p&gt;We provide healthcare services to people living in Bridgend, Merthyr Tydfil and Rhondda Cynon Taf county borough areas, serving a population of around 450,000. We are ideally situated between Wales’s capital city, Porthcawl to the west, and the stunning scenery in the Brecon Beacons.&lt;/p&gt;\n&lt;p&gt;Our vision is to care for our communities and patients by preventing ill-health, promoting better health, providing excellent services and reducing the need for inpatient care wherever possible through the provision of strengthened home, primary and community care.&lt;/p&gt;\n&lt;p&gt;We value the diversity of our staff and welcome applications from people from protected groups under the Equality Act 2010, this specifically includes age, sex, sexual orientation, gender identity/reassignment, race/nationality, religion/belief, disability, pregnancy and maternity and marriage and civil partnership.&lt;/p&gt;\n&lt;p&gt;Please check your email account regularly. Successful applicants will receive all recruitment related correspondence via the email account registered on the application form.&lt;/p&gt;\n&lt;p&gt;Come and work with a very friendly multi-disciplinary team in the RGH ED.&lt;/p&gt;\n&lt;p&gt;We have a well established team of ANPs but we are looking to expand this.&lt;/p&gt;\n&lt;p&gt;The ANPS are valued members of our team, they cover all areas of the department and participate actively in the departmental teaching and audit programme.&lt;/p&gt;\n&lt;p&gt;We are keen to support individuals to develop further in any particular areas of interest or expand their scope of practice.&lt;/p&gt;\n&lt;p&gt;The department has a strong ethos for team work and well-being and we look forward to welcoming you.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Amanda Farrow - ED Clinical lead&lt;/p&gt;\n&lt;p&gt;Helen Bailey - Directorate Support Manager&lt;/p&gt;\n&lt;p&gt;on 01443 443443 ext 6901&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Glamorgan Hospital, Llantristant", "postalCode": "CF72 8XR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5476", "longitude": "-3.39093"}}, "title": "Emergency Department Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257614", "validThrough": "2020-11-19T23:59:59+0000"}