{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 p.a. (pro rata)"}}, "datePosted": "2020-10-28T15:15:53+0000", "description": "&lt;p&gt;The Manchester Cystic Fibrosis Unit is a centre of Excellence in the North West, Pearce ward is the inpatient unit and we have 22 beds with a staffing ratio of 1 trained nurse to 5-6 patients caring for young adults with varying degrees of acute and chronic CF related illness. This allows us to provide true holistic nursing care of the highest standard to our patients whilst ensuring our nurses receive excellent support and training.&lt;br /&gt;&lt;br /&gt;We are a highly recognised research centre within the UK, encompassing a purpose build unit of individual en-suite rooms with sky television, internet access and a bespoke ward based chef service. We work within a large multidisciplinary team which includes Nurses, Consultants, Physiotherapists, Dietitians, Social workers and Clinical Psychologists.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is a fantastic opportunity to join an existing highly motivated professional team. We welcome applications from newly qualified and experienced staff and will provide you with a comprehensive and individual induction where you are eligible for the following. &lt;br /&gt;&lt;br /&gt;• Band 4 pay for newly qualified nurses whilst you await your NMC PIN&lt;br /&gt;• 12 month preceptorship with an initial 4 weeks supernumerary status for all newly qualified nurses.&lt;br /&gt;• Ongoing personal development and support over the first 12 months including: emotional resilience, time management, holding difficult conversations and leadership&lt;br /&gt;• Access to an internal nurse-led careers hub to help define your role, offer career development and opportunities.&lt;br /&gt;• In-house Coaching available to all staff at all levels&lt;br /&gt;• Encouragement and support to develop professionally via structured training programmes.&lt;/p&gt;\n&lt;p&gt;Please note that the closing date is given as a guide, we reserve the right to close this vacancy once a sufficient number of applications has been received. You are advised to submit your application as early as possible to avoid disappointment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSr Ann BowlingTelephone number0161 291 5315Additional contact information&lt;/p&gt;\n&lt;p&gt;Sr Ann Bowling, Sr Charlotte Rourke.&lt;br /&gt;0161 291 5315 &lt;br /&gt;informal visits are very welcome&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Staff Nurse - Pearce Ward - Cystic Fibrosis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247154", "validThrough": "2020-11-11T23:59:59+0000"}