{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-06T12:16:23+0000", "description": "&lt;p&gt;We are looking for a highly motivated Staff Nurse to join our team at The Darwin Centre for Young People. The successful applicant will be a Nurse committed to working in Child and Adolescent Mental Health Services and be enthusiastic about joining our dynamic, skilled and supportive multi-disciplinary team. The post holder will work intensively with young people and will have the opportunity to practice and develop skills in individual work, group work, family therapy and Metallization based Therapy, the AMBIT model&lt;/p&gt;\n&lt;p&gt;Headed by the Ward Manager and Consultant, the team includes a Social Worker, Patient and Carer Support Worker, Outreach Workers, Family Therapists, Art Therapist, Occupational Therapist and Psychologist in addition to the strong clinical nursing team led by the Clinical Nurse Specialist. In return we have excellent opportunities for staff.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Preceptorship Development Programme&lt;/li&gt;\n&lt;li&gt;Robust Orientation Programme on the Unit&lt;/li&gt;\n&lt;li&gt;Mentorship programme for all nurses&lt;/li&gt;\n&lt;li&gt;Continuous Professional Development via Royal college of Nursing / Psychiatrist&lt;/li&gt;\n&lt;li&gt;Excellent Revalidation Support&lt;/li&gt;\n&lt;li&gt;Trust Recognition Award&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;Relocation Package will be considered&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Sensory Approaches Training&lt;/li&gt;\n&lt;li&gt;Link with Local University ARU&lt;/li&gt;\n&lt;li&gt;Relocation package / new starter bonus&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is a full therapeutic group Programme that is delivered by the nursing staff, we offer nurses meetings, weekly staff support and weekly in house training. The unit boasts a warm and compassionate approach lending itself to compliments from many visitors on the calming environment generated by the ward.&lt;/p&gt;\n&lt;p&gt;The unit is situated roughly four and a half miles south of Cambridge in pleasant grounds, and admits young people from all over East Anglia. Situated adjacent to the Darwin is the school, Darwin Centre for Learning who provides Education programmes which is highly praised and has received an Outstanding rating from Ofsted.&lt;/p&gt;\n&lt;p&gt;As part of the Children’s Directorate within CPFT, the Darwin is co-commissioned with the Phoenix, a specialist eating disorder service for children and adolescents, and the younger children’s inpatient service, the Croft. There are therefore significant opportunities for personal development both within the unit and the directorate should the applicant wish to expand their knowledge.&lt;/p&gt;\n&lt;p&gt;This appointment will be to the Tier 4 children’s inpatient services within CPFT. Your initial base will be at the Darwin Centre, however, there is an expectation and desire that nursing staff will undertake personal competency development by undertaking planned periods of placement on all our units to meet skill development and service delivery needs.&lt;/p&gt;\n&lt;p&gt;In addition, and although infrequent, you may be asked to undertake individual shifts on other units to meet the needs of the service and fulfill the Trust’s duty of care to all its patients. The Trust operates a rotational shift pattern and this includes weekend working when required by the unit/Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Georgie Holloway, Ward Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;georgie.holloway@cpft.nhs.uk / 01223 534430&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Block 19 IDA Darwin, Cambridge", "postalCode": "CB21 5EE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1858", "longitude": ".200772"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259624", "validThrough": "2020-11-20T23:59:59+0000"}