{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-05T10:16:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Can you help us deliver our services during Covid-19?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for people with a “Can do Attitude” to come and join our bank portering team at Scunthorpe General Hospital who can work on positive Covid-19 areas. You will receive full training for the role of a porter and FIT training in the use of personal protective equipment.&lt;/p&gt;\n&lt;p&gt;The role of a porter can be demanding, and requires flexibility to support us during periods of operational pressures, so if you believe you have the physical agility to conduct patient, equipment and material moves around the hospital site, and can demonstrate our values, &lt;strong&gt;Kindness, Courage and Respect&lt;/strong&gt; we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In order to be selected for an online interview you must provide&lt;/strong&gt; the following information in your application:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Details of any qualifications with the pass level indicated&lt;/li&gt;\n&lt;li&gt;Any relevant skills you have that would enable you to carry out a portering role, using the job description and person specification as guide.&lt;/li&gt;\n&lt;li&gt;Any experience of customer services&lt;/li&gt;\n&lt;li&gt;The reasons for any gaps in your working history&lt;/li&gt;\n&lt;li&gt;Details of your referees&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Whilst the post is a Bank position (Zero hours contract) once you have completed your training and following a period of integration within the hospital environment you will have the opportunity to apply for any contracted posts within the department that may come available. Training would normally consist of working Monday to Friday, 7.5 hours per day, 37.5 hours per week, for a period of eight to ten weeks (dependent on the individual).&lt;/p&gt;\n&lt;p&gt;Once appointed you will access the many benefits of working for the NHS including an excellent pension scheme, increasing annual leave allowance of up to 41 days per annum (including bank holidays) once you have completed 10 years’ service, multiple discount schemes and the opportunity to develop and grow your skills within the NHS through our excellent training and development schemes.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alison McCulley, Logistics Coordinator&lt;/p&gt;\n&lt;p&gt;03033 305005&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe", "postalCode": "DN15 7BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5875", "longitude": "-.666943"}}, "title": "Bank Porter - Scunthorpe", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257199", "validThrough": "2020-11-19T23:59:59+0000"}