{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30612", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,612 pro rata"}}, "datePosted": "2020-10-29T18:00:32+0000", "description": "&lt;p&gt;Salford Royal NHS Foundation Trust is a high performing trust that is aiming to be the safest organisation in the country. We have an ethos of safe, clean and personal every time.&lt;br /&gt;&lt;br /&gt;Ward H4 is a fast paced 24 bed mixed sex urology, gynaecology, orthopaedic and ENT short stay surgery ward. We provide care to patients admitted both acutely and electively. We strive to provide a high quality service that is safe, clean and personal to our patients.&lt;br /&gt;&lt;br /&gt;We are seeking a flexible member of staff who is able to rise to the challenge of working in this busy environment. As a Staff Nurse you will be responsible for the assessment, planning, organisation, delivery and evaluation of care to patients. This is an excellent opportunity for you to develop nurse lead discharge skills.&lt;br /&gt;&lt;br /&gt;You will be able to:-&lt;br /&gt;• Demonstrate excellent interpersonal skill&lt;br /&gt;• Aspire to deliver excellent standards of care &lt;br /&gt;• Be able to work collaboratively with all members of the MDT&lt;br /&gt;• Demonstrate a high level of compassion for patients and their relatives&lt;br /&gt;&lt;br /&gt;In return you will:-&lt;/p&gt;\n&lt;p&gt;• Be developed by dedicated training professionals. You’ll have access to a wide range of learning opportunities and state of the art facilities, including seminar rooms, an IT suite, a library, skills labs and an on-site simulation suite. You’ll also have access to CPD to help take your career in the right direction.&lt;br /&gt;&lt;br /&gt;• Be supported to develop the competence and confidence you need as an effective, independent healthcare professional. You’ll receive a full induction programme, benefit from classroom-based training and clinical skills assessments. Newly qualified nurses will also benefit from our 12 month preceptorship programme supported by our dedicated Practice Development Team. You will also receive support from our senior nursing team and highly specialised nurses. &lt;br /&gt;&lt;br /&gt;• In addition to your Band 5 Salary you’ll be rewarded with a variety of salary sacrifice schemes, a wide range of health and wellbeing initiatives, flexible working and an on-site nursery. You’ll also enjoy a working environment that’s every bit as good as the care we provide.&lt;br /&gt;&lt;br /&gt;If you are a newly qualified nurse we will pay your first year&#39;s NMC registration fee as well as paying you at Band 4 until you receive you NMC PIN.&lt;/p&gt;\n&lt;p&gt;Salford Royal has teamed up with housing association Salix Homes to provide a 26-apartment complex for doctors, nurses and other clinical staff new to the Trust. Please enquire upon appointment to review availability.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual preference, disability, nationality, religion, marital status, social back ground or trade union membership.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kathryn Hale&lt;/p&gt;\n&lt;p&gt;Ward Manager&lt;/p&gt;\n&lt;p&gt;Email:Kathryn.hale@srft.nhs.uk&lt;br /&gt;0161 206 0502/4578&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Qualified Nurse - Ward Hope 4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249253", "validThrough": "2020-11-12T23:59:59+0000"}