{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890"}}, "datePosted": "2020-10-21T14:51:02+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;‘Time lost is brain lost’&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;Stroke is a medical emergency. Brain tissue at risk of damage can be saved with active management in the initial hours after a stroke starts. Rapid admission to hospital and access to specialised stroke care, including brain scanning and assessment for thrombolysis, is vital for ensuring the best possible outcome for stroke patients. The Department of Health has encouraged the development of specialised stroke services and published the National Stroke Strategy for improving stroke care nationally. In Portsmouth Hospitals NHS Trust, we have used this to guide the development of our service and ensure these improvements are actually delivered in practice.&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Portsmouth Hospitals NHS Trust is one of the largest acute Hospital Trusts in the country. We provide acute and specialist services to people across Portsmouth, South East Hampshire and West Sussex. We continue to build our reputation for innovation and excellence, consistently delivering outstanding performance, whilst developing the skills and abilities of our staff.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Stroke Service at Portsmouth Hospitals NHS Trust has developed and continues to evolve to meet the needs of the patients who require specialist Stroke care. We are focused on ensuring a high quality seamless patient pathway and patient experience from admission to discharge delivered by a highly skilled, motivated and compassionate clinical team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our services include 24/7 Thrombolysis provision, access to Thrombectomy services, Hyper Acute Stroke unit (HASU), Acute Stroke unit (ASU), inpatient Neuro Rehabilitation, Stroke specific Rehabilitation and Community Stroke Rehabilitation (CSRT). All of these areas are led by committed specialist multidisciplinary stroke experts.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of our commitment to review and improve our stroke services we are looking to expand our Hyper- acute stroke team to provide a 24/7 service therefore an exciting position has arisen for band 6 Stroke Specialist Nurse to join Portsmouth Stroke Services. We are looking for highly motivated and dynamic individuals who can demonstrate excellent communication and interpersonal skills, along with ensuring that your practice follows the 6C’s approach to care with an emphasis on compassionate care. This post is within our Hyper-Acute Stroke Team (HAST), supporting our emergency pathway. We are keen to recruit committed and reliable staff with established or emerging stroke skills, who would demonstrate a coaching approach to developing the staff across the stroke pathway. We would be keen to develop this post into a rotational role with th opportunity to work across HAST and HASU, in order to further develop skills, knowledge and experience. The successful candidtate will be required to rotate onto nights tonce the team is established to provide the 24/7 cover&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ability to discuss your exisiting skills, knowledge and experience of stroke care at interview are essential. This post is supported by a Core Stroke Skills programme, a Practice Education Team and a culture where all staff are encouraged to be part of the Stroke service changes. You will also have access to the Passport to Manage programme run within the organisation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome all applicants to contact us for an informal visit and encourage you to make contact with us to arrange this. Please telephone Maggie Stoppard (Matron for Stroke) on 02392286000 ext 5340 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Closing Date: 11th November 2020&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Stroke Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236985", "validThrough": "2020-11-11T23:59:59+0000"}