{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-23T13:06:38+0100", "description": "&lt;p&gt;&lt;strong&gt;Workforce Planning Support Analyst&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Agenda for Change Band 4 - £21,892 to £24,157 per annum. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Ambulance Headquarters, Newburn.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term/ Secondment – 4 Months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to work in our Emergency Operations Centre (EOC), based at Ambulance Headquarters, as a Workforce Planning Support Analyst. In this role, you will support our Scheduling and Forecasting Analysts by utilising the Trust’s WFM system to increase forecast accuracy and reduce shift inflex. Alongside this, you will offer cover to the Intraday Analyst role to ensure smooth delivery of Service Levels and KPIs in real time. This is vital in ensuring that we meet the significant demands of the c.1.6 million calls we handle annually across NHS111, 999 and Patient Transport Services.&lt;/p&gt;\n&lt;p&gt;The post holder will also be responsible for providing insights on actual performance vs forecast, working closely with colleagues within the workforce planning team, using this analysis to build recommendations around future performance.&lt;/p&gt;\n&lt;p&gt;You will need to have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A level qualification in a relevant business dicipline or significant relevant experience of data analysis.&lt;/li&gt;\n&lt;li&gt;Experience in resource planning.&lt;/li&gt;\n&lt;li&gt;Recognised qualifications in Microsoft Excel to an advanced level or demonstrable skills gained through experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are already one of the best-performing services across NHS111 and 999 and are one of only two Ambulance services who also multi-skill our Health Advisors. And this must continue – particularly as we embark on a new, 5-year NHS 111 contract. Therefore, your expertise across a multi-site, multi-skilled environment will be essential to support the Trust in delivering to stretching standards and targets – all designed to ensure patient safety.&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Daniel Lowrie (Workforce Scheduling and Planning Manager) via email to daniel.lowrie@neas.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North East Ambulance Service NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121056"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle upon Tyne", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Workforce Planning Support Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240652", "validThrough": "2020-11-11T23:59:59+0000"}