{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum"}}, "datePosted": "2020-11-02T13:01:50+0000", "description": "&lt;p&gt;&lt;strong&gt;**Please note this position is for current East Cheshire NHS Trust employee’s only**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity for a 6 month fixed term Band 6 Ward Sister.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and dynamic Ward Sister to work on our acute elderly care ward specializing in treating patient who live with dementia. Dementia is a growing challenge for communities and we, as healthcare professionals are at the forefront of providing the dignity, support and care that people deserve.&lt;/p&gt;\n&lt;p&gt;You will be required to be innovative and have the ability to influence practice through effective team building and leadership skills. You will be expected to take charge of the ward in the Senior Sisters absence. The successful applicant will have a minimum of 3 years’ experience at Band 5 level within an acute setting.&lt;/p&gt;\n&lt;p&gt;Excellent communication and management skills are imperative along with a commitment to build and motivate an effective team. In addition you will be expected to work collaboratively with the Multi-disciplinary team. As well as assisting the Senior Sister and Matron in meeting trust wide objectives.&lt;/p&gt;\n&lt;p&gt;The ideal candidate would be expected to deliver the highest standards of care to our patients and have a keen interest in falls prevention, dementia care, tissue viability, nutrition and hydration. We work closely with the palliative care teams to give excellent end of life care and support to our patients and you will also have the opportunity to gain experience in complex discharge planning.&lt;/p&gt;\n&lt;p&gt;Values underpinning the 6 C’s of Nursing and a desire to improve patient care are essential for the post.&lt;/p&gt;\n&lt;p&gt;In return, you will find contribution is valued, you will receive a personal induction plan and on ongoing programme of support tailored to meet your individual needs. We offer excellent training opportunities supported by our own Learning and Development team and once you have gained experience, there will be opportunities to progress your career further within the organisation.&lt;/p&gt;\n&lt;p&gt;This post is a Secondment for 6 Months&lt;/p&gt;\n&lt;p&gt;Hours per week: 37.5&lt;/p&gt;\n&lt;p&gt;Closing date: 9th November 2020&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced with Barred list Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Katy Dunn Job title Senior Sister Email address katy.dunn@nhs.net Telephone number 01625 661068&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Ward Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252157", "validThrough": "2020-11-09T23:59:59+0000"}