{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata"}}, "datePosted": "2020-11-06T12:01:01+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Clinical/Counselling Psychologist&lt;/span&gt; in Adult Acute Mental Health Service&lt;/span&gt;s, Prospect Park Hospital, Reading&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term – 12 months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a diverse role; therefore job satisfaction and development can come from a number of different areas. The role offers the opportunity to work in the hospital and also from home.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a band 8a Clinical/Counselling Psychologist to work on Bluebell and Snowdrop wards at Prospect Park Hospital.&lt;/p&gt;\n&lt;p&gt;Under supervision of a Principle or Consultant Clinical Psychologist you will take on a clinical caseload that will include both individual and group work with adults with complex mental health presentations. You will provide regular input to the multi-disciplinary teams on Bluebell and Snowdrop wards in the form of consultation, team formulation sessions, teaching and joint working. You will be part of the Inpatients Psychology team, supervise one or two of the Assistant Psychologists on Bluebell and Snowdrop wards and also receive peer support from the other ward Clinical/Counselling Psychologists. At times you may work on the other wards at Prospect Park Hospital, as needed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Engage in varied approaches to consultation to other hospital staff, e.g. team formulation, teaching sessions, joint working, supervision and staff support groups.&lt;/li&gt;\n&lt;li&gt;Supervise one or two Assistant Psychologists.&lt;/li&gt;\n&lt;li&gt;Clinical work with service users and carers involving assessment, formulation and interventions with varied and complex presentations.&lt;/li&gt;\n&lt;li&gt;Be a valued members of important service development projects such as the Quality Improvement teams on each ward.&lt;/li&gt;\n&lt;li&gt;On Bluebell ward be the ward Psychologist and work two days a week. On Snowdrop ward share the workload with another member of the Psychology team and work one day a week.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of joining our team:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The work of the Psychology team is highly valued by the staff, service users and carers at Prospect Park Hospital. A current member of the Psychology team said “As a psychologist I have felt like a highly appreciated member of the team on the wards and my opinion is often requested”.&lt;/li&gt;\n&lt;li&gt;There is also a supportive Psychology team across the hospital which offers opportunities for peer support and joint working.&lt;/li&gt;\n&lt;li&gt;This is a diverse role; therefore job satisfaction and development can come from a number of different areas.&lt;/li&gt;\n&lt;li&gt;You will spend time working on the wards and also from home.&lt;/li&gt;\n&lt;li&gt;Agenda for Change Salary ranging from &lt;strong&gt;£45,753 – £51,668 per annum&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities and a strong emphasis on your work, life balance&lt;/li&gt;\n&lt;li&gt;Annual leave – 27 days for new starters, plus bank holidays. Increasing to 29 days after 5 years and 33 days after 10 years NHS service. Pro rata for part time staff&lt;/li&gt;\n&lt;li&gt;Excellent learning and development opportunities&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car&lt;/li&gt;\n&lt;li&gt;Generous maternity, paternity and adoption leave for eligible staff&lt;/li&gt;\n&lt;li&gt;Advanced IT enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent support and advice for staff.&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The must haves for you to be considered for this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;You will have experience working with adults with complex mental health problems and have excellent therapeutic and management skills.&lt;/li&gt;\n&lt;li&gt;You will enjoy working in teams and providing psychological consultation, teaching and supervision.&lt;/li&gt;\n&lt;li&gt;Calm, confident and assertive in emotionally demanding situations, you will be astute at setting and maintaining professional boundaries and will be efficient at dealing with distressing or hostile situations and behaviour.&lt;/li&gt;\n&lt;li&gt;Self-motivated and confident, you will show initiative and a determination to support patients and their families through creative engagement. This includes an ability to work interactively in your clinical work.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you recognise yourself in these requirements, we would recommend you apply today!&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call: Dr Catherine Evans-Jones on 0118 960 5111 or catherine.evansjones@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "Senior Clinical / Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259552", "validThrough": "2020-11-12T23:59:59+0000"}