{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-24T12:14:26+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Wokingham Division, Modality Partnership&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Patient Services Assistant&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary circa £17,500 WTE per annum &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking to grow our team. This is an exciting time for the Modality Partnership and Wokingham Medical Centre. As a result &lt;/strong&gt;&lt;strong&gt;we are looking to recruit to our practice. You will be an integral part of the wider practice team helping to provide an effective service to our patients as well as developing a forward thinking GP Super Partnership in a stimulating environment ……Does this sound like the opportunity for you? Are you up for the challenge? If so read on………?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Patient Services Assistant (Full time and Part time considered)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will work as part of the busy Patient ServicesTeam, supporting the practice as the first point of contact for both our patients, staff and visitors. Dealing with appointment bookings and other queries in a professional manner.&lt;/p&gt;\n&lt;p&gt;IT literate with good knowledge/experience of how General Practice works, we are looking for a strong individual who has excellent communication skills and a commitment to effective customer service. You will have a professional approach to work and a good telephone manner in addition to being an accurate typist.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We offer competitive salaries, a generous annual leave entitlement, access to the NHS Pension scheme and a commitment to developing the skills of our workforce as part of our overall remuneration package.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for experienced self-starters who are able to work well as part of a team as well as on their own initiative. The ability to work well under pressure is also an important consideration for any successful candidate &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are a positive, confident and organised individual who adopts a flexible ‘can do’ attitude to your work coupled with a focus on high quality service then one of these roles within a fast-paced and continuously developing environment could be just right for you.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wokingham Division, Modality Partnership", "postalCode": "RG40 1XS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4119", "longitude": "-.831034"}}, "title": "Patient Services Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241554", "validThrough": "2020-11-07T23:59:59+0000"}