{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21548", "minValue": "21548", "unitText": "YEAR", "value": "£21,548.24 per annum"}}, "datePosted": "2020-10-08T17:01:21+0100", "description": "&lt;p&gt;Are you looking for an exciting and challenging opportunity that makes a difference?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are recruiting a dynamic Recovery Support Worker for our provision and team within the County of Essex, predominately based in Harlow, but will also support Chelmsford where necessary. Working in partnership with EPUT (Essex Partnership University NHS Foundation Trust) and CRG (Castle Rock Group) we will be delivering the Integrated Health in Justice Service throughout the County of Essex, including Southend &amp; Thurrock.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful candidate(s) will work alongside EPUT, CRG, the Police and Full Circle to support vulnerable individuals, including young people into treatment/services in a bid to divert them from reoffending or custody, this will also include completing and ensuring DRR/ATR assessments and high quality reports to assist the Court in imposing appropriate disposals for those with alcohol and/or drug misuse issues.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Do you have?&lt;br /&gt;• Experience of working with individuals of all ages in a therapeutic/supportive role.&lt;br /&gt;• An understanding of the complex issues presented by individuals within the criminal justice setting.&lt;br /&gt;• A desire to work in collaboration with health providers, the police, youth services, mental health &amp; substance misuse organisations.&lt;br /&gt;• Experience of the substance misuse sector or related field. &lt;br /&gt;If so join us and we will support you to&lt;br /&gt;• Contribute to the creative development of our treatment and recovery approach to meet the needs of our service users, our commissioners and stakeholders.&lt;br /&gt;• Achieve your potential with the support of an organisation rated as one of the Best 100 Not for Profit Companies to Work For.&lt;br /&gt;• Work towards a professional qualification in health &amp; social care.&lt;br /&gt;• Access a range of learning and development opportunities to support your personal and professional development.&lt;br /&gt;• Help change the lives of individuals within the criminal justice setting.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;This post is being advertised on behalf of the Phoenix Futures Group and is not part of the NHS. Your details will be sent onto the Phoenix Futures Group, so they can send you the relevant correspondence.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Phoenix Futures Group has more than 50 years experience of developing and delivering pioneering substance misuse services. We believe in being the best and that is why we constantly strive to learn and innovate, to challenge ourselves, to adapt and to work together with others who can bring valuable expertise.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarly WrightEmail addresscarly.wright@phoenixfutures.org.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harlow", "postalCode": "CM20 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7713", "longitude": ".086331"}}, "title": "Recovery Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219256", "validThrough": "2020-11-06T23:59:59+0000"}