{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "52036", "minValue": "38693", "unitText": "YEAR", "value": "England £38,693-£52,036 Scotland £32,961-£51,828"}}, "datePosted": "2020-10-27T14:22:23+0000", "description": "&lt;p&gt;&lt;strong&gt;National Neurosurgery ST1 Recruitment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Coordinated by Health Education England working across Yorkshire and the Humber&lt;/p&gt;\n&lt;p&gt;All interviews will be held remotely on the 18th &amp; 19th March 2021 (these dates may be subject to change).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Application process&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Health Education England Yorkshire and the Humber is co-ordinating national recruitment for vacancies in ST1 Neurosurgery across England, Scotland, Wales and Northern Ireland in 2021 (including LAT posts in Scotland, Wales and Northern Ireland).&lt;/p&gt;\n&lt;p&gt;We advise all applicants to visit and read the information available on thenational Neurosurgery ST1 recruitment webpagebefore commencing their application, including:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The &lt;strong&gt;National Neurosurgery ST1 Applicants Guide&lt;/strong&gt;– This document provides candidates with a full overview of the National Neurosurgery ST1 recruitment process.&lt;/li&gt;\n&lt;li&gt;Indicative vacancy numbers&lt;/li&gt;\n&lt;li&gt;Likely locations of posts within the training programme&lt;/li&gt;\n&lt;li&gt;The recruitment timeline&lt;/li&gt;\n&lt;li&gt;Links to Local Office/Deanery websites – for likely locations of posts and possible employers within the training programme, expected rotation details etc.&lt;/li&gt;\n&lt;li&gt;Further required documentation relevant to your application&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applications open at 10am on Thursday 5th November 2020 and close on Tuesday 1st December 2020 at 4pm. All interviews will be held remotely on the 18th &amp; 19th March 2021 (subject to change). All applications must be submitted by the closing date using the Oriel recruitment system; &lt;strong&gt;no late applications will be accepted&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;You can start your application by following the link to Oriel and searching for the vacancy.&lt;/p&gt;\n&lt;p&gt;Before applying please read the Neurosurgery ST1 person specificationto assess your suitability for the post.&lt;/p&gt;\n&lt;p&gt;Please upload all required evidence of competences to your online application form when completing the application form online. For those experiencing difficulties when uploading evidence, please ensure you email the evidence to the following email address by the application deadline: neurosurgeryrec.yh@hee.nhs.uk with “your name” and “competencies” in the title of the email.&lt;/p&gt;\n&lt;p&gt;With effect from 6 October 2019, all medical practitioners are on the Shortage Occupation List. This means that with the exception of all applicants to Public Health,all specialty recruitment applicants will be exempt from the RLMT; there will be no restriction on their appointment.&lt;/p&gt;\n&lt;p&gt;Eligibility requirements pertaining to UK Visas and Immigration are available on the Specialty Training website.&lt;/p&gt;\n&lt;p&gt;The expected duration of this programme is 96 months; however, the actual duration may depend on the circumstances of the individual.&lt;/p&gt;\n&lt;p&gt;Preferencing will be made available on Oriel at a later date. More details will follow regarding this.&lt;/p&gt;\n&lt;p&gt;Please note that Health Education England Yorkshire and the Humber has a strict application policy and will not accept applications submitted after the submissions deadline.&lt;/p&gt;\n&lt;p&gt;The Postgraduate Dean confirms that this placement and / or programme has the required educational and Dean’s approval. The Training Programme is equally open to those who may, either from the outset or subsequently, wish to train less than full time or job share.&lt;/p&gt;\n&lt;p&gt;Applications are equally open to those who may, either from the outset or subsequently, wish to train less than full time or job share.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay scales&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All trainees should be paid monthly at the rates set out in the national terms and conditions of service for hospital medical and dental staff and doctors in public health medicine and the community health service (England and Wales), “the TCS”, as amended from time to time. The pay scales are reviewed annually. Part-time posts will be paid pro-rata.&lt;/p&gt;\n&lt;p&gt;England – £38,693 - £52,036&lt;/p&gt;\n&lt;p&gt;Wales – £32,000 - £42,334&lt;/p&gt;\n&lt;p&gt;Scotland – £32,961 - £51,&#39;828&lt;/p&gt;\n&lt;p&gt;Northern Ireland - £31,997 - £50,312&lt;/p&gt;\n&lt;p&gt;Current rates of pay for junior doctors may be viewed on the NHS Employers website.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Enquiries&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An applicants’ guide can be downloaded from the national Neurosurgery ST1 recruitment webpage.&lt;/p&gt;\n&lt;p&gt;During the recruitment episode please check the national Neurosurgery ST1 recruitment webpage regularly to access up-to-date information relating to this vacancy and information about the recruitment process. You may also find the FAQ section on Oriel helpful in answering your query.&lt;/p&gt;\n&lt;p&gt;For any queries that cannot be answered by the methods above please contact neurosurgeryrec.yh@hee.nhs.uk with “your name” and the “Question area” in the title of the email.&lt;/p&gt;\n&lt;p&gt;For further national information please visit the Specialty Training website.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education Yorkshire and the Humber", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128516"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UK National", "postalCode": "S4 7UQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3941", "longitude": "-1.44614"}}, "title": "Specialty Trainee in Neurosurgery ST1", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244930", "validThrough": "2020-12-01T23:59:59+0000"}