{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "490736", "minValue": "490736", "unitText": "YEAR", "value": "£49,0736"}}, "datePosted": "2020-10-23T10:33:53+0100", "description": "&lt;p&gt;&lt;strong&gt;Health Education England, working across the south west&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Postgraduate Dental Education&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NIHR Academic Clinical Fellowship in Restorative Dentistry (top up training from monospecialst to restorative)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Vacancies: 1 (Based across Musgrove Park Hospital Taunton and Plymouth)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Level: ST4&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duration: up to 3 Years &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 15th January 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for applications: 20/11/2020 @ 4pm&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Peninsula Dental School is seeking talented, enthusiastic dentists who are dedicated to developing a clinical academic career. These posts provide a unique opportunity for dentists with curiosity, intelligence and commitment. Dentists who have or are about to complete monospecialty training in Prosthodontics, Endodontics or Periodontics and are looking to extend further and specialise in Restorative Dentistry. The ideal candidate(s) will have a strong record of academic achievement, ideally with some research experience (although not essential) and will be committed to applying for external fellowship funding for a PhD. The successful applicant(s) will be supported and trained to prepare their fellowship application.&lt;/p&gt;\n&lt;p&gt;These National Institute for Health Research Academic Clinical Fellow (NIHR ACF) posts will be split between 75% clinical development and 25% research, for up to 3 years.The clinical component will equate to a Specialty Trainee post and tailored to prepare the post-holder for subsequent CCST completion in Restorative Dentistry.&lt;/p&gt;\n&lt;p&gt;Applicants must be fully GDC registered Specialist in Endodontics/Prosthodontics or Periodontics, hold BDS/equivalent and committed to developing an academic career.&lt;/p&gt;\n&lt;p&gt;Applicants should note that all training programmes are equally open to those who may, either from the outset or subsequently, wish to train less than full time.&lt;/p&gt;\n&lt;p&gt;If your employment is subject to immigration control, you should visit the HEE website for Specialty Training for information about how this will affect your application. In some cases applications will not be considered, or only once the resident labour market test can be satisfied.&lt;/p&gt;\n&lt;p&gt;Please note that there is a strict application policy that applications cannot be accepted after the deadline.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note: All applicants who do not already hold a National Training Number (NTN) or Deanery Reference Number (DRN) in the GDC specialty to which they are applying for will be required to undertake the national clinical recruitment process and attend an assessment/interview for that GDC specialty as appropriate.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you require clinical benchmarking then you must also complete a separate standard clinical application form during the appropriate National Round.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications will be restricted to those candidates who meet the eligibility and entry criteria as outlined in the person specifications.&lt;/p&gt;\n&lt;p&gt;Applications via the Oriel Recruitment Portal.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information, contact the Restorative Training Programme Director - matthew.jerreat@plymouth.ac.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tips for submitting an application:&lt;br /&gt;&lt;br /&gt;• On completion save and re-open the application and then check prior to pressing the submit button. This will allow you time to review your completed application and check for any discrepancies.&lt;br /&gt;• Submit your application no later than 30 minutes before the deadline as there is a strict policy that applications cannot be accepted after the deadline.&lt;br /&gt;• If you are in the process of completing an application at the point of closure a warning message will appear and you will not be able to submit the application or retrieve any of the data input.&lt;br /&gt;Please refer to the Job Description and ACF person specification prior to starting your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England South West", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "ACF in Restorative (top up training of monospecialist to restorative)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240102", "validThrough": "2020-11-20T23:59:59+0000"}