{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-11-03T12:16:40+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced community nurse to joint the team in a Band 7 District Nurse Clinical Team Leader role. We are looking for a dynamic leader with substantial experience at Sister level or above and who has, or is working towards, a Community Specialist Practitioner Qualification in District Nursing. The successful candidate will have a passion for District Nursing and continuous service development. The post holder will be expected to work flexibly across all of the 9 District Nursing bases if required, and to participate in the weekend rota as a routine part of the role.&lt;/p&gt;\n&lt;p&gt;The District Nursing Service in East Lancashire is a well-led and dynamic service providing high quality care to adults with complex acute and long term conditions in their own homes and regulated care home settings. The area has a considerable number of well recognised Queen&#39;s Nurses and is dedicated to promoting the specialist skills and knowledge needed to provide excellent home based care. We provide a supportive working environment with professional development opportunities and staff wellbeing a high priority.&lt;/p&gt;\n&lt;p&gt;You will be expected to deliver high standards of clinical leadership in a fast paced environment and will be responsible for leading the delivery of safe, personal and effective care in patient’s homes.&lt;/p&gt;\n&lt;p&gt;General Duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong and effective clinical leadership&lt;/li&gt;\n&lt;li&gt;Quality assurance of clinical work&lt;/li&gt;\n&lt;li&gt;Education and supervision of staff in development&lt;/li&gt;\n&lt;li&gt;Producing reports, data interpretation, investigation analysis and harm free care reviews&lt;/li&gt;\n&lt;li&gt;Recruitment and selection&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will need to be able to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide strong leadership and expert clinical specialist knowledge to support and develop a district nursing team&lt;/li&gt;\n&lt;li&gt;Be a role model in delivering high quality, evidence based clinical care&lt;/li&gt;\n&lt;li&gt;Meet deadlines reliably&lt;/li&gt;\n&lt;li&gt;Be adaptable and responsive to challenges and change&lt;/li&gt;\n&lt;li&gt;Demonstrate substantial experience of integrated and multi-professional working&lt;/li&gt;\n&lt;li&gt;Have transferrable skills and be able to lead teams throughout East Lancashire if required.&lt;/li&gt;\n&lt;li&gt;Demonstrate resilience&lt;/li&gt;\n&lt;li&gt;Be confident in managing a team and responding to the learning and development needs of a team&lt;/li&gt;\n&lt;li&gt;Demonstrate dedication and commitment to developing your career in District Nursing&lt;/li&gt;\n&lt;li&gt;Have community nursing experience of working at Band 6 or above&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePolly HarrisJob titleMatron CIC DivisionEmail addresspolly.harris@elht.nhs.ukTelephone number07966 414978Additional contact information&lt;/p&gt;\n&lt;p&gt;We welcome enquiries and informal visits from prospective candidates.&lt;/p&gt;\n&lt;p&gt;Please contact Polly Harris (07966414978) or Helen Davis (079664 18884) for further information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Peter&#39;s Health Centre, Burnley", "postalCode": "BB11 2DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7914", "longitude": "-2.23893"}}, "title": "District Nursing - Clinical Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253935", "validThrough": "2020-11-16T23:59:59+0000"}