{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-27T09:15:18+0000", "description": "&lt;p&gt;&lt;span&gt;We are seeking to appoint an experienced, dynamic andhands-on Area Matron to join us in the South West Division.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful post holder will be responsible for providing senior clinical leadership and whilst providing clinical leadership in conjunction with primary care and other community services to people living in their own home or within a care setting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ideal candidate will be working within a clinical leadership position, they will have significant knowledge and experience working with complex community patient groups. They will feel comfortable supporting other team members and organizations to develop patient specific plans and be able to identify and enable the wide MDT needs to be coordinated. This may include medicines optimization, advanced care planning, anticipating future individual and family needs and other risks.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The organization will support the development within an advanced clinical practice framework and would see an existing non-medical prescribing qualification as an advantage. This role is an opportunity to develop both clinical leadership and clinical practice alongside your team and other matron Peers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As we redesign our services post Covid-19, you will be part of a newly evolving multi-disciplinary team consisting of Community Nurses, Physiotherapists, Occupational Therapists, Apprentice Nurses, GPs, and Administrators. While we all work to our core strengths and abilities, we also help each other to develop new skills and acquire new knowledge that enables us to provide truly holistic patient centered care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our division includes three physical health inpatient settings and one mental health inpatient setting with many specialist community facing services, including Diabetes, Respiratory and the integrated community teams. Our geographical area includes the New Forest, Lymington, Totton, Hythe, Romsey, Eastleigh, New Milton, Avon Valley and Ringwood to name a few. This means that the successful candidate will be joining us in one of the most picturesque areas of Hampshire.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Access to own vehicle for work is required as travel to patients own homes, care homes, trust buildings and hospitals will be required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful applicants will receive a comprehensive induction into the Trust. We have regular in house training sessions, access to a wealth of internal training and external courses and conferences to maintain your clinical skills and develop you further academically. The team has quality improvement and development embedded at its very core - you will be encouraged to help us shape and develop the services that we provide to our patients and their families. If you think this opportunity could be the right one for you please get in touch. Informal visits are strongly encouraged.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;For an informal discussion please contact Rachael Mejia, Head of Nursing and AHP on 02380 844113 or Ben Goodwin, Divisional Director of Nursing and AHP on 07768 863329&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lymington and New Milton Area", "postalCode": "SO41 8QD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7694", "longitude": "-1.54504"}}, "title": "Area Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243789", "validThrough": "2020-11-10T23:59:59+0000"}