{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "78913", "minValue": "43320", "unitText": "YEAR", "value": "£43,320 - £78,913 per annum, including London Weig"}}, "datePosted": "2020-11-02T17:01:24+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are invited for the post of Senior Clinical Fellow in Foot and Ankle with an emphasis on complex Diabetic Foot Reconstructive Surgery and Major Trauma, at the department of Orthopaedics, King’s College Hospital NHS Foundation Trust. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The fellowship is suited for senior foot and ankle trainees who have passed FRCS [Ortho] and completed foot and ankle fellowship and wish to gain further clinical experience in complex diabetic foot surgery, elective foot and ankle surgery and complex trauma. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The trainees will also benefit from opportunities to clinical research in this area that can enhance their publications and presentations profile. King’s Diabetic Foot Unit is the largest referral centre in the UK and the trainee will gain exposure to the multidisciplinary care of diabetic foot patients and the complex diabetic foot procedures, including one stage and two stage Charcot foot reconstructions, under the supervision of Prof. Venu Kavarthapu and his team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This placement will be for 12 months February 2021 - February 2022.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Victoria Elegbede&lt;/p&gt;\n&lt;p&gt;Job title Medical Staffing Manager&lt;/p&gt;\n&lt;p&gt;Email address victoriaelegbede@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 02032997672&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Foot &amp; Ankle Senior Clinical Fellow in Orthopaedics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252980", "validThrough": "2020-11-15T23:59:59+0000"}