{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-11-02T14:45:44+0000", "description": "&lt;p&gt;A exciting new role is available within in our team for a Diabetes Educator. This is a role for someone passionate about diabetes education, in particular staff education.&lt;/p&gt;\n&lt;p&gt;We are looking for a creative thinker who is able to put innovative ideas into practice, keep learning understandable and accessible for all MTW members of staff. The ideal candidate would be a motivated, good team player who is able to adapt to a more virtual working world.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a strategic role in developing our diabetes education service cross site. Therefore both diabetes knowledge and education experience is central to this role.&lt;/p&gt;\n&lt;p&gt;This role is open to job share therefore if your interest is part time not full time hours this would be considered, please indicated within your supporting statement.&lt;/p&gt;\n&lt;p&gt;We aim to offer diabetes specialist nurses the opportunity to work in any area of our service over time, to develop a broad range of diabetes knowledge, experience and skills. Our service covers in-patient, out-patient and community diabetes CNS roles so a unique place to work for any Diabetes CNS wishing to progress in the professional.&lt;/p&gt;\n&lt;p&gt;We are a friendly team and a team who would support anyone new to our team. Experience of in patient nursing would be an advantage to this current role.&lt;/p&gt;\n&lt;p&gt;Please make contact with Angela Murphy Diabetes CNS Lead for further details&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Monday 23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Angela Murphy, Diabetes CNS Lead, A.murphy11@nhs.net, 07710069359&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross Site, Maidstone and Tunbridge Wells", "postalCode": "TN2 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1491", "longitude": ".307289"}}, "title": "Diabetes Educator / Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252484", "validThrough": "2020-11-23T23:59:59+0000"}