{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25215", "minValue": "25215", "unitText": "YEAR", "value": "£15.00"}}, "datePosted": "2020-10-14T11:10:25+0100", "description": "&lt;p&gt;Providing quality, inspiring innovation and delivering value is what we set out to achieve at Priory Healthcare. Enabling our patients with mental health difficulties to receive a truly integrated and holistic approach to their treatment, regardless of complexity or severity, thanks to the knowledge and expertise of our multidisciplinary clinical teams.&lt;/p&gt;\n&lt;p&gt;The Priory Hospital Southampton is a smoke-free 40 bedded hospital, providing acute mental health services to both Adolescents and adults. We provide treatment packages for people who have mental health problems; issues with addictions and eating disorders.&lt;/p&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;Set back within 1.5 acres of landscaped gardens, the tranquil environment of the Priory Hospital Southampton offers therapeutic and recovery focused residential treatment as well as day care and outpatient services.&lt;/p&gt;\n&lt;p&gt;Priory Hospital Southampton is a smoke-free hospital that provides 40 beds across 3 wards. The services provided at the hospital include a young peoples ward (CAMHs) and treatment of most psychiatric conditions and Eating Disorders.&lt;/p&gt;\n&lt;p&gt;We have a highly experienced team of mental health professionals and support staff, which include consultant psychiatrists, psychologists, nurses and therapists&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;At Priory Healthcare we’re at the forefront of our field, with an international reputation for delivering clinical excellence. Across the UK’s largest network of mental health hospitals and clinics we are dedicated to making a real and lasting difference to patients with extraordinarily complex disorders.&lt;/p&gt;\n&lt;p&gt;The severity of cases means we are looking for Registered Mental Health Nurses who can thrive in an often-demanding environment. It will be challenging, and at times it can feel frustrating and dispiriting. But when your patients turn the corner, when you see that sign of progress, that’s when you know all the effort was worth it. That’s when you know you have the most extraordinary job.&lt;/p&gt;\n&lt;p&gt;About the role:&lt;/p&gt;\n&lt;p&gt;As well as providing outstanding treatment and care, we aim to deliver a service that’s empowering for our patients. One in which we can support them in maximising the quality of their life in the least restrictive manner possible. So when you join our multi-disciplinary team, you’ll work together to develop personalised, recovery-focused programmes and care pathways. Playing a vital leadership role on the ward, you’ll also use your expertise and ideas to help us continually evolve best practice and set new standards both within the Priory Group and across the profession.&lt;/p&gt;\n&lt;p&gt;What we’d like from you:&lt;/p&gt;\n&lt;p&gt;While you’ll be RMN qualified and NMC registered, we’ll be looking for a range of qualities that go beyond your qualifications and technical ability. Whether you are currently working elsewhere or returning to practice, you’ll be patient centric with a commitment to delivering high quality care. Finely tuned decision-making skills, communication skills and organisational capacity are a must, while your flexibility and can-do attitude will enable our patients to build on their existing strengths and feel positive about their lives.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to apply for a disclosure at the enhanced level from the Disclosure and Barring Services. Priory Group will cover the cost of a DBS check for all successful applicants. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO40 4DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.883", "longitude": "-1.44604"}}, "title": "Registered Mental Health Nurse - BANK", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225888", "validThrough": "2020-11-13T23:59:59+0000"}