{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-11-02T14:31:22+0000", "description": "&lt;p&gt;.This is an exciting opportunity for an experienced leader with knowledge and experience of Quality Improvement methodologies to support the development of Quality Improvement within the trust. This is a brand new post within the organisation, working closely with the Chief Nurse, who is the executive lead for Quality improvement.&lt;/p&gt;\n&lt;p&gt;Quality Improvement has recently moved to the Chief Nurse Directorate, so this is a fantastic opportunity to help shape and develop the Quality Improvement journey and strategy for NLaG. This post will manage a team of QI facilitators/leaders and provide trust wide leadership in the development of QI across the organisation, supporting the development of our NLaG QI Community, embedding this across the organisation. This role is key in supporting the Chief Nurse and there will be an expectation of an ability to be able to represent the Chief Nurse both internally and externally at a senior level.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity for an experienced leader/manager to help shape and develop our QI community, there will be a need to work at pace to refresh our current QI strategy, identify training needs across the organisation, supporting and developing a training programme, helping to develop a QI governance structure and making the QI community visible across the organisation.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ellie Monkhouse, Chief Nurse&lt;/p&gt;\n&lt;p&gt;03033 304733&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Rachel Wright, PA to the Chief Nurse&lt;/p&gt;\n&lt;p&gt;03033 304733&lt;/p&gt;\n&lt;p&gt;rachel.wright11@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide - Scunthorpe/Grimsby", "postalCode": "DN15 7BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5875", "longitude": "-.666943"}}, "title": "Associate Director of Quality Improvement", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252439", "validThrough": "2020-11-11T23:59:59+0000"}