{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-29T14:00:47+0000", "description": "&lt;p&gt;We are currently looking for a talented registered scientist or pharmacist with an interest in further developing their career within Radiopharmacy Services.&lt;/p&gt;\n&lt;p&gt;You will play a key role in the development of our regional Radiopharmacy service with the emphasis on quality assurance. You will be a key member of the multi-disciplinary team, delivering a diverse Radiopharmacy service from our licensed site at Liverpool.&lt;/p&gt;\n&lt;p&gt;The radiopharmacy produces over 15,000 doses per year, including diagnostic and therapeutic radiopharmaceuticals. We are a regional service, supplying nuclear medicine departments across the Merseyside and Cheshire region. We are a happy efficient and supportive team consisting of Pharmacists, technologists, technicians and senior assistants.&lt;/p&gt;\n&lt;p&gt;We work closely with radiographers and other staff such as clinicians, nurses and medical physicists. We support STP placements (2 in our department) and are keen to support team members to grow and develop their skills in line with service and individual aspirations.&lt;/p&gt;\n&lt;p&gt;We are undergoing a major transition period redesigning the way we deliver our service, and we have a new state of the art department within the new hospital (due to move in 2021). So if you are looking o be part of something big and exciting then now is the time to join us.&lt;/p&gt;\n&lt;p&gt;You must have experience working within an aseptic or radiopharmaceutical environment and possess the knowledge and skills to take on and develop this new scientist role. We are implementing Gallium service in early 2021 too so experience of this will be ideal. A key purpose of this post is to support with this project.&lt;/p&gt;\n&lt;p&gt;The typical working day starts at 7.15am but the opportunity for flexible or shift work may be possible given service requirements. The current service operates Monday-Friday. For further information or to arrange an informal visit please email Angela Bolch (Chief Radiopharmacist) or Martin Timmins (Lead QA Pharmacist).&lt;/p&gt;\n&lt;p&gt;To hear about the exciting work we do from our dedicated Trust employees and departments, for a future you could be a part of, please visit our Trust Facebook page by searching Liverpool University Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Click the Like button on the page to keep up to date with current vacancies and Trust news&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Angela Bolch&lt;/p&gt;\n&lt;p&gt;Job title Chief Radiopharmacist&lt;/p&gt;\n&lt;p&gt;Email address Angela.bolch@liverpoolft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0151 706 4596&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Additional contact information&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Martin Timmins (Lead QA pharmacist) Martin.timmins@liverpoolft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Liverpool University Hospital, Liverpool", "postalCode": "L7 8XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.96481"}}, "title": "Senior Pharmaceutical Scientist - Radiopharmacy Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248618", "validThrough": "2020-11-12T23:59:59+0000"}