{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum, pro rata"}}, "datePosted": "2020-10-27T08:16:30+0000", "description": "&lt;p&gt;We are seeking two enthusiastic and experienced Supervisors who enjoy working as part of a team to join our Musculoskeletal (MSK) referral management and triage service. This team manages all MSK referrals within the Hastings and Rother locality. We have two full time vacancies.&lt;/p&gt;\n&lt;p&gt;As a supervisor you would be working with the Bookings manager to ensure timely management of referrals, booking clinic appointments across a number of sites, clinic outcome letters, accurate recording of data and onward referral to secondary care and therapies.&lt;/p&gt;\n&lt;p&gt;As this team is an interface service to secondary care, you will need a good understanding of 18 week pathways for referral management and be able to work in line with the Trust Referral to Treatment Access and Management Policy as well.&lt;/p&gt;\n&lt;p&gt;As the first point of contact for a range of staff and patient’s regarding MSK referral management and services offered, you will need to have experienced and be able to deliver excellent customer care and support others in doing so.&lt;/p&gt;\n&lt;p&gt;A key element of this role is the supervision of staff and previous experience of such a role is essential. The successful applicant will also need to demonstrate good written and verbal communication together with strong interpersonal and IT skills. You will need to be able to adapt to different demands and situations during the day and still have an overview of teams’ workload to ensure good performance.&lt;/p&gt;\n&lt;p&gt;You will be required to work with the service leads and the Bookings Manager to understand the services and care delivered to ensure accurate and responsive management referrals.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKerry JacksonJob titleMSK Therapy Services - MSK Triage - Booking ManagerEmail addressk.jackson10@nhs.netTelephone number07900 890119&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Conquest and cross site working, Hastings", "postalCode": "TN37 7RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8854", "longitude": ".567737"}}, "title": "MSK Elective Bookings Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243687", "validThrough": "2020-11-10T23:59:59+0000"}