{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570-£43,772 Plus Enhancement"}}, "datePosted": "2020-11-05T13:57:13+0000", "description": "&lt;p&gt;An opportunity has arisen for nurse/ paramedic Practitioner/ emergency nurse practitioners and emergency care practitioners to join the Queen&#39;s/King GerogeHospital Urgent Treatment Centre (UTC).&lt;/p&gt;\n&lt;p&gt;The UTC (Urgent Treatment Centre) and UCC (Urgent Care Centre) is staffed by a multidisciplinary team who are responsible for patients presenting to the UTC/UCC who may require primary, urgent or emergency care. The team will see and treat patients according to agreed protocols and direct and refer patients to the most appropriate clinical area based on their clinical needs.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The role of the NIght Clinical Streamer was developed in response to the increasing number of people self-presenting with health-related issues that requires a clinician to direct patients promptly to the right place first time.&lt;/p&gt;\n&lt;p&gt;The Night Clinical Streamer will be responsible for ensuring the safe and effective redirection of patients to the most appropriate clinician or health care provider in accordance with approved guidelines.&lt;/p&gt;\n&lt;p&gt;You will be working closely with the GPs in Essex t to deliver an outward-facing streaming service focussing on reducing hospital attendances.&lt;/p&gt;\n&lt;p&gt;You will be using advanced clinical skills in the multi-disciplinary team to deliver health care and advice for patients presenting with undifferentiated and undiagnosed problems predominately at night.&lt;/p&gt;\n&lt;p&gt;The requirement is for streamers to cover the rota for&lt;/p&gt;\n&lt;p&gt;Night working Monday – Sunday 24:00-08:00&lt;/p&gt;\n&lt;p&gt;nights; with an ability to provide cover for the remainder of the weekend days and weekday evenings. Shift length varies from 8 hours.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date:19/11/2020 (At Midnight)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Where response levels are exceptional we may close the post before the specified date, therefore early application is recommended.&lt;br /&gt;&lt;br /&gt;If you have not heard within 2 weeks from the closing date, please assume your application has not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt;We recognise the potential of a diverse workforce and welcome applications from all sections of the community. PELC also provides voluntary membership of the NHS Pension Scheme.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129494.jpg", "name": "Partnership of East London Cooperatives Ltd (PELC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129494"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens/King George Hospital/Harold wood/Barking", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Night Clinical Streamer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257994", "validThrough": "2020-11-19T23:59:59+0000"}