{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-20T14:45:50+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Homerton University Hospital NHS Foundation Trust&lt;/span&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant in Gastroenterology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Permanent post - Full time&lt;/p&gt;\n&lt;p&gt;Homerton University Hospital NHS Foundation Trust is a medium sized local hospital providing acute and community health services for Hackney, The City and surrounding communities and also provides a range of specialist services for a much wider population. As a foundation trust, Homerton has greater freedom from the Department of Health to enable it to be more responsive to local healthcare needs and have greater accountability to the patients and public it serves.&lt;/p&gt;\n&lt;p&gt;The Academic Department of Medical and Surgical Gastroenterology was opened in July 1999, with the aim of further developing team working and communication and promoting joint research, audit and academic activities. All of the Medical and Surgical Gastroenterologists have offices together adjacent to the endoscopy unit, where we also have a meeting area with PowerPoint projection facilities and live video-link to the procedure rooms. We have a joint journal club, academic meetings, radiology conference, and multidisciplinary clinical meetings. The medical and surgical gastroenterology wards are adjacent, facilitating joint ward rounds.&lt;/p&gt;\n&lt;p&gt;Endoscopy is carried out in a purpose built unit next to the Day Stay Unit with three procedure rooms with a full range of up-to-date video endoscopy equipment. A wide range of diagnostic and therapeutic procedures are carried out, including endoscopic ultrasound, ERCP, stenting, dilatation, polypectomy, argon beam photocoagulation, PEG and PEJ feeding. We currently carry out approximately 2000 upper GI endoscopies per year, (including direct access) 1000 colonoscopies, 450 flexible sigmoidoscopies and 200 ERCPs. We are a recognised European Training Centre for endoscopy, and JAG accredited for bowel cancer screening.&lt;/p&gt;\n&lt;p&gt;Medical gastroenterology clinics, see over 1600 new patient referrals per year. Specialist clinics are provided for inflammatory bowel disease, liver disease, hepatobiliary disease and nutrition.&lt;/p&gt;\n&lt;p&gt;The Homerton is at the centre of an ethnically and culturally diverse population with a high incidence of gastrointestinal and liver disease. There are opportunities for research and the post holder will be encouraged to undertake clinical research projects.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to attend ward referrals and in-patients with gastroenterological disease and will undertake conventional outpatient clinics and endoscopy sessions. The post-holder will participate in the emergency GI Bleed rota (currently 1:7).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: Friday 11th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note: The advert may close early applicant numbers dependent.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Informal enquiries are welcome: please contact:&lt;/p&gt;\n&lt;p&gt;Dr Iain Ewing or Dr Laura Marelli on 020 8510 7435 via their secretaries&lt;/p&gt;\n&lt;p&gt;or Dr. Emma Rowland – Associate Medical Director for IMRS via Switchboard (0208 510 5555).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Homerton University Hospital NHS Foundation Trust, Hackney", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Consultant Physician and Gastroenterologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234844", "validThrough": "2020-11-17T23:59:59+0000"}