{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-14T16:15:53+0100", "description": "&lt;p&gt;North Bristol NHS Trust&lt;/p&gt;\n&lt;p&gt;Consultant in Medicine for Older People&lt;/p&gt;\n&lt;p&gt;10PAs&lt;/p&gt;\n&lt;p&gt;We are seeking a Consultant Geriatrician, who is dedicated and passionate in helping us to provide outstanding and exemplary care for older, frail patients in the South West.&lt;/p&gt;\n&lt;p&gt;Following development of our Frailty strategy and recruitment of two other geriatricians this year, this will be a very exciting time to work within the Medicine for Older People team at North Bristol, particularly if you wish to enhance and develop your skills and career.&lt;/p&gt;\n&lt;p&gt;We can support you if your interest lies in Specialty Liaison work such as working with surgical specialties, specialist clinics such as syncope, rapid access clinics, rehabilitation or other areas that you wish to progress. The post holder will work with ten other Medicine for Older People consultants in providing a range of services for older people with complex needs, and so you will have a supportive and friendly team around you, providing plenty of scope for you to showcase your skills and to learn more.&lt;/p&gt;\n&lt;p&gt;This is also a great opportunity for you to live and work in Bristol; a city in the hills of South West England, with its own thriving art, music and cultural scene hosting a number of exciting annual festivals such as the Bristol International Balloon Fiesta and the Bristol Harbour Festival.&lt;/p&gt;\n&lt;p&gt;Applicants should be able to demonstrate extensive experience in Medicine for Older People and must be in possession of CCT in General Internal Medicine and Geriatric Medicine. Applicants are required to be on the Specialist Register for General Internal Medicine and Geriatric Medicine. Full Registration with the GMC is essential.&lt;/p&gt;\n&lt;p&gt;If you are interested please contact Dr Jarrod Richards, Specialty Lead in Medicine for Older People by emailing jarrod.richards@nbt.nhs.uk or by calling 0117 414 6440.&lt;/p&gt;\n&lt;p&gt;Closing date: 11.11.20&lt;/p&gt;\n&lt;p&gt;Interview date: 15th December 20&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJarrod RichardsJob titleConsultant Geriatrician &amp; Specialty LeadEmail addressjarrod.richards@nbt.nhs.ukTelephone number0117 414 6440&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Consultant in Medicine for Older People", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227057", "validThrough": "2020-11-11T23:59:59+0000"}