{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-11-04T13:30:51+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Resourcing Team Leader – International Recruitment&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Fixed Term Contract – Twelve Months&lt;/p&gt;\n&lt;p&gt;Full Time 1 WTE&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Resourcing Team at UHCW NHS Trust. With patient care at the heart of everything we do; recruitment plays a key role in the effective running of our organisation. We have a dedicated recruitment team that provide a recruitment administration service to the Trust. We are expanding our services and as a result we are looking to recruit an additional resourcing team leader who will work in the capacity of a supervisor within our team.&lt;/p&gt;\n&lt;p&gt;This is a 12 month fixed term contract to provide leadership support to the new International Nursing Recruitment project. The post holder will lead the administration of new processes and procedures to support the recruitment of international nursing staff.&lt;/p&gt;\n&lt;p&gt;This role will also be responsible for ensuring robust auditing processes are in place to ensure compliance and adherence to standard operating procedures, national requirements as well as identify any areas for improvement. You will need to have experience of working within a recruitment environment providing an end to end recruitment service and have experience of supervising junior staff you also will possess knowledge of using an inhouse HR system and understand the law relating to recruitment . We are looking for individuals who conduct themselves in a professional, confident manner possess an enthusiastic can-do attitude and communicate effectively. In return, we offer a comprehensive in-house training plan and the opportunity to join a friendly, highly motivated and forward-thinking team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicholas ChappellsJob titleResourcing Manager&lt;/p&gt;\n&lt;p&gt;Email address nicholas.chappells@uhcw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number02476 967658&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital, Coventry, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Resourcing Team Leader - International Recruitment", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256021", "validThrough": "2020-11-18T23:59:59+0000"}