{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25000", "minValue": "25000", "unitText": "YEAR", "value": "£25,000 per annum"}}, "datePosted": "2020-11-02T13:46:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;London Central &amp; West Unscheduled Care Collaborative (LCW UCC)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;Information Management &amp; Technology&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;St. Charles Centre for Health &amp; Wellbeing, Exmoor Street, London, W10 6DZ. Please note that this role is office based at St Charles Centre for Health &amp; Well-Being, W10 6DZ and includes working at weekends, Unsocial Hours and Bank Holidays when required. It is therefore essential that you can travel to and are resident within reasonable commuting distance of this location.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£25,000 per annum, plus Enhancements for Weekends, Unsocial Hours and Bank Holidays worked.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full Time (37.5 Hours).&lt;/p&gt;\n&lt;p&gt;Founded in 1994 out of a local GP cooperative, &lt;strong&gt;London Central &amp; West Unscheduled Care Collaborative (LCW UCC)&lt;/strong&gt; has evolved into one of London&#39;s largest and most successful providers of Integrated Urgent Care services (incorporating 111 and GP OOH) covering a population of about 3.2 million.&lt;/p&gt;\n&lt;p&gt;The organisation has in its 26-year history expanded its portfolio of services and our skill mix of clinicians who now include GPs, Advanced Nurse Practitioners, Nurses, Paramedics, and Pharmacists. In addition, we have grown our non-clinical support team. Most of our work is in the urgent care environment working in partnership with Commissioners, Acute and Community Trusts, GP Federations and other health and social care organisations in the development of Integrated Services.&lt;/p&gt;\n&lt;p&gt;London Central &amp; West Unscheduled Care Collaborative is a consistently high performer in all aspects of service delivery as well as other patient safety initiatives and compliance with best practice and statutory regulation. We were the first London provider to go live with a 24/7 Integrated Urgent Care service. We pride ourselves on the ability to innovate and collaborate and have supported many NHSE and local technology and workforce pilots within the development of Integrated Urgent Care.&lt;/p&gt;\n&lt;p&gt;We believe and value Equality &amp; Diversity in all aspects of our work, as a provider of health services and as an employer.&lt;/p&gt;\n&lt;p&gt;We are looking for a passionate and pro-active IM&amp;T Support Officer to provide unstinting support to our IM&amp;T Team. You will be responsible for providing day-to-day support with a particular focus on the support and use of the IM&amp;T and telephony resources that are used to support the delivery of the Clinical Services. This role will involve the creation of IM&amp;T support processes and ability to link to NHS Informatics/Platform Developments as well as messaging formats and reporting processes.&lt;/p&gt;\n&lt;p&gt;Management of external support arrangements and contribution to direct support provision is key to the role, which will require a detailed understanding of the business of the organisation and systems that are currently used to support that provision.&lt;/p&gt;\n&lt;p&gt;The working hours for the role of IM&amp;T Support Officerare Monday to Friday (9 am to 5pm), although, you may be asked to work unsocial hours, weekends and bank Holidays.&lt;/p&gt;\n&lt;p&gt;Travel to other sites may be required.&lt;/p&gt;\n&lt;p&gt;We offer a basic salary of £25,000 per annum, pro-rata, plus Enhancements for Weekends, Unsocial Hours and Bank Holidays worked.&lt;/p&gt;\n&lt;p&gt;LCW also offer the following benefits to our staff:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;25 days annual leave in addition to 8 bank holidays&lt;/li&gt;\n&lt;li&gt;NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;NHS discount scheme.&lt;/li&gt;\n&lt;li&gt;Eye care vouchers&lt;/li&gt;\n&lt;li&gt;Access to E-learning&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We will reserve the right to close this vacancy early in the event of receiving enough applications.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: To Be Advised&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "London Central and West Unscheduled Care Collaborative (LCW UCC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W10 6DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5224", "longitude": "-.217393"}}, "title": "IM&amp;T Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252281", "validThrough": "2020-11-18T23:59:59+0000"}