{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51198", "minValue": "51198", "unitText": "YEAR", "value": "£51,198 per annum, inc London Weighting"}}, "datePosted": "2020-10-23T08:16:18+0100", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are invited for a full time Trust funded NHS Senior Clinical Fellow post in Oral &amp; Maxillofacial Surgery at King’s College Hospital NHS Foundation Trust. The successful candidate will have established leadership and team-working qualities and will be expected to play an active role in the provision and delivery of healthcare for patients who need treatment for a wide range of non-oncology conditions in the specialty including facial and craniofacial trauma, orthognathic surgery, salivary gland surgery, TMJ replacement surgery and reconstructive surgery for facial skin defects.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The department plays an active role in the established Major Trauma Centre at King’s and therefore a main emphasis of the post will be the provision of Oral &amp; Maxillofacial Trauma services both within and out of normal working hours.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are four Specialty Registrar posts and this Senior Clinical Fellowship (Trauma and Facial Deformity) post in the department. The successful candidates will cover the post for service provision for 1 year from appointment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;MBBS or an equivalent medical as well as BDS or equivalent dental degrees are mandatory. The successful candidates will be expected to be skilled and confident enough to do 2nd on-call on a 1:5 basis during work days and 1:10 for weekends together with a junior colleague with a dental or a medical degree.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will also be expected to cover clinical services across all sites of King’s College Hospital NHS Foundation Trust.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Rachael Wickington&lt;/p&gt;\n&lt;p&gt;Job title Service Support Manager, OMFS&lt;/p&gt;\n&lt;p&gt;Email address kch-tr.maxfac-department@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 020 3299 5194&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Senior Clinical Fellow in Facial Trauma and Deformity", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239641", "validThrough": "2020-11-28T23:59:59+0000"}