{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16608", "minValue": "15465", "unitText": "YEAR", "value": "£9.20 to £9.88 per hour"}}, "datePosted": "2020-11-02T16:31:03+0000", "description": "&lt;p&gt;The NHS needs you now more than ever. &lt;strong&gt;We are recruiting for flexible Bank Housekeeping Assistant positions, to work at community healthcare sites across Dorset&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Our people are working hard behind the scenes to provide safe, clean, well maintained environments for patients and their NHS colleagues during this challenging time. They are the &lt;strong&gt;&lt;em&gt;#HiddenHeros&lt;/em&gt;&lt;/strong&gt; and we need people like you to join them. You will become part of a team who are passionate about supporting the NHS and its people in their vital work by keeping premises clean and safe. &lt;strong&gt;We will provide you with full and appropriate Personal Protective Equipment and training&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have a range of shifts available 7 days a week to suit your lifestyle, with hours and start and finish times varying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary and benefits;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;£9.20 to £9.88 per hour (&lt;em&gt;dependant on previous NHS experience&lt;/em&gt;).&lt;/li&gt;\n&lt;li&gt;Enhancements for early, late and weekend hours working&lt;/li&gt;\n&lt;li&gt;Other benefits including access to the NHS pension scheme and an NHS badge entitling you to many NHS benefits!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Where would you work?;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Shifts are available at a range of sites across the whole of Dorset (&lt;em&gt;please specify in your &#39;supporting information&#39; where in the county you would be able to travel to&lt;/em&gt;).&lt;/li&gt;\n&lt;li&gt;Varied and flexible shifts are available.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What would you do?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be responsible for ensuring a clean environment for patients by; vacuum cleaning; mopping; dusting, cleaning mirrors, baths, showers, sinks, toilets, washing of tiled surfaces and paintwork; walls and ceilings; emptying and cleaning bins and making sure paper towels; toilet tissue; hand soap dispensers. High dusting of walls and ceilings, floor maintenance, etc., changing of disposable curtains, carry out deep clean/terminal cleans when necessary (in in-patient areas) etc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What experience and skills do you need?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You do not need to have any experience as full training and support will be provided&lt;/li&gt;\n&lt;li&gt;The role is physically demanding so you will need a fair level of fitness&lt;/li&gt;\n&lt;li&gt;We are looking for people who have the right values and want to make a difference&lt;/li&gt;\n&lt;li&gt;You will need to have good basic level of English because you may need to speak to patients, visitors and staff in a healthcare environment as well as reporting any issues, ensuring that you understand your training and can carry out all policies and procedures and able to keep accurate records.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What are we looking for?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;People who will do a great job in delivering the best cleanliness standards for NHS Patients, staff and visitors&lt;/li&gt;\n&lt;li&gt;You will work hard, be a great team ambassador and bring energy to everything you do&lt;/li&gt;\n&lt;li&gt;You will join a team who are committed to promoting equal opportunities and diversity - we welcome people who want to contribute to our inspiring and inclusive workforce.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What do you need to think about before applying?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role is physically demanding, and you will be moving/using equipment and furniture, stretching, reaching, bending and doing lots of repetitive movements; you will also be exposed to dirt, dust and smells. Please make sure you think about how you will get to the site and the hours that will work for you.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Successful applicants will be contacted to arrange a telephone interview shortly after the advertised closing date.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Employment in this post requires a Standard Disclosure and Barring Service (DBS) check, which we will carry out for you, no charge will be made for this.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Recruitment Team&lt;/p&gt;\n&lt;p&gt;Email address: dhc.domesticadmin@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pan Dorset", "postalCode": "BH17 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7402", "longitude": "-1.97751"}}, "title": "Bank Housekeeping Assistant, Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252864", "validThrough": "2020-11-08T23:59:59+0000"}