{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "88744", "minValue": "58808", "unitText": "YEAR", "value": "£58,808 - £88,744 pa - Dependant on experience"}}, "datePosted": "2020-10-06T09:16:02+0100", "description": "&lt;p&gt;Are you looking for a new opportunity within Primary Care?&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides 8 well established GP practices across Hull &amp; the East Riding of Yorkshire. We provide excellent healthcare to over 48,000 patients within the GP Practices and we have been rated Good by CQC.&lt;/p&gt;\n&lt;p&gt;We currently have various opportunities for dynamic Salaried GP’s to join our network of GP Practices within Hull. We are looking for Salaried GPs who are interested in working both full and part time hours.&lt;/p&gt;\n&lt;p&gt;As a multi-specialty health and social care teaching provider, we also provide a wide range of services including, community services, community and inpatient mental health services, learning disability services, healthy lifestyle support and addictions services in Hull, the East Riding of Yorkshire, Scarborough and Ryedale and the Whitby area, employing approximately 2,500 staff across over 120 sites. As a teaching trust, we work closely with our major academic partners, nurturing a workforce of tomorrow’s health professionals.&lt;/p&gt;\n&lt;p&gt;As a Salaried GP within our Practices we are able to offer effective Work Life Balance including the ability to work remotely to undertake administrative work and also telephone and video consultations with patients. Each of our GP Practice has the support of a Multi-Disciplinary Team including Advanced Nurse Practitioners.&lt;/p&gt;\n&lt;p&gt;The Practices clinical team is also well supported by an excellent administration and management team; this allows our Salaried GPs to concentrate on clinical work.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to be part of the transformation of our primary care services, moving away from typical models but still retain the best of primary care, developing our multidisciplinary team to support the working day of a GP and offer a difference to our patients and staff.&lt;/p&gt;\n&lt;p&gt;Our aim is to provide an excellent standard of primary care whilst supporting personal and professional development. Our people are our most valued asset and we encourage our GPs to develop their skills and interests locally and within the wider organisation.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be committed to the needs of patients, service users, carers and the surrounding community and to continuing to improve the quality of the services that we provide.&lt;/p&gt;\n&lt;p&gt;Full and Part-time vacancies available.&lt;/p&gt;\n&lt;p&gt;You will be asked to prove your Right to Work in the UK and complete identification checks.&lt;/p&gt;\n&lt;p&gt;Please Note:&lt;/p&gt;\n&lt;p&gt;If you are successfully shortlisted we will contact you via the email address that you have applied from. Please ensure you check your emails regularly.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated &lt;strong&gt;Good&lt;/strong&gt; by the Care Quality Commission. The Trust is also proud to be HSJ Provider of the Year 2019 award winners.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,800 staff across more than 79 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Hull has benefitted from being included The Guardian’s ‘Hot List’ of places to visit and rated by Rough Guides as one of the top ten cities in the world to see. The nearby town of Beverley was named by The Sunday Times as one of the ten best places to live in the north. The area boasts a wide array of diverse property from coastal cottages to riverside apartments. Hull and the East Riding of Yorkshire offer some of the most competitive house prices in the country, with access to excellent schools and further and higher education providers.&lt;/p&gt;\n&lt;p&gt;The region has great transport connections with an hour commute York or Leeds. Want to go further afield? There are daily ferry crossings from Hull to Belgium and the Netherlands and from Humberside Airport you can reach destinations across Europe and – via Schiphol – worldwide.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDave SuttonJob titlePractice ManagerEmail addressdavesutton@nhs.netTelephone number07976225444&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northpoint Medical Practice, Hull", "postalCode": "HU7 4DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.787", "longitude": "-.322371"}}, "title": "Salaried GP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213995", "validThrough": "2020-11-15T23:59:59+0000"}