{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inc"}}, "datePosted": "2020-10-26T14:47:00+0000", "description": "&lt;p&gt;Are you passionate about providing elderly people the opportunity to live fulfilled and respected lives? Do you aspire to provide care with dignity to older patients in a team that has been described as &lt;strong&gt;“doing a fantastic job to be extremely proud of”&lt;/strong&gt; by their patients and families?&lt;/p&gt;\n&lt;p&gt;The Royal London Older People services is looking for compassionate and caring newly qualified and experienced band 5 nurses to join our award-winning service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Older Peoples Services, wards care for patients from the age of 65 for Acute Medical conditions, with specialist services for Dementia patients.&lt;/p&gt;\n&lt;p&gt;Based on the 14th Floor of the Royal London Hospital, the wards provide a picturesque view of London, paired with two bespoke Indoor garden spaces with tea rooms, creating a calm and social environment in the wards to promote active recovery along with our #EndPJParalysis campaign.&lt;/p&gt;\n&lt;p&gt;We are passionate about compassionate care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can offer you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Within this role we will offer you the opportunity to undertake our 18-month Preceptorship Programme, rated “Outstanding” by Health Education England in 2015. We would also encourage you to undertake our Mentorship course to develop your leadership skills and work with our dedicated Practise Development nurse to build key experience within your nursing career.&lt;/p&gt;\n&lt;p&gt;We also offer a wide range of development courses including training with our on-site Dementia and Delirium team, Palliative care training course from St Joseph’s Hospice, tissue viability specialist training and more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“It is a great Honour and a Pleasure to look after our Elderly Patients… We all work as a Team to provide Excellent Quality Care.” – Staff Nurse in Royal London Elderly Care Ward&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are interested in joining our friendly service, you will need to be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A registered nurse or final year student nurse&lt;/li&gt;\n&lt;li&gt;Able to work amongst various multidisciplinaries&lt;/li&gt;\n&lt;li&gt;Passionate about providing the best care for older patients of different cultures and backgrounds&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you meet the above criteria, we would welcome an application from you and would ask you to explain in your supporting statement why you are passionate about Nursing.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Susan Brosnan, Ward Manager on susan.brosnan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal London Hospital, London", "postalCode": "E1 1FR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.059802"}}, "title": "Older People Services - Compassionate Care Staff Nurse - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242971", "validThrough": "2020-11-09T23:59:59+0000"}