{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544-£53,459 incl. Fringe HCAS"}}, "datePosted": "2020-11-06T15:06:30+0000", "description": "&lt;p&gt;&lt;em&gt;This post will close as soon as sufficient applications are received.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Ensuring IT Infrastructure solutions are defined, architected, implemented, used effectively and continually improved enabling the Trust and its partners to enhance the delivery of services and ultimately improve the outcomes for people using health and social care services across the health community.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Overview&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Act as the technical operations lead and authority ensuring security and maintenance of relevant networking infrastructure services are maintained by partners and suppliers.&lt;/li&gt;\n&lt;li&gt;Lead on the development of all technical elements in strategic solution design across IT infrastructure services to meet business requirements across stakeholders.&lt;/li&gt;\n&lt;li&gt;Lead on complex technically driven decisions and be responsible for technical resource planning and project resource allocation.&lt;/li&gt;\n&lt;li&gt;Facilitate the adoption of new and updated technologies and services – handling the handover of relevant technologies and process the associated support services teams and partners where appropriate. Lead an aggressive change programme across the portfolio delivering the adoption of redeveloped and new services&lt;/li&gt;\n&lt;li&gt;Be pivotal in the assessment of proposed projects and technologies acting as a senior consulting party, speaking with technical authority.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Working Hours 37.5 hours per week- Monday to Friday&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leatherhead, Surrey", "postalCode": "KT22 7AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2976", "longitude": "-.335577"}}, "title": "Digital Technical Consultant (Networking) – Surrey CoIN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260279", "validThrough": "2020-11-20T23:59:59+0000"}