{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 Consultant"}}, "datePosted": "2020-10-09T11:02:32+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Rheumatology &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;Rheumatology (Neurosciences and Musculoskeletal Division)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base location: &lt;/strong&gt;Brunel Building, Southmead Hospital, Bristol&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;Consultant £79,860 to £107,668 per annum (8 PA substantive contract)&lt;/p&gt;\n&lt;p&gt;Our vision at NBT is that by enabling our teams to be the best they can be we will provide exceptional healthcare, personally delivered. Our values represent the way we do things and what we stand for. By embedding these shared values in everything with do, we aim to create positive experiences for patients and staff. Our Trust is a great choice for people who want to develop their career in an environment that delivers high quality care.&lt;/p&gt;\n&lt;p&gt;Our rheumatology department is diverse and ambitious with a shared vision to strive for excellence. We have an exciting opportunity to join a dynamic and forward-thinking rheumatology team. We want to recruit an energetic and innovative consultant colleague in the Neurosciences Musculoskeletal Division, based in the newly opened £450 million Brunel building at Southmead Hospital. NBT is a tertiary centre for a number of specialities including specialised rheumatology | autoimmune connective tissue disease and vasculitis. We treat patients with all aspects of rheumatology and provide comprehensive services for inflammatory arthritis, ultrasound, metabolic bone disease | osteoporosis, GCA and CTD vasculitis. In addition, we have a successful and highly productive academic rheumatology team linked with the University of Bristol. You will join a department of 9 Consultants (including a Rheumatology Consultant Pharmacist), 3 Speciality Trainees, 2 MRC funded Academic Fellows, 5 Specialist Nurses, 1 additional Specialist Pharmacist, 1 Clinical Psychologist and dedicated therapies team.&lt;/p&gt;\n&lt;p&gt;This is a pure rheumatology post with GIM commitment. The post holder would be required to deliver a clinical service including clinics at base hospital Southmead and satellite hospital Cossham. Applicants with a sub-specialist interest are welcome and we are flexible in terms of department needs which include supporting the EIA service. Candidates with an expertise in digital pathways – virtual | remote clinic models, patient initiated pathways and patient-reported data applications are particularly welcome.&lt;/p&gt;\n&lt;p&gt;Applicants are required to be on the Specialist Register and/or have a CCT in Rheumatology or be within six months of obtaining it by the interview date. Full current professional registration with the GMC is essential. Experiences and familiarity within UK hospital systems and practices or equivalent is essential. The successful candidate will be employed under the Terms &amp; Conditions of Service for Consultants (England) 2003. The post will close before the intended closing date should sufficient number of suitable applications be received. Therefore, if you interested in applying, we suggest you do so at the earliest opportunity. If you are shortlisted we will contact by email with details of the interview of which you will need to confirm attendance. Therefore, please check your online account regularly.&lt;/p&gt;\n&lt;p&gt;North Bristol NHS Trust does not pay for interview expenses. Late applications will not be accepted.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHarsha GunawardenaJob titleClinical Lead RheumatologyEmail addressharsha.gunawardena@nbt.nhs.ukTelephone numberTel: 0117 4142842 or via Secretary Pamela Stone, Tel: 0117 4142851&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Consultant in Rheumatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219903", "validThrough": "2020-11-08T23:59:59+0000"}