{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum"}}, "datePosted": "2020-10-16T17:45:32+0100", "description": "&lt;p&gt;&lt;strong&gt;NHS 111 Senior Clinical Advisor (Integrated Urgent Care) – NHS Pathways trained&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Based at Barking, North East London &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 - £36,070 – £42,712 (inc. outer London HCAS) plus unsocial hours, as appropriate, in line with Section 2. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for experienced NHS Pathways trained clinicians to work within our Integrated Urgent Care Clinical Assessment Service, assessing a wide range of health and clinical needs, ensuring the most appropriate care is delivered to our patients.&lt;/p&gt;\n&lt;p&gt;As a Senior Clinical Advisor, you will be responsible for the triage and assessment of patients’ using your professional clinical judgment, supported by NHS Pathways decision support software. You will need to deliver care to a diverse range of patients, relatives and carers within our NHS111 call centre environment. Applying critical thinking skills, you will be providing assessment, medication advice and health information, supporting patients to access the appropriate level of care for their specific needs or to provide advice to manage their symptoms at home.&lt;/p&gt;\n&lt;p&gt;To excel in this role, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be a registered professional with an appropriate regulatory body (HCPC, NMC first level) with current, valid registration&lt;/li&gt;\n&lt;li&gt;Have substantial, autonomously practising, post qualification experience working in a primary, acute or ambulance setting with experience of clinical assessment&lt;/li&gt;\n&lt;li&gt;Hold a current and up to date NHS Pathways licence to use the CDSS triage system&lt;/li&gt;\n&lt;li&gt;Be a NHS Pathways trained coach or have a commitment to undertake further training to provide mentoring and coaching for students, health advisors and other clinicians&lt;/li&gt;\n&lt;li&gt;Be committed to continuing your professional development and maintenance of clinical assessment skills&lt;/li&gt;\n&lt;li&gt;Have excellent interpersonal and communication skills with enthusiasm and passion to deliver high quality patient care&lt;/li&gt;\n&lt;li&gt;Be computer literate including the use of MS Office packages&lt;/li&gt;\n&lt;li&gt;Be able to work under pressure and deal sensitively with distressing or emotional situations&lt;/li&gt;\n&lt;li&gt;Be able to work effectively as part of a team with a variety of clinical specialists within the IUC as well as on your own initiative&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In this role you will have a good awareness of performance and clinical governance standards required both personally and for the team and continually strive to exceed these targets within all relevant clinical safety frameworks. You will work with colleagues to ensure continuous improvement of services to patients and other stakeholders.&lt;/p&gt;\n&lt;p&gt;This is a 24/7 role and there is a requirement to work a variety of shifts including evenings, nights, weekends and bank holidays. Unsocial hours is payable, in addition to the salary quoted dependent upon working pattern.&lt;/p&gt;\n&lt;p&gt;For further details or an informal discussion/visit please contact: Lee Taylor, Clinical Operations Manager at lee.taylor@lond-amb.nhs.uk&lt;/p&gt;\n&lt;p&gt;Closing date for applications will be Sunday 8th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "London Ambulance Service NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122295"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maritime House, Barking", "postalCode": "IG11 8HG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5389", "longitude": ".07877"}}, "title": "Senior Clinical Advisor 111 (Nurse/Paramedic) - Barking", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231277", "validThrough": "2020-11-08T23:59:59+0000"}