{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 p.a."}}, "datePosted": "2020-11-05T11:46:03+0000", "description": "&lt;p&gt;This post is suitable for a motivated RNLD, RMN or Occupational therapist who has a passion to work with people with a Learning Disability.&lt;/p&gt;\n&lt;p&gt;The Learning Disabilities Intensive Support team is a Pan Dorset Team.&lt;/p&gt;\n&lt;p&gt;We support people with Learning Disabilities who may be experiencing periods of crises in their lives, they may have a secondary diagnosis of underlying Mental Health, Forensic presentation, at risk of placement break down. Transition from Children to Adult services, Transition from specialist out of area hospitals back to community settings.&lt;/p&gt;\n&lt;p&gt;The team is multi disciplinary, and consist of Nurses, Occupational Therapist Clinical assistants, support from psychiatrist, psychologist and speech and language therapist.&lt;/p&gt;\n&lt;p&gt;The team works 8-8 seven days a week 365 days a year, enhancements are paid for Bank Holidays and weekends . Shifts are 8-4 and 12-8 on a rota biases.&lt;/p&gt;\n&lt;p&gt;This is a permanent Full time position but for the right candidate part time hours would be considered.&lt;/p&gt;\n&lt;p&gt;If you are highly motivated, want to be part of a dedicated team who are passionate about people with learning Disabilities, a desire to be involved in innovative practice then this role is for you.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Lynne Homes, Clinical Lead at lynne.holmes4@nhs.net / 01202 636158.&lt;/p&gt;\n&lt;p&gt;If you wish to discuss this vacancy further please contact the team 01202 636158 as any member of the team will be happy to discuss the role with you further.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bournemouth", "postalCode": "BH9 2SD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7496", "longitude": "-1.88192"}}, "title": "Intensive Support Team Practitioner, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257495", "validThrough": "2020-11-19T23:59:59+0000"}