{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-02T15:45:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an experienced UK adult registered nurse with excellent clinical skills?&lt;/strong&gt;&lt;strong&gt;Do you enjoy working in a fast paced and varied environment?&lt;/strong&gt;&lt;strong&gt;Would you like to work in an outstanding acute trust? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There really has never been a more exciting time to join us; University Hospitals Bristol NHS Foundation Trust and Weston Area Health NHS Trust have merged together to become one organisation. Our newly merged Trust has a combined workforce of over 13,000 staff, aiming to deliver exceptional local services for local people and specialist services across the South West and beyond. Together, we form one of the largest NHS trusts in the country.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Surgical &amp; Trauma Assessment Unit (STAU) at the Bristol Royal Infirmary&lt;/strong&gt; has recently re-located increasing the wards capacity. We are therefore looking to recruit experienced nurses with a broad range of clinical skills, ideally with surgical or admissions unit background. This is friendly team working in a diverse and exciting environment. We specialise in the initial assessment of acute surgical and trauma patients referred by their GP’s or the Emergency Department.&lt;/p&gt;\n&lt;p&gt;We offer plenty of support to our new staff, in terms of training, guidance and mentorship from nursing colleagues and the whole multi-disciplinary team. This is a great place to develop your clinical examination and pain management skills, problem solving ability, discharge planning, and shift co-ordination experience. We are keen to see our staff grow and achieve their potential, and will help you develop your management skills into the nurse in charge role, with appropriate support from our experienced staff nurses, sisters and matron.&lt;/p&gt;\n&lt;p&gt;We are proud of our trust&#39;s outstanding rating from the CQC and are committed to maintaining the high standards of care that our patients expect. There are plenty of opportunities to progress at this trust, such as senior staff nurse roles, clinical nurse specialists and nurse practitioners.&lt;/p&gt;\n&lt;p&gt;This is an inpatient ward and our staff are expected to work a range of shifts across the whole week, including nights, long days and weekends.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why join us at UHBW? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Because we are passionate about supporting our staff and clinical teams, so that we can achieve our common goal of delivering outstanding patient care.&lt;/li&gt;\n&lt;li&gt;Because we can offer job security in these uncertain times within an organisation that is dedicated to the well being of its staff. We understand that we work to live (not live to work) and support flexible and part-time working patterns.&lt;/li&gt;\n&lt;li&gt;Because we believe in supporting the development of our staff, with for example Practice Education Facilitators, Band 6 development programs and internal rotation.&lt;/li&gt;\n&lt;li&gt;Because we are one of a handful of health trusts to have achieved a CQC rating of “Outstanding” for a second time second time in succession.&lt;/li&gt;\n&lt;li&gt;Because we are located in the heart of the vibrant City of Bristol, and the gateway to the glorious South West.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rebecca May - Ward Sister&lt;/p&gt;\n&lt;p&gt;STAUBand7s2@UHBW.nhs.uk&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Elin Jones&lt;/p&gt;\n&lt;p&gt;Retention &amp; Recruitment Lead&lt;/p&gt;\n&lt;p&gt;Tel: &lt;em&gt; 07920296176&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;e.mail : Elin.Jones2@uhbw.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Adult Staff Nurse - STAU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252689", "validThrough": "2020-11-16T23:59:59+0000"}