{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-04T11:00:30+0000", "description": "&lt;h1&gt;Staff Nurse- Band 5&lt;/h1&gt;\n&lt;p&gt;We have an exciting position available in this interesting, fast paced, but friendly outpatient department. We are a strong cohesive unit. We work independently with our clinical colleagues but also have a strong support network within our core team of nurses, HCA’s and Plaster technicians. We are part of a multidisciplinary team working here, in partnership with the Orthopaedic Surgeons, Advanced Orthopaedic Practitioners, the Trauma Team and Extended Scope Practitioners.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What we can offer you:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A fully supported induction programme, tailored to your needs, complete with a mentor.&lt;/li&gt;\n&lt;li&gt;Career progression within T and O covering nurse led dressing clinics, foot and ankle injection clinics, virtual fracture clinics and, given time, the opportunity to complete the Orthopaedic Practitioner course, which is a recognised qualification from the British Orthopaedic Association.&lt;/li&gt;\n&lt;li&gt;The opportunity to work with and support student nurses, our Trainee Nursing Associate who is working towards a Band 4, work experience students and the Band 2/3 apprenticeship training.&lt;/li&gt;\n&lt;li&gt;We can offer you the opportunity to gain knowledge and skills working in the Trauma Assessment Unit alongside the Orthopaedic On call team.&lt;/li&gt;\n&lt;li&gt;IM(RE)R training leading to independently booking xrays for your clinic patients.&lt;/li&gt;\n&lt;li&gt;You will gain knowledge and skills relating to Orthopaedic conditions and fractures.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our department is open from 08.00hrs to 18:00hrs each weekday. We meet and treat a complete age range and diversity of patients with fractures and orthopaedic conditions. Excellent communication skills are essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you think you would like to be part of our team and are keen to take on a new challenge, then we would love to meet you. Informal visits welcomed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please contact the dept on 01225 826380 and ask for Sisters Cathy Breeze or Andrea Morgan or Matron Laura Andrews, if you would like to arrange a visit, or for further information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Staff Nurse - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255487", "validThrough": "2020-11-18T23:59:59+0000"}