{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-30T09:16:03+0000", "description": "&lt;p&gt;The Estates and Facilities Team at NHS England and NHS Improvement has grown exponentially over the last two years. Our key bases are Leeds, London, Birmingham, with various other locations regionally.&lt;/p&gt;\n&lt;p&gt;This is an exciting time for estates and facilities with substantial capital investment into the estates as part of the NHS Long Term Plan and manifesto commitments, the focus on the estates has never been higher.&lt;/p&gt;\n&lt;p&gt;As part of our recruitment drive we have number of vacancies available within this exciting, diverse and dynamic team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Estates and Facilities Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The team is structured to drive through all aspects of estates and facilities function from national, regional and local level with a diverse range of strategic and operational estates and facilities management skills.&lt;/p&gt;\n&lt;p&gt;National – There are number key areas: Policy, Operations, Sustainability, Capital &amp; Commercial, Workforce, Strategy and Delivery.&lt;/p&gt;\n&lt;p&gt;Regional &amp; Local – We have teams based in each of the 7 regions led by Regional Delivery Directors who work with their local healthcare systems.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Key Objectives of the Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The aim is to ensure the provision of a clean, safe and suitable estate and patient environment within the healthcare system. In relation to estate matters, the team’s key responsibility is to design the system strategy, set policy, ensure system wide delivery and accountability to Parliament. We support NHS organisations to deliver efficient and effective estates and facilities management and strategic functions and services.&lt;/p&gt;\n&lt;p&gt;The team has significant areas of accountability with a number of institutional relationships, some rooted in statutory and other requirements of the healthcare system; in particular:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;The NHS Constitution England (2015) Patient and Public right ‘…You have the right to be cared for in a clean, safe, secure and suitable environment’.&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Statutory healthcare regulations requirement that, ‘…service users are protected against the risks associated with unsafe and unsuitable premises’.&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Productivity and Efficiency in relation to the Lord Carter Estates Facilities Management Recommendations for the NHS&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Delivery of Health Infrastructure Plan (HIP)&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;STP wave 1 to 4 capital allocations&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Delivery of £1.5bn accelerated capital delivery on eradication of mental health dorms, A&amp;E capacity, critical infrastructure risk and acceleration of HIP. &lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Positions&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;The Estates team are looking for number of positions ranging from Fire Officer, Cost Advisors, Engineering, Architects through to Project Manager through to Strategic Estates Leads.&lt;/p&gt;\n&lt;p&gt;We are looking for a passionate, dedicated and pragmatic individual to join our team to head up the Estates project/programme management office.&lt;/p&gt;\n&lt;p&gt;You will have a crucial role in our team coordinating activities and communicating with a variety of stakeholders to help progress our objectives. You will be responsible for managing and maintaining an overview of the national programme of works, including progress on large scale project delivery, ensuring we remain on track to deliver on our objectives. You will also have responsibilities for managing centrally lead projects and programmes.&lt;/p&gt;\n&lt;p&gt;We are resolute about ensuring equality of opportunity and would encourage anyone with a genuine interest in leading our PMO function to apply. We are also extremely passionate about personal and professional growth and will actively do what we can to help you to achieve your own goals for personal and professional development and success.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in the successful delivery of multiple complex projects and programmes&lt;/li&gt;\n&lt;li&gt;Experience of designing and implementing effective governance structures&lt;/li&gt;\n&lt;li&gt;Highly developed communication skills with the capability to analyse, review and make sense of highly complex, sensitive or contentious information across a diverse range of subjects relevant to post portfolio&lt;/li&gt;\n&lt;li&gt;Ability to identify risks, anticipate issues and create solutions and to resolve problems in relation to project or service delivery&lt;/li&gt;\n&lt;li&gt;Values diversity and difference; operates with integrity and openness&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Managing the team’s support function, including developing and managing the team’s annual business plan, progress and dashboards reporting and risk and issue management.&lt;/li&gt;\n&lt;li&gt;Develop and implement systems to ensure information is properly managed and best practice is shared across the team, Directorate and the wider NHS organisations as appropriate.&lt;/li&gt;\n&lt;li&gt;Responsibility for developing and implementing programme and project governance including reporting.&lt;/li&gt;\n&lt;li&gt;Responsible for managing the project/programme multi layered timescales, cross dependencies and risks to underlying project timescales, cost plan and benefit plans&lt;/li&gt;\n&lt;li&gt;Lead on PMO support for national incidents for the Estates.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Vajid Mahmood&lt;/p&gt;\n&lt;p&gt;Job title: PPM Strategy and Implementation Lead&lt;/p&gt;\n&lt;p&gt;Email address: vajid.mahmood@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0773 430 1561&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Quarry House, Leeds", "postalCode": "LS2 7UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7982", "longitude": "-1.53126"}}, "title": "Estates PMO Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249448", "validThrough": "2020-11-17T23:59:59+0000"}