{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-04T14:00:53+0000", "description": "&lt;p&gt;&lt;span&gt;Following an internal promotion of the current post-holder, an opportunity for secondment has arisen in the Financial Accountability &amp; Transformation Team within the national Strategic Finance directorate. Our team works in partnership with teams across NHS England and Improvement to support programmes and policy areas with strategic finance advice and input. Your work will include working on strategic financial parts of the community pharmacy contract at a national level, but will likely include different programme areas across the 12 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Financial Accountability and Transformation team works with clinicians and managers who want to improve the way the NHS works to understand the cost of new proposals, to support negotiations with the Department of Health and Social Care and HM Treasury for any additional funds required, and to ensure that the financial incentives in the system are aligned to delivering better care for patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;With the results of the Treasury’s Spending Review due in the next few months, and the developing clinical landscape because of COVID, this is an exciting time for community pharmacy and to be working in the strategic finance directorate. The successful candidate will help to support negotiation and implementation of the community pharmacy contract for next year, influence the Department of Health and Social Care’s work on prescription charges, and continue work to improve the efficiency of community pharmacies. In addition to this, the successful candidate will support work to reduce the cost of fraud and error to the NHS through the Pharmacy Exemption Checking Scheme.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for someone with NHS finance experience. Preferably this will include knowledge of the community pharmacy contractual framework – though this is not essential. You should be able to think strategically and use your financial skills to analyse financial challenges and opportunities to develop responses to these.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You should be comfortable working in a fast-paced and changing environment in a role where you will work closely with a variety of senior stakeholders across our and partner organisations. You must be able to communicate financial and strategic ideas to senior finance colleagues and to non-specialists, both written and orally. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are flexible over the base-location in England, we will provide IT equipment but you should be able to work from your home while Government advice on home-working remains as it is currently.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are keen to talk to candidates before application if you have questions or want to understand more about the role. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDuncan WatsonJob titleHead of Strategic Finance, Financial Accountability and TransformationEmail addressduncanwatson@nhs.netTelephone number07730 381 555Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ben Fletcher at &lt;/span&gt;ben.fletcher3@nhs.net&lt;span&gt; from 24 to 31 October.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Senior Finance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256119", "validThrough": "2020-11-15T23:59:59+0000"}