{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "159455", "minValue": "87624", "unitText": "YEAR", "value": "£87,624 - £159,455 per annum"}}, "datePosted": "2020-10-06T11:46:17+0100", "description": "&lt;p&gt;Consultants in Psychiatry – Various posts&lt;br /&gt;Jersey General Hospital St Helier, Jersey&lt;br /&gt;£87,624 - £159,455 (dependent on experience)&lt;br /&gt;&lt;br /&gt;Come to a place that is better for you, as well as your patients. Jersey’s Health and Community Services Department runs the Island’s integrated, taxation-funded health and care system that is largely free at the point of delivery.&lt;br /&gt;&lt;br /&gt;Jersey has started a comprehensive programme to transform health social care. This change is supported with significant investment in Community and acute hospital services. Funding has been secured to build a new 300 bed General Hospital that is in the early stages of planning. A strategic programme for a comprehensive Mental Health Services campus is well underway.&lt;br /&gt;&lt;br /&gt;We currently have 4 posts available;&lt;br /&gt;Consultant in Older Age Psychiatry – 2 posts&lt;br /&gt;Consultant in General Adult Psychiatry&lt;br /&gt;Consultant with a special interest in Neurodiversity Psychiatry&lt;br /&gt;&lt;br /&gt;All the components of a health and social care system are here to work with, and in an environment where there is a greater and closer interaction with political processes than in the UK, this is an excellent opportunity to be part of developing a genuinely integrated system.&lt;br /&gt;&lt;br /&gt;With great weather, beautiful beaches and surroundings, you will enjoy a better quality of life in our island community. In addition, with an easy commute, more time for yourself too.&lt;br /&gt;&lt;br /&gt;If you would like to discuss the post informally please contact Dr Miguel Garcia-Alcaraz, Head of Mental Health (01534) MG.Alcaraz@health.gov.je&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health and Community Services Jersey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135055"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Helier, Jersey", "postalCode": "JE1 3QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "49.1833", "longitude": "-2.1"}}, "title": "Consultants in Psychiatry – Various posts", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214512", "validThrough": "2020-11-08T23:59:59+0000"}