{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-26T15:30:21+0000", "description": "&lt;p&gt;Trainee High Intensity Therapist Band 6&lt;/p&gt;\n&lt;p&gt;We currently have the opportunity to recruit 1 x Trainee High Intensity Therapist to join the Doncaster Improving Access to Psychological Therapies (IAPT) &lt;strong&gt;CORE service&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;The successful candidate will attend the University of Sheffield March 2021 intake. Subject to passing the course and an end of year review the Trainee will progress onto a permanent Band 7 Qualified High Intensity Therapist position.&lt;/p&gt;\n&lt;p&gt;Doncaster IAPT is a well-established and high performing IAPT, with the service originally being one of the national IAPT demonstration sites in 2006.The service provides a wide range of evidence-based psychological interventions options, including: low intensity CBT, CBT, EMDR, brief counselling, CfD, IPT and couples therapy for Depression.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Please note this advertised position sits within the main Doncaster IAPT core service. The service is also advertising separately for the Doncaster IAPT LTC service.&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants must embrace the core values of the organisation by demonstrating that they are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Passionate&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Reliable&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Caring&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Safe&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Empowering and supportive&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Open and transparent&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Progressive&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The interview dates will be confirmed following shortlisting. Please note recruitment for this post is undertaken within a two stage process with both an internal service interview before a second interview with the University.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidate requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Candidates must have a first degree in an allied discipline (usually Psychology) in order to be considered.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Candidates from a PWP background must have been qualified as a PWP for more than &lt;strong&gt;two years by the course start date&lt;/strong&gt; in order to meet national expectations.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Candidates are unable to progress through the recruitment process if they are already registered on a Health Education England (HEE) funded programme.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Candidates must either meet one of the following BABCP core mental health profession requirements OR complete a KSA (see below):Arts Therapists – HCPC Registered&lt;/li&gt;\n&lt;li&gt;Counselling – Accredited with the BACP, IACP, COSCA, or FDAP (NCAC), or Registered Member CPC&lt;/li&gt;\n&lt;li&gt;Medicine – Psychiatrist or General Practitioner, MBChB or MBBS, and usually PG training with membership of MRCGP, MRCP or MRCPsych&lt;/li&gt;\n&lt;li&gt;Occupational Therapy – BSc (Hons) Occupational Therapy, MSc Occupational Therapy, or Dip C.O.T and HCPC RegisteredProbation Services – DipPS&lt;/li&gt;\n&lt;li&gt;Psychology – 1st degree plus a post-graduate qualification (MSc or Doctorate) in an applied area such as clinical, counselling, educational, forensic, health psychology. HCPC Registered as Practitioner Psychologist (HCPC registration alone insufficient)&lt;/li&gt;\n&lt;li&gt;Psychotherapy / Psychotherapeutic Counselling with UKCP Registration&lt;/li&gt;\n&lt;li&gt;Registered Nurse – Mental Health (RMN), or Learning Disability (General nursing and Enrolled nursing is insufficient)&lt;/li&gt;\n&lt;li&gt;Social Work – CQSW, DipSW or BA/BSc Hons Social Work&lt;/li&gt;\n&lt;li&gt;Teacher of Special Education / Needs – CertEd, B.Ed, or BA/BSc with PGCE, plus additional specialist training in Special Education, with additional counselling / psychotherapy training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All candidates must provide the following information at interview:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Evidence of a BABCP recognised core profession OR a electronic completed KSA portfolio&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Candidates who do not meet recognised core mental health profession requirements must bring to interview a fully completed Knowledge, Skills and Attitudes (KSA) portfolio. Only candidates whose completed portfolios are assessed as being of a suitable standard at interview will be accepted on the course.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information contact Tim Godley (Team Manager of Doncaster IAPT Core) on timothy.godley@nhs.net or Kyla Bowman (Clinical Lead) kyla.bowman1@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/p&gt;\n&lt;p&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN4 6ED"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.506", "longitude": "-1.07477"}}, "title": "Trainee High Intensity Therapist (Band 6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243135", "validThrough": "2020-11-09T23:59:59+0000"}