{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-11-06T10:46:26+0000", "description": "&lt;p&gt;CARMS Therapist - 11.25 hours per week&lt;/p&gt;\n&lt;p&gt;The National Institute for Health Research is now established as a part of the Government&#39;s strategy, &#39;&lt;strong&gt;Best Research for Best Health&lt;/strong&gt;&#39;. It is committed to establishing the NHS as an internationally recognised centre of research excellence through supporting outstanding individuals, working in world-class facilities, conducting leading-edge research focused on the needs of patients and the public. The EME Programme funds ambitious studies evaluating interventions that have the potential to make a step-change in the promotion of health, treatment of disease and improvement of rehabilitation or long-term care. Within these studies, EME supports research to improve the understanding of the mechanisms of both diseases and treatments. The CARMS trial (Cognitive Approaches to Combatting Suicide) is funded by the MRC/NIHR EME programme and is a joint endeavour across 5 NHS Trusts together with the School of Health Sciences, University of Manchester, and the SPECTRUM Centre, University of Lancaster.&lt;/p&gt;\n&lt;p&gt;This trial will assess the effectiveness of CARMS ,whether the psychological mechanisms on which CARMS is based are correct and how well CARMS works in practice in the NHS. The therapy will comprise of up to 24 weekly sessions of CBSP in the community. The study will use both quantitative and qualitative approaches as part of a randomised controlled trial (RCT).&lt;/p&gt;\n&lt;p&gt;A cost effectiveness analysis will be conducted to assess the health economic impact of CBSP. A Service User Researcher and the Trial Manager/Project Co-ordinator will lead the establishment and involvement of a Service User Reference Group of service user consultants with appropriate ‘lived experiences’ who will be an integral component of the research processes.&lt;/p&gt;\n&lt;p&gt;The lead investigators the CARMS study are Professor Gillian Haddock and Dr Trish Gooding. The post holder will become an active member of the CARMS research team that includes Dr Richard Drake, Yvonne Awenat, Dr Richard Emsley, Dr Daniel Pratt, Dr Sarah Peters, Dr Fiona Lobban, &amp; Prof Nav Kapur, and in collaboration with the Samaritans and Mind.&lt;/p&gt;\n&lt;p&gt;The main purpose of this post is to provide CBSP therapy to service users in the community, A course of up to 24 sessions of CBSP will be delivered weekly. The therapy is based on a detailed manual, and you will receive training prior to treating patients in the trial and close supervision during the trial. The post holder will be expected to treat patients to an exceptionally high standard and to contribute to intervention development work necessary to adapt the therapy manual&lt;/p&gt;\n&lt;p&gt;Whilst it should be possible to treat most of the patients within regular hours, it may on occasion be necessary to see patients at other times. The post holder will need to be able to travel to different sites within the Trust to attend meetings, seminars, and supervision.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected: -&lt;/p&gt;\n&lt;p&gt;To liaise across all sectors of care involved with participants on their caseload&lt;/p&gt;\n&lt;p&gt;To provide highly specialist, psychological assessment, therapy and supervision in the context of the clinical trial&lt;/p&gt;\n&lt;p&gt;To offer advice and consultation on patient’s psychological care to non-psychologist colleagues, as well as to other non-professional carers and workers of other agencies where appropriate&lt;/p&gt;\n&lt;p&gt;To work autonomously within professional guidelines and the overall framework of the team’s policies and procedures.&lt;/p&gt;\n&lt;p&gt;To utilise research skills for audit, policy and research within the area served by the teams / service.&lt;/p&gt;\n&lt;p&gt;To contribute to the provision of research team services and fulfilment of research team priorities and objectives&lt;/p&gt;\n&lt;p&gt;To contribute to the Trust’s social inclusion agenda.&lt;/p&gt;\n&lt;p&gt;This is a unique opportunity to develop specialised treatment skills and to participate in a National Institute of Health Research&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameProf. Gill HaddockJob titleCo- Principal InvestigatorEmail addressgililan.haddock@manchester.ac.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Rawnsley Building, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "CARMS Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259278", "validThrough": "2020-11-13T23:59:59+0000"}