{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "40000", "unitText": "YEAR", "value": "£40,000 depending on experience"}}, "datePosted": "2020-10-30T09:20:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Recruitment opportunity to join the Wellbeing team in a role that will focus on learning, developing and growing our workforce. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our aim:&lt;/strong&gt; that our workforce is recognised, valued and feel it whilst they learn, develop and grow.&lt;/p&gt;\n&lt;p&gt;We have a wonderful opportunity to recruit a Head of Growth and Development; a role with a huge emphasis on developing the talent of the current amazing team and with a passion to grow the workforce of the future.&lt;/p&gt;\n&lt;p&gt;The post-holder will work autonomously whilst being embedded at the core of the wellbeing team, focussing on recruitment and enhancing the growth and development for FCMS &amp; PDS. This role will form the creation of people’s journeys into this fabulous company. The successful applicant will radiate passion and drive to create a strong, flexible and agile team, searching for ways to develop colleagues, unpick hidden skillsets and thrive off seeing the team grow. You will be an ambassador for our organisations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;People are at the core of all we do and this role demands a colleague that is passionate and cares about those we serve.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will bring: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will help to grow the company - part of the focus of this role is to manage our recruitment process&lt;/li&gt;\n&lt;li&gt;You will be digitally savvy – adapting this role to better use technology, whilst also adding flair to your training programmes and creating a desire for people to want to learn.&lt;/li&gt;\n&lt;li&gt;You will have the ability to work with energy &amp; be responsive to organisational, service and individual’s needs. We are nimble so aim to turn recruitment opportunities around fast.&lt;/li&gt;\n&lt;li&gt;It would be great if you have experience of identifying, commissioning and / or delivering training courses. You will be expected to be responsible for reviewing, designing and delivering training to new and existing employees.&lt;/li&gt;\n&lt;li&gt;A training or equivalent teaching related qualification is desirable.&lt;/li&gt;\n&lt;li&gt;You will want to ensure that the team are recruited well, trained, developed, nurtured in their growth so that we encourage our talent for the future. We want to be here for a long time.&lt;/li&gt;\n&lt;li&gt;You will want to provide an outstanding customer service. The colleague and the growth of the team will be at the heart of all you achieve.&lt;/li&gt;\n&lt;li&gt;You will seek to support retention, talent management and succession planning for the future&lt;/li&gt;\n&lt;li&gt;You will have ideas that you want to try and explore so that people benefit&lt;/li&gt;\n&lt;li&gt;You will want to make a difference.&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Social Enterprises", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130655"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool", "postalCode": "FY4 4EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7972", "longitude": "-3.02336"}}, "title": "Head of Growth and Development", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249464", "validThrough": "2020-11-13T23:59:59+0000"}