{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-23T10:15:17+0100", "description": "&lt;p&gt;CDDFT are investing an additional £3m into Therapy services across the University Hospital of North Durham (UHND), Darlington Memorial Hospital (DMH) and Bishop Auckland Hospital (BAGH). There has never been a better time to come and join us in developing high quality, evidence based and compassionate therapy services. We are recruiting posts within Physiotherapy, Occupational Therapy, Speech and language Therapy, Podiatry, Dietetics and nutrition, Clinical Psychology and Psychological Practitioners. Look out for all our adverts on NHS jobs.&lt;/p&gt;\n&lt;p&gt;As part of this MDT you will have the opportunity to influence the development of:&lt;/p&gt;\n&lt;p&gt;• integrated pathways across the health and care system&lt;br /&gt;• innovative new roles&lt;br /&gt;• training to upskill our workforce&lt;/p&gt;\n&lt;p&gt;As Therapy services working together we will be able to ensure the care offered is individualised, evidenced based and builds a resilient workforce for the future.&lt;/p&gt;\n&lt;p&gt;We will also be investing further in our community services to further develop partnership working across the Health and Care System.&lt;/p&gt;\n&lt;p&gt;We are recruiting 4 full time band 6 members of staff. This is an exciting opportunity to join our established Adult Physiotherapy inpatients team at Bishop Auckland Hospital. Bishop Auckland has been chosen as a centre for Frailty with the formation of 2 new wards. There may be an opportunity to rotate onto the stroke rehabilitation unit dependent on recruitment. &lt;br /&gt;The successful applicant will work within this strong team and provide therapy within a 7 day service framework to clients within a community rehabilitation hospital setting as required by the team leaders.&lt;/p&gt;\n&lt;p&gt;The clinical work consists of covering across the two elderly care/frailty wards including a caseload of frail elderly patients with cardio-respiratory, neurological, mental health and orthopaedic issues. The role requires a dynamic physiotherapist who is able to work with the elderly care multidisciplinary team to provide exemplary care to the patient. The successful applicant will utilise their outstanding organisation and communication skills in order to support with the rehabilitation and discharge planning from the rehab setting into the community whilst achieving outstanding physiotherapy outcomes.&lt;/p&gt;\n&lt;p&gt;You will work alongside Physiotherapy staff and the wider MDT and your development will be supported by senior staff working within these areas. The post holder will be responsible for supervising therapy assistants and band 5 junior physiotherapists. The trust has robust induction training and essential training programme. &lt;/p&gt;\n&lt;p&gt;Bishop Auckland hospital is a centre for excellence for orthopaedics and is the current centre for the stroke rehabilitation inpatient service for CDDFT.&lt;/p&gt;\n&lt;p&gt;The team are very committed to providing an in-service training programme which the post holder will encouraged to take an active part in developing, leading and benefitting from sessions towards maintaining CPD. The team are expected to cross cover colleagues when required across sites.&lt;/p&gt;\n&lt;p&gt;There may be an opportunity in the future to rotate onto other areas within the rehabilitation wards at BAH which includes stroke rehab and orthopaedics.&lt;/p&gt;\n&lt;p&gt;For more information please contact Chris Irving In-patient lead on 07980 729647 chrisirving@nhs.net or Claire Worthington claire.worthington@nhs.net 0191 3332333 bleep 42290&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bishop Auckland Hospital, Cockton Hill Road, Bishop Auckland", "postalCode": "DL14 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6558", "longitude": "-1.68032"}}, "title": "Senior Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239984", "validThrough": "2020-11-06T23:59:59+0000"}