{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa inc"}}, "datePosted": "2020-11-02T11:01:31+0000", "description": "&lt;p&gt;We are seeking dynamic and skilled psychiatric liaison nurses to join our multidisciplinary teams at Northwick Park Hospital. Prospective applicants are encouraged to contact us to find out more about the post or arrange a visit.&lt;/p&gt;\n&lt;p&gt;We are committed to actively supporting our nurses to train and develop their skills. These posts represent an excellent opportunity to work in a rapidly developing mental health team, to develop clinical and interpersonal skills and to make a meaningful contribution to clinical care.&lt;/p&gt;\n&lt;p&gt;The liaison psychiatry depts at Northwick Park provide psychiatry input to the inpatient wards, emergency department for all patients from age 18 upwards, including older adults. We work closely with both inpatient medical/surgical specialties and mental health services. The cases we encounter reflect the whole spectrum of psychiatric conditions, from common and severe mental disorders, people with drug and alcohol use disorders, to somatoform disorders, organic behavioural disorders and people who have harmed themselves.&lt;/p&gt;\n&lt;p&gt;You will be a key player of the multidisciplinary team, offering specialist psychiatric advice in the acute hospital setting. You will be well supported by an established team which includes three consultant liaison psychiatrists , a clinical team manager, two team leaders, psychiatric liaison nurses, an alcohol specialist nurse, a social worker, providing a 24/7 on-site psychiatry service in London Northwest University Healthcare NHS Trust. The posts are available to start as soon as possible.&lt;/p&gt;\n&lt;p&gt;You must have excellent clinical skills, be able to demonstrate an ability to complete comprehensive mental state examinations, thoroughly assess risk, formulate safe and effective risk management plans and document this clearly and concisely. Experience of working with older adults patients is essential. You will be able work autonomously with awareness of when to seek advice, in the context of a multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;You must have a warm and friendly disposition and have very good communication and interpersonal skills. You must also be confident and motivated, flexible and be able to show initiative in an environment which can be demanding and stressful.&lt;/p&gt;\n&lt;p&gt;The liaison psychiatry team at Northwick Park operates a 24 hour service and successful applicants will be expected to work on rotating shift patterns (day and nights shifts).&lt;/p&gt;\n&lt;p&gt;Interview date:TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Fungayi Useya&lt;/p&gt;\n&lt;p&gt;Job title Team Manager&lt;/p&gt;\n&lt;p&gt;Email address fungay.useya@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07703886936&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Liaison Psychiatry Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251690", "validThrough": "2020-11-16T23:59:59+0000"}