{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum (inc HCAS)"}}, "datePosted": "2020-11-04T13:46:26+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for Full time permanent specialist optometrist post to work at Moorfields City Road and St George&#39;s in a variety of core and subspeciality clinics throughout the week (Contact Lenses, Medical Retina Injection clinics, Glaucoma, Paediatrics)&lt;/p&gt;\n&lt;p&gt;Moorfields Eye Hospital is a post-graduate teaching Hospital of international acclaim, dedicated to excellence in patient care, training and research. Our main site is at City Road, London but we have a large, and growing, number of interdisciplinary satellite clinics at which optometric services are provided.&lt;/p&gt;\n&lt;p&gt;The Optometry Department has expanded rapidly with increasing extended role activities across Moorfields’ sites. The Optometry Department has over 100 optometrists and provides clinical services for refraction, low vision assessment, medical contact lenses as well as extended role. We play a significant role in the training of ophthalmic professionals and in collaboration with UCL our optometry education has recently expanded to provide College of Optometrists Higher Qualifications. Our research priorities reflect the developing role of optometrists and our close links with the Institute of Ophthalmology. We are supported by our spectacle and contact lens laboratories.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PROBATIONARY PERIOD&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period of 6 months.&lt;/p&gt;\n&lt;p&gt;During the probationary period, your suitability for continued employment will be assessed and provided a satisfactory standard is achieved and maintained, your employment will be confirmed. The probationary period may be extended&lt;/p&gt;\n&lt;p&gt;Or your employment terminated either during or at the end of probation, in line with the trust Probationary Policy. For the duration of the probation period, the notice period will be in line with contractual obligations on either side.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;PA to the Head of Optometry (moorfields.optometrypa@nhs.net) or call 020 7566 2023 or Dr Vijay Anand, Deputy Head of Optometry on 020 7566 2023 or v.anand@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Moorfields Eye Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121181"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moorfields Eye Hospital NHS Foundation Trust, London", "postalCode": "EC1V 2PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5272", "longitude": "-.089862"}}, "title": "Specialist Optometrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256068", "validThrough": "2020-11-18T23:59:59+0000"}