{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-03T10:45:17+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a registered Mental Health Nurse to join the Andover Older Persons Mental Health Community Team. The team is a highly supportive and innovative team that aspires to provide a responsive, safe, effective, caring service that is well led. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Older Peoples Mental Health Services is looking for a motivated registered mental health nurse to provide skilled assessment &amp; treatment interventions to older people with mental health needs within the Andover area. The role involves supporting the team and the memory service to provide in-depth memory assessments and to support patients with functional and generic mental health needs in their homes and local care home.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To be a successful member of our team you will need to be a registered mental health nurse with relevant experience, have a genuine interest in working with older people and be able to demonstrate a real commitment to providing high quality and compassionate care to patients and their families.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be expected to work with a high degree of autonomy and professional accountability and have effective time management skills. You will play an important role in the team as we aspire to build and develop upon the OPMH service, with excellent patient care our focus. The team is based at Andover War Memorial Hospital and there is onsite parking available.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Car driver and use of car is essential for this position.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Further enquiries and informal visits are welcome please contact Zena Colbourne, Community Team Lead on 01264 835263 or zena.colbourne@southernhealth.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Andover War Memorial Hospital", "postalCode": "SP10 3LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2157", "longitude": "-1.49468"}}, "title": "Community Mental Health Memory Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253510", "validThrough": "2020-12-08T23:59:59+0000"}