{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a. inc."}}, "datePosted": "2020-10-27T14:46:14+0000", "description": "&lt;p&gt;This is an exciting opportunity to join a large and dynamic IAPT service in a stimulating and unique inner London setting. We are a well-establish team with particular expertise in health psychology for long-term physical health conditions.&lt;/p&gt;\n&lt;p&gt;Due to the expansion of the service we currently have a number of vacancies for permanent Band 7 High Intensity CBT Therapists and are inviting applications from accredited CBT Therapists as well as Counselling or Clinical Psychologists with demonstrable CBT competencies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are part of Homerton University Hospital and have strong links with local GPs, secondary care services and voluntary sector providers as part of the City and Hackney Psychological Therapies Alliance. Hackney is a particularly diverse borough, even within London, and this is reflected in the range of people we see and the problems that we treat.&lt;/p&gt;\n&lt;p&gt;The post holders will be responsible for providing specialist assessment, formulation and therapy using the CBT model. There may be opportunities to utilise research skills for audit, research and service development.&lt;/p&gt;\n&lt;p&gt;You will be joining a large team of clinical and Counselling Psychologists, CBT Therapists and Psychological Wellbeing Practitioners with access to specialist cognitive-behavioural supervision. Continuing professional development, including service related research is actively encouraged.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The posts are located at St Leonard’s Hospital, Nuttall Street, London N1 5LZ and the post holders would be expected to travel to other acute and primary care sites in Hackney.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note &lt;strong&gt;we will not be accepting previous applicants.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is offered as a full time position 37.5 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact, please contact&lt;/p&gt;\n&lt;p&gt;Mark O&#39;Connor Deputy Clinical Lead&lt;/p&gt;\n&lt;p&gt;Email mark.o&#39;connor7@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "CBT Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245018", "validThrough": "2020-11-09T23:59:59+0000"}