{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "37241", "unitText": "YEAR", "value": "£37,241 - £51,069"}}, "datePosted": "2020-10-14T17:00:46+0100", "description": "&lt;p&gt;CROYDON HEALTH SERVICES NHS TRUST&lt;br /&gt;TRUST DOCTOR (ST3+ LEVEL) IN CARDIOLOGY&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Applications are invited for in Cardiology at Croydon Health Services NHS Trust.&lt;br /&gt;&lt;br /&gt;This post offers an excellent opportunity to develop clinical skills in all aspects of cardiology, working as part of a multidisciplinary team in a busy department. Trust Grade doctors in the cardiology department work alongside the cardiology specialist registrar, under the supervision of the consultant cardiologists.&lt;br /&gt;&lt;br /&gt;The post is not officially recognised as a training post, it offers fully comprehensive training in imaging, and in other aspects of Adult Cardiology. &lt;br /&gt;&lt;br /&gt;. &lt;br /&gt;Whilst this post offers the opportunity for development within a chosen subspecialty area there does need to be a commitment to the general cardiology work of the department including diagnostic test reporting, rotation into cardiology ward/ CCU, and OPD clinics.&lt;br /&gt;&lt;br /&gt;The successful applicants will need to have obtained the MRCP or equivalent and be fully registered with the General Medical Council.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Croydon University Hospital is a busy General Hospital, serving the population of Croydon. Most major medical and surgical specialties are represented. The Cardiology department provides on-site cardiac catheterisation, elective and emergency PCI, and we have established a growing simple and complex cardiac devices service providing implantation (PPM, ICD, and CRT). We have a busy non-invasive service providing transthoracic echocardiography, TOE, bubble studies contrast echo and stress echocardiography. We work in partnership with Kings College Hospital, particularly for primary PCI, electrophysiology services and cardiothoracic surgical services.&lt;br /&gt;&lt;br /&gt;Croydon is situated to the south of London and has easy access to both central London and the south coast. It also offers a huge range of social, leisure and shopping options, with transport links to both Gatwick and Heathrow Airport. There is an active postgraduate center and specialty-based meeting programs, attendance at which is encouraged.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Kostas Zacharias, Consultant Cardiologist (via stitchboard) 0208 401 3000 or Victora Oji , Operations Manager on victoria.oji@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120967.PNG", "name": "Croydon Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120967"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon University Hospital, Croydon", "postalCode": "CR7 7YE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3891", "longitude": "-.108758"}}, "title": "Specialty Registrar in Cardiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227188", "validThrough": "2020-11-08T23:59:59+0000"}