{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a. pro rata"}}, "datePosted": "2020-10-22T09:10:22+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;An exciting opportunity has arisen for a part-time Participation worker to work within Southampton Specialist Child and Adolescent Mental Health Service. The post holder will be part of the multi-disciplinary team and will implement the participation strategy for the service. The successful candidate will work with children and young people to engage them in a variety of participation activities and support them in having a genuine influence both within the service and externally.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be an experienced health or social care professional with a background of working with children and young people. Candidates need to have a qualified professional background (e.g. nursing, social work, or allied health professional) and have current professional registration with their appropriate regulatory body. Experience of designing, undertaking and coordinating participation and engagement programmes will also be essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The CAMHS team is a strong and supportive team and has excellent structures to offer regular supervision. This is a great opportunity to join our team in Solent NHS Trust Children &amp; Families Service line to support in the delivery of high-quality children’s mental health services. We are looking for exceptional individuals with the right attitude, skills and knowledge who share our passion to deliver the best quality care experience for children and their families.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you wish to have an informal conversation regarding the post please contact Satty Basra, Team Leader in CAMHS on 0300 123 6661.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Participation Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237653", "validThrough": "2020-11-18T23:59:59+0000"}