{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "38000", "unitText": "YEAR", "value": "up to £38,000 per annum DOE"}}, "datePosted": "2020-10-26T11:30:14+0000", "description": "&lt;p&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Are you collaborative, caring and compassionate?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;HM Prison The Mount is a Category C men&#39;s prison, located on the outskirts of Bovingdon village in Hertfordshire, England&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Practice Plus Group were recently awarded the healthcare contract at HMP The Mount and will begin delivering services on 1st October 2020; we are the Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care at HMP The Mount, we’re looking for a Senior Primary Care Nurse to support us and the existing team in this new venture.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;In return for your hard work you will…&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Receive an annual salary of up to £38,000 depending on experience, pro rota. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt;Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt;Onsite benefits include access to an onsite gym, free parking and subsidised café/restaurant.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What will you be doing?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Senior Nurse you will work as part of an integrated healthcare team, utilising your clinical expertise, decision making and problem solving skills to provide skilled and evidence based nursing care for patients in the prison. You will work within your scope of practice, in accordance with Practice Plus Group and prison service policies and procedures in line with the NMC Code of professional conduct, performance and ethics for nurses and midwives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You&#39;ll be responsible for leading and developing a team providing clinical supervision to all staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You&#39;ll work within your scope of practice, in accordance with Practice Plus Group and prison service policies and procedures in line with the NMC Code of professional conduct, performance and ethics for nurses and midwives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Next steps&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The recruiter will submit your CV to the hiring manager and in turn we will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information, please contact us on the details provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;More information&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full time role working 37.5 hours per week. The salary for this role is up to £38,000 - dependent on experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hemel Hempstead", "postalCode": "HP3 0NZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7248", "longitude": "-.541331"}}, "title": "Senior Primary Care Nurse - HMP The Mount", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242204", "validThrough": "2020-11-15T23:59:59+0000"}