{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-06T15:01:30+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the Berkshire West Respiratory Team in leading the care for those suffering with Chronic Respiratory Disease.&lt;/p&gt;\n&lt;p&gt;This is a Band 6 Post in the community setting with clinical caseload and responsibilities. This post will be supported by other team members and the Clinical Lead. There is the opportunity to develop upon existing knowledge and skill in the management of COPD alongside developing an understanding of service needs and organisational strategies from a management perspective.&lt;/p&gt;\n&lt;p&gt;You will&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;work as part of an integrated countywide team leading the care for those suffering with chronic respiratory disease.&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;work as part of a 2 Hour Rapid Response Service with the aim of reducing the need for acute service intervention – reducing admissions, supporting early discharges, supporting colleagues and empowering patients to manage their condition with the ultimate aim of improving quality of care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;work within an integrated service to improve the lives of patients with respiratory conditions and heart failure.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;work as part of the Home Oxygen Assessment and Review Service (HOS-AR) to assess patients in Berkshire West who have an oxygen prescription, ensuring that this is appropriate for the patients’ needs and requirements.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;work as part of a countywide team delivering Pulmonary Rehabilitation Courses. There is also the opportunity to support the team to develop a more integrated team approach with the Heart Failure and Cardiac Rehabilitation Team to support patients with other Long Term Conditions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This post includes working as part of the 2 hour Rapid Response service for patients with COPD with the aim of reducing acute hospital admissions and also to assess all patients in the Berkshire Area who have an Oxygen Prescription to ensure that these are managed appropriately. The team also delivers Pulmonary Rehabilitation Classes to improve patient’s quality of life.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Respiratory Service, Reading", "postalCode": "RG1 6DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4463", "longitude": "-.984454"}}, "title": "Community Respiratory Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260261", "validThrough": "2020-11-20T23:59:59+0000"}