{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-03T12:46:41+0000", "description": "&lt;p&gt;INTERNAL APPLICANTS ONLY&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Community Digital Development Manager Band 7&lt;/p&gt;\n&lt;p&gt;Full time, 1 year fixed term or secondment opportunity&lt;/p&gt;\n&lt;p&gt;Do you want to work for a Trust which&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;values inclusivity?&lt;/li&gt;\n&lt;li&gt;is at the start of a transformational journey where collaboration between sector partners is core business?&lt;/li&gt;\n&lt;li&gt;values and invests in YOU?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If this sounds like you why not come and see what UHMBT has to offer.&lt;/p&gt;\n&lt;p&gt;We are a multi-disciplinary team who would welcome you to join us. As well as being the country’s 10th most inclusive employer, worklife balance is made easier with our location; right next door to the beautiful Lake District, where you can enjoy outdoor recreational activities, as well as being close to the bustling city of Manchester.&lt;/p&gt;\n&lt;p&gt;As a recently combined Acute and Community Trust, Morecambe Bay Hospitals Foundation Trust is enjoying greater integration working with colleagues across difference sectors within the footprint of Morecambe Bay.&lt;/p&gt;\n&lt;p&gt;The Integrated Community Care Group delivers a wide range of community services to the population of South Cumbria and North Lancashire. Working within the Bay Health and Care Partner System, we are involved in a wide-range of innovative service development projects aimed at achieving the Triple Aim- Better Health, Better Care, Delivered Sustainably. Integral to all of our service developments is the ability to effectively capture clinical information and measure the impact of our improvements. The Care Group uses EMIS as its main electronic patient record and we have a project underway to develop and enhance EMIS as our comprehensive electronic patient record and information repository within integrated community services.&lt;/p&gt;\n&lt;p&gt;The purpose of this new role is to manage and enable this work: The post holder will oversee a range of workstreams to ensure outputs are delivered that meet both clinical data requirements and the community dataset information requirements. This will involve engaging and working closely with a wide-range of stakeholders across the Care Group and the wider system, acting as an interface between front-line clinicians and colleagues within the Trust’s I3 Department.&lt;/p&gt;\n&lt;p&gt;You will either be an experienced NHS manager or clinician with expertise in the field of digital health systems and/or information, ideally in a Community setting, with a passion for data/information and for enhancing digital capability as a means to support clinical activity and enhance patient care.&lt;/p&gt;\n&lt;p&gt;Whatever your background, you will have excellent communication and facilitation skills, demonstrable experience of managing projects to successful completion, and tenacity and drive to achieve.&lt;/p&gt;\n&lt;p&gt;If you’d like to find out more about the role, please contact Louise Corlett Associate Director of Operations via email louise.corlett@mbht.nhs.uk to arrange an informal discussion.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise CorlettJob titleAssociate Director of OperationsEmail addresslouise.corlett@mbht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospitals Morecambe Bay, Cross- Bay", "postalCode": "LA9 7RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3067", "longitude": "-2.73255"}}, "title": "Community Digital Development Manager - Internal Only", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254038", "validThrough": "2020-11-10T23:59:59+0000"}