{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-30T15:31:35+0000", "description": "&lt;p&gt;&lt;strong&gt;**Please note this position is for current East Cheshire NHS Trust employee’s only**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Whether you are just starting out in your career or are looking to use your skills and experience in a new role, East Cheshire NHS Trust is the right employer for you. An organisation with a real sense of community, we actively support and develop our staff to ensure our patients receive the best quality care. Join our team and support out vision of delivering the right care first, every time.&lt;/p&gt;\n&lt;p&gt;The Strategy Team is looking for a Strategic Planning Officer to work as part of this dynamic and exciting team. This role helps to deliver the Trust’s strategic programme of work supporting the key business issues of the Trust.&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;contribute to the planning, co-ordination and production of strategic plans to meet the trust’s vision, objectives and priorities&lt;/li&gt;\n&lt;li&gt;provide project management support to the programme&lt;/li&gt;\n&lt;li&gt;proactively liaise with internal and external stakeholders to ensure outcomes are achieved&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This vacancy will provide an interesting and varied workload and would ideally suit an enthusiastic and adaptable individual. The successful applicant will have extensive opportunities to develop their existing skills as well as learning new transferable skills within a healthcare provider setting.&lt;/p&gt;\n&lt;p&gt;The role requires the post holder to have excellent interpersonal skills, experience of project management and able to organise and prioritise a busy workload.&lt;/p&gt;\n&lt;p&gt;This is a substantive 22.5 hours post, there is a fixed term element of an additional 12.5 hours for the first six months, which will be then reviewed and may extend until March 2022.&lt;/p&gt;\n&lt;p&gt;Closing date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Sarah Harrison Job title Strategic Planning Practitioner Email address sarahharrison8@nhs.net Telephone number 01625 663453&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Strategic Planning Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250760", "validThrough": "2020-11-08T23:59:59+0000"}