{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "27300", "unitText": "YEAR", "value": "£27,300.00 to £30,000.00 plus £3k Welcome Bonus"}}, "datePosted": "2020-10-14T11:15:54+0100", "description": "&lt;p&gt;OurStaff Nurse role involves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;As a Staff Nurse you will be working within a transdisciplinary team that includes a range of professional.&lt;/li&gt;\n&lt;li&gt;Contributing to pre-admission assessment of referred patient&lt;/li&gt;\n&lt;li&gt;Contributing to the comprehensive assessment of a patient on admission.&lt;/li&gt;\n&lt;li&gt;Compiling a holistic plan of care in partnership with the individual.&lt;/li&gt;\n&lt;li&gt;Compiling a positive risk management plan.&lt;/li&gt;\n&lt;li&gt;Monitoring and reviewing individualised patient plans, within an evidence based framework.&lt;/li&gt;\n&lt;li&gt;Prioritising, organising, and deploying under direction, resources to meet the requirements of the ward for the duration of a shift.&lt;/li&gt;\n&lt;li&gt;Committing to the promotion of basic living skills within a Rehabilitation Setting.&lt;/li&gt;\n&lt;li&gt;Contributing to the delivery of evidence based therapeutic interventions as agreed by the transdisciplinary team.&lt;/li&gt;\n&lt;li&gt;Managing medication as per hospital policy.&lt;/li&gt;\n&lt;li&gt;Adhering at all times to the NMC code of professional conduct.&lt;/li&gt;\n&lt;li&gt;Ensuring that you are up to date with relevant hospital policies.&lt;/li&gt;\n&lt;li&gt;Treating others with dignity, respect, honesty, integrity and fairness.&lt;/li&gt;\n&lt;li&gt;Taking charge of the unit as and when is required.&lt;/li&gt;\n&lt;li&gt;Communicating effectively with the team.&lt;/li&gt;\n&lt;li&gt;To be fully conversant and comply with current legislation and professional standards.&lt;/li&gt;\n&lt;li&gt;To be successful for the higher level nurse positions you would be expected to take on a higher level of responsibility in the above tasks; beyond monitoring, reviewing and contributing.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Managerial&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be responsible for the provision of regular supervision sessions and ensure that annual appraisals are completed for allocated nursing staff in accordance with Hospital policy.&lt;/li&gt;\n&lt;li&gt;To assist in leading and monitoring the performance of the nursing team.&lt;/li&gt;\n&lt;li&gt;To be able to plan, organise and deploy staff according to competencies and workload in order to meet patient needs.&lt;/li&gt;\n&lt;li&gt;Act as a mentor for junior staff&lt;/li&gt;\n&lt;li&gt;Support recruitment of unqualified staff&lt;/li&gt;\n&lt;li&gt;Ensure thorough inductions are completed for all new and bureau staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To be successful as a Staff Nurse, you’ll need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RMN/RNLD Qualification&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Skills/Knowledge&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Completion of pre-registration/ Preceptorship&lt;/li&gt;\n&lt;li&gt;Self motivated&lt;/li&gt;\n&lt;li&gt;Positive role model&lt;/li&gt;\n&lt;li&gt;Drive to take responsibility for personal learning and development.&lt;/li&gt;\n&lt;li&gt;Experience of working in a similar environment and role&lt;/li&gt;\n&lt;li&gt;A focus on patient centred care&lt;/li&gt;\n&lt;li&gt;Demonstrable experience of being a team player&lt;/li&gt;\n&lt;li&gt;Ability to be self-motivated and flexible&lt;/li&gt;\n&lt;li&gt;For higher level nursing position strong Leadership and management of people skills&lt;/li&gt;\n&lt;li&gt;Ability to problem solve and have a solution focussed approach.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Experience&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of working within an environment with patients presenting as challenging in management.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Need to be committed to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Personal learning and development.&lt;/li&gt;\n&lt;li&gt;Evidence based practice.&lt;/li&gt;\n&lt;li&gt;Values based practice.&lt;/li&gt;\n&lt;li&gt;Patient centred care.&lt;/li&gt;\n&lt;li&gt;Team player.&lt;/li&gt;\n&lt;li&gt;Self-motivated.&lt;/li&gt;\n&lt;li&gt;Flexible.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/li&gt;\n&lt;li&gt;Extra Service Annual leave awards&lt;/li&gt;\n&lt;li&gt;Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/li&gt;\n&lt;li&gt;A contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Personal health insurance&lt;/li&gt;\n&lt;li&gt;An employee assistance programme&lt;/li&gt;\n&lt;li&gt;Free meals/refreshments when on duty&lt;/li&gt;\n&lt;li&gt;Free car parking&lt;/li&gt;\n&lt;li&gt;Private Dental Cover&lt;/li&gt;\n&lt;li&gt;Flexible Benefits Packages&lt;/li&gt;\n&lt;li&gt;£250 Contribution towards CPD&lt;/li&gt;\n&lt;li&gt;NMC Payment in full&lt;/li&gt;\n&lt;li&gt;£3,000 Welcome Bonus&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Burton Park provides specialist neurobehavioural rehabilitation for people with an acquired brain injury, including traumatic brain injury and stroke or a progressive neurological condition to reduce challenging behaviour and optimise functional skills. Burton Park is a 50 bedded inpatient rehabilitation service, across three units and patients are supported to maximise their level of independence.&lt;/p&gt;\n&lt;p&gt;A variety of care pathways can be offered, including intensive or slower stream neurobehavioural rehabilitation which can optimise patients living in the least restrictive setting. As part of the intensive neurorehabilitation provided on-site at Burton Park, there is a large emphasis placed upon community rehabilitation in order to prepare the patient to move back to their local area as independently as is possible. Burton Park is situated in the historic town of Melton Mowbray, a thriving market town. Here patients can access local amenities such as a leisure centre, cinema, shops, restaurants and cafés to support their full rehabilitation programme.&lt;/p&gt;\n&lt;p&gt;The TDT includes full time Neuropsychologists, Psychiatrists. Occupational Therapists, Physiotherapist, Speech and Language Therapists, Social Work along with Qualified Nurses and Rehabilitation Assistants. Outcome measures are routinely collected and individual’s progress tracked.&lt;/p&gt;\n&lt;p&gt;Burton Park boasts a range of facilities utilised by the TDT and patients as they work through their specialist individual rehabilitation plan.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Melton Mowbray", "postalCode": "LE13 0RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7567", "longitude": "-.886951"}}, "title": "Staff Nurse RMN/RGN With £3,000 Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225914", "validThrough": "2020-11-13T23:59:59+0000"}