{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50423", "minValue": "44205", "unitText": "YEAR", "value": "£44,205 - £50,423"}}, "datePosted": "2020-10-12T13:38:01+0100", "description": "&lt;p&gt;&lt;strong&gt;We have an opportunity for a Junior Sister (F Grade equivalent) to join our Oncology Inpatients Unit based at The London Clinic’s Cancer Centre, across the road from the main hospital in Central London, W1G (Close to Regents Park &amp; Baker Street tube stations).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest independently owned non-profit hospital, with state-of-the-art facilities located on Harley Street. We have circa 1200 employees, a total of 8 premises, and we are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise.&lt;/p&gt;\n&lt;p&gt;Our main hospital spans 8 floors comprising of 234 beds and 10 theatres, including a Hybrid theatre and two minimally invasive and day surgery theatres. The Duchess of Devonshire Wing is our award-winning cancer centre, which includes state-of-the-art radiotherapy, chemotherapy suites and dedicated patient bedrooms&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Description&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The postholder will facilitate the provision of a co-ordinated, high quality inpatient service to cancer patients in consultation with the inpatient manager. To be in charge and act as deputy when the manager or the deputy manager is absent.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full time, permanent position working 37.5 hours per week (days, nights and weekends.)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The attractive salary range for this role is £44,205 - £50,423 (inclusive of London Weighting &amp; COLA) and will be dependent upon skills and experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits package&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer our permanent staff a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 25 day’s annual leave plus bank holidays, season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties &amp; Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To be able to work autonomously and as part of a team.&lt;/li&gt;\n&lt;li&gt;To provide efficient, effective and evidence-based nursing care to patients at the Clinic.&lt;/li&gt;\n&lt;li&gt;To be competent in the recognition of life threatening/ and or oncology emergencies and act appropriately.&lt;/li&gt;\n&lt;li&gt;To organise workload in line with clinical priorities.&lt;/li&gt;\n&lt;li&gt;Maintain clinical credibility and visibility across all patient care areas within the Clinic.&lt;/li&gt;\n&lt;li&gt;Develop and implement link nurse/practice development initiatives in consultation with the nurse specialists/ Clinical Training Team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;This job description is intended as a general guide to the post, but it may change in line with the needs of the department or at the request of the line manager.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills &amp; Experience&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Registered general nurse&lt;/li&gt;\n&lt;li&gt;Post registration course within this specialist field (such as Chemotherapy Administration)&lt;/li&gt;\n&lt;li&gt;Minimum of 3 years’ experience in Oncology Nursing&lt;/li&gt;\n&lt;li&gt;Experience of clinical audit and ability to interpret results and change service delivery accordingly&lt;/li&gt;\n&lt;li&gt;Able to demonstrate leadership skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;The successful applicant’s offer is subject to relevant DBS, Occupational Health and Reference Checks respectively, alongside standard Right to Work Checks.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are an organisation that has charitable status, and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "F Grade Junior Sister - Oncology Inpatients Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222557", "validThrough": "2020-11-29T23:59:59+0000"}