{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inc"}}, "datePosted": "2020-11-05T20:30:20+0000", "description": "&lt;p&gt;This is an exciting time to join the Surgical Division at the Royal London Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for an experienced, talented and caring senior sister/charge nurse to provide leadership on our new Surgical Level 2 Monitored Unit.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a team player, reliable, able to relate to other members of the multi-professional team and have excellent interpersonal and communication skills.&lt;br /&gt;&lt;br /&gt;You must be able to work flexibly to meet the needs of the service and service users,&lt;/p&gt;\n&lt;p&gt;and have the ability to cope under pressure in a busy environment.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a senior member of the team you will be leading in developing, supporting and teaching the nursing and non-nursing team, whilst promoting the enhancement of evidenced based nursing care. You will be responsible for the day to day nursing care, co-ordinating the shift and ensuring support is provided for the team. Contributing to further developing quality and patient experience agendas and playing a fundamental part in driving forward the Trust values.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you think you have the drive, commitment and enthusiasm to successfully implement change and are ready to rise to this exciting challenge we want to hear from you.&lt;br /&gt;&lt;br /&gt;In return you will work in a well-established nursing and managerial team and be provided with excellent personal and professional development opportunities.&lt;/p&gt;\n&lt;p&gt;You will hold registration with the NMC and have substantial experience at Band 6 grade within Critical Care or High Dependency care settings. You must also have a passion for excellence and be able to demonstrate the ability to take the lead, and have pride in your team and the.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To find out more or arrange an informal visit call or email: &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Denyse Ghisayawan&lt;/p&gt;\n&lt;p&gt;Deputy Associate Director of Nursing&lt;/p&gt;\n&lt;p&gt;Email: denyse.ghisayawan@bartshealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone: 07827832096&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal London Hospital, London", "postalCode": "E1 1FR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.059802"}}, "title": "Senior Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258802", "validThrough": "2020-11-19T23:59:59+0000"}