{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892-£24,157 per annum"}}, "datePosted": "2020-11-05T16:01:29+0000", "description": "&lt;p&gt;&lt;strong&gt;ICT Services- ICT Applications Training and Access Officer– 1 x band 4 permanent role– 37.5 hour post, &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Digital Services play a vital role in the innovative delivery and ongoing support of IT systems at NUH and its wider health and social care partners. Our multidisciplinary team share a common goal ‘To deliver outstanding digital experiences to our staff, our patients and the public we serve’.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic individual with an NHS background to join them as a ICT Applications Trainer, working within a team who are responsible for the provision of training in the use of Patient IT systems; such as the Patient Administration System (Medway PAS), Nottingham Information System (NotIS) and DHR Unity, as well as the delivery of the Information Governance Training Strategy. They will also support the deployment of future IT system under the banner of Electronic Clinical noting such as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Outpatient Clinical Noting via Medway PAS&lt;/li&gt;\n&lt;li&gt;Inpatient Nursing documentation via Nervecentre&lt;/li&gt;\n&lt;li&gt;Inpatient Clinical Noting via Nervecentre&lt;/li&gt;\n&lt;li&gt;Electronic Operation notes via Bluespier&lt;/li&gt;\n&lt;li&gt;Patient questionnaires and communication via DrDoctor&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will provide appropriate training and allocate ICT access for users; delivering training to varying class sizes from 1-2-1s sessions up to overviews to 150 users, delivered face to face and now virtual. They will also provide and coordinate 2nd line support working in liaison with other ICT Services teams when responding to and resolving queries placed by customers to the ICT Service Helpdesk, where necessary ensuring problems are monitored and that escalation is invoked as appropriate and monitoring the team’s performance according to SLA’s. The candidate will also be heavily involved in the development and creation of e-learning training materials.&lt;/p&gt;\n&lt;p&gt;This challenging role requires a customer focused individual who can create and maintain excellent working relationships and work within a fast paced environment. The ability to work independently is important however working as part of a multi functioning team is essential.&lt;/p&gt;\n&lt;p&gt;For further information about this post please contact Ellie Jones, Applications Training Team Manager on mob: 07812268287 or via email: eleanor.jones@nuh.nhs.uk.&lt;/p&gt;\n&lt;p&gt;Interviews will take place w/c 14th December via Microsoft teams and as part of the interview, candidates will be asked to complete a Googlesheets test which is heavily used in the access part of the role and also deliver a 10 minute presentation entitled: ‘How to create the perfect cup of tea’. Ideally the presentation will include an example of self created interactive e-learning. The googlesheets test will look at confirming candidate’s skills level in using these products and similar but also how candidates deal with upskilling themselves in a short space of time (during the test). Candidates will be able to use google during the timed test for support.&lt;/p&gt;\n&lt;p&gt;Candidates will also provide user-guides to support the presentation.&lt;/p&gt;\n&lt;p&gt;For more details on the Digital Services Training and Access Team please see the accompanying document.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "QMC, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "ICT Applications Training Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258477", "validThrough": "2020-11-29T23:59:59+0000"}