{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44044", "minValue": "36481", "unitText": "YEAR", "value": "£36,481 - £44,044 per annum inc"}}, "datePosted": "2020-11-02T14:16:24+0000", "description": "&lt;p&gt;Bartshealth is one of the largest acute and community children’s practices in the UK. We recognise the growing needs of the children from the vibrant part of East London and committed to delivering excellence in specialist treatment, research, education, and care for children. A crucial part in achieving this promise is the future development and investment of the Paediatric Critical Care Unit based at the Royal London Hospital.&lt;br /&gt;&lt;br /&gt;The Paediatric Critical Care Unit is an indispensable part of the Childrens service and strategy, ensuring that local children can be treated and cared for in their local hospital. It is also a tertiary referral centre accepting admissions from north east London and further afield to support the increasing demand for Paediatric critical care.&lt;br /&gt;&lt;br /&gt;It is our aim to increase our outstanding, dynamic team by recruiting experienced, highly motivated children’s nurses with intensive care skills, who have experience of caring for critically ill children.&lt;br /&gt;&lt;br /&gt;As a Band 6, you will need to have previous experience of working within Paediatric Intensive Care and to have completed your intensive care training Your main responsibility will be the clinical care of critically ill children; whilst allowing you the opportunity to share your knowledge, experience and skills This position will also give you the chance to develop your managerial skills.&lt;br /&gt;&lt;br /&gt;You will need to thrive on working in a dynamic environment; willing to teach junior staff; demonstrate self-motivation and work well in a team. You should demonstrate a commitment to your own professional practice, as well as delivering high quality holistic care, with an emphasis on working in partnership with the children and their families.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Olwen Cowen, Senior Sister PCCU on olwen.cowen@bartshealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal London Hospital, London", "postalCode": "E1 1BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.519", "longitude": "-.058048"}}, "title": "PCCU Sister/Charge Nurse - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252384", "validThrough": "2020-11-15T23:59:59+0000"}