{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33176", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 / £33,176 / £33,779 / £37,890"}}, "datePosted": "2020-10-05T15:42:26+0100", "description": "&lt;p&gt;&lt;strong&gt;Not all Heroes wear capes. Now more than ever, being a #NHSHero is something to be proud about.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a dynamic, motivated, adaptable Occupational Therapist with a passion for sharing good practice? We have an exciting opportunity for a &lt;strong&gt;Band 6 Occupational Therapist&lt;/strong&gt; to work across different community hospital in-patient units in Leicester, Leicestershire and Rutland as service needs require.&lt;/p&gt;\n&lt;p&gt;You will have a base ward a&lt;strong&gt;t Swithland Ward, Loughborough Hospital&lt;/strong&gt;- a sub-acute and rehabilitation ward where you will work 2 days, subject to service need. This will give you an opportunity to :&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and take part in local team developments&lt;/li&gt;\n&lt;li&gt;Build your leadership skills&lt;/li&gt;\n&lt;li&gt;Have regular support and supervision&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role is not limited to Loughborough so will provide you with an opportunity and greater exposure to working across the trust for the remaining days. Depending upon the needs of the service you will be expected to cover all of the community inpatient hospitals located in Coalville including stroke ward, Hinckley, Melton, Rutland, Market Harborough including the stroke ward, two city wards based at the Evington Centre on the Leicester General Hospital site.&lt;/p&gt;\n&lt;p&gt;The occupational therapy teams across the areas are part of an integrated Therapy team who have a diverse number of around 6 therapists/unqualified therapy team members. The teams are small and friendly and work closely with the rest of the multidisciplinary team. The team structure usually consist of band 5s, Band 6’s and generic Technical instructors there is also a band 7 Therapy Lead looking after each team. Successful applicant will be managed by the therapy lead based at Loughborough Hospital but will be supported by the therapy leads on other sites when working across these sites&lt;/p&gt;\n&lt;p&gt;The role will involve supporting the occupational therapy service across the sites to provide continuation of the therapy service i.e. when there is a vacancy or sickness. Assessment and treatment of sub-acute, medically unwell patients and those needing short stay rehabilitation. Conditions may include stroke and other neurological conditions, fractures, hip and knee replacements, frail elderly, palliative and End of life patients.&lt;/p&gt;\n&lt;p&gt;.&lt;/p&gt;\n&lt;p&gt;You &lt;strong&gt;will need&lt;/strong&gt; to have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent communication skills&lt;/li&gt;\n&lt;li&gt;Complex discharge planning skills&lt;/li&gt;\n&lt;li&gt;Will need a wide range of treatment skills&lt;/li&gt;\n&lt;li&gt;Experience of working in a multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Will need to use car at work to complete access visits to patient’s property&lt;/li&gt;\n&lt;li&gt;Stroke experience would be beneficial&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In addition to this you will have access to the following &lt;strong&gt;benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Training – can access a wide variety of training courses through our learning and development team.&lt;/li&gt;\n&lt;li&gt;Regular supervision both clinical and management.&lt;/li&gt;\n&lt;li&gt;Free parking on all the sites.&lt;/li&gt;\n&lt;li&gt;Opportunity to claim mileage for mandatory training and clinical access visits.&lt;/li&gt;\n&lt;li&gt;Yearly appraisals to support progression and leadership skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Working pattern for this role will be Monday to Friday 8:30 to 4.30; might need to work bank holidays as well.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role please contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cathy Booth, OT Clinical Team Lead on 07585 986292.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Loughborough", "postalCode": "LE11 5JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7732", "longitude": "-1.2259"}}, "title": "Band 6 Senior Occupational Therapist- Subject to Banding", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213409", "validThrough": "2020-11-29T23:59:59+0000"}