{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Up to Mid Band 7 equivalent salary"}}, "datePosted": "2020-10-21T09:44:13+0100", "description": "&lt;p&gt;&lt;strong&gt;Theatre Coordinator | Up to Mid Band 7 equivalent salary | Hove | Progression opportunity for Senior Theatre Practitioner | Access to training and progression opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a Senior Theatre Practitioner looking to move into management or you are already working in a similar capacity and are looking for your next career move? If so, how would you like the opportunity to work in a boutique style hospital which boasts modern state of the art equipment. This unmissable role offers the opportunity to work alongside some of the regions most experienced Consultants, covering varied and diverse cases.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Montefiore Hospital is rated “O&lt;strong&gt;utstanding” by the Care Quality Commission (CQC). We practice some of the most advanced treatments on the latest generation imaging, and diagnostic technology. This means we can offer everything from screening and rehabilitation through to leading-edge surgical procedures and excellence in specialist fields like orthopaedics, cardiology and general surgery all delivered through our expert and caring clinical team. &lt;/strong&gt;The hospital is well positioned to maximise the excellent local public transport. There are buses that stop in the vicinity and is also walking distance of both Hove and Brighton train station&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Theatre coordinator will deputise for the Theatre Manager and support him / her, as required, in the provision of appropriate clinical and managerial leadership throughout the department. Maximising theatre utilisation, Consultant compliance and maintaining clinical standards, the post-holder will provide strong leadership and direction to all staff across the service and act as a point of contact for advice and expertise relating to professional issues&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monitor and assist in the delivery of patient care&lt;/li&gt;\n&lt;li&gt;Work with others to optimise theatre utilisation in relation to booked operating sessions and availability to meet the demands of elective work, taking action with regards under-utilisation of lists as appropriate&lt;/li&gt;\n&lt;li&gt;Manage staff rosters in the most efficient way to meet demand, whilst maintaining compliance with the Agency staff KPI on the Clinical Scorecard and balancing the use of overtime&lt;/li&gt;\n&lt;li&gt;To ensure that effective systems are in place to manage stocks according to financial instructions, efficient utilisation, intelligent ordering and to work closely with the Finance Manager to ensure compliance with the above&lt;/li&gt;\n&lt;li&gt;Delegate appropriate activities to other staff and ensure objectives are met&lt;/li&gt;\n&lt;li&gt;Ensure all audits/reviews of the departments and their performance are undertaken and implement action plans in response to findings&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HCPC or NMC Registered – with no restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Minimum 5 years’ experience in Anaesthetics/Recovery/Scrub and demonstrable experience in leadership&lt;/li&gt;\n&lt;li&gt;Previously employed either a similar capacity or in a Senior role in a Hospital/Theatre setting&lt;/li&gt;\n&lt;li&gt;Mentorship Certificate or equivalent&lt;/li&gt;\n&lt;li&gt;ILS trained – must be willing to complete ALS &amp; EPALS within 6 months&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Sherine Lowers at sherine.lowers@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hove", "postalCode": "BN3 1RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8318", "longitude": "-.154902"}}, "title": "Theatre Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235696", "validThrough": "2020-11-21T23:59:59+0000"}