{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £30,615 £21,892 - £30,615 Per Annum"}}, "datePosted": "2020-09-30T16:31:01+0100", "description": "&lt;p&gt;Are you passionate about the care you deliver and want to work with a team who are committed to the Trust Vision of ‘get it right, for every patient every time’? If this sounds like you then we want to hear from you!&lt;/p&gt;\n&lt;p&gt;In return we can offer you:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Start with us as a Band 4 until you get your NMC pin and move to Band 5.&lt;/li&gt;\n&lt;li&gt;A structured, multi-professional preceptorship programme to enable you to hit the ground running as a registered nurse. Our initial training will equip you with many of the RN skills that you need including Induction, IV Training, Venepuncture, Cannulation and Sigma.&lt;/li&gt;\n&lt;li&gt;12 month preceptorship programme LEAP which is an innovative programme, led by a multi-professional team of educators with a proven ability to be able to coach and mentor. Utilising your Aintree Preceptorship portfolio and by attending the programme, you can enhance your clinical expertise, master complex concepts, sharpen your critical thinking ability, promote career advancements and develop your leadership potential. In addition, your programme will provide you with further skills including quality improvement, resilience and mindfulness.&lt;/li&gt;\n&lt;li&gt;A work based “preceptor” and the opportunity to access a senior sponsor within the Trust. This person can coach, guide and provide you with direction and can discuss with you any potential career opportunities within the Trust and the wider NHS.&lt;/li&gt;\n&lt;li&gt;On applying you will have the opportunity to choose your 3 preference specialties which, dependent on vacancy levels in each area, we will try and accommodate subject to successful references from your sign off mentor and personal tutor.&lt;/li&gt;\n&lt;li&gt;We are offering a limited number of rotational posts which would allow to develop your knowledge in a number of different specialities. This is an opportunity to be part of a team who strive to deliver safe and compassionate care and consistently improve through learning and innovation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please contact recruitment - recruitment@liverpoolft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aintree / Royal / Broadgreen, Liverpool", "postalCode": "L9 7AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4679", "longitude": "-2.93513"}}, "title": "Newly Qualified Staff Nurse - February/March 2021", "url": "https://www.jobs.nhs.uk/xi/vacancy/916207233", "validThrough": "2021-01-04T23:59:59+0000"}