{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "72333", "minValue": "72333", "unitText": "YEAR", "value": "£72,333.82 per annum"}}, "datePosted": "2020-11-06T13:16:27+0000", "description": "&lt;p&gt;Applications are invited for a 12 month senior clinical fellowship programme in Obstetric anaesthesia. This post is to start in February 2021 for the duration of one year.&lt;/p&gt;\n&lt;p&gt;This fellowship post would suit applicants who have already completed a recognised anaesthetic specialist training programme, including someone who already possesses a CCT in anaesthesia. The post offers the opportunity to develop and increase anaesthetic experience in obstetric anaesthesia prior to taking up a consultant post. The level of supervision will be tailored to the fellow’s prior experience with the ultimate aim of independent practice with distant supervision, so to work at junior consultant level with senior consultant support. The fellowship programme mirrors the requirements for the Royal College of Anaesthetists Advanced Training in Obstetric Anaesthesia but is not recognised a training post. The senior clinical fellow will take part in the general senior clinical fellow on-call rota covering main theatres, PACU and supporting the transplant theatre.&lt;/p&gt;\n&lt;p&gt;Please note that these posts do &lt;strong&gt;not &lt;/strong&gt;carry Postgraduate Dean’s approval or training recognition.&lt;/p&gt;\n&lt;p&gt;The NHS department enjoys close links with the University Of Cambridge Department Of Anaesthesia and there are opportunities for the Subspecialty Fellow to become involved in research and other forms of career development as appropriate to the individual. It is expected that the Senior Clinical Fellow will play an active role in non-clinical activities as part of their professional development, and will be assigned an educational supervisor who will regularly review these.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust comprises Addenbrooke’s and The Rosie Hospitals and is a thriving, modern NHS hospital based in Cambridge, England. CUH is the local hospital for people living in the Cambridge area as well as being an internationally renowned transplant centre and a regional referral centre for an increasing number of specialties. It has strong international links particularly through the University. It is the teaching hospital for the University of Cambridge and is a world-class centre for bio-medical research.&lt;/p&gt;\n&lt;p&gt;The hospital offers particular experience in obstetrics and women’s health, neuroanaesthesia, paediatric anaesthesia, regional anaesthesia and trauma, transplant and hepatobiliary anaesthesia, upper GI and colorectal surgery, airway experience including ENT, major reconstructive head and neck and maxillofacial surgery, vascular anaesthesia, most major surgeries and acute and chronic pain management. The hospital is also the East of England Major Trauma Centre.&lt;/p&gt;\n&lt;p&gt;The applicant must have demonstrable skills in listening, reading, writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013). Non-UK applicants must possess the IELTS/OET exam before obtaining a GMC licence to practice.&lt;/p&gt;\n&lt;p&gt;Full Registration and a Licence to Practice with the General Medical Council at time of application is required.&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt;Informal enquiries about this post should be addressed to Dr Janet Pickett or Dr Tamsin Poole, Consultant Anaesthetists, on telephone 01223 217434 or email janet.pickett@addenbrookes.nhs.uk or tamsin.poole@addenbrookes.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Senior Clinical Fellow in Anaesthesia (Obstetrics)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259851", "validThrough": "2020-11-29T23:59:59+0000"}