{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48500", "minValue": "48500", "unitText": "YEAR", "value": "Up to £48,500 - FTE - DOE"}}, "datePosted": "2020-11-05T15:27:10+0000", "description": "&lt;h1&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Are you collaborative, caring and compassionate?&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt; &lt;br /&gt; Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care at HMP Stocken, we’re looking for a Clinical/Forensic Psychologist to support our existing team.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;A bit about the job..&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As an experienced qualified psychologist with managerial experience, you&#39;ll support the integrated mental health team by providing and enhancing the specialist psychological assessments of patients referred to the team, when appropriate, based upon the use, interpretation and integration of complex psychological data from a variety of sources including psychological and neuro-psychological tests, self-report measures, rating scales, direct and indirect structured observations and semi-structured interviews with clients, family members and others involved in the patient’s care within HMP Stocken.&lt;br /&gt; &lt;br /&gt; Core duties within the mental health team will include but not limited to assessments, supporting complex multi-disciplinary formulations and delivering psychological interventions for cases of great complexity.&lt;br /&gt; &lt;br /&gt; To support the current psychological therapies, plan and assist the integrated mental health team in the overall development of the availability of evidence based therapies both on a 1:1 and group-work basis across the site.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;A bit about you..&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;The successful candidate will be expected to have a broad understanding of trauma and its impact not only on patients but also staff and the organisation as a whole.&lt;br /&gt; &lt;br /&gt; As the proposed model is psychologically informed, it is essential that you have the necessary leadership, clinical skills and experience to provide oversight and leadership at a senior level, and also have the organisational skills to engage and work with other stakeholders within the complex environment of a prison.&lt;br /&gt; &lt;br /&gt; All clinical work will be undertaken in line with psychological therapies model. In doing so, you will be responsible for adhering to the relevant Practice Plus Group policies and professional ethics and standards and will be accountable for professional and clinical actions.&lt;br /&gt; &lt;br /&gt; Registered with the HCPC and holding post-graduate/doctoral level qualification in Clinical, or Forensic Psychology, you&#39;ll have post-qualification experience of working with a wide variety of client groups, across the life span and presenting with the full range of clinical severity in a variety of care settings such as outpatient, criminal justice, in-patient forensic mental health and residential care settings. You&#39;ll also be able to evidence an active interest in prison/forensic mental health.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;More information&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This is a part-time position working 15 hours per week.&lt;br /&gt; The salary for this role is up to £48,500 FTE - depending on experience.&lt;/p&gt;\n&lt;p&gt;HMP Stocken is a category C adult male training prison, holding up to 1060 men and situated in the county of Rutland. Just off the A1 (exit B668), bordering Lincs, Notts and Cambs and within easy travelling distance of Stamford, Oakham, Grantham, Peterborough, Corby etc. We open Monday – Friday, 07:30-18:30 and weekends and public holidays 08:00-17:30. We provide a GP surgery provision alongside access to mental health and substance misuse services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role.&lt;br /&gt; The recruiter will submit your CV to the hiring manager and in turn they will arrange an interview for you to attend at HMP Stocken if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;&lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oakham", "postalCode": "LE15 7RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7459", "longitude": "-.581807"}}, "title": "Clinical Psychologist - HMP Stocken", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258322", "validThrough": "2020-11-19T23:59:59+0000"}