{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892-£24,157"}}, "datePosted": "2020-10-23T15:46:28+0100", "description": "&lt;p&gt;We are seeking to appoint motivated Assistant Practitioners to join the Primary Care Homes across Great Yarmouth and Waveney.&lt;/p&gt;\n&lt;p&gt;The Primary Care Network consists of Community Matrons, Nurses, Physiotherapists and Occupational Therapists, Assistant Practitioners, Pharmacy Technician, Paramedic, Health Care Assistants, and Rehabilitation Support Workers , ensuring the patient is seen by the right healthcare professional at the right time.&lt;/p&gt;\n&lt;p&gt;The PCH works closely with Primary Care providing Healthcare to adult patients in their own homes, residential care or clinic settings, supporting them to self manage where possible. Our aim is to support our local community with nursing, therapy and reablement needs , and prevent avoidable hospital admissions where appropriate.&lt;/p&gt;\n&lt;p&gt;As an Assistant Practitioner you will gain competence in many clinical skills including patient assessment, wound care; catheterisation; insulin administration; and health coaching, working with both the reactive and proactive elements of the service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have completed a foundation degree in health and social care, and be able to demonstrate how they embody our values and commitments and have a desire for personal and professional development. You should be enthusiastic, motivated, possess good communication skills and be able to use your own initiative and work well as part of a multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;East Coast Community Healthcare follows Agenda for Change terms and conditions and supports the transfer of NHS pension for those already in the scheme. In return for your commitment, we offer a wide range of staff benefits including investment in career development; salary sacrifice lease car scheme; child care vouchers; NHS discounts; pension schemes. For a full list of employee benefits please see our website. As a social enterprise we actively encourage employee shareholding and participation in the development of our enterprise.&lt;/p&gt;\n&lt;p&gt;The service uses SystmOne as a clinical IT system to support mobile working.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127294.png", "name": "East Coast Community Healthcare CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various", "postalCode": "NR31 6LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5617", "longitude": "1.718"}}, "title": "Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241173", "validThrough": "2021-03-31T23:59:59+0100"}