{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 p.a. pro rata"}}, "datePosted": "2020-11-04T10:49:55+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Are you looking for an opportunity to build on your experience as a senior CAMHS clinician or step up to such a role?&lt;/strong&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If so, Southampton Child and Adolescent Mental Health Service has a great opportunity for an experienced and dynamic qualified Family and Systemic Psychotherapist who has passion for community CAMHS and innovative ways of working. This is a great opportunity to join our team in Solent NHS Trust Children &amp; Families Service line to support in the delivery of high-quality children’s mental health services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As one of the senior members of the team, you will work alongside senior staff and contribute to the team’s development, as we continue to strive to be an accessible, responsive and innovative service with patient care and patient experience at its heart. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There will be opportunities to develop your leadership and strategic skills with support from senior colleagues. For example, you may contribute to service development, Quality Improvement and clinical governance initiatives, service user involvement, audit and research. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome applications from candidates who can bring knowledge and skills to help us build on our success; to create a high quality, efficient and effective system to address demand and capacity issues and expertise in areas such as intake, assessment and brief treatment models and groups.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for committed, experienced and knowledgeable therapists with a passion for working with children, young people and their families. The successful candidate will provide systemic assessment, treatment- planning and interventions for young people and their families, working independently and autonomously with an agreed case-load as well as working with other family therapists, systemic practitioners and wider team members and/or external agencies in order to facilitate the best possible outcomes.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role will allow opportunity to contribute specialist systemic knowledge to the multi-disciplinary team to facilitate wider understanding of systemic issues and participate in a team approach to care planning and risk management.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would love to welcome you if you feel the above applies to you and you have the appropriate registration (BABCP/UKCP).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you wish to have an informal conversation regarding the post, please contact Satty Basra on 02381 030061.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Family and Systemic Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255466", "validThrough": "2020-11-25T23:59:59+0000"}