{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa (based on full time hours)"}}, "datePosted": "2020-11-03T16:15:18+0000", "description": "&lt;h1&gt;&lt;strong&gt;Are you an RMN with a difference that can make a difference if so you can apply!!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;The Winchester Mother and Baby unit hasa fantastic opportunity for RMN’s to join the team. We are looking for an RMN’s to work within our fantastic ward that provides acute psychiatric care to women in the Perinatal Period alongside our MDT which includes Health visitors and Nursery nurse’s to support the babies staying with their mothers.&lt;/p&gt;\n&lt;p&gt;We are looking for RMN’s with some previous ward experience and are looking for their next challenge.&lt;/p&gt;\n&lt;p&gt;Perinatal mental health is a very rewarding area to work in not only for the outcomes for our service users but also the training opportunities we have from specialist Perinatal training course’s across the country and the psychological interventions training but also personal development.&lt;/p&gt;\n&lt;p&gt;We are a nationally recognised service which is nationally funded and accredited with the Perinatal Quality Network. We work to extremely high standards in our patient care and are always striving to improve our service through our regular quality improvement sessions.&lt;/p&gt;\n&lt;p&gt;The Mother and Baby Unit provides a specialist mother and baby inpatient care service for women who are requiring acute psychiatric care before or following birth. We work as a multidisciplinary and also work very closely to the community perinatal team which also provides opportunities to join the community team when vacancies arise.&lt;/p&gt;\n&lt;h1&gt;**** We are offering a “£2,500 Golden Hello Payment” to successful candidates from outside of Hampshire and Isle of Wight! ***&lt;/h1&gt;\n&lt;p&gt;For further information on this role, please contact Charlotte Swain on 01962 897711.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Happy to talk flexible working&lt;/strong&gt;-&lt;strong&gt; all requests for flexible and part time working will be considered.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Follow us on Facebook and on Twitter:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;facebook.com/SouthernHealthNHS&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Melbury Lodge, Winchester", "postalCode": "SO22 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0614", "longitude": "-1.33095"}}, "title": "Registered Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254733", "validThrough": "2020-11-18T23:59:59+0000"}