{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890"}}, "datePosted": "2020-10-30T08:16:25+0000", "description": "&lt;p&gt;At East Lancashire Hospitals Trust, our vision is to be widely recognised for providing safe, personal and effective care. We currently provide high quality services and treat over 600,000 people across East Lancashire and the surrounding area. We employ over 7,000 staff, many of whom are internationally renowned and have won awards for their work.&lt;/p&gt;\n&lt;p&gt;Cellular Pathology has a vacancy for a Band 6 Specialist Biomedical Scientist. This is a permanent position, 37.5 hours per week. The successful candidate will be hardworking, reliable, flexible and must work well within a team.&lt;/p&gt;\n&lt;p&gt;Cellular Pathology comprises Histology, Non-gynae cytology and Andrology, supported by a comprehensive immunohistochemistry service. We receive around 32,000 histology and 3,000 non-gynae requests per year.&lt;/p&gt;\n&lt;p&gt;The post will be based at Royal Blackburn Teaching Hospital. The department is UKAS accredited.&lt;/p&gt;\n&lt;p&gt;In line with national initiatives for the streamlining of pathology services, East Lancashire Hospitals NHS Trust is currently working collaboratively with 3 other local Trusts in a bid to secure our services for the future. Whilst this position/role is currently based here at Royal Blackburn Teaching Hospital, this may not be the case in the future, and you need to be aware that you may be relocated to another hospital or an off-site location which, in accordance with the current project timeline, would be sometime in 2023.&lt;/p&gt;\n&lt;p&gt;Please ensure you check the email account from which you apply regularly as we may use this to contact you regarding your application. &lt;br /&gt;&lt;br /&gt;Only those applicants who demonstrate clearly how they meet our person specification will be shortlisted for interview.&lt;/p&gt;\n&lt;p&gt;Depending on current guidance, the interview may be held remotely via MS Teams.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCraig RogersJob titleLead Biomedical ScientistAdditional contact information&lt;/p&gt;\n&lt;p&gt;For informal visits contact:&lt;/p&gt;\n&lt;p&gt;Craig Rogers: Craig.Rogers@elht.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Specialist Biomedical Scientist (Band 6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249343", "validThrough": "2020-11-07T23:59:59+0000"}