{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T11:16:44+0000", "description": "&lt;p&gt;It’s a great time to be a part of the Community Mental Health Teams in Canterbury as we have been awarded additional Mental Health Funding to expand the teams which will enable us to develop the Clinical Care Pathways leading to an improved and innovative service for our Service Users, Carers and Staff.&lt;/p&gt;\n&lt;p&gt;Canterbury Community Mental Health Team is based in Laurel House in the centre of Canterbury with a satellite site in Herne Bay and are a diverse multi-cultural team that is looking to recruit a band 6 Mental Health Practitioners to work within the team, providing specialist mental health care for people with multiple and complex needs that require intensive support.&lt;/p&gt;\n&lt;p&gt;If are interested in either a Duty Role, Assessments, Care Co-ordination or a mixture of all of these roles we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;Our service focuses on promoting recovery for those people diagnosed with severe and enduring mental ill health. We provide comprehensive multi-disciplinary services and work closely with local specialist mental health teams, tertiary service providers, primary care, local statutory and non-statutory agencies, service users and carers.&lt;/p&gt;\n&lt;p&gt;The Care Group is currently implementing new Clinical Care Pathways these are Initial Interventions, Personality Disorder and Enduring Condition so there will be opportunity for you to choose a specialism should you be the right person.&lt;br /&gt;&lt;br /&gt;What we can offer you in West Kent:&lt;br /&gt;&lt;br /&gt;- Participation in groups with Psychology and Occupational Therapy &lt;br /&gt;- Opportunities to run groups&lt;br /&gt;- Preceptorship for new qualified staff&lt;br /&gt;- Leadership Modules to develop in senior roles&lt;br /&gt;- Mentorship and Supervision&lt;/p&gt;\n&lt;p&gt;- Relocation package (if meets criteria)&lt;/p&gt;\n&lt;p&gt;What you can expect once you join the team: &lt;br /&gt;&lt;br /&gt;- Monthly supervision (clinical and managerial)&lt;br /&gt;- Reflective Group to discuss complex cases and share learning &lt;br /&gt;- MDT Risk Forum to discuss complex cases with high risks &lt;br /&gt;- Mandatory training &lt;br /&gt;- Clinical Review of caseload with Consultant Psychiatrist and Team Leader&lt;br /&gt;- Structured Clinical Management Group support&lt;br /&gt;- Admin support &lt;br /&gt;- Peer support &lt;br /&gt;- Free parking&lt;br /&gt;&lt;br /&gt;We are looking for motivated and enthusiastic Mental Health Practitioners. You will have a strong sense of initiative and an excellent team working ability. &lt;br /&gt;&lt;br /&gt;Effective communication skills and self-governance are required. You will be able to demonstrate knowledge of high level interventions &amp; community assessment skills. Existing qualifications or a willingness to undertake training relevant to the post is expected.&lt;br /&gt;&lt;br /&gt;This post offers an excellent opportunity to work in an interesting and developing service environment and if you have no experience of working in the community but would like to expand your professional development then we can offer you a development programme to support you with this transition. You will be offered considerable opportunities for training and professional development.&lt;br /&gt;&lt;br /&gt;As part of the Band 6 Nursing team you will be required to attain a mentoring qualification.&lt;/p&gt;\n&lt;p&gt;We have an exciting virtual tour video that we will send to anyone that completes an application or if you think it would help you decide if you want to join our amazing team please contact us and we will send you the link.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jane Berwick, Operational Team Manager&lt;/p&gt;\n&lt;p&gt;Email: jane.berwick@nhs.net, Telephone: 1227 597111&lt;/p&gt;\n&lt;p&gt;Christine Thompson, Operational Team Manager&lt;/p&gt;\n&lt;p&gt;Email: Christine.thompson10@nhs.net, Telephone: 01227 597111&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Laurel House, Canterbury", "postalCode": "CT1 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2739", "longitude": "1.08488"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253690", "validThrough": "2020-11-17T23:59:59+0000"}