{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "77126", "minValue": "41360", "unitText": "YEAR", "value": "£41,360 - £77,126"}}, "datePosted": "2020-11-02T15:01:37+0000", "description": "&lt;p&gt;Closing Date: Midnight 23rd November 2020&lt;/p&gt;\n&lt;p&gt;Specialty Doctor in General Internal Medicine/ Care of the Elderly/ Allied specialties&lt;/p&gt;\n&lt;p&gt;An exciting bespoke opportunity has been developed in line with our unique and exciting Clinical Futures Model. Clinical Futures is aligned to the opening of our brand new Grange University Hospital in 2021 and the parallel development of Centers of Excellence in the surrounding enhanced local general hospitals. The developments of these sites mean that you would be joining ABUHB at a truly once in a generation era.&lt;/p&gt;\n&lt;p&gt;This post allows training opportunities across the Medical Specialties within the Royal Gwent, Nevill Hall and Ysbyty Ystrad Fawr Hospitals. The post will be rotational and include care of the elderly experience, however specific 6 month attachments can be arranged across all medical specialities depending on individual training requirements and interest These specialties include; cardiology, respiratory, endocrine, palliative care, gastroenterology, neurology.&lt;/p&gt;\n&lt;p&gt;ABUHB is an innovative Health Board packed with ambition and is an excellent place to start your career as well as move it up a gear and to continue developing yourself professionally.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have training access across the medical specialties and to a variety of accredited training courses, under the supervision of RCP trainers. ABUHB will be highly flexible to the needs of individual candidates towards their career progression such as obtaining MRCP(UK) and CESR in line with the service requirements. ABUHB has a very good track record with high MRCP (UK) pass rates and training courses for MRCP PACES examination. There is dedicated fund to support with training which will need to be discussed with your RCP trainer. Audit and QI projects will be a requirement of the post and the post is supported by a dedicated research lead based in Cardiff University for anyone interested in research.&lt;/p&gt;\n&lt;p&gt;The post has a resident on-call element, the frequency and acuity is dependent on the hospital which will you be joining. Although irrelevant to the site, all on-calls with attract a 2 additional sessional payments.&lt;/p&gt;\n&lt;p&gt;Relocation packs are available to the successful candidate, and any candidate who will require this support will need to alert the Health Board at the interview stage.&lt;/p&gt;\n&lt;p&gt;This position involves Regulated Activity with &lt;strong&gt;children and adults&lt;/strong&gt; as defined by the Safeguarding Vulnerable Groups Act (amended by the Protection of Freedoms Act 2012) and the following checks will be undertaken following any conditional offer:&lt;/p&gt;\n&lt;p&gt;Enhanced check with barred list information, including an adults and children’s barred list check&lt;/p&gt;\n&lt;p&gt;Applicants must hold or be eligible to hold full registration and a licence to practice with the GMC.&lt;/p&gt;\n&lt;p&gt;Free parking is available across all Aneurin Bevan University Health Board Sites.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Vacancy Ref: 040-SD198-CF&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date for Applications: Midnight on 23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Published on NHS Jobs and Trac: 2nd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Inder Singh&lt;/p&gt;\n&lt;p&gt;Email address Inder.Singh@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01443 802234&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Ystrad Fawr, Ystrad Mynach", "postalCode": "CF82 7GP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6552", "longitude": "-3.24496"}}, "title": "Specialty Doctors in Medicine and Allied Specialties", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252537", "validThrough": "2020-11-23T23:59:59+0000"}