{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 pa"}}, "datePosted": "2020-10-02T10:04:12+0100", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Isle of Wight NHS Trust&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Medicine Care Group&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Consultant Physician with specialist interest in Gastroenterology&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;We are looking for enthusiastic, motivated colleagues to join our high performing and productive Gastroenterology Service here on the Isle of Wight. Our organisation is unique, functioning as an integrated Trust comprising of Acute, Ambulance, Community and Mental Health Services. We provide comprehensive Gastroenterology and Hepatology Services, and have a modern JAG accredited Endoscopy Unit. &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Following the recent retirement of two consultants, the provision of medical care and specialist gastroenterological services will be redesigned such that patients will be provided with excellent general medical and specialist gastroenterological care with the assurance that there is continued excellent specialist secondary and tertiary provision by Solent Acute Alliance partner Trusts when required. The clinical strategy is currently under development and includes gastroenterology within the provision of medical services. However, the majority of gastroenterological services will provided locally by the Island based team. The positions will be suitable for candidates who want to work differently but are passionate about the delivery of gastroenterological services for the population of 140,000 that live on the Isle of Wight.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;The post holder will provide outpatient, inpatient and endoscopic Gastroenterology, along with a commitment to the 1:11 acute medical on-call rota. The post will integrate with the current specialties offered by the existing Gastroenterology team, which include: inflammatory bowel disease, bowel screening and ERCP; we are most keen to develop hepatology and inflammatory bowel services. The successful candidate will also be expected to take part in business planning of Gastroenterology Services in collaboration with the other two consultants in the Service and the Care Group’s operational management team. &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;We are offering a Welcome Incentive for the right candidate.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;For an informal discussion, please call Dr Christoper Sheen, Lead Clinician on 01983 534228 or email christopher.sheen@iow.nhs.uk&lt;br /&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isle of Wight NHS Trust - Medical Recruitment", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Consultant Physician with an interest in Gastroenterology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916209932", "validThrough": "2020-11-29T23:59:59+0000"}