{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-10-28T10:30:39+0000", "description": "&lt;h1&gt;&lt;span&gt;WORCESTERSHIRE EARLY INTERVENTION SERVICE&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SUPPORT WORKER &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Worcestershire’s Early Intervention Service addresses the needs of young people (aged 14-35) who have recently experienced a first episode of psychosis or who are presenting with an at risk mental state. We are expanding the service to take referrals for people up to the age of 64 and this has created an exciting opportunity for additional staffing across the service. With bases in Worcester and Bromsgrove, we are a countywide service helping individuals and their families to cope with psychosis, promoting recovery, reducing trauma and tackling stigma.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking two full time Band 3 Support Workers (North and South) to join our Worcestershire Early Intervention Psychosis Team. We value applicants who have a lived experience of mental illness and can offer a unique perspective in offering support for service users through various stages of their recovery. This includes working with the other team members and organisations to achieve the best outcomes for service users and their families. In addition to working with service users individually, the role includes collaboratively planning, delivering and evaluating of groups and family work. As a team we aim to promote independence, health and well-being and social inclusion for service users through advice and practical support to engage in their local community individually or as part of a group.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Worcestershire’s Early Intervention Service is an award-winning service with an international reputation. This post represents a fantastic opportunity to gain experience working in a multi-disciplinary team of highly-skilled and knowledgeable clinicians.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There are positions available at both sites with ability to work some hours each week from home in the current COVID-19 situation. As a countywide service there may be a requirement for you to work across both sites. This post usually involves a significant amount of travel so the applicant needs to be able to meet the travel requirements of the role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information, or an informal discussion, please contact any of the following: Julia Wittering (Clinical Lead, Early Intervention Service) - 01905 734536 or Sian Westaway (Service Lead - AMH Specialist teams) - &lt;span&gt;01905 734531&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;All staff whatever their role, level or responsibility will be encouraged and supported to do their job well and to improve their job.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Making Every Day Better for patients, staff, service users and carers is the responsibility of all of us and we want to embed a culture within the organisation that encourages and supports the drive to improve what we do.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120795.jpg", "name": "Worcestershire Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcester", "postalCode": "WR1 2AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1916", "longitude": "-2.21697"}}, "title": "Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246059", "validThrough": "2020-11-11T23:59:59+0000"}