{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 pro rata, per"}}, "datePosted": "2020-11-03T08:16:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Advert&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**Trust wide Vacancies - Please note that A&amp;E posts are not recruited to from this centre any posts for A&amp;E are advertised seperately via NHS Jobs &amp; Trac Recruitment**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated and enthusiastic qualified/newly qualified staff nurses to join established teams across a number of our specialities.&lt;/p&gt;\n&lt;p&gt;Employer: North Tees &amp; Hartlepool NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;Location: University Hospitals of North Tees&amp; Hartlepool&lt;/p&gt;\n&lt;p&gt;Department: Trust wide&lt;/p&gt;\n&lt;p&gt;Salary: £24,907 - £30,615 per annum (pro rata)&lt;/p&gt;\n&lt;p&gt;Contract Type: Permanent/Fixed Term/Seasonal positions available&lt;/p&gt;\n&lt;p&gt;Calling all Registered Nurses! Are you a 3rd year nursing student due to qualify or are you already an experienced Registered Nurse? Would you like to make a difference and take on new challenges?&lt;/p&gt;\n&lt;p&gt;North Tees and Hartlepool NHS Foundation Trust has many exciting opportunities for Registered Nurses at all stages. Whether you are just starting out in your Nursing career, looking for a change or even returning to practice, we would welcome the opportunity to meet with you. We offer a full range of acute hospital services for our local community and we have some excellent opportunities within all of our directorates. If you are enthusiastic, dynamic and committed to providing high quality, compassionate care then we would love for you to join our team!&lt;/p&gt;\n&lt;p&gt;At North Tees and Hartlepool NHS Foundation Trust offer excellent opportunities for career progression and professional development;&lt;/p&gt;\n&lt;p&gt;1.For those who are newly Registered, our Faculty of Inter-professional Education and Staff Training (FINEST) programme offers a unique opportunity to provide you with support and an educational framework which includes six monthly rotational posts in Medicine; Elective or Emergency and Out of Hospital Care – bespoke to you. You will have protected study time and additional pastoral support during the rotation, and will join our well established multi-professional Preceptorship Programme.&lt;/p&gt;\n&lt;p&gt;2.If you newly registered but are very clear about your career path and know where you would like to work then a static post can be offered based on your preferences. Along side this we will still provide you with the same pastoral and educational support and will you join our well established multi-professional Preceptorship Programme.&lt;/p&gt;\n&lt;p&gt;3.For those of you who are experience Registered Nurses and you already have a clear idea of where you would like to work then just let us know, we will support in bringing you into your area of choice so that you can continue to progress in your career with us!&lt;/p&gt;\n&lt;p&gt;Please visit our Trust websiteNursing &amp; Midwifery Recruitment page to read about the opportunities within all of our directorates and to view our current nursing and midwifery vacancies. If the vacancy you want is not there please do not let this put you off submitting your application, we are keen to offer positions bespoke to your needs and would still like the opportunity to meet you and to see what we can offer based on your career preferences.&lt;/p&gt;\n&lt;p&gt;We have a generic application form process and you only have one interview in the Trust within one of our Recruitment Centres to ensure that you are given the best possible opportunity to develop in your Nursing Career. Shortlisted candidates will be invited to attend one of our Recruitment Centres which take place monthly from November 2017.&lt;/p&gt;\n&lt;p&gt;Once you have submitted your application for you will be contacted by our resourcing department and will be given information about the recruitment centre you have been invited and will be asked to complete a short pre-recruitment centre questionnaire which will give us an idea of where you wish to work prior to the day which will help us plan opportunities which are specific to your needs.&lt;/p&gt;\n&lt;p&gt;Planned Recruitment Centre (8:45 - 3:30); Monday 28th December 2020 **Please note that the interviews for this post my change forum due to Covid-19**&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Claire Ranson &amp; Paul Caygill - 01642 383742&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Ranson &amp; Paul Caygill - 01642 383742&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Tees and Hartlepool NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120670"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockton, Stockton on Tees", "postalCode": "TS19 8PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5829", "longitude": "-1.34677"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253128", "validThrough": "2020-12-01T23:59:59+0000"}