{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-27T17:45:10+0000", "description": "&lt;p&gt;&lt;strong&gt;BASE: Various bases across Nottingham City&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for an opportunity to advance your career? Do you want an exciting opportunity to be part of an integrated (0-19) Public Health Nursing team and deliver safe and effective care in order to give Nottingham children the best start in life? Then this may just be the role you are looking for you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a Registered Nurse or Midwifecommitted to developing innovative ways of working with key partners to develop and deliver children’s public health services in a co-ordinated way that is responsive to need?&lt;/p&gt;\n&lt;p&gt;If so, please read on ……you might be the person we are looking for.&lt;/p&gt;\n&lt;p&gt;We require enthusiastic Registered Nurses to join our teams. You will be part of our 0-19 Public Health team, working from a range of community settings and within client’s homes. You will support the Specialist/Senior Community Public Health Nurse (SCPHN)/Health Visitor (HV) in the delivery of the universal and targeted services. You will support the SCPHN/HV in the management of a defined caseload as part of a 0-19 years integrated multi-agency partnership approach to promote health and contribute to tackling health inequalities in line with local and national guidelines, public health priorities and safeguarding responsibilities.&lt;/p&gt;\n&lt;p&gt;In partnership with the Early Help team; you will be delivering evidence based packages of care to families and children. You will also support on reducing health inequalities and improving the health and wellbeing of children and their families within Nottingham City’s community.&lt;/p&gt;\n&lt;p&gt;You will have;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Experience of working with children, families and young people and have a proven track record of continuous professional development and innovative practice.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent communication skills; (both written and verbal), coupled with good IT and organisational/prioritising skills, with the ability to work within a team setting as well as independently.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Positive outlook and responsive to changes in the future delivery of health care.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;Knowledge and experience in addressing safeguarding issu&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Within the wider service you will also be involved in audit, development of practice, support and supervision to other health care professionals.&lt;/p&gt;\n&lt;p&gt;Nottingham CityCare Partnership is a dynamic organisation currently commissioned to provide NHS community services. Recognised for innovation in approach, we work with the community to deliver high quality needs led services. In return, joining Nottingham CityCare, will offer excellent learning and development opportunities, AFC pay scale including the national pay award and an NHS Pension. The hours of work will be minimum 22.5 over 3 days (Part time) to 37.5 hours (Part Time/Full time) The Service hours are Monday – Friday 8.30am – 5pm excluding weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact Clinical Service Managers Lynn McGuinness on 07867 141881 or Julie Greenwood&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124392.jpg", "name": "Nottingham CityCare Partnership CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124392"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG1 6GN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9518", "longitude": "-1.15587"}}, "title": "Community Public Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245596", "validThrough": "2020-11-11T23:59:59+0000"}