{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata)"}}, "datePosted": "2020-11-05T15:46:03+0000", "description": "&lt;p&gt;&lt;strong&gt; LD Community Nurse Band 5 - Learning Disabilities Community Hub&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced and highly motivated individual to join the learning disability community nursing team that forms part of the integrated hubs.&lt;/p&gt;\n&lt;p&gt;The role involves providing specialist support and guidance to adults with learning disabilities and their carers. The successful candidate will provide clinical services through the effective management of an active caseload.&lt;/p&gt;\n&lt;p&gt;You will be an experienced and flexible individual with excellent communication skills and a passion for intergrated team working. You will have experience of team work and be a confident and assertive clinical practitioner.&lt;/p&gt;\n&lt;p&gt;You will work within the framework of health facilitation (level one and two).&lt;/p&gt;\n&lt;p&gt;The applicant must be prepared to work flexible hours to meet the individual needs of the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;IMPORTANT&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Julie Horton&lt;/p&gt;\n&lt;p&gt;Job title  Clinical Operational Manager&lt;/p&gt;\n&lt;p&gt;Telephone number 0121 466 3900&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Greenfields, Birmingham", "postalCode": "B30 3QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4124", "longitude": "-1.90439"}}, "title": "Band 5 Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258403", "validThrough": "2020-11-19T23:59:59+0000"}