{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a. inc. HCA"}}, "datePosted": "2020-10-29T08:30:24+0000", "description": "&lt;p&gt;The NIHR GSTT Biomedical Research Centre (BRC) at Guy&#39;s and St Thomas’ NHS Foundation Trust and King&#39;s College London delivers world class translational research. Within this context, the BRC Translational Bioinformatics Platform focuses on translational research projects based on genomics and bioinformatics approaches for the identification of novel therapeutic targets and disease biomarkers, and the dissection of molecular mechanisms underpinning diseases.&lt;/p&gt;\n&lt;p&gt;The BRC’s research spans nine research themes encompassing Cardiovascular Disease; Cutaneous Medicine; Genomic Medicine; Imaging Sciences; Infection &amp; Immunity; Transplantation; Oral Health; Regenerative Medicine &amp; Cellular Therapy; and Women and Children’s Health.&lt;/p&gt;\n&lt;p&gt;A position is currently available in the Translational Bioinformatics group for a bioinformatician. The post will involve bioinformatics analysis of data from high throughput multi omics experiments (including single cell data) being generated as part of translational medicine studies. The post holder will implement NGS analysis pipelines making use of the Kings High Performance Computing infrastructure, where appropriate. The position also involves downstream bioinformatics analyses (for example pathway and network analysis) for data interpretation, contextualisation and hypothesis generation.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a MSc or PhD or equivalent experience, in bioinformatics, mathematics, statistics, or in a biological science with substantial computational components, will enjoy team working and interacting with clinicians and experimental biologists on analysis of complex real-world datasets, and will have significant experience in one of R/Bioconductor, Python, and familiarity with Unix. Experience of implementing NGS analysis workflows including single cell analyses, would be an advantage.&lt;/p&gt;\n&lt;p&gt;The group works in a highly collaborative manner, and the postholder will work closely with a wide range of academic and clinical researchers in addition to members of the translational bioinformatics group. The post holder will be encouraged to participate in preparing work for publication and for presentation at relevant scientific meetings.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr. Mansoor SaqiAdditional contact information&lt;/p&gt;\n&lt;p&gt;For additional information please contact: Dr. Mansoor Saqi, Head of Translational Bioinformatics: mansoor.saqi@kcl.ac.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s Hospital, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Bioinformatician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247642", "validThrough": "2020-11-23T23:59:59+0000"}