{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pro rata"}}, "datePosted": "2020-10-14T16:18:54+0100", "description": "&lt;p&gt;&lt;strong&gt;MO13 Practice Pharmacist Specialist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and dynamic pharmacist to join our team delivering practice based medicines optimisation services across the Tees Valley. The NECS Medicines Optimisation Team is an embedded function within the newly established Tees Valley CCG working across all GP practices in Middlesbrough, Redcar and Cleveland, Hartlepool, Stockton and Darlington.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be self-motivated, able to work independently and passionate about providing the highest standards of care to patients in primary care. You will work within your clinical competencies as part of a multi-disciplinary team to provide expertise in clinical medicines management, provide face-to-face structured medication reviews especially for those with frailty, in care homes and/or with multiple co-morbidities as well as undertaking reviews of patients with specific long term conditions. You will also contribute to quality improvement and clinical audit, as well as supporting aspects of medicines safety and antibiotic stewardship.&lt;/p&gt;\n&lt;p&gt;In addition to the patient facing aspect requirements of your role, you will also be required to contribute towards practice and PCN financial and quality performance. You will work to deliver medicines optimisation initiatives within GP practices and PCNs including the provision of specialist professional pharmaceutical advice and services to ensure the safe and cost effective use of medicines.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent written and verbal communication skills and inter-personal skills, experience of working in multidisciplinary teams and influencing others and conducting clinical medication reviews. Leadership, motivational and excellent communication skills both verbal and written are essential to this role. Demonstrable experience of clinical system protocol development would be welcomed and good IT skills are essential. A working knowledge of SystmOne and EMISweb GP clinical systems would be an advantage. The post-holder will be required to travel on a regular basis between GP practices across the Tees Valley.&lt;/p&gt;\n&lt;p&gt;As a flexible employer we welcome applications from individuals wishing to work part time or job share. The post holder will be required to work across GP practices across the Tees Valley.&lt;/p&gt;\n&lt;p&gt;There are currently permeant and temporary roles available. Please enquire for more details.&lt;/p&gt;\n&lt;p&gt;We encourage applicants to contact us for an informal discussion or visit. Please contact Donna Hewett, Pharmacist Team Lead on 07967 763370 for further information.&lt;/p&gt;\n&lt;p&gt;Interviews will take place on 30th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North of England Commissioning Support", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "STOCKTON-ON-TEES", "postalCode": "TS17 6BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5617", "longitude": "-1.3042"}}, "title": "Practice Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227076", "validThrough": "2020-11-09T23:59:59+0000"}