{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "89809", "unitText": "YEAR", "value": "£89,809 to £110,683 pa"}}, "datePosted": "2020-10-30T12:45:29+0000", "description": "&lt;p&gt;We are looking for a Consultant Psychiatrist to join our established Adult Mental Health Inpatient Team at antelope House in Southampton. The post covers our male inpatient ward, and is there to provide clinical expertise and leadership to the team. The post holder will be part of a friendly and supportive team of Consultants working in the area.&lt;/p&gt;\n&lt;p&gt;The successful candidate will also be involved in the supervision of junior doctors and medical students on placement with the service. It also has a weekly local educational programme available to the candidate as well.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Locally we have a cohesive and supportive Consultant group, meeting monthly. Here, alongside business and service development agendas, there is a strong peer support and clinical focus.&lt;/p&gt;\n&lt;p&gt;We have an active Research and Development function and we are always looking for more involvement in our research projects; we offer an excellent new consultant induction programme to&lt;/p&gt;\n&lt;p&gt;support and develop you as a new consultant within Southern Health NHS Foundation Trust; even if this is not your first consultant post this helps orientate you to the organisation. We have established this to create a network through your first year with the Trust combining a tailor development programme and coaching with organisational understanding.&lt;/p&gt;\n&lt;p&gt;For further information on the role and to arrange a visit please contact either Dr Zaid Alabbasi Medical Director: zaid.alabassi@southernhealth.nhs.uk or Dr Adam Cox Clinical Services Director: adam.cox2@southernhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO14 0YH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9217", "longitude": "-1.40055"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250227", "validThrough": "2020-11-20T23:59:59+0000"}