{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £56,490 pa inc HCAS pro rata"}}, "datePosted": "2020-10-16T14:16:02+0100", "description": "&lt;p&gt;&lt;strong&gt;Clinical Psychologist - Band 8a&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;0.8 wte – 30 hours a week&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(Applications from those eligible for appointment at Band 7 will be considered)&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a broad and varied post which provides an excellent opportunity to develop not only specialist clinical skills but affords the opportunity to develop and strengthen a broader range of skills and experiences. You will be working with patients, families and carers within a specialised and experienced multidisciplinary team based at Croydon University Hospital (CUH) as part of the community early supported discharge stroke team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;We are looking for an enthusiastic and motivated psychologist with experience of working in mental / physical health and an interest in neuro services. The clinical psychologist is an important part of the MDT and will be expected to meet with patients and families and carers to assess, formulate and provide the delivery of care. Additionally, the role requires consultation and liaison with the MDT, statutory, voluntary and private sectors. The psychology service offers a range of therapeutic interventions for patients including Cognitive Behaviour Therapy, Motivational Interviewing, Acceptance and Commitment Therapy, Compassion Focused Therapy and family work. This is a comprehensive post and mental health, physical health and family work is covered within the role. Opportunities for some experience of inpatient work may be provided.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;We offer excellent opportunities for professional and clinical development including service development, leadership, teaching and training. There are also extensive opportunities for involvement in research as we have an active research/service development portfolio.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;Professional supervision is provided and the successful candidate will have access to a psychology team based both in the CUH and also at the Broad Green Community Neuro Service. There is the opportunity for providing supervision as our service provides placements for clinical trainees, assistant psychologists and psychology students on a local Masters degree course.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;Applications are invited from HCPC registered and BPS chartered clinical psychologists.. Please note appointment may be offered at Band 7 level as a development opportunity if applicants do not have the necessary experience for appointment at Band 8a. The post holder would then be supported to develop the skills necessary to progress into Band 8a upon successful completion of defined competencies.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: tbc&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information and informal visits please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Laura Bach, Clinical Neuropsychologist 020 8401 3000 ext 4781&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; l.bach@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Annette Schwartz, Head of Neuropsychology on 020 8274 6487 annette.schwartz@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120967.PNG", "name": "Croydon Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120967"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CUH, Croydon", "postalCode": "CR7 7YE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3891", "longitude": "-.108758"}}, "title": "Clinical Psychologist - Stroke", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230567", "validThrough": "2020-11-18T23:59:59+0000"}