{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 per annum inc. High Cost Allowan"}}, "datePosted": "2020-10-28T14:01:23+0000", "description": "&lt;p&gt;This is an exciting opportunity to join the Urology Cancer Service within Surrey and Sussex Healthcare NHS Trust, becoming part of the current Urology Cancer CNS team.&lt;/p&gt;\n&lt;p&gt;The urology cancer multidisciplinary team is a dynamic and innovative team, focused on improving patient experience and continuing to develop the service.&lt;/p&gt;\n&lt;p&gt;You will act as a keyworker to an indentified group of patients with a urological cancer. Duties will include being part of breaking bad news discussions, providing specialist information and support to those with a urological cancer, running nurse-led clinics and implementing self-supported management pathways for suitable patients and administering intravesical treatments to patients with bladder cancer.&lt;/p&gt;\n&lt;p&gt;The successful CNS would be supported by the Macmillan Lead Urology Oncology CNS and work as part of the wider multi-disciplinary team which include consultants, MDT coordinator and urology nurses. It is a busy, friendly team with the nurse forming part of the wider cancer nursing team within the Trust. Support is provided for continued education and learning and monthly clinical supervision.&lt;/p&gt;\n&lt;p&gt;Essential requirements are RGN 4 years with 2 years recent relevant experience at band 6. A 1st level degree in a relevant subject is required or be working towards. You must have excellent communication skills and be able to work independently and as part of a team.&lt;/p&gt;\n&lt;p&gt;You will be part of a well-established Urology Cancer Team and Cancer Nursing department, offering a friendly and supportive work environment.&lt;/p&gt;\n&lt;p&gt;The main clinical activity occurs at East Surrey Hospital but some clinics are also held at Crawley and Horsham hospitals and you will be expected to travel between these sites when required.&lt;/p&gt;\n&lt;p&gt;An informal visit to the department is strongly recommended. Please call Kate Etheridge Macmillan Lead Urology Oncology CNS (Ext. 6159) to arrange this.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kate Etheridge Macmillan Lead Urology Oncology CNS&lt;/p&gt;\n&lt;p&gt;kate.etheridge@nhs.net 01737 768511 etx 6159&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 19th November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Surrey and Sussex Healthcare NHS Trust, Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Macmillan Urology Oncology Clinical Nurse Specialist - band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246884", "validThrough": "2020-11-11T23:59:59+0000"}