{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13448", "minValue": "13448", "unitText": "YEAR", "value": "Band 8a-8b"}}, "datePosted": "2020-10-23T09:51:03+0100", "description": "\n\n&lt;strong&gt;Head of Service - Community Nursing &lt;/strong&gt;\n&lt;strong&gt;&lt;em&gt;Band 8a-8b (D.O.E)&lt;/em&gt;&lt;/strong&gt;\n&lt;strong&gt;&lt;em&gt;St Martins Hospital, Bath and North East Somerset (with some local travel)&lt;/em&gt;&lt;/strong&gt;\n\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Full Time -37.5 hours&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are youresults-orientated and dynamic? Are youlooking to join an organisation as a Head of Service for District Nursing, focusing on professional growth and development, whilst ensuring you feel valued each and every day?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the Head of Service for District Nursing within Virgin Care Bath you’ll join a team who are focused on clinical excellence.&lt;/p&gt;\n&lt;p&gt;Your days will be rewarding and varied and include championing a patient-centric approach to operational delivery where the patient voice and experience is placed at the heart of decision making, internal joins are not noticed and hand offs between functions minimized.&lt;/p&gt;\n&lt;p&gt;Key responsibilities include, but aren’t limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing a service through partnership among the professional disciplines within the services, and through effective liaison with other statutory, private and voluntary sector services and others.&lt;/li&gt;\n&lt;li&gt;Ensuring high levels of engagement across the services, that a culture of openness and earning persists and continuous improvement is demonstrably embedded.&lt;/li&gt;\n&lt;li&gt;Identifying opportunities for service development, new business and changes in care pathways which support the strategic direction of BaNES services, including identification of any additional or external funding to support these&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will have a Registered Nurse or relevant clinical qualification/ HCPC registration, a leadership style based on engagement, coaching and development and an aptitude and confidence for working with a rapidly changing environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will feel valued as the Head of Service for District Nursing with Virgin Care, receiving access to exclusive rewards and benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AfC 20/21 salary and terms and conditions&lt;/li&gt;\n&lt;li&gt;Access to Virgin Tribe - our staff benefits scheme which grants you access to premier offers and discount off all Virgin products including flights, holidays, gyms and media, along with regular competitions and giveaways.&lt;/li&gt;\n&lt;li&gt;Feel the difference fund - a £100,000 fund to bring ‘Feel the difference’ to life, giving every employee a chance to have their thoughts and ideas heard.&lt;/li&gt;\n&lt;li&gt;Access to MyWellness – a health and lifestyle platform covering mental health awareness and support, healthy recipes &amp; activity challenges&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Virgin Care partner with the NHS and local authorities, providing high quality care for more than 1 million people each year up and down the country. We are an ambitious, forward thinking and passionate company who strive to make a real difference to people and our colleagues. We re-invest all of the money we earn to improve the experience, deliver ambitious transformations and empower all of our colleagues to make the changes, no matter how big or small, that make a real difference.&lt;/p&gt;\n&lt;p&gt;So why not click apply to find out where your journey with Virgin Care can take you! If you’d like to discuss the role further, please contact Mike Evans via email: Mike.Evans@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA2 5RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3578", "longitude": "-2.37292"}}, "title": "Head of Service - Community Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239897", "validThrough": "2020-11-06T23:59:59+0000"}