{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 per annum"}}, "datePosted": "2020-10-27T13:31:02+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;THIS POST IS FIXED TERM FOR 12 MONTHS DUE TO FUNDING&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;There is an exciting opportunity for an Assistant Psychologist to work with Children Looked After within Conwy Children’s Services. You will work closely with multidisciplinary colleagues from both Conwy Children’s Services and Conwy CAMHS, receiving supervision from the Principal Clinical Psychologist for Children Looked After. In this exciting service development, a wide range of experiences is possible, including direct and indirect working, assessment and intervention, bringing you into contact with children and young people and their carers. Responsibilities will also include contributing to creating impact reports for the service with a view to creating publishable research based upon this also.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We have strong links with the Bangor University Clinical Psychology Training Programme and there is an ongoing programme of training and development for the Social Work teams. This training programme is guided by the Principal Psychologist in partnership with the Children’s Services managers, and you will be able to participate in this by helping to design and deliver internal workshops as well as attending externally sourced training. Opportunities will include conducting reviews with carers and contributing to complex and comprehensive biopsychosocial assessments. Care will be taken to provide a diversity of opportunity when possible by working alongside CAMHS colleagues or within Education.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Closing Date: 10/11/2020&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Ceri Savage de-Lefitsz&lt;/p&gt;\n&lt;p&gt;Principal Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;ceri.savage.de.lifsitz@conwy.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Conwy Social Services, Coed Pella, Colwyn Bay, Colwyn Bay", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Assistant Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244734", "validThrough": "2020-11-10T23:59:59+0000"}