{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-11-03T08:45:42+0000", "description": "&lt;p&gt;An opportunity has arisen for an enthusiastic HCSW to join our Emergency Department Team within Urgent Care. The band 2 HCSW will support the Emergency Department in the care of patients,&lt;/p&gt;\n&lt;p&gt;Our Emergency Department has recently been rated as good in the past but we want to be outstanding, so we know there is much work to be done. What we are looking for are superb nurses who will help us achieve our shared aim and the absolute desire of providing the very best emergency care to our local population.&lt;/p&gt;\n&lt;p&gt;We want to employ motivated and dedicated staff who are seeking a career in emergency and urgent care nursing and have the aspiration and hunger to work in this acute and complex environment. We want nurses who will enhance the enthusiastic, dedicated and passionate teams who are ready and waiting to step up to the future exciting challenges of emergency nursing.&lt;/p&gt;\n&lt;p&gt;We understand that it’s down to the hard work, effort and dedication of our nurses that makes the difference for our patients, so in return we can offer you an new 6 million state of the art working environment. The new emergency department was opened in Dec 2014, and includes all individual high dependency stretcher rooms. A four bay resus room with state of the art equipment, a specific dementia suite, an area for close observation and a separate waiting area and specific rooms for paediatric patients,. We have our own xray facilities co located in the Emergency Department, and we now have the colocation of the brand new and innovative AAU department, which opened in May 2018&lt;/p&gt;\n&lt;p&gt;Emergency nursing is a greatly rewarding career with exciting future developments. The emergency department at Airedale General Hospital is the perfect location to begin or continue your emergency nursing career. As well as all the professional benefits, the locality has excellent provisions for the perfect home life; there are excellent transport links to the beautiful peaceful dales in one direction and the bustling city life of Leeds in the other. Both are literally on the door step.&lt;/p&gt;\n&lt;p&gt;Why would you settle for anything less, when you can have it all here at Airedale!!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mel Glover, Interim Matron for Emergency Department , 01535 294463 (melanie.glover@anhst.nhs.uk)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Airedale NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120636"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Airedale NHS Foundation Trust, Keighley, BD20 6TD", "postalCode": "BD20 6TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.898", "longitude": "-1.9627"}}, "title": "Emergency Department -Health Care Support Worker (Band 2)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253172", "validThrough": "2020-11-11T23:59:59+0000"}