{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 pa inc. HCA"}}, "datePosted": "2020-11-04T15:16:11+0000", "description": "&lt;p&gt;An exciting and stimulating opportunity is available for an experienced Occupational Therapist to develop a new model of level 3 rehabilitation within Brent.&lt;/p&gt;\n&lt;p&gt;If you are an organised, productive, innovative and positive clinician with a track record in progressive delivery of occupational therapy, we would like to hear from you&lt;/p&gt;\n&lt;p&gt;The successful candidate will work with the Therapy lead to run level 3 rehabilitation beds within Birchwood grange Nursing Home and community rehabilitation beds. They will have responsibility for moving patients between these services in a timely manner to support early discharges and rehabilitation in the correct setting for each individual. You will be required to have excellent time management and leadership skills to deliver effective and value-based patient care.&lt;/p&gt;\n&lt;p&gt;The unit will have 19 beds within the nursing home and up to 15 community patients. The service will be 7 day and involve skilled assessment, detailed treatment planning and implementation of complex discharge planning&lt;/p&gt;\n&lt;p&gt;The post is supported by a Therapy Lead and the Integrated Care Partnership Implementation lead for Brent. The team will be made up of 17 therapists from occupational therapy, physiotherapy, speech and language therapy, dietetics and doctors. The successful applicant will need outstanding communication skills and need to work with consultants, service managers and clinicians.&lt;/p&gt;\n&lt;p&gt;The role will require an inclusive, transparent, open approach to the role, where you are happy to be accountable to others and promote the concept of a leader who is challenging, whilst expecting to be challenged.&lt;/p&gt;\n&lt;p&gt;We are looking for a leader who is passionate about rehabiltiation and can create a culture of continuous improvement, where patient welfare is at the heart of all you do.&lt;/p&gt;\n&lt;p&gt;Post Requirements:&lt;/p&gt;\n&lt;p&gt;Take the lead role in the provision of a high quality Occupational therapy service within Birchwood Grange Nursing Home – Aster Unit Rehabilitation beds and the associated community patients. Assisting the lead Therapist and Integrated Care Partnership Lead with strategic planning.&lt;/p&gt;\n&lt;p&gt;Be autonomously responsible for assessing and treating own clinical caseload and defining and implementing individualised programmes of care.&lt;/p&gt;\n&lt;p&gt;Responsible for developing the Occupational Therapy within the specialist areas of level 3 rehabilitation care, identifying opportunities for and participating in partnership working within the Trust and with external agencies.&lt;/p&gt;\n&lt;p&gt;Manage a team of staff through day to day line management, supervision and appraisal, to ensure best practice and patient care.&lt;/p&gt;\n&lt;p&gt;Lead on clinical audit and research.&lt;/p&gt;\n&lt;p&gt;Support the wider operations of the Occupational Therapy service locally , in line with managerial structure and planning by the Head of Therapies.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Esther Slinn&lt;/p&gt;\n&lt;p&gt;Job title: Therapy lead Aster Unit&lt;/p&gt;\n&lt;p&gt;Email address: esther.slinn@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07384900636&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Aster unit, Birchwood Grange Nursing home, Harrow", "postalCode": "HA3 9UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5771", "longitude": "-.291124"}}, "title": "Principle Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256380", "validThrough": "2020-11-18T23:59:59+0000"}