{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-04T10:01:14+0000", "description": "&lt;p&gt;We have an exciting opportunity for a full time PCMT Officer to join the Performance and Contract Management Team within Primary Care Services.&lt;/p&gt;\n&lt;p&gt;The Performance &amp; Contract Management Team (PCMT) is responsible for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Operational management of GP System Suppliers&#39; service delivery, in terms of performance, process maturity and live operations&lt;/li&gt;\n&lt;li&gt;Management of the GMS Budget&lt;/li&gt;\n&lt;li&gt;Management of Primary Care broadband orders&lt;/li&gt;\n&lt;li&gt;Management of practice procurements, including practice merge and migrations, IT Software.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder will be expected to provide an administrative service to PCMT and be the first point of contact; receiving telephone / email enquiries. You will be working with a variety of Microsoft packages, particularly word and excel, as well as internal IT systems therefore we require excellent IT skills.&lt;/p&gt;\n&lt;p&gt;You will have experience of working in an office environment, with the ability to work to tight deadlines, and in changing and challenging situations, whilst maintaining attention to detail.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We liaise with internal and external suppliers daily so the post holder must have the ability to build and maintain effective working relationships and uphold a high level of professionalism at all times.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Specific responsibilities will include managing the PCMT inbox, electronic diary management, arranging, attending and taking minutes of meetings, data inputting and other administrative duties. The ability to manage and prioritise your own workload is key to this role&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Candidates will be required to work independently and as part of the team with a flexible approach to work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An understanding of ITIL service management is desirable&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Covid-19 pandemic has impacted the ways in which we work at NWIS - it me bay necessary to work from home for extended periods while still collaborating with colleagues to deliver high quality work at pace. It is likely that the post holder&#39;s presence on site at a designated South Wales NWIS office will be required on a regular basis as working practices return to normal.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We reserve the right to close this vacancy early should a sufficient number of applications be received. Therefore early applications are encouraged. &lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply. &lt;/p&gt;\n&lt;p&gt;Closing Date: 15/11/2020 &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:  Name: Julian RichardsJob title: Senior Specialist PCMTEmail address: julian.richards@wales.nhs.ukTelephone number: 029 21057052 &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125015.jpg", "name": "NHS Wales Informatics Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125015"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "TBC, TBC", "postalCode": "CF15 7QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5659", "longitude": "-3.27787"}}, "title": "PCMT Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255281", "validThrough": "2020-11-15T23:59:59+0000"}