{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-23T08:16:50+0100", "description": "&lt;p&gt;&lt;strong&gt;You will be required to work rotational shifts including days, nights, weekends and bank holidays to cover the 24 hour/7 days a week period. Please ensure you can meet this requirement before applying. Unfortunately we cannot offer set days/nights or permanent day or night contracts. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;With 4000 staff BSMHFT is one of the largest leading Mental Health Trusts in the UK, serving a culturally and socially diverse population every year, of 1.2 million people spread over 172 square miles.&lt;/p&gt;\n&lt;p&gt;Medium Secure Mental Health Services provide care and treatment for people who suffer with severe mental illness or personality disorder who also present risks to other people which can safely be managed within this level of security.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint highly motivated, compassionate nurses to join our team within the Tamarind Centre in Bordesley Green, Birmingham.&lt;/p&gt;\n&lt;p&gt;We have a number of vacancies. Ideally you will already be qualified and hold an NMC PIN but we are also recruiting student nurses due to qualify during 2018.&lt;/p&gt;\n&lt;p&gt;We offer a range of developmental opportunities to help you gain or consolidate skills in working in secure settings. At times challenging but always rewarding, you will gain opportunities to work closely with MDTs, develop leadership skills and skills in the assessment and treatment of service users.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDave AustinJob titleClinical Nurse ManagerTelephone number0121 301 0518 / 0820&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tamarind Centre, Birmingham", "postalCode": "B9 5PU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4757", "longitude": "-1.83908"}}, "title": "Band 5 Staff Nurse - Tamarind Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239662", "validThrough": "2020-11-06T23:59:59+0000"}