{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "65000", "minValue": "50000", "unitText": "YEAR", "value": "£50,000 to £65,000 (Depending on Experience)"}}, "datePosted": "2020-10-22T17:11:53+0100", "description": "&lt;p&gt;&lt;strong&gt;PracticeBusiness Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Work Pattern: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full-time/37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£50,000 to £65,000 pro rata/per annum (depending on experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Friday 13th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: Friday 20th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an ambitious and highly motivated manager, with strategic vision, to join this established and respected and forward thinking medical practice.We are looking for a conscientious candidate who can provide solid leadership and who has a sound knowledge of strategic business management, finance, planning and HR.&lt;/p&gt;\n&lt;p&gt;Richmond Medical Centre is a training practice with four GP Partners and three Salaried GPs, four ACPs, one Clinical Pharmacist and one Senior Physiotherapist, supported by a team of nurses, pharmacists and physios with a practice population of 18,000 patients.&lt;/p&gt;\n&lt;p&gt;We are looking for a team-player with a strong sense of public service who embraces change and is enthusiastic about working within a diverse team to strive for excellence in patient care. You will report to the GP Partners to structure and provide clinical service for our practice population and have a central role in optimising income for the practice.&lt;/p&gt;\n&lt;p&gt;Strong organisational and prioritisation skills are key. Remaining calm in pressured situations and being approachable to all staff is an essential characteristic, as are demonstrable human resources skills and a track record of managing teams. Experience of public facing work and budget management is essential. Knowledge of Primary Care desirable.&lt;/p&gt;\n&lt;p&gt;Scope will include forming effective relationships and constructive engagement with our Primary Care Network (PCN), NHS England, local Clinical Commissioning Group, Patient Participation Group and other relevant external bodies.&lt;/p&gt;\n&lt;p&gt;Governance and finance is fundamental to the role which includes overseeing the work of the practice finances. IT aptitude is essential with a willingness to learn new IT skills, delivery on audit, education and training, clinical governance policy and risk management as required by the Partners.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln", "postalCode": "LN6 9AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.187", "longitude": "-.595816"}}, "title": "Practice Business Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239470", "validThrough": "2020-11-13T23:59:59+0000"}