{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-04T12:16:11+0000", "description": "&lt;p&gt;&lt;strong&gt;Advanced Clinical Pharmacist (Surgery and Critical Care) / Teacher-Practitioner - are you an experienced pharmacist seeking a new challenge, making a positive difference to patient care and education of the pharmacy workforce.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a clinical pharmacist with an interest in Surgery and Critical Care to join the team of advanced clinical pharmacists delivering excellent clinical pharmacy support to Trust and &lt;span&gt;&lt;span&gt;work as a Teacher Practitioner on the Master of Pharmacy programme at the University of Lincoln.&lt;/span&gt;&lt;/span&gt; If you are interested in working clinically as well as being influential in the teaching and inspiration of pharmacy undergraduates then this could be the post for you. You will work two days a week at the University, contributing to the development and delivery of the degree content, and also arrange and support undergraduate placements in our department.&lt;/p&gt;\n&lt;p&gt;The post-holder would be responsible for providing an advanced clinical pharmacist service within the surgery directorate. This role requires excellent organisational and interpersonal skills, alongside sound clinical knowledge and relevant experience. We are a successful, innovative and forward-thinking department, with patient care at the centre of our decision making.&lt;/p&gt;\n&lt;p&gt;Our Trust gives Medicines Management and Medicines Optimisation high priority. The Pharmacy department has been successful in outsourcing outpatient dispensing, implemented electronic medicines management for all inpatient wards and commenced the roll out of electronic prescribing, which we plan to use in all inpatient and outpatient settings. Pharmacy has led the introduction of a unique electronic locking system for medicine cupboards which released significant nursing time and improves medicines security.&lt;/p&gt;\n&lt;p&gt;We have successfully implemented electronic prescribing for chemotherapy and will be rolling out electronic prescribing to all of our clinical areas shortly. We have completed works on a new state of the art Aseptic unit.&lt;/p&gt;\n&lt;p&gt;We actively use skill mix and role development to enhance job content and quality at all levels of the department. The department is supported by a robust pharmacy technician and pharmacy support worker structure that enables our Advanced clinical Pharmacists to be actively involved in and focus on clinical and professional aspects of patient care.&lt;/p&gt;\n&lt;p&gt;We provide a Medicines Reconciliation Service to all beds in the hospital which in turn supports the one-stop dispensing service and utilisation of patients own medicines.&lt;/p&gt;\n&lt;p&gt;This is a trust wide post where you will be responsible for providing specialist clinical pharmacist support to Surgery and Critical Care. You will be responsible for managing and supervising the duties of pharmacists, pre-registration pharmacists and ward support technicians in your clinical team. You will be responsible for supporting the medicines information services and training pharmacy staff to deliver these services. You will support the Clinical Pharmacy Team Manager in the delivery of the Pharmacy Vision and Values Strategy, together with the other Clinical Pharmacy Team Leaders. The Trust has acknowledged the high quality of the services delivered by our clinical teams but we recognise the need for further integration of our pharmacists into clinical specialties to deliver a more strategic perspective of medicines optimisation, and improve patient care.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to work flexibly in supporting the Trust’s directive of 7 day working, participating in rotas and/or shift working as necessary including weekend and bank holiday working.&lt;/p&gt;\n&lt;p&gt;Northern Lincolnshire combines rural charm with bustling picturesque market towns and villages. The area is well served by roads and rail, it is less than three hours to London, and Humberside Airport has daily flights to European airports. The famous Humber Bridge enables you to reach Hull and the ferry port for travelling to mainland Europe. Housing standards are high with prices below the national average.&lt;/p&gt;\n&lt;p&gt;Interview Date – TBC&lt;/p&gt;\n&lt;p&gt;Incentives for the right candidate may be available under the Trust Recruitment and Retention Incentive Policy.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;James Hargraves, Assistant Chief Pharmacist - Clinical Services and Governance&lt;/p&gt;\n&lt;p&gt;james.hargraves@nhs.net&lt;/p&gt;\n&lt;p&gt;03033303960&lt;/p&gt;\n&lt;p&gt;For queries relating to the University of Lincoln School of Pharmacy aspect of the role, please contact:&lt;/p&gt;\n&lt;p&gt;Josie Solomon&lt;/p&gt;\n&lt;p&gt;Head of the School of Pharmacy&lt;/p&gt;\n&lt;p&gt;JSolomon@lincoln.ac.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grimsby", "postalCode": "DN33 2BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5449", "longitude": "-.096217"}}, "title": "Advanced Clinical Pharmacist - S&amp;CC / Teacher Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255782", "validThrough": "2020-11-18T23:59:59+0000"}