{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38694", "minValue": "38694", "unitText": "YEAR", "value": "£38,694 pa"}}, "datePosted": "2020-11-06T15:46:18+0000", "description": "&lt;p&gt;&lt;strong&gt;SOUTH TEES HOSPITALS NHS TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THE JAMES COOK UNIVERSITY HOSPITAL&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Trust Grade Doctor in Critical Care Medicine (CT1/2)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work as a Trust Grade Doctor in Critical Care Medicine at The James Cook University Hospital (JCUH), which is rated by trainees as one of the best departments for teaching and training in critical care in the UK as per the 2020 GMC training survey. This is a 33 bedded critical care unit in a 1000 bedded Major Trauma Centre situated at the top of the beautiful North Yorkshire Moors. The unit treats 2600 critically ill patients per year with excellent outcomes. and these posts are suitable for trainees wishing to develop their clinical skills in a tertiary referral busy Critical Care Unit.&lt;/p&gt;\n&lt;p&gt;The post will support additional surge capacity to manage the pressures that are expected during winter 2020/21.&lt;/p&gt;\n&lt;p&gt;The James Cook University Hospital is one of the largest teaching hospitals in the North of England and is a Major Trauma Centre with its own helipad. It acts as the regional referral centre for critical care, particularly for major trauma, spinal injuries, neurocritical care and vascular and upper GI surgery.&lt;/p&gt;\n&lt;p&gt;The critical care unit is recognised for advanced training in ICM and has an active and well respected teaching programme and includes skills in ultrasound and echocardiography in critical care and will support FICE accreditation. Opportunities exist for publication and research in a very research active department. These posts are also ideal for candidates wishing to develop a career as a Trust Specialist in ICM (with or without a Medical or Anaesthesia speciality) for which posts approval exists.&lt;/p&gt;\n&lt;p&gt;Successful applicants will form part of a multi-disciplinary team working with a team of 22 consultants, 2 associate specialists, 14 middle grade Intensive Care Dr’s and a resident tier of advanced critical care practitioners and Dr’s from a mix of training backgrounds and trust grade posts. There are 4-5 resident Dr’s or ACCP’s on each shift and a minimum of 2 middle grades.&lt;/p&gt;\n&lt;p&gt;Short listed applicants are encouraged to contact Dr Michelle Carey (Clinical Director) or Dr Alex Scott (Faculty Tutor).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120671.jpg", "name": "South Tees Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120671"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "James Cook University Hospital, Middlesbrough", "postalCode": "TS4 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5518", "longitude": "-1.21482"}}, "title": "Trust Doctor Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260435", "validThrough": "2020-11-12T23:59:59+0000"}