{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21140", "minValue": "18620", "unitText": "YEAR", "value": "£18,620 - £21,140"}}, "datePosted": "2020-11-06T11:23:35+0000", "description": "&lt;h1&gt;Patient Coordinator&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Salary band:&lt;/strong&gt;  £18,620 - £21,140 per annum&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:            &lt;/strong&gt;Full-time (37.5 hours per week) and bank role available&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;        Buttress House, Seaton Burn, Newcastle upon Tyne&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;An exciting opportunity has arisen for patient focused Advisors/Call Handlers to support our busy National Team, based at our Head Office in Seaton Burn.&lt;/p&gt;\n&lt;p&gt;As a Patient Coordinator, you will work flexibly across all our services using our system, Insight+, and you will manage all calls and referrals into the service, assisting clients who may be experiencing a range of mental health conditions.   You will act as a liaison between the patient and the clinical team, ensuring that any relevant information is provided promptly to those who need it and all patients receive a positive, high-quality and seamless experience throughout.  Patient Coordinators will ensure that the patient&#39;s journey is managed efficiently, smoothly and in accordance with targets and agreed timescales at every step.&lt;/p&gt;\n&lt;p&gt;You will be joining Insight Healthcare, which is a highly regarded, national organisation and an experienced provider of IAPT services on behalf of the NHS. Our National Team is making its mark as a growing centre of clinical and administrative support. It is well established, offering high and low intensity interventions and counselling across the area. As a key member of the team, you will be valued for your contribution to maintaining Insight’s excellent reputation and helping us develop this further through innovative practice.&lt;/p&gt;\n&lt;p&gt;It is our mission to improve the mental health and wellbeing of the people we serve. You will play a key role in delivering this mission, and be committed to our core values which are at the heart of everything we do.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to join an organisation that has experienced recent growth and continues to seek new opportunities to further strengthen and build upon our excellent reputation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;About you&lt;/h2&gt;\n&lt;p&gt;We would love to hear from you if you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have excellent communication skills, and a passion to work in support of the NHS.&lt;/li&gt;\n&lt;li&gt;Are caring, empathetic and want to help make a real difference to people&#39;s lives&lt;/li&gt;\n&lt;li&gt;Are confident on the phone and willing to train to be able to provide guidance to patients in a calm and logical way&lt;/li&gt;\n&lt;li&gt;Are resilient and resourceful and able to manage calls that may potentially be distressing or an emergency&lt;/li&gt;\n&lt;li&gt;Have excellent customer service skills and confident telephone manner&lt;/li&gt;\n&lt;li&gt;Have at least 12 months of administrative experience&lt;/li&gt;\n&lt;li&gt;Are an inspirational team player with excellent communication skills and able to work collaboratively&lt;/li&gt;\n&lt;li&gt;Are computer literate and have good understanding of Microsoft Office&lt;/li&gt;\n&lt;li&gt;Are able to deliver required performance targets&lt;/li&gt;\n&lt;li&gt;Have an open and friendly persona and are experienced and confident in communicating with the public&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ideally you will have call handling experience and have worked with the public either in a healthcare setting, or in a contact centre environment. We need individuals who have the drive and passion to make a difference to people’s lives, but also the personal resilience to work in a high-pressured environment. Successful candidates will be able to work well within a team, have fast/accurate typing skills and a good standard of education. This role is suited to people who remain calm under pressure, good at problem solving and have excellent interpersonal skills, with an empathetic nature.&lt;/p&gt;\n&lt;p&gt;Your will be able to demonstrate the ability to deal with possible exposure to highly distressing or highly emotional circumstances and will be expected to participate on all relevant training courses appropriate to the role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“The thing I love most about the PC role is that with each call brings a different challenge. We’re constantly adapting and applying new strategies for different situations and I find that really exciting.”&lt;/em&gt; - &lt;strong&gt;Abby, Patient Coordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;How to apply&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;The information pack, job description and person specification are attached. It is essential that you read these documents prior to applying for this role.&lt;/li&gt;\n&lt;li&gt;For further information, please email Alfia Jaweed (People Adviser) via recruitment@concerngroup.org and she will be happy to help you with your queries.&lt;/li&gt;\n&lt;li&gt;Please apply through the NHS Jobs website. All correspondence will be through the email address or phone number(s) provided on your application form. To avoid missing our emails, please regularly check your junk mail folder.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The closing date for applications is 29th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The interview date is to be confirmed&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced DBS disclosure, which we will cover the cost of. If you have not heard from us within 6 weeks of applying, please assume you have been unsuccessful on this occasion. Concern Group reserves the right to close the vacancy early if a large volume of applications is received.        &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mental Health Concern", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130357"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle", "postalCode": "NE13 6DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0608", "longitude": "-1.63005"}}, "title": "Patient Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259400", "validThrough": "2020-11-29T23:59:59+0000"}