{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30258", "minValue": "26896", "unitText": "YEAR", "value": "£16 - £18 per hour"}}, "datePosted": "2020-10-14T09:34:18+0100", "description": "&lt;p&gt;We are looking for a dynamic self - motivated BANK RNLD/RMN to join Nelson House Hospital as the service progresses to include an exciting12 bedded L&amp;D assessment and treatment unit (ATU) in addition to thesuccessful 18 bedded Rehabilitation and Recovery service that is already based there.&lt;/p&gt;\n&lt;p&gt;It is a unique opportunity for a trained nurse to gain experience in two disciplines including Mental health and Learning Disabilityand to work as part of the clinical team,to influence positive change, and to ensure robust effective clinical leadership across the service lines.&lt;/p&gt;\n&lt;p&gt;It is essential the successful candidate has a proven track record of effective leadership skills, clinical expertise and knowledge of person centred recovery based interventions and has a passion for working with service users collaboratively, promoting independence in a Learning Disabilities and mental Health setting. The successful candidate would be expected to work closely with Service user’s carers and other professionals to provide the highest quality of care for our service users.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gosport, Hampshire", "postalCode": "PO13 0EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8125", "longitude": "-1.16009"}}, "title": "BANK RNLD /RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225499", "validThrough": "2020-11-13T23:59:59+0000"}