{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "65405", "minValue": "65405", "unitText": "YEAR", "value": "65,405"}}, "datePosted": "2020-11-06T14:49:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Job title: Senior Policy and Strategy Lead – NHS Race and Health Observatory &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Location: London or Leeds (Initially home based due to Covid19)&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Role: 1 x fulltime permanent 36.5 hours per week &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Salary: Grade A, £61,405 per annum FTE (plus £4,000 London weighting if applicable)&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Do you want to support national work to identify and address the poorer access, experience and outcomes experienced by BME patients, communities and healthcare staff?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Are you interested in developing and facilitating policy recommendations for sustained and meaningful change and improvement on race equality?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Would you like to support the practical implementation of those recommendations across healthcare?&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We would love to hear from you if you:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Are interested in tackling race inequality for patients, communities and the NHS workforce&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Enjoy engaging, listening, sharing and influencing &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Have experience in developing and supporting the implementation of policy recommendations&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Have excellent communication skills and negotiation skills &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Are improvement, behaviour change and positive outcomes driven &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Have experience of managing national race equality programmes, negotiating deliverables, meeting deadlines and delivering positive change &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Enjoy being part of a small team that is passionate about supporting healthcare organisations in tackling race equality&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Enjoy managing, supporting, developing and leading staff&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the Senior Policy and Strategy Lead you will work closely with the Director to support the delivery of the Observatory’s policy and strategy, ensuring that operational goals are achieved. They will be expected to build relationships at a senior level across the health system (including policy and research) and wider public services in support of the Observatory. &lt;br /&gt;&lt;br /&gt; You will support the development of key areas of national policy including:&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Establishing and delivering a far-reaching work programme which will reflect key priority areas, including the priorities of the NHS Long Term Plan, and ensure that they address the systemic inequalities affecting BME patients, communities and staff&lt;/li&gt;\n&lt;li&gt;Drawing on your expertise and knowledge in supporting the development and implementation of policy to influence change&lt;/li&gt;\n&lt;li&gt;Providing excellent and timely intelligence that can inform strategic and operational decision making at all levels&lt;/li&gt;\n&lt;li&gt;Leading on implementation of the Observatory’s strategy, you will input into business and action plans, helping to ensure that performance targets and strategic objectives are met&lt;/li&gt;\n&lt;li&gt;Developing and maintaining key stakeholder relationships internally and externally with academic, researchers, subject matter experts, and employers&lt;/li&gt;\n&lt;li&gt;Building rapport quickly, listen, contextualise, and influence senior managers and a variety of stakeholders&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Organisation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will receive an excellent benefits package, including 30 days annual leave, pension scheme, flexible working, salary sacrifice schemes and travel season ticket loans.&lt;/p&gt;\n&lt;p&gt;Equality, diversity and inclusion is at the heart of the NHS Confederation and we are actively seeking to increase diversity in our workforce through a process that is fair, open, consistent, and free from discrimination. We welcome all applications from all backgrounds and encourage applications from our BAME communities, our LGBTQ+ communities and from individuals who identify as being disabled, as well as all other protected characteristics. We are committed to building a diverse and inclusive company culture where all employees feel valued, respected, and acknowledged.&lt;/p&gt;\n&lt;p&gt;The NHS Confederation is committed to being a flexible employer. We understand the value and benefit to our employees being able to work flexibly to respond to changing circumstances and we want to ensure we do as much as possible to help support a work life balance and take care of employee health and wellbeing.&lt;/p&gt;\n&lt;p&gt;The NHS Confederation is a membership body that brings together and speaks on behalf of all organisation’s that plan, commission and provide NHS services with our members drawn from every part of the health and care system. At the NHS Confederation we are passionate about our values (voice, openness, integrity, challenge, empowerment and respect). These are supported by a set of behaviours that demonstrate the attitudes and approach we take to work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply please read the job description and complete the application form.&lt;/p&gt;\n&lt;p&gt;If you wish to discuss the post before applying, then please contact Habib.Naqvi@nhsemployers.org&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Application deadline: 22nd November 2020 (midnight)&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Interview date: 3rd December 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Confederation", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW1H 0DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5", "longitude": "-.133449"}}, "title": "Senior Policy and Strategy Lead – NHS Race and Health Observatory", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260209", "validThrough": "2020-11-22T23:59:59+0000"}