{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 per annum (incl of HCAS)"}}, "datePosted": "2020-11-04T09:30:36+0000", "description": "&lt;p&gt;&lt;strong&gt;MENTAL HEALTH SENIOR PRACTITIONER FOR INTEGRATED CARE DECISION MAKING (ICDM) and LOCAL ACCESS POINT (LAP) – Upton Hospital, Slough&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity if you are interested in integrated working.&lt;/p&gt;\n&lt;p&gt;As a member of the OPMH Service, you will represent BHFT mental health services at locality LAP/Cluster/IPCT meetings and be the main point of contact with local multidisciplinary and multi-agency LAP/Cluster/IPCT meetings. The purpose of these meetings is to deliver an integrated approach to care planning and decision making for frail patients with long term conditions, in line with the Integrated Care Decision Making (ICDM) initiative of the Frimley STP. You will use your specialist mental health knowledge to support formulation within the LAP and meetings as well as to support the multidisciplinary team to identify which patients discussed could benefit from mental health intervention.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to meet the multiple and often complex needs of frail patients with long term conditions who are discussed at LAP/Cluster/IPCT meetings through on-going joint assessment of health and wellbeing, including risk assessment, developing, implementing and evaluating intervention plans. You will help to identify the appropriate level of psychosocial support for individual patients. To achieve this, you will need to be aware of, and understand the full range of support available locally, from third sector through to secondary Mental Health provision.&lt;/p&gt;\n&lt;p&gt;To fulfil the requirements of the role, you will need to provide clinical leadership, and offer mental health expertise &amp; guidance to professional colleagues to support integrated decision making and care provision. You will also need to utilise advanced clinical skills and expert knowledge to deliver evidenced based person-centred interventions to a small caseload of people with complex mental health needs and offer practical advice and emotional support to their family carers.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to promote the benefits of integrated working to mental health colleagues and maintain strong links with Integration Leads across the network and colleagues from other agencies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For this special opportunity, you will require:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent knowledge and understanding of the health and social care systems and operating frameworks, clinical observations and the Mental Health Act.&lt;/li&gt;\n&lt;li&gt;Knowledge and experiencing of managing situations concerning safeguarding, risk management, complaints and investigations.&lt;/li&gt;\n&lt;li&gt;Specialist knowledge acquired through Masters level training /equivalent experience gained in an older peoples mental health service&lt;/li&gt;\n&lt;li&gt;An understanding of the wider health and social care system and how to operate across boundaries in the STP footprint&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of joining our team:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AfC Salary ranging from &lt;strong&gt;£40,681 to £46,295 &lt;/strong&gt;per annum inclusive of High Cost Area Supplement (HCAS)&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities and a strong emphasis on your work, life balance&lt;/li&gt;\n&lt;li&gt;Annual leave – 27 days for new starters, plus bank holidays. Increasing to 29 days after 5 years and 33 days after 10 years NHS service. Pro rata for part time staff&lt;/li&gt;\n&lt;li&gt;Excellent learning and development opportunities&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car&lt;/li&gt;\n&lt;li&gt;Generous maternity, paternity and adoption leave for eligible staff&lt;/li&gt;\n&lt;li&gt;Advanced IT enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent support and advice for staff.&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We would love to hear from you. We are happy to answer any questions that you may have. Please do not hesitate to contact Rashieda Ebrahim, 01753 635 220 or email: Rashieda.Ebrahim@berkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Slough", "postalCode": "SL1 2BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5054", "longitude": "-.59374"}}, "title": "Mental Health Senior Practitioner for Integrated Care Decision Making", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255188", "validThrough": "2020-11-22T23:59:59+0000"}