{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T11:16:04+0100", "description": "&lt;p&gt;&lt;strong&gt;Come and join us at CAMHS in Manchester!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Based at Prestwich Hospital, at our purpose built and newly renovated children&#39;s services.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have 4 wards based at Junction 17 and The Gardener Unit.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are passionate about our staff and the care which we provide to our young people.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Development and training opportunities are available within our service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why choose us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Greater Manchester Mental Health NHS Foundation Trust (GMMH) provides inpatient and community-based mental health care for people living in Bolton, the city of Manchester, Salford and Trafford and offer a wide range of specialist mental health and substance misuse services across Greater Manchester, the north west of England and beyond. We also provide Health and Justice Services in a number of custodial settings.&lt;/p&gt;\n&lt;p&gt;We have excellent opportunities to develop your nursing career with personal and professional development plans that enable you to grow and stay within the Trust.&lt;/p&gt;\n&lt;p&gt;We welcome applications from both RMN’s and RLDN ‘s, whether newly qualified or with years of experience.&lt;/p&gt;\n&lt;p&gt;If you are a dynamic individual with a positive “can do” attitude who wants to make a difference and pursue a rewarding career we want to hear from you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What makes us special?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our people are passionate, patient focused, positive individuals, who are committed to working together to help people live well.&lt;/p&gt;\n&lt;p&gt;We provide additional and bespoke support during the preceptorship period to enable you to develop the required skills, knowledge and competencies needed to succeed and feel confident in the role as Nurse in Charge and Primary Nurse on a ward.&lt;/p&gt;\n&lt;p&gt;Band 5 Nurses are active members of the ward team who deliver effective care and treatment to service users whilst playing an integral role within the multi-disciplinary team and are key players in service development for the specific client group and participate in specialist training and research opportunities.&lt;/p&gt;\n&lt;p&gt;We offer a great working environment, supportive managers, great teams and an attractive range of benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kate Tasker Interim Operational Manager 0161 358 1633&lt;/p&gt;\n&lt;p&gt;Kate.Tasker@gmmh.nhs.UK&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prestwich, .", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240259", "validThrough": "2020-11-06T23:59:59+0000"}