{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-29T11:00:19+0000", "description": "&lt;p&gt;CDDFT are investing an additional £3m into Therapy services across the University Hospital of North Durham (UHND), Darlington Memorial Hospital (DMH) and Bishop Auckland Hospital (BAGH). There has never been a better time to come and join us in developing high quality, evidence based and compassionate therapy services. We are recruiting posts within Physiotherapy, Occupational Therapy, Speech and language Therapy, Podiatry, Dietetics and nutrition, Clinical Psychology and Psychological Practitioners. Look out for all our adverts on NHS jobs.&lt;/p&gt;\n&lt;p&gt;As part of this MDT you will have the opportunity to influence the development of:&lt;/p&gt;\n&lt;p&gt;• Integrated pathways across the health and care system&lt;br /&gt;• Innovative new roles&lt;br /&gt;• Training to up skill our workforce&lt;/p&gt;\n&lt;p&gt;As Therapy services working together we will be able to ensure the care offered is individualised, evidenced based and builds a resilient workforce for the future.&lt;/p&gt;\n&lt;p&gt;We will also be investing further in our community services to further develop partnership working across the Health and Care System.&lt;/p&gt;\n&lt;p&gt;A unique opportunity has arisen to allow an expansion of our current inpatient service.&lt;br /&gt;We are looking to recruit 3 full time band 6 members of staff. This is an exciting opportunity to join our established Adult Physiotherapy inpatients team at Darlington Memorial Hospital. &lt;br /&gt;The successful applicant will work within this strong team and provide therapy within a 7 day service framework on an acute hospital site. The post holder will be expected to join the overnight on call service.&lt;/p&gt;\n&lt;p&gt;The roles require dynamic physiotherapists who will rotate between orthopaedics, respiratory/ITU, elderly/medical wards to provide exemplary care to the patient. The successful applicant will utilise their outstanding organisation and communication skills in order to support with the assessment, rehabilitation and discharge planning from the acute setting into the community whilst achieving outstanding physiotherapy outcomes.&lt;/p&gt;\n&lt;p&gt;You will work alongside Physiotherapy staff and the wider MDT and your development will be supported by senior staff working within these areas. The post holder will be responsible for supervising band 2 and 3 physiotherapy assistants and band 5 physiotherapists&lt;/p&gt;\n&lt;p&gt;Darlington Memorial Hospital offers an exciting opportunity to develop your acute Physiotherapy skills. The trust has robust induction training and essential training programme and we are very committed to providing a comprehensive in-service training programme which the post holder will be encouraged to take an active part in developing, leading and benefitting from sessions towards maintaining CPD. The team are expected to cover colleagues when required across sites.&lt;/p&gt;\n&lt;p&gt;Please contact Kelly Huitson khuitson@nhs.net or Janette Hewitson janette.hewitson@nhs.net for more information regarding the post at DMH&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington Memorial Hospital, Hollyhurst Road, Darlington", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Band 6 Rotational Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248001", "validThrough": "2020-11-12T23:59:59+0000"}