{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T13:31:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title: Interventional and Cath Lab Radiographer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: Radiology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;&lt;strong&gt;New Cross Hospital, Wednesfield Road, Wolverhampton, WV10 0QP&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Grade: &lt;/strong&gt;Band 6 for qualified applicants or band 5 under annex 21 of agenda for change for trainees&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;37.5 hours per week (part time/job share considered)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract:&lt;/strong&gt; Substantive&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Details: &lt;/strong&gt;We are looking for enthusiastic, motivated radiographers to join our dynamic, friendly, multi-disciplinary teams in the Cardiac Catheter Labs and Interventional Radiology Department.&lt;/p&gt;\n&lt;p&gt;We have recently refurbished all of our Cath Labs and we are using state of the art Philips equipment in both departments. You will be given the opportunity to rotate through the Catheter labs and Interventional Radiology, broadening your skill set and bringing you to the forefront of delivering first class care in these specialty departments.&lt;/p&gt;\n&lt;p&gt;Previous experience in these areas is desirable, but it is by no means essential. We will actively support development and training for radiographers who have a desire to work in these specialty areas but may not yet have the necessary skills. You will train under annex 21 of agenda for change with uplift to a band 6 upon successful completion of training. Please ask for more details about the training plan if you are interested.&lt;/p&gt;\n&lt;p&gt;You must have a degree or equivalent qualification in Diagnostic Radiography, and be registered with the HCPC. We ask that you have a minimum of 12 months experience as a band 5 radiographer before applying.&lt;/p&gt;\n&lt;p&gt;Hours will include weekends and bank holidays and successful candidates will be required to participate in on-call rotas.&lt;/p&gt;\n&lt;p&gt;It is important that your application meets the minimum requirements of the person specification, as the Trust will shortlist against these details. Please refer to the attached Job Description and Person Specification before making your application.&lt;/p&gt;\n&lt;p&gt;You will be notified electronically whether your application was successful. &lt;br /&gt;Applications which are successful will be invited to interview using the email address provided within your application. Please check your email account regularly.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSharon DhaddaJob titleSuperintendent RadiographerAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal enquiries to&lt;em&gt;:&lt;/em&gt;&lt;/strong&gt;&lt;em&gt; Sharon Dhadda, Superintendent Radiographer, 01902 694293&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Cross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Band 6 Radiographer - Cath Labs and Interventional Radiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250370", "validThrough": "2020-11-15T23:59:59+0000"}