{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-10-13T14:54:39+0100", "description": "&lt;p&gt;&lt;strong&gt;Nursing Band 5 – Critical Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title: Staff Nurse&lt;/strong&gt; – Critical Care&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; East Suffolk &amp; North Essex Foundation Trust (ESNEFT)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wards Covered:&lt;/strong&gt; Critical Care&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;Band 5&lt;/p&gt;\n&lt;p&gt;Basic: £19.38&lt;/p&gt;\n&lt;p&gt;Saturday/Night: £22.46&lt;/p&gt;\n&lt;p&gt;Sunday/Bank Holiday: £27.15&lt;/p&gt;\n&lt;p&gt;We are one of the largest organisations in the Eastern region. Our scale provides exciting opportunities for development, innovation, research, education, and training.&lt;/p&gt;\n&lt;p&gt;We want the best staff. You want to make a difference.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We currently have some unique and exciting opportunities within Ipswich Hospital as a part of East Suffolk &amp; North Essex NHS Foundation Trust which will allow the successful candidates to gain regular shifts and valuable experience within a unique environment. We are now the largest NHS organisation in the region providing hospital and community care services for Ipswich, Colchester, and surrounding areas. This is a great opportunity to get involved with a new &amp; growing NHS Organisation.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have both Flexible Ad Hoc shifts available and Short-Term Placement opportunities available within a variety of locations.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;These are fantastic opportunities for talented Nurses who share the trusts vision be on the leading edge of healthcare for the benefit of their patients. Ipswich Hospital is a centre of clinical academic excellent where new healthcare professionals are being training and cutting-edge developments being up into practice.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locations covered:&lt;/strong&gt;Ipswich &amp; Colchester&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have a minimum of 6 months paid experience at Band 5 level within a hospital in a similar role in the last 2 years.&lt;/li&gt;\n&lt;li&gt;Be an enthusiastic and highly motivated Band 5 Registered Nurse, to work Bank shifts in the CCU (Critical Care Unit) at ESNEFT Trust&lt;/li&gt;\n&lt;li&gt;Comply with NMC Professional Registration and keep up to date with current nursing practices&lt;/li&gt;\n&lt;li&gt;Undertake nursing assessment and evaluation to enable development of appropriate plans of care based on the needs of the individual&lt;/li&gt;\n&lt;li&gt;Work well within a team to promote and provide high quality care and have excellent interpersonal and communication skills.&lt;/li&gt;\n&lt;li&gt;Ensure safe administration of medication in accordance with NMC and CHS policies&lt;/li&gt;\n&lt;li&gt;Ensure accurate records are kept in accordance with CHS policy and NMC guidelines&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are committed to giving you more flexibility and control over your working life. By joining the NHSP bank you will gain access to the best choice of available shifts.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional, caring, and reliable service you will have access to the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of shifts at your Trust&lt;/strong&gt; – Access to shifts before they are available to agency&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working to suit your lifestyle &lt;/strong&gt;– Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance for every shift you work &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book and manage your shifts on the go&lt;/strong&gt; – Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 0333 014 4282&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Register today for various flexible shifts.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with Anne-Marie Davies, Trust Recruitment Coordinator for East Suffolk &amp; North Essex Trust on 07468710081 or email annemarie.davies@nhsprofessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Registered Nurse - Critical Care Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224770", "validThrough": "2020-11-15T23:59:59+0000"}