{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum pro rata"}}, "datePosted": "2020-10-20T11:02:23+0100", "description": "&lt;p&gt;&lt;strong&gt;How would you like to work as part of a high performing Health Visiting Service where health visitors still deliver all 5 of the core contacts as part of the Healthy Child Programme? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If so then come and join us at Oxford Health where we really value and celebrate the role of health visitors!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently looking to appoint Band 6 Health Visitors in the Didcot, Thame, and Abingdon Health Visiting teams.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In addition to our universal offer, we have many exciting and rewarding features within our service. A few examples include health visitors still being able to undertake listening visits as well as leading on the delivery of perinatal mental health support groups, a teenage pathway led by health visitors working closely with our Family Nurse Partnership Team, breast feeding champions who ensure we achieved BFI stage 3 and strive to maintain the high standard of breastfeeding support we offer. As well as these examples, all our health visitors have the opportunity to join a high impact work stream (covering the 6 Department of Health High Impact Areas) which enables them to contribute to shaping the future of the health visiting service in Oxfordshire.&lt;/p&gt;\n&lt;p&gt;You will be leading the delivery of the Healthy Child Programme as part of a team that includes Nursery Nurses, Community Staff Nurses and Administrative Support Workers, with additional support from experienced Locality Team Leaders.&lt;/p&gt;\n&lt;p&gt;We offer an exceptional and robust package of training, mentorship, and supervision and in the last CQC inspection Oxford Health was rated outstanding for Children’s Services.&lt;/p&gt;\n&lt;p&gt;We would welcome applications from experienced and newly qualified Health Visitors.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Michelle.Wiltshire&lt;/p&gt;\n&lt;p&gt;Job title: Locality Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: michelle.wiltshire@oxfordhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07795642868&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Didcot, Abingdon and Thame", "postalCode": "OX11 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6065", "longitude": "-1.24764"}}, "title": "Health Visitor - Didcot, Abingdon, Thame", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233997", "validThrough": "2020-11-15T23:59:59+0000"}