{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum/Pro rata"}}, "datePosted": "2020-11-03T13:16:09+0000", "description": "&lt;p&gt;&lt;strong&gt; Successful candidates will be invited to an Assessment Day on Friday 18th December 2020. Please note this will be either a morning or afternoon session to be confirmed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cornwall Partnership NHS Foundation Trust (CFT) are pleased to offer a vacancy for a Band 5 Staff Nurse on our newly instated Community Assessment and Treatment Unit (CATU) at Camborne and Redruth Hospital.&lt;/p&gt;\n&lt;p&gt;Our unit has treatment and assessment facilities for 20 people and is designed to help keep patients safe and well and prevent admissions to Cornwall’s acute hospital in Truro.&lt;/p&gt;\n&lt;p&gt;In this ever changing situation we find ourselves in, now more than ever it is important that we investigate new ways of working and take our NHS services to the next level. Here at CFT we are committed to this very task and we are seeking a colleague who shares our passion for developing new and innovative ways of caring for our communities, who wants to help lead from the front in transforming Cornwall’s NHS services.&lt;/p&gt;\n&lt;p&gt;For this reason we are investing heavily in the education, training and development of our staff within our hospital so there is no better time to take yourself out of your comfort zone and get on board with these exciting new developments.&lt;/p&gt;\n&lt;p&gt;If you are a registered nurse and interested in more information about the opportunities available or up for testing the waters in this innovative new setting then please get in touch for a chat or to arrange your “taster visit” to our CATU site where you will be able to see first hand the kind of fast paced, dynamic environment you could be working in.&lt;/p&gt;\n&lt;p&gt;Just want to get started? Click apply!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmy DawesJob titleWard ManagerEmail addressamy.dawes2@nhs.netTelephone number07713178885Additional contact information&lt;/p&gt;\n&lt;p&gt;Sue Greenwood, Matron 07825754153&lt;/p&gt;\n&lt;p&gt;Amy Dawes, Sister 07713178885&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Camborne &amp; Redruth", "postalCode": "TR15 3ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2294", "longitude": "-5.24451"}}, "title": "Staff Nurse  - Camborne/Redruth - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254108", "validThrough": "2020-11-23T23:59:59+0000"}