{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro-rata"}}, "datePosted": "2020-10-30T13:45:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Hours: Up to 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We currently have a new opportunity for a Staff Nurse (Band 5) to join our friendly Haemodialysis Team at York Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We welcome applications from both Pre-registered and Registered Nurses.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We pride ourselves with striving to attain the highest standards of care and to continually improve every aspect of our service delivery in a continually changing environment.&lt;/p&gt;\n&lt;p&gt;If you are looking for an area to gain a great grounding knowledge, or a place to build upon your existing skills, this is the opportunity for you. This opportunity will expose you to acute, complex nursing care, which is both rewarding and challenging in a supportive environment, where you will get as much out as you put in.&lt;/p&gt;\n&lt;p&gt;For qualified nurses looking for a change, look no further. The Trust offers the prospect of being able to demonstrate experience and skills in a fast paced, ever changing environment, as well as access to a huge range of learning and training opportunities and support from a ward based mentor.&lt;/p&gt;\n&lt;p&gt;We also offer a number of other benefits for our Band 5 Staff Nurses which include the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Pre-Registered Nurses who have completed their degree and are awaiting NMC registration will be paid at AfC Band 5.&lt;/li&gt;\n&lt;li&gt;You may be eligible for financial support of up to £750 if you are relocating to join our Trust.&lt;/li&gt;\n&lt;li&gt;Refer a friend scheme; once employed by York Teaching Hospital you could receive a £250 payment if you refer a nurse to us that takes up employment in our Trust (paid after the new starter completes 3-months in post).&lt;/li&gt;\n&lt;li&gt;We also offer a wide range of benefits which you can view by visiting the Trust&#39;s dedicated Staff Benefits pages.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our unit serves both chronic and acute patients from York and the surrounding area as well as offering some holiday dialysis.&lt;/p&gt;\n&lt;p&gt;Our team is a strong supporter of patient empowerment with shared care. We have a 4 bedded shared care area where patients can learn to self-dialyse.&lt;/p&gt;\n&lt;p&gt;The unit is open from 06.30am to 23.00pm, 6 days per week. Closed on a Sunday.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Melanie Kirby - Sister &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Email: melanie.kirby@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: (01904) 725378&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Geri Metcalf / Jincy Alias - Deputy Sisters&lt;/p&gt;\n&lt;p&gt;Tel: (01904) 725372.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York Teaching Hospital", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Staff Nurse - Haemodialysis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250393", "validThrough": "2020-11-15T23:59:59+0000"}