{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20404", "minValue": "20404", "unitText": "YEAR", "value": "£20,404"}}, "datePosted": "2020-11-02T11:35:21+0000", "description": "&lt;p&gt;Could you see yourself supporting us to live fulfilled lives? Do you enjoy going on day trips, cinema trips and coffee &amp; cake afternoons? Would you be able to inject some liveliness into the boring tasks we need a little support with such as cleaning and cooking? Can you see yourself encouraging us to build relationships with people in our local community and helping us maintain relationships with those important to us?&lt;/p&gt;\n&lt;p&gt;In this service we would like someone who can communication in many different ways, someone who is friendly, respects other and helps us look our best at all times with a smile on their face.&lt;/p&gt;\n&lt;p&gt;Does this sound like you, if so we would love to meet you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt; £16,778 based on 37 hours / £20,404 based on 45 hours / £8.72 per hour&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;Full-Time / Part-Time / Bank&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Description&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Turning Point, we support people with Learning Disabilities across England.&lt;/p&gt;\n&lt;p&gt;As a Support Worker, you will make a real differenceto people&#39;s livesas you improve their daily living skills. Passionate about people, you will enjoy the scope and support to enhance your own life and career too, as you gain the experience and training you need to progress with us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where will I be working?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our service inThurcroft needs people who are team players and can inspire individuals with a learning disability to remain independent. No one day is the same and duties will vary from support with day to day living, to supporting individuals to attend doctors&#39; appointments, helping with medication and personal care as well as lots of fun, like days out and holidays. It&#39;s a busy role, with a moderate requirement to support with manual handling, and you must be able to work on a Rota basis to provide some weekend and night cover.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shift Patterns&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The support is a 24 hour service, therefore flexibility is essential. You will be working a range of shifts from 7:00/8:00 am to 2:00/3:00pm and 2:00/3:00pm to 9:00/10:00pm,sleep ins or waking nights, some weekends.&lt;/p&gt;\n&lt;p&gt;Please note that working hours may vary from home to home.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will I be doing?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a hands-on job in which no two days are the same. Some of your duties will involve:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Promoting the independence of people we support&lt;/li&gt;\n&lt;li&gt;Supporting a full range of daily activities including cleaning and cooking, days out or going away on holiday&lt;/li&gt;\n&lt;li&gt;Arranging activities in the home and in the local community&lt;/li&gt;\n&lt;li&gt;Developing residents&#39; life skills and personal interests&lt;/li&gt;\n&lt;li&gt;Helping residents stay safe and healthy&lt;/li&gt;\n&lt;li&gt;Assisting with personal care needs&lt;/li&gt;\n&lt;li&gt;Manual handling&lt;/li&gt;\n&lt;li&gt;Supporting people with medication&lt;/li&gt;\n&lt;li&gt;Ensuring record keeping is maintained to the required standard at all times and contributing to service monitoring requirements&lt;/li&gt;\n&lt;li&gt;Supporting with Hydrotherapy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What skills and qualities do I need to have?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Whilst knowledge of learning disabilities and complex needs would be beneficial, it isn&#39;t essential. What is essential is that you are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Passionate, caring and enthusiastic&lt;/li&gt;\n&lt;li&gt;Flexible, patient and non-judgemental&lt;/li&gt;\n&lt;li&gt;A great team player with lots of energy&lt;/li&gt;\n&lt;li&gt;Able to demonstrate good communication skills&lt;/li&gt;\n&lt;li&gt;Able to complete the physical aspects of the role such as manual handling&lt;/li&gt;\n&lt;li&gt;Willing to learn and complete training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why Turning Point?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What benefits will I receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive Learning and Development opportunities - we are Investors in People Silver accredited&lt;/li&gt;\n&lt;li&gt;28 days holiday, increasing with each year of service until 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including, bike to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive Pension and Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme and access to online Health and Wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work/life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts including Cinema, Groceries and Gym&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thurcroft, Rotherham", "postalCode": "S66"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4211", "longitude": "-1.22271"}}, "title": "Support Worker - John Street - Thurcroft -Learning Disabilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251840", "validThrough": "2020-12-01T23:59:59+0000"}