{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a. pro rata"}}, "datePosted": "2020-11-05T16:46:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are seeking an enthusiastic Biomedical Scientist to join the Cambridge University Hospitals, Histopathology Department. The department provides a Histopathology and Diagnostic Cytology service for the Cambridgeshire area. The laboratory processes approximately 90,000 histological cases and 9,600 non-gynaecological cases per year. The department is well equipped, fully computerised and UKAS accredited to ISO 15189 standards.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be joining us at a time of exciting change, as the department has recently expanded into a newly refurbished laboratory space.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will work as part of a large and enthusiastic team, contributing to a wide variety of procedures in a busy environment. Tasks require a meticulous attention to detail and a high level of manual dexterity. Patient focus and a drive for quality, with an understanding of the importance of accurate test results are essential. You will be highly organised with good time management skills and self-motivation, but also need a flexible approach to work well within a team. Experience of diagnostic Histopathology laboratory work is desirable but not essential as full training will be provided.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be involved in the training and supervising of the Biomedical Support Workers in the department. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This vacancy will close on 12th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are due to be held week commencing 23rd November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;/p&gt;\n&lt;p&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;/p&gt;\n&lt;p&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/p&gt;\n&lt;p&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSimon LoydallEmail addresss.loydall@nhs.netTelephone number01223 250774&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes hospital - Division B, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258634", "validThrough": "2020-11-12T23:59:59+0000"}