{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive"}}, "datePosted": "2020-10-30T10:01:40+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5, Staff Nurse, Pain Management Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;This position is based at the Pain Management Centre at Cleveland Street&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Pain Management team is looking for a highly motivated and enthusiastic individual with an interest and/or experience in pain management.&lt;/p&gt;\n&lt;p&gt;This is a specialist centre for the evaluation, diagnosis and treatment of chronic pain. The service has strong links with the complex pain team based at the UCH site and cancer pain services. We also have an acute pain service at the National Hospital for Neurology and Neurosurgery and strong links with the UCH acute pain services.&lt;/p&gt;\n&lt;p&gt;You will be joining the pain management team as a staff nurse with a focus on the care of patient’s pre and post procedures for the management of chronic pain.&lt;/p&gt;\n&lt;p&gt;You will also have the opportunity to develop and enhance your skills in the provision of nurse led care for patients within our procedure and outpatient services. Which includes working in the nurse led infusion clinic and conducting telephone review clinics for patient following their treatments.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For this post you will be required to be an excellent team worker with good communication skills. &lt;/span&gt;&lt;span&gt;The role requires you to work closely with a team of doctors, nurses, psychologists and physiotherapists and administration teams.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Our department is committed to providing staff with the experience to develop specialist skills and knowledge in pain management and as part of that commitment we run our own clinical scientific meetings and invite both in-house and outside speakers to promote the education of staff working within the speciality.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note: This post will go through Nursing Assessment Test Centre (NAT). Successful at interview round candidates must after complete - Drugs Calculation Test and an unseen (virtual) Scenario based-Assessment.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For an informal discussion about this role, please contact Artemis Ghiai, Advanced Nurse Practitioner, direct line 020 3448 3301&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Staff Nurse - Pain Management", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249595", "validThrough": "2020-11-06T23:59:59+0000"}