{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-30T15:15:57+0000", "description": "&lt;p&gt;1 x Band 8a Senior Clinical Pharmacist – CARE Point&lt;/p&gt;\n&lt;p&gt;We have a great opportunity for pharmacists wishing to develop their careers as part of our progressive team, with a national reputation for innovation and development. Northumbria Healthcare NHS Foundation Trust has a diverse and supportive clinical pharmacy team with a proven track record of providing high quality, patient-centred care. With the highest proportion of pharmacist prescribers in the country, our clinicians use their skills to support patients wherever they are across primary and secondary care (hospital, home, or care home).&lt;/p&gt;\n&lt;p&gt;Our team offer you a unique clinical, patient-facing role that allows pharmacists to develop or maintain their skills within primary care and hospital pharmacy. Job plans will be structured to ensure all pharmacists can work across both sectors to enable a true system wide approach to patient care, and designed around you to make the most of your skill set.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic pharmacist to support CARE Point, a joint service provided by North Tyneside Council and Northumbria Healthcare NHS Foundation Trust. You will work as part of a multidisciplinary team which includes community matrons, general practitioner, consultant geriatrician, physiotherapy, occupational therapy, community psychiatry and dietetics. The service works with older people across North Tyneside to determine how they can best be supported to stay at home safely, delivering appropriate care within the community and reducing the need for hospital admissions. Following a holistic assessment, the CARE point team will agree interventions and care planning for frail elderly patients in the community. You will be required to carry out domiciliary medication reviews and support the CARE point team with leadership on medicines optimisation. You will work collaboratively with hospital, general practice and community pharmacy and provide patient-centred care in order to avoid unnecessary admissions, prevent further deterioration and optimise health and wellbeing.&lt;/p&gt;\n&lt;p&gt;This role is pivotal to improving the quality of care for patients and so requires motivation and passion to deliver an excellent service across primary care and hospital. You will also be supported to develop your clinical skills as an independent prescriber (if that qualification is not already held) and will undergo a learning needs assessment to plan your development and further training needs.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;We are looking to help our population to get the best value from their medicines. We would love to help tailor your career to deliver our ambition&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date: 15th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSteven BarrettJob titleLead Clinical Pharmacist - Integrated Care TeamEmail addresssteven.barrett@northumbria-healthcare.nhs.ukTelephone number0191 293 2757Additional contact information&lt;/p&gt;\n&lt;p&gt;Tel. 0191 293 2729&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Tyneside General Hospital, North Tyneside", "postalCode": "NE29 8NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0257", "longitude": "-1.46636"}}, "title": "Senior Clinical Pharmacist - Primary &amp; Acute Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250702", "validThrough": "2020-11-15T23:59:59+0000"}