{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-27T10:31:16+0000", "description": "&lt;p&gt;This is a fixed term post for 9 months. If you are a SBUHB employee youwill need to secure permission from your line manager before applying for this post.&lt;/p&gt;\n&lt;p&gt;The Nuclear Medicine Service based at Singleton Hospital comprises a purpose-built Radiopharmacy, an extensive Bone Densitometry service, a dual-head SPECT camera and a state-of-the-art SPECT/CT gamma camera imaging service. We provide radiopharmaceuticals and scientific support to five gamma cameras currently.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a Senior Nuclear Medicine Clinical Technologist at Band 6. The Technologist will be expected to provide technical support across the full range of Nuclear Medicine Services, and in particular support the Imaging and DXA work. The DXA service is provided across 3Health Boards including Swansea Bay, Hywel Dda and Cwm Taf.&lt;/p&gt;\n&lt;p&gt;The imaging section undertakes a variety of scans including myocardial perfusion, MUGA, sentinel lymph node, white cell, renal, bone and other non-routine techniques. The clinical technologist will be expected to offer support across a full range of patient services including Radiopharmacy and non-imaging scans, including GFRs.&lt;/p&gt;\n&lt;p&gt;Nuclear Medicine at Singleton is a friendly and progressive service. The Department is accredited by IPEM for training and has links to Swansea University through research and formal academic teaching. Continuing professional development of all staff is encouraged and supported. Full training will be provided to suitable candidates. The selected candidate will be required have RCT or HCPC professional registration or to achieve this within the first year of employment.&lt;/p&gt;\n&lt;p&gt;If a suitable candidate with the necessary level of experience cannot be identified, we will consider offering the post at a band 5.&lt;/p&gt;\n&lt;p&gt;The ability to travel between sites in a timely manner is essential.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Monica Martins Clinical Team LeadMonica.Martins@wales.nhs.uk01792 285 295Additionalcontact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Singleton Hospital, Swansea", "postalCode": "SA2 8QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6092", "longitude": "-3.98528"}}, "title": "Senior Nuclear Medicine Clinical Technologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244008", "validThrough": "2020-11-10T23:59:59+0000"}