{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 p.a excl. LZ"}}, "datePosted": "2020-11-05T15:46:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Guy’s &amp; St Thomas’ NHS Foundation Trust or Trust Wide&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant in General Genetics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;from £82,096 - £110,683 p.a excl. LZ&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time – 10PAs &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are pleased to be able to advertise for a full-time Consultant Clinical Geneticist with clinical, training and teaching experience in general genetics, prenatal diagnosis and preimplantation genetic diagnosis. The new 10 PA post has been created in response to a significant increase in referrals and to reconfiguration within the current consultant team. The successful candidate will join a team of 12 consultants, 4 honorary consultants and 23 genetic counsellors. Provision of secretarial and administration team support for this post is already in place. The post holder will be expected to undertake general genetics clinics and will be encouraged to develop an area of specialist expertise.&lt;/p&gt;\n&lt;p&gt;The department of Clinical Genetics provides a comprehensive clinical and diagnostic service to a population of nearly five million. The department is part of the Specialist Ambulatory Services directorate (Genetics, Rheumatology, Infection, Sexual and Reproductive Health, HIV, Lupus, Dermatology and Allergy) at Guy’s and St. Thomas’ NHS Foundation Trust, and the Department of Medical and Molecular Genetics, School of Basic and Medical Biosciences, King’s College London. Guy’s and St. Thomas’ NHS Foundation Trust is made up of two of London’s best known teaching hospitals and employs over 13,650 staff and have over 2 million patient contacts a year. The Trust has highest number of national Highly Specialist clinics and is actively involved in clinical research, leading nationally in the number of clinical research trials and patients recruited.&lt;/p&gt;\n&lt;p&gt;The Genetics Centre has major interests in dysmorphology, cardiac genetics, neuromuscular and renal disorders, pre-implantation genetic diagnosis, cancer genetics and genetic counselling. The department has a reputation for delivering innovative care, with fully integrated clinical and laboratory services based on one site and benefiting from close links with extensive research groups. It also has nationally and internationally recognised expertise in rare diseases, with clinical staff integrating and leading teams in the state of the art Rare Disease Centre, designed in partnership with patients and their families to accommodate specialist needs and cater for paediatric, transition and adult clinics. Clinical Genetics staff are at the forefront of translational medicine, leading and collaborating with multiple national and international clinical trials, including intervention clinical commercial trials. The department also actively collaborates with the National Institute for Health Research (NIHR) Biomedical Research Centre (BRC) at Guy’s and St Thomas’ NHS Foundation Trust and King’s College London, working to develop and deliver new medicines and diagnostics to patients, drive research and innovation into the NHS, and provide national systems leadership for maximum impact to patients.&lt;/p&gt;\n&lt;p&gt;The Department of Medical &amp; Molecular Genetics, which supports collaboration with the Clinical Department, has strong research interests in epigenetics, cancer, complex diseases and inflammation, immunogenetics, neurodevelopment and epidemiology, using new technologies in genomics and cell biology, and expertise in statistics and bioinformatics to explore human genetic variation and its relationship to human disease. The Department leads on multiple national and international research studies, with important contributions to Genomics England.&lt;/p&gt;\n&lt;p&gt;Guy’s and St. Thomas’ NHS Foundation Trust and King’s College London integrate King’s Health Partners, an Academic Health Sciences Centre where world-class research, education and clinical practice are brought together for the benefit of patients. KHP aims to translate cutting-edge research and existing best practice into excellent patient care.&lt;/p&gt;\n&lt;p&gt;Routine and complex multidisciplinary clinics are held at Guy’s Hospital and a number of outreach clinics at various locations throughout South East England. There will be opportunities to develop specialist expertise complimentary to the department’s interests.&lt;/p&gt;\n&lt;p&gt;In addition, we are at the forefront of delivering genomics in healthcare and the clinic plays a very important role in the clinical interpretation of genomic data (Whole Exome Sequencing performed at Guy’s Hospital and results generated from the Genomics England Project). Our partner laboratory has a fully commissioned and integrated WES service and Guy’s and St. Thomas’ leads of the seven national Genomic Laboratory Hubs (GLHs). We hold weekly multidisciplinary meetings with the laboratory staff to guide interpretation of data and management of patients.&lt;/p&gt;\n&lt;p&gt;Guy’s and St. Thomas’ NHS Foundation Trust is made up of two of London’s best known teaching hospitals and employs over 13,650 staff and have over 2 million patient contacts a year. Our annual turnover is now £1.3 billion.&lt;/p&gt;\n&lt;p&gt;You must be fully registered with the GMC/GDC and hold Licence to Practice and be on the Specialist Register, or within six months of attaining your CCT or equivalent at interview stage.&lt;/p&gt;\n&lt;p&gt;The postholder will have regular contact with vulnerable adults and/or children (0-18 years) and therefore this post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;As an organisation, we are committed to developing our services in ways that best suit the needs of our patients. This includes asking certain groups of staff to work more flexibly so that we can offer services to patients in the evenings and at we&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s &amp; St Thomas&#39; NHS Foundation Trust, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Consultant in General Genetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258429", "validThrough": "2020-11-30T23:59:59+0000"}