{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-02T09:00:38+0000", "description": "&lt;p&gt;&lt;strong&gt;CAMHS Eating Disorder Service -Mental Health Practitioners (Home Treatment) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) has been successful in gaining significant additional funding to expand the CAMHS Eating Disorders Service. CPFT has led on the Adult Provider Collaborative implementation of the New Models of Care process in the NHS Eastern Region for Adult Eating Disorders and is now leading the eating disorders specialist pathway for Children’s mental health.&lt;/p&gt;\n&lt;p&gt;Our Children and Young People’s CAMHS Eating Disorder Service is looking to recruit two enthusiastic, highly motivated Mental Health Practitioners to work with children and young people with eating disorders, and their families. Providing interventions in the family home, in clinic and via online platforms as part of the service’s new Home Treatment offer. This is an exciting opportunity to work in this county-wide service using a range of models (including family based approaches, CBT, CAT and IPT) and to play a key role in supporting young people to remain in the community for treatment and avoid or delay admission to Tier 4 specialist units. The post holders will also support the transitions of young people out of inpatient units. Undertaking the Band 6 role, you will provide clinical leadership within the home treatment provision to the Band 4 Home Treatment Support Workers/ Nursing Associates.&lt;/p&gt;\n&lt;p&gt;You will work closely with a range of professionals to provide specialist assessment, psychological formulation, and anorexia-nervosa focused family therapy with eating disorders in the community. You will use your knowledge and experience of eating disorders, gained in community or inpatient settings, to supporting families to implement the team’s treatment recommendations with intensive home support and monitoring initially and moving to the genuine cocreation of treatment goals with the young person.&lt;/p&gt;\n&lt;p&gt;Part of the role will involve supervision, teaching and training within the specialist teams, wider trust and to our outside partners. We value respectful and effective working relationships with our colleagues in local acute trusts and specialist Tier 4 provision. Consultation, liaison, research and audit will contribute to your raising of the profile of eating disorders and its safe and effective management for children and young people.&lt;/p&gt;\n&lt;p&gt;Regular supervision by senior clinical staff will be provided. Opportunities exist for your own further training, professional development and research within the eating disorders specialism but also within the wider trust.&lt;/p&gt;\n&lt;p&gt;Ideally you should be able to travel and work at clinics across Cambridgeshire and Peterborough but the trust has made significant investments in agile and virtual working methods to support clinicians in teams with large geographic areas.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Penny Hazell, Clinical Psychologist and Clinical Lead CAMHS EDS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Penny.Hazell@cpft.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;or&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Suzanne Hare , Service Manager &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Suzanne.Hare@cpft.nhs.uk / 01480 445281 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newtown Centre, , Huntingdon", "postalCode": "PE29 3RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3317", "longitude": "-.179007"}}, "title": "CAMHS Eating Disorder Service Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251367", "validThrough": "2020-11-16T23:59:59+0000"}