{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata if applicabl"}}, "datePosted": "2020-11-02T10:32:26+0000", "description": "&lt;p&gt;Are you interested in a career in acute medicine or emergency nursing? If so there is a position here for you at East Kent. We are one of the largest acute Trusts in England and are in the enviable position of being surrounded by beautiful beaches and the Kent countryside but with easy links to the centre of London. So, whether you are interested in cathedrals, castles, exceptional grammar schools or chic and stylish restaurants, East Kent has something for everyone.&lt;/p&gt;\n&lt;p&gt;Now is an exciting time to join the Urgent &amp; Emergency Care Group at East Kent Hospitals. We were one of the Top Ten trusts in England for improvements in our emergency care access standards last year. We have also recently invested £6.2million in improvements across our emergency floor.&lt;/p&gt;\n&lt;p&gt;We are a multi-site Trust with two acute hospitals in Ashford and Margate, we are a trauma unit and regularly receive major trauma and helicopter emergencies from the regional air ambulance and coastguard. We are also the primary PTCI service and HASU for the region. We pride ourselves on being a clinically led organisation and are passionate about developing and empowering our staff.&lt;/p&gt;\n&lt;p&gt;Due to an organisational re structure, new nursing leadership and internal promotion we are investing in our front-line services and redesigning our acute and emergency floor to promote collaborative working and enhance the patient pathway and experience. Our emergency and acute floor consists of urgent and emergency care, newly developed observation wards, emergency ambulatory and acute medical assessment units.&lt;/p&gt;\n&lt;p&gt;We currently have vacancies in all areas and we are looking to increase our existing caring and compassionate team with nurses who are keen and enthusiastic; in return we can offer you a stimulating working environment which will develop the skills and abilities required in either speciality. To help you do this you will supported by a large multidisciplinary team which includes an established advanced clinical practitioner (ACP) programme, nurse consultants, practice development support and a governance, quality and audit team. Each department has a matron who is supported by the senior matron and the care group head of nursing.&lt;/p&gt;\n&lt;p&gt;We are currently developing a career pathway to support and encourage education and learning to help you to reach your academic potential and we offer a generous study leave package and a recruitment and retention initiative of £3000 for external applicants.&lt;/p&gt;\n&lt;p&gt;We offer flexible working and if you are unsure if a career in acute medicine, ambulatory or the emergency department is what you are looking for then we also offer a rotational programme so you will gain experience in all areas so you can decide where to specialise at a later date.&lt;/p&gt;\n&lt;p&gt;Staff and patients from across East Kent Hospitals (EKHUFT) are the feature of the biggest NHS recruitment drive in its 70-year history.&lt;/p&gt;\n&lt;p&gt;‘We are the NHS’ campaign highlights the extraordinary work that staff across our organisation do every single day. Serving a population of over one million people, EKHUFT was perfectly placed to demonstrate the care, cutting-edge treatments, research, innovations and life-saving operations that the campaign needed. If you are a junior nurse looking for a new career or an experienced nurse looking for promotion then look no further. We would be delighted to talk to you about joining our organisation which is like a supportive family.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For any further information or to arrange an informal chat or visit please contact:&lt;/p&gt;\n&lt;p&gt;Joanna Williams, Matron - 07866030492 (QEQM)&lt;/p&gt;\n&lt;p&gt;Jason Watson, Matron - 07866030491 (WHH)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth the Queen Mother Hospital, Margate &amp; William Harvey Hospital, Ashford", "postalCode": "CT9 4AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3781", "longitude": "1.38941"}}, "title": "Registered Nurse / Paramedic / ODP - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251608", "validThrough": "2020-11-16T23:59:59+0000"}