{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 p.a. pro rota"}}, "datePosted": "2020-10-27T10:31:37+0000", "description": "&lt;p&gt;We are seeking to appoint a part time Consultant in plastic and reconstruction surgery with an interest in Skin Cancer.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to develop a career in South West London in a high performing NHS Trust.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated individual to join our multidisciplinary team, and be instrumental in the provision and further development of plastic surgery services at Kingston Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Applications are invited from suitably qualified and experienced individuals who wish to play an essential role in providing a wide range of Plastic Surgery services to our local population, where a large proportion of activity is focused around management of skin cancer.&lt;/p&gt;\n&lt;p&gt;You will have a collaborative outlook and interest in research &amp; development to facilitate close working with a multidisciplinary team of Consultant Dermatologists, Nurse Consultants and clinical nurse specialists to deliver outstanding care.&lt;/p&gt;\n&lt;p&gt;There is no on-call commitment.Key elements of the job purpose are to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Delivery and development of high quality Plastic Surgery care&lt;/li&gt;\n&lt;li&gt;Support delivery of a multidisciplinary skin cancer service&lt;/li&gt;\n&lt;li&gt;Undertake teaching duties of undergraduate and postgraduate medical staff as well as allied health professionals&lt;/li&gt;\n&lt;li&gt;Active participation in clinical audit, research and the Trust’s clinical governance programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;What we can offer you ?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Prospect to develop your leadership and management skills&lt;/li&gt;\n&lt;li&gt;Opportunity to develop highly specialist knowledge, experience and skills with a leading acute care provider&lt;/li&gt;\n&lt;li&gt;Challenge of complex and varied work&lt;/li&gt;\n&lt;li&gt;A variety of employee benefits including access to a range of salary sacrifice schemes and health and well-being services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our Cluster is proud of its forward thinking, quality focused ethos and consider operational management a key element to successfully delivering high quality clinical care.&lt;/p&gt;\n&lt;p&gt;The post is part time, and may require flexible working.&lt;/p&gt;\n&lt;p&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/p&gt;\n&lt;p&gt;Kingston Hospital NHS Foundation Trust is a thriving Foundation Trust at the heart of an integrated healthcare system which provides a full range of diagnostic and treatment services. The hospital supports some 320,000 people in the surrounding area including the boroughs of Kingston, Richmond, Roehampton, Putney and East Elmbridge. Kingston Hospital is one of the largest employers in the region and employs over 3,700 staff across the widest range of careers. We are proud of our reputation as the largest single site District General Hospital in London and our Maternity Unit is the second biggest in London. In a National survey, we were rated as the Best Maternity Service in London by the National Health Watchdog, the Care Quality Commission. Each year, over one million people visit Kingston Hospital for treatment or as a visitor. Out of the top six London Trusts, Kingston is the only District General Hospital: the others are teaching hospitals. Overall, the hospital lies 15th nationally and in 2018 we were proud to be the first acute Trust in London to be awarded an overall Care Quality Commission ‘Outstanding’ rating. The Hospital is based about 12 miles from the centre of London with good transport links into the capital and in a beautiful and historic part of the country. It lies very close to Richmond Park and is close to Hampton Court Palace and Kempton Park, and the River Thames.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you would like further information regarding this post, please contact Mr Mark Soldin or Ben Ardehali via administration office on 0208 5467711 Extn: 3755&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston Hospital, Kingston Upon Thames, Surrey", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Consultant Plastic Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244022", "validThrough": "2020-11-09T23:59:59+0000"}