{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24907 - £30615 pa basic"}}, "datePosted": "2020-11-02T17:01:27+0000", "description": "&lt;p&gt;At Imperial Private Healthcare, our patients experience world class care in the modern private facilities of some of London’s most trusted NHS hospitals. We are currently looking for inspiring team members to work in our world-renowned facilities across London during an exciting period of growth.&lt;br /&gt; &lt;br /&gt; About you&lt;br /&gt; If you are looking for your next move, and want to work in a private setting with all the employee benefits of the NHS, then we want to hear from you. Although working specifically for private healthcare, you will be part of one of the UK’s leading academic NHS Trusts. You need to be passionate about nursing, capable and dynamic, but also have the customer service skills to make every patient feel like they are your top priority.&lt;br /&gt; &lt;br /&gt; About us&lt;br /&gt; Imperial College NHS Trust is one of six accredited UK Academic Health Science Centres and has an international reputation for its clinical activity, research and teaching. Imperial Private Healthcare operates within the Trust and offers multispecialty services including theatres and obstetrics. We recruit all grades of nurses, midwives and care assistants. &lt;br /&gt; &lt;br /&gt; As a member of our team you will be offered a competitive salary, excellent staff benefits and a commitment to your personal development. By practicing in a mixed speciality arena you will build essential transferable skills and expertise that will be an asset to your nursing repertoire. You will be encouraged and given the space to develop and make a difference to people’s lives. In addition, all the income we generate in private healthcare is reinvested back in to services throughout the Trust, so the work you do will help to benefit patients in the whole community.&lt;br /&gt; &lt;br /&gt; Please contact Lead Nurse – Jackie Burgess on 07818428331 or Jackie.burgess3@nhs.net for further information or to arrange an informal visit.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charing Cross Hospital", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Band 5 Staff Nurse Imperial Private Healthcare - PH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252982", "validThrough": "2020-11-15T23:59:59+0000"}