{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-26T13:32:08+0000", "description": "&lt;p&gt;&lt;span&gt;Senior Project Manager&lt;br /&gt;Division/Department: Digital Services&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;The Digital Services Programme Team is responsible for programme management resource and expertise to ensure the successful delivery of large and/or complex and high-profile projects; ensuring that projects are delivered on time, within budget and are achieving the required benefits.&lt;/p&gt;\n&lt;p&gt;The Programme and Projects function within the Digital Services department are looking to recruit a Senior Project Manager to provide planning, management and delivery of projects.&lt;/p&gt;\n&lt;p&gt;This opportunity will help to strengthen our project delivery team and work towards greater successful delivery of digital projects across the Trust. It is also critical that the candidate has the ability to prioritise workloads and be able to manage multiple projects at any one given time.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent organisational and communication skills; good general knowledge and understanding of the NHS and will ideally have worked in an IT / Healthcare environment. Previous experience in project management is essential as the candidate will be expected to develop project plans, ensure reporting criteria is met and key project documentation, such as risks and issues, are appropriately logged and maintained.&lt;/p&gt;\n&lt;p&gt;The successful candidate should have a flexible approach to a varied workload and be able to work autonomously and as part of a team. The successful candidate must have a working understanding of project management principles and processes. In return we will provide a supportive environment in which to learn and develop with the opportunity to further your skills and career in Programme and Project Management within an exciting and evolving environment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Minal Patel on 01895 279 011&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Hillingdon Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120945"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Hillingdon Hospitals NHS Foundation Trust, Uxbridge", "postalCode": "UB8 3NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5255", "longitude": "-.460885"}}, "title": "Senior Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242687", "validThrough": "2020-11-09T23:59:59+0000"}