{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "On experience"}}, "datePosted": "2020-10-12T11:35:51+0100", "description": "&lt;p&gt;&lt;strong&gt;Practice Manager &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Miller Street Surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Miller Street Surgery is a busy, friendly GP Surgery serving approximately 6,500 patients. We are currently recruiting for an enthusiastic, hard-working and motivated Practice Business Manager to lead and develop our practice and its team. The practice is situated in Newcastle under Lyme in Staffordshire and is a member of Newcastle Central Primary Care Network. The practice is made up of three partners and one salaried GP. We have an advanced nurse practitioner, one practice nurse and a healthcare assistant. We have team of admin support staff and a data quality co-ordinator and we also benefit from additional PCN clinical staff.&lt;/p&gt;\n&lt;p&gt;This is a demanding and challenging role providing dedicated support to the business agenda. The post holder will be expected to provide expertise in leadership and management and have a good understanding of the general practice business agenda. You will be expected to support the practice partners in the day to day operations and delivery of primary care services and effective communication skills are essential. Strong leadership and management skills are crucial as you will be expected to drive forward both the practice team and the business elements of the practice.&lt;/p&gt;\n&lt;p&gt;We always aim to improve our patient care, staff education and training, and our ability to adjust and adapt to ever-changing circumstances. If you are a proactive, dynamic, and well-organised manager and you have the qualities and skills necessary for this role, we would welcome your application.&lt;/p&gt;\n&lt;p&gt;Only those applicants selected for interview will be contacted.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal visits are encouraged and can be arranged on request.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: Dependent on experience.&lt;/p&gt;\n&lt;p&gt;Contact: Bernadette McCormick&lt;/p&gt;\n&lt;p&gt;Bernadette.mccormick@northstaffs.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle under Lyme", "postalCode": "ST5 1JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0138", "longitude": "-2.21842"}}, "title": "Practice Business Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222140", "validThrough": "2020-11-20T23:59:59+0000"}