{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T13:16:04+0000", "description": "&lt;p&gt;In recent years, the roles undertaken by pharmacy technicians in medicines management have increased considerably. At Swansea Bay University Health Board, we are looking at areas where these roles can be expanded further, and medicines administration by pharmacy technicians is one area of significant interest. &lt;br /&gt;&lt;br /&gt;We have an exciting opportunity at Morriston hospital for a pharmacy technician to be part of the multidisciplinary team. With this innovative role the pharmacy technician will administer medication to patients complimenting their medicines management role.&lt;/p&gt;\n&lt;p&gt;Based on a Medical or Surgical ward the successful candidate will work with nursing, medical and pharmacy colleagues to develop the service. All necessary training and assessments with regards to administering medication will be provided; with the support to make you a success in the role.&lt;/p&gt;\n&lt;p&gt;The successful candidate will posses excellent organisational and communication skills, have experience of working with the wider healthcare team, relish supporting patients and their families and have a professional approach.&lt;br /&gt;&lt;br /&gt;In addition, to administering medicines the post holder will also be expected to assist in providing a medicines management service and undertake Accredited Pharmacy Technician duties on the ward. The post holder will be a valued member of the ward team.&lt;/p&gt;\n&lt;p&gt;If you want to be at the forefront of developing the pharmacy technician role, are passionate about improving patient care and take your career to the next level, apply now.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Duncan Davies, Patient Services Manager, Morriston Hospital&lt;br /&gt;&lt;br /&gt;duncanj.davies@wales.nhs.uk&lt;br /&gt;&lt;br /&gt;01792 703295&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Morriston Hospital, Swansea", "postalCode": "SA6 6NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6847", "longitude": "-3.93527"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254105", "validThrough": "2020-11-17T23:59:59+0000"}