{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26055", "minValue": "26055", "unitText": "YEAR", "value": "£15.50 Per Hour"}}, "datePosted": "2020-10-26T10:56:16+0000", "description": "&lt;p&gt;We are looking for a Part time Registered Mental Health Nurse (RMN) or Registered Learning Disability Nurse (RNLD) with a passion for delivering the best quality of care.&lt;/p&gt;\n&lt;p&gt;You will be working 12.5 -25 Hours per week at Old Leigh House.&lt;/p&gt;\n&lt;p&gt;Old Leigh House supports men living with a learning disability and complex needs. The team can also support those who have mental and physical health needs, as well as complex behaviours and a history of offending.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Day-to-Day…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Produce outstanding written reports based on your nursing assessments and observations&lt;/li&gt;\n&lt;li&gt;Work closely with the management team to develop the service, audit, and improve quality&lt;/li&gt;\n&lt;li&gt;Attend all training and engage in CPD to further knowledge and promote nursing&lt;/li&gt;\n&lt;li&gt;Under NMC guidelines, ensure that individual care plans are complete &amp; maintained collectively with residents, relatives and other healthcare professionals&lt;/li&gt;\n&lt;li&gt;Administer prescribed medicines with Healthcare procedure and Healthcare Commission guidelines&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet? We’ll offer you…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS and employee discount scheme&lt;/li&gt;\n&lt;li&gt;50% NMC registration renewal paid by Cygnet&lt;/li&gt;\n&lt;li&gt;Free meals on duty&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;RCNi membership&lt;/li&gt;\n&lt;li&gt;Bespoke career pathways&lt;/li&gt;\n&lt;li&gt;Plus many more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You will have…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Essential:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experienced Registered Mental Health Nurse (RMN) or Registered Learning Disability Nurse (RNLD) with a current valid registration&lt;/li&gt;\n&lt;li&gt;The ability to maintain documentation, undertake audits and demonstrate integrity in your role&lt;/li&gt;\n&lt;li&gt;A good understanding of the latest nursing practices&lt;/li&gt;\n&lt;li&gt;A commitment to patient recovery in order to effectively monitor, manage and reduce risk&lt;/li&gt;\n&lt;li&gt;Compassion, resilience and a dedication to empower and support service user independence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Desirable:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to deputise in a clinical lead role&lt;/li&gt;\n&lt;li&gt;An interest in leadership, research and assessment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Health Care&lt;/strong&gt; has been providing a national network of high quality specialist mental health services for 30 years.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Old Leigh House&lt;/strong&gt; is an Independent Hospital for men living with a learning disability Located in Leigh-on-Sea in Essex, near Southend-on-Sea, Old Leigh House provides assessment and treatment for up to seven men who are living with a learning disability and complex needs, or with a forensic history. The team can also support those who have mental and physical health needs, as well as complex behaviours.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Old Leigh House &lt;/strong&gt;is a large semi-detached house, overlooking a park in a residential area of Leigh-on-Sea. The service has a choice of lounges and communal areas for people to choose from and a small garden at the back of the house. The house has been specially adapted and has an accessibility lift for those people who come to us with mobility needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;If you care about making a difference – we want to talk to you!&lt;br /&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leigh-on-Sea, Essex", "postalCode": "SS9 1LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5438", "longitude": ".673226"}}, "title": "Part Time Staff Nurse (RMN / RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242096", "validThrough": "2020-11-27T23:59:59+0000"}