{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 Pro Rata Per Annum"}}, "datePosted": "2020-11-06T13:01:26+0000", "description": "&lt;p&gt;The Division of Medicine would like to invite applications for the B2 Clinical Typist within the Cardiology Team.&lt;/p&gt;\n&lt;p&gt;This exciting opportunity has arisen to become a member of the Cardiology Admin Team based at our Doncaster Royal Infirmary Hospital&lt;/p&gt;\n&lt;p&gt;This is a Full time, permanent position supporting the Cardiology consultants, clinical team and specialist Nurses alongside the Medical secretaries.&lt;/p&gt;\n&lt;p&gt;The post holder will assist the Medical secretary to provide effective and efficient support to clinical teams, maintaining robust systems in place for administrative management of patient pathways.&lt;/p&gt;\n&lt;p&gt;You will work flexibly as part of the team producing clinical correspondence using Medisec digital transcription software, from outpatient and inpatient attendances ensuring clinical line of priority and chronological order&lt;/p&gt;\n&lt;p&gt;A knowledge of medical terminology is essential alongside previous experience of working in a clerical administrative role. You will be required to promptly file correspondence and investigation results into case notes in line with the trust policy, ensure accuracy and recording of all clinical events as part of the patient pathway, and provide general administrative support where required across the whole team.&lt;/p&gt;\n&lt;p&gt;You will be required to display tact and diplomacy where appropriate and demonstrate a flexible approach to working within a Team environment and have well developed communication skills when dealing with senior staff, patients, colleagues and the general public.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Carol Rudd - Team Leader, Carol.rudd1@nhs.net, 01302 642169&lt;/p&gt;\n&lt;p&gt;Michelle Beynon - Service Manageron, Michelle.beynon@nhs.net, 01302 644342&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN2 5LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5308", "longitude": "-1.10926"}}, "title": "Clinical Typist / Administrator- Cardiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259802", "validThrough": "2020-11-15T23:59:59+0000"}