{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34678", "minValue": "27936", "unitText": "YEAR", "value": "£27,936 - £34,678 pa inc"}}, "datePosted": "2020-10-09T10:46:10+0100", "description": "&lt;p&gt;Theatres – Band 5 Operating Department Practitioner&lt;br /&gt;&lt;br /&gt;The Royal Marsden has two operating theatres on the Sutton site. We are currently inviting applications from highly skilled, compassionate and motivated staff to join our team in delivering excellent care to our patients, both NHS and Private.&lt;br /&gt;&lt;br /&gt;We are currently recruiting Operating Department Practitioners or nurses in scrub/Anaesthetic theatres at band 5, with a desire to be involved in exciting new projects which will provide excellent development opportunities. Strong clinical skills in a variety of specialities are essential.&lt;/p&gt;\n&lt;p&gt;You will be able to work well in a pressurised environment where oncology patients undergo surgery. You will demonstrate effective communication skills with a wide variety of individuals, teams and departments and possess a positive and flexible approach to your duties.&lt;/p&gt;\n&lt;p&gt;You will work on-calls as part of the scrub team, covering late finishes and out of hours procedures&lt;/p&gt;\n&lt;p&gt;At the Royal Marsden we believe that our staff are our greatest asset. We value the importance of supporting our workforce to grow, develop and innovate in order to create a great place to work and enable us to provide excellent care. An orientation and training package to support your transition into the team is provided.&lt;/p&gt;\n&lt;p&gt;During the interview process you will be expected to provide evidence of your ability to work flexibly within a team of individuals, working collaboratively to the highest clinical standards by adhering to the policies, procedures and regulations which guide your practice.&lt;/p&gt;\n&lt;p&gt;It would be advisable for the applicant to arrange an informal visit to the department prior to interview &lt;br /&gt;&lt;br /&gt;*** Please state clearly the position you applying for in the supporting information of your application. ***&lt;br /&gt;&lt;br /&gt;For information about The Royal Marsden please visit our website&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ian Caunter, Theatre Manager, Ian.caunter@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden Hospital, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Operating Department Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219805", "validThrough": "2020-11-06T23:59:59+0000"}