{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-10-30T12:00:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Care Coordinator – Band 3 – Ward F10 – 37.5 hours per week – Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Could you help West Suffolk Hospital to deliver the best quality and safest care to our local community?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic individual with a personal desire to succeed and make a difference.&lt;/p&gt;\n&lt;p&gt;The role of Care Co-Ordinator fulfils a link between Consultants, Medical Teams, Ward Nursing Staff, Social Care Services, external agencies patients and their relatives. It also provides a link between Wards and the Clinical Site Assistants, Medically Optimised, Discharge Planning and Support to Go Home Teams as the role communicates an immediate position on the bed occupancy on the ward and will also communicate discharge information, enabling increased medical and nursing time to be released to spend directly with the patient.&lt;/p&gt;\n&lt;p&gt;The role will be working as part of the medicine division on Ward F10. The ward is a fast paced and exciting environment with a fantastic team who work closely with one another to deliver the best quality and safest care to their patients.&lt;/p&gt;\n&lt;p&gt;The role of the Care Co-ordinator is an exciting position that has a direct impact on improving the patient journey, increasing patient satisfaction and a reduction in length of stay.&lt;/p&gt;\n&lt;p&gt;Key Requirements&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Computer literacy&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Good communication skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A team player prepared to assist colleagues in the interest of patient care&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Good organisational skills/time management&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Flexible approach to working hours and duties&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does not &lt;/strong&gt;entitle you to apply to park on the Hospital site. The Trust offer parking off site at the Bury St Edmunds Rugby Club, which is serviced by a regular shuttle bus to and from the Hospital. Details of the bus timetable can be found in the on-line starter pack.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If required to work on a weekend, the restriction does not apply. Parking is allowed on site Saturday and Sunday provided a day ticket (£2.10) is clearly displayed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For posts that include “on call” duties successful candidates will need to complete an application form for access through the barriers from the car park office.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Care Coordinator - Band 3 - Ward F10", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250063", "validThrough": "2020-11-13T23:59:59+0000"}