{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum/ pro-rata"}}, "datePosted": "2020-11-04T17:15:41+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Band 4 Therapy Assistant to join the Home Assessment Reablement Team (HART). We are a community based service which operates 7 days a week providing reablement support to service users from a wide range of hospital and community based settings within their own homes across Oxfordshire.&lt;/p&gt;\n&lt;p&gt;The service has four teams - Oxford City (based from Unipart House Business Centre), North Oxfordshire (based from the Horton General Hospital), West Oxfordshire (based from the Horton General Hospital) and South Oxfordshire (based from Abingdon Health and Wellbeing Centre).&lt;/p&gt;\n&lt;p&gt;Band 4 Therapy Assistants work autonomously, guided by therapists, to enable patients to reach a maximum level of independence. The roles involve working directly with patients using functional activities such as self-care, strength, mobility and ADL’s as part of the reablement process.&lt;/p&gt;\n&lt;p&gt;HART is committed to developing quality services for patients. We offer regular supervision, in-service training and actively promote the personal development of all our team.&lt;/p&gt;\n&lt;p&gt;Applicants should have a good general education, a flexible attitude and well-developed interpersonal skills. You will be expected to work flexibly across 7 days between the hours of 8am-8pm.&lt;/p&gt;\n&lt;p&gt;As it is a community based role, it is essential that you have a full UK driving licence and your own vehicle. Mileage is paid at 45p per business mile.&lt;/p&gt;\n&lt;p&gt;Please explain specifically why you are suitable for this post, if this is not completed you may not be shortlisted. Please check the job description and person specification to ensure that you meet the essential criteria prior to applying for this post.&lt;/p&gt;\n&lt;p&gt;We would look to support part time, full time and weekend only contracts, this will be discussed at interview.&lt;/p&gt;\n&lt;p&gt;Please be aware that this advert may close early if sufficient applications are received prior to the closing date&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;F&lt;strong&gt;or further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Name: Jo Gronmark&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job title: Head of Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email address: Jo.Gronmark@ouh.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Telephone number: 01865 221082&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Unipart House Business Centre or Horton General Hospital or Abingdon Health and Wellbeing Centre, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Therapy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256789", "validThrough": "2020-11-18T23:59:59+0000"}