{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa"}}, "datePosted": "2020-11-06T15:46:24+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join our busy Breast Unit as a Patient Pathway Co-ordinator, providing Maternity Cover for a period of twelve months (secondment or fixed-term).&lt;/p&gt;\n&lt;p&gt;Knowledge of both National Cancer and 18 Week Patient Pathway Targets is essential for this role, as you will be required to co-ordinate the administrative patient pathways for Breast Services. The role will include the use of Patient Administration and Cancer software packages to capture and monitor data.&lt;/p&gt;\n&lt;p&gt;You must be able to multitask, remain calm under pressure, prioritise and troubleshoot within in a busy fast pace environment. Flexibility, reliability, adaptability and working well as part of a team are key for the Patient Pathway Coordinator role.&lt;/p&gt;\n&lt;p&gt;Essential skills for this role are fast accurate keyboard skills, the ability to communicate effectively at all levels, together with previous experience of customer care and the ability to deal with sensitive and confidential information.&lt;/p&gt;\n&lt;p&gt;Working alongside a busy team of Secretarial, Clinical, and Cancer Services staff this is a very valuable and rewarding role. You will be required to provide a variety of secretarial/administrative tasks with the aim to provide the best patient experience. Supporting the Breast Services Administration Manager, you will also be required to provide supervision, assistance with rota planning, recruitment, and conduct regular 1-1s to enable the smooth running of the Secretarial Office.&lt;/p&gt;\n&lt;p&gt;If you are seeking a challenge and possess the skills required, this post to cover Maternity leave for a year, could be the opportunity for you.&lt;/p&gt;\n&lt;p&gt;This is a full time position, working 37.5 Hours per week, Monday to Friday. The post-holder will be required to work flexibly within the core office hours, between 0830am and 1730pm. Occasional Home working may also be a possibility once the post-holder is fully trained.&lt;/p&gt;\n&lt;p&gt;Interviews for this post will take place in November/December 2020, date to be finalised.&lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact Agnetha Searle, Patient Pathway Co-ordinator on 01733 673056&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Agnetha Searle: Patient Pathway Co-ordinator&lt;/p&gt;\n&lt;p&gt;agnetha.searle@nhs.net&lt;/p&gt;\n&lt;p&gt;01733 673056&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121323.jpg", "name": "North West Anglia NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121323"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough City Hospital, Peterborough", "postalCode": "PE3 9GZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5848", "longitude": "-.278479"}}, "title": "Patient Pathway Co-ordinator - Peterborough", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260439", "validThrough": "2020-11-20T23:59:59+0000"}