{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39867", "minValue": "36708", "unitText": "YEAR", "value": "£36,708 - £39,867"}}, "datePosted": "2020-10-26T22:46:11+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialist Practitioner for Children with SEND&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary - £36,708 - £39,867 pro-rata | 2 Roles (1 Based in Kingston and 1 based in Richmond) | Permanent | Full time (36 hours per week)&lt;/p&gt;\n&lt;p&gt;Achieving for Children recognise these are unprecedented times, but we continue to build capacity to support our most vulnerable groups.  To do this we are continuing to attract talented professionals to join us as we continue to provide &lt;strong&gt;OUTSTANDING&lt;/strong&gt; (Kingston ILACS Ofsted 2019) services.&lt;/p&gt;\n&lt;p&gt;If you have the skills that will enable us to continue to enhance our practice and improve outcomes for children further, we want to hear from you.  We are looking for bright, enthusiastic people who have the passion and the drive to make a positive difference to children’s lives. By recognising and championing strengths we know we can make a real difference. It’s a genuine team effort in AfC. That’s why we want talented people, like you, to join us and help create a brighter future for children and families.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working as a specialist practitioner for children with SEND, you will support families in the period leading up to the assessment and post diagnosis to offer practical and emotional support with areas of concern which are having a significant impact on the family.&lt;/p&gt;\n&lt;p&gt;As a Specialist Practitioner for Children with SEND for Achieving for Children, you will be responsible for&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Providing specialist guidance, emotional support and advocacy to children and young people with additional needs and their families e.g supporting parents and carers through the process of diagnosis, discussing developmental concerns, sleep, behaviour, diet and continence.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Making observations and informed judgements about a child’s behaviour and communication in order to jointly develop strategies and care plans.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Participating in team case discussions and presenting evidence and information relating to the child and to the family circumstances and challenges.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Providing supervision, guidance and support to the specialist support worker for children with SEND. &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About AfC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a not-for-profit social enterprise owned by three local authorities (Kingston, Richmond and Windsor &amp; Maidenhead), we offer the freedoms of a social enterprise with the employment benefits of local government. To find out more about us click here. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To be a Specialist Practitioner for children with SEND for AfC, you will be passionate about making a positive difference to the lives of children and young people as well as demonstrating the following points&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt; A professional qualification in health, education, social care or related area of child development (eg. teacher/ therapist/ psychologist/ health visitor/ portage worker).&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt; Teaching and assessing/ mentorship/ supervision qualification or equivalent.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt; Significant experience in supporting children with social communication difficulties.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt; Expert understanding of child health and development.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt; An ability to work independently and flexibly and adapt to change as service need requires&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt; Display excellent communication skills, both verbal and non-verbal&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt; Show initiative and a passion to work with children and young people&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About our benefits&lt;/strong&gt;&lt;br /&gt;When you join AfC you will have access to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Positive and supportive working environments&lt;/strong&gt; - We have a highly supportive working environment in which managers are challenging and supporting in equal measures. &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Positive work-life balance&lt;/strong&gt; - Access to employee benefits and support forms part of our health and wellbeing offer.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;A competitive salary and access to LA pension scheme&lt;/strong&gt; - Our salaries are benchmarked against other local authorities.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;A range of staff benefits and discounts managed via your own app&lt;/strong&gt; - Staff can enjoy a wide range of discounts on sports and leisure activities and everyday shopping through AfC My Place.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Professional reflective supervision&lt;/strong&gt; - Regular, high-quality reflective supervision which helps to build confidence is available to all. &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Strong Management&lt;/strong&gt; - A strong performance management culture, with an equally strong focus on practice learning, is embedded across the organisation&lt;strong&gt;. &lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;A fantastic learning and development offer&lt;/strong&gt; - A clearly set out and accessible learning and development pathway, offering an extensive range of training and learning opportunities is accessible for all. This includes funding for post-qualifying courses.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To find out about all of the breadth of benefits of working for Achieving for Children click here&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Start dates&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Achieving for Children have fixed start dates, candidates are advised to prepare for this should a job offer be accepted to ensure eligible continuous service is not affected.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please apply online including a supporting statement addressing how you meet the criteria for this post detailing what skills, knowledge, experience and abilities you can bring to the role, as outlined in the &lt;/span&gt;Role Profile&lt;span&gt;. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;Please note: This vacancy is for two positions. One position will be working predominantly in the locality of the London Borough of Richmond, and the other in the locality of the Royal Borough of Kingston upon Thames. &lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If you would like to find out more about this exciting opportunity, please contact Kirsty Dobson, Children’s Community Nursing Team Lead, on kirsty.dobson@achievingforchildren.org.uk or 07710 117626 to request an informal discussion.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Advert Closing Date: 6th November 2020&lt;br /&gt;Provisional Interview Date: 11th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Achieving for Children is an equal opportunities employer, this extends to welcoming candidates from BAME backgrounds. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are committed to safeguarding and promoting the welfare of children, young people and vulnerable adults. We expect all staff and volunteers to share this commitment.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Royal Borough of Kingston upon Thames", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130374"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Richmond &amp; Kingston upon Thames", "postalCode": "KT1 1EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4078", "longitude": "-.306445"}}, "title": "Specialist Practitioner for Children with SEND", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243650", "validThrough": "2020-11-06T23:59:59+0000"}