{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa inc. HCAS"}}, "datePosted": "2020-11-04T09:46:36+0000", "description": "&lt;p&gt;This is an exciting opportunity for you to join our dynamic, innovative and friendly team dedicated to improving our Clinical Pharmacy and anticoagulation services based on the Ealing Hospital site. In this key post you will be working as part of an established multidisciplinary team and be responsible for providing a high quality Clinical Pharmacy service. The post holder will be an integral member of the Trust Thrombosis Committee and work closely with Haematologists, Anticoagulation Specialist Pharmacists and other members of the multi-disciplinary team across sites to deliver anticoagulation services in the Trust. The post holder will also deliver anticoagulation clinics as an Independent Prescriber. Applicants without an Independent Prescribing qualification will be supported to achieve this as part of the job role.&lt;br /&gt;&lt;br /&gt;As an enthusiastic and patient oriented Pharmacist, you will combine expert opinion and expert practice at the bedside to benefit patient care to help us implement, deliver and continually improve medicines management. On wards you will be responsible for reconciling medicines prescribed on admission, promote early in-depth medication review (using our prescribing rights where necessary) and support the discharge process; thereby facilitating high quality patient outcomes whilst reducing prescribing errors and ensuring patient safety.&lt;br /&gt;&lt;br /&gt;You will need post-registration experience relevant to hospital Pharmacy and will have completed or be working towards completing the Post Graduate Diploma in General Pharmacy Practice or equivalent qualification. An Independent Prescribing qualification is desirable. You will need excellent communication, interpersonal and time management skills and will need to enjoy working as part of a multidisciplinary team.&lt;br /&gt;&lt;br /&gt;The Pharmacy department at London North West University Healthcare NHS Trust is a friendly and forward thinking department that offers comprehensive services including a well-respected Clinical Pharmacy service, a number of Specialist Clinical Pharmacy Pharmacists, and a Regional Medicines Information Centre. The department also has a large manufacturing unit. &lt;br /&gt;&lt;br /&gt;We are a department that believe in equipping our Band 7 Pharmacists with skills to carry out senior roles to aid their career progression. Posts have been developed to ensure leadership roles are key with a high emphasis on delivering teaching and training to a wide range of healthcare professionals as well as managing teams. You will be able to develop senior roles and responsibilities and we encourage individuals to take on any new responsibilities to meet their development needs.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Anisha Patel&lt;/p&gt;\n&lt;p&gt;Job title: Deputy Clinical Services Manager&lt;/p&gt;\n&lt;p&gt;Email address: anisha.patel11@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 020 8967 5887&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ealing Hospital, London", "postalCode": "UB1 3HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.507", "longitude": "-.346317"}}, "title": "Clinical Services and Anticoagulation Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255247", "validThrough": "2020-11-18T23:59:59+0000"}