{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-02T11:01:20+0000", "description": "&lt;p&gt;The Acute Medicine department is looking to appoint enthusiastic, highly motivated and dynamic Consultant colleagues to join our team in Acute Medicine at North Manchester Hospital. The consultants in our current team have varied sub-specialty interests and are supported by a large multidisciplinary team of junior trainees, clinical fellows, ACPs and a dedicated physiotherapy, occupational therapy and social work team for our unit. We have excellent record of developing and retaining senior nursing colleagues for our unit.&lt;/p&gt;\n&lt;p&gt;This truly is an exciting time to join North Manchester General Hospital. A once-in-a-generation opportunity will see our hospital rebuilt and the creation of a health hub within our grounds. This creates a rare opportunity to become involved with these changes and part of the new future of the site. On 1st April, 2020, we became part of the Manchester University NHS Foundation Trust under a management agreement. We expect to transfer formally into the Trust in the near future. MFT is made up of 9 hospitals across 6 sites, providing a wide range of services from comprehensive local general hospital care to highly specialised regional and national services.&lt;/p&gt;\n&lt;p&gt;This will be the final piece in a plan that set out the benefits of creating a Single Hospital Service for the city of Manchester, uniting multiple hospitals and a provider of community services. We are part of changing the way care is delivered to address health inequalities in our region. Join us and you will be part of a hospital with an important role in our communities. We are proud of our history, serving North Manchester communities since 1876. One of the first things you will realise when you join us is the community feel and the supportive and nurturing culture.&lt;/p&gt;\n&lt;p&gt;We are constantly developing the acute medical unit and expanding Consultant support to ensure Consultant delivered care is available 7 days a week. North Manchester has successfully achieved and demonstrated an appetite for service development. We welcome imaginative and innovative ways of addressing the demands in acute medical care. The post will include weekend sessions 1:8.&lt;/p&gt;\n&lt;p&gt;You’ll thrive in our open, inclusive and collaborative environment where everyone matters, and is respected for who they are. We will help you to develop, and support you to deliver your very best work.&lt;/p&gt;\n&lt;p&gt;The posts are based at North Manchester General Hospital and provide senior medical support to our 50 bedded Medical Assessment Unit and our Ambulatory Care Unit.&lt;/p&gt;\n&lt;p&gt;The posts are offered at 10 PAs; however the service actively encourages 1.5 PAs of sessions in other specialties within this:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Care of the Elderly – Frailty sessions&lt;/li&gt;\n&lt;li&gt;Diabetes and Endocrine&lt;/li&gt;\n&lt;li&gt;Endoscopy&lt;/li&gt;\n&lt;li&gt;Infectious Diseases&lt;/li&gt;\n&lt;li&gt;Respiratory Medicine&lt;/li&gt;\n&lt;li&gt;Other specialty sessions at MFT can also be explored.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for clinicians who may wish to take up roles in the following areas as part of their job plans to facilitate their further development:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Medical leadership (clinical lead / clinical director)&lt;/li&gt;\n&lt;li&gt;Medical education&lt;/li&gt;\n&lt;li&gt;Service improvement/Audit &amp; guidelines&lt;/li&gt;\n&lt;li&gt;Incidents &amp; governance/Mortality&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Trust Vision&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to be:&lt;/p&gt;\n&lt;p&gt;&#39;A leading provider of joined up healthcare that will support every person who needs our services, whether in or out of hospital to achieve their fullest health potential.&#39;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Trust Values&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Values guide every action we take. They determine how we work and the promise we make to our patients, their families, the public and each other as colleagues.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WE ARE&lt;/strong&gt;: Quality Driven, Responsible, and Compassionate.&lt;/p&gt;\n&lt;p&gt;All Trust sites are within easy reach of Manchester city centre which offers a wealth of leisure and social opportunities, easily accessible by road or public transport.&lt;/p&gt;\n&lt;p&gt;The appointee will be on the Specialist register or within 6 months of achieving a CCT (or equivalent) at the date of interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJo BaxterJob titleConsultant in Acute Medicine and Infectious Diseases, Clinical LeadEmail addressjoanne.baxter@pat.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nicola Lyons, Directorate Manager, U&amp;EC: nicola.lyons@pat.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Consultant Physician in Acute Medicine,", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251684", "validThrough": "2020-11-16T23:59:59+0000"}