{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum. NHS Agenda for Change"}}, "datePosted": "2020-11-03T08:16:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Base&lt;/strong&gt;: Emergency Operations Centre, Coxheath, Maidstone, Kent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours of work&lt;/strong&gt;: Full time 37.5 hours per week, part time hours will be considered&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you an experienced mental health professional looking for a new challenge within a unique career opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are, here at the South East Coast Ambulance Service (SECAmb) we very much want to hear from you.&lt;/p&gt;\n&lt;p&gt;Within a new innovative ambulance service initiative, we are now recruiting mental health professionals to our Emergency Operations Centres (EOC’s) in the roles of Mental Health Clinicians. These new roles will ensure we deliver expert support and advice to our patients, as well as offering expert clinical advice and support to our EOC staff and responding resources.&lt;/p&gt;\n&lt;p&gt;Your role will include clinical mentoring and supervision in the area of mental health, the provision of remote triage as well as liaising with other mental health services, to ensure the best possible care for patients with mental health challenges that come into contact with our service.&lt;/p&gt;\n&lt;p&gt;You will be trained in the use of our clinical systems and triage pathways. You will also have access to clinical supervision with oversight from our Consultant Mental Health Nurse and access to excellent training opportunities.&lt;/p&gt;\n&lt;p&gt;Please be aware, while this post will begin in Coxheath by the spring of 2022 we expect to move into new premises in Bredgar Road, Gillingham.&lt;/p&gt;\n&lt;p&gt;This new multi-purpose ambulance centre will comprise of a Make Ready Centre - a vehicle preparation system which sees specialist teams of staff employed to clean, restock and maintain the Trust’s fleet - and our 999 EOC East and NHS 111 IUC operations teams, currently based in Coxheath and Ashford, on the upper two floors of a modern, open-plan office complete with training, rest and wellbeing facilities.&lt;/p&gt;\n&lt;p&gt;This is a really positive, cooperative change whereby we will be operating Field Operations, 999 and our 111 services from the same building - we will be only the second Ambulance Trust in the country to unite both our 999 and 111 services in this way.&lt;/p&gt;\n&lt;p&gt;The move will vastly improve the working environment for our East EOC and 111 colleagues and mirror the Trust’s West Emergency Operations Centre, based in Crawley, which opened in 2017.&lt;/p&gt;\n&lt;p&gt;Please give this due consideration before continuing your application with us.&lt;/p&gt;\n&lt;p&gt;If you are a current SECAmb employee, by applying for this position, if successful you will move to the terms and conditions associated with the post. Any unsocial hours payments will be paid under the Section 2 agreement of agenda for change. Section 2 unsocial hours will need to be claimed via your monthly timesheet. More information regarding section 2 can be found in the Agenda for Change handbook and on the our dedicated Section 2 page on The Zone .&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;recruitment@secamb.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121186.jpg", "name": "South East Coast Ambulance Service NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121186"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Emergency Operations Centre, Coxheath", "postalCode": "ME17 4BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2318", "longitude": ".495384"}}, "title": "Mental Health Clinician - East", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253132", "validThrough": "2020-11-15T23:59:59+0000"}