{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. (pro rata)"}}, "datePosted": "2020-11-04T09:00:44+0000", "description": "&lt;p&gt;We are Manchester Local Care Organisation- an exciting, new public sector organisation that is bringing together NHS community health services and social care services in the city. We&#39;re driven by the aim of improving the health of local people in Manchester by working across organisational boundaries.&lt;/p&gt;\n&lt;p&gt;The first health and social care staff were deployed in April 2018 and have start to work in new ways across the city. Our teams work as one in the their neighbourhoods, delivering and designing services in partnership with local people. We also provide key services that work across wider localities and city-wide. We believe that our pioneering approach will make a massive difference to the health of people in our city and we are looking for you to join our team and help us do this.&lt;/p&gt;\n&lt;p&gt;We have a Band 6 District Nursing Sister post available in our friendly, hard working team based in the community in Central Manchester. - Gorton South Neighbourhood Office. We serve a diverse population within Manchester with a busy home visiting and treatment room caseload. The post holder will manage a caseload and work alongside the Band 7 District Nursing Team Lead, community nurses and nursing associates to deliver high quality care to the patients referred to the service. The post is full time but we will consider part time/job share applications&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulie BestJob titleDN Team LeaderEmail addressJulie.best@mft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;dena.daniel@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Central Manchester, Manchester", "postalCode": "M18 7GS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4573", "longitude": "-2.18145"}}, "title": "District Nursing Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255137", "validThrough": "2020-11-10T23:59:59+0000"}