{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a. inc."}}, "datePosted": "2020-11-02T15:01:48+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within our Intensive Care department for a Band 6 Senior Staff Nurse to join our team. We are seeking to appoint an experienced and motivated Critical Care Nurse, who has vision and enthusiasm for change and development.&lt;/p&gt;\n&lt;p&gt;At Homerton ICU we recognise that our team members are our greatest asset – it’s their hard work and effort that really makes a difference. That’s why we encourage our staff to fulfil their full potential. We’ll do everything we can to support you, along with offering excellent learning and development opportunities including a structured Band 6 Development Programme, shift management, Simulation training and the opportunity to lead on Practice Development projects.&lt;/p&gt;\n&lt;p&gt;You will have proven clinical skills and a post registration qualification in Critical Care, whilst showing enthusiasm and professionalism in the development of your leadership and management skills&lt;/p&gt;\n&lt;p&gt;We offer a warm welcome and a friendly working environment for your commitment to working internal rotation throughout the 24hr period, encompassing Bank Holidays and weekends.&lt;/p&gt;\n&lt;p&gt;Homerton has a proud tradition of supporting and developing its staff, including its well-regarded and valued nursing community, and all staff are able to take advantage of a great range of benefits including salary sacrifice and discount schemes.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This appointment will be subject to a satisfactory completion of a 6 month probationary period for new starters to the Trust.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lucy Jenkins Ph: 0208 510 7303 / Email: lucy.jenkins3@nhs.net&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Homerton University Hospital, Homerton Row, London, E9 6SR, London", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252545", "validThrough": "2020-11-16T23:59:59+0000"}