{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Spot Salary"}}, "datePosted": "2020-11-05T09:20:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Rehabilitation Assistant&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt; &lt;strong&gt;SPOT SALARY&lt;/strong&gt;&lt;br /&gt; &lt;strong&gt;LOCATION ( Keynsham Health Centre, St Clements Road ,Keynsham , Bristol , BS31 1AF&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you athoughtful and dedicatedreablement Therapy Workerbased in theBath and North East Somerset Area?Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every 10 of the people who use services would recommend them?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will receivespot salary, group pension, laptop and mobile enabling fantastic flexible working patterns that can help you lead a perfect work/life balance.We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression.We will offer a combination of in house eLearning, workshops and courses to support your development.&lt;/p&gt;\n&lt;p&gt;You will become part of the Virgin Tribe. This grants you access to premier offers on Virgin Products such as holidays.&lt;/p&gt;\n&lt;p&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working within theBath and North East Somerset Reablementteams, you willassist service users in their rehabilitation journey, guided by the qualified therapists, in order to work with people with a range of physical and psychological conditions with diverse needs.You will provide rehabiltation to patients in their own home to restore independence with functional activities and provide support where this is not possible. This will include a reabling approach to washing and dressing routines , preparing or accessingmeals , managing medications,mobilising within the home and other approaches to restore independance.You will be based at Keynsham Health Centre with access to the beauty of Bath and near also to the city of Bristol.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Inspired&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at Virgin Care, colleague recognition is important to us and we know that across our services there are colleagues who deserveacknowledgementfor their commitment for going above and beyond to ensure that their colleagues and service users feel the difference. Every year we hold Feel the Difference Awards where nominated colleagues get together for a celebration to receive their prize for their recognised hard work!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or request the full job description, please contactLesley Brooker via email:&lt;span style=&quot;text-decoration: underline;&quot;&gt;Lesley.Brooker@&lt;/span&gt;&lt;em&gt;virgincare&lt;/em&gt;&lt;em&gt;.co.uk&lt;/em&gt;,&lt;/p&gt;\n&lt;p&gt;You’re welcome to come in for a virtualinformal visit, meet our friendly team and ask any queries you may have before you apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We partner with the NHS to make a real difference to people inBathand North East Somersetand we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA2 5RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3578", "longitude": "-2.37292"}}, "title": "Reablement Therapy Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257033", "validThrough": "2020-11-19T23:59:59+0000"}