{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum (pro rata)"}}, "datePosted": "2020-11-05T15:31:37+0000", "description": "&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Opportunities have arisen for enthusiastic and motivated individuals to work within the Facilities Division at Birmingham Community Healthcare Foundation NHS Trust as Housekeepers. The vacancies will be based at Moseley Hall Hospital but may be asked to cover other Trust sites.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to undertake tasks in line with a daily schedule and work under the instruction of the Facilities Supervisor&lt;/p&gt;\n&lt;p&gt;The housekeeper will enhance the patient’s experience by ensuring that the clinical environment is presented and maintained in a way which maximises the patient’s sense of comfort, safety and well-being.&lt;/p&gt;\n&lt;p&gt;The successful candidates will have the ability to work on their own initiative and as part of a team, with the ability to communicate effectively to patients, staff and visitors.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working towards NVQ level 2, British Institute of Cleaning Science in Domestic Services&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Various sites within Moseley Hall Hospital (must be flexible as role not pertaining to any one specific area at Moseley Hall Hospital)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours of Work:&lt;/strong&gt; Various – must be flexible. Working across a 7 day week Monday - Sunday&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your TRAC account regularly as this is how we will communicate with you during the shortlisting and selection process.&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application from are completed fully. Please particularly ensure that you provide full details of referees including business email address, telephone contact details and postal address.&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMargaret BeckfordJob titleInterim Site Facilities CoordinatorEmail addressmargaret.beckford@bhamcommunity.nhs.ukTelephone number0121 466 6670Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details and informal visits please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Julie O’Connor on 0121-466 6628 or 0789 533 1592&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;julie.o’connor@ bhamcommunity.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moseley Hall Hospital, Birmingham", "postalCode": "B13 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4459", "longitude": "-1.89289"}}, "title": "Band 2 Housekeeper", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258355", "validThrough": "2020-11-19T23:59:59+0000"}