{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26324", "minValue": "26324", "unitText": "YEAR", "value": "£15.66 Per Hour"}}, "datePosted": "2020-10-02T14:28:09+0100", "description": "&lt;p&gt;&lt;strong&gt;NHS Professionals in partnership with University Hospital Plymouth NHS Trust are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Neonatal Intensive Care Registered Nurses to join the bank.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Flexible and long term opportunities are available.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location – Derriford Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PAY RATES&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;- Day rate: £15.66 per hour &lt;span style=&quot;text-decoration: underline;&quot;&gt;paid weekly&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;- Night/Saturday rate: £20.35 per hour &lt;span style=&quot;text-decoration: underline;&quot;&gt;paid weekly&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;- Sunday/Bank Holiday rate: £25.05 per hour &lt;span style=&quot;text-decoration: underline;&quot;&gt;paid weekly&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS Professionals is the leading provider of managed flexible workforce services to the NHS with approximately 40,000 nurses, doctors, administration and clerical and other healthcare professionals signed to its bank. We help our 62 NHS Trust clients implement tactical measures to improve workforce efficiency and productivity as part of an overall workforce strategy&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking Registered NICU Nurses who are motivated and enthusiastic with excellent communication and team working skills to join our bank.&lt;/p&gt;\n&lt;p&gt;In order to apply for this post you must have a minimum of 6 months’ experience in a similar role held within the last 2 years, and hold NMC Registered Nurse (RN1) qualification and a valid PIN.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder should be able:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Review and update plans of care and documents, according to NMC and Trust Policies&lt;/li&gt;\n&lt;li&gt;Practice in accordance with NMC Guidelines and scope of practice, and within Directorate and Trust policies&lt;/li&gt;\n&lt;li&gt;Administer medications safely according to NMC and Trust policy&lt;/li&gt;\n&lt;li&gt;Ensure safe and effective care for patients requiring advanced clinical skills, seeking support when required&lt;/li&gt;\n&lt;li&gt;Assess and recognise emergencies within the speciality, interpreting information and taking appropriate action, seeking support when required&lt;/li&gt;\n&lt;li&gt;Assess educational and information need for patients and families and devise plans to ensure needs are met, seeking support where required&lt;/li&gt;\n&lt;li&gt;Participate in clinical audit or research programmes within the clinical area&lt;/li&gt;\n&lt;li&gt;Contribute to the orientation, development and training needs of students and other staff&lt;/li&gt;\n&lt;li&gt;Adheres to the Nursing and Midwifery Council Code of Conduct and other associated guidelines and adheres to all Trust policies&lt;/li&gt;\n&lt;li&gt;Communicate effectively, in demanding and sometimes challenging situations&lt;/li&gt;\n&lt;li&gt;Work as part of a team and collaborate with other clinical areas to promote good working relationships&lt;/li&gt;\n&lt;li&gt;Ensure the needs of the patient and their family are taken into account and needs are assessed, planned, implemented and evaluated&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional, caring and reliable service you will have access to the following benefits:&lt;/p&gt;\n&lt;p&gt;- Competitive, weekly pay&lt;/p&gt;\n&lt;p&gt;- Paid annual leave&lt;/p&gt;\n&lt;p&gt;- Training and development opportunities&lt;/p&gt;\n&lt;p&gt;- Access to our very own pension’s scheme called ‘NHSP Stakeholder pension’&lt;/p&gt;\n&lt;p&gt;- Access to a wealth of Health Service Discounts&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that you will be contacted via email throughout the recruitment process, so please check your emails regularly.&lt;/p&gt;\n&lt;p&gt;We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "NICU Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916210985", "validThrough": "2021-01-10T23:59:59+0000"}