{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T10:46:01+0000", "description": "&lt;p&gt;H4 is SCAPE accredited.&lt;/p&gt;\n&lt;p&gt;Are you looking for an opportunty to develop your nursing and leadership skills? Are you able to work autonomously and lead by example? Then H4 ward is for you.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a highly motivated and committed Band 6 Nurse Practitioner. This will be an opportunity to develop your skills in leadership and management. The successful applicant would need to be able to support and nuture a junior team, whilst also providing support along with the other senior nurses to the ward manager.&lt;/p&gt;\n&lt;p&gt;Ward H4 is a busy surgical mixed sex surgical ward consisting of different specialities: urology, orthopaedic, ENT, gynaecological and acutely unwell surgical patients.&lt;/p&gt;\n&lt;p&gt;Experience of surgical nursing would be desirable but not essential.&lt;br /&gt;&lt;br /&gt;If you have the drive and determination to succeed in a progressive successful organisation, whilst ensuring high quality, safe care, underpinned by best practice which is consistently delivered we would like you to apply&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Kathryn Hale&lt;/p&gt;\n&lt;p&gt;Job title Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address Kathryn.Hale@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number0161 206 0502&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Band 6 Nurse Practitioner - Ward H4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257302", "validThrough": "2020-11-19T23:59:59+0000"}