{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "8405", "minValue": "8405", "unitText": "YEAR", "value": "5 Programmed Activities or Equivalent"}}, "datePosted": "2020-10-12T16:19:58+0100", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;System Medical Director &lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;Salary: 5 Programmed Activities or Equivalent to&lt;/p&gt;\n&lt;p&gt;USP info about the Trust to be added here by recruitment&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join an innovative Integrated Care Organisation in the role of System Medical Director for the South Devon System.&lt;/p&gt;\n&lt;p&gt;The System Medical Director (SMD) is a Consultant/GP role with managerial accountability for all services within the South Devon System as part of the Senior Leadership Team (SLT) together with specified cross-organisational functions.&lt;/p&gt;\n&lt;p&gt;The role is accountable to the Executive Medical Director and to the Chief Executive and will work within the System Leadership Team with the System Director and System Director of Nursing &amp; Professional Practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic leader who can inform and shape the SLT and Trust strategies, support the communication and consultation in such strategies, share corporate responsibility for the achievement of the Trust’s corporate objectives and for driving forward a culture of change, innovation, development and modernisation.&lt;/p&gt;\n&lt;p&gt;Professionally accountable for the Associate Medical Directors within the South Devon System you will be able to demonstrate a proven ability to implement a strong infrastructure of medical leadership within the Trust.&lt;/p&gt;\n&lt;p&gt;If you are a Medical Leader with significant clinical and managerial leadership experience at senior level, that is innovative and has a collaborative approach we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;This is an ideal opportunity for an individual to bring their energy and vision to our journey of continuous improvement, engaging with a wide range of partners to work collaboratively within the emerging Integrated Care System and regional system to drive transformation and improvements to patient care for our population.&lt;/p&gt;\n&lt;p&gt;We would actively welcome applications from our GP colleagues.&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion please contact:&lt;/p&gt;\n&lt;p&gt;Ian Currie Executive Medical Director ian.currie@nhs.net tel: 01803 654507&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torbay Hospital", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "System Medical Director - Torbay &amp; South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223185", "validThrough": "2020-11-15T23:59:59+0000"}