{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27966", "minValue": "27966", "unitText": "YEAR", "value": "£27,966 p.a."}}, "datePosted": "2020-10-29T18:26:14+0000", "description": "&lt;h1&gt;Targeted Mental Health Clinical Practitioners             &lt;/h1&gt;\n&lt;h1&gt;Salary: £27,966 p.a.&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;37 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;TaMHS are Swindon’s Tier 2 CAMHS service, we work with Children and Young People from 0-18 to deliver short term evidenced based interventions to improve their mental health and emotional well-being.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a member of this innovative team you will be based within the Early Help teams, and will work under the supervision of the Senior Clinical Practitioners to deliver a range of individual and group interventions in a variety of settings. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be a dynamic and forward thinking team player with a vision to drive forward a range of initiatives and be prepared to meet the challenges of a changing and developing service.  You will be responsible for managing your own caseload of children and young people between the ages of 0-18 for which you will co-ordinate care in conjunction with other professionals in the Early Help teams, schools, voluntary sector and CAMHS.  You will also undertake assessments and short term therapeutic intervention. At times you may be required to construct and deliver training to professionals from a variety of backgrounds.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We welcome applications from qualified health or social care professionals, an equivalent professionally accredited qualification with relevant experience is an alternative skill set requirement all of whom need to be currently registered with the relevant professional body. Relevant experience of working with children, young people and families in a multi-agency setting is desirable.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;You should also possess excellent communication skills and the ability to develop relationships with professionals, young people and their families. IT proficient you will also demonstrate the ability to work creatively and on your own initiative. In return you can expect our commitment to your continuing professional development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; An enhanced DBS disclosure will be requested for the successful applicants.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You must be fluent in the English language (as a requirement of Part 7 of the Immigration Act – for the effective performance of a customer-facing role).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role, please call Danielle Kemp - dkemp@swindon.gov.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 12 November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Swindon Borough Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SN1 2JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5602", "longitude": "-1.77996"}}, "title": "Targeted Mental Health Clinical Practitioners", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249264", "validThrough": "2020-11-12T23:59:59+0000"}