{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-26T12:16:22+0000", "description": "&lt;p&gt;Do you wish to work in a modern facility where you will have the opportunity to enhance your specialist skills? If so, the Day Surgery Unit at Princess Royal Hospital is a purpose built elective Day Surgery Unit and is part of the Brighton and Sussex University Hospitals. We work closely with the Trust&#39;s other Day Surgery Unit which is based in Lewes. We currently undertake the following specialties, Vascular, Hand Trauma, and ophthalmology.&lt;/p&gt;\n&lt;p&gt;We are currently looking for an experienced and enthusiastic Day Surgery Unit Practitioner who wants to take the opportunity to develop their skills in this specialty.&lt;/p&gt;\n&lt;p&gt;Experience in anesthetics, is essential, and experience in scrub, recovery and ward is highly desirable, or a willingness to undertake training for these areas will be required. You will provide effective clinical advice, support &amp; teaching to all relevant personnel within the department supporting the senior staff and Unit Manager in the daily management of the clinical area.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on having excellent patient satisfaction and ensure our clinical outcomes are closely monitored.&lt;/p&gt;\n&lt;p&gt;In brief the Day Surgery Unit comprises of an admissions area, anaesthetic room, operating theatre, recovery and a second stage recovery ward.&lt;/p&gt;\n&lt;p&gt;The post holder will complete an orientation period to the clinical area in accordance with the Trust’s induction programme. You will also be supported in your ongoing professional development.&lt;/p&gt;\n&lt;p&gt;We are proud to be able to offer a variety of flexible working options and contracts. For further information please refer to the Flexible Working for Registered Nurses document which is attached to this advert.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSuzanne AnsellJob titleDay Surgery Unit ManagerEmail addresssuzanne.ansell1@nhs.ukTelephone number01444441881 ext 5878&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal Hospital, Haywards Heath", "postalCode": "RH16 4EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9912", "longitude": "-.09105"}}, "title": "Day Sugery Unit Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242367", "validThrough": "2020-11-08T23:59:59+0000"}