{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 to £37,267 per annum"}}, "datePosted": "2020-10-22T13:01:02+0100", "description": "&lt;p&gt;&lt;strong&gt;Somerset NHS Foundation Trust are excited to offer the opportunity for an AHP Practice Facilitator, Band 6 to join our thriving and engaging Learning and Development Team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you passionate about facilitating and supporting the development of others? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a team our aim is to support &lt;strong&gt;ALL&lt;/strong&gt; learners across the Trust by supporting our fantastic Clinical and Non Clinical Teams with development and learning.&lt;/p&gt;\n&lt;p&gt;We support and facilitate these excellent learning opportunities across the Trust by working closely with Supervisors in practice, our University Partners and our Learners.&lt;/p&gt;\n&lt;p&gt;You will work closely with the clinical teams supporting learners in practice and facilitate the implementation of new placement models.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in one of the most desirable places within the UK?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will get the opportunity to work countywide across Somerset NHS Foundation trust. Here, you can soak up all that the idyllic countryside has to offer with our areas of outstanding beauty and stunning coastlines. You get to enjoy these perks whilst still only being a stone’s throw away from bustling city centres like Bristol, Bath and Exeter and only two hours away from London.&lt;/p&gt;\n&lt;p&gt;There are excellent educational facilities in the area and, when compared to other regions, house prices are reasonable. You get to experience the best of both in Somerset, the countryside and the cosmopolitan – there is truly something for everyone!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Is this the ideal role for you? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you a Registered Allied Health Professional looking to develop your career?&lt;/li&gt;\n&lt;li&gt;Are you enthusiastic and motivated with a passion to support and inspire others?&lt;/li&gt;\n&lt;li&gt;Do you have experience in supporting Pre-Reg Learners in practice?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you answered ‘yes’ to these questions then we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;For further information about this innovative role, please contact Daniel Ashman, AHP Practice Facilitator, Daniel.ashman@somersetFT.nhs.uk or 07879 672797&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Exchange, Bridgwater, TA6 4RN, Bridgwater", "postalCode": "TA6 4RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1457", "longitude": "-2.99161"}}, "title": "AHP Practice Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238558", "validThrough": "2020-11-08T23:59:59+0000"}