{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-28T11:46:25+0000", "description": "&lt;p&gt;Applications are invited for this exciting post within the Forensic and Specialist Care Group.&lt;/p&gt;\n&lt;p&gt;The post holder will act as the key point of contact for carer related signposting, support and communication for the medium, low secure and low secure learning disability services. Based across Maidstone and Dartford sites, the post holder will develop links and work closely with carer related organisations throughout Kent in order to effectively connect carers with services that may be of benefit to them.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with the Forensic and Specialist carer experience lead to ensure that the services continue to be innovative in their approach to working with carers and involving them in service development. They will support in the implementation and successful delivery of the Forensic Friends, Family and Carer strategy and will feed back on their input regularly in a range of meetings both local and external.&lt;/p&gt;\n&lt;p&gt;Applicants must have a good understanding of the challenges facing friends, family and carers of those in our services and ideally should already have hands on experience of working with carers. They should also have excellent communication skills which will allow them to effectively build relationships with carers and with staff in the services. The post holder will provide support for carers champions in each of the inpatient services and will be heavily involved in work around the Triangle of Care.&lt;/p&gt;\n&lt;p&gt;Applicants must be ‘can do people’, organised, thorough, have an ability to think on their feet and able to follow processes well, seeing tasks through from start to finish.&lt;/p&gt;\n&lt;p&gt;Applicants must be able to work as part of team as well as demonstrating a clear ability to work autonomously and be motivated to deal with new challenges and changing environments.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachael SandersonJob titleInterim AHP Lead for Forensic and Specialist ServicesEmail addressrachael.sanderson@nhs.netTelephone number01622 723100Additional contact information&lt;/p&gt;\n&lt;p&gt;In Rachael&#39;s absence, Claire Cloude. 01622 723100&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trevor Gibbens Unit, Maidstone", "postalCode": "ME16 9PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2722", "longitude": ".488325"}}, "title": "Family Engagement and Liaison Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246391", "validThrough": "2020-11-11T23:59:59+0000"}