{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-28T11:18:07+0000", "description": "&lt;p&gt;North Cumbria is moving towards a universal Crisis Team model of care, where people of all ages and Mental health conditions, will receive skilled assessment from an appropriate professional with specialist knowledge, no matter what their age or mental health condition.&lt;/p&gt;\n&lt;p&gt;We see this as a positive move forward and are excited for this service development. The principle objective of the service, is to offer assessment and home treatment to people experiencing a mental health crisis as an alternative to a hospital admission. We are passionate about suicide prevention and work closely with individuals and their families utilising a person centred approach, to try and reduce these tragic incidents.&lt;/p&gt;\n&lt;p&gt;We have successfully developed a pathway for children and are now looking to take the next step, which is to expand our workforce further and develop our pathway for older adults that are experiencing a mental health crisis.&lt;/p&gt;\n&lt;p&gt;We would welcome skilled applicants who have a passion for working with older adults with memory and functional mental health issues, who have experience of working with carers and our partner care agencies.&lt;/p&gt;\n&lt;p&gt;You will have time to deliver therapeutic interventions with patients and families in home treatment and opportunities to provide crisis assessments. You will have the opportunity to work closely with the police and NWAS to avoid using MHA 136. We are working towards being HTAS accredited. You will be joining an experienced MDT of nurses, OT’s, art therapists, support workers, social workers and psychiatrists, all committed to sharing skills and developing knowledge and achieving the best possible outcomes for patients.&lt;/p&gt;\n&lt;p&gt;We would like to recruit practitioners who are motivated, willing to be flexible, well organised and adaptable. You will work in a highly supportive environment, as part of the wider older adult pathway which would offer opportunities to access additional training and further your development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Barbara Slater&lt;/p&gt;\n&lt;p&gt;Job title: Team Leader&lt;/p&gt;\n&lt;p&gt;Telephone number: 01228 603092&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carleton clinic, Carlisle", "postalCode": "CA1 3SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8749", "longitude": "-2.88374"}}, "title": "Community Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246296", "validThrough": "2020-11-11T23:59:59+0000"}