{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa/ pro rata for part time staff"}}, "datePosted": "2020-10-30T16:00:47+0000", "description": "&lt;p&gt;&lt;strong&gt;Is your heart in Cardiology?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you enjoy a challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to work in a specialised regional tertiary centre caring for patients with complex cardiology conditions?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If so, come and join our dedicated team.&lt;/p&gt;\n&lt;p&gt;The unit provides a comprehensive range of diagnostic and treatment services for the management of all aspects of coronary heart disease serving both local and regional districts including Sheffield, Rotherham, Barnsley, Doncaster and Bassetlaw.&lt;/p&gt;\n&lt;p&gt;The Sheffield Cardiology unit comprises of:-&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Chesterman 2&lt;/em&gt;&lt;/strong&gt; is a 23 bedded day ward incorporating a radial lounge which also supports the cardiology pre admission clinic. This ward also provides care for patients within the Ambulatory Heart Failure Service. This is also the hub for patients accessing the cardiac catheter suite pre and post procedure.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Cardiac Catheter Suite&lt;/em&gt;&lt;/strong&gt; the Cardiac Catheter Suite provides highly specialised cardiac services to the whole of the South Yorkshire Region. The unit provides a 24-hour service for patients requiring urgent treatment and comprises of 5 theatres, a 5 bedded recovery area and a day ward where patients recover post procedure.&lt;/p&gt;\n&lt;p&gt;We will ensure that you excel within the unit by providing the knowledge and skills required to care for patients during all areas of their journey.&lt;/p&gt;\n&lt;p&gt;This begins with a comprehensive induction and competency package and has a dedicated clinical educator to ensure training requirements are met.&lt;/p&gt;\n&lt;p&gt;Upon completion of the competency package, staff working in the cardiac catheter suite will join the on-call rota for out-of-hours emergencies. You must live within 30 minutes of the Northern General Hospital and be a car driver to work within the Cardiac Catheter Suite.&lt;/p&gt;\n&lt;p&gt;Our wards and units support several advanced practice initiatives. This includes; educating Trainee Associate Practitioners, Advanced Clinical Practitioners and Nursing Associates. You will be guided and assisted by our enthusiastic team to develop essential skills and experience; this is supported by our two dedicated cardiology educators.&lt;/p&gt;\n&lt;p&gt;We are strongly supportive of flexible working patterns and are happy to consider staff who wish to work part time and can support requests for specific working patterns with some set days or regular nights where needed. Such arrangements will be subject to annual review to ensure the departments are meeting your needs and the needs of the service are met.&lt;/p&gt;\n&lt;p&gt;With a variety of experiences available within cardiology we strongly advocate and make available rotation between all areas to enhance skills and knowledge.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Matron Ann Matto&lt;/strong&gt; &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Tel: 0114 2714365&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Email: ann.matto@nhs.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern General Hospital, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Staff Nurse (Cardiology)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250853", "validThrough": "2020-11-15T23:59:59+0000"}