{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-21T15:31:02+0100", "description": "&lt;p&gt;Strategic Development Senior Manager x 1&lt;/p&gt;\n&lt;p&gt;Leicester City, West Leicestershire and East Leicestershire and Rutland Clinical Commissioning Groups (CCGs) are employers in their own right that commission health care in Leicester City, Leicestershire and Rutland. Please note if you are successful in your application the CCG which has placed the advertisement will be your employer.&lt;br /&gt;Further information on the CCGs can be found by visiting their individual websites:&lt;br /&gt;• NHS East Leicestershire and Rutland CCG&lt;br /&gt;• NHS Leicester City CCG&lt;br /&gt;• NHS West Leicestershire CCG&lt;br /&gt;Leicester City, West Leicestershire, and East Leicestershire and Rutland CCGs commission and provide health and care services for over a million people in Leicester, Leicestershire and Rutland (LLR) and have a combined budget of c. £1.5 billion. The population and budget broadly divide equally between the three CCGs. The combined total of Primary Care Networks is 25. The CCGs are accountable for all strategic commissioning and contract management arrangements for the provider contracts. The three LLR CCGs work collaboratively with the local authorities in addition to the borough/district councils in Leicestershire.&lt;/p&gt;\n&lt;p&gt;The Leicester, Leicestershire and Rutland (LLR CCGs) are progressing plans to appoint a Strategic Development Senior Manager. This post is within the CCGs’ Strategy and Planning Directorate. The Strategy and Planning Directorate is a newly formed directorate with a mandate to collaborate with partners across LLR to define the system strategic priorities. This will include developing plans at System, Place and Neighbourhood to deliver an improvement in health outcomes, reducing health inequalities and responding to growth.&lt;br /&gt;The post holder will:&lt;br /&gt;• Support the Head of Strategy and Planning and/or Head of Population Health Management to undertake strategic development activities across the CCGs and LLR system.&lt;/p&gt;\n&lt;p&gt;• Actively participate in the development of the Integrated Care System across LLR including developing the Long Term Plan for the system, setting the outcomes we want to achieve, and contributing to the development of a single commissioning voice in LLR.&lt;/p&gt;\n&lt;p&gt;• Support the development of strategic plans at system, place and neighbourhood level which incorporate joint commissioning priorities; prevention; a reduction in health inequalities and how the NHS can contribute to and support mutually important system priorities.&lt;/p&gt;\n&lt;p&gt;• Engage and maintain constructive relationships to develop a population health management approach across the system and within the strategic commissioning function&lt;/p&gt;\n&lt;p&gt;• Work collaboratively and cohesively across system partners to produce system level priorities and strategies that deliver and demonstrate an improvement in health outcomes, reduce variation and reduce health inequalities.&lt;/p&gt;\n&lt;p&gt;Desirable candidates will have previous experience in developing strategic plans with partner organisations, stakeholders and the public. Knowledge of the strategic developments expected of the NHS and Local Integrated System partners is essential as is a desire and ability to be a leader in this work across LLR.&lt;/p&gt;\n&lt;p&gt;The closing date for applications is November 6th 2020. Interviews will be held during mid–late November. We would be delighted to have informal discussions with potential applicants wishing to know more about the role. Those wishing to discuss the requirements of the post should contact kanta.patel@leicestercityccg.nhs.uk (Executive Assistant, Strategy &amp; Planning Directorate, LLR CCG) to arrange a call with one of the senior team.&lt;/p&gt;\n&lt;p&gt;LLR CCG staff are predominantly working from home, we anticipate this will continue for at least the coming months and potentially be an ongoing arrangement.&lt;br /&gt;Applicants are encouraged to note this when considering their application in relation to their current geographical location.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicester City, Leicestershire and Rutland CCG’s", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128398"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester, Leicester", "postalCode": "LE1 6NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6316", "longitude": "-1.1271"}}, "title": "Strategic Development Senior Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237103", "validThrough": "2020-11-06T23:59:59+0000"}