{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-03T17:00:38+0000", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANT POST IN OTOLARYNGOLOGY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a consultant post in the department of Otrolaryngology. This is a substantive, full time post which is part of a well-established consultant team across the Norfolk and Waveney combined Ears Nose and Throat (ENT) service. This post will be based at the James Paget University Hospital (JPUH).&lt;/p&gt;\n&lt;p&gt;This role forms part of an exciting development as we continue to create a regional ENT team. The ENT Departments, based at NNUH and the James Paget University Hospitals NHS Foundation Trust (JPUH) have recently joined under the Norfolk and Waveney Sustainability and Transformation Partnership (STP). This joining of acute services has paved the way for the transformation of provisions in the ENT pathways across the region, as we work towards our ambition of a fully integrated ENT service covering the Norfolk and Waveney area.&lt;/p&gt;\n&lt;p&gt;The NNUH and JPUH combined offer comprehensive ENT care to around 750,000 people across Norfolk and the Waveney District with a wider catchment for more specialised services. The Paediatric ENT service is based at the Norfolk and Norwich University Hospital site.&lt;/p&gt;\n&lt;p&gt;The appointee will be predominantly based at the James Paget University Hospital (JPUH) and will have on-call responsibilities, which are currently 1 in 13, and come with a 3% on-call availability supplement.&lt;/p&gt;\n&lt;p&gt;Although the post is predominantly a general ENT post including urgent and routine outpatient referrals, in-patient and day surgery lists, the appointee would be encouraged to develop a sub-speciality interest clinic in benign head and neck surgery, including thyroid, parathyroid and salivary gland surgery.&lt;/p&gt;\n&lt;p&gt;We are pleased to offer a relocation package of up to £8,000 for successful candidates (subject to meeting criteria as set out in our trust policy).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please refer to the ‘Job Description’ link to the right of the page for the full specification of responsibilities and requirements for this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date 1st December 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please attach a short CV.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The date for Advisory Appointment Committee is 2nd March 2021.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Mr Stuart Burrows (NNUH ENT Service Director) on 01603 287286 or Prof Carl Philpott (JPUH ENT Consultant) on 01493 452452.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "James Paget University Hospital, Gorleston, Great Yarmouth", "postalCode": "NR31 6LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5617", "longitude": "1.718"}}, "title": "Consultant in Otolaryngology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254866", "validThrough": "2020-12-01T23:59:59+0000"}