{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa pro rata"}}, "datePosted": "2020-11-03T12:17:01+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Be part of our journey to brilliant healthcare services across Cornwall, provided in modern “state of the art” environments to comfort, calm and delight our patients, our staff and our communities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Royal Cornwall Hospitals NHS Trust has a unique opportunity for an experienced Communications Manager to join our small, but talented, Strategic Estates team as our dedicated Communications Lead.&lt;/p&gt;\n&lt;p&gt;If you know the NHS, know what makes it tick, and could bring your communications expertise and enthusiasm to support our extensive programme of major strategic estates projects by delivering outstanding communications to patients, system partners and staff, then this could be the role for you.&lt;/p&gt;\n&lt;p&gt;We have ambitious plans in Cornwall, and over the next 10 years and beyond health services in Cornwall will undergo major transformation. Our exciting strategic estates plans include a new Women &amp; Children’s Hospital; the full reconfiguration of the rest of the only acute hospital in Cornwall; and a range of sensational community based redevelopment projects which will bring care closer to home and excellent healthcare facilities to the heart of our communities.&lt;/p&gt;\n&lt;p&gt;The Communications Lead for Strategic Estates will be responsible for the effective and efficient planning and implementation of communications, and stakeholder engagement, campaigns across all internal and external channels. In addition to working in a friendly and forward-thinking Trust, you will also have the opportunity to work on exciting projects with our partners in the local health care system.&lt;/p&gt;\n&lt;p&gt;You will be adept at managing a varied and pressurised workload, in a highly changeable environment, and will know how to balance large organisation communications requirements, with the need to understand, support and encourage patients, staff and other local stakeholders to get involved with the development of our new estates projects. You will be confident in managing the media; organising public events and with working alongside senior managers on internal, external and other complex or high profile issues, as required.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Roberta Fuller, Head of Hospital Reconfiguration on 07554 223585 or via roberta.fuller2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Communications Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253949", "validThrough": "2020-11-17T23:59:59+0000"}