{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum inclusive HCA"}}, "datePosted": "2020-10-15T09:31:53+0100", "description": "&lt;p&gt;Newham Talking Therapies (NTT), Centre for Clinical Excellence is looking to recruit 2 High Intensity CBT Therapists (1-year fixed term remote working post) to join a high performing and creative team. We are part of East London NHS Foundation Trust which has been rated Outstanding for the second year by Care Quality Commission (CQC) and are committed to ensuring a healthy work life balance and a positive working environment.&lt;/p&gt;\n&lt;p&gt;NTT is an exceptional talking therapies service with excellent development opportunities. We are committed to the progression of our team members and our posts are formulated to allow for development of clinical expertise in chosen clinical areas. As well as offering a range of therapies, the service also runs as a training centre, therefore offering opportunities for supervision and training.&lt;/p&gt;\n&lt;p&gt;The post-holder will be part of a very dynamic team and will work alongside PWPs as well as therapists trained in a range of therapies including systemic and couple therapies, EMDR, CBT psychodynamic and integrative therapies. We also have a dedicated team working with physical health related problems and long-term conditions; this offers those who work with our team plenty of opportunities to enhance their job satisfaction by learning more about this area and developing skills in working with this population. Although the post is offered as remote/home working, the service provides regular contact in the form of group and 121 meetings/huddles to encourage interaction within a highly supportive and caring team.&lt;/p&gt;\n&lt;p&gt;The post-holder will provide digital online web camera based high intensity cognitive behavioural therapy (CBT) in line with NICE guidance. We value training and qualifications in other high intensity therapies and will support those wishing to develop their careers by training in other recognised modalities. We also value experience or interest of delivering therapy in an online digital group format.&lt;/p&gt;\n&lt;p&gt;The post-holder will work with clients who present with a range of complex anxiety disorders, post- traumatic stress disorder and depression related problems at step 3 for which CBT is demonstrated to be clinically effective. The post holder will carry out telephone and web-camera based face to face assessments as part of their case load and depending on service need.&lt;/p&gt;\n&lt;p&gt;The post-holder will work with people with different cultural backgrounds and ages, using interpreters when necessary.&lt;/p&gt;\n&lt;p&gt;We are looking for a committed, enthusiastic and someone willing to contribute to the service and embrace different and modern ways of working. This post offers opportunities to work with a range of professionals from different therapeutic backgrounds and to be part of an evolving, integrating team. Members of our team are committed to ensuring a healthy work life balance and a creating a positive working environment.&lt;/p&gt;\n&lt;p&gt;This vacancy if offered as a one year fixed term opportunity, with the expectation that all clinical staff offer one late online evening clinic per week (12pm until 8pm).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LONDON", "postalCode": "E15 4ES"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5414", "longitude": ".010079"}}, "title": "Remote Working-High Intensity CBT Therapist (12-month fixed)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227498", "validThrough": "2020-11-08T23:59:59+0000"}