{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-02T10:46:15+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the Clinical Decisions Unit (CDU) in Glangwili General Hospital. We are looking for highly motivated, enthusiastic and dedicated individuals to join our team on either a full time or part time basis.&lt;/p&gt;\n&lt;p&gt;CDU comprises 24 acute medical beds and a ten seated ambulatory care area within a modern purpose built unit. We can offer a wide variety of experiences where no two days will ever be the same. You will be welcomed and supported as part of our friendly team.&lt;/p&gt;\n&lt;p&gt;We actively encourage continuing professional development, leading to the enhancement of your clinical skills and theoretical knowledge. You will have the opportunity to develop skills such as venepuncture, cannulation, male catheterisation and the management of patients with various acute medical conditions. There is also the opportunity to rotate to other areas within the hospital and attend courses as appropriate, to fulfil your personal development objectives.&lt;/p&gt;\n&lt;p&gt;Within CDU our patients and staff are at the heart of all that we do; we pride ourselves in providing a high quality patient experience in a caring and supportive environment. This aligns with our vision of providing safe, caring and effective services because people matter.&lt;/p&gt;\n&lt;p&gt;CDU has many varied shifts including long days in order to support staff in achieving a healthy work-life balance and provide flexibility for staff in shifts they work.&lt;/p&gt;\n&lt;p&gt;Glangwili General Hospital itself is a very friendly hospital, situated within Carmarthen, West Wales. There are many excellent schools within the area, both primary and secondary. Carmarthenshire is known for its beautiful countryside and we have some of the most glorious sandy beaches in Europe at our doorstep. With fantastic things to see and do, plus wonderful places to eat, you’re spoilt for choice.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Senior Ward Sister Kate Russell&lt;/p&gt;\n&lt;p&gt;kate.russell@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01267 248720&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251655", "validThrough": "2020-11-16T23:59:59+0000"}