{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 p.a/pro rata"}}, "datePosted": "2020-10-09T20:16:43+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Psychology Post&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Worcestershire Acute Hospitals NHS Trust, are looking to recruit an 8a Clinical Psychologist for a part-time role of 15 hours a week for a 12 month fixed term to cover maternity leave. One of the days must be a Tuesday morning to attend the MDT but we can be flexible on other days. The post-holder would also be a Macmillan Professional, which is an excellent opportunity to undertake further training in a chosen area using allocated Macmillan funding. As a Macmillan Professional, you may be asked to be involved in events, such as Living Well Days. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You would be joining a small Psychology-lead team of clinicians in the Cancer Psychology Service. The service offers support to patients and their family/carers at diagnosis, during and post-treatment and referrals could be made at any stage. We work with inpatients and outpatients across all cancer specialities. We predominantly offer a short-term therapeutic service, but we aim to meet the needs of the patient first; so we are flexible in the amount of sessions offered to patients. In order to operate a timely and effective service, we do not have a waiting list. The service can be busy, but we are mindful of managing clinicians’ workloads, and we benefit from excellent administrative support. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Currently, due to Covid-19, sessions could be offered over the phone, over video or face to face. Expect a mix of home and office working to start initially, but the ability to be flexible is vital. As face-to-face work resumes, you will need to travel between the 3 hospital sites for appointments; Worcester Royal Hospital, Kidderminster Treatment Centre and the Alexandra Hospital for appointments. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As well as therapeutic 1:1 work, another important part of the role will be offering supervision groups and/or training to Cancer Nurse Specialists. Having an understanding of Level 2 training would be desirable but not essential for this part of the role. As a new service we also value input on service development, and we welcome new ideas to improve our working processes. There will also be the opportunity to supervise and line manage Counsellors in the team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role would suit someone with interest and experience of Physical Health Psychology. Band 7 clinicians with a minimum of 12 months post doctorate experience in a relevant specialty are welcome to apply.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;For informal enquires please contact one of the Psychology Team Monday to Thursday: Dr Kate Davies, 07593130169 or Dr Stephanie Davies, &lt;/strong&gt;&lt;strong&gt;07593130170 or Karen McCredie, Directorate Manager 01905 761424&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire Royal Hospital", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221356", "validThrough": "2020-11-12T23:59:59+0000"}