{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32107", "minValue": "23870", "unitText": "YEAR", "value": "£14.20 - £19.10 ph"}}, "datePosted": "2020-10-27T10:13:44+0000", "description": "&lt;p&gt;The Wyre Forest Health Partnership was formed in 2014 and currently consists of 6 well established surgeries based in and around the beautiful Wyre Forest area. We have 40 GP partners and in excess of 200 staff looking after over 73,000 patients.&lt;/p&gt;\n&lt;p&gt;This Practice Nurse role is to provide a high quality nursing care to the patients of the Practice, including treatment, screening and advice, within the professional competence of the post holder and in accordance with the Nursing and Midwifery council Code of Conduct. Also, to have a specialism in Diabetes or a willingness to undertake training.&lt;/p&gt;\n&lt;p&gt;The role will be based at Bewdley Medical Centre where you will be able to join our friendly forward-thinking, high-achieving and innovative partnership, where the team take genuine pride in making work stimulating, challenging and rewarding.&lt;/p&gt;\n&lt;p&gt;We are looking for a keen and enthusiastic team player who can demonstrate commitment and flexibility with the drive to deliver a high standard of patient centric medicine whilst maximising primary care business opportunities. We are seeking a Practice Nurse who shares our passion and who can assist the partnership to become the best it can be in a modern NHS.&lt;/p&gt;\n&lt;p&gt;For an informal chat, please contact stacy.kirby1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wyre Forest Health Partnership", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133675"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bewdley", "postalCode": "DY12 2EF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3766", "longitude": "-2.31676"}}, "title": "Practice Nurse with Diabetes Specialism", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243954", "validThrough": "2020-11-10T23:59:59+0000"}