{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-10-30T14:46:20+0000", "description": "&lt;p&gt;We are looking to recruit to the post of Physiotherapy Assistant&lt;/p&gt;\n&lt;p&gt;Central England Rehabilitation Unit, at Leamington Spa Hospital, has achieved level one status and is one of only a few such regional centres of excellence for adults with acquired brain injury and major trauma. An opportunity has now arisen to join our dynamic team, working mainly with in patients but sometimes with outpatients at the hospital.&lt;/p&gt;\n&lt;p&gt;You will work with qualified physiotherapists as part of the multidisciplinary team. Your main role will be to assist in the provision of a high standard of physiotherapy treatment programmes for patients, following assessment by a Physiotherapist. Your secondary role will be to provide some administrative support to the team so we do require you to have a reasonable level of IT skills.&lt;/p&gt;\n&lt;p&gt;You will work with patients of working age with complex neurological problems, or following major trauma. Experience in working with this client group, in a care setting or experience of exercise provision would be an advantage but not essential as training will be provided.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic individual, who is a good team worker, reliable timekeeper, with good organisational and communication skills. You will need to be adaptable and physically capable.&lt;/p&gt;\n&lt;p&gt;You will also be required to undertake data input for patient contacts and some administrative duties to support the functions of the team. Training will be provided.&lt;/p&gt;\n&lt;p&gt;The department has a commitment to CPD. In service training and structured appraisal systems are in place.&lt;/p&gt;\n&lt;p&gt;South Warwickshire Foundation Trust has a commitment to providing a seven day service and this post will be required to make some contribution to this service.&lt;/p&gt;\n&lt;p&gt;Please Note: This post is not suitable for qualified therapists&lt;/p&gt;\n&lt;p&gt;You must be able to meet the travel requirements of the post.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLucy GwynneJob titlePhysiotherapy Lead for Neuro-RehabilitationEmail addressLucy.Gwynne@swft.nhs.ukTelephone number01926 495321 ext 7329Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Sarah Mullen Tel: -07920 504 488&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Denise Dudley Tel: 07920 505 190&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Physiotherapy G23910, Leamington Spa Hospital", "postalCode": "CV34 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2693", "longitude": "-1.54106"}}, "title": "Physiotherapy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250626", "validThrough": "2020-11-13T23:59:59+0000"}