{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 + 5% HCA"}}, "datePosted": "2020-11-05T17:06:20+0000", "description": "&lt;p&gt;We have an exciting opportunity for an enthusiastic and motivated Occupational Therapist, currently working at Band 6 level, to join the Surrey Downs Health and Care Community Therapy Team. Working alongside Physiotherapists, Occupational Therapists and Rehabilitation Assistants, and the wider community team, you will provide Occupational Therapy input to prevent hospital admissions and provide rehabilitation post hospital discharge. You will carry out holistic assessment of patients needs and implement goal focused therapy plans that are jointly agreed with the patient.&lt;/p&gt;\n&lt;p&gt;You must have broad clinical experience including care of the elderly and enjoy the challenges of providing rehabilitation to people in their own homes. You will be supported by experienced Band 7 Physiotherapists within the team and will have professional OT support provided by Senior OTs in the organisation. As part of your role, you will be responsible for training and supervising Rehabilitation Assistants, and you will play an integral part in developing the OT service within the team.&lt;/p&gt;\n&lt;p&gt;As well as an extensive training programme within Surrey Downs Health and Care, our team also has an excellent in-service training and clinical supervision program. In addition, funding is available for external courses.&lt;/p&gt;\n&lt;p&gt;We work across Surrey Downs Health and Care with bases at Dorking Hospital, New Epsom and Ewell Community Hospital and Molesey Hospital. There is some flexibility with where this post would be based, and this can be discussed at interview.&lt;/p&gt;\n&lt;p&gt;For further information please contact Carol Beare, Team Leader, on 01372 735762.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123532.JPG", "name": "CSH Surrey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NEECH", "postalCode": "KT19 8NX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3384", "longitude": "-.295494"}}, "title": "Band 6 Community Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258670", "validThrough": "2020-11-19T23:59:59+0000"}