{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per annum"}}, "datePosted": "2020-11-05T17:00:40+0000", "description": "&lt;p&gt;Applications are invited for the post of Locum Consultant Colorectal Surgeon. The successful candidate will join an established and cohesive GI team of 8 colorectal and 6 upper GI surgeons in a busy teaching hospital and major trauma centre.&lt;/p&gt;\n&lt;p&gt;The unit is a tertiary referral centre for anal cancer, early rectal cancer and the multidisciplinary management of advanced pelvic malignancy. There is in addition a sub-specialty practice in pelvic floor surgery and advanced colonoscopy.&lt;/p&gt;\n&lt;p&gt;An established IBD MDT complements the colorectal and anal cancer MDTs. The surgical directorate also incorporates a full range of vascular and urology services and is the regional centre for upper GI cancer and vascular surgery.&lt;/p&gt;\n&lt;p&gt;Prospective applicants should be able to demonstrate experience and recognised training in laparoscopic colorectal surgery. The successful candidate will be expected maintain a practice in general colorectal surgery and emergency general surgery. General surgical on-call is currently 1 in 14.&lt;/p&gt;\n&lt;p&gt;An established interest in surgical education/training would also be desirable. There is a strong undergraduate department with links to the University of Manchester with a large cohort of medical students placed in the hospital from their 3rd to 5th year. The GI surgical department has led regional SpR teaching for the last 14 years and is actively involved in delivering national courses and an MSc programme. Considerable opportunities exist for collaborative research with the University of Lancaster, and self-development in postgraduate surgical education will be actively encouraged.&lt;/p&gt;\n&lt;p&gt;Applicants should hold or be eligible for CCT within 6 months of interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Mr Ioannis Peristerakis Job title Clinical Director Colorectal Surgery Email address Ioannis.Peristerakis@lthtr.nhs.uk Telephone number 01772 522261 &lt;/p&gt;\n&lt;p&gt;Clinical enquiries should be made to: Mr Ioannis Peristerakis, Clinical Director Colorectal Surgery (01772 522261).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Locum Consultant in General &amp; Colorectal Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258655", "validThrough": "2020-12-03T23:59:59+0000"}