{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-02T09:00:45+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;Applications are invited for the post of Specimen Reception Supervisor in the Blood Sciences, Pathology.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will be required to provide an efficient and comprehensive Specimen Reception service for Blood Sciences, exercising a high degree of initiative and maintaining high professional standards at all times. He/she will ensure overall smooth administration and running of the departmental reception and office and associated staff, providing proactive and responsive professional support. He/she will support senior staff in the Blood Sciences Department, prioritising and ensuring an efficient and timely flow of work through the reception and office.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;He/she will need to be fully conversant with the Trust’s procurement procedures and will be responsible for completing all associated documentation. He/she will be familiar with the Trust’s recruitment procedures and will assist in the completion of the documentation. The post holder will also need to be proficient in the use of databases and have a basic understanding of scientific terminology.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The role requires leadership, supervision, ensuring delivery of key performance indicators and operational management of the Specimen Reception team. There is overall responsibility in ensuring patient needs are met by achieving both internal and external NHS objectives.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Subject to contract and competency assessment, to work flexibly within the service needs which include, extended working day, weekends, bank Holidays and duties which may be carried out to ensure a 24 hour, 7 days per week service.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Liaises with: Head BMS and other appropriate staff within the department, other hospital clinical staff groups, health service staff, patients and other users of the service.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We would advise that potential applicants visit the laboratory before applying if they have not previously worked in this type of environment.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr Nirav PatelJob titleLead for Specimen Reception, Black Country Pathology ServicesEmail addressnirav.patel1@nhs.netTelephone number01902 695291Additional contact information&lt;/p&gt;\n&lt;p&gt;Mr Simon Brown&lt;/p&gt;\n&lt;p&gt;Head Biomedical Scientist supporting Sandwell &amp; City Hospitals&lt;/p&gt;\n&lt;p&gt;0121 507 2747&lt;/p&gt;\n&lt;p&gt;simon.brown8@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell Hospital, West Bromwich", "postalCode": "B71 4HJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5274", "longitude": "-1.98788"}}, "title": "Specimen Reception Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251372", "validThrough": "2020-11-14T23:59:59+0000"}