{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 plus Outer London HCAS"}}, "datePosted": "2020-11-04T16:16:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Service: &lt;/strong&gt;&lt;strong&gt;Service for Children and Adolescents with Neurodevelopmental disorders (SCAN) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Enfield Child &amp; Adolescent Mental Health Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post: &lt;/strong&gt;&lt;strong&gt;Clinical Psychologist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duration: Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band: 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Full time (37.5 hrs/wk) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Bay Tree House, Enfield&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;(with occasional travel to other Trust sites as necessary)&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Clinical Psychologist to join the CAMHS SCAN team.&lt;/p&gt;\n&lt;p&gt;SCAN is a specialist CAMHS team for children and young people with learning disabilities and neuro-developmental disorders, where the degree of impairment is coupled with mental health problems.&lt;/p&gt;\n&lt;p&gt;The post holder will provide specialist assessment and intervention to young people and families in SCAN, and will support the development of the service. The post holder will possess strong engagement skills, the ability to work creatively in relation to behaviour that challenges, a capacity to contain high levels of parental concern and distress, and to work effectively with complex multi-agency networks. Previous experience of work with children with neurodevelopmental conditions is advantageous.&lt;/p&gt;\n&lt;p&gt;Enfield CAMHS SCAN is part of Specialist CAMHS in Enfield. We are a well-established service, including a generic CAMHS team, specialist teams for looked after children, adolescents in need of crisis intervention, and children with learning disabilities and developmental difficulties. The service has strong partnership links with local Education, Social Care and Voluntary Sector services, Health and Local Authority Commissioning.&lt;/p&gt;\n&lt;p&gt;We welcome applications from enthusiastic, highly-motivated and resourceful individuals who are keen to work as part of a team. Enfield CAMHS is part of a Borough-wide CYPIAPT partnership, and we are seeking candidates with a commitment to evidence-based practice, young people’s participation, routine outcomes monitoring and promoting shared decision making with children and families.&lt;/p&gt;\n&lt;p&gt;Clinical Psychology has a very high profile in the service and there are thriving professional links across the teams. We hold regular CPD and service development days. Supervision will be provided by a senior Clinical Psychologist in SCAN. We will support individuals to develop specialist psychological therapy skills and pursue specific areas of interest or service development in line with service priorities.&lt;/p&gt;\n&lt;p&gt;For further details about the post, please contact:&lt;/p&gt;\n&lt;p&gt;Bethanne Willingham, Principal Clinical Psychologist for SCAN &amp; CDT on 020 8702 5160&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBetanne WillinghamJob titleTeam Leader for SCANEmail addressbethanne.willinghan@nhs.netTelephone number020 8702 6811&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "- CAMHS Tier 3&amp;4 Outpatients - Enfield, Enfield", "postalCode": "EN2 6NZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.658", "longitude": "-.089907"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256592", "validThrough": "2020-11-22T23:59:59+0000"}