{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-02T12:45:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Advert Business Intelligence Team Coordinator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to internal career progression an opportunity has arisen for a team coordinator within the Business Intelligence Team that sits as part of the Finance and Informatics department based in Sleaford, Lincolnshire. This role will be required to coordinate and support the current team with national and local returns, management reports, FOI’s and a variety of ad-hoc requests received into the team. This role line manages BI Officers and works closely with other senior managers to ensure information is readily available in a timely manner.&lt;/p&gt;\n&lt;p&gt;In addition you will be the main point of contact between Operational colleagues and translating their business needs into useful and useable data for services to operate. You will project manage information requirements of new services coming on line and changes to existing ones.&lt;/p&gt;\n&lt;p&gt;You will have a flair for information, trends and analysis, you will be SQL trained and have proficient working knowledge of excel and Power BI. You will be have a track record of presenting useful information that is easy to understand by different stakeholders and will communicate fluently to a variety of audiences. You will have an eye for detail and work for continuous improvement in existing and new information processes. The Teams primary role is to inform clinical teams regarding their current and forecasted performance, supporting reduction in variation of service delivery to benefit patients within Lincolnshire. You will have a flexible approach, be able to manage your own and others workloads and deputise for the Associate and Deputy Directors on occasions. Experience of a large performance driven organisation is desirable together with an ability to extract and analyse data. The Trust utilises RiO, IAPTus, ESR and Health Roster as well as feeds from a data warehouse and Power BI packages but full training will be given where required.&lt;/p&gt;\n&lt;p&gt;We are looking for individuals who live the trust values, and are passionate about using information to inform decision making and improve patient care. In return we offer a supportive and flexible working environment, generous basic annual leave allocations, training and career development opportunities, pension contributions, plus numerous salary-sacrifice schemes including, savings, electrical goods and car lease.&lt;/p&gt;\n&lt;p&gt;This role is based in the Sleaford Office, however home working is also possible for this role. At the time of writing, interviews and presentations are likely to be held in Sleaford in a socially distanced manner to comply with all IPC guidance.&lt;/p&gt;\n&lt;p&gt;Interview dates will be 1st and 2nd December 2020, this will be a 2 part interview.&lt;/p&gt;\n&lt;p&gt;This role is available for immediate start, Please contact Rebecca Allen, Associate Director of Contracting and Business Intelligence for an informal discussion and to explore the role more fully. Please email in the first instance to book an informal chat. Rebecca.allen34@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Point, Sleaford", "postalCode": "NG34 8GG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0088", "longitude": "-.392531"}}, "title": "B7 BI Team Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252096", "validThrough": "2020-11-21T23:59:59+0000"}