{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79890", "unitText": "YEAR", "value": "£79,890 - £107,668"}}, "datePosted": "2020-10-06T13:46:27+0100", "description": "&lt;h1&gt;LOCUM CONSULTANT IN OLD AGE PSYCHIATRY&lt;/h1&gt;\n&lt;h1&gt;ISLE OF WIGHT&lt;/h1&gt;\n&lt;h1&gt;12 MONTH POST&lt;/h1&gt;\n&lt;h1&gt;FULL TIME&lt;/h1&gt;\n&lt;p&gt;This full-time post is an exciting opportunity for an ambitious psychiatrist to get involved in the development of a state of the art Older Person’s Mental Health services to meet the needs of the local population. The Trust is working with an identified a mainland strategic partner to develop the service. The post-holder will be taking on an active role in the establishment of this service and the contract offers up to 1PA service development time.&lt;/p&gt;\n&lt;p&gt;The post holder will work within the Memory Service, with patients with dementia and their carers and also within the Community Mental Health Service, Home Treatment Service and inpatient wards, in the assessment and management of older people with functional and organic illness. As a replacement position following the retirement of the existing post holder, we want to recruit someone of high calibre who wants to develop and improve services for older people.&lt;/p&gt;\n&lt;p&gt;Should the successful applicant have an interest in staying permanently he/she would be in an excellent position to apply.&lt;/p&gt;\n&lt;p&gt;This rewarding clinical and leadership role is situated in an environment that offers an excellent quality of life. The Isle of Wight is located off the south coast of England and has a population of 138,000. It is an area of outstanding beauty with miles of beautiful coastline with much to offer in the way of outdoor leisure pursuits and is a great place for family living. Connections to the mainland are frequent, fast and efficient, with a choice of crossings as foot passenger or by car ferry, from Southampton or Portsmouth, both of which are approximately 90 minutes by rail from London.&lt;/p&gt;\n&lt;p&gt;The Isle of Wight NHS Trust is a unique NHS organisation, comprising Inpatient Medicine and Surgery, Community, Ambulance and Mental Health and Learning Sisability services.&lt;/p&gt;\n&lt;p&gt;Single accommodation is available to rent in a modern residential block on the St Mary’s Hospital site. Family accommodation is subject to availability.&lt;/p&gt;\n&lt;p&gt;Other staff benefits include;&lt;/p&gt;\n&lt;p&gt;· Discounted bus fares&lt;/p&gt;\n&lt;p&gt;· Staff discounts with local business&lt;/p&gt;\n&lt;p&gt;· Reduced travel costs on Wightlink and Red Funnel&lt;/p&gt;\n&lt;p&gt;· Cycle to Work and Home Computing Schemes&lt;/p&gt;\n&lt;p&gt;Applicants must be eligible to hold full registration with the General Medical Council. Also applicants should be S12 approved and have Approved Clincian status, or be willing to work towards this.&lt;/p&gt;\n&lt;p&gt;If you would like to have an informal discussion about this post please contact Dr Rich Braithwaite, Consultant Old Age Psychiatrist, through his secretary Sam Jones on 01983 822099 ext. 5393 and/or Dr Oliver Cramer, Clinical Director for Mental Health &amp; Learning Disabilities, via his PA, Megan Rowbotham, on 01983 822099 ext. 4361.&lt;/p&gt;\n&lt;p&gt;Candidates are expected to visit the hospital in advance of the interviews to meet key staff and to familiarise themselves with the facilities. You are asked to contact Andrew Hughes, Memory Service Lead on 01983 822099 extension 5336.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isle of Wight NHS Trust - Medical Recruitment", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Locum Consultant Psychiatrist Older Persons Mental Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214903", "validThrough": "2021-04-06T23:59:59+0100"}