{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27941", "minValue": "25676", "unitText": "YEAR", "value": "£25,676 - £27,941 pa inc"}}, "datePosted": "2020-10-23T20:00:24+0100", "description": "&lt;p&gt;&lt;strong&gt;Nursing Associate, &lt;/strong&gt;&lt;strong&gt;Band 4 (Or Primary Care Assistant Practitioner PCAP)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bexley District Nursing Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Nursing Associate or Primary Care Assistant Practitioner (Band 4) working for the Colyers District Nursing service within the Adult Community Services of Bexley Care, based in the London Borough of Bexley.&lt;/p&gt;\n&lt;p&gt;We have a full time post available. The band 4 Nursing Associate/PCAP must be experienced in delivering nursing care in a community setting providing range of services is essential as is experience of managing change.&lt;/p&gt;\n&lt;p&gt;If You are a Nursing Associate you must have a Registered Nursing Associate qualification on the NMC register.&lt;/p&gt;\n&lt;p&gt;If you are a PCAP you must have a foundation degree in Health and Social care&lt;/p&gt;\n&lt;p&gt;You will have experience of the use of various IT applications including Microsoft and Rio, (Rio training can be provided). Knowledge of personal health and safety responsibilities is essential.&lt;/p&gt;\n&lt;p&gt;You should be a committed, highly-motivated and forward-thinking individual who should be able to work autonomously, and as part of a team. You must possess excellent interpersonal and communication skills, a flexible approach and be able to demonstrate your ability to prioritise and organise your work.&lt;/p&gt;\n&lt;p&gt;The District Nursing Teams offer a friendly, supportive, innovation and progressive environment; we are truly passionate about developing your career and can offer a comprehensive induction and preceptorship programme.&lt;/p&gt;\n&lt;p&gt;Adult Community Services is part of Oxleas Foundation Trust. You will have regular supervision and access to training opportunities&lt;/p&gt;\n&lt;p&gt;Our dedicated teams respond to urgent calls in different parts of the borough and provide a high standard of individualised care for patients in their own homes and clinics.&lt;/p&gt;\n&lt;p&gt;Please note that Oxleas operates a probationary period, further information is available on request.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Susan Read Job title Colyers Team Lead&lt;/p&gt;\n&lt;p&gt;Email address Susan.read11@nhs.net Telephone number01322 359966&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120829.png", "name": "Oxleas NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120829"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bexley, Bexley", "postalCode": "DA8 1RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4796", "longitude": ".1808"}}, "title": "Nursing Associate/Primary Care Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241518", "validThrough": "2020-11-06T23:59:59+0000"}