{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 per annum pro rata"}}, "datePosted": "2020-10-19T15:01:28+0100", "description": "&lt;p&gt;&lt;strong&gt;Join us for our digital Nursing and ODP Engagement day. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dates:&lt;/strong&gt; 17 November 2020.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Digital event&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Book your place:&lt;/strong&gt; email Nursing@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;So, you’re eager to learn more about Operating Department Practitioner opportunities at North Bristol NHS Trust. Here are some of the reasons you should attend our upcoming digital Nursing and ODP engagement day...&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You’ll hear an online presentation from our Anaesthesia, Surgery, Critical Care and Renal division on the opportunities available with our Theatre and Mediroom teams&lt;/li&gt;\n&lt;li&gt;A new concept in healthcare, our Medirooms combine the traditional recovery, day-case, same-day and admission areas into a single patient room environment, specifically designed to enhance patient experience by improving the level of privacy and dignity that these areas were traditionally able to cover. Patients also benefit from continuity of care as they are admitted, recovered and discharged/transferred by the same Mediroom team.&lt;/li&gt;\n&lt;li&gt;Our anaesthetics and scrub practitioners also have access to unique multidisciplinary training delivered by our Perioperative simulation team within a purpose built simulation facility; our Clinical Simulation space.&lt;/li&gt;\n&lt;li&gt;You’ll gain an insight into life at our Trust, including our award-winning health and wellbeing support, our commitment to equality, diversity and inclusion and our aspirations to be leaders in the field of sustainable healthcare.&lt;/li&gt;\n&lt;li&gt;You’ll have the opportunity to book an interview for the day or an informal video call with our divisional clinical lead.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At our online event, you’ll learn our Trust is pioneering, progressive and proud. For example…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our health and wellbeing initiat­­­ives, devised by our dedicated staff wellbeing team, encompass lifestyle support, physical support and psychological support, and have been nationally recognised by REBA.&lt;/li&gt;\n&lt;li&gt;We value staff feedback; in the results of our 2019 staff survey, our response rate was &lt;strong&gt;higher than the national average &lt;/strong&gt;and highlighted we had improved in all the areas staff told us were priorities in 2018. Out of the 90 questions asked, we had made 73 improvements from the previous year and 69% of staff would recommend our organisation as a place to work (6% better than the national average).&lt;/li&gt;\n&lt;li&gt;Our staff do not shy away from a challenge in aid of Southmead Hospital Charity. They cycle, run, row and race in aid of a fantastic cause, or sing in our staff choir and compete in ‘Southmead Does Strictly’.&lt;/li&gt;\n&lt;li&gt;We’re committed to supporting staff on their career journey with us offering personalised training packages and bespoke specialty rotations. We also support internal transfers for those who wish to gain experience in a new specialty or further develop their skills.&lt;/li&gt;\n&lt;li&gt;Our staff are consulted on equity issues across the trust within equality and development groups, and are given the mentoring and support to succeed. Our trust supports the development of Bristol’s LGBT+ manifesto and a case study of good practice has been reported to NHS England in response to a government review of public services and Trans people.&lt;/li&gt;\n&lt;li&gt;Our clinical environment is award-winning in its approach to healthcare design; each patient room has a view, many of which are naturally ventilated and 75% of rooms in our Brunel Building are single and en-suite. With nurses in mind, our clinical spine carefully separates staff and patient areas, with a generous staff canteen extending out to a rooftop terrace.&lt;/li&gt;\n&lt;li&gt;Bristol is consistently voted the best place to live in the UK, with vibrant local music, arts and gastronomic scenes. Our city boasts a wide range of state-of-the-art shopping, recreation and leisure facilities, a wealth of great local family days out, and excellent transport links.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Right, that’s enough about us… let’s focus on you. Are you…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A newly qualified ODP ready to take the leap from theory to the clinical setting, looking to find out more about our preceptorship, wellbeing programme, and training opportunities?&lt;/li&gt;\n&lt;li&gt;A student ODP keen to explore what to expect from placements in the trust?&lt;/li&gt;\n&lt;li&gt;An experienced ODP eager to channel your experience into a new and exciting post, keen to discover what our engagement days have to offer?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Yes, that’s me! When is the event and how do I book my place?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Date:&lt;/strong&gt; Tuesday 17 November&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Online event only&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Book your place:&lt;/strong&gt; email Nursing@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Looking to interview on the day?&lt;/em&gt;&lt;/strong&gt; Please submit your application on this advert and a member of our Talent Acquisition Team will be in contact to book your interview.&lt;/p&gt;\n&lt;p&gt;Follow us on social media to join in the conversation and gain an insight into (search @NBTNursing on Twitter, Facebook, Linkedin and Instagram&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information about this event, please email &lt;strong&gt;Nursing@nbt.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Digital Event - Online only, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Digital Event: Nursing and ODP Engagement day - 17 November 2020", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232808", "validThrough": "2020-11-17T23:59:59+0000"}