{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-27T10:45:17+0000", "description": "&lt;p&gt;As a UK national response to COVID-19, Government set out a mandate for health and social care systems to enhance partnership working in order to change approach and responsiveness to hospital discharge and community admission avoidance arrangements. Locally the Discharge to Assess programme and Admission Avoidance services that have been implemented as a response to the national guidance have been very successful; supporting whole system flow, creating more efficient pathways and enhancing patient outcomes.&lt;/p&gt;\n&lt;p&gt;The role will therefore be pivotal to developing, embedding and supporting staff with the new ways of working, ensuring long term sustainable service delivery. As a senior clinician in the organisation there will be a requirement to provide a visible and accessible presence to front line staff, supporting daily operational and clinical decision making. The post holder will therefore have excellent leadership skills to enthuse and promote risk adverse practice promoting a home first approach where ever possible. The professional background and experience the Service Manger has will be drawn upon daily and as such they will need to have had a minimum of 5 years qualified experience within their registered profession. They will have an understanding of the Care Act 2014, Mental Capacity Act 2005, Adult Safe Guarding Principles. NHS long term plan and the national drive to promote and embed integrated pathways.&lt;/p&gt;\n&lt;p&gt;Effective admission avoidance services and patient flow across acute and community teams are reliant on a whole system approach. As such this role will be pivotal in ensuring effective partnership with working across the local system. They will lead relevant internal and external working groups/projects, and initiatives to integrate pathways associated with admission avoidance, discharge and care home support. The post holder will be expected to establish links and engage with acute and social care stakeholders, the independent and third sector – including domiciliary care, nursing and residential care home providers.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you wish to discuss the post please contact Gemma McIver, Deputy Director of Operations on 01743 277500 Ext 2258 or Tara Ashley, Locality Clinical Manager on 07967767408&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127016.jpg", "name": "Shropshire Community Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127016"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury", "postalCode": "SY3 8XL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7074", "longitude": "-2.79305"}}, "title": "Service Manager - Community and Integrated Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244058", "validThrough": "2020-11-10T23:59:59+0000"}