{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - 110,683"}}, "datePosted": "2020-10-21T12:46:54+0100", "description": "&lt;p&gt;Substantive Consultant Ophthalmologist - specialist interest Vitreo-Retinal and Medical Retina&lt;/p&gt;\n&lt;p&gt;We are looking to appoint an innovative and high performing Consultant Ophthalmologist specialising in Vitreo-retinal and Medical Retina providing sub-specialty out-patient clinics and surgery. There is also the opportunity to provide other sub-specialty clinics, cataract one stop clinics and surgery depending on experience. The role will also include being part of the VR Emergency on-call rota.&lt;/p&gt;\n&lt;p&gt;Surgical and clinical experience that meets or exceeds BEAVRS criteria is essential.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to join a dynamic and forward thinking team comprising 16 Consultants, 6 Specialty and Trust Grade Doctors, 4 Specialty trainees, 4 Nurse Practitioners, 10 Orthoptists, 5 Optometrists and a substantial team of Ophthalmic Nurses, technicians and healthcare assistants. The department also benefits from our Eye Clinic Liaison Officer and 4 Ophthalmology Failsafe Co-ordinators along with a supportive senior management team within the Head and Neck Directorate.&lt;/p&gt;\n&lt;p&gt;CHFT has 2 main sites, Ophthalmology being based in Acre Mills Out-patients, Huddersfield and Calderdale Royal Hospital, Halifax. Community clinics are also provided at Westwood Park (Bradford) and Todmorden (Halifax).&lt;/p&gt;\n&lt;p&gt;The department successfully held the Part 2 FRCOphth Clinical OSCE&#39;s exams in April 2018 receiving excellent feedback from patients, candidates and examiners.&lt;/p&gt;\n&lt;p&gt;The department supports teaching and education at all levels and the candidate will have the opportunity to work with service leads to conduct service improvement and transformation work.&lt;/p&gt;\n&lt;p&gt;The Trust is currently one of the most digitised NHS Trusts in the country having moved to Cerner Millennium Electronic Patient Records (EPR) in 2017. This makes us currently one of the most paper-light and digitised Ophthalmology Departments in the country including the use of Medisoft by all clinical teams, and our planned/on-going work will make us a national leader in this area.&lt;/p&gt;\n&lt;p&gt;Full General Medical Council registration is essential for this post as is License to practice.&lt;/p&gt;\n&lt;p&gt;Completed UK VR fellowship / CCT is essential.&lt;/p&gt;\n&lt;p&gt;Full-time / Part-time roles to be considered&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise.CorpJob titleGeneral Manager Eye Care ServicesEmail addressLouise.Corp@cht.nhs.ukTelephone number07867902408Additional contact informationFor further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Pnt Laloe - Clinical Director Head and Neck Services&lt;/p&gt;\n&lt;p&gt;Pnt.Laloe@cht.nhs.uk Tel:01484343410 or 07824528572&lt;/p&gt;\n&lt;p&gt;Rubina Rahman - Consultant Ophthalmologist (Vitreo-retinal)&lt;/p&gt;\n&lt;p&gt;Rubina.Rahman@cht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Louise Corp - General Manager Eye Care Services&lt;/p&gt;\n&lt;p&gt;Louise.Corp@cht.nhs.uk Tel: 07867902408&lt;/p&gt;\n&lt;p&gt;Katie Dyson - Medical HR Tel: 01484 355226&lt;/p&gt;\n&lt;p&gt;Katie.Dyson@cht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Calderdale and Huddersfield NHS Foundation Trust", "postalCode": "HD3 3EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6557", "longitude": "-1.82159"}}, "title": "Consultant Ophthalmologist - Vitreo-Retinal and Medical Retina", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236456", "validThrough": "2020-11-18T23:59:59+0000"}