{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pro rata"}}, "datePosted": "2020-11-02T14:31:44+0000", "description": "&lt;p&gt;Advertisement for Band 4 Therapy Assistant Practitioner - Specialist Palliative Care.&lt;/p&gt;\n&lt;p&gt;The opportunity has arisen to be part of a talented, passionate and committed Macmillan Community specialist Palliative Care Team, delivering excellent community based healthcare services throughout Wirral to patients in their own homes.&lt;/p&gt;\n&lt;p&gt;Wirral Community Health and Care NHS Foundation Trust is currently looking for an enthusiastic, self motivated individual to provide therapy support, at Band 4 level, to the Specialist Palliative Physiotherapist and Occupational Therapist within a multidisciplinary team based at Wirral Hospice St. Johns.&lt;/p&gt;\n&lt;p&gt;As a valued member of the team, you will hold a potentially complex caseload, both independently and support by the Physiotherapist and Occupational Therapist within the service. You will need to have relevant therapy experience or an assistant practitioner qualification.&lt;/p&gt;\n&lt;p&gt;You will need to be a confident, self-directed individual with a strong team focus as well as being able to work independently when required. You will be able to demonstrate excellent organisational, interpersonal and communication skills in order to maintain our exceptional standards of care when liaising with patients and both internal and external agencies. You will be dealing with confidential and sensitive matters, which may include challenging situations relating to palliative and end of life care. As such, previous experience of working in the NHS and community setting is essential. You will be part of a multidisciplinary team with a clear supervision structure and will have access to support from the sider MDT. The successful candidate will receive a structured mentor and preceptorship programme with internal and external training provided as needed. IT skills are required, but training on appropriate system is provided.&lt;/p&gt;\n&lt;p&gt;If you have the right values for our organisation, you will be support by in house training and development as well as the many benefits working for the NHS has to offer.&lt;/p&gt;\n&lt;p&gt;If this sounds like the right opportunity for you, or to find out more , please call on 0151 328 0481.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Julie Norman&lt;/p&gt;\n&lt;p&gt;Job title: Specialist Services Manager&lt;/p&gt;\n&lt;p&gt;Email address: julie.norman7@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0151 328 0481&lt;/p&gt;\n&lt;p&gt;Mobile number: 07798 617 800&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126754.png", "name": "Wirral Community Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wirral Hospice St. Johns, Wirral", "postalCode": "CH63 6JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3342", "longitude": "-3.02107"}}, "title": "Therapy Assistant Practitioner - Specialist Palliative Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252453", "validThrough": "2020-11-11T23:59:59+0000"}