{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 -£110,683 per annum"}}, "datePosted": "2020-10-21T09:55:58+0100", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;CONSULTANT IN INTENSIVE CARE AND ANAESTHETICS&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;We invite applications for a substantive Consultant appointment at Torbay &amp; South Devon NHS Foundation Trust; in Intensive Care and Anaesthesia for candidates with a broad range of skills to become active members of our flexible team. We are particularly interested in applicants with experience or expertise in perioperative medicine, but are also interested in candidates that are able to lead services in obstetric anaesthesia, ophthalmic anaesthesia, and paediatrics. Wider skills in audit and governance, management and leadership would be desirable. Our on-call commitment has evolved to provide the highest quality consultant delivered service whilst responsive to work-life balance. ICU rota is a 1:10 non-resident on call.&lt;/p&gt;\n&lt;p&gt;Torbay hospital has a reputation for a friendly working environment, excellent trainee feedback and is a national innovator in many areas including day surgery and peri-operative medicine. Outside of the hospital, the area offers a great lifestyle with beautiful countryside from the stunning South Devon coastline with its sandy beaches and pebble coves to the rugged peaks of Dartmoor and the rolling South Hams.&lt;/p&gt;\n&lt;p&gt;For new substantive consultants the job plan for this postwill include 2.5 SPAs for the first year.&lt;/p&gt;\n&lt;p&gt;Applicants are required to be on the GMC Specialist Register, or within six months of their expected date of receipt of a CCT/EU equivalent certification at the time of interview. Applications are welcomed from those unable to work full-time for personal reasons or those wishing to job-share.&lt;/p&gt;\n&lt;p&gt;Informal enquiries regarding this post should be addressed to:&lt;/p&gt;\n&lt;p&gt;Dr Omar Islam – Clinical Director Anaesthetics e-mail - omarislam@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Tod Guest – Intensive Care Lead e-mail – t.guest@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torbay", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Consultant in Intensive Care and Anaesthetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235738", "validThrough": "2020-11-23T23:59:59+0000"}