{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "70719", "minValue": "37923", "unitText": "YEAR", "value": "£37,923 to £70,719 pa"}}, "datePosted": "2020-11-04T16:01:28+0000", "description": "&lt;p&gt;There has never been a better time to join our growing team within our Mental Health and Learning Disabilities Division.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With a new leadership team in place we’re investing in our services to transform the way they are delivered. We are continuously developing and expanding the range of support, care and treatment we offer to people across North Wales. This includes establishing new exciting roles in our community and inpatient teams and a clear pathway for staff to continue to learn and progress throughout their career.&lt;/p&gt;\n&lt;p&gt;As part of our growth strategy, Betsi Cadwaladr University Local Health Board are currently looking to appoint a full-time (10 sessions) Specialty Doctor in Liaison Psychiatry, based in the Heddfan Unit, Wrexham, North Wales.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Liaison Services in North Wales have recently gone through a major expansion phase. The liaison team has become multidisciplinary, offering both assessment and brief interventions and is moving from a ‘core 24’ to an ’enhanced’ service. This post will cover adults over the age of 18.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For a list of full duties please see job description.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;North Wales is the perfect place to Train, work and live. With stunning surroundings, affordable housing, great schools and a true sense of community wherever you go, North Wales is the perfect place to settle down on your own or with a family.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;BCHUB is committed to improving the working lives of our employees. We actively promote equal opportunities, flexible working and staff support. Applications from those wishing to work less than full time will be encouraged.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;BCULHB is committed to providing equal opportunities in employment. This post is subject to a satisfactory Criminal Records Bureau check being made.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Masood Malik, Consultant Psychiatrist and Clinical Director for East Area: masood.malik@wales.nhs.uk, 01352 750252.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wrexham, Wrexham", "postalCode": "LL18 5UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2718", "longitude": "-3.49635"}}, "title": "Specialty Doctor Liaison Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256556", "validThrough": "2020-11-18T23:59:59+0000"}