{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7 equivalent"}}, "datePosted": "2020-10-28T14:19:42+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Lead | Outpatients | Band 7 equivalent | Full Time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire London East Hospital has an exciting opportunity for an Outpatient Clinical Lead.&lt;/p&gt;\n&lt;p&gt;Spire London East Hospital (formerly Spire Roding) is located in Redbridge, on the borders of East London and Essex. We offer comprehensive private hospital services, ranging from outpatient clinics and physiotherapy to surgery and diagnostic tests in a relaxed, clean and comfortable environment.&lt;/p&gt;\n&lt;p&gt;The hospital has 24 inpatient beds and 16 day case rooms called ‘pods’. Facilities include 4 operating theatres, an endoscopy suite, 2 extended recovery units, pharmacy, x-ray, outpatient and diagnostic facilities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide exemplary OPD care for patients while managing the operations in the Outpatients Department on a day to day basis.&lt;/li&gt;\n&lt;li&gt;To ensure the OPD team deliver effective treatment to patients by providing excellent clinical leadership.&lt;/li&gt;\n&lt;li&gt;To work with the OPD services manager to meet AOP and effect service level in line with departmental and hospital business plan.&lt;/li&gt;\n&lt;li&gt;To maintain cancer clinical speciality with support from bank staff to drive the service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a Clinical Lead who has Outpatient experience. You will have previous management/leadership experience or a Supervisory Management qualification. You will work closely with the Outpatient Services Manager and support the nurses in the department. The hospital has a swift turnaround so flexibility and versatility is essential on a daily basis.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals and 8 clinics across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Jodie on 07935 755240 or jodie.walsh@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redbridge", "postalCode": "IG4 5PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5872", "longitude": ".04309"}}, "title": "Outpatient Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246961", "validThrough": "2020-11-28T23:59:59+0000"}