{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 per annum (incl of HCAS)"}}, "datePosted": "2020-10-21T09:30:52+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;MBT Clinical/ Counselling Psychologist or Psychotherapist for IMPACTT&lt;/strong&gt; – a specialist Personality Disorder therapy team &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an enthusiastic, innovative and hard-working psychologist or psychotherapist to work as part of IMPACTT - a specialist therapy team working with personality disorders. The team is made up of a variety of professionals including psychotherapists, clinical and counselling psychologists, psychological therapists and assistant psychologists, providing a specialist function of completing assessments of EUPD for the Trust.&lt;/p&gt;\n&lt;p&gt;The existing pathway already includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Structured Clinical Management (SCM) delivered by clinical staff with the Community Mental Health Teams&lt;/li&gt;\n&lt;li&gt;MBT &amp; DBT Treatments&lt;/li&gt;\n&lt;li&gt;PICT (Psychologically informed Consultation and Training) Psychologists working with Inpatients, Community services and Primary Care to support delivery of the pathway.&lt;/li&gt;\n&lt;li&gt;SUN (Service User Network) groups delivered in the community.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be joining an already established programme delivering MBT interventions across Berkshire alongside specialist assessments and liaison with other key professionals.&lt;/p&gt;\n&lt;p&gt;You will have some experience in delivering group and individual psychological therapies/ psychotherapy to adults with complex and severe mental health problems as well as having a particular interest in working with complex personality disorder, primarily Borderline Personality disorder, and be committed to delivering evidence based interventions for this client group. You would be contributing to the continuing development and delivery of an intensive MBT programme, as well as towards the development of an evidence base for group-only MBT interventions. You would attend weekly group supervision and ensure you remain up to date with new developments in the field through regular training and audit.&lt;/p&gt;\n&lt;p&gt;A flexible, pro-active approach and positive attitude is essential. Your main tasks will be to provide specialist psychological assessment and therapy (MBT) and provide supervision to junior colleagues, but you will also be required to work closely with your DBT colleagues and joint working to enhance the psychological aspects of care within the multidisciplinary teams across the Trust. You will be expected to work autonomously within professional guidelines and according to relevant policies and procedures and to lead on service developments and governance initiatives as required.&lt;/p&gt;\n&lt;p&gt;You will be joining a supportive organisation where psychological therapists work closely with other professionals and agencies to offer high-quality care across Berkshire.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare is committed to compassionate care and was rated ‘Outstanding’ by CQC. It offers the full range of mental health and community services, and psychotherapists and psychologists contribute to these as integrated members of clinical teams. Whilst there is a strong ethos of multi-disciplinary team working, you will also be part of a network of psychotherapists and psychologists across Berkshire. You will be supported in your continuing professional development, including advanced post-qualification training in relevant areas.&lt;/p&gt;\n&lt;p&gt;An enhanced DBS check is required and you will need to travel between bases in Berkshire as required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information please contact Kerry Cook, Psychotherapist on 0300 365 8000 or Kerry.cook@berkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG6 6BZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4408", "longitude": "-.936464"}}, "title": "Clinical / Counselling Psychologist or Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235657", "validThrough": "2020-11-08T23:59:59+0000"}