{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-10-29T16:16:06+0000", "description": "&lt;p&gt;An opportunity has arisen for a full time (37.5) Band 5 Community Mental Health Nurse to join our dynamic integrated Mental Health Team for working age adults. The successful candidate will be based in the Haltemprice Mental Health Team which covers the West bank Villages of Hull, in the East Riding of Yorkshire. The area is a short distance to Hull, which was City of Culture in 2017.&lt;/p&gt;\n&lt;p&gt;We require a highly motivated nurse, who has previous experience of working with clients with severe and complex mental health problems. They need to be enthusiastic, adaptable and motivated to deliver a recovery focussed service. The team have a wealth of experience and supervision structures to ensure that there will be opportunities for development.&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Act as Care Co-ordinator&lt;/li&gt;\n&lt;li&gt;Deliver care in accordance with CPA (Care Programme Approach) and the Mental Health Act 1983 as amended by the Mental Health Act 2007&lt;/li&gt;\n&lt;li&gt;Maintain accurate electronic records in a timely fashion according to Trust policy&lt;/li&gt;\n&lt;li&gt;Deliver evidence based interventions appropriate to client group on both an individual and group basis.&lt;/li&gt;\n&lt;li&gt;Work with careers and families to aid recovery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;It is essential applicants can meet the travel requirements of the post.&lt;/p&gt;\n&lt;p&gt;You will be joining a supportive and welcoming team with access to regular supervision with opportunities for personal and professional development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated &lt;strong&gt;Good&lt;/strong&gt; by the Care Quality Commission. The Trust is also proud to be HSJ Provider of the Year 2019 award winners.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,800 staff across more than 79 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Hull has benefitted from being included The Guardian’s ‘Hot List’ of places to visit and rated by Rough Guides as one of the top ten cities in the world to see. The nearby town of Beverley was named by The Sunday Times as one of the ten best places to live in the north. The area boasts a wide array of diverse property from coastal cottages to riverside apartments. Hull and the East Riding of Yorkshire offer some of the most competitive house prices in the country, with access to excellent schools and further and higher education providers.&lt;/p&gt;\n&lt;p&gt;The region has great transport connections with an hour commute York or Leeds. Want to go further afield? There are daily ferry crossings from Hull to Belgium and the Netherlands and from Humberside Airport you can reach destinations across Europe and – via Schiphol – worldwide.&lt;/p&gt;\n&lt;p&gt;Base: College House, Willerby Hill, Beverley Road, HU10 6ED. Contact Details: Laura Yourston- Team Manager. Email: Laura.yourston@nhs.net or Hannah Walker 01482 335959&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "College House, Hull", "postalCode": "HU10 6UE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7431", "longitude": "-.423774"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249049", "validThrough": "2020-11-12T23:59:59+0000"}