{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158-£76,751"}}, "datePosted": "2020-10-30T15:17:02+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Specialty Doctor in Clinical Haematology based at the Royal Bournemouth Hospital.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for the appointment to a newly developed position of Specialty Doctor in Clinical Haematology at the Royal Bournemouth Hospital. This is a fixed term post, for six months initially, to provide middle grade cover alongside 3 Specialty Registrars and 2 Core trainees. This post would suit an individual interested in pursuing a career in haematology with the chance to gain experience in managing patients with malignant and non-malignant haematological disorders including those undergoing autologous stem cell transplants, in a friendly progressive department. The appointee will work under the supervision of the eight haematology consultants with exposure to a wide range of subspecialty interests within haematology. The department has a strong clinical research based practice with numerous national non-commercial and commercial clinical trials available to patients to access the latest innovative treatments.&lt;/p&gt;\n&lt;p&gt;‘Interested applicants are welcome to contact the Haematology clinical lead Rachel.Hall@uhd.nhs.uk or David.Allotey@uhd.nhs.uk  for further information or to arrange an informal visit to the department.’&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bournemouth", "postalCode": "BH7 7DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7475", "longitude": "-1.8205"}}, "title": "Specialty Doctor - Clinical Haematology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250725", "validThrough": "2020-11-26T23:59:59+0000"}