{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38259", "minValue": "38259", "unitText": "YEAR", "value": "£22.76 per hr"}}, "datePosted": "2020-10-16T14:50:58+0100", "description": "&lt;p&gt;&lt;strong&gt;We are looking for 6 x First Contact Physiotherapists&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;GP Practices in Bath and North East Somerset via the local GP Federation (BEMS) are seeking to recruit innovative, self-motivated and well-organised First Contact Physiotherapists. You will be an experienced physiotherapist registered with HCPC, with proven clinical and communication skills to join our professional and friendly multi-disciplinary teams.&lt;/p&gt;\n&lt;p&gt;This patient-facing role involves triaging patient self-referrals and receptionist navigated referrals using evidence-based principles, current best practice and expert specialist skills and clinical reasoning to assess, plan, implement, evaluate and onward refer patients with a range of conditions. You will be comfortable triaging and seeing patients without prior contact with their GP. You will have experience in managing caseloads and be confident in formulating rapid and accurate diagnosis supported by complementary management plans.&lt;/p&gt;\n&lt;p&gt;You will benefit from:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Joining an organisation that is judged by CQC to excellently well led&lt;/li&gt;\n&lt;li&gt;Work within teams of highly performing GP practices&lt;/li&gt;\n&lt;li&gt;You will have access to additional continuing professional development&lt;/li&gt;\n&lt;li&gt;You will be able to access the NHS Pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post will involve travel between the PCN practices and other venues to help fulfil the role.&lt;/p&gt;\n&lt;p&gt;Working hours: up to 37.5 hours per week, full time (part time applicants will also be considered)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Banes Enhanced Medical Services + (BEMS+)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130177"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath &amp; NE Somerset", "postalCode": "BA2 5RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3578", "longitude": "-2.37292"}}, "title": "First Contact Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230732", "validThrough": "2020-11-15T23:59:59+0000"}