{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 Incl. Fringe HCAS"}}, "datePosted": "2020-10-19T09:10:40+0100", "description": "&lt;p&gt;&lt;span&gt;A fantastic 12 month opportunity has arisen for a Band 6 Community Mental Health Nurse to come and join our EIIP West Surrey and NE Hampshire Team. This is to cover a period of maternity leave within the team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work in and contribute to the effectiveness of the Early Intervention in Psychosis Service. EIIP has positive outcomes for people, who use our services. The team find the job extremely rewarding and enjoy working closely with people and their families.&lt;/p&gt;\n&lt;p&gt;You will be a team player who is creative and innovative in their approach. As a Care Coordinator with a defined caseload, you will use your professional and personal skills to help people identify and come to terms with their first episode of psychosis and support them on their path to recovery within the CPA model. Working in EIIP you will have the chance to make a real difference in the care and recovery of the people who use our services.&lt;/p&gt;\n&lt;p&gt;The EIIP West Surrey and NE Hampshire team is based at Unither House in Chertsey with an EIIP satellite base at Aldershot Centre for Health.&lt;/p&gt;\n&lt;p&gt;The candidate must have a full and valid driving licence due to the community element of the role and the large geographical area this Team covers.&lt;/p&gt;\n&lt;p&gt;If you are looking for a secondment/fixed term contract in your career and are enthusiastic, motivated and dynamic, then we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;To discuss any aspects of the post further, please contact Kate Allen (EIIP Service Lead) or Karen Clear (EIIP Clinical Lead Nurse) on 01932 587051.&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Unither House, Curfew Bell Road, Chertsey, Surrey", "postalCode": "KT16 9FG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3897", "longitude": "-.507488"}}, "title": "EIIP Community Mental Health Nurse (secondment / fixed term)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231578", "validThrough": "2020-11-16T23:59:59+0000"}