{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-03T12:15:39+0000", "description": "&lt;p&gt;Donor Records Manager - OTDT&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A mission you can be proud of&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NHS Blood &amp; Transplant, we couldn’t be prouder of the talented people who come together every day to make this organisation the very best it can be. And we’re always looking for new people to join them – from a much wider range of backgrounds than you might think. Right now, we’re recruiting a Donor Records Manager to contribute to something truly unique.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You’ll be here to guide and smoothly manage the 16-strong Donor Records and Family Care Services team, who develop information systems, processes and procedures that maintain our vital organ donor files and provide after care to our donor families.&lt;/p&gt;\n&lt;p&gt;You’ll be responsible for performance management, recruitment, resource management, induction and staff personal development, among much else, creating a culture of team-spirit, diligence and professionalism.&lt;/p&gt;\n&lt;p&gt;We’ll look to you to liaise with internal and external key stakeholders to ensure the donation audit trail is complete and ensure compliance with quality assurance documentation, Information Governance compliance and clinical governance requirements. &lt;/p&gt;\n&lt;p&gt;Responsible for financial and physical resources for the department, you’ll also be accountable for the archiving and storage of donor records to meet with regulatory requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your background&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re looking for a variety of skills and experience:&lt;/p&gt;\n&lt;p&gt;•             Sound management experience&lt;/p&gt;\n&lt;p&gt;•             Proven ability to monitor, develop and amend working procedures&lt;/p&gt;\n&lt;p&gt;•             Knowledge of key performance indicators, assessing data to inform decision-making&lt;/p&gt;\n&lt;p&gt;•             Budget management experience&lt;/p&gt;\n&lt;p&gt;On a personal level, you’ll be analytical, decisive, calm under pressure with excellent judgement.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rewards&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return, you can look forward to a very attractive package including civil service pension, generous annual leave, excellent training and development, and flexible working.&lt;/p&gt;\n&lt;p&gt;We’re an inclusive organisation that reflects the diverse communities we work with and positively encourage applications from all sectors of the community.&lt;/p&gt;\n&lt;p&gt;This vacancy is on a fixed term/ secondment basis for 12 months. Secondments will be considered for NHSBT staff wishing to apply for this role.&lt;/p&gt;\n&lt;p&gt;This vacancy will close at 23:59 on Wednesday 11th November 2020.&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Ben Cole via email at ben.cole@nhsbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Monday 23rd November 2020 (subject to change).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Three small words, one big difference - Caring, Expert and Quality.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Together we&#39;ll save and improve more lives than ever.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L24 8RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3456", "longitude": "-2.87258"}}, "title": "Donor Records Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253898", "validThrough": "2020-11-11T23:59:59+0000"}