{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Band 5/6 dependent on experience"}}, "datePosted": "2020-10-22T10:11:34+0100", "description": "&lt;p&gt;&lt;strong&gt;Pre-operative Assessment | Nurse | POA | Band 5/6 dependent on experience | Bristol | Full time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Bristol Hospital is expanding the scope of services we offer our patients and are looking for a Staff Nurse Band 5 and Band 6 to join our Pre-Assessment unit.&lt;/p&gt;\n&lt;p&gt;As The only private hospital in the South West with an Intensive Care Unit, Spire Bristol Hospital has been providing excellent care, expertise and knowledge in a supportive and progressive environment for over 32 years. We bring together the very best of facilities and people that modern medicine can offer. We are dedicated to providing quality treatment and aftercare.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a key patient safety role within Spire - The post holder will work as part of the Pre-operative assessment (POA) service ensuring safe and effective pre-operative care. Reporting to the POA lead Nurse the post holder is responsible for ensuring the safe assessment of patients. Ideally, they will be able to demonstrate an advanced level of assessment skills with analysis of clinical findings to determine fitness to proceed to surgery. To work autonomously but also a team player.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide professional leadership to junior nursing staff, Health Care Assistants, admin staff within the department to promote effective communication and learning&lt;/li&gt;\n&lt;li&gt;Undertake the pre-operative assessments and screening using the Clinics pre-admission process&lt;/li&gt;\n&lt;li&gt;Take an in-depth history from the patient and evaluate previously known health issues.&lt;/li&gt;\n&lt;li&gt;Ensure that the appropriate pre-operative investigations are ordered, and abnormal findings are actioned as required&lt;/li&gt;\n&lt;li&gt;Support the Pre-admission Sister and Lead in developing protocols and guidelines&lt;/li&gt;\n&lt;li&gt;To Manage and maintain effective communication with Consultants, Lead anaesthetist, laboratory, GP’s, nursing colleagues and clerical staff, and provide advice to other multi-disciplinary clinical teams&lt;/li&gt;\n&lt;li&gt;Ensure the legibility and accuracy of nursing records and be aware of the legal implications of these documents.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be NMC registered - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Post registration experience in Pre-Assessment, Surgical or Medical nursing with at least 1 year working as an E grade band 5/6&lt;/li&gt;\n&lt;li&gt;ECG/ Phlebotomy&lt;/li&gt;\n&lt;li&gt;ILS&lt;/li&gt;\n&lt;li&gt;Compassionate and able to showcase excellent patient care&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent working environments&lt;/li&gt;\n&lt;li&gt;Strong supportive leadership&lt;/li&gt;\n&lt;li&gt;Robust induction and personal development program&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Carly Dack on 07850725333 orcarly.dack@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS6 6UT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.472", "longitude": "-2.61487"}}, "title": "Pre-operative Assessment Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237829", "validThrough": "2020-11-22T23:59:59+0000"}