{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-03T09:16:20+0000", "description": "&lt;p&gt;Matron for Nurse Education – Quality&lt;/p&gt;\n&lt;p&gt;Band 8A&lt;/p&gt;\n&lt;p&gt;1.0 WTE (37.5 hours per week)&lt;/p&gt;\n&lt;p&gt;Do you want to lead an exciting new project?&lt;/p&gt;\n&lt;p&gt;We are looking for you an established Nurse educator who works in, or alternatively is interested in moving back into an education environment in the next phase of your career? If so, this unique opportunity may be for you. We invite applications into the role of Matron for Nurse Education- Quality to lead the newly formed Education Quality Team within Nurse Education.&lt;/p&gt;\n&lt;p&gt;You will work closely with the Web development team, Education and Training and Practice Education Facilitator for Education - Quality.&lt;/p&gt;\n&lt;p&gt;We envisage this post will play a Lead role in the development of a high quality curriculum within a Virtual Learning Environment (VLE) to provide ongoing accessible Continuing Professional Development (CPD) for all non-medical staff. The post holder will be the accountable officer for quality assurance of the online content ensuring it meets the needs of profession specific regulatory bodies by cross referencing with the Nursing &amp; Midwifery Council and Health Care Professions council requirements for standards and Revalidation. The post is strategic in nature to engage, influence and set the pace with the subject matter experts that will provide the clinical content.&lt;/p&gt;\n&lt;p&gt;You will lead the design and development of a quality assurance process for CPD online Education for non-medical staff, seeking accreditation and e-commerce opportunities. You will be experienced and knowledgeable of navigating VLEs, online accessibility and embedding quality assurance processes.&lt;/p&gt;\n&lt;p&gt;You will be expected to deputise, attend team meetings to share good practice, provide cross cover ensuring a high quality standardised approach to all online and face to face education within Nurse Education.&lt;/p&gt;\n&lt;p&gt;The role-holder will provide a key link between Education &amp; Training and Head of Nursing Education.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic forward thinking practitioner with a commitment to the blended learning initiative to lead the swift development of the VLE content that drives improvement using nursing data.&lt;/p&gt;\n&lt;p&gt;Whilst the post is based at New Cross Hospital there is a requirement for the post holder to support education across the whole Trust.&lt;/p&gt;\n&lt;p&gt;If you want to be part of this exciting online project to drive up standards of patient care then this post is for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCatherine WilsonJob titleHead of Education- NursingEmail addressc.wilson12@nhs.netTelephone number01902 447299 Internal:8223&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Wolverhampton NHS Trust- Newcross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Matron for Education Quality", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253243", "validThrough": "2020-11-17T23:59:59+0000"}