{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-03T10:16:29+0000", "description": "&lt;p&gt;&lt;strong&gt;This is your chance to join the General Surgery &amp; Cancer Care Group at the Royal Cornwall Hospital, where we are an amazing nursing team - where patient care is at the centre of everything we do.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for dynamic, motivated and enthusiastic professionals who have an interest in caring for patients on St Mawes Ward, delivering care to both emergency and planned surgical pathway patients.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We can offer you a huge amount of cross-specialty surgical experience, predominantly Emergency Gastro Intestinal surgery, whilst working with a fantastic supportive team, where autonomous nursing practice and learning is fundamental to everything we do. If you are interested then come and join our expanding team and assist us to provide positive patient outcomes.&lt;/p&gt;\n&lt;p&gt;If you are looking for Professional and Personal development then we will support you to achieve this. There is a clear development structure in place, which includes senior ward level nursing as well as Clinical Nurse specialists within the Care Group. We also offer simulation training at the point of care, enabling staff to practice and develop acute clinical skills whilst learning about the real values of good teamwork.&lt;/p&gt;\n&lt;p&gt;It is not essential to have worked within Surgery to apply for this position as we would welcome all Registered Nurses as we are committed to going the extra mile for you, as you would for our patients. We work together to create a positive team spirit, recognising achievements and celebrating success. We know that happy patients start with happy staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cornwall is an area of outstanding natural beauty and the stunning coastline is at your fingertips, which actively promote a healthy work-life balance….COME AND JOIN US.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is full and part time opportunity and various shift patterns available including weekends, nights and bank holidays. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Catherine Blunsdon - Ward Sister on Tel: 01872253032. Or email: catherine.blunsdon@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253393", "validThrough": "2020-11-16T23:59:59+0000"}