{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-22T14:16:13+0100", "description": "&lt;p&gt;This is an exciting opportunity to join an established community psychiatric team serving adults of working age in North Oxfordshire. This is an established post recently vacated due to an internal transfer. This post is based in Banbury.&lt;/p&gt;\n&lt;p&gt;The North and West Adult Mental Health Community Team (AMHT) has two main bases, one in Banbury and one in Witney. The North and West team cover a mixed urban and rural patch with areas of high deprivation in Banbury and less deprived areas in the surrounding countryside.&lt;/p&gt;\n&lt;p&gt;The Banbury and Witney teams are essentially parallel teams but consultants will provide cross cover if required and the two leadership groups meet regularly to take an overview of the North and West service. There are 5 consultants within the North and West AMHT providing medical support.&lt;/p&gt;\n&lt;p&gt;We continually look to enhance the delivery of our services and are working as part of the exciting Oxfordshire Mental Health Partnership. The Oxfordshire Mental Health Partnership consists of 6 local mental health organisations across the NHS and charity sectors working together to ensure people get the best possible access to support when they need it.&lt;/p&gt;\n&lt;p&gt;Oxford Health is an ambitious Trust dedicated to innovating, evaluating and implementing new treatments, procedures and services. As such we feel we have a lot to offer and particularly welcome applications from clinicians who would like to negotiate dedicated PAs for clinical leadership, research, training or other areas of special interest.&lt;/p&gt;\n&lt;p&gt;The Trust is offering a relocation package for eligible candidates. Oxford Health is supportive of flexible working practices and work/life balance and welcomes interest from candidates who would like to consider a part-time position.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We will offer a £15,000 recruitment bonus and a relocation allowance of up to £8,000 to eligible candidates for this job. Also available is a cash alternative payment, equivalent to the employer contributions, in circumstances where staff opt out of NHS Pension Scheme membership due to the Lifetime/Annual limits on pension value.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Rob Bale, Clinical Director Adult Service, rob.bale@oxfordhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;01865 902000&lt;/p&gt;\n&lt;p&gt;Dr Arabella Norman-Nott Associate Medical Director Oxfordshire&lt;/p&gt;\n&lt;p&gt;01865902200 / 07826 893477 arabella.norman-nott@oxfordhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Julie Chalmers, 01865 902563, Julie.chalmers@oxfordhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Elms Centre, Banbury", "postalCode": "OX16 9AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0535", "longitude": "-1.33665"}}, "title": "Community Consultant Psychiatrist in General Adult Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238820", "validThrough": "2020-11-12T23:59:59+0000"}