{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 per annum plus HCA"}}, "datePosted": "2020-10-19T09:45:48+0100", "description": "&lt;p&gt;&lt;strong&gt;Team Lead Occupational Therapist Orthopaedics and Rehabilitation. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a newly redesigned post to support our orthopaedics pathway but also to lead on inpatient OT rehabilitation service provision at UHL. Are you a band 6 or 7 Occupational Therapist, who has an interest in Trauma and Orthopaedics, wants a new challenge, and is looking to lead and develop a team?&lt;/p&gt;\n&lt;p&gt;We are looking for an OT with a passion for Orthopaedics, to join our friendly and supportive therapy team at the University Hospital Lewisham. The post holder will support the delivery of high quality care to patients across the trauma and surgical wards in the acute hospital. They will provide expert support, advice and training to the ward therapy teams in the development of their skills and knowledge in these fields.&lt;/p&gt;\n&lt;p&gt;Additional to the orthopaedics team leadership, this post now entails leading on and development of our inpatient rehabilitation services. It is predicted that this will involve development (alongside band 8 and other team leads) of whole OT team (all bands from 3-7) competency programme, development of our weekend rehab service and supporting implementation of 7 day working patterns.&lt;/p&gt;\n&lt;p&gt;We need an innovative and enthusiastic team player to maximise the potential of the service and direct the team in its development. The role includes supervising an OT team (qualified and assistants) covering specialisms in trauma/orthopaedics and surgical pathways.&lt;/p&gt;\n&lt;p&gt;Learning and personal development is encouraged and we have a well-established appraisal system and funding for relevant external and internal courses. Master level training is actively encouraged for the post holder.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma TilleyJob titleLead Occupational TherapistEmail addressemma.tilley1@nhs.netTelephone number0208 333 3000 ext 8246Additional contact information&lt;/p&gt;\n&lt;p&gt;Emma Tilley, Lead OT UHL.&lt;/p&gt;\n&lt;p&gt;emma.tilley1@nhs.net&lt;/p&gt;\n&lt;p&gt;0208 333 3000 8246&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital Lewisham, London", "postalCode": "SE13 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4543", "longitude": "-.017025"}}, "title": "Team Lead Orthopaedics and Rehab lead Occupational Therapist.", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231662", "validThrough": "2020-11-30T23:59:59+0000"}