{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 Per Annum, Pro Rata"}}, "datePosted": "2020-10-30T09:15:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Ambulatory Care Unit – Deputy Ward Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;University Hospitals Plymouth NHS Trust is looking for passionate and experienced nurses to provide clinical leadership in our Ambulatory Care Unit (part of the Acute Assessment Unit) where the Ambulatory Care and Same Day Emergency Care services are delivered.&lt;/p&gt;\n&lt;p&gt;Our Acute Assessment Unit is a thriving service where we aim to stop unnecessary admissions to hospital whilst supporting patients to be discharged on the same day; this is all delivered thanks to the efforts of a fantastic multidisciplinary clinical team made of doctors, pharmacists, physiotherapists, occupational therapists, socials workers, ACPs and the excellent nursing team.&lt;/p&gt;\n&lt;p&gt;The ideal candidates will have experience in the acute setting, ideally within acute medicine or urgent care. As a Band 6 Junior Sister/Charge Nurse, you will support the Ward Manager on the day-to-day performance of the Ward and you will coordinate the admission, discharge and transfer of patients through the department as per trust policies and ensuring outstanding care is delivered to this patients.&lt;/p&gt;\n&lt;p&gt;In return, we will support you with an innovative and individualized programme of on-going professional and career development from a managerial and clinical perspective, working with the Ward Manager and the Matron for Acute Medicine in achieving your personal development plan.&lt;/p&gt;\n&lt;p&gt;This post will require Monday to Sunday working but no night duties.&lt;/p&gt;\n&lt;p&gt;If you would like more information about this opportunity or to arrange an informal visit, please contact via e-mail:&lt;/p&gt;\n&lt;p&gt;Julie Ball,  Ward Manager for Meavy Ward julie.ball1@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Víctor Sánchez-Castrillón, Matron for Acute Medicine v.sanchez-castrillon@nhs.net&lt;/p&gt;\n&lt;p&gt;Interviews to be held on the week commencing on the 23rd of November of 2020.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Deputy Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249429", "validThrough": "2020-11-15T23:59:59+0000"}