{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa (pro-rata if part-time)"}}, "datePosted": "2020-10-09T09:58:18+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 5 theatre Practitioner Registered Nurse /ODP&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Don’t miss this fantastic opportunity to join our dynamic team theatre staff here at The Royal Orthopaedic Hospital NHS Foundation Trust. We are currently recruiting Band 5 Theatre Practitioners to join our highly committed team across a variety of areas.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Why is the Royal Orthopaedic Hospital a great place to work and progress your career?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The team at the Royal Orthopaedic NHS Foundation Trust provides a holistic approach when caring for a wide range of patients with complex musculoskeletal, spinal and oncology conditions, many of whom require high dependency care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As one of the country’s few Elective Orthopaedic Specialist Hospitals, ‘The Royal Orthopaedic Hospital’ receives referrals &amp; transfers only and therefore has no ‘Emergency Department’. This allows our nurses &amp; ODPs to focus their attention on the delivery of truly holistic and patient centred care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;With multi-professional team working we are continually enhancing the patient journey and experience with high quality, evidence-based care delivery. This includes, Critical Care Outreach, Tissue Viability, Safeguarding, Infection Prevention and Control any many more…. We even have our own community service!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a strong commitment to education and training and will provide a comprehensive package of learning and skills-based competency, supported by senior clinical staff. All new starters will be offered a period of supernumerary practice. If you are newly qualified you will be allocated a Preceptor to support you and access the Trust Preceptorship process. We understand that changing jobs or embarking on a new career can be daunting, but we will support you all the way. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to work in a hospital that values you, supports you in allowing you the time to really care and is committed to your professional development then apply today! &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Theatres&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have 12 theatres within the department expanding to 14 and a 15 bedded recovery unit with an additional recovery unit as a part of the theatre expansion. We have many specialities of surgery such as arthroplasty, arthroscopy, small joint, young adult, oncology, spinal and spinal deformity.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a professional workforce of Surgeons, Anaesthetists, Physicians Assistants, including Surgical First Assistants, Scrub, Anaesthetic and Recovery Practitioners that are either Operating Department Practitioners or Registered Nurses.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are great opportunities in the theatre department for professional development and we offer a comprehensive and structured preceptorship programme. We are very proud of our Care Quality Commission GOOD Status and are working towards the Trusts vision of being the first choice for orthopaedic care. We are at the cutting edge of orthopaedic procedures with our Mako Robot and Spherox Stem Cell therapy which uses the patient’s own cells to repair defective cartilage. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;For more information please Contact:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;David Watt &lt;/strong&gt;685 4000 Ext 55125 Clinical Standards Lead - Theatre&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Tracey Rutter &lt;/strong&gt;685 4000 Ext 55381 Theatre Matron&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120848.PNG", "name": "The Royal Orthopaedic Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120848"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northfield, Birmingham", "postalCode": "B31 2AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4212", "longitude": "-1.96082"}}, "title": "Theatre Practitioner - ODP / Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219614", "validThrough": "2020-11-06T23:59:59+0000"}