{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 per annum,pro rata"}}, "datePosted": "2020-11-03T17:15:25+0000", "description": "&lt;p&gt;&lt;span&gt;The Neighbourhood Night Service is a forward thinking, dynamic team that is continuously looking to improve the service we deliver. For example, the service will be part of a new Virtual Ward (Frailty) pilot over the coming months, providing coordinated rapid care to people in their home who are experiencing an acute medical episode. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking to appoint a Community Nursing Assistants (band 3) to work as part of our nursing team to deliver outstanding patient care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Neighbourhood Night Service operates centrally from Killingbeck Leeds from 20.45pm - 07:15am providing care across Leeds to patients requiring nursing intervention in their own home. One of the key aims of the service is to prevent unnecessary hospital admissions and to ensure that palliative patients remain in their own homes, where this is their preference. The Neighbourhood Night Service is part of a wider multi-disciplinary team and ensures there is 24/7 nursing care for patients in the community. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting and varied role that incorporates many different aspects of patient care delivered to a wide range of patients. One aspect of the role will be with our palliative patients providing one to one care in their own homes in their last weeks of life. When working with a palliative patient you will be based in the patient home overnight. Another element of the role is to support the Registered Nurses responding to intervention call outs overnight or to work alongside a colleague and visit patients overnight for a planned intervention. We will also be supporting the Virtual Ward (Frailty) providing coordinated rapid care to people in their home who are experiencing an acute medical episode &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Hours of work would be: &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;21:45pm - 07:15am (9 hours) &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;It would be expected that you are available to work on a rota over 7 nights per week, 365 days per year. Rotas would be issued with a minimum of 4 weeks&#39; notice. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The contract is for a minimum of 18 hours (2 nights) up to a maximum of 36 hours (4 nights) Hours available can be discussed prior to application or at interview as required as a variety of hours are available.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must have excellent communication, organisational and IT skills. You will need to assess and respond to the changing needs of the patient, working within your own limits and seeking support from the wider clinical team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A full tailored induction programme will be supported and ongoing development encouraged. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;So if you have a passion to ensure that patients get the care they need, at the time they need it and in their preferred place of care, then this is the role for you. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to the nature of the role it is essential that applicants are able to travel independently across the locality and have access to a suitable vehicle for business purposes. If necessary adjustments can be considered in accordance with the Equality Act 2010.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interviews will be held on the 15th and 17th of December. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123892.jpg", "name": "(AS) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123892"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Killingbeck", "postalCode": "LS14 6FD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.806", "longitude": "-1.48042"}}, "title": "Neighbourhood Clinical Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254897", "validThrough": "2020-11-29T23:59:59+0000"}