{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa. Inclusive of HCAS (15%)"}}, "datePosted": "2020-11-04T08:16:21+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to work with the Discharge Coordinator team in the role of a Junior Discharge Coordinator within the Unplanned Care Division.&lt;/p&gt;\n&lt;p&gt;The role of this team is to facilitate the timely and appropriate transfers of care to the most appropriate settings for patients.&lt;/p&gt;\n&lt;p&gt;This post provides the right applicant with the opportunity to join the discharge team and to develop in a role that is vital in supporting patients, their families and carers through the often complex discharge process.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have current experience of the discharge process and must have excellent communication skills, however full training and support will be provided.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to develop your teaching skills and participate in Trust wide initiatives to improve the discharge planning process.&lt;/p&gt;\n&lt;p&gt;We are looking for an organised individual who has the capability to develop in the role and learn the complexities of discharge processes, whilst working with partners and external stakeholders.&lt;/p&gt;\n&lt;p&gt;The post holder will be able to work under pressure in a busy environment and support clinical staff in all matters relating to discharge.&lt;/p&gt;\n&lt;p&gt;The post is full time, but we welcome applications from those wishing to work part time and/or job share. Applications for a secondment opportunity will also be considered.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sam Finn,Senior Discharge Co-ordinatorEmail Sam.finn@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number020 8934 6587 / 07785 906133&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston Hospital NHS Foundation Trust, Kingston Upon Thames", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Junior Discharge Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255054", "validThrough": "2020-11-18T23:59:59+0000"}