{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Please see advert wording"}}, "datePosted": "2020-11-06T10:31:06+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to work for an established and respected local mental health charity? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Solent Mind is the leading ­mental health charity across Hampshire providing a range of high quality &lt;span&gt;services to improve people’s mental wellbeing and to promote choice and rights to everyone who needs &lt;span&gt;our support. Our services operate in various locations throughout the Hampshire area. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;italk is the Improving Access to Psychological Therapies (IAPT) service provided in partnership between Solent Mind and Southern Health NHS Foundation Trust. We are currently recruiting for:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Reference: SPWPNov20&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;STEP 2 IAPT SENIOR PSYCHOLOGICAL WELLBEING PRACTITIONERS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37 Hours Per Week (30 Hours Per Week Minimum Part Time Also Considered)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary Range: £31,000 (Pro Rata) Per Annum (subject to final funding confirmation)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Based At Either Eastleigh (West)/Gosport (East)/Basingstoke (North) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Thu 19 Nov 2020 (By Midnight)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: Fri 04 Dec 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit several Senior Psychological Wellbeing Practitioner (SPWP) to join our busy and expanding Step 2 team. This recruitment opportunity would be a great opportunity for Qualified Psychological Wellbeing Practitioners who are committed to Step 2 work, highly motivated, flexible and a strong team players to develop their career within our Low Intensity service.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role involves managing a group of PWPs to ensure the quality of their work is maintained through facilitating clinical skills supervision and line management. &lt;strong&gt;Successful applicants will need a Postgraduate or Degree Certificate in Psychological Therapies&lt;/strong&gt;, be able to demonstrate sound knowledge and practice at Step 2, as well as strong clinical decision making. Ideally candidates will have previous supervisory experience, however this is not essential. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please mention in your application how long you have been working as a Qualified PWP.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will need a secure knowledge of Step 2 IAPT based treatments in order to deliver these to patients as well as to help develop, support, train and provide clinical supervision to the rest of the team. You will also have opportunities to develop skills in interviewing, line managing, coaching and developing new trainees who will be joining the service in our January cohort.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a challenging role and you will need to be resilient and flexible to cope with the constantly changing needs of staff and the service. If you are interested in this position and believe that you have the relevant skills and experience, then this could be the opportunity for you! In return, we offer a vibrant and friendly working environment with excellent benefits, including 25 days holidays, plus a contributory pension scheme.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is offered as a permanent full-time equivalent post (part time working will be considered) with the expectation that all clinical staff work one late evening per week (12pm until 8pm).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Please state three reasons to shortlist me in the first paragraph of the supporting statement in order to be considered for shortlisting.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more details on this role, email either:-&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Sarah Richardson (Clinical Manager) at &lt;/span&gt;&lt;span&gt;srichardson@solentmind.org.uk&lt;/span&gt;&lt;span&gt;. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Heather Simons (Clinical Manager) at &lt;/span&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;hsimons@solentmind.org.uk&lt;/span&gt;&lt;/span&gt;&lt;span&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A&lt;/strong&gt;&lt;strong&gt;ll posts will be subject to relevant DBS check if required&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;PLEASE NOTE &lt;strong&gt;&lt;span&gt;WE DO NOTACCEPT CV&#39;s &lt;strong&gt;NOR DO WE ACCEPT APPLICATIONS FROM RECRUITMENT AGENCIES&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This position is being advertised on behalf of Solent MIND and therefore you will be an employee of Solent MIND and not Southern Health NHS Foundation Trust.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Based At Either Eastleigh (West)/Gosport (East)/Basingstoke (North)", "postalCode": "SO50 9DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9696", "longitude": "-1.359"}}, "title": "Senior Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259225", "validThrough": "2020-11-19T23:59:59+0000"}