{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa, pro-rata"}}, "datePosted": "2020-11-06T14:16:35+0000", "description": "&lt;p&gt;Chesterfield Central Adult Community Mental Health Team has a vacancy for an enthusiastic Registered Nurse with an interest in recovery, collaborative working and community based practice.&lt;/p&gt;\n&lt;p&gt;We aim to provide a comprehensive, multi-professional service that continues to improve and develop services that promote recovery and wellbeing.&lt;/p&gt;\n&lt;p&gt;The post primarily undertakes the role of Care Co-ordinator and Lead Professional for people who are experiencing a diverse range of mental illnesses.&lt;/p&gt;\n&lt;p&gt;The post involves providing comprehensive evidence based assessment and treatment using a range of appropriate individual interventions.&lt;/p&gt;\n&lt;p&gt;You will need a thorough knowledge of the Care Programme Approach and be able to demonstrate expertise in safety planning and able to manage working autonomously in a community setting.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate expertise around NMC Nurse Competencies.&lt;/p&gt;\n&lt;p&gt;You will need to have excellent communication skills and be able to operate as an integrated member of the multi-disciplinary team whilst maintaining a person-centred focus.&lt;/p&gt;\n&lt;p&gt;The ability to transport yourself and service users across a wide geographical area without compromising service needs is essential.&lt;/p&gt;\n&lt;p&gt;You will need to be able to work within and as part of an experienced, friendly and committed team.&lt;/p&gt;\n&lt;p&gt;This is a great development opportunity for existing band 5 nurses or newly-qualified nurses to gain experience within a community setting and develop new skills.&lt;/p&gt;\n&lt;p&gt;To support your continued professional development you will receive regular supervision both individual and group from senior colleagues and from your service manager to support you with your caseload.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joanne Green&lt;/p&gt;\n&lt;p&gt;joanne.green27@nhs.net&lt;/p&gt;\n&lt;p&gt;0300 123 3372&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bayheath House, Chesterfield", "postalCode": "S40 1JF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2372", "longitude": "-1.4333"}}, "title": "Registered Nurse - Community", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260102", "validThrough": "2020-11-19T23:59:59+0000"}