{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51068", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - 51,068 pa plus London weighting"}}, "datePosted": "2020-10-28T17:45:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Trust Doctor- Stroke&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Trust Grade in Neurology (Neuro-Rehabilitation) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Trust Grade in Neuro-Rehabilitation Medicine within the UCLH/NHNN Neuro-Rehabilitation Unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for applications to join a dedicated and highly motivated team that is committed to providing the highest standards of care for patients in our Neuro-Rehabilitation Unit whilst developing a truly world class training and research programme.&lt;/p&gt;\n&lt;p&gt;Our service includes an 18 bedded, Level 1 Neuro-Rehabilitation Unit - one of the largest in London. Our service is located at The National Hospital for Neurology, Queen Square (NHNN). UCLH and NHNN are the most centrally located hospitals in London, within walking distance to Oxford Street, Covent Garden and Soho.&lt;/p&gt;\n&lt;p&gt;The Neurorehabilitation Unit (NRU) focuses on the management of motor disability and manages a wide range of neurological disorders, including stroke, MS, Cervical myelopathy and neuromuscular disorders. Approximately 160 patients are admitted each year.&lt;/p&gt;\n&lt;p&gt;This post would suit any doctor looking to gain experience and training towards applications to medical speciality training (particularly neurology, stroke or rehabilitation)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful applicant will participate in an un-banded Monday – to Friday post on the NRU &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Doctors who are not UK or EEA nationals and whose immigration status entitles them to work without restriction in the UK will be considered on an equal basis with UK and EEA nationals. Other non-UK or non-EEA nationals with limited leave to remain in the UK and whose employment will require Tier 2 sponsorship are subject to the Resident Labour Market Test (RLMT).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information please contact Dr Orlando Swayne, Consultant Neurologist (o.swayne@nhs.net)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Senior Trust Doctor- Stroke", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247514", "validThrough": "2020-11-11T23:59:59+0000"}