{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-10-25T20:17:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse | Outpatients | Band 5 | Brentwood | 12 Month Fixed Term Contract | Full Time.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Hartswood Hospital has an exciting opportunity for a Registered Nurse in the Outpatient Department for a 12-month FTC to join our experienced and dynamic team. Working with a wide variety of specialisms you will be able to develop your clinical skills in a modern and supportive environment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Hartswood Hospital is a 49 bed hospital with4 theatres and offers a comprehensive range of services and facilities Our vision is to be recognised as a world class healthcare business bringing together the best people who are dedicated to developing excellent clinical environments and delivering the highest quality patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assess patients’ health and wellbeing across a complex and changing caseload.&lt;/li&gt;\n&lt;li&gt;Assist in the delivery of care to meet individuals’ health and wellbeing needs&lt;/li&gt;\n&lt;li&gt;Provide and receive complex, sensitive or contentious information.&lt;/li&gt;\n&lt;li&gt;Acknowledge the risk of Healthcare Associated Infections (HCAI) and understand own responsibility as agreed with line manager in the prevention and control of HCAI.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be NMC registered - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Have a minimum of 12 months outpatient, ward or theatre nursing experience.&lt;/li&gt;\n&lt;li&gt;Compassionate and able to showcase excellent patient care&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides, inpatients, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Carly Dack on 07850725333 or email carly.dack@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brentwood", "postalCode": "CM13 3LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6004", "longitude": ".293143"}}, "title": "Outpatient Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241599", "validThrough": "2020-12-02T23:59:59+0000"}