{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-28T10:31:58+0000", "description": "&lt;p&gt;Following significant investment to support an ongoing and dynamic development programme, the Children’s Unit is recruiting paediatric nurses to complement &amp; enhance the current nursing establishment.&lt;/p&gt;\n&lt;p&gt;We follow a blended workforce model and are interested in creatively enhancing our workforce to meet the needs of our children and young people. We would be interested to hear from you if:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You have skills/would like to further develop skills in critical care&lt;/li&gt;\n&lt;li&gt;You have skills/would like to further develop skills in caring for paediatric surgical patients&lt;/li&gt;\n&lt;li&gt;You have skills in Urgent Care Services to support our increasing patient acuity and service demand in our Paediatric Observation and Assessment Unit&lt;/li&gt;\n&lt;li&gt;You would like to predominately work night shifts&lt;/li&gt;\n&lt;li&gt;You would like to explore non-traditional nursing shifts such as twilight hours, mid shifts, shorter shifts to cover peak activity&lt;/li&gt;\n&lt;li&gt;You have an interest/skills in caring for children and young people with mental health needs&lt;/li&gt;\n&lt;li&gt;You have an interest/skills in caring for children and young people with complex needs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are privileged to have a large, bright, child friendly unit with adolescent facilities, sensory facilities, outdoor play area and excellent links with other services such as Speech and Language Therapy and Healthy Young Minds. Our unit consists of 4 distinct areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;INPATIENTS - 20 inpatient beds with scope to open to additional capacity during periods of high demand providing quality care to a large variety of patients with medical and complex needs whilst also providing an expanding paediatric surgical service.&lt;/li&gt;\n&lt;li&gt;CRITICAL CARE – A newly expanded 6 bedded critical care area to care for level 1 and 2 paediatric critical care patients.&lt;/li&gt;\n&lt;li&gt;PAEDIATRIC OBSERVATION &amp; ASSESSMENT UNIT (POAU)– a busy 24hour unit working closely with colleagues in paediatric Accident and Emergency, Primary and Tertiary Care&lt;/li&gt;\n&lt;li&gt;OUTPATIENTS – We provide Outpatient services to children and young people across Oldham and Rochdale from two sites.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are highly committed to your continuous professional development and you can expect a personalised development programme, access to an extensive programme of paediatric specific training including APLS, PILS and Critical Care training facilitated by our Paediatric Practice Educator and external organisations. You will also benefit from four weeks supernumerary status to support your orientation to the Northern Care Alliance.&lt;br /&gt;&lt;br /&gt;We have lots of exciting developments in the planning and would welcome an opportunity to show you around the Children’s Unit and answer any questions.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership.&lt;/p&gt;\n&lt;p&gt;If you are a newly qualified nurse / ODP / midwife we will pay your first years NMC / HCPC registration fee as well as pay you at Band 4 until you receive you NMC / HCPC PIN.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Malcolm Wood (POAU Manager)&lt;/p&gt;\n&lt;p&gt;0161 778 5707&lt;/p&gt;\n&lt;p&gt;malcolm.wood@pat.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oldham Care Organisation, Oldham", "postalCode": "OL1 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5533", "longitude": "-2.12183"}}, "title": "Staff Nurse - Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246092", "validThrough": "2020-11-11T23:59:59+0000"}