{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-11-06T08:16:33+0000", "description": "&lt;p&gt;&lt;strong&gt;Contract type: Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Up to 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The York Endoscopy Unit is going through an exciting period of growth. Our Unit offers Diagnostic and Therapeutic procedures ranging from; Gastroscopy, Colonoscopy, EBUS, Endoscopy, Bronchoscopy and other screening procedures, to Nurse led pre-assessment and Warfarin Clinics.&lt;/p&gt;\n&lt;p&gt;The Unit offers a fast paced working environment where we can support you to learn and develop your Endoscopy and Nursing skills.&lt;/p&gt;\n&lt;p&gt;We’re looking for nurses with enthusiasm, strong communications skills and who are driven to provide excellent patient focussed care.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a team player with a strong desire to provide compassionate care and empower others within a friendly and supportive environment. Successful applicants will receive a comprehensive training package, therefore previous experience is not essential.&lt;/p&gt;\n&lt;p&gt;You must be able to work well as part of a team and be able to use your initiative and work well under pressure.&lt;/p&gt;\n&lt;p&gt;We provide a seven day a week service between the hours of 8am - 8pm and once fully trained applicants will be expected to participate in an out of hours on call GI bleed nursing rota.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we can offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A supportive &amp; friendly working environment&lt;/li&gt;\n&lt;li&gt;Active encouragement to learn and develop within your role&lt;/li&gt;\n&lt;li&gt;Dedicated career pathways and great opportunities for continuing professional development&lt;/li&gt;\n&lt;li&gt;Commitment to, and support for, your wellbeing&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;NHS discount and salary sacrifice schemes, including childcare vouchers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer you as nurse joining our Trust:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Nurses who have completed their qualification and are awaiting NMC registration will be paid at AfC Band 4 (previously Band 2)&lt;/li&gt;\n&lt;li&gt;A £750 relocation fee where a nurse is moving 20 miles from an address that was 50 miles from your new work base;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is an exciting time to join the Endoscopy Team and we would strongly encourage anyone interested in the role to contact us to arrange an informal visit.&lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Michelle Robinson&lt;/p&gt;\n&lt;p&gt;Endoscopy Sister&lt;/p&gt;\n&lt;p&gt;michelle.robinson@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;01904 726690&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Staff Nurse - Endoscopy Unit (York)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258868", "validThrough": "2020-11-22T23:59:59+0000"}