{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "24,907 - 30,615"}}, "datePosted": "2020-11-06T15:33:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;East Lancashire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full and Part Time Hours available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a thoughtful and dedicated Staff Nurse based in Lancashire? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every ten 10 of the people who use services would recommend them?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Staff Nurse delivering our services with us you will receive AfC 20/21 salary and terms and conditions– including an NHS pension. We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression. We will offer a combination of in house eLearning, workshops and courses to support your development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will become part of the Virgin Tribe. This grants you access to premier offers such as discounts on Virgin Products such as holidays.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a Registered Nurse with evidence of continual professional development. You will have experience of working in a team and inter-agency and collaborative working. You will be motivated and enthusiastic, open to change and be able to support the senior registered colleagues whilst developing the wider Healthy Family Team&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As the Staff Nurse you will provide key elements of the Healthy Child Programme and targeted care based on individual families’ needs as delegated by School Nurse, Health Visitor or Team Leader. You will complete individual Health Assessments for children and young people identified as being open to Child Protection Plan or Child in Need Plan.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working within the Lancashire Young People and Families Service, you will provide weekly drop-in sessions in every High School in the locality. You will provide training at pre-school age and to schools regarding, management of complex health needs. You will Support the School Nurses in acting as a link to assigned schools and build and develop internal and external relationships with wider stakeholders.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Although you will be primarily based in East Lancashire as a service we work across the Lancashire region. There may be times you are asked to travel to different locations for work to support our colleagues and service users.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Inspired&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In April 2019 Lancashire Healthy Young Person and Family Service received full UNICEF Baby Friendly Re accreditation and are now working towards their GOLD accreditation in march 2020. For families this means Baby Friendly care to support them to feed and care for their babies, for staff this means on-going training, guidance and resources to support them to have good conversations with families to support the best start for their baby and family&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you’d like to discuss the role further please contact Lisa Aspinall or Denise Farnworth via email:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Lisa.Aspinall@virgincare.co.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Denise.farnworth@virgincare.co.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care is committed to safeguarding and protecting the children and young people that we work with. As such, all posts are subject to a safer recruitment process, including the disclosure of criminal records and vetting checks. We ensure that we have a range of policies and procedures in place which promote safeguarding and safer working practice across our services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We partner with the NHS to make a real difference to people in Lancashire and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston", "postalCode": "PR2 2YF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7598", "longitude": "-2.73"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260407", "validThrough": "2020-11-20T23:59:59+0000"}