{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-11-04T08:45:29+0000", "description": "&lt;p&gt;Our Outpatient services has an exciting opportunity for an ambitious individual with experience in operational leadership to join our team as General Manager.&lt;/p&gt;\n&lt;p&gt;The Outpatient service is a fast-paced, dynamic department and our teams work across 7 sites in East Kent. We have an ambitious transformational programme underway, so this is a fantastic time to be joining the team and playing a fundamental role during this period of change.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work closely with Senior team in leading the programme and operational success within the department, with a great opportunity to make a real difference to patient care and requires you to engage and influence stakeholders across the Trust.&lt;/p&gt;\n&lt;p&gt;This opportunity suits an individual with demonstrable knowledge of leadership and management who is ready to help transform our outpatients’ services. Leading operationally a strong responsive management team with a long-standing record of delivering, taking accountability for performance.&lt;/p&gt;\n&lt;p&gt;The post holder will have the ability to influence and inspire, building positive collaborative relationships within the Trust and the broader health and social care system. Patient safety, quality and access at the heart of delivery, upholding a positive patient and carer experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChristine HudsonJob titleOperational Director for Clinical Support Services Care GroupEmail addresschudson4@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;Kelly Evans&lt;/p&gt;\n&lt;p&gt;Assistant to Clinical Director and Operations Director&lt;/p&gt;\n&lt;p&gt;kelly.evans5@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Outpatient Services General Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255110", "validThrough": "2020-11-11T23:59:59+0000"}