{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "40000", "unitText": "YEAR", "value": "up to £40,000"}}, "datePosted": "2020-10-29T16:03:51+0000", "description": "&lt;h2&gt;Join us today at Priory Hospital Bristol and receive our £5000 welcome to Priory bonus&lt;/h2&gt;\nAre you?\n&lt;p&gt;A driven and dynamic  Nurse?&lt;br /&gt;An experienced RMN/RNLD  wanting to take the next step in your career?&lt;br /&gt;Wanting to make a difference to someone’s life?&lt;br /&gt;Ready for a new challenge?&lt;br /&gt;Wanting to work with the best nurses in the UK?&lt;/p&gt;\nIf you’ve answered yes to the above then get in touch with our Nurse Recruiter Adam O&#39;Shea on 07834514945\n&lt;strong&gt;About The Role :&lt;/strong&gt;\n&lt;p&gt;We are seeking a full time Ward Manager to join our team here at Bristol Priory Hospital at an exciting time opening a Male Adult PICU Service&lt;/p&gt;\n&lt;p&gt;You will be managing a Ward of up to 12 beds, supporting and managing staff in order to meet the psychological and therapeutic needs of a diverse group of service users with varying degrees of mental and physical issues. You will be caring and attentive with the skills to build strong and trusting relationships with people. It is also important that you work well in a team, and are keen to work in fast paced environment and are able to report effectively to Senior Management.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in a PICU setting would be preferred and we are looking for candidates either with a proven track record in managing and leading a Ward team or the experience ready to step up, both with a genuine interest in working with this client group within an inpatient setting.  Candidates should also have the necessary interpersonal qualities to enable them to lead, manage and collaborate effectively as part of a big multi-disciplinary team. Candidates should have a high level of commitment and creativity, resilience and robustness, positivity and personal warmth, as well motivation and excellent team-working skills.&lt;/p&gt;\n&lt;p&gt;This post will offer the successful candidate a real opportunity for personal and professional development within a highly challenging environment – managing and building a new team and service will, we hope, inspire and challenge you, give you the experience and confidence to grow and form constructive professional relationships with colleagues and patients.  You will report directly to the Director of Clinical Services and, as an experienced practitioner, the team will look to you for direction and encouragement. &lt;/p&gt;\nWhat you will need:\n&lt;ul&gt;\n&lt;li&gt;Experience of working within an in-patient mental health setting and the treatment of adults as well as in a PICU setting&lt;/li&gt;\n&lt;li&gt;High levels of customer service&lt;/li&gt;\n&lt;li&gt;Effective Management of complaints&lt;/li&gt;\n&lt;li&gt;A strong sense of responsibility &amp; ownership&lt;/li&gt;\n&lt;li&gt;Willingness to learn&lt;/li&gt;\n&lt;li&gt;Effective communication skills&lt;/li&gt;\n&lt;li&gt;Flexibility and strong “can do” attitude&lt;/li&gt;\n&lt;/ul&gt;\n&lt;strong&gt;What we’d like to offer you:&lt;/strong&gt;\n&lt;ul&gt;\n&lt;li&gt;Many benefits in line with the NHS&lt;/li&gt;\n&lt;li&gt;Working with a dedicated multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Free on-site parking&lt;/li&gt;\n&lt;li&gt;Enhanced maternity pay&lt;/li&gt;\n&lt;li&gt;Flexible benefits including reduced rates and access to new schemes including gym membership, IT technology (laptops / tablets / smartphones) and private healthcare&lt;/li&gt;\n&lt;li&gt;Access to development opportunities including:&lt;/li&gt;\n&lt;li&gt;Sponsorship of professional qualifications through our Individual Professional Development (IPD) panel&lt;/li&gt;\n&lt;li&gt;Leadership &amp; management development&lt;/li&gt;\n&lt;li&gt;Long service award&lt;/li&gt;\n&lt;li&gt;Flexibility with the introduction of our new e-rostering system which will allow you to book additional shifts through an online portal in the future&lt;/li&gt;\n&lt;li&gt;Enhanced support with Return to Practice&lt;/li&gt;\n&lt;li&gt;Subsidised meals&lt;/li&gt;\n&lt;li&gt;25 days annual leave plus bank holidays&lt;/li&gt;\n&lt;li&gt;Birthday Holiday  - Your Birthday as an extra days annual leave&lt;/li&gt;\n&lt;li&gt;Refer a friend to nursing bonus&lt;/li&gt;\n&lt;li&gt;Mentoring and involvement in HCA / Support worker development&lt;/li&gt;\n&lt;li&gt;Relocation support (including payment for accommodation or moving costs) up to £4000 (Terms apply)&lt;/li&gt;\n&lt;li&gt;Payment into the pension scheme&lt;/li&gt;\n&lt;li&gt;CPD top up&lt;/li&gt;\n&lt;li&gt;Donation to a charity of your choice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;strong&gt;About Priory Hospital Bristol:&lt;/strong&gt;\n&lt;p&gt;Priory Hospital Bristol is part of the Healthcare Division of Priory Group and has 86 beds over eight wards varying from Eating Disorders, Acute Mental Health, Acquired Brain Injury, CAMHs Tier 4, CHAMHs PICU, Huntingdon’s and Dementia.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS16 1EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4797", "longitude": "-2.56677"}}, "title": "Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249010", "validThrough": "2020-11-12T23:59:59+0000"}