{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 per annum"}}, "datePosted": "2020-11-05T09:46:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Education Transformation: Widening Participation &amp; Vocational Learning Team N.West&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Programme Support Officer Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Term: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £31,365 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base: PP3 Manchester (although WFH is currently in place)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Education Transformation Team in Health Education England working across the North West has a key role in ensuring the conditions and relationships for excellent, responsive and impactful education in the development of the current and future healthcare workforce. With a strong commitment to stakeholder engagement, partnership working and innovation, the Education Transformation Team will help identify, encourage, broker and manage a wide ranging portfolio of education activities designed to excite, attract, retain and enable the development of a diverse, skilled and committed healthcare workforce all with the common aim of ensuring the delivery of the best possible healthcare to patients, their families and communities.&lt;/p&gt;\n&lt;p&gt;The WP team working within the Education Transformation Team exist to develop the understanding and utilisation of the best evidence and intelligence to support widening participation and increase diversity within the health &amp; social care workforce. This includes maximising &amp; supporting opportunities for apprenticeships, careers, schools/FE/HE and employer engagement, widening access, increase collaborative approaches in supporting widening participation initiatives, including outreach activity and stimulate and increase the capacity of healthcare organisations in being able to expand and support work or work related experience opportunities. Inspire others to create a culture of inclusion and awareness of the local community within the NHS in its role as an anchor organisation.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Post requires &lt;br /&gt;• Education to post graduate level or equivalent level of knowledge of working at a similar level in specialist area. &lt;br /&gt;• Proven ability and experience of successfully supporting the delivery of projects or programmes, from initiation to completion, within a complex environment, to agreed parameters of cost, timescales, and quality. &lt;br /&gt;• Proven ability to collect, analyse and manipulate data and information and compiling high quality reports for the team, senior managers and stakeholders. &lt;br /&gt;• Proven ability to monitor and report project or programme progress in a variety of ways within the agreed timescales and to the required standards. &lt;br /&gt;• Ability to work flexibly and well under pressure. &lt;br /&gt;• Excellent communication and interpersonal skills with strong ability and experience of proactively engaging with and managing a broad range of stakeholders, designing and using appropriate communication techniques. &lt;br /&gt;• Recognised project management qualification e.g. APMP or PRINCE2 Practitioner or willingness to undertake. &lt;br /&gt;• Budget monitoring and ensuring effective financial management. &lt;br /&gt;• Be familiar with the NHS values and demonstrate these in your work, and strive to deliver not just good, but excellent programme support and customer service.&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 6 with a full-time starting salary of £31,365, with pay step increases as after 2 years’ service and 5 years&#39; service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Jacqui Gladwin&lt;/p&gt;\n&lt;p&gt;Job title: Widening Participation &amp; Vocational Learning Lead HEE North West&lt;/p&gt;\n&lt;p&gt;Email address: jacqui.gladwin@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07824301673&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;For initial information/informal discussion please contact&lt;/p&gt;\n&lt;p&gt;Jacqui Gladwin&lt;br /&gt;Widening Participation and Vocational Learning Lead&lt;br /&gt;Jacqui.gladwin@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Interview Dates: In December day to be confirmed&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester, Manchester", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "Programme Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257108", "validThrough": "2020-11-22T23:59:59+0000"}