{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-11-02T12:16:08+0000", "description": "&lt;p&gt;We are looking for a motivated, creative and dynamic Registered Mental Health Nurse to join us at Lambeth CMHT for older adults, within the Psychological Medicine and Older Adult Directorate of SLaM. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;span&gt;About the team:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Lambeth CMHT is a well established, highly experienced and supportive team, comprised of CPNs, Psychiatrists, Occupational Therapists, Clinical Psychologists and Social Workers. The team aims to guide service users towards realising an optimum level of functioning and support them to maintain good mental health. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;span&gt;About the role:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will work as Care Coordinator for a caseload of service users in the local community who have complex mental health difficulties, and also work with their carers where applicable. The post holder will be expected to have excellent self management skills, and also work collaboratively within the team. The post holder must be able to formulate flexible, robust and holistic care plans with service users and/or carers, to work well under pressure, be experienced in dynamic risk assessment, and also to have excellent communication skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application&lt;/p&gt;\n&lt;p&gt;Due to national guidelines regarding social distancing, all interviews will be held using the video conferencing platform Microsoft Teams. If invited to interview, you will need to download Microsoft Teams onto an electronic device in advance of the interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCaleb ByrtJob titleTeam ManagerEmail addresscaleb.byrt@slam.nhs.ukTelephone number0203 2288 300Additional contact information&lt;/p&gt;\n&lt;p&gt;Carla Vidale, Clinical Nurse specialist, 0203 2288030&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lambeth Hospital, 108 Landor Road, London, SW9 9NU, Lambeth", "postalCode": "SW9 9NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4668", "longitude": "-.122624"}}, "title": "Community Mental Health Nurse / Care Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252010", "validThrough": "2020-11-09T23:59:59+0000"}