{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-23T17:49:30+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;The Royal Surrey County Hospital NHS Foundation Trust&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Consultant in Neurology&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are invited for a substantive Consultant Neurologist based at the Royal Surrey County Hospital Foundation Trust (Guildford, Surrey). The successful candidate will have CCT or equivalent and be on the Specialist Register for Neurology medicine when they take up the post (applications are welcome from those within six months of their CCT date). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking a motivated individual to help to develop neurological services within the general hospital and the cancer centre, and to cultivate the academic partnership with the adjacent University of Surrey. The successful applicant will be expected to contribute to the generic neurology service, and to develop a relevant subspecialty interest.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Currently, the department of Neurology has two substantive consultants but with new investment to double the WTEs, including this post &amp; 2 proposed hybrid jobs with St George’s Neurosciences to evolve sub-specialty delivery. This allows full flexibility to recruit individuals with the right skill-set but match the needs of patients &amp; those of successful applicants. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is a numbered Specialist Registrar on the Kent, Surrey &amp; Sussex training programme, a returning GPSi to deliver the headache service and Junior doctors (a specialty doctor, CMT, GP and 2 FY1s) who work across Stroke and Neurology. There will be a Physician Associate from 2020. Whilst there is standard access to in-patient beds at AMH/SGH, RSCH is relatively unique in having dedicated Neurology beds allied to the Acute Stroke Unit, offering added-value care for patients for whom it is appropriate &amp; taking advantage of a high level of Therapist &amp; MDT neurological expertise on the ward including a gym.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We provide a daily inpatient advisory service to complement having specified Neurology beds. We offer generic and specialist neurology clinics planning evolution for Headache &amp; Multiple Sclerosis interventions to take advantage our strategy to expand specialist nursing support. There is an MS nurse &amp; a PD nurse and plans for 2 further Neurology Nurses and a prescribing pharmacist.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The team also includes Consultant led Neurophysiology providing NCS/EMG, EEG and multimodal Evoked Potentials. We have weekly neuroradiology meetings supported by a visiting specialist consultant Neurology radiologist from St George’s Hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Royal Surrey County Hospital has excellent technical facilities in addition to Neurophysiology, including access to two 3T MRIs &amp; a 1.5T MRI, two 256-slice CT scanners, PET &amp; PET CT, DaTscans &amp; HMPAO SPECT, all on site enabling care to be delivered closer to home to a high standard, but with continuing &amp; strengthened links with Regional Neuroscience services at St George’s Hospital. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Not just an acute district general hospital serving 320,000, the Trust is also a cancer centre (St. Luke’s Cancer Centre), with most oncology subspecialties to serve a population of 1.2 million (from Surrey, West Sussex and Hampshire). It provides National expertise for hepatobiliary surgical &amp; medical patients, including Wilson’s disease.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are opportunities for the successful candidate to develop academic links with Surrey University.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information, contact the Chief of Service for Access and Medicine, Dr Sanju Mathew on 01483 571122 ext. 4162, Dr Helen Wilson, Clinical Director for Geriatrics, Stroke &amp; Neurology, ext. 2789 and Dr Graham Warner, Neuroscience Clinical Lead, ext. 4742.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Consultant Neurologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241467", "validThrough": "2020-11-18T23:59:59+0000"}