{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-05T16:01:20+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a full-time Team Leader to join Leicester City&#39;s IAPT Service – Let’s Talk Wellbeing, provided by Nottinghamshire Healthcare NHS Foundation Trust to meet the growing demand for Psychological Therapy.&lt;/p&gt;\n&lt;p&gt;The Let’s Talk Wellbeing Service provides Improving Access to Psychological Therapy (IAPT) services to the population of Leicester City. The underpinning principle of this service is to ensure that the local population can access and benefit from appropriate evidence based talking therapies quickly and easily. Due to the current guidelines for COVID-19 our service is working remotely with a view to a phased restoration and recovery return to working part remotely and part office/clinic based.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity for an enthusiastic and motivated individual with relevant Mental Health management experience to join our Team.&lt;/p&gt;\n&lt;p&gt;The role is to provide line management responsibilities to a diverse group of IAPT High Intensity clinical staff working within a defined locality area.&lt;/p&gt;\n&lt;p&gt;You will work alongside the Service Manager and a supportive team of Clinical Leads, Team Leaders and Senior PWP&#39;s who manage a range of trainee and qualified psychological therapy practitioners. You will have responsibility to provide managerial supervision and appraisals as well as carrying out regular note audits. You will also have the opportunity to provide clinical interventions carrying your own small caseload, as an IAPT compliant therapist.&lt;/p&gt;\n&lt;p&gt;The service uses the IAPTUS data collection system and you would be expected to participate in case management and supervision, as well as maintaining clinical contact and clinical notes using this system.&lt;/p&gt;\n&lt;p&gt;To apply for this post it is essential that you have previous leadership experience in a Mental Health setting and it is desirable that you have a core profession such as RMN, OT or a Social Worker.&lt;/p&gt;\n&lt;p&gt;It is essential that you have completed an IAPT compliant training in a Psychological Therapy such as CBT, IPT, DIT, Counselling or be working as a Senior PWP.&lt;/p&gt;\n&lt;p&gt;You will have worked in a Mental Health service and be able to demonstrate the skills and experience required to lead and manage a team of clinical staff working where agreed targets and outcomes are in place. You will be familiar with key National and local performance targets and national guidance for developments in the IAPT agenda.&lt;/p&gt;\n&lt;p&gt;The service is a provider contract and delivers to both national and local performance targets which you will contribute towards achieving.&lt;/p&gt;\n&lt;p&gt;Let&#39;s Talk Wellbeing is committed to creating a diverse environment and is proud to be an equal opportunity employer, valuing applicants who are representative of our local community.&lt;/p&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jan Wright - Service Manager&lt;/p&gt;\n&lt;p&gt;Email address: janice.wright@nottshc.nhs.uk / Telephone number: 0300 300 2200&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Amanda Wallace - Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: amanda.wallace@nottshc.nhs.uk / Telephone number: : 0300 300 2200&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE4 1ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6685", "longitude": "-1.15628"}}, "title": "Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258471", "validThrough": "2020-11-19T23:59:59+0000"}