{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa (Plus HCAS)"}}, "datePosted": "2020-11-04T12:01:34+0000", "description": "&lt;p&gt;This is an exciting opportunity to join a well-established, supportive Speech &amp; Language Therapy Team who can offer support if you are newly qualified or develop your skills if you already have experience and developing interests.&lt;/p&gt;\n&lt;p&gt;Based in Basildon or Thurrock you will assess and carry out direct and indirect therapy with children presenting with a wide range of speech, language and communication disorders.&lt;br /&gt;You will be working with school aged children in mainstream settings and clinic, and with pre-school children at Drop in sessions, in clinic and pre school settings. You will be supported by specialist therapists to develop your skills working with children with additional difficulties or ASD and DLD . We work closely with therapy and medical and educational colleagues.&lt;/p&gt;\n&lt;p&gt;You will show that you are able to organise, plan and prioritise your own workload, and that of assistant staff; demonstrate the ability to generate appropriate strategies for caseload management. You will have excellent interpersonal skills – including observation, listening and empathy skills, to enable you to work to support the individual needs of the schools, staff and pupils.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; We offer:-&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;a regular supervision programme arranged with a named therapist and support to complete your registration year&lt;/li&gt;\n&lt;li&gt;integrated children’s therapies and professional team meetings to maintain communication and learning opportunities with speech and language, occupational therapists and physiotherapists,&lt;/li&gt;\n&lt;li&gt;a full induction programme&lt;/li&gt;\n&lt;li&gt;a supportive and friendly environment&lt;/li&gt;\n&lt;li&gt;training opportunities through CPD groups and external courses&lt;/li&gt;\n&lt;li&gt;We have experienced admin and Assistant teams.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We encourage innovation and would welcome you to a strong and stable team.&lt;/p&gt;\n&lt;p&gt;The main responsibilities of the post:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To independently manage and make differential diagnoses for a caseload of clients with delays and disorders of communication, speech and language.&lt;/li&gt;\n&lt;li&gt;Devise and deliver appropriate intervention/care plans/enhanced models of SLT for clients with delays and disorders of communication, speech and language and provide suitable and timely support.&lt;/li&gt;\n&lt;li&gt;To provide advice, training and teaching to parents, carers and others in all aspects of management of speech, language and communication delays and disorders in children&lt;/li&gt;\n&lt;li&gt;Work as part of the integrated therapies multi disciplinary team ensuring the delivery of joined up care plans.&lt;/li&gt;\n&lt;li&gt;Contribute to multidisciplinary support for clients with a range of speech, language and communication difficulties.&lt;/li&gt;\n&lt;li&gt;Provide oral and written feedback, advice and training to parents/family members, carers and members of the multidisciplinary team regarding communication needs and strategies to facilitate development&lt;/li&gt;\n&lt;li&gt;Develop and deliver training packages, with support&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;br /&gt;Starting with NELFT&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;High Cost Area Supplement – Essex&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 5% of the basic salary (with a minimum of £1,034 to a maximum of £1,791)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlison GrayJob titleLead for Speech and Language TherapyEmail addressalison.gray@nelft.nhs.ukTelephone number07956384474Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Oaks Clinic, Great Oaks, , Basildon, Essex", "postalCode": "SS14 1EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5719", "longitude": ".458671"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255723", "validThrough": "2020-11-18T23:59:59+0000"}