{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-19T08:45:23+0100", "description": "&lt;p&gt;&lt;strong&gt;Strategy Manager, Greener NHS team – Communications and Stakeholder Engagement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting a Strategy Manager – Communications and Stakeholder Engagement to join NHS England and NHS Improvement’s, Greener NHS programme, which sits within the Primary Care, Community Services and Strategy Directorate.&lt;/p&gt;\n&lt;p&gt;This is an incredibly exciting time to join the Greener NHS programme following the commitment by the NHS in its multiyear plan &lt;em&gt;Delivering a ‘Net Zero’ National Health Service&lt;/em&gt; to become the world’s first carbon net zero national health system and appointment of a Chief Sustainability Officer. This commitment and multiyear plan reflects growing evidence of the health impacts of climate change and air pollution and recognition that it is not enough for the NHS to treat the problems caused by air pollution and climate change – from asthma to heart attacks and strokes – it needs to play a part in tackling them at source.&lt;/p&gt;\n&lt;p&gt;The role is part of a dynamic team supporting the NHS to solve some of its toughest problems and secure a sustainable greener future. The &lt;em&gt;NHS Long Term Plan &lt;/em&gt;and the &lt;em&gt;Delivering a ‘Net Zero’ National Health Service&lt;/em&gt; set out a range of objectives in reducing the environmental impact of the NHS and clear deliverables and milestones for the NHS to reach net zero carbon emissions. Specifically, this communications role will be focusing on engaging with individuals in regional and local systems to support them to implement work needed to create a more sustainable NHS.&lt;/p&gt;\n&lt;p&gt;The Greener NHS team works closely with both corporate and regional teams across NHS England and NHS Improvement, with local health systems, Trusts and other stakeholders. We are uniquely placed to look across the health and care system, to better understand and reduce the environmental impacts of health and care, and save thousands of lives and hospitalisations across the country.&lt;/p&gt;\n&lt;p&gt;As a Strategy Manager – Communications and Stakeholder Engagement we are seeking a highly motivated professional who can work across organisations to deliver key pieces of work. The post holder will support the provision of an efficient, effective and high quality professional and well-co-ordinated communications and stakeholder team. They will have an excellent knowledge of current affairs and a good understanding of health and climate policy. They will have highly developed stakeholder engagement, strategic communications skills and previous experience of working with the media. The post holder will work closely with the colleagues across the Greener NHS Programme and communications teams across all of NHS England and NHS Improvement’s. They will have the ability to think and act strategically, set direction in a complex environment and manage relationships with a wide range of senior colleagues.&lt;/p&gt;\n&lt;p&gt;Some travel throughout England may be required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email address: england.sdu@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House, London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Strategy Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231557", "validThrough": "2020-11-08T23:59:59+0000"}