{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39774", "minValue": "36711", "unitText": "YEAR", "value": "£36,711 - £39,774"}}, "datePosted": "2020-11-05T14:12:31+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;About Us&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Newham is an incredibly diverse borough with a very young population and is experiencing considerable regeneration as part of the Olympic legacy. There are over 86,000 children and young people in Newham and we want each of them to have the same life chances as young people in other parts of London.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Newham’s Children and Young People’s Services is currently undertaking an exciting transformation programme to create integrated Early Help and Safeguarding services for our children, young people and families. Our main aim for integrated working is to get it right first time for more children and young people. To do this, we plan to grow our early help offer so that we make a real impact on children and young people’s learning, achievement, health, wellbeing and resilience. We will closely align our services to improve accessibility for residents and to strengthen partnerships between statutory, specialist, early help and universal services.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is directly employed by the London Borough of Newham, whom was the first London borough to offer a fully integrated 0-19 health and social care service, after it assumed direct responsibility for providing School Nursing services, Health Visiting and Family Nurse Partnership in 2017. Therefore our Brighter Futures directorate will be delivering the 0-19 Healthy Child programme through the Children’s Health 0-19 Service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The 0-19 Children&#39;s Health service had their CQC inspection in 2019 and rated Good in all areas.&lt;strong&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Job&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;School Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;£36,711 - £39,774 pro-rata inclusive of high cost area supplement - LBN P03 equivalent to AfC B6 - Term time only.&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;This post may attract a market supplement to facilitate salary alignment with current equivalent AfC pay grade if applicable.&lt;/em&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We have a permanent and stable management team in the Children’s Health Service and are now recruiting experienced School Nurses to the remaining vacancies in our School Health Service.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a School nurse, you will be professionally responsible and accountable for the assessment of health needs, planning and evaluation of the school health service delivery, for both individuals and groups within a defined school age population. As a qualified specialist community public health nurse, you will have lead responsibilities for specific areas of school health caseload. The job involves supporting the Specialist Clinical Leads, working in partnership with schools, parents/carers and other agencies to achieve the best health outcomes for children and young people. The School nurse works within the School Health Team, to deliver the Healthy Child Programme.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role will include:&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Identifying, supporting, planning, delivering and evaluating health promotion activities in line with the school curriculum and locally agreed priorities.&lt;br /&gt; • Devising appropriate individualised health care plans for the school aged child through continuous development, implementation and evaluation of programmes of care.&lt;br /&gt; • Contribution to the assessment and review of special education and medical needs.&lt;br /&gt; • Working collaboratively in partnership with children, young people, parents/carers and other agencies, e.g. education, social services, other healthcare workers and the voluntary sector to meet the needs of children and young people.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;About You&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The School Health Team is looking for a motivated School nurse to deliver high quality evidence based skilled nursing care within schools in Newham. The nurse should have excellent communication skills, be an enthusiastic public health practitioner with experience of working within a skill mix team and other professionals in the health and social care sector. We are seeking a School nurse who is passionate about achieving outcomes for children and families and can provide excellent leadership within the team, clinical care in schools and other relevant community settings.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The candidate will:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Be a registered Nurse&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Have a Specialist Community Public Health Nurse Qualification - School Nurse&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hold a current NMC registration&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Have a BSC/ Post graduate degree or equivalent&lt;/li&gt;\n&lt;li&gt;Have a ENB 998/997 or recognised teaching qualification&lt;/li&gt;\n&lt;li&gt;Be able to assess effectively, manage risk and plan in an outcome focused way.&lt;/li&gt;\n&lt;li&gt;Be confident in delivering and willing to improve upon effective direct work interventions with families.&lt;/li&gt;\n&lt;li&gt;Remain focused on your own continuous professional development.&lt;/li&gt;\n&lt;li&gt;Strive to share learning and collaborate with practitioners and multi-agency partners to achieve outcomes for children and their families.&lt;strong&gt;&lt;em&gt;&lt;br /&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Be IT literate e.g. using clinical systems, word processing, email and internet use&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;Our offer &lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Genuine management support: &lt;/em&gt;&lt;/strong&gt;Low supervisor/supervisee ratios.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Money matters: &lt;/em&gt;&lt;/strong&gt;Flexible starting salary within the allocated grade for the right candidates. Subsidised leisure passes. Generous local government annual leave allowance. Pension scheme. Continued access to the NHS Pension Scheme (NHSPS) for health professionals who satisfy the NHS Pension scheme criteria. NHS continuous service recognised.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Learning &amp; Development:&lt;/em&gt;&lt;/strong&gt; Support to take up advanced clinical training and wider workforce development package to enhance your skills. Clear competency and career progression framework. Access to smart technology.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Contact&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information, please contact ChildrensHealth.Recruitment@newham.gov.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please also see attached the &#39;additional information&#39; document to review our recruitment statement and LBN terms and conditions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note we envisage shortlisted candidates will be contacted via email within 2-4 weeks of the advert closing date. Whilst affected by COVID-19, interviews may be facilitated by video.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous candidates need not apply&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "London Borough of Newham", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East London - Newham", "postalCode": "E16 2QU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5077", "longitude": ".047331"}}, "title": "School Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258045", "validThrough": "2020-11-15T23:59:59+0000"}