{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-02T17:15:51+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within Major Trauma…&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you passionate about the care you deliver? Are you looking to develop clinical skills and knowledge? Are you eager in helping shape the NHS and the new trauma network service? Then keep reading…&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nottingham University Hospital Trust is now one of the biggest and busiest acute Trusts in England. The clear vision for the Trust is to be the best teaching hospital in the country by 2016. As a leading Trust we have a strong relationship with the University of Nottingham and other Universities across the East Midlands.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Since Becoming a Major Trauma Centre in April 2012 East Midlands Major Trauma Centre has helped to prevent more than 154 lives being lost, which before the trauma network development would have been ended in mortality from such serious injuries.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nottingham Trauma and emergency care services already have a strong reputation nationally. You now have the exciting opportunity to build on this and lead the way on the Major Trauma Unit giving the best chances of survival and recovery, whist also supporting and helping to develop the new trauma network.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;18 BEDDED LEVEL 1 - MAJOR TRAUMA UNIT C30 AT QMC, NUH&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be joining a passionate, highly motivated, dynamic and caring team, who support each other every working day.&lt;/p&gt;\n&lt;p&gt;Are you an innovative problem solver and compassionate and like working in a fast and responsive environment? Do you want to develop clinically and interpersonally, grow and reach your true potential?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for people who are enthusiastic, flexible and wish to provide gold standard care delivery. We expect you to be able to have good working relationships with all members of the multi professional team with the ability to work autonomously and as part of a team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will possess excellent communication and interpersonal skills, to be able to communicate well with all members of the multi professional team, combined with the ability to perform well in stressful situations whilst remaining flexible.&lt;/p&gt;\n&lt;p&gt;We will be able to offer you an exciting induction to the speciality- including a specialised major trauma course- hearing clinicians enthuse about their speciality and share knowledge and experience. We also have a nurse educator who will work alongside you and support your clinical development. As part of this induction we would support you to complete the following working in new ways packages. IV, ECG, PCA, Epidural, venepuncture and cannulation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLucy SparhamJob titleWard SisterEmail addressLucy.Sparham@nuh.nhs.ukTelephone number0115 9249924 ext 69030&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "C30 Major Trauma Unit, Queens Medical Centre, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253011", "validThrough": "2020-11-12T23:59:59+0000"}