{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "(£) 31,365 - 37,890 Per Annum"}}, "datePosted": "2020-10-07T13:11:09+0100", "description": "&lt;p&gt;We are currently looking for an experienced social worker who is a suitably motivated and skilled practitioner seeking to work within the arena of adult social care across Paignton and Brixham.&lt;/p&gt;\n&lt;p&gt;This is a permanent post located within a multi disciplinary community team providing high quality social care services across the bay to a range of adults from 18 years and onwards. The ideal post holder will have a range of skills and knowledge that will meet the demands and complexities of the service users within our locality. This will provide the ideal opportunity for a practitioner who embraces challenge.&lt;/p&gt;\n&lt;p&gt;Additionally we are looking for a dynamic and inspirational practitioner who is able to safeguard vulnerable adults whilst working with choice, risk and person centered outcomes, capacity and service user self-determination. This is a busy sea side social care team who works with a varied case load that promotes opportunities for development learning and progression.&lt;/p&gt;\n&lt;p&gt;This post is open to qualified Social Workers with the right attributes to enhance this team.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference for our community by supporting people to live independently in their own home, then we want to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paignton and Brixham", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Social Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216629", "validThrough": "2020-11-09T23:59:59+0000"}