{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-05T14:46:33+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;The Royal Marsden is a world leader in cancer research, treatment and education. Together with our academic partner, The Institute of Cancer Research (ICR), we are the largest comprehensive cancer centre in Europe and the only National Institute of Health Research (NIHR) Biomedical Research Centre specialising in cancer in the UK.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Our mission is to continue to make a national and international contribution to cancer research and treatment, so that more people are cured and quality of life is improved for those with cancer. The Royal Marsden therefore plays an important role in championing change and improvement in cancer care through research and innovation, education and leading-edge treatment.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Applications are invited for the post of locum Consultant Medical Oncologist specialising in Acute Oncology and Lung Cancer, to work at the Chelsea site of The Royal Marsden NHS Foundation Trust and Kingston Hospital NHS Foundation Trust.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This post will combine a commitment to the AOS with a tumour site clinical practice within the Lung Unit. This multidisciplinary unit is comprised of clinical and medical oncologists as well as radiologists, pathologists and specialist nurses. The Lung Unit has a large and varied research portfolio which continues to grow, providing patients with access to the latest treatments.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;In order to fulfil the responsibilities of this post you must be eligible for full GMC registration. Applicants will have their CCT in Medical Oncology or equivalent and a broad-based experience, which of course focuses on systemic therapies.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The lung elements of the post would be based at Kingston and Chelsea with the AOS sessions provided in Chelsea.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Professor Mary O’Brien, Head of Lung Unit, mary.obrien@rmh.nhs.ukTelephone number020 8661 3278&lt;/p&gt;\n&lt;p&gt;Dr Nadia Yousaf, AOS Lead &amp; CBU Director&lt;/p&gt;\n&lt;p&gt;nadia.yousaf@rmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;via PA 020 8661 3278&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden NHS Foundation Trust, London", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Locum Consultant Medical Oncologist - Lung Cancer and AOS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258173", "validThrough": "2020-11-19T23:59:59+0000"}