{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa pro rata"}}, "datePosted": "2020-09-30T15:45:15+0100", "description": "&lt;p&gt;The Urgent and Emergency Care team encompasses five Urgent Treatment Centres, two Acute Medical Units including Same Day Emergency Care services and two Emergency Departments (ED). With over 129000 ED attendances every year, our Trust is one of the largest services in the North East.&lt;/p&gt;\n&lt;p&gt;Furthermore the recently Trust Board approved ‘State of the Art’ Emergency Department at Durham, significant changes to the Front of House Same Day Emergency Care areas and the agreed expansion of the medical workforce including the ED consultant base on both sites, makes us an attractive place to work for anyone who wishes to experience true team work between clinicians, managers and patients.&lt;/p&gt;\n&lt;p&gt;We believe this is an opportunity to join a dynamic &amp; established consultant team who lead from the frontline, supported by an experienced middle grade tier and skilled nursing team, providing outstanding 24 hour care.&lt;/p&gt;\n&lt;p&gt;We are now seeking applications from Consultants in Emergency Medicine to be based at either the University Hospital of North Durham (UHND) or Darlington Memorial Hospital (DMH). This is a fantastic opportunity for applicants who can demonstrate a track record of commitment to education.&lt;/p&gt;\n&lt;p&gt;We encourage our applicants to make contact with us to explore the role. We welcome discussion about your development and any opportunities we can create within the remit of the post. We also welcome and encourage applicants with a special interest and will support this wherever possible, in line with our aim to become ‘Employer of Choice’. There will also be consideration for Temporary Additional PAs (TAPAs)&lt;/p&gt;\n&lt;p&gt;To discuss our opportunities please contact:&lt;/p&gt;\n&lt;p&gt;Dr John Holmes, Clinical Director Emergency Care on 0191 3332558: email: &lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;johnholmes2@nhs.net&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Durham / Darlington", "postalCode": "DH1 5TW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.7889", "longitude": "-1.59294"}}, "title": "Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916207043", "validThrough": "2020-11-18T23:59:59+0000"}