{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-11-03T09:16:06+0000", "description": "&lt;p&gt;&lt;span&gt;Our vision is ‘Committed to caring for you’ – which means both patients and staff. We want every staff member to have that same commitment to care and we ask them all to show these by living our three values – kindness, courage and respect – every moment they are at work.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;It’s an exciting time here at Northern Lincolnshire and Goole NHS Foundation Trust. Our Medical wards across our 3 hospital sites span a wide range of specialities with more than 470 beds, and our nursing roles offer a range of opportunities whatever your interests.&lt;/p&gt;\n&lt;p&gt;Ward 23 is a 30 bedded acute medical ward which specialises in gastroenterology. You will be involved in the care and recovery of the patient with gastrointestinal problems, including upper/ lower GI bleeds, Crohn’s, colitis and other acute medical problems. We pride ourselves on offering a comprehensive training package, which includes: the allocation of a mentor to supervise your learning; development to support you in your new role; and access to our clinical skills tutors.&lt;/p&gt;\n&lt;p&gt;So you think you know gastroenterology? Need a change? On Ward 23 our services are growing, and our amazing team is there to support you and help you develop your skills and knowledge. If you are forward thinking and looking for a challenge then we want to hear from you!&lt;/p&gt;\n&lt;p&gt;We welcome experienced nurses looking for a new challenge or to extend their knowledge within the comfort of a dedicated, passionate team. We also offer flexible working patterns to suit personal circumstances where possible and access to our elearning systems to help further your career.&lt;/p&gt;\n&lt;p&gt;If you are dedicated, have excellent communication skills, and can demonstrate compassion and empathy we are looking for you to join our established team of Registered General Nurses.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ward Manager&lt;/p&gt;\n&lt;p&gt;03033 302858&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe", "postalCode": "DN15 7BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5875", "longitude": "-.666943"}}, "title": "Staff Nurse - Ward 23 - Scunthorpe", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253233", "validThrough": "2020-11-17T23:59:59+0000"}