{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-11-06T10:16:51+0000", "description": "&lt;p&gt;&lt;span&gt;Our Medical wards across our 3 hospital sites span a wide range of specialities – caring for patients in over 470 beds, medical nursing offers something for everyone .Whether your passion is cardiology, oncology, respiratory, or our acute assessment areas, we are confident you will thrive in our supportive and forward thinking teams. Naturally, acute medicine is a fast paced environment with a high turnover of patients in our wards- most admitted as acute emergencies, meaning that the nursing interventions you deliver will truly make the difference to our patients and their loved ones.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ward 24&lt;/span&gt;&lt;span&gt; is an acute general medical ward specialising primarily in cardiology and endocrinology. Our 30 bedded ward is a well led organised unit – therefore a great place to learn. Our established nurses are experienced mentors who are supportive, friendly and possess a wide range of transferable extended skills. We work cohesively and there is no “I” in OUR team – we work alongside each other and together. Therefore we encourage both newly qualified and experienced nurses in applying to join our team. Successful candidates will be well-supported and a bespoke training package will be tailored to suit individual learning needs. You will acquire a broad range of extended skills to compliment your passion for medical nursing including but not limited to venepuncture, cannulation, catheterisation, NG placement and management, complex wound care and much much more…..You will have access to wealth of knowledge to help you develop your nursing career –ranging from consultants, speciality Drs and specialist nurses. We want to invest in YOU. In return ward 24 asks that you are positive, enthusiastic and passionate in delivering the 6C’s of nursing. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Informal visits are welcomed and encouraged so that you can see for yourself that Ward 24 is a safe place to develop your nursing career in Medicine – please free to contact Jodie Harrison, Acting Ward Manager 03033 302665 – if you are considering joining us from further afield a bespoke relocation package can be facilitated. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sandra Shepherd, Acting Ward Manager on 03033 302665 or sandra.shepherd4@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe", "postalCode": "DN15 7BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5875", "longitude": "-.666943"}}, "title": "Staff Nurse - Ward 24 - Scunthorpe", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259185", "validThrough": "2020-11-22T23:59:59+0000"}