{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19020", "minValue": "17652", "unitText": "YEAR", "value": "£17,652- £19,020 pro rata per annum"}}, "datePosted": "2020-11-06T12:15:54+0000", "description": "&lt;p&gt;We require friendly and enthusiastic individuals to work as Housekeepers within the Trusts Hotel Services Team.&lt;/p&gt;\n&lt;p&gt;Housekeepers are responsible for providing and maintaining a high standard of cleanliness and the provision of food. As a housekeeper you will work as part of the housekeeping team to provide a clean, safe supportive environment in which patients can recuperate.&lt;/p&gt;\n&lt;p&gt;You will need to be passionate and enthusiastic about patient care putting patients at the heart of everything you do. You will be working in a multi-professional team and will need to be able to think on the spot and be empathetic. You will be passionate about our business, creating a culture of continuous improvement.&lt;/p&gt;\n&lt;p&gt;The post holders will be based at Roseberry Park Hospital, and will be required to work shifts between the hours of 7.00 am – 6.15 pm including weekends.&lt;/p&gt;\n&lt;p&gt;You should be highly motivated, reliable, flexible and willing to work at short notice. Experience in cleaning duties and use of chemicals and equipment are essential as you will be working in a demanding environment. Also any catering and food service experience would be appreciated along with a passion to providing high standards of customer service.&lt;/p&gt;\n&lt;p&gt;Candidates must possess NVQ Level 2 in Housekeeping or be willing to works towards in an agreed timescale and Level two Food Hygiene certificate as well as being able to demonstrate commitment to undertake further training and qualifications. You are also required to be IT literate.&lt;/p&gt;\n&lt;p&gt;The ability to work with relevant client groups throughout the Trust, i.e. learning disabilities and mental health is essential&lt;/p&gt;\n&lt;p&gt;Posts available: 30 hours permanent and 28 hours Relief fixed term for 6 months.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mandy Mogg - Hotel Service Supervisor 01642 838116.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Roseberry Park, Middlesbrough", "postalCode": "TS4 3AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.554", "longitude": "-1.21524"}}, "title": "Housekeeper", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259605", "validThrough": "2020-11-13T23:59:59+0000"}