{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-15T16:07:52+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 7 Clinical or Counselling Psychologist for ARMS service Shropshire, Telford and Wrekin &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our Early Intervention in Psychosis (EIP) services are going through an exciting new development phase. We have received investment for a stand-alone At Risk Mental State (ARMS) Pathway.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an opportunity for an innovative and dedicated Psychologist to shape and co-lead this new pathway.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The ARMS pathway will meet the needs of young people (14 years +) where concerns are raised they may be in the pro-dromal phase of a psychosis. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In this first year of investment the pathway will be co-led by a Band 6 OT and Band 7 Psychologist, both of whom will be overseen by the collective leadership of the established EIP team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post will appeal to an individual keen to be involved in service development, leadership and making a difference to young people in our area. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is important to us that the successful candidate is an experienced professional, possessing a good knowledge of working with young people and their families. Experience as a psychological therapist in assessment, formulation, intervention and evaluation and an interest in delivering and evaluating the impact of evidence-based interventions such as CBT with this client group would be an advantage. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Psychologist you will be a registered with HCPC and have an understanding of how multidisciplinary teams function well and be passionate about delivering quality services to young people and their families. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post is full time, offering excellent opportunities to develop special professional interests; share expertise and work closely with EIP colleagues. Training, good support and partnership working is offered. Close relationships also exist with multi-agency partners and specialist services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a county-wide based team and our operational working hours are Monday to Friday 9am to 5pm, with some flexibility when required to engage with our service users. We are commitment to Agile working in accordance with MPFT trust policy and guidance. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shropshire", "postalCode": "SY1 4RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7275", "longitude": "-2.71977"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228931", "validThrough": "2020-11-13T23:59:59+0000"}