{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Varied"}}, "datePosted": "2020-10-22T16:55:10+0100", "description": "&lt;p&gt;&lt;strong&gt;Do you want to start your day knowing you&#39;ll make a difference? Do you like variety? Do you enjoy working with and supporting a wide range of people?  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If so, then join our new team of Bank Floating Support Recovery Workers. We are looking to create an innovative team of talented individuals which will support the organization as a whole to maintain high quality delivery of services.&lt;/p&gt;\n&lt;p&gt;We’re a leading mental health charity that’s been putting mental health first for individuals and communities in Bristol and the South West for the last three decades. Working hand-in-hand with the NHS and local authorities, we offer practical help and emotional support tailored to each individual and their recovery.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Our experience of working with Bristol’s significant population of rough sleepers means we are well placed to offer skilled support to people with multiple and complex needs including homelessness, drug or alcohol addiction.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;We believe that with the right support, everyone can take control and make their future their own.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What can you expect from working for us?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role offers a unique opportunity to gain experience across a number of different mental health services within Second Step. Whether you are at the beginning of your career or looking for something new, this is a fantastic opportunity to build your experience, knowledge and skills within the health and social care sector. Your role will be to support people with issues including mental health, homelessness and drug and alcohol towards recovery and a brighter future.&lt;/p&gt;\n&lt;p&gt;No one day will be the same! – You will experience working within a diverse number of services ranging from primary and secondary care to supported accommodation and community support.&lt;/p&gt;\n&lt;p&gt;Not only that, you will receive comprehensive training, support and further career development to fulfil your role confidently and competently.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The role&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are recruiting a number of roles into the team on bank contracts, covering services, some of which operate 24/7.&lt;/li&gt;\n&lt;li&gt;Hours of Working – Full time (37 hours +)&lt;/li&gt;\n&lt;li&gt;Basic Hourly Rate: starting from £8.72. There are various levels of pay across Second Step services, depending on experience and role.&lt;/li&gt;\n&lt;li&gt;Location: Bristol, BANES and North Somerset.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Who are we looking for?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are looking for individuals who are motivated to work in this sector&lt;/li&gt;\n&lt;li&gt;Those who are willing to learn!&lt;/li&gt;\n&lt;li&gt;Can be flexible in their approach&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Due to the geographical coverage, it is a requirement (but not essential)   that you have access to a car at all times (Mileage is payable)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date:  Rolling&lt;/p&gt;\n&lt;p&gt;Interview date: Rolling&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information and to apply please see our website. Second Step is committed to Equal Opportunities and welcomes applicants from all sections of the community and from people who have personal experience of using mental health services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information please email &lt;/strong&gt;&lt;strong&gt;jobs@second-step.co.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Our Values -&lt;/span&gt;&lt;/strong&gt;We pride ourselves in being a values based employer and that means that we believe passionately in:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Hope and courage-&lt;/span&gt;&lt;/strong&gt;Recovery becomes a reality when we are confident, courageous and inspire hope in one another.  Change happens and we can achieve great things.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Succeeding together-&lt;/span&gt;&lt;/strong&gt;We’re at our best when we work together - staff, service users, carers and partners - making the most of each other’s talents and strengths.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Building trust-&lt;/span&gt;&lt;/strong&gt;When we act with integrity, when we strive to be honest with ourselves and those around us, we can build strong bonds of trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Celebrating diversity-&lt;/span&gt;&lt;/strong&gt;We value our differences, understanding that being kind and respectful to each other makes us strong.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Learning and growing-&lt;/span&gt;&lt;/strong&gt;By listening and thinking about how we can learn from our actions, we can help create real change for ourselves and inspire those around us.&lt;/p&gt;\n&lt;p&gt;Those are the qualities that you’ll need to join the team. If you think that you have got what it takes then apply today!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Second Step", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS2 8PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4606", "longitude": "-2.58769"}}, "title": "Floating Support Recovery Worker (Bank)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239435", "validThrough": "2020-11-19T23:59:59+0000"}