{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pa pro rata"}}, "datePosted": "2020-10-16T16:01:47+0100", "description": "&lt;p&gt;NIHR Applied Research Collaboration West (ARC West) is seeking to appoint an experienced research/programme manager to oversee all operational aspects of the ARC West,&lt;/p&gt;\n&lt;p&gt;NIHR ARC West is a partnership between the organisations and individuals that provide, plan and support health and social care in the West of England alongside the public that use these services and four local Universities. ARC West carries out collaborative applied health research with partners in the NHS, local authorities, third sector organisations and Universities, and aims to improve health and care. An implementation strategy enables translation of our research findings into practice and policy decisions, our Public and Community Involvement, Engagement and Participation (PCIEP) strategy ensures that PCIEP is embedded in ARC West projects, and a Training and capacity building (TCB) programme builds research capacity and capability both within the ARC and across our regional health and care systems.&lt;/p&gt;\n&lt;p&gt;The primary role is to oversee all operational aspects of the ARC West, supporting the Director and Deputy Director to deliver the ARC West contract. ARC West is a complex organisation comprising around 50 staff across multiple institutions and requiring close liaison with all Universities, NHS organisations and local authorities across the West of England in addition to other key stakeholders such as the West of England Academic Health Sciences Network (WEAHSN), Bristol Health Partners AHSC and the other 14 ARCs nationally.&lt;/p&gt;\n&lt;p&gt;The post holder will have substantial expertise in successfully delivering operational components of complex programmes or projects, and will have extensive experience of research management at a senior level.&lt;/p&gt;\n&lt;p&gt;The role is full time (currently home based, but usually based in Whitefriars) and is funded to 30th September 2024)&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameProfessor John MacleodJob titleNIHR ARC West DirectorEmail addressjohn.macleod@bristol.ac.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whitefriars, Bristol", "postalCode": "BS1 2NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4579", "longitude": "-2.59483"}}, "title": "NIHR ARC West Programme Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231014", "validThrough": "2020-11-06T23:59:59+0000"}