{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668"}}, "datePosted": "2020-10-10T12:15:14+0100", "description": "&lt;p&gt;Applications are invited for the post of Locum Consultant in anaesthesia with special interest in Neuroanaesthesia based at Addenbrooke’s Hospital, Cambridge.&lt;/p&gt;\n&lt;p&gt;The successful candidates will join an expanding, innovative and dynamic department of 80 substantive Consultants, 32 trainees and 15 Senior Clinical Fellows, providing anaesthetic services in this thriving modern teaching hospital. Addenbrooke’s is the local hospital for people living in the Cambridge area and is a regional/supra-regional referral centre for a number of specialties, including cancer surgery, neurosurgery, transplantation, plastic surgery, vascular and paediatrics. We are also the Major Trauma Centre for the East of England. As an internationally prominent teaching hospital, there is unparalleled capacity for teaching, including involvement in the high fidelity simulation centre, and research within the department as well as the wider biomedical campus.&lt;/p&gt;\n&lt;p&gt;The Neurosciences unit at Addenbrooke’s is the regional referral centre for adult and paediatric Neurosurgery and a quaternary referral centre for advanced neurosurgical and neuroradiological interventions with up to 6 neurosurgical areas per day. The department provides anaesthetic expertise for complex and innovative neurosurgical, major spinal and neuro-radiological procedures. The unit is due to expand to cover mechanical thrombectomy for stroke in the future.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a team of ten neuroanaesthetists and will be expected to undertake neuro and general anaesthesia lists along with on call in neuroanesthesia.&lt;/p&gt;\n&lt;p&gt;You will be fully registered with the GMC and ideally have a CCT in Anesthesia or be within six months of award of CCT at the time of interview. Applications are welcomed from those unable to work full time for personal reasons or those wishing to job-share.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to supporting the medical workforce in the part they play in delivering an excellent caring service to patients, all newly appointed Consultants attend our five-day Consultant Development programme within a year of joining the Trust. Leadership is a key requirement of doctors’ professional work and this innovative programme is designed to support Consultants to hone the leadership and management skills they need to succeed at CUH.&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Further information may be obtained from Dr Hemantha Alawattegama, Clinical Director or Dr Amit Prakash, Lead for Neuroanaesthesia via the Anaesthetic Dept. on 01223 216292 or email hemantha.alawattegama@addenbrookes.nhs.uk or amit.prakash@addenbrookes.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge University Hospitals NHS Foundation Trust, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Locum Consultant in anaesthesia  with special interest in Neuroanaest", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221381", "validThrough": "2020-11-08T23:59:59+0000"}