{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6"}}, "datePosted": "2020-10-15T13:36:30+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;GMMH – Senior Physiotherapist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Senior Physiotherapist – PYSP00 – Band 6&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Trust Wide - Greater Manchester Mental Health NHS Foundation Trust (GMMH)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates (hourly):  &lt;/strong&gt;Days: £16.97 Saturdays/Nights: £22.06 Sundays/Bank Hols: £27.15&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an experienced physiotherapist who would like to be part of mental health team, providing better lives for the service users, working for one of the UK’s most respected NHS Mental Health Foundation Trusts?&lt;/p&gt;\n&lt;p&gt;If you answered yes, then we would love to hear from you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Based trust wide within GMMH, you will be providing an efficient and effective Physiotherapy service to patients with organic and functional Mental Health needs across the inpatient wards, outreaching into patient’s homes and community venues as necessary.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To manage a defined case load using evidence –based and person-centred principles to assess, plan, implement and evaluate Physiotherapy interventions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To encourage and advise on Health Promotion and the appropriate exercise options available.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To participate in the supervision of junior staff and student Physiotherapists on clinical placement.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To support the Professional Lead/ Clinical Specialist Physiotherapist in the planning, delivery, development and evaluation of the Physiotherapy services within Salford.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for senior physiotherapist to pick up regular bank shifts trust wide:&lt;/p&gt;\n&lt;p&gt;Based at Woodlands older adult mental health hospital in Salford. The hospital has 50 beds, consisting of both organic and functional conditions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate would be working as part of a small Physio team consisting of qualified staff and assistants. The post holder would be working alongside the clinical lead, working between the hours of mon- Friday, 0800- 1600.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A broad spectrum of experience would be required, including time served clinically, preferably within the inpatient setting, older adults and wherever possible having worked with a mental health population.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Managing a complex caseload, including delegating to the wider therapy team would be essential part of this role. Assessing all new patients on admission, post falls reviews in addition to managing a prioritised caseload would make up a large part of the clinical caseload. Ward rounds and other relevant meeting may also be required where appropriate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Maintain clear, concise, and up to date written/electronic records in line with Trust Policies&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role will require an appropriately qualified Registered Mental Health Nurse who will deliver nursing care to inpatients in line with specified standards within the acute inpatient environment. They will assess, plan, implement and evaluate nursing care for inpatients with a variety of mental health issues. To undertake the role of named nurse for designated caseload.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Employing around 4,750 members of staff, who deliver services from more than 130 locations, GMMH people are passionate, patient focused, positive individuals, who are committed to working together to help people live well, striving to give their people a great work experience where they feel supported and valued.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With a reduction in stigma both self and societal, increased accessibility of treatment and the use of innovation techniques and tools, GMMH are delivering truly innovative mental health care and will continue to do so. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;br /&gt; &lt;br /&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will hold:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Diploma / Degree in Physiotherapy&lt;/li&gt;\n&lt;li&gt;Relevant clinical experience working as a Physiotherapist in mental health&lt;/li&gt;\n&lt;li&gt;Experience of working with older people&lt;/li&gt;\n&lt;li&gt;Experience of working with people with dementia&lt;/li&gt;\n&lt;li&gt;The ability to work autonomously and set own priorities in a demanding environment&lt;/li&gt;\n&lt;li&gt;Experience of delivering group and individual exercise&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03332 407 552&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with &lt;strong&gt;Ryan &lt;/strong&gt;on&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;0300 3033947&lt;/strong&gt; or GMMH@NHSProfessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please do not contact the service directly. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford", "postalCode": "M28 0FE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5278", "longitude": "-2.42282"}}, "title": "GMMH Senior Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228414", "validThrough": "2020-11-12T23:59:59+0000"}