{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata"}}, "datePosted": "2020-11-05T16:01:07+0000", "description": "&lt;p&gt;The Northern Care Alliance NHS Group was created by bringing together staff and services from two NHS Trusts, Salford Royal NHS Foundation Trust and The Pennine Acute Hospitals NHS Trust. The sheer size, scale and potential of our combined service is huge. Together, we’ve a wealth of skills and resources to share and tap into and, a wide range of career paths for you to develop and explore. If you want to join a team of over 19,000 NHS experts in delivering high-quality, local care across Salford, Oldham, Bury and Rochdale and beyond – &lt;strong&gt;come and take your place with us.  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 22.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an experienced therapist to join the Children’s Acute and Ongoing Needs Service (CAONS) to lead a team of Occupational Therapists and Physiotherapists. This is a newly developed post.&lt;/p&gt;\n&lt;p&gt;We are looking for a self-motivated, friendly and enthusiastic therapist who should have extensive experience of working within paediatrics in a clinical capacity and have a thorough working knowledge of safeguarding procedures and policy, and the wider SEND agenda.&lt;/p&gt;\n&lt;p&gt;CAONS sits within the wider Heywood, Middleton and Rochdale Children’s Integrated Health Services Directorate,&lt;/p&gt;\n&lt;p&gt;Within this CAONS there are two pathways; The Acute and On-going Pathway and the SEND Pathway. This post will provide team leadership across both pathways.&lt;/p&gt;\n&lt;p&gt;The therapy teams are based at Callaghan House in Heywood, working across HMR in a in a variety of settings to deliver therapy services to children and young people from 0 – 19 years with a wide range of difficulties and disabilities.&lt;/p&gt;\n&lt;p&gt;The Children’s Occupational Therapy Team enables children with a wide range of difficulties and disabilities to maximise their development, and become independent participants in the community. The physiotherapy team provide a musculoskeletal service in clinics, as well as visiting children with developmental delay or disabilities in their homes, nurseries and schools.&lt;/p&gt;\n&lt;p&gt;You will provide clear professional leadership, governance &amp; operational leadership to the Children’s Occupational Therapy and Physiotherapy teams&lt;/p&gt;\n&lt;p&gt;Main Duties &amp; Responsibilities:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide leadership to staff within the teams.&lt;/li&gt;\n&lt;li&gt;Ensure smooth day to day running of teams.&lt;/li&gt;\n&lt;li&gt;managing performance&lt;/li&gt;\n&lt;li&gt;Support and guide staff with caseload management&lt;/li&gt;\n&lt;li&gt;Mentoring and developing workforce skills and competencies&lt;/li&gt;\n&lt;li&gt;Lead transformation projects relating to service delivery of team.&lt;/li&gt;\n&lt;li&gt;Responsible for submission of monitoring reports to ensure quality service delivery&lt;/li&gt;\n&lt;li&gt;Audit&lt;/li&gt;\n&lt;li&gt;Participate and contribute to the ongoing strategic development in response to local and national directives.&lt;/li&gt;\n&lt;li&gt;Work with the service managers and other key stake holders in implementing systems and processes to provide high quality standardised service delivery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This will also include, working alongside Team Leads across the wider Children’s Integrated Health Services Directorate to support the development of the service as a whole.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Garry Hodgkinson&lt;br /&gt;Service Manager, Children&#39;s Acute and Ongoing Needs Service (SEND)&lt;br /&gt;garry.hodgkinson@nhs.net&lt;br /&gt;01706 676777&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All communications to applicants will be via the email address provided on your application form and all further correspondence will be through email, therefore please ensure that you regularly check your emails after the closing date for this post.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Callaghan House, Heywood", "postalCode": "OL10 2DY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5893", "longitude": "-2.20436"}}, "title": "Team Lead - Children&#39;s Occupational Therapy/Physiotherapy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258461", "validThrough": "2020-11-19T23:59:59+0000"}