{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 Dependant on experience"}}, "datePosted": "2020-10-09T09:15:50+0100", "description": "&lt;p&gt;Advert&lt;/p&gt;\n&lt;p&gt;The Cardiology Department offers both invasive and non-invasive diagnostic procedures which include Echocardiography, DSE, TOE, pacemaker follow-up and implantation, including complex devices.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an experienced enthusiastic and motivated Physiologist with significant experience and we are seeking to recruit a competent and motivated Specialised Cardiac Physiologist in Echocardiography within our busy and friendly Cardiac Diagnostics Department. This is an opportunity for a physiologist with relevant experience who is looking for greater responsibility within the field of echocardiography&lt;/p&gt;\n&lt;p&gt;You will have ASCST, BSc in Clinical Physiology or equivalent qualifications, BSE and RCCP Registration will be an advantage. We will consider individuals who may be working towards RCCP registration and BSE accreditation with significant experience.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be competent to issue independent echo reports and provide teaching for medical and physiologist staff in echocardiography. As a member of the echocardiography team you will also play an important role in developing our services whilst maintaining and developing your own skills.&lt;/p&gt;\n&lt;p&gt;The Department has 7 modern state of the art Echo machines, including iE33 machines and E95 with 3D capability, and perform 14,000 transthoracic studies per year as well as TOE, DSE, Contrast studies as well as currently developing their 3D and speckle tracking modalities.There is ample opportunity to participate in Dobutamine Stress Echo lists and assist with Transoesophageal Echo studies. This is a busy but rewarding position and this is an exciting time for the department as we are currently going through the process of working to attain BSE departmental accreditation.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Opportunity to work within the Catheter Lab will be available to those with an interest although the post is primarily for the provision of the Echo service. There is no on-call Echo service required.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a Trust we are committed to Continuous Professional Development and you will be encouraged to attend relevant professional Courses and Conferences.&lt;/p&gt;\n&lt;p&gt;The echo department holds monthly clinical meetings and staff meetings and supports CPD for all staff with attendance at local and national meetings. The Trust actively encourages professional development and training and you will be encouraged to develop expertise in other areas as required by the changing NHS.&lt;/p&gt;\n&lt;p&gt;We are a forward thinking, progressive department and you will be supported to further develop your expertise . As a key member of the team you will act as a role model and display the confidence and competence to support the fellow specialist Physiologists and Head of cardiac physiology department and delivering an exemplar service.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameManjula SreedharanJob titleCardiac physiology Manager / professional lead in echoEmail addressmanjula.sreedharan@elht.nhs.ukTelephone number01254 733232&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "EAST LANCASHIRE HOSPITAL TRUST, BLACKBURN", "postalCode": "BB23HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Specialist Cardiac Physiologist - Echo", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219531", "validThrough": "2020-11-06T23:59:59+0000"}