{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29030", "minValue": "29030", "unitText": "YEAR", "value": "£17.27 per hour"}}, "datePosted": "2020-10-30T10:31:54+0000", "description": "&lt;p&gt;Are you a Registered Staff Nurse looking for a new opportunity to work in an organisation that will help you to develop and achieve your goals to become the best you can be?&lt;/p&gt;\n&lt;p&gt;As an experienced Nursefrom the NHS or private care, you&#39;ll join the team as a Bank Staff Nurse where you&#39;llreceiveyour perfect work/lifebalance, 12.07% hourly pay upliftand book your shifts through the Temployer App.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a qualified&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;RMN//RNLD/RGN&lt;/span&gt;&lt;/strong&gt;nurse – either with experience or a preceptee - you will ensure young people with mental health conditions receive high-quality care, while also supporting your colleagues and promote good teamwork.&lt;/p&gt;\n&lt;p&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine.&lt;/p&gt;\n&lt;p&gt;You will have access to the Elysium Wellbeing team, which is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/p&gt;\n&lt;p&gt;There are also career development opportunities, with a huge range of courses that will help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt;Things that you will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A relevant nursing qualification and registration&lt;/li&gt;\n&lt;li&gt;Strong team-working skills&lt;/li&gt;\n&lt;li&gt;A high level of self-motivation and a flexible approach&lt;/li&gt;\n&lt;li&gt;A positive attitude and be naturally caring and compassionate&lt;/li&gt;\n&lt;li&gt;A commitment to high-quality care and to values and evidence-based practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We can offer you flexible working - you will work 12.5 hour days, on a 0 hour contract.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;:Chadwick Drive (off Saxon Street), Eaglestone, Milton Keynes,Buckinghamshire,MK6 5LS&lt;/p&gt;\n&lt;p&gt;You will be working at Chadwick Lodge and Eaglestone View, a medium and low secure and locked services providing specialist treatment programmes for service users who may have been detained under the Mental Health Act (1983) and have a history of offending behaviour.&lt;/p&gt;\n&lt;p&gt;The service offer a broad spectrum of evidence-based therapeutic interventions, involvingservice usersat every stage. The hospital’s consultant-led multidisciplinary team has a wealth of clinical and research experience in forensic psychiatry. All programmes are designed to reduce the risk of re-offending and to maximise the potential and enhance the quality of life of eachservice user.&lt;/p&gt;\n&lt;p&gt;Chadwick Lodge secure services care forservice userswith complex and enduring mental illness who need to achieve stability in order to benefit from multidisciplinary interventions, helping them move on to community settings whenever possible.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hourly rate of up to£17.27 (including the 12.07% holiday allowance uplift)&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Mandatory training&lt;/li&gt;\n&lt;li&gt;Wellbeing support and Activities&lt;/li&gt;\n&lt;li&gt;Flexible working&lt;/li&gt;\n&lt;li&gt;Paid induction&lt;/li&gt;\n&lt;li&gt;Transfer to perm in the future (optional)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Milton Keynes", "postalCode": "MK6 5LS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0279", "longitude": "-.740571"}}, "title": "Bank Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249753", "validThrough": "2020-12-31T23:59:59+0000"}