{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 pa"}}, "datePosted": "2020-10-26T08:30:12+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Band 8b - General Manager&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen to join Division 7 Management team as a General Manager.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Division 7 was established in August 2020 in response to the increasing focus on system working across Birmingham and Solihull between our health and social care partners. The Division brings together Solihull Community Services, our Discharge Hubs across all our acute hospital sites and UHBs intermediate care beds into a single management structure. Division 7 also works closely with Division 3 on the strategy and delivery of OPAL, the multidisciplinary interface service based at our hospital front-doors. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In addition the Division is leading the Trust’s work in primary care both in terms of the management of its first General Practice and the establishing collaborations with interested GP organisations and the redesign of clinical pathways as well as opportunities for closer integration. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Division plays a leading role in a number of significant system change programmes:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;‘The Early Intervention Programme’ is the Birmingham Integrated Care Partnership scheme which has driven integration of health and social care across the city over the past 3 years, resulting in new models of care delivery and improved outcomes for citizens and organisations. UHB have been a partner in this work, with OPAL, discharge hubs and the Norman Power Centre (intermediate care beds) as key projects. This work is now continuing into a second phase and a similar project is now being established in Solihull via the ‘Solihull Ageing Well Programme’.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In Solihull as part of Ageing Well the Division’s community services are working with Primary Care Networks and Local Authority social work and enablement teams to deliver new neighbourhood models and improve the support to care homes to enable Solihull residents live healthier lives in their own homes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A key enabler of this transformation will be to harness the opportunities of existing and emerging digital technology with our partners. The use of video and digital diagnostic devices for example will enable paramedics in patients homes to link remotely to geriatrician led MDTs for a comprehensive assessment and treatment plan. This could include the use of digital stethoscopes in a patients home with the consultant listening to the patients heat and lungs remotely. The General Manager will take a lead role in this area. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are therefore looking for an exceptional manager with proven NHS operations experience looking to join a rapidly developing new division and be prepared to take a lead role in the transformation of our services. They will work closely with the Chief Officer for Out of Hospital Services, Head of Out of Hospital Services, Medical Director and Deputy Director of Nursing.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful applicant will provide effective strategic leadership using wide ranging, highly specialist, professional, managerial knowledge, skills and experience. You will have delegated responsibilities for specific areas of performance within Division 7 including areas of quality, workforce, access and efficiency.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be conducted in line with social distancing guidance at the time, this may include video conferencing.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If this role interests you, please contact Andrew Mckirgan Chief Officer for Out of Hospital Services on 0121 371 4328, or Sarah Carmalt Head of Out of hospital Services on 0121 371 3437&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 8b - General Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241758", "validThrough": "2020-11-08T23:59:59+0000"}