{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27904", "minValue": "27904", "unitText": "YEAR", "value": "£16.60 per hour"}}, "datePosted": "2020-10-23T12:31:22+0100", "description": "&lt;p&gt;If you are an outstanding Paramedic who is passionate about providing high quality care for a vulnerable patient group then we want to hear from you as we have an opportunities to become a part of our bank provision to expand integrated healthcare services to the prisoners that we cater for. The post we have available is:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Paramedic&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5 or 6 rates of pay available depending upon experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We suspect you entered the healthcare profession as you wanted to have the opportunity to make a real difference to the lives and lifestyles and drive forward key Public Health initiatives. The Offender Health Directorate gives you this opportunity to make this difference to a group of people who traditionally have had complex histories and not always had access to care.&lt;/p&gt;\n&lt;p&gt;Working as part of the Bank provision of qualified registrants, you will be part of a high quality and motivated team who provide integrated healthcare (physical healthcare, mental health and substance misuse services). Our services include elements of traditional primary care combined with elements of secondary Care Delivery. This is an ideal opportunity to try something new or add new prisons to your experience if you are already experienced in Health and Justice Settings.&lt;/p&gt;\n&lt;p&gt;The Directorate provides healthcare to seven Prisons and an Immigration Removal Centre in the counties of Lincolnshire, Leicestershire and Nottinghamshire. As such you are part of a large peer group of 400+ healthcare professionals with access to appropriate peer support, supervision and excellent opportunities for learning and development.&lt;/p&gt;\n&lt;p&gt;Nottinghamshire Healthcare NHS Foundation Trust enjoys a good reputation as an employer offering applicants the opportunity of an interesting role in a developing and stimulating environment but also with access to a range of established terms and conditions of service and access to continuing professional development including access to NHS pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our DBS check is free, you have no fees to pay!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Charlotte Goode-Bond - Area Manager Email: charlotte.goode-bond@nottshc.nhs.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Duncan Macmillan House, Porchester Road, Mapperley, Nottingham, NG3 6AA, Nottingham", "postalCode": "NG3 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9796", "longitude": "-1.12644"}}, "title": "Bank Senior Paramedic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240549", "validThrough": "2020-11-06T23:59:59+0000"}