{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 pa"}}, "datePosted": "2020-10-30T17:47:05+0000", "description": "&lt;p&gt;We are really pleased to offer a vacancy within the Forward Thinking Birmingham-wide Early Intervention in Psychosis (EIP) Service for a Band 6 Senior Occupational Therapist. The EIP service provides secondary care multi-disciplinary mental health service for people aged 14 - 35 years who are experiencing their first episode of psychosis. This is an exciting time for us as we have recently received investment to focus on some key clinical interventions and also create new approaches to improve social inclusion opportunities for the young people we support. Key to this is an aim to widen our multidisciplinary team and are actively recruiting to specialist physical health workers, Peer Support roles and Occupational Therapy.&lt;/p&gt;\n&lt;p&gt;The post holder will be work across two of our clinical EIP teams and will be an integral and valued team member and have the support of the wider MDT which  includes Clinical Psychologist&#39;s, Mental Health Nurses, Social Inclusion Workers, Psychiatrists, Social Workers, and Peer Support Workers. You will also receive regular clinical and group supervision from the wider OT provision within FTB and Birmingham Womens and Childrens NHS Trust.&lt;/p&gt;\n&lt;p&gt;The EIP service provides evidence NICE based interventions and it participates in the annual National Audit of Clinical Psychosis (NCAP). The post holder will have ample opportunity to work with individual cases, group work and develop their own areas of interest within their professional field that supports our service aims and the goals of young people.&lt;/p&gt;\n&lt;p&gt;We are looking for candidates with a real passion for improving the outcomes for young people experiencing psychosis. EIP has a well-established model and excellent team working is essential for this role. We are looking for individuals who can be compassionate, brave, and ambitious who are interested in learning to apply their knowledge to their work and are open to developing their skills and understanding within the remit of the service provided.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please find attached our Job Description and Person Specification for more details.  &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Tim Newbold               Job Title: Senior Nurse/Operational Manager and Joint Service Lead&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B4 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4852", "longitude": "-1.89446"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251074", "validThrough": "2020-11-13T23:59:59+0000"}