{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 p.a inc. HCA"}}, "datePosted": "2020-10-30T16:00:56+0000", "description": "&lt;p&gt;Join us and become part of the most engaged workforce of any NHS trust in England, according to the latest national NHS Staff Survey results – for the second year running.&lt;/p&gt;\n&lt;p&gt;You will be joining a dynamic and forward-looking organisation in the heart of the capital where you can develop your career and broaden your horizons.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work in a motivated team environment. As a Workforce Systems Analyst you will be responsible for&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;With the support of the Workforce Systems Manager, the post holder will assist in the co-ordination of all systems and workstructures related tasks, queries and issues received by the Workforce Systems &amp; Information Team.&lt;/li&gt;\n&lt;li&gt;Act as first line support for all matters relating to workstructures &amp; establishment control (both technical and administrative) and provide support, guidance and advice to budget holders, Finance Managers and others across the Trust.&lt;/li&gt;\n&lt;li&gt;Liaise with users of ESR and other systems to understand issues and address these in the most efficient manner. The post holder will take responsibility for assessing problems and resolving these to agreed timeframes.&lt;/li&gt;\n&lt;li&gt;Supporting the Workforce Systems Manager in initiating and progressing system development projects which help ensure ESR and associated systems meet business and user needs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will be analytical, numerate and competent and familiar with relational databases and data structures. You will also be responsible for providing system training when required and continuously develop your knowledge and understanding of HR issues/practices and policies with regards to the impact to the system. You will possess good decision-making and problem-solving skills to work as a subject matter expert, having the judgement to escalate complex problems when necessary and the ability to work under pressure at times often to tight deadlines. You will need to possess good interpersonal and communication skills with experience of working in a quality focused customer-facing environment.&lt;/p&gt;\n&lt;p&gt;You will work closely with Financial Management to ensure reconciliation between ESR and the General Ledger and a robust vacancy control process.&lt;/p&gt;\n&lt;p&gt;You will be proficient in MS Excel, VBA and Oracle BI reporting and possess excellent analytical skills. Knowledge of ESR reports, Qlikview and other reporting and analysis tools would be an advantage. Experience in supporting key business process, business planning and workforce costing would be an advantage.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lee Isidore - Head of Workforce Intelligence &amp; Systems&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Workforce Intelligence &amp; Systems Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250859", "validThrough": "2020-11-06T23:59:59+0000"}