{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum pro rata"}}, "datePosted": "2020-11-02T13:01:33+0000", "description": "&lt;p&gt;We are Manchester Local Care Organisation (MLCO) - an exciting, public sector organisation that has brought together NHS community health services and social care services in the city. The MLCO is committed to the provision of accessible personalised services tailored to the needs and preferences of the people of Manchester delivering safe and effective services to ensure choice and best value. Our teams work as one Multi-Disciplinary approach in the neighbourhoods they serve – delivering and designing services in partnership with local people and importantly work cross organisational boundaries.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is an exciting time to join the organisation as the Crumpsall Vale community 24 bedded Intermediate Care Unit has been extended and will become a 40 bedded unit. The focus of the additional 16 beds will be flexible in nature with an emphasis on frailty, accessible for both step down and step up patients, and will be responsive to local and national changes in policy, for example offer capacity to address post CoVid-9 rehabilitation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Crumpsall Vale is set in the grounds of North Manchester General Hospital which is becoming ‘The North Manchester Wellbeing Hub’ a brand new facility to host a wide variety of health and wellbeing services. It will have a friendly and welcoming ambience, and have a positive influence on the culture of the redeveloped and reinvigorated hospital site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All of these exciting changes for the health and care campus play an important role in optimising interaction with the acute and intermediate care and supporting the development of care closer to home.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge or different opportunity then please apply as the candidate will be exposed to all of these exciting new projects and the successful applicant would be expected to contribute to this process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The service is provided across 7 days ensuring that patients have access to and receive a gold standard of nursing and therapy input. he team’s integrated service delivery model, , aims to respond more quickly, avoid admissions, reduce length of stay and improve residents’ experiences through better access to the right intervention, at the right time, delivered by the right health or social care practitioner.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Crumpsall Vale Intermediate Care Unit is a large family of joint working with Nurses, GP’s, Health Care Assistant, Physiotherapists, Occupational Therapists, Assistant Practitioners, Advanced Practitioners, Pharmacists, Housekeepers, Domestic staff , Administration staff, Macmillan Team &amp; Community Stroke Team ensuring that patients receive a holistic Multi-Disciplinary approach from time of admission to day of discharge.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We currently have a full-time post available for a Staff Nurse that is dynamic, compassionate, caring, forward thinking, and a team player that wants to progress within the environment of the Community Intermediate Care Unit with an interest to develop in community rehabilitation. Applicants must be registered with the NMC, with a full UK driving licence and access to their own vehicle.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The team is focused to continuous improvement and there is an opportunity for the candidate to continue learning and brings back all the valuable knowledge to the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Louise Lewis Unit manager&lt;/p&gt;\n&lt;p&gt;01616258164&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise LewisJob titleSisterEmail addresslouise.lewis@pat.nhs.ukTelephone number01616258164&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crumpsall Vale, NMGH, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Community Staff Nurse - Intermediate Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252146", "validThrough": "2020-11-16T23:59:59+0000"}