{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-10-26T14:46:46+0000", "description": "&lt;p&gt;&lt;strong&gt;Laboratory Support Workers (Band 2)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Departments of Laboratory Haematology and Clinical Biochemistry are spread across 4 sites at 3 hospitals in Oxford and Banbury, and the successful candidates would work as part of a team at the Oxford sites of the Trust.&lt;/p&gt;\n&lt;p&gt;The Departments are both UKAS and HCPC accredited.&lt;/p&gt;\n&lt;p&gt;The Oxford University Hospital has a more diverse range of testing being carried out than many other Hospitals with a variety of specialist workload being referred in, and training in appropriate specialist sections may be given, over time, as required, but this will not be the priority in this role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We require laboratory support staff to work with qualified scientists to perform basic sample preparation and data entry. The priority is staff to work in our busiest periods from 11:30am to 8pm. There may also be a need for late (4pm till midnight) or night shift staff on a rotational basis and with standard NHS unsocial Premium rate. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A flexible approach to working hours is required as the Department provides a 24/7/365 service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The posts will spend the majority of the time based at JRH in Oxford, but will be required to spend some time on the Churchill site.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate(s) will work as part of a busy multidisciplinary team and have a positive professional approach to patient care.&lt;/p&gt;\n&lt;p&gt;No unsolicited recruitment agency telephone calls or emails. Please note that this post is subject to a 6 month probationary period. If you currently hold a contract of employment with the Oxford University Hospitals, this will not apply.&lt;/p&gt;\n&lt;p&gt;Please make sure that you read the job description and person specification attached below, and that your statement in support reflects this as your application will be judged against these criteria.&lt;/p&gt;\n&lt;p&gt;When providing employment reference details please provide correct work related email addresses so references can be sought promptly when we are looking to progress your application. Your first referee will need to be your line manager, supervisor or clinical lead from your current or most recent post or place of study. This information is essential if your offer of employment is to be confirmed.&lt;/p&gt;\n&lt;p&gt;Candidates selected for interview will be contacted after the short listing process, usually within 2 weeks. (Please note that shortlisting times vary when applying for a Medical position within the Trust) The majority of correspondence will be via the e-recruitment system; therefore you should check your emails regularly including junk mail folders in web-based email products.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 9th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email addressJoyce.Dyer@ouh.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dan.Smith@ouh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Laboratory Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242962", "validThrough": "2020-11-09T23:59:59+0000"}