{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157"}}, "datePosted": "2020-10-20T11:50:23+0100", "description": "&lt;p&gt;&lt;strong&gt;Macmillan Cancer Care Coordinator&lt;/strong&gt; – &lt;strong&gt;Acute Oncology &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term until End 2022. Band 4, up to 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to appoint a Macmillan Cancer Care Coordinator who will work as part of a multi-disciplinary team (MDT) and support the acute oncology clinical nurse specialists to provide high quality care for our cancer patients.&lt;/p&gt;\n&lt;p&gt;This is a unique role and will involve regular contact to support cancer patients and their carers throughout their cancer treatments. You will be expected to demonstrate effective communication skills and be able to support cancer patients in a caring and compassionate nature.&lt;/p&gt;\n&lt;p&gt;You will be expected to co-ordinate, support and signpost patients to ensure that effective progress is made throughout their cancer pathway whilst liaising with colleagues and departments both within Primary and Secondary care, community and third sector services as appropriate to ensure timely onward referrals.&lt;/p&gt;\n&lt;p&gt;This post will be suitable for healthcare assistants who wish to gain further development within cancer care delivery and working closely with cancer patients to provide personalised care.&lt;/p&gt;\n&lt;p&gt;We are therefore looking for a highly motivated individual with excellent communication skills, who can demonstrate effective time management and organisation skills to be part of the wider cancer team to help us to provide high quality patient care that will make a positive impact on the cancer patient experience.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure that you document evidence of meeting all the essential criteria in the supporting information.&lt;/li&gt;\n&lt;li&gt;If sufficient response is received this post could be closed earlier than the specified closing date, please apply as soon as possible to ensure that your application is considered.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Trust is committed to safeguarding adults and children therefore if the post is subject to the Rehabilitation of Offenders Act (ROA) 1974 (Exceptions) Order 1975 (as amended) the successful candidate(s) will be subject to a criminal records check with the Disclosure and Barring Service (DBS). The cost of the DBS must be met by the successful candidate(s) through salary deduction. DBS charges are as follows &lt;strong&gt;if applicable to the post:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Standard Check: £26 + Administration cost of £4.20 = deducted at £10.20 from 1st month salary and £10 deducted from salary over following 2 months.&lt;/p&gt;\n&lt;p&gt;Enhanced Check: £44 + administration cost of £4.20 = £15.20 deducted from 1st month salary and £11 deducted from salary over following 3 months.&lt;/p&gt;\n&lt;p&gt;As part of the one of the largest employers in the UK NCIC future employees will have also access to the following benefits.&lt;/p&gt;\n&lt;p&gt;A lease car may be available for this position; further details will be provided upon appointment if applicable.&lt;/p&gt;\n&lt;p&gt;27 day holiday scheme rising to 33 after 10 years&lt;/p&gt;\n&lt;p&gt;Flexible working Scheme&lt;/p&gt;\n&lt;p&gt;Excellent opportunities for development&lt;/p&gt;\n&lt;p&gt;Competitive NHS Pension scheme&lt;/p&gt;\n&lt;p&gt;Access to NHS discounts with retailers and leisure companies&lt;/p&gt;\n&lt;p&gt;EAP (Employee Assistance Programme) a free, confidential counselling and information service to assist with personal or work-related problems&lt;/p&gt;\n&lt;p&gt;These schemes are subject to availability&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cumberland Infirmary, Carlisle", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Macmillan Cancer Care Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234255", "validThrough": "2020-11-18T23:59:59+0000"}