{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T12:46:02+0000", "description": "&lt;p&gt;&lt;span&gt;We are currently looking for a motivated full time Band 6 Occupational therapist to join the local primary mental health service within Cardiff and the Vale. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;It’s an exciting time to join us. This post is the first Occupational therapy position within this service, allowing service users access to Occupational therapy services at an early opportunity.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work within an established team and provide specialist occupational therapy assessment and interventions to support service users within various conditions under part 1 of the mental health measure. You will be professionally supported by the wider Occupational therapy team and contribute to the development of this Service.&lt;/p&gt;\n&lt;p&gt;This service focuses on promoting recovery for those people diagnosed with mild to moderate mental ill health. We provide comprehensive assessment services and work closely with local specialist mental health teams, tertiary service providers, non-statutory agencies, service users and carers.&lt;/p&gt;\n&lt;p&gt;The post holder will be using their core occupational therapy skills to deliver occupational therapy interventions and will likely manage a caseload.&lt;/p&gt;\n&lt;p&gt;Key aspects will include promoting independence, transforming transitions and influencing health and wellbeing in order to help individuals rebuild and manage their lives. Interventions delivered would include a range of occupational therapy groups and individual occupational therapy assessment and treatment. In addition we are keen to explore and develop vocational needs for this service group and we see this as a key service in the vocational pathway within Cardiff and the Vale.&lt;/p&gt;\n&lt;p&gt;We are looking for an occupational therapist with experience in mental health services with demonstrable skills and interest in working with service users. You will need excellent leadership, communication and organisational skills together with an interest, and sound clinical knowledge, of mental health and vocational needs.&lt;/p&gt;\n&lt;p&gt;We are looking for a occupational therapist who is forward thinking and enthusiastic regarding innovative ways of working.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Closing Date: 16/11/2020&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Jessica Powell&lt;/p&gt;\n&lt;p&gt;Job title: Clinical lead Occupational Therapist&lt;/p&gt;\n&lt;p&gt;Email address: Jessica.powell2@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 029 21824832&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hamadryad Centre, , Butetown, Cardiff", "postalCode": "CF10 5UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4624", "longitude": "-3.17438"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252112", "validThrough": "2020-11-16T23:59:59+0000"}