{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 Per annum inclusive"}}, "datePosted": "2020-10-26T11:40:39+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Band 7 Deputy Antenatal &amp; Newborn Screening Coordinator&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Barking Havering and Redbridge University NHS Trusts (BHRUT) is one of the most forward thinking Maternity units in London, serving a diverse population across a large geographical area. Midwives working in the unit gain significant skills in caring for high risk women as well as being autonomous practitioners for midwifery led care. BHRUT are proud to have recently been awarded RCM runner up for Midwifery service of the year and mentor of the year.&lt;/p&gt;\n&lt;p&gt;We have a unique partnership with the Virginia Mason Institute (VMI) and are working with our staff to embed their principles and guidance in ‘The PRIDE Way’ of improvement and culture at BHRUT. The Virginia Mason programme helps us all to review what we do, how we do it, when we do it, why we do it, and let’s not forget who we do it to.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for you to join our award winning Maternity Public Health Team.&lt;/p&gt;\n&lt;p&gt;Your role will involve working alongside the Antenatal &amp; Newborn Screening Coordinator (ANSCO) and other members of the multidisciplinary team to ensure the provision and continuing effectiveness of a user centred antenatal and newborn screening programme for all women accessing maternity care from Barking, Havering &amp; Redbridge University Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;You will ensure provision of robust antenatal and newborn screening programmes by assisting and leading regular audits, data collection and publication for key performance indicators (KPI) and the trust annual report for antenatal screening.&lt;/p&gt;\n&lt;p&gt;You will also support the team in all training activities and events. You will support our clinical governance team to assess risk, investigate incidents and complaints relating to any part of the antenatal or newborn screening pathways.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication, organisation and management skills. You will be dynamic and innovative with the knowledge, drive, enthusiasm and motivation to lead the provision of a high quality antenatal and newborn screening service, providing clinical expertise, support and counselling to women as they make choices regarding screening and at all stages through the screening process and ensuring effective management and follow up of all women and/or babies with screen positive results.&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust is subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;/p&gt;\n&lt;p&gt;Applications should be made online, however queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to HR Recruitment Department, on 01708435000 Ext. 2289. Further details regarding the post may be obtained by contacting the manager as per contact details as below.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Further details regarding the posts may be obtained by contacting Patience Chandiwana on 01708 435000 ext 2375 or via email patience.chandiwana@nhs.net&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Patience Chandiwana, telephone 2375, email patience.chandiwana@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Public Health - Maternity, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 7 Deputy Antenatal &amp; Newborn Screening Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242240", "validThrough": "2020-11-08T23:59:59+0000"}