{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103490", "minValue": "76761", "unitText": "YEAR", "value": "£76,761 - £103,490 Per annum"}}, "datePosted": "2020-10-14T08:16:14+0100", "description": "&lt;p&gt;Consultant in Anaesthetics&lt;br /&gt;Applications are invited for the post for a Consultant in Anaesthetics&lt;br /&gt;Basildon and Thurrock University Hospital NHS Foundation Trust is committed to the highest standards of recruitment to ensure we attract and employ the very best candidates. To meet this standard we have developed a detailed and thorough selection event for our short listed candidates.&lt;br /&gt;Applications are invited for a full time post of Locum Consultant anaesthetist within our department of Anaesthesia and Critical Care The successful candidate will be expected to commence as soon as possible. Candidates will require full registration with the General Medical Council.&lt;br /&gt;The primary role for the successful candidate will be to join the Anaesthetic Team covering elective theatres and on-call commitments. With the successful candidate there will be 23 Consultants in post.&lt;br /&gt;We are looking for a Consultant who has considerable experience. The post holder will be expected to have an understanding and awareness of clinical governance and be passionate about patient care and safety.&lt;br /&gt;The successful candidate will be expected to integrate within the team of existing consultant staff in order to provide a complete Anaesthetics Service. The Trust is committed to offering a much more patient focussed service and Anaesthetics have made their services available seven days a week and the successful applicant will be expected to participate in these services.&lt;br /&gt;Anaesthesia services are provided for 2 day Surgery theatres at Orsett. Basildon has 7 main theatres, 3 day surgery theatres and 2 maternity theatres. The day unit also feeds patients in to the main theatres. In addition anaesthetic services are provided for A&amp;E, X-ray, Cardiology and patients requiring ECT.&lt;br /&gt;Critical Care Services&lt;br /&gt;There is an anaesthetic input to the cardio-pulmonary resuscitation service at Basildon Hospital. Organisation of this workload is effected from the Anaesthetic office at Basildon Hospital. The Anaesthetic Division meets regularly to discuss anaesthetic organisation and issues affecting the department.&lt;br /&gt;Basildon and Thurrock University Hospital NHS FT has recently completed the construction of a new 14 bedded Critical Care Unit and currently has eleven funded beds within Critical Care, 7 level 3 and 4 level 2.&lt;br /&gt;The department employs a Nurse Consultant in Critical Care and there is a Critical Care Outreach Team (CCOT) which provides critical care support to the general acute wards. The clinicians working in this field, in conjunction with the nursing staff, have the opportunity to take on the challenge of reshaping how the Trust manages its critical care patients.&lt;br /&gt;Obstetric Services&lt;br /&gt;There is a high anaesthetic input into the maternity unit. There are approximately 4,000 deliveries each year. There is an epidural service for pain relief in labour which is running at 20-25%. The caesarean section rate is approximately 23%. Our aim is to have most of our Caesarean Sections done under regional anaesthesia whenever possible. The Labour Ward has two theatres with recovery. There are three high dependency beds on the Labour Ward and very good communication exists between the obstetric anaesthetists and those responsible for critical care. We are using PCA for post-operative pain relief and we are now providing PCEA for labour pain. The obstetric anaesthesia department has a dedicated office in the unit which is used for audit and training purposes.&lt;br /&gt;Consultant Anaesthetist – Surgical Services&lt;br /&gt;6&lt;br /&gt;Doctors in training&lt;br /&gt;The Anaesthetic Department Specialist trainees (ST’s) are members of the Bart’s and the London School of Anaesthesia which is based at the Royal London Hospital and St. Bartholomew’s and the core trainees (CT’s) are part of the Eastern Deanery. Regular medical audit takes place within the Department with monthly meetings held on a rotating basis.&lt;br /&gt;Anaesthetic trainees currently include 7 in the first 2 years of training (CT1, CT2 and ACCS) and 4 senior trainees (ST 3-7). Trainees are encouraged to attend day release courses for relevant parts of the exam and there is a training program within the department with protected teaching time.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For an information discussion please contact Dr Tahir Akhtar, Clinical Lead on 01268 524900 ext 3422. or Dr James Carrannante on 01268 524900 ext 3422&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr James Carranannte&lt;br /&gt;Clinical Lead for Anaesthetics &amp; Theatres &lt;br /&gt;Tel 01268 524 900 Ext 3422&lt;br /&gt;&lt;br /&gt;Lisa Want&lt;/p&gt;\n&lt;p&gt;Service Unit Manager &lt;br /&gt;Anaesthetics, Critical Care, Theatres and Pain Management &lt;br /&gt;Tel 01268 524 900 Ext 8526&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon, Basildon", "postalCode": "SS16 5NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5577", "longitude": ".450587"}}, "title": "Consultant Anaesthetist - General", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225354", "validThrough": "2020-11-11T23:59:59+0000"}