{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-11-04T11:31:12+0000", "description": "&lt;p&gt;Mulberry 3 is an acute recovery ward welcoming patients from the acute and forensic pathway for a period of up to 3 months.&lt;/p&gt;\n&lt;p&gt;We have a strong MDT presence and as a team have an abundance of energy and expertise whilst we work in collaboration both as a team and with our colleagues from neighbouring services and service users&lt;/p&gt;\n&lt;p&gt;This post is for an Activities Coordinator, based on the ward.&lt;/p&gt;\n&lt;p&gt;Aspects of the role will include;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The provision and co-ordination of meaningful group and activity sessions for service users.&lt;/li&gt;\n&lt;li&gt;The development of activities with individuals and the provision of support to enable people to engage in activity.&lt;/li&gt;\n&lt;li&gt;To offer group based sessions with a focus on skill development/social inclusion/communication/education and recovery.&lt;/li&gt;\n&lt;li&gt;Working alongside the Nursing and Occupational Therapy team.&lt;/li&gt;\n&lt;li&gt;Providing support and practical assistance to service users in order for them to regain confidence in their skills and abilities to enable a successful re integration into the community.&lt;/li&gt;\n&lt;li&gt;Inspiring hope and belief that recovery is possible in others.&lt;/li&gt;\n&lt;li&gt;Within a relationship of mutuality, facilitate and support information sharing to promote choice, self-determination and opportunities for the fulfillment of socially valued roles and connection to local communities.&lt;/li&gt;\n&lt;li&gt;Promotion of their role within the ward and wider care setting.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a team we strive to really make a meaningful positive difference for our service users and welcome candidates who are highly motivated and have a person centered approach.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a strong team work ethic, sense of accountability, accompanied by an ability to work under considerable pressure at times. This post is open to people with the right attributes to complement and enhance our team. In return we will provide in-house skills training and external training opportunities and robust supervision from senior professionals to support the candidates development.&lt;/p&gt;\n&lt;p&gt;We are keen to support and develop our staff through a clear career pathway and encourage promotional opportunities within the Trust.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference for our community by supporting people with acute mental health needs then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) provides integrated community and mental health, learning disability and social care services of the highest standard due to our continued commitment to quality and service improvement. We aim to support people of all ages to achieve the very best they can for their health and well being. To ensure that we achieve this goal we look to recruit candidates of a high calibre that share our passion for delivering excellent service user care, research and education.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal Presentation &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Candidates will need to complete a 10 minute informal presentation on;&lt;/p&gt;\n&lt;p&gt;What groups could you bring to an acute assessment unit to enhance engagement of a service user who is self isolating?&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Chloe Taylor - chloe.taylor@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Ward Manager&lt;/p&gt;\n&lt;p&gt;01223 219508&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fulbourn, Fulbourn Hospital", "postalCode": "CB21 5EF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1852", "longitude": ".188204"}}, "title": "Activity Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255615", "validThrough": "2020-11-18T23:59:59+0000"}