{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a. inc. HCA"}}, "datePosted": "2020-11-02T12:02:16+0000", "description": "&lt;p&gt;An exciting permanent band 6 physiotherapy opportunity has arisen within the therapy team at the Amputee Rehabilitation Unit (ARU),part of Guys and St Thomas’ NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Based in Kennington at the Lambeth Community Care Centre, the ARU is a 12 bedded unit and forms part of the Integrated Care Strategic Business Unit, sitting within the Integrated Care Therapies and Medicine directorate. Our patients are transferred from acute hospital wards and stay with us for up to 7 weeks as they progress through their rehabilitation milestones. Our caseload is complex and varied, seeing a rise in multiple limb loss and trauma amputations as well as our PVD and diabetic amputees.&lt;/p&gt;\n&lt;p&gt;Onsite services include a minimum of twice daily rehabilitation, tailored to the individual over a six day service. This can include physiotherapy, occupational therapy, group rehabilitation sessions, psychological rehabilitation and health promotion and pain management. The unit is closely aligned with Guys and St Thomas’ Regional Rehabilitation Centre: Bowley Close, which continues life-long amputee care and rehabilitation post discharge. The Unit provides specialist rehabilitation nursing including an enabling care approach and specialist wound care skills.&lt;/p&gt;\n&lt;p&gt;The successful candidate is required to have prior leadership skills with experience of completing supervision and experience of deputising for senior specialist physiotherapists. Extensive amputee rehabilitation experience is required, including rehabilitation of complex amputees such as those with poly trauma, upper limb amputation, multiple limb loss and complex comorbidities.&lt;/p&gt;\n&lt;p&gt;The post holder will directly line manage the Band 5 Rotational Physiotherapist and be responsible for physiotherapy students, working closely with our occupational therapists and nursing colleagues to deliver enabling care on the ward.&lt;/p&gt;\n&lt;p&gt;The successful candidate would ideally have close links and understanding of the amputee rehabilitation pathway in South East London and Kent and the wider amputee network across London and its neighbouring counties.&lt;/p&gt;\n&lt;p&gt;The successful candidate would be accountable for their clinical practice and have experience of aspects clinical governance such as audit development and completion.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to be an excellent communicator, autonomous and organised in order to provide a seamless service and meet the needs of the team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have opportunities for internal and external training and development. You would be supported by the Senior Specialist Physiotherapist and the Advanced Amputee Rehabilitation Practitioner (ARU Clinical Lead).&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for a dynamic and passionate individual who is ideally already working within amputee rehabilitation with extensive amputee rehabilitation experience. If you think this could be you, we would welcome your application!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLauren JosephJob titleB7 Senior Specialist PhysiotherapistEmail addresslauren.joseph@gstt.nhs.ukTelephone number0203 049 6912&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Amputee Rehabilitation Unit, Lambeth Community Care Centre, London", "postalCode": "SE11 4TX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4927", "longitude": "-.108549"}}, "title": "Specialist Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251965", "validThrough": "2020-11-08T23:59:59+0000"}