{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-23T16:01:15+0100", "description": "&lt;p&gt;Blackpool Victoria NHS Trust is passionate about the acute care of older adults. Are you forward thinking, energetic and looking to join a dynamic developing service?&lt;/p&gt;\n&lt;p&gt;The Acute Frailty Unit is a 25 bedded assessment unit for acutely unwell older adults admitted to the Trust. The unit sees a wide range of acute medical presentations. Patients are admitted for 24-48 hours assessment period before transfer to wards or discharged.&lt;/p&gt;\n&lt;p&gt;Our multidisciplinary team consists of Acute Geriatricians, Advanced nurse practitioners, therapists, pharmacists, junior doctors, Occupational Therapist and physiotherapists, who work collaboratively to treat a complex mix of acutely unwell frail medical patients.&lt;/p&gt;\n&lt;p&gt;Whether you are just starting out on your Nursing career, looking for a change of job, working in a Nursing Home or even returning to practice, we would welcome the opportunity to meet with you.&lt;/p&gt;\n&lt;p&gt;Caring for short stay frailty patients ensures a varied role where staff can learn specialty care for those who may have multiple medical conditions, are on multiple medications and are often require specialist support at home or in their care homes. Staff will also support patients who are acutely unwell, may also have poor recognition (dementia &amp; delirium), difficulty in mobility, falls and frailty.&lt;/p&gt;\n&lt;p&gt;For further Information please contact Sarah Wilkinson Ward Manager 01253 953423&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen SherlockJob titleRecruitment SisterAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Sr Sarah Wilkinson Tel: 01253 953423&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Staff Nurse Acute Frailty Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241206", "validThrough": "2020-11-08T23:59:59+0000"}