{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43520", "minValue": "32896", "unitText": "YEAR", "value": "£32,896 - £43,520 per annum / pro rata for part ti"}}, "datePosted": "2020-11-04T12:31:28+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a &lt;strong&gt;Full Time Junior Clinical Fellow (Lower Level) in General Surgery. &lt;/strong&gt;The post will be based at the&lt;strong&gt; Grange University Hospital, SE Wales, &lt;/strong&gt;commencing on&lt;strong&gt; 03 February 2021 &lt;/strong&gt;for a fixed term period of &lt;strong&gt;6 months initially, possibly extending to 12 months by mutual agreement if wished.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a Junior Clinical Fellow (on F2/CT-level rota) in General Surgery. This post involves working in a clinical team providing support and supervision to Foundation Year 1 doctors, and being supported/supervised by registrar-level doctors and consultants.&lt;/p&gt;\n&lt;p&gt;This post is suitable for junior doctors considering or seeking a career in a surgical specialty, and/or those wishing to gain experience in surgery prior to applying to other specialties e.g. radiology or general practice. Previous post holders have successfully applied to Core Surgical Training posts and other national specialty selection processes.&lt;br /&gt;&lt;br /&gt;Robust support is provided for doctors in training and non-training medical posts, with full supervision of clinical activity, teaching, research, audit and quality improvement. The successful candidate will be offered an educational supervisor who can advise and support development of a professional portfolio and subsequent career.&lt;br /&gt;&lt;br /&gt;The General Surgery Department is currently staffed by 15 Consultants, 1 Associate Specialist, 9 Specialist Registrars,13 Senior Clinical Fellows, 9 Core Trainees/FP2s, 3 Junior Clinical Fellows and 20 Foundation Year 1 doctors. There is a separate network on call service for Vascular Surgery.&lt;br /&gt;&lt;br /&gt;Excellent Postgraduate medical facilities are available in a newly opened Postgraduate Centre in the Grange University Hospital, in addition to facilities on other HB sites.&lt;/p&gt;\n&lt;p&gt;Aneurin Bevan University Health Board can offer you a great place to live and work, as well as the opportunity to develop and progress your career.&lt;/p&gt;\n&lt;p&gt;This position involves Regulated Activity with &lt;strong&gt;children and adults&lt;/strong&gt; as defined by the Safeguarding Vulnerable Groups Act (amended by the Protection of Freedoms Act 2012) and the following checks will be undertaken following any conditional offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Enhanced check with barred list information, including an adults and children’s barred list check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants must hold full registration and a licence to practice with the GMC.&lt;/p&gt;\n&lt;p&gt;Free parking is available across all Aneurin Bevan University Health Board Sites.&lt;/p&gt;\n&lt;p&gt;Those wishing to discuss the post informally in the first instance or visit the department should contact Miss Tamsin Boyce, Consultant Surgeon, on 01633 234126, Tamsin.Boyce@wales.nhs.uk.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THIS IS A NON TRAINING POST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Course Funding: Please note that unless agreed by the Division in advance, course funding is not available for Clinical Fellow or fixed term cover for training grades.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date for Applications: Midnight on 22nd November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grange University Hospital, Torfaen, SE Wales", "postalCode": "NP44 8YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6463", "longitude": "-2.99634"}}, "title": "Junior Clinical Fellow (Lower Level) in General Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255856", "validThrough": "2020-11-22T23:59:59+0000"}