{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24000", "minValue": "24000", "unitText": "YEAR", "value": "£24,000 per annum"}}, "datePosted": "2020-10-16T16:25:30+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Independent Sexual Violence Advisor (ISVA) for Male Survivors - Essex&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Mountain Healthcare Limited is pleased to offer a new opportunity based in Essex but supporting male survivors of sexual abuse who reside in Hertfordshire. Research has shown that male survivors of sexual abuse are more likely to access services remotely. This role will therefore be based in Mountain Healthcare’s contact centre in Braintree, with the successful applicant (who will be a male)&lt;span&gt; &lt;/span&gt;delivering support to clients by telephone, text, and video conferencing, alongside other members of Mountain Healthcare’s Pathway and Support Service.&lt;/p&gt;\n&lt;p&gt;You will work in partnership with other agencies, to provide a pro-active service to victims of sexual assault and rape of all ages, through risk assessment and safety planning. To enable victims to access statutory and other service needs and to ensure victims are kept informed and supported as their cases progress through the criminal justice system (CJS as a contribution to bringing more offenders to justice. As an ISVA you will work in partnership with criminal justice agencies and other professionals from external agencies and requires highly developed communication skills. An ISVA is required to communicate with investigating police officers, witness services and other support agencies to provide appropriate and consistent support to enable victims to continue through the CJS accessing health and psychological services where necessary. As an ISVA you will also provide a non-judgmental and confidential service, referring to external agencies services and other professionals as appropriate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Experience of working with vulnerable people, and male survivors is desirable. The working pattern is Monday to Friday, 9am-5pm..&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; All successful candidates will be subject to pre-employment checks including; an Enhanced DBS check, 2 satisfactory references and a Police vetting checks. Because of the nature of the Independent Sexual Violence Advisor role applications are invited from males only. This post has a genuine occupational qualification under the Sex Discrimination Act, Section 7(2)b and 7(2)e&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mountain Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Essex", "postalCode": "CM15 8DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6234", "longitude": ".316667"}}, "title": "Independent Sexual Violence Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231090", "validThrough": "2020-11-06T23:59:59+0000"}