{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum plus london weighting"}}, "datePosted": "2020-10-23T17:30:28+0100", "description": "&lt;p&gt;NORTH EAST LONDON FOUNDATION TRUST&lt;br /&gt;&lt;br /&gt;Consultant Community Paediatrician (Substantive post) &lt;br /&gt;The Acorn Centre, London Road, Romford (Havering) (10 PAs)&lt;br /&gt;&lt;br /&gt;Applications are invited for a substantive post of Consultant Community Paediatrician in Havering. This post will be based at the new CDC at The Acorn Centre, London Road in Romford. Candidates wishing to job share are also encouraged to apply. &lt;br /&gt;&lt;br /&gt;Staff in NELFT work within a supportive environment that strives to strike an excellent work/ life balance and job satisfaction, which creates an atmosphere to provide high quality care. In addition, staff also enjoy other benefits including a car lease scheme, flexible working arrangements, Childcare voucher scheme, the NHS Pension Scheme and ongoing opportunities for career development. &lt;br /&gt;&lt;br /&gt;NELFT has excellent relationships with all stakeholders, robust governance structures and excellent systems of data collection and performance monitoring. As a Foundation Trust, NELFT retains any surplus generated for investment in services. NELFT is committed to safeguarding and promoting the welfare of children and to protecting them from the risk of harm. NELFT recognizes its responsibility to ensure that safe working systems are in place for staff working with children and families and staff working with children and adults in their care.&lt;br /&gt;&lt;br /&gt;The post holder will contribute to the consultant leadership in the team and to the development of the integrated service. The clinical aspects of the role will be in the field of community paediatrics with an emphasis on child development, neurodevelopmental and neurological subspecialties. The post holder will therefore have consultant responsibility for the assessment, investigation, management and care of children within the Community Paediatric team and undertake the necessary clinical administrative duties associated with providing an excellent patient care. The post holder will contribute to the child protection rota and also provide supervision and teaching to the speciality doctor and other junior medical staff in the service.&lt;br /&gt;&lt;br /&gt;This post will attract 10 Programmed Activities per week - 7.5PAs for direct clinical care and 2.5PAs for supporting professional activity. There is no on-call for this post. The post offers excellent CPD and study leave arrangements as well as good research and service development opportunities.&lt;br /&gt;&lt;br /&gt;We are looking for enthusiastic and flexible candidates who demonstrate leadership abilities and are committed to working in a multidisciplinary setting and in service development.&lt;br /&gt;&lt;br /&gt;Applicants should be on the Specialist Register or be within 6 months of obtaining their CCST and should have an approved training in Child Protection / Safeguarding at Level 3 of the intercollegiate guidelines.&lt;br /&gt;&lt;br /&gt;THIS JOB DESCRIPTION IS PENDING ROYAL COLLEGE APPROVAL&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Kala Shanmugananda, Consultant Community Paediatrician&lt;/p&gt;\n&lt;p&gt;Acorn Centre, London Road, Romford, RM7 9NH&lt;/p&gt;\n&lt;p&gt;kala.shanmugananda@nelft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Acorn Centre, Romford", "postalCode": "RM7 9NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5749", "longitude": ".161575"}}, "title": "Consultant Community Paediatrician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241440", "validThrough": "2020-11-24T23:59:59+0000"}