{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-19T14:31:32+0100", "description": "&lt;p&gt;An opportunity has arisen at Lincoln County Hospital, United Lincolnshire Hospitals NHS Trust for a dietitian that would provide excellent experience of general dietetics based in a large acute unit. The postholder would work with both in and outpatients including support to medicine, surgery and complex care.We are keen to support staff to develop their knowledge, skills and competencies and you would have the opportunity to work alongside other staff to develop skills in specialist areas e.g. paediatrics, diabetes.This post would suit a newly qualified HCPC registered Dietitian or someone seeking a wide range of experience. We are committed to professional development and support both informal and formal CPD. We are a friendly and welcoming department of 20 staff based on the Lincoln site, which includes secretarial and assistant support. The Trust-wide dietetic department is based on 4 sites and there is a programme of CPD sessions and post-qualification training opportunities. We support dietetic student placements from the University of Nottingham for A,B and C placements. On-site accommodation is usually available. Lincoln County Hospital is the largest of our hospital sites, situated next to the cathedral quarter in the north of the city. The award winning Lincolnshire Heart Centre which has some of the best outcomes for patients in the country is based at the hospital. Staff tell us that they join the hospital because they can see the opportunities open to them to develop services and make their mark. Further information about Lincoln and the surrounding areas can be found in the attached You Tube video in the links section. If you would like to discuss this post further please contact Katherine Green Trust Lead Dietitian,Lincoln County Hospital on katherine.green@ulh.nhs.uk or telephone 01522 573418&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name: Rachel Croft&lt;/p&gt;\n&lt;p&gt;Job title: Inpatient Team Leader Dietitian&lt;/p&gt;\n&lt;p&gt;Email address: rachel.croft@ulh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01522 573418&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Additional contact information&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Katherine Green: katherine.green@ulh.nhs.uk,  01522 573418&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln County Hospital, Lincoln", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232672", "validThrough": "2020-11-09T23:59:59+0000"}