{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503  + 15% R &amp; R premium"}}, "datePosted": "2020-10-28T10:46:52+0000", "description": "&lt;p&gt;Posts offer an R and R Premium of 15% if accredited with BHRS or IBHRE and registered with HCPC or RCCP (or has evidence of working towards registration) on top of the Band 7 salary range&lt;/p&gt;\n&lt;p&gt;Are you an enthusiastic, motivated and qualified Cardiac Physiologist keen to join an innovative team of Cardiac Physiologists and other Health Care Professionals?&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for two Band 7 Cardiac Physiologist’s specializing in Cardiac Rhythm Management &amp; Invasive Cardiology at Maidstone and Tunbridge Wells NHS Trust. We are seeking to recruit two highly motivated individuals to join our busy and friendly team. You would be expected to work across both sites to gain exposure to all aspects of cardiology that the service provides. Currently the Maidstone site offers complex device implants and Electrophysiology, whilst the Tunbridge wells site offers PCI including PPCI (in hours), IVUS and pressure wire studies.&lt;/p&gt;\n&lt;p&gt;We are a friendly and dynamic Trust situated in the heart of Kent. The local area has excellent schools and our department is family friendly. Both sites are within 1 hour commute to London. Kent is known as the garden of England, with beautiful historic villages in a rural setting as well as bustling towns.&lt;/p&gt;\n&lt;p&gt;Our Trust’s core catchment areas are Maidstone and Tunbridge Wells and their surrounding boroughs, and it operates from two main clinical sites: Maidstone Hospital and Tunbridge Wells Hospital at Pembury. It provides a full range of general hospital services and some areas of specialist complex care to around 560,000 people living in the south of West Kent and the north of East Sussex.&lt;/p&gt;\n&lt;p&gt;Due to a rapidly expanding cardiology service, significant investment is planned for the service. We are in the process of purchasing a 3D electro anatomical mapping system (Carto) and a new EP system. We already have an established EP service, and plan to extend this to complex EP. In addition, there are plans to expand &amp; redesign the Maidstone Cardiology site in 2021. This will provide an exciting opportunity to be involved in the cutting edge of cardiology and to help shape future cardiac services in Kent.&lt;/p&gt;\n&lt;p&gt;We offer regular training sessions, mentorship and engaged leadership at all levels. We have close links with Guys &amp; St’ Thomas NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The post holders will be given an opportunity for development within the department including training in EP or complex device implants. Continued professional and personal development is actively encouraged and the successful candidates will be given opportunities and supported to develop their postgraduate skills.&lt;/p&gt;\n&lt;p&gt;The successful applicants should have BSc (Hons) in Clinical Physiology (Cardiology)/ BSc (Hons) Healthcare Science (Cardiac Science) or equivalent plus IBHRE or BHRS device accreditation. Ideally they should be registered with RCCP or HCPC or should have evidence they are working towards registration.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Wednesday 18th November 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: To be confirmed&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnne-marie LintonJob titleLead Cardio-respiratory PhysiologistEmail addressannenewsholme@nhs.netTelephone number07931326322&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross site (Maidstone and Tunbridge Wells NHS trust), Maidstone", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Highly Specialised Cardiac Physiologist (CRM)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246169", "validThrough": "2020-11-18T23:59:59+0000"}