{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-22T09:35:34+0100", "description": "&lt;p&gt;The RUH has long recognised the strategic importance in having robust information systems and has invested heavily in its Electronic Patient Record (EPR) Cerner Millennium since its implementation in 2011. The journey to having a ‘full EPR’ (i.e. no paper within the Trust) is now within sight.&lt;/p&gt;\n&lt;p&gt;To support both clinical and non-clinical staff with their training on the Electronic Patient Record and other systems, we are recruiting an IT Trainer and eLearning Developer. This hybrid role will include the creation of eLearning, as well as the delivery of face to face classroom based training sessions. You will be part of a team of trainers that are responsible for ensuring that staff are fully equipped to utilise Cerner Millennium EPR within the Trust.&lt;/p&gt;\n&lt;p&gt;You will enjoy a fast paced and varied working environment and be able to manage a high volume workload. You will be highly organised, an effective communicator with teaching or training experience.&lt;/p&gt;\n&lt;p&gt;Generally you will work normal office hours based at the RUH/home (split between two due to COVID-19) but flexibility with regard to running occasional evening or weekend training sessions will be required. In addition, flexibility may be required to cover a variety of training locations based in Community Hospitals across the Bath and North East Somerset and Wiltshire area.&lt;/p&gt;\n&lt;p&gt;Experience within the NHS would be beneficial but is not essential. Enthusiasm and a can-do attitude will be the key to your success in this role.&lt;/p&gt;\n&lt;p&gt;For more information please email Dominique Emmanuel, Informatics Manager at dominiqueemmanuel@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal United Hospitals, Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Informatics Trainer and eLearning Developer B5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237733", "validThrough": "2020-11-08T23:59:59+0000"}