{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33176", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 / £33,176 / £33,779 / £37,890"}}, "datePosted": "2020-10-01T23:19:53+0100", "description": "&lt;p&gt;&lt;strong&gt;Not all Heroes wear capes. Now more than ever, being a #NHSHero is something to be proud about.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ARE YOU A NURSE WHO STRIVES TO MAKE A POSITIVE DIFFERENCE TO THE LIVES OF YOUR PATIENTS?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have the PASSION, DRIVE AND ability to deliver high quality compassionate care?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If the answer is yes, then joining us in Community Nursing Services could be the perfect career move for you.&lt;/p&gt;\n&lt;p&gt;This is what our patients and their loved ones say about our nurses -&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“I don’t know what I would do without the nurses”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“I have a named nurse who knows about my care and knows me as a person”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“It was lovely to see your smiling faces at my door”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“I was very impressed with the service. Very professional and informative”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“Lovely staffs, always cheer me up”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is what our staff say about working within Community Nursing Services –&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“I feel supported by staff and management”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“Autonomous working in the community is very rewarding”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“I always receive positive feedback”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“We have regular meetings to keep updated”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for level 1 (adult) registered District Nurse to become part of our new and developing hub based Community Nursing Teams where we offer core community nursing, rapid response and Home First nursing interventions to patients living in their own homes, residential homes and in local accessible clinics.&lt;/p&gt;\n&lt;p&gt;We work in an integrated way with health and care providers across the whole system in Leicester, Leicestershire and Rutland to ensure that care is joined up and that whenever we can, we strive to care for patients at home, helping them to maintain independence and ensuring that high quality care is delivered in an efficient and holistic manner.&lt;/p&gt;\n&lt;p&gt;We are working hard to continually improve our outcomes for patients and our experience for staff in delivering care and have new investment to improve our capacity to keep developing.&lt;/p&gt;\n&lt;p&gt;We would love to hear from you if you can –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Demonstrate your passion and ability to assess, plan, provide and evaluate evidence based nursing care for patients experiencing a wide range of conditions.&lt;/li&gt;\n&lt;li&gt;Support our patients and work with people in an asset-based way that really enables them to live their optimum life, being self-caring and independent with their health needs where possible.&lt;/li&gt;\n&lt;li&gt;Work collaboratively, efficiently and creatively with multi professional colleagues and partners with a focus on ‘Home First’ helping patients to avoid hospital admissions and where they do need a hospital stay facilitating timely and well supported discharge back home.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return we would love to offer you –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Regular, meaningful clinical supervision tailored to your specific needs.&lt;/li&gt;\n&lt;li&gt;A well-supported and individually tailored induction.&lt;/li&gt;\n&lt;li&gt;A professional development plan which supports your continuous learning and development.&lt;/li&gt;\n&lt;li&gt;Training and quality improvement opportunities.&lt;/li&gt;\n&lt;li&gt;A healthy work life balance with weekend working on a rota of one in three, long and short days available and no night shifts.&lt;/li&gt;\n&lt;li&gt;Exciting technological developments to support you to deliver the care you aspire to give.&lt;/li&gt;\n&lt;li&gt;The opportunity to work within an innovative and progressive service which is testing and developing new ways of working, which is involved in the national ageing well programme as an early implementer site and which has been shortlisted for national awards in 2019/2020.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is such an exciting time to be joining this transforming service which delivers an integrated health and social care offer delivered by community-based nursing, therapy and adult social care teams. If you want to be the nurse that makes a difference then &lt;strong&gt;WE WANT YOU&lt;/strong&gt;!&lt;/p&gt;\n&lt;p&gt;Car driver essential.&lt;/p&gt;\n&lt;p&gt;If you wish to discuss this post further please contact Sonia Sunner, Community Services Matron on 07464 981130&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oakham", "postalCode": "LE15 6NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6708", "longitude": "-.737515"}}, "title": "Band 6 District Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916209626", "validThrough": "2020-12-06T23:59:59+0000"}