{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa. pro-rata. Inc. of HCAS [15%]"}}, "datePosted": "2020-10-28T16:45:57+0000", "description": "&lt;p&gt;&lt;strong&gt;Acute Oncology Nurse Specialist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: Cancer Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band: 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;22.5 Hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportuntity has developed to join the cancer services at Kingston hospital as a part time Band 7 post within the Acute Oncology Service (AOS) at Kingston hospital NHS Foundation Trust. The Acute Oncology and Cancer of Unknown Primary Services cover the following patient groups; • Patients who are first diagnosed with cancer in the emergency setting. • Patients with known cancer who present as an emergency with acute complications of non-surgical treatment – including Systemic Anti-Cancer Therapy (SACT) or radiotherapy. • Patients with known cancer who are acutely ill because of the disease itself.&lt;/p&gt;\n&lt;p&gt;Non-medical prescribing is desirable but not essential. A willingness to undertake the course is essential and the opportunity to be involved in the development of a nurse led clinic will become available. The successful applicants will work as part of the acute oncology team as well as working closely with the site specific oncology teams at Kingston and at our partners The Royal Marsden Hospital. Applicants would ideally have wide experience working within oncology and/ or acute oncology. The role requires a motivated, organised nurse with a good knowledge of acute oncology. Effective communication skills and a flexible approach are essential. The role will involve working autonomously and within the wider oncology and hospital team. As an advisory service we outreach to all wards and A&amp;E. AOS nurses participate in the assessment, diagnostic testing and management of the acute cancer patients and promote the AOS via established educational activities. You will give advice, instigate investigations and implement patient care as appropriate to manage acutely unwell oncology patients. You will provide essential cross department liaison and communication to improve the patient’s journey and experience, reduce length of stay and when possible prevent hospital admissions. The successful candidate is required to be able demonstrate the Trust values, the responsibilities of the job description and person specification.&lt;/p&gt;\n&lt;p&gt;Interview Date: To be confirmed&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Elizabeth Crowther AOS Lead Nurse for more information or an informal visit on 0208 934 2928 or by email elizabeth.crowther4@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingston Hospital NHS Foundation Trust, Kingston Upon Thames", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Acute Oncology Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247415", "validThrough": "2020-11-11T23:59:59+0000"}