{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 p.a. pro rata"}}, "datePosted": "2020-11-05T11:23:40+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialty Doctor – Community Paediatrics – 1 year fixed term&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to join our Community Paediatric Medical Service in Solent NHS Trust Children &amp; Families service line to support us in the delivery of high quality health care.&lt;/p&gt;\n&lt;p&gt;Solent NHS Trust is an established and well regarded provider of community and mental health services and is well placed to provide a key role in the future delivery of integrated services. Working in partnership with other organisations, as well as with our primary care colleagues and specialist services, we provide great care which keeps our patients at the heart of everything we do.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit to an enthusiastic Specialty Doctor to complement and work as part of our integrated Community Paediatric Medical team, delivering general Paediatrics, Looked After Children’s clinica and neurodevelopment clinics and actively participate in child protection work through a duty rota.&lt;/p&gt;\n&lt;p&gt;You will be joining us at an important time in our development, as we are committed to the delivery of the transformation programme which sets out the vision for integrated services across a number of partner organisations including multi-disciplinary meetings with our GPs and acute Paediatricians in Southampton City cluster hubs. This exciting role requires an individual with strong clinical leadership, General Paediatrics/neurodevelopment skills and a passion for working with children and families.&lt;/p&gt;\n&lt;p&gt;This is a real opportunity for individuals that want to make a difference both within the Children and Families service line and across the wider system. Please see attached Job Description for further details.&lt;/p&gt;\n&lt;p&gt;If you wish to have an informal conversation regarding the post please contact either Dr Nick Le Prevost (Clinical Lead) on&lt;span&gt;nick.leprevost@solent.nhs.uk&lt;/span&gt; or Claire Langrish (CPMS Team Manager) on&lt;span&gt;claire.langrish@solent.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Specialty Doctor – Community Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257433", "validThrough": "2020-12-03T23:59:59+0000"}