{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa inc"}}, "datePosted": "2020-10-29T16:01:11+0000", "description": "&lt;p&gt;&lt;span&gt;Are you currently working as an acute hospital alcohol and drug nurse and seeking to further develop your skills in a supportive workplace environment? Or are you an alcohol and drug nurse or liaison nurse interested in working at a busy Hospital? We are committed to actively supporting our nurses’ development and prospective applicants are encouraged to contact us to find out more about the post or arrange a visit.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our vision is to provide truly integrated care, by delivering addiction and mental health care side-by-side with people’s medical care at the time and the place where it is needed. We make a positive contribution to peoples’ experience of care by informing, empowering and offering treatment during the relatively brief periods of contact we have with patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We provide timely, responsive drug &amp; alcohol and mental health services to the inpatient wards and emergency dept. for all patients from age 18 upwards, including older adults. We work closely with inpatient medical/surgical specialities, mental health and community substance use services. The cases we encounter reflect the whole spectrum of drug and alcohol use, always have medical commodities and frequently have mental health needs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a key player in the multidisciplinary team, offering specialist drug and alcohol advice and delivering psychosocial interventions in the acute hospital setting. You will work collaboratively as an embedded part of the liaison psychiatry dept, which provides a 24/7 on-site service and can provide initial support with alcohol and drug problems out of hours. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must have excellent clinical skills, be able to demonstrate an ability to complete comprehensive drug and alcohol histories, mental state examinations, formulate safe and effective risk management plans, document this clearly and concisely and deliver psychosocial interventions. You must be confident to see people of all ages including older adults, who may have complex medical and mental health needs. You will be able work autonomously with awareness of when to seek advice, in the context of a multidisciplinary team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must have a warm and friendly disposition and have very good communication and interpersonal skills. You must also be confident and motivated, flexible and be able to show initiative in an environment which can be demanding and stressful.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interview date:TBC&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFungayi UseyaJob titleTeam ManagerEmail addressfungayi.useya@nhs.netTelephone number07703886936&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrow, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Alcohol Liaison Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248997", "validThrough": "2020-11-12T23:59:59+0000"}