{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-30T11:16:08+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Band 6 speech and language therapist wishing to further their career in acute services for adults. This post will suit band 5 or 6 therapists wishing to develop knowledge and skills in the management of swallowing difficulties as the opportunity to acquire more advanced dysphagia competencies is a significant part of this role. The post is based at the Royal Sussex County Hospital in Brighton. You will provide assessment and management of communication and swallowing difficulties with support from senior colleagues. We are a well established team working in the exciting environment of a teaching hospital with regional specialties. You will have excellent opportunities to participate in a wide variety of continuing professional development activities and to develop skills and in both videofluoroscopy and FEES.&lt;/p&gt;\n&lt;p&gt;As part of the development of stroke services in this Trust you will also be part of a Saturday working rota with other band 6 therapists in the team, under the lead speech and language therapist for stroke. As such, some experience in stroke is desirable however training and support is provided.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Mandy Mcleod&lt;/p&gt;\n&lt;p&gt;Job title SALT Manager&lt;/p&gt;\n&lt;p&gt;Email address mandy.mcleod@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07827 233249&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Specialist Speech and Language Therapist in Acute Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249908", "validThrough": "2020-11-08T23:59:59+0000"}