{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa plus HCAS"}}, "datePosted": "2020-11-04T16:30:49+0000", "description": "&lt;p&gt;We are looking for an enthusiastic clinical or counselling psychologist to join our well respected and exciting Inpatient and Acute Psychology Service. The team are at the forefront of national developments in inpatient and acute working. We are also actively involved in research and keen to recruit people who share that vision of contributing to best practice, national guidelines and an evidence base.&lt;/p&gt;\n&lt;p&gt;The post holder will join a well-established psychology service for people in crisis and will work as an integral member of our older adult crisis pathway multi-disciplinary team. The role will involve creative and thoughtful input including offering consultation, assessment and evidence based interventions for clients presenting with a range of issues and will include individual, group, and family work. The post will suit someone who has a strong interest in working with multidisciplinary teams, working in an inpatient setting and working with older-people, their families and carers at a time of crisis.&lt;/p&gt;\n&lt;p&gt;We are keen to recruit the right people who share our passion for working with people in crisis. We offer excellent development opportunities including high quality and regular supervision, opportunities to supervise, teach on local DClinPsy courses and involvement in research. The post-holder will also be part of a trust-wide specialist pathway for older people and will have access to specialist supervision from the strategic lead for older people’s psychology and will have access to specialist professional networks.&lt;/p&gt;\n&lt;p&gt;We also support the development of leadership opportunities and aim to nurture our staff and support them in their development. Several members of the department are engaged in teaching in local clinical training courses and many members are also involved in research and developing national best practice guidelines.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would be happy to discuss the possibility of setting this post up as a band 7 post with a development plan to allow progression to an 8a. This option would suit someone who has an interest in gaining experience in crisis work and an opportunity to develop towards an 8a role. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that this post is currently based across two sites (Woodbury unit: Waltham Forest and Goodmayes Hospital:Ilford). There will be some travelling involved between sites.&lt;/p&gt;\n&lt;p&gt;This job may require direct working with patients with suspected or confirmed COVID-19. The applicant should be able to work with such patients in line with the trusts PPE and social distancing guidelines.&lt;/p&gt;\n&lt;p&gt;Additional hours may also be available in adult services within the trust.&lt;/p&gt;\n&lt;p&gt;Applicants should have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Doctoral level training in Clinical/Counselling Psychology and registration with the Health and Care Professions Council (HCPC)&lt;/li&gt;\n&lt;li&gt;Experience of working in an evidence-based way with clients presenting with severe mental health difficulties, people in crisis and their families and carers.&lt;/li&gt;\n&lt;li&gt;Experience or interest in working with older people and their families and carers.&lt;/li&gt;\n&lt;li&gt;Experience or interest in developing skills in interventions to support the management of Behavioural and Psychological Symptoms of Dementia.&lt;/li&gt;\n&lt;li&gt;Experience of working in a multi-disciplinary service context.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focusing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement - London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMina PatelJob titleSpecialist Care Pathway Lead for Inpatient and Acute PsyhchologyEmail addressMina.Patel@nelft.nhs.ukTelephone number07808878224Additional contact information&lt;/p&gt;\n&lt;p&gt;Additional contact&lt;/p&gt;\n&lt;p&gt;Strategic and Clinical Lead for Inpatient and Acute Psychology&lt;/p&gt;\n&lt;p&gt;Dr Claire Williams: Claire.Williams@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across two sites - Woodbury Unit (Leytonstone) &amp; Goodmayes Hospital (Ilford), London", "postalCode": "E11 1NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5788", "longitude": ".002666"}}, "title": "High Specialist Clinical / Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256664", "validThrough": "2020-11-18T23:59:59+0000"}