{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum / pro rata"}}, "datePosted": "2020-11-05T12:16:25+0000", "description": "&lt;p&gt;We have an exciting opportunity to join our small specialist service working with children, family and professionals where a concern has existed around a young person’s sexual behaviour. The Child and Adolescent Harmful Behaviour Service (CAHBS) is part of the umbrella of specialist CAMHS services and covers Oxfordshire and Buckinghamshire. Working with children and young people (0-18) and their families, through supporting the professional network to engage in a collective response to the concerning behaviour requires: Key consultancy skills; Good child development, mental health, neurodevelopmental knowledge; Specific knowledge and experience of working with the continuum of Harmful Sexual Behaviour (HSB); knowledge and experience of assessment methods to support identification of needs for HSB and intervention for HSB; excellent safeguarding knowledge; alongside a broad understanding of all services that might be involved in a young person’s life (e.g. education, social care, health, CAMHS, police, YOS).&lt;/p&gt;\n&lt;p&gt;Bringing your specialist knowledge to the team, you will contribute to the psychological thinking around the provision and evaluation of care provided within the service. You will provide consultancy to a wide range of professionals with varying degrees of understanding, knowledge and experience of HSB to guide safety planning and risk management as well as identifying suitable intervention options. Guiding interventions and supporting the network to engage in a collective response, alongside family engagement with some direct clinical practice, provides opportunities to develop key skills in multiagency care planning for young people.&lt;/p&gt;\n&lt;p&gt;You will be expected to manage highly distressing material and concerning cases and provide direct assessment and intervention as required. There are opportunities to further develop a wide range of core psychology skills including the provision of a wide range of training delivered by the team, joint supervision of colleagues and audit/service evaluation. You will be provided with a range of reflective supervision and be part of the wider specialist services CAMHS team. Opportunities exist for promoting our services and engaging in training and conferences on occasion.&lt;/p&gt;\n&lt;p&gt;Your duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Take part in the teams’ consultation process to provide guidance to the network in relation to the young person’s strengths and concerns.&lt;/li&gt;\n&lt;li&gt;Holding a relevant case load of the most complex of cases.&lt;/li&gt;\n&lt;li&gt;To offer assessment and individual intervention with the young person and their care givers where appropriate.&lt;/li&gt;\n&lt;li&gt;Contribute to the teams’ supervision and training to other professionals regarding their work with young people and families.&lt;/li&gt;\n&lt;li&gt;Take a role in ensuring that the team is up to date with relevant legislation and safeguarding practice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post is offered at 33.75 hours per week - 20.25 hours per week on a permanent contract, 13.5 hours per week on a fixed term contract for 12 months&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMatthew Lister,Job titleConsultant Clinical PsychologistEmail addressMatthew.Lister@oxfordhealth.nhs.ukTelephone number01865 902613&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maple House, The Slade, Horspath Driftway, Oxford OX3 7JH, OXFORD", "postalCode": "OX3 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7435", "longitude": "-1.19866"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257615", "validThrough": "2020-11-23T23:59:59+0000"}