{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 p.a."}}, "datePosted": "2020-10-29T08:45:35+0000", "description": "&lt;p&gt;Located next to Westhaven Hospital, Weymouth, Linden Unit has 15 beds and provides acute assessment and treatment for people aged 18 and over who are in an acute phase of illness and working towards their recovery.&lt;/p&gt;\n&lt;p&gt;We are an open unit which has successfully completed implementation of all ten Safewards interventions so are now a “Safewards Ward”. A recovery focussed, supportive team, we work therapeutically to provide meaningful occupation and skills to people through activities on and off the ward. These include but are not limited to music composition and freestyle, furniture upcycling, bicycle maintenance and riding, gardening and working with horses amongst many others.&lt;/p&gt;\n&lt;p&gt;We also encourage physical activity and have a full exercise programme which includes yoga, swimming, boxing, taster sessions of watersports, golf, gym, walking and are always open to innovation. We run all these activities alongside our therapeutic recovery and skills based groups aimed at working towards discharge. We also work closely with the Dorset Mental Health Forum Peer Specialists in recovery education.&lt;/p&gt;\n&lt;p&gt;The Multi-disciplinary team on Linden Ward provides treatment and care for a wide range of mental health illnesses which include Schizophrenia, Bipolar, Depression, Anxiety and Emotionally Unstable Personality Disorder.&lt;/p&gt;\n&lt;p&gt;The aim of all staff is to provide a high quality of care and treatment for patients who have physical, social, psychological and emotional health needs and enable them to return home with support from the Home Treatment Team and / or their Community Mental Health Team.&lt;/p&gt;\n&lt;p&gt;We are seeking &lt;strong&gt;a Band 5 Staff Nurse&lt;/strong&gt; to join our Team. You will be able to demonstrate a passion to work in a collaborative, recovery focused, least restrictive way with patients and bring an innovative mind to the Team. You will demonstrate high levels of motivation in the delivery of high standards of care. You will be able to work well as an integral part of a Team but also as an autonomous practitioner. You will be able to demonstrate good leadership qualities and excellent communication skills when engaging with other Teams. We would welcome applicants with all levels of experience to apply.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we can also offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The Trust will provide additional support to secure accommodation for the successful applicant if required&lt;/li&gt;\n&lt;li&gt;Free on site car parking&lt;/li&gt;\n&lt;li&gt;Dedicated career pathways and great opportunities for continuing professional development&lt;/li&gt;\n&lt;li&gt;You will receive a comprehensive and structured induction programme and training.&lt;/li&gt;\n&lt;li&gt;Monthly pay plus enhancements for night, weekend and bank holiday working&lt;/li&gt;\n&lt;li&gt;NHS pension scheme&lt;/li&gt;\n&lt;li&gt;NHS discount and salary sacrifice scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake a &lt;strong&gt;Prevention and Management of Violence and Aggression course&lt;/strong&gt; and it is a condition of your employment that you successfully complete all aspects of this course; if this is not achieved you will not be able to commence working in the post.&lt;/p&gt;\n&lt;p&gt;Refer a friend or family member to apply for this post and if they are appointed, you will receive £250 for the introduction. To make a referral please see complete the online referral form.&lt;/p&gt;\n&lt;p&gt;We welcome you to come and visit the unit and see for yourselves the great work that happens at Linden.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role includes a £3,000 Recruitment Premium on commencement of your employment and a further £1,500 Retention Premium on completion of one year’s service and every year thereafter.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is part of a Trust Recruitment incentive package following the announcement in March 2016 that the Unit faced closure as a result of the outcome of the review of Mental Health Services in Dorset. However this unit continues to provide exceptional recovery focused care to the people of Dorset and there are no current plans to close the unit but it is expected that the beds will be re-provisioned elsewhere in Dorset at some point in the future.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Sarah Suart, Ward Manager at sarah.suart@nhs.net / 01305 361235.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Weymouth", "postalCode": "DT4 0QE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.6149", "longitude": "-2.4798"}}, "title": "Staff Nurse, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247662", "validThrough": "2020-11-12T23:59:59+0000"}