{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T11:31:23+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a graduate qualified health professional (e.g. nurse, social worker, occupational therapist, creative therapist, or someone with extensive clinical CAMHS experience ) to join our dynamic multi-disciplinary team based in Medway.&lt;/p&gt;\n&lt;p&gt;The Medway Young People&#39;s Wellbeing Service require a Youth Offending Worker/Adolescent Worker to work in partnership with the Medway Youth Offending Service.&lt;/p&gt;\n&lt;p&gt;This post will reduce the waiting times for complex young people on the edge of care and custody and increase access to assessment and support with positive interventions that reduce risk and vulnerability and increase access times to treatment reducing waiting times specifically around the neurodevelopmental pathway and community clinical pathways already in place.&lt;/p&gt;\n&lt;p&gt;It will also support the transition process into adult services for complex young people.&lt;/p&gt;\n&lt;p&gt;This role is part of an NHS England funded pilot across Medway and Swale ICP to share learning for future developments across Kent and the South East. &lt;br /&gt;&lt;br /&gt;You will be a highly motivated and innovative individual with clinical experience assessing and working with children and young people with emotional wellbeing and mental health difficulties.&lt;/p&gt;\n&lt;p&gt;A key part of the role will be developing good positive links with all stakeholders and our locality teams.&lt;/p&gt;\n&lt;p&gt;You will :-&lt;/p&gt;\n&lt;p&gt;• Have experience in supervision, governance and service improvement&lt;/p&gt;\n&lt;p&gt;• Link closely with the locality teams and external stakeholder promoting strong working relationships&lt;/p&gt;\n&lt;p&gt;• The post holder will provide assessment, interventions and reports regarding emotional wellbeing, mental and physical health and neurodevelopment needs. They will contribute to programmes designed to reduce the risk of offending/ reoffending behaviour and reduce risk of harm (edge of care).&lt;/p&gt;\n&lt;p&gt;• Assess the level of risk, give appropriate risk management advice and action in line with the Trust risk management policy&lt;/p&gt;\n&lt;p&gt;• Be a contact point for all the YOT staff offering support and advice&lt;/p&gt;\n&lt;p&gt;• Monitor and support the accurate and timely recoding of records and data&lt;/p&gt;\n&lt;p&gt;• In the manager’s absence, be a contact point for the team, the organisation and the public and attend to day to day operational issues&lt;/p&gt;\n&lt;p&gt;CYPMHS focuses on emotional wellbeing as well as mental health and includes access to self-help tools and services based in schools and the community. Training and support is available to other professionals and agencies. We are creating a modern service that fits with children’s lives in a way that best suits them. Key new features include a Children’s Single Point of Access (SPA) into the service, clear early signposting, and use of digital channels such as Together All to access support and services.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Probationary Period&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Assessment/Interview info&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;br /&gt;Starting with NELFT&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHannah ChristieJob titleIntegrated Team ManagerEmail addresshannah.christie@nelft.nhs.ukTelephone number0300 300 19&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Medway YPWS, Gillingham", "postalCode": "ME8 0NZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3624", "longitude": ".576492"}}, "title": "Youth Offending Worker/ Adolescent Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246355", "validThrough": "2020-11-11T23:59:59+0000"}