{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T22:15:16+0000", "description": "&lt;p&gt;It’s an exciting time to join us. Our Community Mental Health Teams have been awarded additional Mental Health Funding to expand teams to develop our Clinical Care Pathways leading to an improved and innovative service for our Service Users, Carers and Staff.&lt;/p&gt;\n&lt;p&gt;Our service focuses on promoting recovery for those people diagnosed with severe and enduring mental ill health. We provide comprehensive multi-disciplinary services and work closely with local specialist mental health teams, tertiary service providers, primary care, local statutory and non-statutory agencies, service users and carers.&lt;/p&gt;\n&lt;p&gt;The Occupational Therapy Leadership, supported by the wider occupational therapy staffing, have been instrumental in developing clinical care pathway occupational therapy specific interventions. The post holder will be using their core occupational therapy skills. Our clinical care pathways focus on initial interventions for people newly referred to services, interventions for people with personality disorders and interventions for people with enduring conditions. This is supported by our Allied Health Professions Strategy focused on enabling independence, transforming transitions and influencing health and wellbeing in order to help individuals rebuild their lives. The care pathways will be delivered by various professionals, and it has been recognised that occupational therapists play a key part in this process. Interventions delivered include a range of occupational therapy groups and individual occupational therapy assessment and treatment. In addition to this there has been a focus on occupational therapists joint working with support workers to facilitate transitions to primary care.&lt;/p&gt;\n&lt;p&gt;We are looking for an occupational therapist with a core mental health occupational therapy background with demonstrable skills and interest in working with service users who have complex mental health needs. You must have experience of working with mental health service users as a qualified practitioner. We are looking for a practitioner with good communication and liaison skills who is forward thinking and enthusiastic regarding innovative ways of working.&lt;/p&gt;\n&lt;p&gt;You will be part of a group of occupational therapists within the larger team and will be supported by a band 7 clinical lead occupational therapist and operational team managers.&lt;/p&gt;\n&lt;p&gt;A commitment to continued professional development is essential. We offer ongoing clinical and professional supervision and access to relevant courses to support you in developing your career.&lt;/p&gt;\n&lt;p&gt;We have an exciting virtual tour video that we will send to anyone that completes an application or if you think it would help you decide if you want to join our amazing team please contact us and we will send you the link.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Abi Hutter, Clinical Lead Occupational Therapist&lt;/p&gt;\n&lt;p&gt;Email: a.hutter@nhs.net, Telephone: 07825 656336&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Laurel House, Canterbury", "postalCode": "CT1 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2739", "longitude": "1.08488"}}, "title": "Community Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255016", "validThrough": "2020-11-18T23:59:59+0000"}