{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-03T11:31:36+0000", "description": "&lt;p&gt;Procurement Specialist Clinical &amp; Non Clinical&lt;/p&gt;\n&lt;p&gt;Northamptonshire Healthcare NHS Foundation Trust (NHFT) Procurement Team is looking to recruit an enthusiastic Procurement Specialist. The successful candidates will act as a lead expert in all aspects of procurement and supply, providing professional advice to internal customers within the Trust. You will play a key role in the effective delivery of a portfolio of projects across a wide range of categories both Clinical and Non-Clinical using procurement tools and techniques to achieve contract compliance, cost reductions and savings whilst ensuring continuous improvement in quality.&lt;/p&gt;\n&lt;p&gt;The candidate should have excellent interpersonal and communication skills including the ability to deliver high quality documentation. The post holder will be required to work closely with all services across the organisation to develop and maintain close working relationships with a wide range of stakeholders and to help drive efficiencies and savings throughout the Trust. Able to understand service delivery requirements, drawing up tender specifications in agreement with the tender sponsor/lead allowing analysis from a range of options to support an informed decision for contract award. Following awards supporting services with regular contract review meetings.&lt;/p&gt;\n&lt;p&gt;The candidate is required to have proven knowledge and experience of NHS and EU procurement tender processes. NHFT delivers services over a wide geographical footprint, travel will be required. This is an exciting opportunity working closely with a range of services across the organisation, playing a significant part in the successful development of the procurement service supporting teams at local level.&lt;/p&gt;\n&lt;p&gt;Previous applicants should not apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Cathy Headland, Head of Procurement, Tel: 07892766023 or email cathy.headland@nhft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCathy HeadlandJob titleHead of ProcurementEmail addresscathy.headland@nhft.nhs.ukTelephone number07892766023&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, Kettering", "postalCode": "NN15 7PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3941", "longitude": "-.722184"}}, "title": "Procurement Specialist - Clinical &amp; Non Clinical", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253741", "validThrough": "2020-11-17T23:59:59+0000"}