{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-30T11:32:55+0000", "description": "&lt;p&gt;&lt;span&gt;If you value diversity, fairness, excellence and sustainability, and are passionate about working with others to ensure high quality care for NHS patients, then Continuing Healthcare is the place where you can thrive.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;NHS Continuing Healthcare (CHC) is the name given to a package of care that is arranged and funded solely by the NHS for individuals who are not in hospital, but who have complex ongoing healthcare needs.   NHS West Sussex CHC is responsible for the decision making and commissioning process, working closely with West Sussex County Council, on behalf &lt;/span&gt;the Sussex Clinical Commissioning Groups (SCCG).  SCCG represents a joint way of working across three Clinical Commissioning Groups (CCGs); NHS Brighton and Hove CCG, NHS East Sussex CCG and NHS West Sussex CCG.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;West Sussex Continuing Healthcare is looking for a motivated, enthusiastic Learning Disability Nurse (or Registered Nurse with Learning Disability experience) to join their team. The role is specific to working with people who have a learning disability and involves; assessing eligibility criteria under the NHS National Framework for Continuing Healthcare and Funded Nursing Care 2018 (Revised), planning, sourcing and commissioning bespoke packages of care (including Personal Health Budgets), supporting individuals, their families and health professionals through the Continuing Healthcare process (including transition from child to adult services) and reviewing eligibility and packages of care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will have excellent communication skills and a sound knowledge of learning disability health and social policy and Continuing Healthcare. Although the team are based in Worthing, the post holder will be expected to be able to travel covering the whole of West Sussex, and occasionally out of the county.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex NHS Commissioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worthing/West Sussex", "postalCode": "BN11 1DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8155", "longitude": "-.367789"}}, "title": "CHC Senior Practitioner (Learning Disabilities)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249984", "validThrough": "2020-11-16T23:59:59+0000"}