{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Will fall within Band 7 payscale based on previus"}}, "datePosted": "2020-10-30T09:16:17+0000", "description": "&lt;p&gt;The Advanced Clinical Practitioner framework, introduced in November 2017, has been designed for experienced clinicians to develop expertise within their scope of practice and core capabilities across the four pillars – clinical practice, leadership and management, education and research. Moving forward this will be the route of progression into advanced clinical roles that we as a department provide in primary and community care, T&amp;O, Rheumatology and Pain.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will develop their role in the advanced clinical assessment and treatment of a diverse and underdetermined caseload of patients, who may have highly complex and/ or chronic presentation. The post holder will develop an advanced level of clinical reasoning, clinical diagnostic skills and treatments as indicated, and maintain records as an autonomous practitioner.&lt;/p&gt;\n&lt;p&gt;The post holder will develop expertise and skills across the four pillars to further develop and enhance the service and MSK pathway. This will be done in collaboration with healthcare colleagues. They will ensure that evidence-based practice is inherent in all aspects of care and treatment and ensure that this knowledge is disseminated throughout the clinical area, Trust and externally as appropriate.&lt;/p&gt;\n&lt;p&gt;The post holder will: develop skills enabling them to undertake a clinical caseload to an advanced practice standard using specialist theoretical knowledge and practical experience. They will develop an extended scope of practice beyond their primary profession. They will support redesign and transformation of existing MSK services including the flow of patient referrals across primary care to Secondary care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;They will undertake a 3-year MSc programme in Advanced Clinical Practice or an equivalence portfolio route to gain verification as an ACP at the Centre of Advancing Practice (CAP) Health Education England (HEE). This will enable the post holder to work towards independent, autonomous clinical practice as an Advanced Practitioner during training. The post holder will be allocated a mentor to ensure successful achievement of the clinical skills required to fulfil the role of Advanced practitioner.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSteve BoagJob titleAHP OP Therapies ManagerEmail addressStephen.Boag@mft.nhs.ukTelephone number0161 217 3316/3092Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Alison Ahamed&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Operational and Professional Physiotherapy lead&lt;/p&gt;\n&lt;p&gt;Physiotherapy Department&lt;/p&gt;\n&lt;p&gt;North Manchester Care Organisation&lt;/p&gt;\n&lt;p&gt;Part of the Northern Care Alliance NHS Group&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Tel: 0161 720 2423 (Internal Ext 42423)&lt;/p&gt;\n&lt;p&gt;email: Alison.Ahamed@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nick Sutton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Community MSK Tier 2 and Physiotherapy Manager&lt;/p&gt;\n&lt;p&gt;Longsight Health Centre&lt;/p&gt;\n&lt;p&gt;526-528 Stockport Road&lt;/p&gt;\n&lt;p&gt;Longsight&lt;/p&gt;\n&lt;p&gt;M160RR&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Tel: 0161 248 1214&lt;/p&gt;\n&lt;p&gt;email: Nicholas.Sutton@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Trainee Advanced Musculoskeletal Clinical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249459", "validThrough": "2020-11-09T23:59:59+0000"}