{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40150", "minValue": "40150", "unitText": "YEAR", "value": "£40,150 includes London weighting allowance"}}, "datePosted": "2020-10-22T14:18:41+0100", "description": "&lt;p&gt;&lt;strong&gt;Policy Manager - NHS Clinical Commissioners&lt;/strong&gt; &lt;br /&gt;&lt;strong&gt;Location:&lt;/strong&gt; Central London/with home working initially &lt;br /&gt;&lt;strong&gt;Salary:&lt;/strong&gt; £40,150 (includes London weighting)&lt;br /&gt;&lt;strong&gt;Role:&lt;/strong&gt; Full time (permanent) secondments will be considered (we also have a flexible working policy)&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you seeking a new challenge in the health and care policy world?&lt;/li&gt;\n&lt;li&gt;Do you want to help change the NHS for the better?&lt;/li&gt;\n&lt;li&gt;At this critical time, NHS bodies need a strong voice to make real change for the future.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As the newest member of the NHSCC team, you would play a key role in advocating and influencing on behalf of clinical commissioners so they can secure the best possible healthcare and health outcomes for their communities and patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the NHS Confederation and NHS Clinical Commisioners&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Clinical Commissioners (NHSCC) is the independent collective voice of clinical commissioners. We give CCGs (clinical commissioning groups) a strong influencing voice from the frontline to the wider NHS, national bodies, government, parliament and the media – ensuring that the views of local CCG leaders are represented and heard at a national level. We facilitate learning opportunities where CCGs can share their experience and expertise; and we provide information, support, tools and resources to help CCGs do their job better.&lt;/p&gt;\n&lt;p&gt;NHSCC is part of the NHS Confederation, the charity that is the membership body that brings together and speaks on behalf of organisations that plan, commission and provide NHS services in England, Northern Ireland and Wales.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced, enthusiastic and proactive policy professional to join our small but effective team as Policy Manager. You will need to be great at listening to and gathering the views of our members across England, facilitating the sharing of best practice between them as well as influencing national stakeholders including NHS England and government on their behalf. Building and maintaining relationships will be a key part of this role as you will manage a wide range of existing and prospective partnerships and have regular, direct contact with NHSCC’s active and committed member CCGs. &lt;br /&gt;Your responsibilities will include: managing a range of projects – some with partner organisations - on key policy areas affecting our members; delivering policy briefings, articles, roundtables and consultation responses to benefit our members, and using them to influence national policy; managing key stakeholder relationships; providing expert policy input to inform our press work; working closely with our Board to agree our strategy; and representing NHSCC at national events.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate excellent project and programme management skills, excellent written and analytical skills, an ability to digest content quickly, and excellent interpersonal skills. Prior knowledge or experience of the NHS – working for or within it – is essential, and you will also have an understanding of current NHS commissioning policy and/or previous experience of working with CCGs.&lt;/p&gt;\n&lt;p&gt;NHSCC is a small team and while you will have some administrative support you will be responsible for the day to day running of your projects, particularly in regard to policy development, analysing information, delivering events and reporting on progress to the NHSCC Board and senior executive team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To apply:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this role pleaseread the job description and complete the application form. Your covering letter must outline how your skills and experience meet the criteria outlined in the person specification for this role. CV applications alone will not be accepted.&lt;/p&gt;\n&lt;p&gt;NHS Confederation welcomes all applicants from all backgrounds and is committed to recruiting the best person for the job through a process that is fair, open, consistent, and free from discrimination. We believe it is essential to build a diverse and inclusive company culture where all employees feel valued, respected, and acknowledged.&lt;/p&gt;\n&lt;p&gt;The NHS Confederation is committed to being a flexible employer. We understand the value and benefit to our employees being able to work flexibly to respond to changing circumstances and we want to ensure we do as much as possible to help support a work life balance and take care of employee health and wellbeing.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Application deadline:&lt;/strong&gt; 10th November 2020&lt;br /&gt;&lt;strong&gt;Interview Date:&lt;/strong&gt; 19th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Confederation", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW1H 0DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5", "longitude": "-.133449"}}, "title": "Policy Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238860", "validThrough": "2020-11-10T23:59:59+0000"}