{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18000", "unitText": "YEAR", "value": "18,000 to 19,337"}}, "datePosted": "2020-11-05T15:56:51+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Driver Administrator – Out of Hours Service Night Shifts&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;br /&gt;Competitive salary&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;br /&gt;Ormskirk, Lancashire&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a thoughtful and caring individual with strong customer service skills and a full driving licence based in the &lt;em&gt;West Lancashire&lt;/em&gt; area? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Valued&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Driver Administrator you will receive a spot salary and you’ll benefit from:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Virgin Care’s Group Pension&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;25 days holiday plus Bank Holidays&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;We will offer a combination of in house eLearning, workshops and courses to support your development&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Virgin Tribe – granting you access to premier offers and discounts on Virgin Products such as holidays&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to a central online health and lifestyle platform supporting you, your wellbeing and your physical and mental health&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;&lt;span&gt;Feel Proud&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;Working within the Urgent Care Out of Hours team, you will drive GP’s for domiciliary visits for the GP Out of Hours Service on a rota basis. You will take phone calls from medical organisations; hospitals, NHS111, GP Surgeries and take down information and update patient records. You will then relay information to on call GP’s ensuring a professional manner is kept at all times. You may also talk directly to patients to arrange a visit. This service runs 365 days per year. We are looking for people to cover predominantly night shifts and weekends.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a confident driver with a clean licence. You will have outstanding customer service skills and the ability to remain calm under pressure or when dealing with sensitive situations. You will be a clear communicator and have the ability to follow strict processes.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;&lt;span&gt;Feel the Difference&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;If you’d like to discuss the role further, or request the full job description, please contact Maureen Riley via email: Maureen.Riley&lt;em&gt;@virgincare.co.uk&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;We partner with the NHS to make a real difference for our service users and colleagues. It’s the kind of place where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care.&lt;br /&gt;&lt;br /&gt;Part of the Virgin Group, we’ve delivered services to millions of people since 2006 by developing our own unique approach where our service users are at the centre of everything we do. We do things differently, but we’re proud to be part of the NHS family – providing care that’s free at the point of use.&lt;br /&gt;&lt;br /&gt;We’re really privileged that Sir Richard Branson, who ultimately owns the organisation, has invested more than £60m into our partnerships with the NHS (over and above what we’re paid by them), helping us to make real changes and he has pledged to reinvest his future profits back into NHS services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ormskirk", "postalCode": "L39 1PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5702", "longitude": "-2.88636"}}, "title": "Driver &amp; Call Handler - Night shifts", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258444", "validThrough": "2020-11-19T23:59:59+0000"}