{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-03T15:46:48+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 4 Patient Pathway Coordinator (CAT 2 - Ophthalmology)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Ophthalmology Department is seeking a passionate, enthusiastic, reliable and hardworking individual to join our team as a Patient Pathway Coordinator leading our Medical Retina and Vitreo-Retinal POD cross-site.&lt;/p&gt;\n&lt;p&gt;We are looking for an excellent and proactive team leader who can offer commitment in providing support to clinical and non-clinical staff. The ideal candidate will have strong customer service skills and be willing to multi-task under challenging conditions and have the ability to supervise and delegate work to those within their team.&lt;/p&gt;\n&lt;p&gt;You will be the point of contact for all administrative issues relating to patients&#39; pathway of care, working as part of a multi-disciplinary team and will provide expertise in the proactive management of the patient pathway from referral to discharge, ensuring the entire pathway is managed smoothly.&lt;/p&gt;\n&lt;p&gt;You will supervise and allocate work to a small team of administrators, as well as deputise for the Deputy Patient Pathway Manager (DPPM) when needed.&lt;/p&gt;\n&lt;p&gt;You will provide a consistent approach across the Trust, using Standard Operating Procedures (SOPs) to ensure that functions of the role are carried out correctly within given timescales.&lt;/p&gt;\n&lt;p&gt;The Ophthalmology team is committed to providing our colleagues with a positive experience assisting them to build fulfilling and rewarding careers.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the Ophthalmology Department as we move towards more digital ways of working, including virtual clinics and assessment.&lt;/p&gt;\n&lt;p&gt;We are also able to offer flexibility in working from either of the 2 main Ophthalmology hubs at Reading and Windsor, as well as working from home on rotation.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gary Morgan (Patient Pathway Manager) on 0118 322 7884 or 07909 906337 or gary.morgan@royalberkshire.nhs.uk or Chris Best (Ophthalmology Service Manager) on 0118 322 7884 or 07391 411389 christopher.best@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Patient Pathway Coordinator (CAT 2 - Ophthalmology)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254639", "validThrough": "2020-11-21T23:59:59+0000"}