{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "See job description"}}, "datePosted": "2020-11-06T13:57:46+0000", "description": "&lt;p&gt;At Chesterfield Royal Hospital NHS Foundation Trust we are PROUD TO CARE, not only for our patients and visitors but also for our staff. Nestled in the heart of Derbyshire, Chesterfield is a market town famed for its Crooked Spire.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As North Derbyshire&#39;s only acute district general hospital, with 24 hour Emergency Department services, we&#39;re responsible for providing care and treatment to more than 400,000 people who live in our communities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Would you like first choice of shifts at a Trust Rated ‘Good’ overall and ‘Excellent’ for End of Life Care by the CQC?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Chesterfield Royal Hospital NHS Foundation Trust has a rich tradition of developing nursing practice and delivering excellent patient care. We have a number of regular shifts available in these wards:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute General Nursing&lt;/li&gt;\n&lt;li&gt;ITU/HDU&lt;/li&gt;\n&lt;li&gt;Emergency Department&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5 Pay Rates:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Days: £13.79&lt;/p&gt;\n&lt;p&gt;Nights/Saturdays: £17.93&lt;/p&gt;\n&lt;p&gt;Sundays/Bank Holidays: £22.07&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Incentivised pay rates are available. Please email CRH@nhsprfessionals.nhs.uk for more information. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return for your hard work and commitment, NHSP can offer you some fantastic benefits: –&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates&lt;/li&gt;\n&lt;li&gt;First choice of shifts at your Trust – Access to shifts before they are available to agency&lt;/li&gt;\n&lt;li&gt;Flexible working to suit your lifestyle – Take control of when you want to work&lt;/li&gt;\n&lt;li&gt;Build holiday allowance for every shift you work&lt;/li&gt;\n&lt;li&gt;Book and manage your shifts on the go – Access shifts anywhere, anytime online or through your smartphone&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days – Call us anytime on 03332 407 552&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Would you also like the opportunity to be able to access additional shifts in multiple neighbouring Trusts across South Yorkshire and North Derbyshire, with award winning departments and specialisms, allowing you to work flexibly, when it suits your lifestyle?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;By Joining NHS Professionals staff bank, through one of the Working Together Trusts, you can get access to Bankshare®, meaning you can work flexibly without having to complete any additional employment checks, across 5 multi-award-winning Trusts:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Barnsley Hospital NHS Foundation Trust&lt;/li&gt;\n&lt;li&gt;Chesterfield Royal Hospital NHS Foundation Trust&lt;/li&gt;\n&lt;li&gt;Doncaster &amp; Bassetlaw Teaching Hospitals NHS Foundation Trust&lt;/li&gt;\n&lt;li&gt;Sheffield Children’s NHS Foundation Trust&lt;/li&gt;\n&lt;li&gt;Sheffield Teaching Hospitals NHS Foundation Trust&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Skills/Responsibilities &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have a minimum of 6 months paid experience at Band 5 level in an acute hospital environment within the last 2 years&lt;/li&gt;\n&lt;li&gt;Comply with NMC Professional Registration and keep up to date with current nursing practices&lt;/li&gt;\n&lt;li&gt;Undertake nursing assessment and evaluation to enable development of appropriate plans of care based on the needs of the individual&lt;/li&gt;\n&lt;li&gt;Be proficient in the delivery of care to patients&lt;/li&gt;\n&lt;li&gt;Ensure safe administration of drugs in accordance with NMC and CHS policies&lt;/li&gt;\n&lt;li&gt;Ensure accurate records are kept in accordance with CHS policy and NMC guidelines&lt;/li&gt;\n&lt;li&gt;Carry out nursing procedures and techniques in accordance with agreed policies and standards&lt;/li&gt;\n&lt;li&gt;Undertake regular mandatory training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information on the role or details on how to join NHS Professionals, simply contact Chelsie Nussey, Bank Recruitment Coordinator, on 01246 516473 or email CRH@nhsprfessionals.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chesterfield", "postalCode": "S44 5BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2362", "longitude": "-1.40008"}}, "title": "Registered Nurse - General", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260003", "validThrough": "2020-11-20T23:59:59+0000"}