{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34750", "minValue": "34750", "unitText": "YEAR", "value": "£34,750"}}, "datePosted": "2020-11-06T14:28:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Social Worker, ASD &amp; Learning Disabilities Division&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Northampton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary £34,750&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Full-time 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at St Andrew’s Healthcare&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re the UK’s largest independent provider of NHS services, a unique mental health charity aspiring to deliver truly world-class care. Our focus is transforming lives through ground breaking treatment and rehabilitation, with surpluses re-invested in our outstanding facilities. You’ll find a welcoming, inclusive culture here, inspired by the shared values of our team. Everyone has their part to play in the amazing work we do – you’ll have every opportunity to get what you want from your career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your role with us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has come up for a position within the Social Work Service at St Andrew’s Healthcare - a Senior Social Worker post within our ASD and Learning Disability Division.&lt;/p&gt;\n&lt;p&gt;As part of our move to Divisions we have established a new structure on our Northampton site that retains a clinically led approach, recognises our specialist areas of clinical expertise, has business units that are large enough to enable resources to be moved where they are needed, strengthens the nursing voice and reduces layers of management.&lt;/p&gt;\n&lt;p&gt;St Andrew’s ASD and Learning Disability Division seeks to improve the quality of life and reduce risk, in the least restrictive way possible, for individuals with a learning disability and/or ASD often with complex presentations. We provide assessment, resulting in a comprehensive formulation that informs the development and implementation of personalised, evidence based therapeutic interventions. Care is delivered across several facilities in Northampton, ranging from Medium Secure, Low Secure and non-secure rehabilitation services.&lt;/p&gt;\n&lt;p&gt;The learning Disability part of the Division works with adults with mild to moderate learning disabilities and/or other neuro‐developmental disorders who have offended or engage in challenging behaviours. Both Pathways provides a range of adapted treatment and offence related programme(s).&lt;/p&gt;\n&lt;p&gt;Staffing in both the LD and ASD pathways consists of a full Multi-disciplinary team which includes specialists in Learning Disability and Autism. All staff undertake specialist foundation training in Learning Disability Awareness as well as Autism Awareness with some staff extended their qualifications in to specific areas of specialism.&lt;/p&gt;\n&lt;p&gt;You will have a recognised Social Work Qualification and post-qualifying social work award.  You will have extensive experience of working in Mental Health and Mental Capacity Legislation; as well as Safeguarding Adults Legislation and practice. Detailed knowledge and experience of working under pressure with complex legal issues is essential.&lt;/p&gt;\n&lt;p&gt;Proven supervision skills, good communication and interpersonal skills and high standards of report writing will be required.  There is an expectation that the post holder will seek to develop their skills in their specialist area. There is an expectation that the post holder will also hold a full case load including some extremely complex and high risk cases.&lt;/p&gt;\n&lt;p&gt;St Andrew’s Healthcare Social Workers must be registered with Social Work England and there will be opportunities for training to ensure registration.  In addition, there will be regular supervision, an annual performance review and opportunities for development.  You will also be expected to provide clinical supervision to less experienced members of the Social Work Team.&lt;/p&gt;\n&lt;p&gt;“Our patients and your colleagues will expect you to live the St Andrew’s CARE values of Compassion, Accountability, Respect and Excellence every single day.”&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rewards&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer an excellent benefits package including:&lt;/p&gt;\n&lt;p&gt;·       Pension&lt;/p&gt;\n&lt;p&gt;·       Sickness policy on par with the NHS&lt;/p&gt;\n&lt;p&gt;·       35 days annual leave, increasing to 41 after 10 years&#39; service&lt;/p&gt;\n&lt;p&gt;·       Life cover&lt;/p&gt;\n&lt;p&gt;·       Car lease scheme&lt;/p&gt;\n&lt;p&gt;·       Cycle to work scheme&lt;/p&gt;\n&lt;p&gt;·       Healthcare cash plan&lt;/p&gt;\n&lt;p&gt;·       Free parking&lt;/p&gt;\n&lt;p&gt;·       Paid DBS application&lt;/p&gt;\n&lt;p&gt;·       Access to free vocational qualifications&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for applications: 19th November&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 25th November &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton", "postalCode": "NN1 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2382", "longitude": "-.873687"}}, "title": "Senior Social Worker, ASD/LD Division", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260115", "validThrough": "2020-11-19T23:59:59+0000"}