{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-23T15:00:42+0100", "description": "&lt;p&gt;&lt;strong&gt;Service/Ward/Department Summary:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an appropriately experienced and skilled Learning Disability Practitioner to lead the Children&#39;s Learning Disability Team in Oldham.&lt;/p&gt;\n&lt;p&gt;Oldham Children&#39;s Learning Disability Team works with children and young people with a learning disability up to the age of 18. We deliver high quality health and behaviour assessments and interventions to children and young people with complex and challenging needs. The team is currently located at Oldham Civic Centre . The team works across the borough of Oldham which has a population of approximately 235,000.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Summary:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Managing and leading a small team of nurses to deliver evidence based health and behavioural assessments and interventions to children and young people with learning disabilities who have complex and challenging needs. Ensuring that the Team works with other agencies and disciplines, is person centred, creative and innovative in meeting the health needs of individuals whilst offering support to families and carers.&lt;/p&gt;\n&lt;p&gt;There will be the opportunity to work across a range of settings and with a range of services. There are regular opportunities for continuing professional development and peer supervision with other Learning Disability practitioners&lt;span&gt; working in the Directorate.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities of the Post:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Provide supervision and support to the Children&#39;s learning Disability Nurses.&lt;/p&gt;\n&lt;p&gt;To carry a caseload and support children and young people with learning disabilities who exhibit a range of challenging behaviours, which may include verbal and/or physical aggression.&lt;/p&gt;\n&lt;p&gt;To provide a safe, effective, responsive, efficient, timely, community nursing service to children and young people with learning disabilities, their families and carers.&lt;/p&gt;\n&lt;p&gt;To undertake a range of assessments to children and young people with a learning disability and complex needs. This assessment work requires a specialist knowledge base on which to practice.&lt;/p&gt;\n&lt;p&gt;To develop a range of person centred specialist interventions and care plans to meet the needs of children and young people with a learning disability&lt;/p&gt;\n&lt;p&gt;To evaluate implemented interventions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Requirements of the Person Specification:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;RNLD, DiPSW or Clinical Psychology Doctorate&lt;/p&gt;\n&lt;p&gt;For nurse or social worker Masters level training in health related topic &lt;strong&gt;or&lt;/strong&gt; experience to masters level&lt;/p&gt;\n&lt;p&gt;Substantial community experience in supporting children and/or young people with highly complex &amp; challenging needs&lt;/p&gt;\n&lt;p&gt;Experienced in delivering a wide range of training &amp; development opportunities&lt;/p&gt;\n&lt;p&gt;Knowledge of government and national policies and guidelines pertinent to working with client group&lt;/p&gt;\n&lt;p&gt;Experience of providing supervision and support to staff&lt;/p&gt;\n&lt;p&gt;Commitment to multi-disciplinary and multi-agency working&lt;/p&gt;\n&lt;p&gt;Highly developed communication skills to support a range of activities&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: John King&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Team Manager&lt;/p&gt;\n&lt;p&gt;Email address: johnking@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0161 770 2920&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Pennine Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120956"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oldham Civic Centre, Oldham", "postalCode": "OL1 1UT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5423", "longitude": "-2.11722"}}, "title": "Team Leader for Children’s Learning Disability Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241029", "validThrough": "2020-11-06T23:59:59+0000"}