{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-30T11:31:56+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Support Time &amp; Recovery (STR) Worker&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be entrusted to provide support to adults and children when they come into contact with the criminal justice system, working alongside Criminal Justice Liaison and Diversion practitioners, as part of our team.&lt;/p&gt;\n&lt;p&gt;With a reputation for excellence, our service is committed to improving the health of our clients, identifying care pathways and reducing reoffending. Recognised with a number of awards, including a Thames Valley Police Commendation, Berkshire Healthcare ‘Team of the Year’ and achieving runner-up and subsequently a commendation for the Howard League for Penal Reform ‘Liaison and Diversion Service of the Year’, we have expanded provision across the Thames Valley, meeting the needs of vulnerable people of all ages within the criminal justice system.&lt;/p&gt;\n&lt;p&gt;At Berkshire Healthcare we value our employees and put people first. We have just been recognised with a ‘Good’ rating overall, and as an ‘Outstanding’, well-led, organisation in our latest CQC inspection, which found that: ‘Managers across Berkshire Healthcare promoted a positive culture that supported and valued staff, creating a sense of common purpose based on shared values.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth with opportunities to help you to build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;With an NVQ level 3 in Health &amp; Social Care or equivalent and relevant training to diploma level, you will have a warm personality, and good communication and people skills. With knowledge of the Liaison and Diversion agenda, you will collaborate with our team, building professional and supportive relationships. Supporting clients who are typically hard to engage, you will talk to families and friends, to gain a holistic understanding of the client’s circumstances and facilitate their access to support services, providing individualised support with practical problems or difficulties that may be affecting their health and wellbeing, providing help and advice on housing, social isolation and exclusion, education, debt management and employment problems. Eager to improve supported access to services, you will engage with community services and agencies. An empathetic advocate of service users, you will promote their rights and responsibilities, building a rapport, whilst maintaining appropriate and transparent boundaries. You will be emotionally resilient, able to cope with people displaying challenging behaviour and distressing situations. Working flexibly, visiting custody suites, magistrates’ courts and other locations in the community, you will enjoy travelling across multiple sites and have access to your own car. Your energy and drive will be rewarded with the support of a dedicated team that strives to create a progressive, compassionate and innovative environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to contact Pauline O’Callaghan on 07584385403 pauline.ocallaghan@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to our salary car scheme and as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO15 2AJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9127", "longitude": "-1.4028"}}, "title": "Support Time &amp; Recovery (STR) Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249966", "validThrough": "2020-11-08T23:59:59+0000"}