{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pa pro rata"}}, "datePosted": "2020-11-03T13:00:34+0000", "description": "&lt;p&gt;We are looking for a nursing assistant to join our dedicated nursing team. We are a versatile team who provide patient focused, high quality nursing care and associated duties to two extremely busy departments. We have one position available of 30 hours per week over 4 to 5 days subject to service requirements.&lt;/p&gt;\n&lt;p&gt;Ideally experience in either area would be beneficial; however there is a full competency and training programme in place for new starters. You will need to demonstrate high levels of communication skills and that you are a committed team player. To help maintain patient flow and the workload, effective time management and organisational skills are crucial. There are opportunities for continuing professional development and learning in a thriving multidisciplinary environment.&lt;/p&gt;\n&lt;p&gt;The individual will be expected to rotate between Endoscopy and Radiology depending on service needs. To help understand this unique and challenging role, you are advised and encouraged to contact us for an informal discussion or to arrange a visit.&lt;/p&gt;\n&lt;p&gt;Please Contact Sr Lisa Phillips or Sr Marizel Baluyot on extension 4386 for further information or to arrange a site visit.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120765.jpg", "name": "Salisbury NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120765"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salisbury NHS Foundation Trust, Salisbury", "postalCode": "SP2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0439", "longitude": "-1.78981"}}, "title": "Nursing Assistant - Endoscopy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254074", "validThrough": "2020-11-17T23:59:59+0000"}