{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Up to Band 6 (depending on experience)"}}, "datePosted": "2020-11-04T09:03:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Position: College Nurse / Learning Disability Nurse –RGN, RLDN/RN&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:Lufton College,Yeovil, Somerset, BA22 8ST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: School hour working options including term time working, will be reviewed per application&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Up to Band 6 (depending on experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This an exciting opportunity to be part of a dynamic team to support the change and reinvigoration of Cambian Lufton College. An exciting new opportunity has arisen for a College Nurse to work along site the onsite clinical team and be part of the new leadership team which has a clear vision for growth and positive change.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Cambian Lufton College&lt;/em&gt;&lt;/strong&gt;&lt;em&gt; has a proud and successful tradition of supporting young people between the ages of 16 - 25 to build valuable life skills, qualification and confidence to support them on their journey towards independence. The new leadership team has recognized this success and wants to offer this opportunity to a wider range of young people alongside the developments that are taking place across all aspects of the college&lt;/em&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The College prides itself on offering meaningful packages of education to those who have in the past struggled to access conventional mainstream services; offering each young person and adult an individually tailored and holistic programme of support, equipping them to face the challenges of later life.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The College Nurse is an integral part of the young person’s educational journey, ensuring that all aspects of their physical health needs are met to the highest standard, in collaboration with external General Practitioners, Paediatricians, and other health care professionals. The role includes writing reports, attending reviews, implementing evidenced-based care plans, medication management, delivery of workshops for best practices, face to face support and advocating for the students and liaising with families, professionals and Local Authorities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidate Profile&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Candidates for this position should be RGN/RLDN/RNC qualified with a current NMC PIN number.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You should have a strong understanding of Asperger’s and Autism and have experience of working with these conditions.&lt;/li&gt;\n&lt;li&gt;Working knowledge of physical health conditions, including Epilepsy, Diabetes, Anaphylaxis.&lt;/li&gt;\n&lt;li&gt;Knowledge around Safeguarding and keeping others safe.&lt;/li&gt;\n&lt;li&gt;Excellent understanding of safe and effective medication management within children’s homes/schools.&lt;/li&gt;\n&lt;li&gt;Ability to communicate clearly to others using a variety of platforms including nonverbal communication&lt;/li&gt;\n&lt;li&gt;Experience in working/promoting therapeutic relationships with children and Young People&lt;/li&gt;\n&lt;li&gt;Working autonomously within a residential/ward environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of communicating clearly to others using a variety of platforms including nonverbal communication.&lt;/li&gt;\n&lt;li&gt;Experience of engaging successfully with children or young adults (in particular those with special needs) in some capacity.&lt;/li&gt;\n&lt;li&gt;Ability to be flexible with hours, required to assist with the effective quality of care in the school.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full support from a multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Regular clinical supervision&lt;/li&gt;\n&lt;li&gt;Developmental opportunities&lt;/li&gt;\n&lt;li&gt;Research opportunities &amp; support&lt;/li&gt;\n&lt;li&gt;Internal/external training on new initiatives&lt;/li&gt;\n&lt;li&gt;25 days annual leave plus bank holidays (with increments for length of service included)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Full induction training is given. You will also learn from some of the most dedicated and inspirational people in our profession and just like our young people you will be learning all the time through our ongoing mentoring and support.&lt;/p&gt;\n&lt;p&gt;Successful candidates will have to meet the person specification in order to be offered this post and will be subject to an enhanced DBScheck.&lt;/p&gt;\n&lt;p&gt;Cambian is an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130935.png", "name": "Cambian Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Yeovil, Somerset", "postalCode": "BA22 8ST"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9493", "longitude": "-2.68646"}}, "title": "College Nurse – RGN, RSCN- Lufton College", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255143", "validThrough": "2020-11-29T23:59:59+0000"}