{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 per annum"}}, "datePosted": "2020-11-03T13:16:33+0000", "description": "&lt;p&gt;Surrey &amp; Sussex Healthcare NHS Trust are seeking to appoint a Clinical Fellow in Internal Medicine at middle grade level (ST3 or above) for a period of 1 year. The post would ideally suit a post-CMT level doctor, for example one who has achieved PACES and wishes to gain further medical experience and skills before considering their next career move, or one who has Part 1 and 2 Membership examination and is studying for PACES.&lt;/p&gt;\n&lt;p&gt;This innovative post brings together educational opportunities, specialist experience and the delivery of enhanced continuity of care and seven day services for our patients. Our hope is to inspire the next generation of specialist physicians.&lt;/p&gt;\n&lt;p&gt;The successful applicant has the unique opportunity to gain a Postgraduate Certificate in Internal Medicine during the appointment, with full funding from HEE- KSS and protected research time. This qualification assures 60 credits towards the 180 credits required for the Masters degree in Internal Medicine developed at Brighton and Sussex Medical School. The post also provides additional opportunities for CV enhancement by participation in national and local audit, quality improvement and clinical research projects.&lt;/p&gt;\n&lt;p&gt;We are looking for applicants with experience in General Internal Medicine at CMT or equivalent level. They should possess the abilities and professional skills to work well in a multi-professional team environment. The post-holder will have designated educational supervisors and JRCPTB e-Portfolio access for completion of formative and summative SLEs and curriculum.&lt;/p&gt;\n&lt;p&gt;The post-holder will participate in ward rounds and post-take rounds as required and provide support to the wards as necessary.&lt;/p&gt;\n&lt;p&gt;The General Internal Medical Team includes three specialist middle grade doctors, six Junior equivalents and two FY1s.&lt;/p&gt;\n&lt;p&gt;The post-holder will provide a 1 in 4 weekend on-call ward cover service to the general internal medicine wards including Capel Annex (A 20 bed general internal medicine ward with special interest in diabetes, endocrinology and vascular medicine) along with three other doctors from the team, supervised by a Consultant Physician. This would include reviewing unwell patients or those marked for a weekend review, and also potential discharges. There will be no other on-call commitments although opportunities to do on-call shifts will be available as a member of our bank if required.&lt;/p&gt;\n&lt;p&gt;The post-holder will participate in two specialty clinics per week with full supervision by the Consultants. These can be within internal medicine or elderly care, and are subject to the candidates interests, and also availability of the specialist clinic.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Prospective candidates are encouraged to email in the first instance.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact the Rheumatology/General Medicine team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Ursula Davies ursula.davies2@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Veqas Ziauddin (&lt;/strong&gt;&lt;strong&gt;Veqas.Ziauddin@nhs.net&lt;/strong&gt;&lt;strong&gt;) Extension 2488/1337&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Veqas Ziauddin (Veqas.Ziauddin@nhs.net) Extension 2488/1337Job titleConsultant in General MedicineEmail addressVeqas.Ziauddin@nhs.netTelephone number01737 768511 ext 2488/1337&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview Date: 19.11.20&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Surrey Hospital, Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Clinical Fellow in Internal Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254124", "validThrough": "2020-11-16T23:59:59+0000"}