{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737-£21,142 per annum"}}, "datePosted": "2020-11-04T13:46:01+0000", "description": "&lt;p&gt;We are looking to recruit two highly motivated and enthusiastic Band 3 Therapy Assistants to join our friendly, dedicated and dynamic inpatient therapy team. You will be working in rehabilitation across physiotherapy and occupational therapy. We treat people with a wide range of conditions, primarily in orthopaedics, frailty and neurology.&lt;/p&gt;\n&lt;p&gt;The service covers four hospitals/intermediate care units; Bognor Regis War Memorial Hospital, Zachary Merton Hospital, Salvington Lodge and Arundel Hospital. These post are for Salvington Lodge and Bognor ICUs, and you will occasionally be expected to work at the other sites.&lt;/p&gt;\n&lt;p&gt;The post can be full time or part time and the service covers six/seven days a week.&lt;/p&gt;\n&lt;p&gt;As a member of the team you will have the opportunity to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Receive support from other therapy colleagues&lt;/li&gt;\n&lt;li&gt;Receive clinical supervision from registered therapists&lt;/li&gt;\n&lt;li&gt;Participate in the in-service learning programme&lt;/li&gt;\n&lt;li&gt;Develop your practice, relevant to the team&lt;/li&gt;\n&lt;li&gt;Participate in competency development through the Calderdale Framework&lt;/li&gt;\n&lt;li&gt;Support development of other staff outside of your professional group&lt;/li&gt;\n&lt;li&gt;Assist in shaping the future clinical practice of the therapy team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The service is continually developing and improving to meet the needs of our patients and commissioners.&lt;/p&gt;\n&lt;p&gt;We are looking for candidates who like working with people and are reliable, flexible and adaptable in their work. Previous experience as a therapy assistant or similar is desirable. Our ideal candidates will enjoy problem solving, have excellent communication skills, and want to work on the wards within a supportive multidisciplinary team, helping to implement timely and person-centred assessments and rehabilitation.&lt;/p&gt;\n&lt;p&gt;Applicants should have experience of delivering care and/or rehabilitation to older people with various needs.&lt;/p&gt;\n&lt;p&gt;The post holders will be required to support service developments and show flexibility when adapting to change.&lt;/p&gt;\n&lt;p&gt;The successful candidates will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist the physiotherapy and occupational therapy staff in the treatment of specific patients&lt;/li&gt;\n&lt;li&gt;Have their own delegated patient caseload and clinical duties&lt;/li&gt;\n&lt;li&gt;Supervise exercise programmes and practise activities of daily living under the guidance of a therapist&lt;/li&gt;\n&lt;li&gt;Assess and treat patients according to protocols, monitoring their progression and making minor alterations to their treatment programmes as required&lt;/li&gt;\n&lt;li&gt;Work without direct supervision, reporting back patient progress and informing the therapist of any problems&lt;/li&gt;\n&lt;li&gt;Prepare and keep treatment areas and equipment clean and tidy&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Full driving licence and access to a car for work are required.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Katie Myers- Operational Team Lead&lt;/p&gt;\n&lt;p&gt;K.myers@nhs.net&lt;/p&gt;\n&lt;p&gt;07825 385433&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bognor Regis War Memorial Hospital, Salvington Lodge ICUs, Bognor Regis, Worthing", "postalCode": "BN13 3BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8425", "longitude": "-.410197"}}, "title": "Therapy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256052", "validThrough": "2020-11-15T23:59:59+0000"}