{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-04T16:16:33+0000", "description": "&lt;p&gt;&lt;strong&gt;Nottinghamshire Healthcare NHS Foundation Trust. Honesty, Compassion, Trust, Respect, Teamwork&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Nottinghamshire Healthcare Foundation Trust provides high quality mental health, learning disability, High Medium and Low secure services, and community health services. Our vision is for a happier and more hopeful life for everyone in the communities we serve. Our 9,800 dedicated staff have big ambitions and we are at the start of an exciting journey to reshape our organisation, focussing on what we do best and building on our roots in our diverse communities to maximise people’s potential.&lt;/p&gt;\n&lt;p&gt;We have recently redesigned our senior leadership structure to strengthen our collective leadership and as part of the redesign we have established a number of new roles working within the Trust’s Corporate Senior Nursing team including Trust Lead for Reducing Restrictive Interventions.&lt;/p&gt;\n&lt;p&gt;You will be a highly visible, proactive and compassionate clinical leader with extensive clinical leadership experience. Acting as a role model and clinical resource, you will ensure the sustained delivery of high standards of nursing care and service delivery and have service user and carer Involvement at the heart of everything you do.&lt;/p&gt;\n&lt;p&gt;You will have an expert knowledge of reducing restrictive practice and a proven record in improving patient safety, patient experience and clinical effectiveness.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to bring your leadership experience to a value-based organisation with big ambitions for those we serve.&lt;/p&gt;\n&lt;p&gt;If this role sounds exciting to you and you have the skills and experience described as well as sharing our values then we would welcome your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact David Mason, Associate Director Nursing, Quality &amp; Patient Experience: Forensic Services on david.mason@nottshc.nhs.uk or 01777 247201&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contactable during office hours&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Duncan MacMillan House, Nottingham", "postalCode": "NG3 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9796", "longitude": "-1.12644"}}, "title": "Trust Lead for Reducing Restrictive Interventions", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256603", "validThrough": "2020-11-18T23:59:59+0000"}