{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 PA"}}, "datePosted": "2020-10-27T09:31:02+0000", "description": "&lt;p&gt;Due to in house progression of existing post holders we are looking for enthusiastic and self-motivated Pharmacy Dispensing Assistants to join our friendly team.&lt;/p&gt;\n&lt;p&gt;We are a large integrated care organisation serving the diverse communities from West Bromwich to Central Birmingham. The Trust includes City Hospital (including the Birmingham Midland Eye Centre), Sandwell Hospital, Rowley Regis Hospital and Leasowes Intermediary Care Centre. We also house a number of community wards on our main sites. There are very good public transport links and our main sites are located near the centre of West Bromwich and Birmingham.&lt;/p&gt;\n&lt;p&gt;Our large department employs over 120 staff delivering high quality clinical pharmacy and medicines optimisation services. You will be an integral part of our team delivering high standards of care in this rotational role including: dispensary, ward, aseptic and home care services. The work will be challenging, varied, interesting and ultimately rewarding. We will support your development with comprehensive training.&lt;/p&gt;\n&lt;p&gt;Applicants must either hold, or currently be working towards a NVQ Level 2 Dispensary Assistant qualification , or currently hold a Community Pharmacy Dispensing qualification.&lt;/p&gt;\n&lt;p&gt;Early/late rotas, weekends and bank holidays will be part of the working week, as will working across all sites of our Trust. Full time 37.5 hours / week.&lt;/p&gt;\n&lt;p&gt;For more information please read the documents linked to this advert. Or to arrange an informal chat, please contact Simon Plant simon.plant@nhs.net.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSimon PlantJob titleChief Technician - Pharmacy OperationsEmail addresssimon.plant@nhs.netTelephone number07866004532Additional contact information&lt;/p&gt;\n&lt;p&gt;Simon Plant, telephone 07866004532, email simon.plant@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell and West Birmingham NHS Trust, Sandwell and West Birmingham", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Pharmacy Dispensing Assistant Technical Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243824", "validThrough": "2020-11-08T23:59:59+0000"}