{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa pro rata"}}, "datePosted": "2020-11-02T13:01:43+0000", "description": "&lt;p&gt;&lt;strong&gt;About the opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role of our organisation is to contract a wide range of health care services which fulfil the varying needs of those in our community. NHS Kernow Clinical Commissioning Group (NHS Kernow) is focusing on the requirements of the entire population in Cornwall and the Isles of Scilly, the aim being to reduce the demand on over-stretched health care services. By being proactive and encouraging and supporting positive health and wellbeing initiatives, we hope to move away from a reactive health care model, with an emphasis being on prevention. This will help to ensure that we can provide the highest quality and safest health and care services, to those who need it most.&lt;/p&gt;\n&lt;p&gt;We are passionate about making a difference to people’s lives, and understanding their needs. With help from volunteers in our local communities, we can empower individuals, giving them a greater choice about when, where, and how they access health services. With feedback from service users, and the knowledge and experience of our clinical experts, NHS Kernow will continue to meet, and strive to exceed national standards and targets.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a dynamic, motivated, forward thinking and experienced nurse leader with evidenced experience, skills and knowledge of Safeguarding? If so, NHS Kernow Clinical Commissioning Group would love to hear from you.&lt;/p&gt;\n&lt;p&gt;This full time role is an exciting opportunity to join the CCG’s Safeguarding Team, and is crucial to the delivery of the broad safeguarding agenda. The role also enables the CCG to meet its statutory duties and the work of the Safeguarding Adults Board in Cornwall and the Isles of Scilly.&lt;/p&gt;\n&lt;p&gt;This is a senior clinical post, setting safeguarding strategy and providing strategic, professional and clinical leadership. The role involves providing expert clinical advice and consultancy to staff, senior managers and governing body members, ensuring that all safeguarding adult standards are met.&lt;/p&gt;\n&lt;p&gt;The successful individual will be an experienced safeguarding professional and able to demonstrate that they are an enthusiastic and forward thinking nurse leader with the necessary skills and knowledge of safeguarding adults to drive, assure and improve standards and engage all relevant partners in the city.&lt;/p&gt;\n&lt;p&gt;This is a substantive post which we are considering trialling as a based from home to encourage candidates from out of county who might not otherwise apply. We are happy to consider candidates who to apply for this substantively or as a secondment opportunity to test this new way of working with us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful applicant will live NHS Kernow’s values through their everyday behaviours and interactions. You will believe in being honest and will support your colleagues and our providers, to make the best decisions and choices for the benefit of people’s health and wellbeing. You will encourage and listen to other people’s ideas and suggestions with an enquiring and positive mind, expecting to hear feedback, and taking it in the spirit of learning and improving.&lt;/p&gt;\n&lt;p&gt;You will be an ambassador for NHS Kernow, promoting the importance of improving people’s health and wellbeing, and making sure services are safe and effective, and delivered in ways that improve people’s experiences and outcomes.&lt;/p&gt;\n&lt;p&gt;Our vision is of a future where more people are supported to live the lives they want to in their communities, with the care and support of services that are safe and sustainable for future generations. We will achieve this with compassion, imagination and by building effective relationships and working together.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the NHS &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return you will be part of a system that is pioneering change in the Health Service, and alongside every team member, you will help us to achieve our goals.&lt;/p&gt;\n&lt;p&gt;You can look forward to excellent benefits including discounts in store and online, optional pension and life assurance, flexible working options, salary sacrifice vehicles/ cycles/ child care vouchers, two days pro rata to undertake volunteering, coaching and mentoring opportunities, as well as fantastic opportunities to develop your career.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nikki Thomas, Deputy Director of Quality, nikki.thomas@nhs.net 07554 111 515&lt;/p&gt;\n&lt;p&gt;Rebecca Evans, Mental Capacity Act/ Court of Protection Professional Lead on 07920087595, rebecca.evans33@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128400.jpg", "name": "Kernow Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "WFH/ Cornwall, St Austell", "postalCode": "PL25 5AS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3397", "longitude": "-4.79474"}}, "title": "Safeguarding Adult Lead Nurse/Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252152", "validThrough": "2020-11-08T23:59:59+0000"}