{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum, inc HCA"}}, "datePosted": "2020-11-04T16:30:37+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are currently recruiting full time staff nurses to work in our wards at our Princess Royal University Hospital (and associated sites in Kent), part of King’s College Hospital NHS Foundation Trust. Applications are welcomed from registered nurses and applicants must have experience working in an acute hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We conduct video interviews and have an efficient recruitment process in place so you can start working as soon as possible. We are currently offering full time shift work on a permanent contract. We will endeavour to place you in an area that suits your skills and qualifications, depending on the vacancies of the Trust at the time of your recruitment. You will be provided with the support and training that you need to succeed in your role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are looking for short-term or part-time bank work, please contact Bank Partners who can be contacted on 0333 577 3012-option 1 or email join.kingsbank@bankpartners.co.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interviews will take place at regular intervals and we will contact you to arrange. We may look at applications and contact applicants throughout the duration of the vacancy being live.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Charlie Norval&lt;/p&gt;\n&lt;p&gt;Job title Recruitment Officer&lt;/p&gt;\n&lt;p&gt;Email address c.norval@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital and South Sites, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Staff Nurse – Various Specialties", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256655", "validThrough": "2020-11-18T23:59:59+0000"}