{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7/ESP"}}, "datePosted": "2020-10-21T15:50:25+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Extended Scope Physiotherapist/Band 7/First Contact Physiotherapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dartford, Gravesham and Swanley and other Kent Sites&lt;/p&gt;\n&lt;p&gt;Salary: Band 7/ESP (dependent on experience)&lt;/p&gt;\n&lt;p&gt;If you are an experienced Physiotherapist and are looking for a role which allows you to develop and apply advanced clinical reasoning skills and manage a full range of MSK pathologies, you might be exactly who we&#39;re looking for!&lt;/p&gt;\n&lt;p&gt;Healthshare is a clinically led, independent provider of innovative NHS services working across the country.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join our experienced MSK team. The post is based across in Kent. This is a Physiotherapist led MSK service supported by multidisciplinary consultants.&lt;/p&gt;\n&lt;p&gt;The MSK service includes community orthopedics, Phyiotherapy and first contact physiotherapy. The service consists of professionals with a wide skill mix and is supported by ESP’s, B7 Physiotherapist, Senior Physiotherapists and Clinical Directors.&lt;/p&gt;\n&lt;p&gt;Your application should demonstrate evidence of advance/extended skill or work towards achieving these. This may include experience with advanced physiotherapy skills, investigations, making referrals, injection therapy or ultrasonography. We support training for each of these areas.&lt;/p&gt;\n&lt;p&gt;The right candidate will be expected to deliver a high standard of patient-centred care, possess a friendly and approachable attitude and apply outstanding team-working, communication and organisational skills to your daily practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Like the sound of this job? Don&#39;t miss out &lt;/strong&gt;- apply now!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Healthshare Clinical Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130138"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dartford, Gravesham, Swanley &amp; other Kent sites", "postalCode": "DA3"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3799", "longitude": ".298652"}}, "title": "Band 7/ ESP - First Contact Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237162", "validThrough": "2020-11-18T23:59:59+0000"}