{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum incl HCAS (pro-rata)"}}, "datePosted": "2020-10-28T16:16:19+0000", "description": "&lt;p&gt;We are looking to recruit highly organised, dynamic Clinical Psychologists who are interested in working with children with disabilities and their families. this exciting opportunity is ideal for newly qualified clinical psychologists or for those wanting to develop skills in the field.&lt;/p&gt;\n&lt;p&gt;The post holders will work in Camden MOSAIC. MOSAIC is an integrated, multi-disciplinary, multi-agency service, jointly commissioned by Camden Local Authority and Camden PCT and managed by the Local Authority. MOSAIC has been established to meet the health and mental health needs of children with disabilities and their families.&lt;/p&gt;\n&lt;p&gt;There are a range of opportunities to work in different roles within the Mosaic Service as a CAMHS clinician. The post holders will work in this specialist CAMHS team alongside working in either the CDT (Child Development Team), SCAS ( Social Communication Assessment Service) or Feeding Clinic and take up opportunities to work within schools in Camden where appropriate. These are all multi-disciplinary teams that work to support children with a wide range of disabilities and their families to meet their emotional and psychological needs. The post holder will be well qualified to offer assessment and interventions with children with disabilities and their parents within this multi- disciplinary, multi-agency context.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to join our team of dynamic and highly motivated Clinical Psychologists who engage both in dedicated clinical work and in innovative, cutting edge clinical research within the team. There will also be opportunities to develop skills through continuing professional development and linking with the wider Psychology discipline at the Tavistock and Portman NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Candidates are requested to use the section &quot;Supporting Information&quot; on the&lt;/p&gt;\n&lt;p&gt;application form to set out their reasons for applying and their suitability, referring&lt;/p&gt;\n&lt;p&gt;to the person specification, for this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nancy Sheppard - Consultant Clincial Psychologist&lt;/p&gt;\n&lt;p&gt;Nancysheppard@nhs.net  -  02033172265&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122294.JPG", "name": "Tavistock and Portman NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kentish Town Helath Centre, London", "postalCode": "NW5 2BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5462", "longitude": "-.139952"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247354", "validThrough": "2020-11-11T23:59:59+0000"}