{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-10-13T10:31:51+0100", "description": "&lt;p&gt;Are you interested in working in a beautiful part of the country, in a friendly, dynamic and forward thinking team specialising in the treatment and holistic care of Cancer, Haematology and Palliative care patients from across Cornwall?&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced dietitian to join the Cancer and Palliative Care Team, working 18.75 hrs per week.&lt;/p&gt;\n&lt;p&gt;We are looking for an empathetic and enthusiastic dietitian to help us provide high quality care to patients in both the inpatient and outpatient environment.&lt;/p&gt;\n&lt;p&gt;The team focus on delivering nutrition and dietetic support to patients undergoing cancer treatment and rehabilitation. This is an interesting and rewarding patient group who require a wide range of skills to support them. We work closely with the multidisciplinary team to provide the highest level of dietetic care to patients in Cornwall.&lt;/p&gt;\n&lt;p&gt;To support and enhance our excellent current Cancer Services at the Royal Cornwall Hospital, a Macmillan Cancer Information and Support Centre is now established on site. We have also recently recruited to a fixed term contract for an additional dietitian to support patients attending the Centre. There also a Mobile Chemotherapy Unit delivering care closer to home.&lt;/p&gt;\n&lt;p&gt;Cornwall offers exceptional opportunities to explore the countryside and coast, with a huge variety of activities available letting your career and lifestyle choices come together.&lt;/p&gt;\n&lt;p&gt;Our employees are important to us and we are committed to supporting learning and development to meet the needs of individual, service and Trust objectives.&lt;/p&gt;\n&lt;p&gt;Provisional Interview date: 18th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Susan Ogilvie - Lead Dietitian for Cancer and Palliative Care on Tel: 01872 258326.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Specialist Dietitian in Cancer &amp; Palliative Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223820", "validThrough": "2020-11-08T23:59:59+0000"}