{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 gross per annum"}}, "datePosted": "2020-10-21T10:21:08+0100", "description": "&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Please be advised that due to the COVID 19 Pandemic all roles will initially be required to work remotely from home for the foreseeable future. &lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt; &lt;/span&gt;&lt;/em&gt;&lt;strong&gt;&lt;em&gt;Are you a qualified Psychological Wellbeing Practitioner? If so, read on….. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Suffolk Wellbeing Service is part of the national accredited IAPT initiative. The aim of this is to increase mental health access to those living in Suffolk aged 16 and above who are experiencing mild to moderate levels of anxiety and depression. The service works in conjunction with Norfolk and Suffolk NHS Foundation Trust (NSFT) by providing low and high intensity mental health care to the local population.&lt;/p&gt;\n&lt;p&gt;We are looking for positive, self-motivated and pro-active individuals who are looking to join our service as &lt;strong&gt;Qualified Psychological Wellbeing Practitioners (PWPs)&lt;/strong&gt; in Suffolk. The role of a PWP involves the delivery of low intensity, high volume psychological interventions based on &lt;strong&gt;Cognitive Behavioural Therapy (CBT)&lt;/strong&gt;. To provide for a high number of clients, much of the work is telephone and cCBT-based (Computerised CBT); this will also include delivery of workshops and webinars as a key portion of the role. PWPs work within the stepped care model in accordance with NICE guidelines, working alongside multidisciplinary mental and physical healthcare teams. When assessing clients in the role with more enduring or severe conditions, this may involve referring them to other relevant services.&lt;br /&gt;&lt;br /&gt;This is an opportunity to join a team which offers exemplary services for the population of Suffolk focused around IAPT models of stepped care for our primary care population. The role itself is fast-paced, challenging, and ever-developing with current clinical evidence. Experience of working with client populations with anxiety and/or depression, and also that of managing a personal caseload are desirable. Successful applicants will need to possess and demonstrate a high level of skill in the following areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A commitment to delivering high quality client care.&lt;/li&gt;\n&lt;li&gt;Ability to demonstrate resilience when working with clients that are experiencing varying levels of emotional distress.&lt;/li&gt;\n&lt;li&gt;Able to adapt to change.&lt;/li&gt;\n&lt;li&gt;A positive and solution-focused attitude.&lt;/li&gt;\n&lt;li&gt;Good administration and IT skills.&lt;/li&gt;\n&lt;li&gt;Excellent time management and organisational skills relating to the number of client contacts offered and clinical sessions carried out each week.&lt;/li&gt;\n&lt;li&gt;Capacity to work under pressure.&lt;/li&gt;\n&lt;li&gt;High level of enthusiasm and self-motivation.&lt;/li&gt;\n&lt;li&gt;Ability to work and problem solve independently.&lt;/li&gt;\n&lt;li&gt;Access to a car, or alternative ability to travel independently.&lt;/li&gt;\n&lt;li&gt;Ability to work at any location across Suffolk.&lt;/li&gt;\n&lt;li&gt;Ability to work flexibly, including some evenings.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We can offer you the full range of NHS benefits and in addition: &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt; &lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Financial support with relocation cost&lt;/li&gt;\n&lt;li&gt;Flexible working hours&lt;/li&gt;\n&lt;li&gt;Up to 247 hours holiday entitlement (subject to length of service)&lt;/li&gt;\n&lt;li&gt;FREE physio service&lt;/li&gt;\n&lt;li&gt;FREE Yoga and Pilates&lt;/li&gt;\n&lt;li&gt;Cycle scheme tax-free bikes and accessories&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Support with revalidation&lt;/li&gt;\n&lt;li&gt;Postgraduate training opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;We will pay for your initial DBS check (excluding the annual update service charge of £13)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities. If you feel you have what it takes to make a difference in your local community and wish to join a dynamic service with lots to offer you as a practitioner then we invite your application to the role.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interview dates are yet to be set, candidates may only be given a minimum of 3 days’ notice, please note this date is provisional and may be subject to change. You will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Andy Barton (Clinical Team Leader) Suffolk Wellbeing on 01473 296 184&lt;/p&gt;\n&lt;p&gt;Emma Ransome (Clinical Team Leader) Suffolk Wellbeing on 01284 741600&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Based across Suffolk but currently working remotely from home, this can be considered a permanent option if needed", "postalCode": "IP33 3ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2407", "longitude": ".707966"}}, "title": "Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235843", "validThrough": "2020-11-11T23:59:59+0000"}