{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 plus elements for additional hours, weeken"}}, "datePosted": "2020-11-05T09:45:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an experienced Emergency Medicine Doctor seeking a new opportunity in a beautiful setting? Do you want flexibility and to reach the perfect work-life balance by writing your own rotas? Want to be supported to develop your special interests and be given the time to do so?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Come and join Team NNUH’s expanding Emergency Department as &lt;strong&gt;Senior Clinical Fellow (STR 3+ equivalent).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our rapidly expanding department has over 140,000 attendances per year and our ED footprint includes a purpose-built Children’s and Older People’s Emergency Department, GP front door streaming pods and an all-weather helipad. The ED is set within the Norfolk and Norwich University Hospital, which provides a full range of acute clinical services, with over 1,000 beds.&lt;/p&gt;\n&lt;p&gt;Our team currently consists of 15 consultants and 40 junior doctors who are supported by our team of nurses and the ED operations teams.&lt;/p&gt;\n&lt;p&gt;No two days are the same within our ED, you will be joining a busy and supportive department where you will be encouraged to develop both professionally and personally. Department leads encourage split posts and doctors within their department to seek out the opportunity to develop any special interests they may have inside or away from the Trust; whether it is further education or PAs in different departments, ED will be a fantastic stepping stone for any plans you have for the future.&lt;/p&gt;\n&lt;p&gt;As a university teaching hospital, we have developed our research and development strategy in partnership with the University of East Anglia. We also have strong links with the East Anglian Air Ambulance and have introduced joint pre-hospital roles with them. We treat major trauma cases from Norfolk and the surrounding areas, as we are a designated Trauma Unit and work closely with the Major Trauma Centre at Addenbrookes. The team have aspirations to be a MTC within the next few years.&lt;/p&gt;\n&lt;p&gt;We want to give you autonomy and the opportunity to ensure you have the perfect work-life balance, so we have recently set up an ED Health and Well-Being group to ensure all staff take the time off they need. We are also in the process of introducing a self-rostering system, so staff can set their own rotas to fit in with their personal commitments.&lt;/p&gt;\n&lt;p&gt;This post is part of an expansion of our Junior and Middle grade team of doctors, and is ideal for candidates who are working towards being the senior decision maker in Emergency Medicine, or who are ready to take this responsibility and wish to advance their career in Emergency Medicine.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a full time post initially for a 12-month period but can be extended if mutually agreeable. The position involves working a shift pattern, including night duties. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you would like to become a permanent fixture within our department, substantive posts are possible, we encourage candidates to explore training routes such as CESR.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Basic salary £49,036 plus additional elements for additional hours, weekend and evening working.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For informal enquiries please contact Dr Frank Sutherland, Service Director on 01603 287452.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;or&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Francoise Sheppard francoise.sheppard@nnuh.nhs.uk on 01603 286286&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ED Medical Staff, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Senior Clinical Fellow in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257106", "validThrough": "2020-11-12T23:59:59+0000"}