{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T20:32:39+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to apply for new posts within the Infection Prevention and Control Teams across the region including Bassetlaw, Nottinghamshire County and Nottingham City. The posts will be for a secondment opportunity for 12 months working 37.5 hours per week. The successful candidates will join established highly motivated and proactive teams.&lt;/p&gt;\n&lt;p&gt;Infection prevention and control is an integral part of patient safety and a diverse and challenging area of practice. We are looking to appoint some band 7 and band 6 staff with experience of multidisciplinary working, who are able to demonstrate an interest in infection prevention and control and are keen to develop their knowledge and experience of this specialist area.&lt;/p&gt;\n&lt;p&gt;The teams have been central to the Covid 19 response and this work will continue alongside the other national IPC campaigns. The successful applicants will be accountable to the Head of Infection Prevention and Control in the area in which they choose to work and the role will include supporting the IPCT nurses within those teams, alongside the follow up of patients with infections, outbreak management in care homes and other residential settings and audit and training.&lt;/p&gt;\n&lt;p&gt;Applications are invited from practitioners who:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are currently working at band 7&lt;/li&gt;\n&lt;li&gt;Have well developed communication skills&lt;/li&gt;\n&lt;li&gt;Able to respond appropriately to the demands of a rapidly changing environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The candidate must be a car owner with a current driving licence.&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Nottinghamshire County: Sally Bird Lead Infection Prevention and Control Nurse Nottinghamshire CCGs on 07796262423&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "NHS Nottingham and Nottinghamshire Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128368"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mansfield, NG21 0HJ", "postalCode": "NG21 0HJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1301", "longitude": "-1.14316"}}, "title": "Infection Prevention and Control Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247579", "validThrough": "2020-11-11T23:59:59+0000"}