{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "109830", "minValue": "82022", "unitText": "YEAR", "value": "£82,022 - £109,830 per annum, inc London Weighting"}}, "datePosted": "2020-10-08T16:46:23+0100", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Department of Respiratory Medicine at the Princess Royal University Hospital, a division of King’s College Hospital NHS Foundation Trust, is looking for an enthusiastic and committed respiratory physician. The post-holder will have the opportunity to further develop Sleep and Ventilation service while supporting the Integrated Respiratory Team and explore options of developing sub-specilaity interest. This will involve improving an already excellent respiratory/sleep physiology setup with a view to encouraging research. The post will involve other aspects of general respiratory medicine and a requirement to contribute to the out-of-hours on call rota for general medicine.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The appointed consultant will join a friendly, supportive and enthusiastic respiratory team that works collaboratively with the matron, manager and wider multidisciplinary team. They will work closely with colleagues from other medical specialities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Princess Royal University Hospital has 525 beds and serves the local population of the London Borough of Bromley and surrounding areas. The hospital is located in the leafy suburban town of Orpington, a highly sought after location due to its close proximity to many well-regarded primary, secondary and Grammar schools in addition to restaurants, cafes and bars. Many staff live in the local area, enhancing the community spirit within the hospitals. It is minutes away from Bromley town centre with large retail and leisure facilities. Central London is only 20 minutes away by train we are close to the M25 motorway. The nearby Kent Countryside is one of the most beautiful parts of the country and the coast is only an hour away.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We aim to support colleagues’ sub-specialty interest and work collaboratively with services across at Denmark Hill site for research, educational and simulation work. We would encourage the candidate to continue to pursue existing interests and we will try to accommodate a plan that suits their career development. Join us and be a part of developing a great clinical, academic and forward-thinking team.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Nicholas Yard&lt;/p&gt;\n&lt;p&gt;Job title Service Manager&lt;/p&gt;\n&lt;p&gt;Email address nicholas.yard@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01689 865878&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome and encourage potential candidates to come from an informal visit. To arrange an informal visit or for an informal discussion, please contact Dr Deepak Rao (Clinical Lead Consultant) or Dr Lynette Linkson on 01689 865877 or Nick Yard (Service Manager) 01689 865878 or e-mail nicholas.yard@nhs.net.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Consultant Respiratory Physician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219195", "validThrough": "2020-11-19T23:59:59+0000"}