{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-28T16:01:14+0000", "description": "&lt;p&gt;CONSULTANT PAEDIATRICIAN&lt;br /&gt;&lt;br /&gt;The Trust, which covers the hospitals in Grimsby, Scunthorpe and Goole, is seeking to appoint an enthusiastic, experienced Paediatrician to join and complement our existing team providing a comprehensive service.&lt;br /&gt;&lt;br /&gt;This post requires a person with wide experience to join the team of consultants supported by full middle grade cover. &lt;br /&gt;&lt;br /&gt;The appointee would be expected to have wide experience of Paediatrics. He/She should have neonatal experience and would be expected to share on-call duties (1:8) and Service week (1:8) and provide cover for colleagues during annual and study leave by mutual arrangements. The day to day timetable is flexible and can be negotiable with the successful candidate.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have the opportunity to be appointed as Honorary Senior Lecturer at Hull York Medical School (HYMS). This honorary appointment is in recognition of contribution to teaching and research and holders of honorary titles may request access to HYMS and University premises and facilities, systems, and library services.&lt;br /&gt;&lt;br /&gt;Grimsby, Scunthorpe and Goole are directly linked by motorway, the M18/M180 and A180. The same system provides direct access to the rest of the motorway system including the A1, M1, and M62. Consequently, Sheffield, Doncaster, Leeds, York and Hull are all less than an hour’s drive, as is Lincoln on the A15. Rail services connect via Doncaster with the main intercity service to London.&lt;br /&gt;&lt;br /&gt;Lincolnshire has amongst the lowest housing costs in England and the district provides a wide choice of residential areas. Educational facilities for children in Scunthorpe, Goole and Grimsby are of a high standard. There is a wealth of cultural and sporting activities in the areas suitable for most needs.&lt;br /&gt;&lt;br /&gt;Temporary accommodation may be available. Employees also have the benefit of subsidised Day Nursery, subject to availability. Assistance with relocation expenses will be given, where applicable, in accordance with Trust policy.&lt;br /&gt;&lt;br /&gt;For general information about the Trust visit our website&lt;/p&gt;\n&lt;p&gt;Job Description approved by Royal College&lt;/p&gt;\n&lt;p&gt;AAC Date: 15th October 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr HebbarAdditional contact information&lt;/p&gt;\n&lt;p&gt;Informal discussions are welcome and interested candidates who wish to discuss the post further should contact:&lt;/p&gt;\n&lt;p&gt;Dr Vijaya Hebbar – Clinical Leader, on 03033 303737, or through her secretary on 03033 304670.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Diana, Princess of Wales Hospital, Grimsby", "postalCode": "DN33 2BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5449", "longitude": "-.096217"}}, "title": "Consultant Paediatrician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247301", "validThrough": "2020-11-11T23:59:59+0000"}