{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15162", "minValue": "15162", "unitText": "YEAR", "value": "£9.02 Per hour"}}, "datePosted": "2020-11-03T14:26:21+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Come and join our bank of casual workers, who support our blood collection teams on an as and when basis. This will often be at short notice to work hours that are mutually convenient. As this role is to cover short-term gaps in our teams there is no guarantee of regular hours.&lt;/p&gt;\n&lt;p&gt;You don’t need a medical background or any qualifications, we just need your friendly, flexible approach to make our volunteer donors feel welcome, at ease and valued. You will receive training to undertake this vital role.&lt;/p&gt;\n&lt;p&gt;You will work with the support of the blood collection team to welcome our donors and to cover the after-donation refreshments area. We collect donations 7 days a week so cover will be required at weekends and evenings at our donor centres and mobile sessions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It’s your passion for people and reassuring nature that’s important and will encourage donors to return and bring family and friends along to donate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a great opportunity for you to gain additional experience and skills with a fantastic organisation who help save and improve lives. You’ll find the camaraderie in the team and sense of pride after each day is hard to beat&lt;/p&gt;\n&lt;p&gt;We’re an inclusive organisation that reflects the diverse communities we work with and &lt;strong&gt;positively encourage applications from all sectors of the community. This post will cover a large geographical area so some travel may be necessary. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Rebecca Guest at Rebecca.guest@nhsbt.nhs.uk. The advert will close for applications at midnight on the evening of Wednesday 11th November and interviews are to be held on Friday 27th November.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcester", "postalCode": "WR4 9AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1949", "longitude": "-2.20698"}}, "title": "Blood Donation Team Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254330", "validThrough": "2020-11-11T23:59:59+0000"}