{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "TBC"}}, "datePosted": "2020-10-30T15:31:34+0000", "description": "&lt;p&gt;&lt;strong&gt;**PLEASE NOTE THIS IS TO APPLY TO JOIN NHS PROFESSIONALS’ ALLIED HEALTH PROFESSIONALS BANK**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Band 6 &amp; 7 Radiographer&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; The Rotherham NHS FT – Rotherham Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt; CT&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: 34461&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Don’t stretch yourself…join the bank for flexibility in how you work.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community, working in a location with all the benefits of country living with the convenience of big city life?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for in the Radiography Department at The Rotherham NHS Trust specifically aiding in the CT Team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Rotherham NHS FT has an enviable reputation, great supportive team with a family feel. Based in the heart of the Hospitals main site, which is set within tree-lined parkland grounds, the post holder here will be pivotal in providing the best level of quality care to varying departments and their patient’s needs.&lt;/p&gt;\n&lt;p&gt;Excellent transport links mean their location is commutable from Sheffield, Barnsley, Doncaster and Worksop and there’s also a free staff car park a 5-minute walk away. They also offer a shuttle bus service running from the local mainline train station.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BSC or DCR(R) in Radiography&lt;/li&gt;\n&lt;li&gt;HCPC Registered&lt;/li&gt;\n&lt;li&gt;At least 2 Years’ Experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with &lt;em&gt;Aaron Higgs, Recruitment Consultant on 0333 014 4370 or Aaron.Higgs&lt;/em&gt;&lt;em&gt;@nhsprofessionals.nhs.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham Hospital", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Band 6 &amp; 7 Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250758", "validThrough": "2020-11-13T23:59:59+0000"}