{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Depending on experience"}}, "datePosted": "2020-10-21T12:26:14+0100", "description": "&lt;p&gt;Endoscopy Senior Staff Nurse&lt;/p&gt;\n&lt;p&gt;Join us as a Endoscopy Senior Staff Nurse in our Brentwood Hospital and play your part in building a healthier nation at Britain’s largest not-for-profit healthcare organisation.&lt;/p&gt;\n&lt;p&gt;We’re looking for a Endoscopy Senior Nurse join our team to support ourdeveloping Endoscopy Unit during the expansion of the service, where you will deliver high quality clinical patient care throughout the Endoscopy Unit. As part of a multidisciplinary team, you will be working closely with leading consultants and using the latest equipment and facilities all within in a highly rated CQC hospital setting.&lt;br /&gt;&lt;br /&gt;This role requires a combination of technical expertise and empathetic patient contact. It will give you opportunities to work with state-of-the-art technology on a varied caseload, while giving patients the support and reassurance they need. As a registered practitioner, you will deliver high quality clinical patient care through assessment, planning, implementation and evaluation of care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We value expertise at Nuffield Health. It is our combination of expert knowledge, innovative thinking and passion for care that has enabled us to become Britain’s largest not for profit healthcare provider. It has also helped us to build a unique network delivering connected healthcare - from hospitals, to Fitness and Wellbeing Clubs, to specialist services. Across our network, brilliant people benefit from our commitment to invest every penny in our services and people. With more time and greater scope to do what you love, the specialist in you will thrive here.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Opportunity&lt;/p&gt;\n&lt;p&gt;Duties of this role include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be the patients advocate&lt;/li&gt;\n&lt;li&gt;Provide quality planned care across the endoscopy patient pathway, supporting and assisting the Endoscopy Clinical Lead in the management and organisation of care provision&lt;/li&gt;\n&lt;li&gt;Support the team, acting as a role model and provide leadership to junior members of staff and who can manage emergency situations&lt;/li&gt;\n&lt;li&gt;Deliver effective care and treatments through improving clinical/technical knowledge/skill and encouraging a learning environment&lt;/li&gt;\n&lt;li&gt;Work autonomously conducting assessment, planning, delivery and evaluation of nursing care&lt;/li&gt;\n&lt;li&gt;Maintain accurate records across all responsibilities&lt;/li&gt;\n&lt;li&gt;Ensure the safe custody, supply and administration of drugs&lt;/li&gt;\n&lt;li&gt;Participate in clinical audit, reviews or reports, complying with all procedures and regulations to ensure the safe practice of the unit and take appropriate actions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Person&lt;/p&gt;\n&lt;p&gt;Applicants should meet the following criteria:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will have relevant experience as a qualified practitioner, with previous experience of working in Endoscopy as essential.&lt;/li&gt;\n&lt;li&gt;Registered Practitioner with NMC&lt;/li&gt;\n&lt;li&gt;Basic and advanced competence / experience in endoscopy care&lt;/li&gt;\n&lt;li&gt;Proficient in the use of a PC, including the use of software and systems&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Brentwood Hospital&lt;/p&gt;\n&lt;p&gt;Nuffield Health Brentwood Hospital has established itself as one of the leading providers of private healthcare, serving patients from Brentwood, Billericay, Basildon, Romford and the surrounding parts of Essex since 1970.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With excellent patient satisfaction rates, and a Good CQC rating we’re proud of our reputation for clinical excellence and outstanding care.&lt;/p&gt;\n&lt;p&gt;Our modern 42 bedded hospital, which was refurbished in 2017 specialises in fertility / assisted conception treatment, weight loss, cosmetic surgery and orthopaedics. However, we offer a wealth of exceptional clinical services for both private and NHS patients&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Benefits&lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free gym membership, private healthcare, pension scheme and generous annual leave. Not only this but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary dependent on experience, for more information contact the recruitment team&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Location - Brentwood Hospital&lt;/p&gt;\n&lt;p&gt;Hours - Full-time - 37.5 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore, please apply early to ensure you are considered for the post.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brentwood", "postalCode": "CM15 8EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6236", "longitude": ".312716"}}, "title": "Endoscopy Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236343", "validThrough": "2020-11-22T23:59:59+0000"}