{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T13:46:31+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a experienced mental health nurse to join our Essex Health &amp; Justice Service, providing expert advise and interventions within police custody and courts across Essex.You will join an expert team who are committed to providing outstanding care within these settings, working closely with all agencies involved in the criminal justice system.You will work autonomously providing written reports and assessment for service users with mental health &amp; other vulnerabilities within the custody setting.&lt;/p&gt;\n&lt;p&gt;We are looking for motivated staff who share our Trust values of Positive, Welcoming, Respectful, Involving, Kind and Accountable. In return EPUT can offer you a range of benefits including;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary Sacrifice schemes including Childcare Vouchers, lease cars and Cycle to Work&lt;/li&gt;\n&lt;li&gt;Season Ticket Loans&lt;/li&gt;\n&lt;li&gt;Participation in the Working Longer Review supporting staff to work longer&lt;/li&gt;\n&lt;li&gt;NHS discounts for staff&lt;/li&gt;\n&lt;li&gt;Weekly health &amp; wellbeing articles&lt;/li&gt;\n&lt;li&gt;Equality and Diversity Sub-Groups where staff can raise issues relating to equality at work&lt;/li&gt;\n&lt;li&gt;Equality Champions who are there to support other staff requiring support at work&lt;/li&gt;\n&lt;li&gt;Occupational Health and Counselling providers which includes 24 hour counselling support line for staff and access to a wide range of support and advice about a range of issues including finance and debt, consumer rights, housing, welfare and family rights and domestic violence&lt;/li&gt;\n&lt;li&gt;Active members of a range of national bodies which support health and wellbeing of the workforce (Age UK, Stonewall, Disability Two ticks, Mindful Employer)&lt;/li&gt;\n&lt;li&gt;An active Staff Side Body to represent staff issues and a range of recognised staff/professional unions.&lt;/li&gt;\n&lt;li&gt;Successful achievement of the National IIP Health and Wellbeing Award&lt;/li&gt;\n&lt;li&gt;Excellent Training facilities and opportunities, working closely with a number of Universities to support staffs professional development&lt;/li&gt;\n&lt;li&gt;Feature in the top 100 employers index for HSJ&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For full details please refer to Job Description and Personal Specification.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Janet Childs&lt;/p&gt;\n&lt;p&gt;janet.childs@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "C &amp; E Centre, Chelmsford", "postalCode": "CM2 0QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.731", "longitude": ".470854"}}, "title": "Essex Health &amp; Justice CPN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256071", "validThrough": "2020-11-18T23:59:59+0000"}