{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T12:46:34+0000", "description": "&lt;p&gt;To work as part of a team to ensure the effective performance of the computer information systems used at Wirral University Teaching Hospital. &lt;br /&gt;&lt;br /&gt;The clinical IT systems analysts are also responsible for troubleshooting problems and challenges within the clinical information systems. This may include clinical processes, software problems, hardware issues. The clinical systems analyst also performs period checks to ensure that data is entered and retrieved correctly and that all regulations regarding confidentially and security are being followed. &lt;br /&gt;&lt;br /&gt;A clinical systems analyst works with a wide variety of groups within the hospital including medical and non-medical staff. He or she must be able to effectively communicate with others to find out any problems or concerns with the system and then be able to either work with suppliers or other sections within Informatics to address the concerns or repair any problems. Good interpersonal skills are also important as the clinical systems analyst will be required to support the training of new employees &amp; provide in-service training to existing staff members.&lt;/p&gt;\n&lt;p&gt;This role is to provide general operational support to the development and maintenance of the clinical IT systems within the Trust and supporting the Specialist and Advanced Clinical IT Systems Analysts in delivering specific work packages supporting specific modules within the clinical system such as theatres, diagnostics, therapies, midwifery, training or business system processes working with the wider programme team to ensure project delivery is met and the wider change of clinical system pathways and benefits realisation is delivered.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Paul Jones - Principal Clinical Analyst&lt;/p&gt;\n&lt;p&gt;pauljones4@nhs.net&lt;/p&gt;\n&lt;p&gt;Alternative Contact:&lt;/p&gt;\n&lt;p&gt;Jane Edman - jedman@nhs.net&lt;/p&gt;\n&lt;p&gt;Specialist Clinical IT Systems Analyst&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clatterbridge Hospital, Wirral", "postalCode": "CH63 4JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3323", "longitude": "-3.02585"}}, "title": "Clinical IT Systems Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242499", "validThrough": "2020-11-12T23:59:59+0000"}