{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683+£2,162 LW per annum"}}, "datePosted": "2020-10-22T16:06:09+0100", "description": "&lt;p&gt;CNWL is seeking an enthusiastic and committed Consultant Psychiatrist to work across our two Milton Keynes services: HMP Woodhill &amp; ARC-MK.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;HMP Woodhill is a Category B male prison. CNWL provide primary care, mental health and addiction services and is an integral part of the wider prison team, contributing to the rehabilitative culture within the establishment. The addictions service provides both clinical and psychosocial interventions to any individual requiring addiction treatment during their time at HMP Woodhill.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;ARC-MK is a large integrated addiction treatment service delivered in partnership with We Are With You (a voluntary sector service). The service combines the elements of education, prevention, treatment and recovery within substance misuse treatment pathways. This includes those entering the service via the criminal justice system. You will have a strong commitment to partnership working, building networks and be able to work sensitively within a culturally diverse environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have a keen interest in addiction psychiatry and managing comorbidity. You will join our specialist community team treating individuals with substance misuse and mental health problems. Many service users will also have additional complex physical health needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will provide clinical leadership to a well-established multidisciplinary team that aspires to provide excellent bespoke care to enable our patients to fulfil their recovery goals and work towards discharge. Clinical duties include patient assessment / reviews, leading MDT meetings and optimising treatment pathways. Additionally, the post holder will be required to lead on Care Quality and Performance Management and proactively liaise with stakeholders (both internal and external to the Trust), supporting the strategic development of the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The services sit within CNWL’s Addictions Directorate. This is a large, well-established multi-disciplinary NHS provider, offering a wide range of high quality drug and alcohol treatment interventions. Our vision is to provide service users with exceptional opportunities for recovery by providing outstanding evidence based treatments. We have extensive experience of delivering safe and effective integrated drug and alcohol services across London and Milton Keynes. In addition, our Club Drug Clinic and National Problem Gambling / Gaming Service are recognised for their clinical excellence. We have strong academic links with London’s Division of Psychiatry. You will have opportunities to participate in cutting edge research developments to support your professional development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like further information or informal discussion about the role, please contact Dr Jeffrey Fehler, Clinical Director (Addictions) jeffrey.fehler@nhs.net or Teresa Wirz (Area Manager) teresawirz@nhs.net.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is available from 4th Jan 2021, pending  Counter Terrorist Check (CTC) clearance, which is required prior to working in the prison setting.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Milton Keynes", "postalCode": "MK6 4JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0226", "longitude": "-.733973"}}, "title": "Locum Consultant Psychiatrist in Addictions", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239271", "validThrough": "2020-11-09T23:59:59+0000"}