{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096-£110,683 per annum pro-rata"}}, "datePosted": "2020-11-05T13:01:26+0000", "description": "&lt;p&gt;Applications are invited for a Locum Consultant Anaesthetist with a Paediatric interest at Cambridge University Hospitals NHS Foundation Trust (CUH) to commence as soon as possible for 12 months. This is to cover both maternity leave.&lt;/p&gt;\n&lt;p&gt;The successful candidates will join an expanding, innovative and dynamic department of 85 Consultants, 40 Trainees and 20 Senior Clinical Fellows/Clinical Fellows, providing anaesthetic services in this thriving modern teaching hospital, which is the local hospital for people living in the Cambridge area and is a regional/supra-regional referral centre for a number of specialties, including cancer surgery, neurosurgery, transplantation, plastic surgery, vascular and paediatrics.&lt;/p&gt;\n&lt;p&gt;In addition, this post will have involvement in the Major Trauma Centre, which is the hub covering the East Anglia. As a successful teaching hospital, there is unparalleled capacity for teaching, including involvement in the high fidelity simulation centre, and research within the department as well as the wider biomedical campus. Notably development of a dedicated, stand-alone Children’s Hospital on the Campus is well under way with over £100 million secured, and fund raising continuing towards this goal.&lt;/p&gt;\n&lt;p&gt;We are the regional centre for paediatric surgery, with a 40 bedded neonatal unit (12 ICU, 16 HDU and 12 SCBU) and a 13 bedded PICU. Paediatric Anaesthetists cover a large number of complex cases within a range of subspecialties including neonatal surgery, general paediatric surgery, neurosurgery, urology, plastics including clefts, ENT, maxillofacial and trauma. Paediatric cardiac surgery and paediatric transplantation are the only subspecialties not offered on site.&lt;/p&gt;\n&lt;p&gt;The successful candidate will cover primarily paediatric theatres with no overnight on-call commitment. A minority of time will be spent delivering adult sessions. Currently, all of our Locum Consultants also deliver one longer day involving an evening trauma session on a 1:10 basis, Monday-Friday. Depending on staffing in the coming year, Locum Consultants may also deliver occasional daytime sessions on a Saturday or Sunday in the orthopaedic trauma theatres in line with job planned PA’s.&lt;/p&gt;\n&lt;p&gt;Applicants will be fully registered with the GMC and have a CCT (or equivalent) in Anaesthesia or be within six months of receiving a CCT at the time of interview. Applications are welcomed from those unable to work full time for personal reasons or those wishing to job-share.&lt;/p&gt;\n&lt;p&gt;The applicant must have demonstrable skills in listening, reading, writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013).&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt;Further information, in the first instance, may be obtained by contacting Dr Kate Bush, Subspecialty Lead for Paediatric Anaesthesia; Dr Brock Andreatta, Clinical Lead for Anaesthesia or Dr Hemantha Alawattegama, Clinical Director for Perioperative Services , via the Anaesthetics Department on 01223 216292 or via e-mail at kate.bush@addenbrookes.nhs.uk, brock.andreatta@addenbrookes.nhs.uk or hemantha.alawattegama@addenbrookes.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge University Hospitals, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Locum Consultant Anaesthetist with a Paediatric interest", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257759", "validThrough": "2020-12-02T23:59:59+0000"}