{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "Dependent on experience £38,890 - £44,503"}}, "datePosted": "2020-11-06T15:16:34+0000", "description": "&lt;p&gt;The Southern Adult Community Health Care Team (ACHT) within Buckinghamshire is delighted to announce a new opportunity for a full-time Advanced Community Practitioner Band 7 .&lt;br /&gt;&lt;br /&gt;The ACHT reflects an integrated approach that has been designed in response to the changing needs of the local population, with a special emphasis being placed on the proactive vision of care for complex patients in the community setting specialising in long term condition management,. In addition, emphasis is being placed on candidates to successfully facilitate timely discharge from hospital utilising a co-ordinated approach to care in partnership with key care partners. The post holder will provide advanced clinical assessments and caseload management. Supporting and developing healthcare colleagues driving forward the development of long term condition management at home.&lt;br /&gt;&lt;br /&gt;The post holder will have excellent communication skills and be able to demonstrate experience of multiagency working and proven ability to innovate and find solutions in delivering a safe and effective service. &lt;br /&gt;&lt;br /&gt;This is a clinical role but the post holder may be required to deputise for the locality manager in providing professional and operational leadership across the multidisciplinary team and representing the locality as necessary. &lt;br /&gt;&lt;br /&gt;We are looking for a qualified Health Practitioners who has previous experience within the community setting. and preferably with a District Nurse Qualification. We would encourage applications from experienced band 6 nurses willing to undertake a development programme in order to attain advanced skills in long term condition management.&lt;br /&gt;&lt;br /&gt;The ACHT service is in operation 7 days a week and the post is available in the Aylesbury locality. You will need to have a full licence and access to a car.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karen Waller - Community Team Lead - karen.waller@nhs.net - 07919627665&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chalfonts Hospital, Chalfont St Peter", "postalCode": "SL9 9DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6074", "longitude": "-.561791"}}, "title": "Advanced Community Practitioner - Southern ACHT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260327", "validThrough": "2020-11-20T23:59:59+0000"}