{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27941", "minValue": "25676", "unitText": "YEAR", "value": "£25,676 - £27,941 pa inc 15% HACS"}}, "datePosted": "2020-11-04T15:16:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Digital Support Officer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Digital Support Officer to work in the Hounslow Children&#39;s Services.&lt;/p&gt;\n&lt;p&gt;This is a new post created to support the increasing digital aspects of our work: you will be responsible for the effective use of digital technologies, providing targeted training and coaching to assist clinicians, administrators and managers in developing new skills and new ways of planning and completing tasks. The post holder will need to have excellent knowledge of systems / digital tools to promote their full use and enable digital service improvements.&lt;/p&gt;\n&lt;p&gt;The post holder will also support clinicians in their use of social media platforms and be responsible for maintaining the service web pages.&lt;/p&gt;\n&lt;p&gt;This is a new role so the successful candidates will have the ability to help develop the role as the team and service evolves.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent communication and personal skills and have the ability to manage their time effectively and work autonomously, to meet the training needs of staff within a busy environment.&lt;/p&gt;\n&lt;p&gt;We are looking for a candidate who has a good standard of education and office experience, excellent IT skills including the ability to access and use a range of applications including SystmOne, Microsoft Outlook, Word, Excel, PowerPoint and social media platforms.&lt;/p&gt;\n&lt;p&gt;You must be able to build effective working relationships, be approachable and accessible with a flexible approach to work.&lt;/p&gt;\n&lt;p&gt;This is an excellent career development opportunity for a self-motivated and enthusiastic individual who wishes to widen their transferable skills and work within a multidisciplinary, friendly and innovative service.&lt;/p&gt;\n&lt;p&gt;This post is a fixed term / secondment opportunity for 12 months.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Susan Cook Job title Business Manager, Hounslow Children&#39;s Services Email address Susan.cook29@nhs.net Telephone number 07747768657 Additional contact information&lt;/p&gt;\n&lt;p&gt;Julie Rushton, Divisional Manager for Hounslow Children&#39;s Services&lt;/p&gt;\n&lt;p&gt;Julie.Rushton@nhs.net&lt;/p&gt;\n&lt;p&gt;07584 408504&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122296.jpg", "name": "Hounslow and Richmond Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122296"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heart of Hounslow, Hounslow", "postalCode": "TW3 3EL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4683", "longitude": "-.371733"}}, "title": "Digital Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256401", "validThrough": "2020-11-18T23:59:59+0000"}