{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a"}}, "datePosted": "2020-11-04T16:46:12+0000", "description": "&lt;p&gt;This is an exciting opportunity for an enthusiastic individual who is interested in a career within Information and Business Intelligence in the NHS. You will be based at Trust HQ in Milton Keynes and will support our Community and Mental Health Services with their information, performance and intelligence requirements. We are currently rolling out Tableau BI across our services and you will be involved in developing and promoting this reporting solution.&lt;br /&gt;&lt;br /&gt;You will need to apply your analytical and technical abilities to provide high quality management information and analysis. This will involve working with service managers to identify and address performance issues and looking at how our performance compares to others. You will also be responsible for producing our monthly performance reports and monitoring data quality. &lt;br /&gt;&lt;br /&gt;You should be technically able with advanced excel skills and a good understanding of databases and SQL based query tools. You should also have strong analytical skills and be able to translate data into meaningful management information, have an eye for detail and be able to communicate clearly and knowledgeably in relation to all aspects of performance reporting with all levels across the organisation. Previous experience with Tableau would also be beneficial.&lt;br /&gt;&lt;br /&gt;We reserve the right to close this job early should we receive high volume of interest in the post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Liz Walsh&lt;br /&gt;Job title: Performance and Information Manager&lt;br /&gt;Email address: liz.walsh2@nhs.net &lt;br /&gt;Telephone number: 01908 725314&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Milton Keynes Trust HQ, Milton Keynes", "postalCode": "MK6 5NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0248", "longitude": "-.738428"}}, "title": "Performance &amp; Information Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256714", "validThrough": "2020-11-15T23:59:59+0000"}