{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50000", "minValue": "50000", "unitText": "YEAR", "value": "Up to £50,000 per annum - DOE"}}, "datePosted": "2020-10-20T18:04:36+0100", "description": "&lt;h2&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Are you collaborative, caring and compassionate?&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt;&lt;br /&gt;HMP Winchester is a category B men’s prison for those on remand to local courts. With an operational capacity of 690, HMP Winchester is based in Winchester, Hampshire; by car it’s approximately 20 minutes from Eastleigh, 25 minutes from Southampton, 30 minutes of Andover, Basingstoke and Newbury and 45 minutes from Salisbury. On foot, it’s a 20 minute walk from Winchester town centre and 15 minutes’ walk from Winchester train station.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care at HMP Winchester, we’re looking for an Advanced Nurse Practitioner to support us and the existing team in this new venture.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Interested in clinical development?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. BBV, sexual health, plastering, ILS (intermediate life support), RCGP and long term condition courses.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;br /&gt;&lt;strong&gt;In return for your hard work you will...&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Receive an annual salary of up to £50,000 depending on experience, pro rota. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;br /&gt;Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Onsite benefits at HMP Winchester include access to an onsite gym and free parking.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;br /&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Utilising your skills in managing patients within a primary care setting and dealing with physical health concerns, mental health issues and minor injuries, you&#39;ll be an integral member of the medical team, conducting clinics independently, completing administrative tasks (prescriptions, referrals, pathology results) and supporting or acting as the Duty Doctor and working on reception (new arrivals) processes.&lt;br /&gt;&lt;br /&gt;Leading by example, you&#39;ll share your experience and knowledge by being involved in the educational and professional development of the nursing team through clinical supervision sessions both on the wings and formal teaching opportunities.&lt;br /&gt;&lt;br /&gt;You&#39;ll work within your scope of practice, in accordance with Practice Plus Group and prison service policies and procedures in line with the NMC Code of professional conduct, performance and ethics for nurses and midwives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;If you are shortlisted, you will be contacted by Amelia Smith, the Internal Recruiter for this role.&lt;br /&gt;&lt;br /&gt;Amelia will submit your CV to the hiring manager and in turn will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;br /&gt;&lt;br /&gt;For further information, please contact us on the details provided.&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;br /&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;This is a part-time role working 30 hours per week. The salary for this role is up to £50,000 (pro rata) - dependent on experience. Healthcare is provided 24/7 at HMP Winchester, so there is a requirement for unsociable hours due to new admissions arriving at the prison.&lt;br /&gt;&lt;br /&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester", "postalCode": "SO22 5DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0624", "longitude": "-1.32874"}}, "title": "Advanced Nurse Practitioner - HMP Winchester", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235466", "validThrough": "2020-11-11T23:59:59+0000"}