{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-23T12:22:54+0100", "description": "&lt;p&gt;&lt;strong&gt;BAND 6 Community Mental Health Nurse Post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In Shropshire Crisis Resolution Home Treatment (CRHT) Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a Band 6 Mental Health Nurse, registered with the Nursing and Midwifery Council.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The team is based at The Redwoods Centre in Shrewsbury and provides mental health assessment, treatment and support to people in Shropshire. We work with people who are experiencing a mental health crisis, require extra support alongside their regular support network or who can have the same treatment provided at home that they would receive in a Mental Health Hospital. As an integral team in the Urgent Care Pathway we work 24 hours a day, 7 days a week.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a team that consists of Band 5 and 6 Nurses, Band 3 Support Workers, Social Workers, Non-Medical Prescribers, Medical Staff, Occupational Therapists, Administrators and Business Support Staff. As we work with people with all types of mental health presentations, we need to have a range of skills and interests that create a strong and responsive team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt; The role of a Band 6 Practitioner is primarily to assess people who have been referred to us in a mental health crisis. Further aspects of the role are as follows; assist in the development and growth of the team by providing clinical guidance and supervision, perform the role of shift coordinator and oversee the practical running of a day shift, support the provision of Home Treatment by providing clinical support to the team. Liaison with partner services both internal to the Trust and within the local community is an important part of the role and there is an expectation that the successful candidate would have the interpersonal skills to communicate, as necessary, with these other teams in a variety of ways.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Effective communication skills are an integral part of the role. Written and verbal skills will be vital in ensuring that information is documented, shared and recorded in an accurate, objective and prompt manner. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is essential that you possess the skills to work as part of a team and have the confidence to work autonomously. You should possess the skills and enthusiasm to take on the challenge of a changing, modern day community mental health service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Having proficient IT skills and being a car driver are essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be supported via clinical, peer and management supervision. They will also be encouraged to expand their knowledge, skills and experience by spending time with other teams and professionals and take advantage of in-house, in Trust and external training opportunities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If prior to the interview you would like to come and meet the team or simply want to call and talk about the position and role, you are welcome to speak with either Gary Joy, Operational Lead or Jane Chandler, Clinical Lead on 01743 210100.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We look forward to receiving your application.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury", "postalCode": "SY3 8DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7076", "longitude": "-2.79477"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240519", "validThrough": "2020-12-20T23:59:59+0000"}