{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-29T10:01:55+0000", "description": "&lt;p&gt;Morecambe Bay Respiratory Network has an exciting opportunity for a band 6 Physiotherapist looking to join our expanding Community Respiratory Service in South Cumbria.&lt;/p&gt;\n&lt;p&gt;We are looking for a Physiotherapist with an existing Specialist interest in Chronic Respiratory Disease, Pulmonary Rehabilitation and/or Respiratory symptom management. However, if you are a Physiotherapist who has not yet worked in a Community Respiratory role we would also welcome you if you are looking to develop a new specialism in Respiratory Care.&lt;/p&gt;\n&lt;p&gt;This is a permanent part time post of 0.82 WTE , and the successful candidate will be based in Furness&lt;/p&gt;\n&lt;p&gt;Our new service spans the whole of Furness &amp; Kendal areas - namely - South Cumbria and Lakes areas, you can expect that travelling between patient visits. Specialist Clinics and pulmonary rehabilitation programmes will be part of your community role, but what better part of the country to drive around? To accommodate this, travel expenses during work would be covered and you may also be eligible for the lease car scheme.&lt;/p&gt;\n&lt;p&gt;We are looking for a new colleague who shares our ambition to deliver the highest quality, effective and efficient services to all of our patients across this varied geographical area with differing population needs. As such, part of your role will be to contribute to our programme of service improvement, audit and redesign.&lt;/p&gt;\n&lt;p&gt;As one of our Physiotherapists, you would be working as part of a large Multi-disciplinary Community Respiratory Service, alongside Occupational Therapy, Nursing, therapy and administrative support colleagues, to delivered person-centred packages of Respiratory care. Therefore, you will need to be an excellent team player who shares our approach of person-centred therapy.&lt;/p&gt;\n&lt;p&gt;The Morecambe Bay Respiratory Network (MBRN) is successfully improving the provision of Respiratory care to patients across our area, by promoting an integrated approach of Respiratory care delivery between General Practice, Community and Hospital teams. With this development brings the opportunity for you to develop close working relationships with the wider team, from Respiratory consultants to local GP practices. We have established Clinical best practice groups (e.g. for Pulmonary Rehabilitation) and you will also benefit from the MBRN rolling programme of Integrated Respiratory Education and a commitment to support your own personal development within our service.&lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt;If you are interested in developing your career in Respiratory with us, please get in touch to discuss these roles further, you can phone or email either Joanne Newsham Specialist Respiratory Physiotherapist ,Joanne.Newsham@mbht.nhs.uk or Laura Allen Specialist Respiratory Physiotherapist Laura.Allen@mbht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Both Joanne and Laura are based in Barrow-in-Furness, telephone number 01229 402552&lt;/p&gt;\n&lt;p&gt;We’d love to hear from you, and if you’d like to find out more about our team you’d be welcome to visit us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoanne NewshamJob titleHighly Specialist Respiratory PhysiotherapistEmail addressjoanne.newsham@mbht.nhsukTelephone numberMobile : 07870516247 Office: 01229 402552Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Joanne Newsham Specialist Respiratory Physiotherapist based in Barrow: Joanne.Newsham@mbht.nhs.uk 01229 402552,&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Alfred Barrow Health Centre, Barrow-in-Furness", "postalCode": "LA14 2LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1096", "longitude": "-3.22381"}}, "title": "Specialist Respiratory Physiotherapist (Community)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247817", "validThrough": "2020-11-12T23:59:59+0000"}