{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 gross per annum"}}, "datePosted": "2020-10-28T17:30:23+0000", "description": "&lt;p&gt;We have a fantastic opportunity for 2 qualified Mental Health Practitioners to join our Compass Service.&lt;/p&gt;\n&lt;p&gt;Our work includes working with carers’ groups, foster care groups, work with residential care teams and systemic work with families and multi-agency teams always with a clear focus on improving outcomes for children looked after. If you feel you would enjoy working within in a multi-disciplinary team committed to dividing both direct work and consultation with other professionals, you will be well suited to this role.&lt;/p&gt;\n&lt;p&gt;The role will involve both direct and indirect work with children, families and the wider system including assessment, intervention, consultation, training, liaison and signposting to other services. You will be supported to take a creative and ambitious approach to work, in order to ensure that children looked after are able to experience stability and security as they grow up.&lt;/p&gt;\n&lt;p&gt;These are unique opportunities to be part of building on the Compass approach of therapeutic and mental health services. These are varied and developmentally engaging roles, which while challenging will also be rewarding. Within the role there will be an expectation to work creatively within the service to develop evidence of the impact of the work including support to engage in research and evaluation.&lt;/p&gt;\n&lt;p&gt;Currently much of our work is taking place remotely currently, but there will be need for candidates to travel throughout the area.&lt;/p&gt;\n&lt;p&gt;Whilst applications are welcomed from all suitably qualitied candidates preference will be given to those with a mental health nurse background.&lt;/p&gt;\n&lt;p&gt;All candidates will be subject to an enhanced DBS check and reference checks. The post is community based in a rural location, so applicants need to be able to travel independently within Norfolk and have a full clean driving license.&lt;/p&gt;\n&lt;p&gt;We are keen to hear from people would be interested in joining us on either a full or part time basis. These roles are initially being offered as one-year fixed term contracts These are exciting opportunities to be part of an innovative team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNeil ToplisJob titleOperational ManagerEmail addressneil.toplis@nsft.nhs.ukTelephone number07443 293730Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Michelle Trollope (Principal Clinical Psychologist) on 07717432288 or Dr Emily Wilkens on 07717 432288&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Little Plumstead, Norwich, Norwich", "postalCode": "NR13 5FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6499", "longitude": "1.40656"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247504", "validThrough": "2020-11-11T23:59:59+0000"}