{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-29T10:46:30+0000", "description": "&lt;p&gt;The Integrated Musculoskeletal, Pain and Rheumatology Service (IMPReS) covers the East Lancashire footprint of Burnley, Pendle, Rossendale, Hyndburn, Ribble Valley, Blackburn and Darwen. We are looking for a suitably qualified Occupational Therapist at Band 6 to join our multidisciplinary pain management team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is an exciting opportunity for an experienced Occupational Therapist to be part&lt;br /&gt;of a MDT model delivering high quality service to Pain Management Services across&lt;br /&gt;East Lancashire.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to help shape the delivery of a Pain Management&lt;br /&gt;Service in Primary Care as part of a multidisciplinary team including Advanced&lt;br /&gt;Physiotherapist, Clinical Nurse specialist, Highly specialist Occupational Therapist,&lt;br /&gt;consultants and Clinical and Health Psychologists. You will be working with patients who are diagnosed with chronic pain, delivering a combination of individual and group based interventions to help them live more successfully with their condition. The role involves assessing the physical, psychological and environmental factors that contribute to pain, and the impact of pain on occupations in daily life, with an aim of optimising functional performance and wellbeing.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is an opportunity to develop the skills to manage patients with complex needs in a fully supported environment with the appropriate training. The successful candidate will have an appropriate level of experience in managing long term conditions. Knowledge and application of the biopsychosocial approach to management of pain problems would be desirable. Group work experience is desirable, as it experience of using psychologically based treatment approaches, however training and supervision will be offered by experienced practitioners.&lt;br /&gt;Evidence of involvement in service improvement and audit would be an advantage.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Full time or Part time, we are happy to consider all applications. Our staff are warm,&lt;br /&gt;friendly, supportive and dedicated professionals who will make you feel very&lt;br /&gt;welcome. We support the Trust 24/7 agenda and operate extended hours services to meet our patients’ needs and to offer them choice.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful candidate will be able to demonstrate clear clinical reasoning and&lt;br /&gt;have the ability to explain their decisions and actions in a way that all concerned will&lt;br /&gt;be able to understand.&lt;/p&gt;\n&lt;p&gt;They must also be able to demonstrate proven team working, flexibility, good time&lt;br /&gt;management skills, organisational skills, and evidence of self-motivation. They must&lt;br /&gt;also be able to demonstrate evidence of recent learning and examples of continued&lt;br /&gt;professional and clinical development.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful applicant will have the opportunity to consolidate and further develop clinical and leadership skills and will be supported clinically and managerially by highly skilled and motivated clinicians at all levels. The right candidate for this post will have appropriate experience and clearly able to demonstrate a desire to actively participate in all aspects of the job. You must be willing and able to lead on various elements of the work in this exciting and demanding area of work.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Above all you will deal with each and every situation following Compassion in Practice and the six key elements Care, Compassion, Courage, Competence, Communicating effectively and Commitment. As well as delivering the Trust, Divisional and Departmental objectives.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If this post interests you and you would like to know more about it – we would love to hear from you, so don’t hesitate to ring us or arrange an informal visit. Please call Alexandra White on 01282 803175 or email Alexandra.White@elht.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTrevor LandryJob titlePrincipal Clinical PsychologistEmail addresstrevor.landry@elht.nhs.ukTelephone numberContact via MS Teams or by email as homeworking&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Burnley", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Specialist Occupational Therapist – Chronic Pain", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247972", "validThrough": "2020-11-06T23:59:59+0000"}