{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa inc plus Outer London HCAS"}}, "datePosted": "2020-11-03T14:16:18+0000", "description": "&lt;p&gt;Croydon CAMHS is seeking an enthusiastic CAMHS Clinical/Counselling Psychologist to join our multidisciplinary team on a fixed term contract for 18 months. Croydon CAMHS is part of South London and Maudsley NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The service is currently organised along the I Thrive model, with a &lt;strong&gt;Getting Advice team&lt;/strong&gt; leading on referrals and provision of front line groups, a &lt;strong&gt;Getting Help team&lt;/strong&gt; leading on provision of interventions for children presenting for the first time and where an evidence based talking therapy or combination of talking therapy and medication are indicated. The &lt;strong&gt;Getting More Help team&lt;/strong&gt;, offers intervention to young people with particularly complex mental health difficulties which may require a package of interventions and to those who have been discharged from tier 4 services or have been previously seen in the service. The &lt;strong&gt;Getting Support with Risk team&lt;/strong&gt; lead on multiagency liaison through representing the service on a number of panels and also lead on supporting young people and others in their network where there are continuing risks to self or others but where there are particular challenges with engaging the young person and their families.&lt;/p&gt;\n&lt;p&gt;The post holder will work within the Croydon CAMHS Getting More Help Team to provide assessment, treatment, care coordination and planning for children and/or young people with moderate to severe mental health and neuropsychiatric difficulties, under supervision of the team leader and relevant clinical supervisor. The successful applicant will have either experience of working with Children and Young People with moderate to severe mental health or neuropsychiatric difficulties in mental health settings or transferable skills in the assessment and treatment of people with mental health and hold current professional registration.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you feel valued and appreciated and that is why we have a comprehensive benefits package on offer.&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and supporting a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefit from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefit from keyworker housing which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands through Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;South London and Maudsley NHS Foundation Trust encourages and welcomes applications from people with lived experience of mental health challenges. We see this as valuable and recognise the positive impact this experience can have on the work we do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Lorna Taha Job titleTeam Leader Email address lorna.taha@slam.nhs.uk Telephone number 02032280000 Additional contact information&lt;/p&gt;\n&lt;p&gt;Suraba Mahendiran, Clinical Psychologist, 02032280000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Christopher Wren House, Croydon", "postalCode": "CR0 1QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3702", "longitude": "-.099639"}}, "title": "CAMHS Clinical/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254286", "validThrough": "2020-11-10T23:59:59+0000"}