{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33166", "minValue": "33166", "unitText": "YEAR", "value": "£19.73 per hour"}}, "datePosted": "2020-11-03T16:51:58+0000", "description": "&lt;h1&gt;&lt;strong&gt;Are you looking for an additional role!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Have you ever thought about working within a prison?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you enjoy being part of a team in a diverse and ever-changing environment?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently seeking Bank Paramedic within HMP Highpoint.&lt;br /&gt; Working as a Bank Paramedic offers you flexibility and workplace variety. You would also be assisting the wider permanent team, covering for planned and unplanned absences.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About us&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;HMP Highpoint is a category C adult male prison for sentenced prisoners, holding up to 1323 men across 15 residential units. HMP Highpoint is situated on the A143 at Stradishall, which is approximately 7 miles from Haverhill when heading to Bury St Edmunds and within 20 miles of the A14 to the north and the M11 to the west. The prison is split across two sites - North and South. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will be a qualified Paramedic with current HCPC registration with proven experience in either, Accident &amp; Emergency, Primary Care environments or Minor injuries / illness an environment.&lt;br /&gt; If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What we need from you to do the job&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt; With the ability to think on your feet and a flexible attitude, you’ll be a qualified paramedic with current HCPC registration and ALS/ATLS/PALS qualification for Paramedics. Capable of demonstrating initiative, you’ll have proven experience of post-registration experience in any of these following clinical areas: Accident &amp; Emergency, Primary Care environments, Minor Injuries / Illness Units.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;In return for your hard work you will receive...&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group, we are proud to support our employees with continued professional development opportunities and further education (subject to service needs). Staff are encouraged to develop skills and learning to contribute to the dynamic care needs of our specific client groups. Other benefits include cycle to work scheme, on-site gym facilities and free onsite parking at some locations.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Further job information…&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is a bank role working shifts as and when required.&lt;/p&gt;\n&lt;p&gt;The pay rate is up to £19.73 per hour.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stradishall", "postalCode": "CB8 9YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.137", "longitude": ".51069"}}, "title": "Bank Paramedic - HMP Highpoint", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254851", "validThrough": "2020-11-17T23:59:59+0000"}