{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25000", "minValue": "25000", "unitText": "YEAR", "value": "up £25,000 per annum"}}, "datePosted": "2020-10-23T12:45:33+0100", "description": "&lt;h1&gt;&lt;span&gt;Corporate Partnership Fundraiser&lt;/span&gt;&lt;/h1&gt;\n&lt;h2&gt;Starting salary £25,000 per annum, pro rata&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;22.5 hours per week, including occasional weekends and evenings to support events&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a highly motivated, engaging and enthusiastic Fundraiser who is looking to take the next step in your career? If so, why not join our teamto help us make a difference to people’s lives as our new Corporate Partnerships Fundraiser?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As we embark on an exciting new programme of extending our services to meet the changing needs of our patients, families and carers here on the Island, we have an exciting opportunity for an enthusiastic and ambitious Fundraiser to join us in this new role and be part of our passionate and dedicated team where you can make a real difference to the lives of others.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working alongside our Head of Income Generation and our Fundraising teams, you will be responsible for developing and implementing a successful programme of fundraising from the corporate and business sector on the Island, meeting agreed financial income and expenditure budgets.&lt;/p&gt;\n&lt;p&gt;You will be responsible for researching and securing new corporate supporters, while also managing existing partnerships, and you will maximise income by establishing, building and maintaining excellent relationships.&lt;/p&gt;\n&lt;p&gt;You will be responsible for producing and delivering high quality, creative, persuasive and accurate pitches and proposals, ensuring a tailored approach at all times, and developing and writing funding proposals, corporate applications and reports.&lt;/p&gt;\n&lt;p&gt;This new role offers the opportunity for continual professional development and the ability to grow and help develop our services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be full of energy and ideas of how to generate income from the corporate and business community on the Isle of Wight. You will have demonstrable experience working in fundraising, either in the charity or corporate sector, ideally having business development or account management experience.&lt;/p&gt;\n&lt;p&gt;You will be a pro-active individual with excellent written, verbal and networking skills and the ability to build strong relationships, both internal and external and at a range of levels. You will be a confident speaker, capable of delivering inspiring pitches and influencing potential and existing supporters. You will be highly organised with the ability to prioritise and manage your workload and multi-task.&lt;/p&gt;\n&lt;p&gt;You will have a full clean driving licence and have the use of a vehicle for business purposes associated with this role, as you may be required to travel across the Isle of Wight. Flexibility over hours worked is important for the role, which will include occasional evening and weekend work. You will also be required to attend occasional meetings at Countess Mountbatten Hospice in Southampton.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can Offer You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a wide range of benefits to our employees including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Onsite Parking&lt;/li&gt;\n&lt;li&gt;Development and Training opportunities&lt;/li&gt;\n&lt;li&gt;Generous Annual Leave, Occupational Sickness and Maternity Benefit Schemes, subject to qualifying conditions&lt;/li&gt;\n&lt;li&gt;Recognition of previous Agenda for Change NHS Continuous Service for incremental progression, annual leave, maternity and sickness benefits&lt;/li&gt;\n&lt;li&gt;Pensions Schemes, including continuation of contributions to your NHS Pension scheme, subject to eligibility&lt;/li&gt;\n&lt;li&gt;Local Benefit Scheme including discounts with all ferry operators&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The post is subject to an Enhanced DBS check the cost of which is covered by the Hospice.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held 7th and 9th December&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal discussion and visit about this opportunity, please contact :Katie Mew, Head of Income Generation, on 01983 217392&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135458.png", "name": "Mountbatten Isle of Wight", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135458"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport", "postalCode": "PO30 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7066", "longitude": "-1.28246"}}, "title": "Corporate Partnership Fundraiser", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240567", "validThrough": "2020-11-22T23:59:59+0000"}