{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa (pro rata for part time)"}}, "datePosted": "2020-11-03T09:46:25+0000", "description": "&lt;p&gt;&lt;strong&gt;This role is eligible to receive a Golden Hello Incentive – please contact the recruitment team on 01375 364652 to find out more. This applies to candidates who are not currently employed by EPUT.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;New band 5 and 6 community nurses are offered the opportunity to apply for fast track programmes to support rapid progression to the next band. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mental Health Practitioner &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CALLING ALL NURSING, OCCUPATIONAL THERAPY AND SOCIAL WORK PROFESSIONALS &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;EPUT is currently undertaking a substantial transformation project within our community mental health services, something of which supports the NHS 5 Year forward plan and the increase in mental health funding announced by the Government.&lt;/p&gt;\n&lt;p&gt;Due to these exciting changes we are looking for a mental health practitioner to join the EPUT team in our Emergency Response and Urgent Care Team. This post is open to individuals with a RMN or HCPC registration in nursing, occupational therapy or social work with a passion for mental health.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a member of the multidisciplinary team, working in a fast pace community urgent care pathway offering a community response to those experiencing a mental health crisis.&lt;/p&gt;\n&lt;p&gt;You will have the responsibility for participating in planning, implementation/evaluation and ongoing review of treatment plans for individuals where crisis has been assessed.&lt;/p&gt;\n&lt;p&gt;You will work collaboratively with key partner organisations, service users, carers, clinicians and other practitioners to provide a 7 day a week, 24 hours a day service, 365 days a year, working shifts were appropriate and operationally required.&lt;/p&gt;\n&lt;p&gt;This role will be working on a 12 hour shift pattern and is eligible for unsocial hour payments of time plus 30% &lt;strong&gt;on Saturday (midnight to midnight) and any week day after 8 pm and before 6 am&lt;/strong&gt; and time plus 60%&lt;strong&gt; on Sundays and Public Holidays (midnight to midnight) &lt;/strong&gt;enhancement on Sundays and bank holidays as well as your normal rate.&lt;/p&gt;\n&lt;p&gt;EPUT has in place excelling training and development opportunities allowing our staff access to strong career pathways, including a Trust bank that all new staff can automatically join to earn additional income or expand on their experience and knowledge in different patient areas.&lt;/p&gt;\n&lt;p&gt;This post is also eligible for the Trusts relocation package of up to £6,000 to support moving costs, for more information on the relocation package please contact Paige Bradford Brown, Recruitment and Retention Manager on 01375 364513.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post attracts a £250 refer a friend incentive. &lt;/strong&gt;&lt;strong&gt;If you &lt;/strong&gt;&lt;strong&gt;are successful at interview and &lt;/strong&gt;&lt;strong&gt;start before 31 March 2020&lt;/strong&gt; &lt;strong&gt;hav&lt;/strong&gt;&lt;strong&gt;ing&lt;/strong&gt;&lt;strong&gt; been referred to the Trust by&lt;/strong&gt;&lt;strong&gt; a&lt;/strong&gt;&lt;strong&gt; friend&lt;/strong&gt; &lt;strong&gt;currently working &lt;/strong&gt;&lt;strong&gt;at&lt;/strong&gt;&lt;strong&gt; EPUT, you will receive £250 &lt;/strong&gt;&lt;strong&gt;split between you and your friend&lt;/strong&gt;&lt;strong&gt; (subject to tax and NI).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further clinical information please contact Susan Shorter on susan.shorter@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon", "postalCode": "SS13 3BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5652", "longitude": ".507397"}}, "title": "Mental Health Practitioner - Eligible for a Golden Hello Incentive", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253319", "validThrough": "2020-11-17T23:59:59+0000"}