{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18531", "minValue": "18531", "unitText": "YEAR", "value": "£18,531.87 per annum"}}, "datePosted": "2020-11-03T10:50:04+0000", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt;Burgess Hill Hospital is located in beautiful West Sussex and offers the opportunity to gain experience across many specialist mental health disciplines including Secure Services, a DBT Locked Rehabilitation service, PICU Services and Acute care.&lt;/p&gt;\n&lt;p&gt;With a CQC rating of GOOD across all 5 Key Lines of Enquiry, you would be working in a forward thinking hospital supporting our patients recovery alongside a highly skilled and dedicated Multi-Disciplinary Team. If you were successful in applying to work with us, we offer a comprehensive orientation and training programme to equip you will the knowledge and skills required to provide our patients with the highest quality of care.&lt;/p&gt;\n&lt;p&gt;With on site parking, meals provided whilst working, free use of our onsite gym and easy access to vibrant Brighton and London, what’s not to like…&lt;/p&gt;\n&lt;p&gt;Burgess Hill is recruiting now for Mental Health Support Workers to join our dynamic and forward thinking team of professionals that include Psychologists, Psychiatrists, Social Workers and OTs. As a support worker you will work on our wards under the supervision of a qualified nurse, supporting our patients in their recovery.&lt;/p&gt;\n&lt;p&gt;Burgess Hill  Hospital offers a unique setting for those who are interested in gaining experience in a number of different mental health services both male and female, all within one hospital.&lt;/p&gt;\n&lt;p&gt;At Burgess Hill we pride ourselves on our dedication to patient care and our team work. If you have the following attributes we want to hear from you:-&lt;/p&gt;\n&lt;p&gt;A caring nature with strong listening skills&lt;br /&gt;Encouraging and supportive approach&lt;br /&gt;Thrives within a team led environment&lt;br /&gt;An understanding of mental health conditions&lt;br /&gt;Ability to keep calm in challenging situations&lt;/p&gt;\nSkills and Knowledge\n&lt;ul&gt;\n&lt;li&gt;Good communication skills&lt;/li&gt;\n&lt;li&gt;Ability to work flexibility&lt;/li&gt;\n&lt;li&gt;Basic Literacy skills&lt;/li&gt;\n&lt;li&gt;Common sense approach to problem solving.&lt;/li&gt;\n&lt;li&gt;Basic numeracy skills&lt;/li&gt;\n&lt;li&gt;Motivation and initiative&lt;/li&gt;\n&lt;li&gt;Some appreciation of Mental Health problems.&lt;/li&gt;\n&lt;/ul&gt;\nQualifications\n&lt;ul&gt;\n&lt;li&gt;Education to GCSE Standard&lt;/li&gt;\n&lt;li&gt;NVQ or equivalent would be an advantage.&lt;/li&gt;\n&lt;/ul&gt;\nIn return for your expertise and hard work, we offer a wide range of benefits: \n&lt;p&gt;• Competitive salary&lt;/p&gt;\n&lt;p&gt;• 25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/p&gt;\n&lt;p&gt;• Extra Service Annual leave awards&lt;/p&gt;\n&lt;p&gt;• Career development&lt;/p&gt;\n&lt;p&gt;• A contributory pension scheme&lt;/p&gt;\n&lt;p&gt;• An employee assistance programme&lt;/p&gt;\n&lt;p&gt;• Free meals/refreshments when on duty&lt;/p&gt;\n&lt;p&gt;• Free car parking&lt;/p&gt;\n&lt;p&gt;Free DBS check&lt;/p&gt;\n&lt;p&gt;Refer a Friend scheme&lt;/p&gt;\n&lt;p&gt;‘All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS). Priory Group will cover the cost of a DBS check for all successful applicants.’&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\nAbout us\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\nDisclosure\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Sussex", "postalCode": "BN6 9LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9649", "longitude": "-.165213"}}, "title": "Mental Healthcare Assistant / Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253563", "validThrough": "2021-01-09T23:59:59+0000"}