{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28988", "minValue": "26365", "unitText": "YEAR", "value": "£26,365 - £28,988 per annum inc"}}, "datePosted": "2020-10-29T11:30:48+0000", "description": "&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a dynamic, highly motivated, enthusiastic individual to work in the Finance Department of South West London and St Georges Mental Health NHS Trust. The successful applicant will have responsibility for the efficient day to day management of the finances of those patients the Trust is an appointee or deputy for. The successful candidate will also be expected to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Manage and maintain a comprehensive set of financial records for nearly 200 patients, over 100 of which the Trust acts as deputy or appointee for.&lt;/li&gt;\n&lt;li&gt;Complete and submit benefit claim forms to the Department of Work and Pensions for patients who are entitled to benefits.&lt;/li&gt;\n&lt;li&gt;Ensure that patients receive payment of their correct daily or weekly allowance and their rent, utility bills etc. are paid on time.&lt;/li&gt;\n&lt;li&gt;Respond to queries and enquiries from patients as well as their relatives, including next of kin regarding deceased patients.&lt;/li&gt;\n&lt;li&gt;Write annual reports relating to the finances of each patient for whom we act as deputy to be submitted to the Office of the Public Guardian.&lt;/li&gt;\n&lt;li&gt;Provide cover in the Cashiers Office on a regular basis paying out patients’ allowances and reimbursing petty cash claims.&lt;/li&gt;\n&lt;li&gt;Provide administration support to those patients for whom the Trust does not act as an appointee or deputy.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Candidates must be educated to GCSE level including Maths and English and have a good level of I.T literacy with some experience in a customer facing role. They should be highly personable with excellent communication and listening skills. They should also have strong numerical and analytical skills and have a high degree of competency in the use of Excel. In addition, they should be well organized, be able to deal with a busy workload and meet multiple deadlines.&lt;/p&gt;\n&lt;p&gt;Some knowledge of the benefits system and experience of dealing with the Department of Work and Pensions and other Government bodies would also be desirable.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located within the impressive grounds of Springfield University Hospital in Tooting and we also operate in nearly 100 other locations throughout the UK. This is easily accessible via the Northern Line (Tooting Bec Station) and via private transport. The Trust provides subsidised parking fares for all our substantive staff. Our main site is located immediately next to Tooting High Street where staff can easily access a range of shops, cafés, restaurants etc.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Ilunga, Senior Hospital Cashier&lt;/p&gt;\n&lt;p&gt;Email address emma.ilunga@swlstg.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 020 3513 6413&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, London", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Patient Finance Officer - Band 4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248118", "validThrough": "2020-11-09T23:59:59+0000"}