{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 per annum"}}, "datePosted": "2020-10-21T10:30:22+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Health Care Assistant – Band 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Dean Ward, Wotton Lawn Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £19,737 to £21,142 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for a Band 3 HCA to join the very experienced, dedicated and accredited team at Wotton Lawn Hospital. Dean Ward is a 15 bedded single sex female open acute ward that takes admissions from the Gloucester locality area.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wotton Lawn is an 88 bed Acute Mental Health Hospital situated in the centre of the historic city of Gloucester and provides inpatient services to the population of Gloucestershire. It offers a vital service to the citizens of Gloucestershire in supporting and rehabilitating those suffering from mild to severe mental health problems. All wards are serviced by an enthusiastic, multi-professional team of people, including Doctors, Nurses, Allied Healthcare Professionals and Therapists who are supported by Ward Secretaries and Hotel Services Staff. At the Gloucestershire Health and Care Foundation Trust we pride ourselves on providing care and support to those experiencing mental health and learning disabilities in order to make life better together. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for highly motivated people who are willing to become involved in our team continuing to move our acute services forward.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will undertake a support role in assisting qualified Nurses in the delivery of individualised nursing care and creating a welcoming and therapeutic environment. Flexibility, creative thinking and a sensitive approach to working with individuals with a range of mental health problems are the key skills required. Although no formal qualifications are required you will be expected to undertake a comprehensive induction programme and receive a range of mandatory and vocational training opportunities.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post requires working shifts across the seven day period including weekends and nights.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post requires the post holder to be able to undertake all mandatory training including Control &amp; Restraint/Breakaway (subject to Occupational Health Clearance).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Health Care Assistant/ Support Worker you will be responsible for participating and assisting in the delivery of care / services to patients and service users as part of a Mental Health and Social Care Health Service. Health Care Assistant, Social Care Workers and other Healthcare Support Workers employed by the Trust are required to follow the guidance set out in Code of Conduct for Health Care Assistants/ Health Care Support Workers to provide safe and compassionate care of a high standard, and to challenge others who are not. You will receive direct supervision and partake in reflective practice / training on a regular basis and be required to meet the Care Certificate standards.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL1 3WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.867", "longitude": "-2.22789"}}, "title": "Health Care Assistant - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235858", "validThrough": "2020-11-16T23:59:59+0000"}