{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19768", "minValue": "19768", "unitText": "YEAR", "value": "11.76"}}, "datePosted": "2020-11-03T15:59:12+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for someone to help provide support within the Estates Department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that works well together ensuring the hospital can work to full capacity?  This location is easily accessible by public transport and has onsite parking.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you answered yes, &lt;strong&gt;The Princess Alexandra NHS Trust would love to hear from you&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a long-term placement opportunity available for a &lt;strong&gt;Mechanical Technician&lt;/strong&gt; available at Princess Alexandra Hospital&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hourly rate is £11.76ph&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Responsibilities will cover several areas such as;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Carry out Planned Preventative Maintenance (PPM) and breakdown maintenance to all aspects of mechanical plant, distribution and equipment including work of a technical and/or non-routine nature.  Perform duties covering the testing and fault finding on a wide range of mechanical engineering plant and equipment, including but not restricted to; building control &amp; automation, standby generators, steam raising plant and associated equipment, and theatre ventilation services.  &lt;/li&gt;\n&lt;li&gt;The post holder will assist in providing a day to day maintenance service and support for the department. The post holder will be part of a multidisciplinary team able to work autonomously but will be guided by occupational policies and procedures. Will contribute to partnership working by supporting the department in delivering goals and objectives by supporting continuous improvement in own performance and the performance of the directorate. Attending training, development and other activities aimed at improving own skills for the benefit of the organisation and patient care. Participate in an on-call rota or shift pattern if required.&lt;/li&gt;\n&lt;li&gt;The post holder should have a formal recognised engineering/ building services qualification to BTEC/HNC, together with a recognised apprenticeship in an appropriate discipline or relevant equivalent experience. Will be experienced in a varied range of work procedures and practices including fault finding, repair and replacement but in relation to mechanical and plumbing (including gas) etc. or electrical systems.&lt;/li&gt;\n&lt;li&gt;To respond to requests for repairs, faults and emergencies involving all aspects of electrical or mechanical &amp; building services - The post holder will be required to assess the situation in the event of such requests or emergency situations and as a first measure, act to ensure safety of public/patients/other staff then to either affect repairs or summon assistance as required.&lt;/li&gt;\n&lt;li&gt;Understand, diagnose and repair faults in electrical or mechanical engineering plant and equipment, to deal with new situations as they arise. Re-assemble, erect and install new work.&lt;/li&gt;\n&lt;li&gt;Understand the workings of all non-specialist and specialist electrical or mechanical systems in PAH and associated properties. &lt;/li&gt;\n&lt;li&gt;Competently deal with new or unusual complex situations as they arise.&lt;/li&gt;\n&lt;li&gt;Able to work in isolation or as part of a team to complete tasks within agreed timescales. Able to work autonomously across the trust sites, ensuring patient, public and staff safety is paramount.&lt;/li&gt;\n&lt;li&gt;Participate in essential training required to ensure the trust is compliant with statutory regulations. Participate in personal development and on-going learning.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Do you have the following skills …?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Organised&lt;/li&gt;\n&lt;li&gt;Computer Literate&lt;/li&gt;\n&lt;li&gt;Good time keeping&lt;/li&gt;\n&lt;li&gt;Able to work as part of a team and under your own initiative&lt;/li&gt;\n&lt;li&gt;Versatile&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Essential&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HNC or NVQ III Technician’s Certificate or equivalent level qualification through apprenticeship in relevant topic.&lt;/li&gt;\n&lt;li&gt;Must have completed a suitable Mechanical or Electrical Apprenticeship&lt;/li&gt;\n&lt;li&gt;City &amp; Guilds craft Certificates Mechanical or equivalent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Desirable&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;17th edition electrical certificate or competent person for L.V. Medical gases and gas safe.&lt;/li&gt;\n&lt;li&gt;Qualification and experience in Fire Alarms, Control Systems, or Mechanical / Motor Con BTEC or City and Guilds In Medical Gas Pipeline and Vacuum Systems and Btec or City and Guilds In Decontamination Equipment And Sterilisation.&lt;/li&gt;\n&lt;li&gt;Electrical or Mechanical Testing and Inspection&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Princess Alexandra Hospital NHS trust plays a huge part in west Essex and east and north Hertfordshire&#39;s way of life. &lt;/p&gt;\n&lt;p&gt;The trust runs a busy hospital, The Princess Alexandra Hospital and provides services at St. Margaret&#39;s Hospital and Herts and Essex Hospital. Together we serve a population of around 350,000 people&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt; Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to hearing from you soon. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harlow", "postalCode": "CM20 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7713", "longitude": ".086331"}}, "title": "Mechanical Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254687", "validThrough": "2020-11-17T23:59:59+0000"}