{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907- £30,615 PA pro rata"}}, "datePosted": "2020-10-28T14:01:35+0000", "description": "&lt;p&gt;&lt;strong&gt;Heart Centre&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Band 5 Staff Nurses&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Cardiothoracic Critical Care&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;The Heart Centre at the University Hospital of North Midlands is a tertiary centre delivering high quality Cardiology and Cardiothoracic Surgery to the population of Staffordshire, Shropshire, East Cheshire and North Wales. &lt;br /&gt;The level of activity within centre continues to grow year on year and we are proud to be developing exciting innovative programs such as TAVI, Atrial appendage Occlusion and MICAB (minimally invasive coronary artery bypass)&lt;br /&gt;&lt;br /&gt;We provide coronary artery bypass grafting, heart valve and lung surgery plus chest trauma as part of the regional Trauma Centre status of UHNM&lt;br /&gt;&lt;br /&gt;We have a 32 bedded pre and post-operative inpatient ward of which 8 beds are for level 1 care, it also incorporates a dedicated pre admission service.&lt;br /&gt;Cardiothoracic Critical Care is a 16 bedded department of level 2 and level 3 facilities providing invasive and non-invasive treatment to patients requiring emergency and elective cardiothoracic surgical care. &lt;br /&gt;We currently have a vacancy providing an exciting opportunity for a Band 5 Staff Nurse to join the team in the Heart Centre within the Cardiothoracic Intensive Care&lt;br /&gt;&lt;br /&gt;You will participate in innovative and evidence based nursing practice through professional leadership and supporting the clinical team in close liaison with the Sister and Junior Sisters.&lt;br /&gt;&lt;br /&gt;We are a proactive team in developing the specialist skill required to deliver our services, recognising that investment in and training of individuals is crucial to delivering high quality patient care.&lt;br /&gt;&lt;br /&gt;You will act as a credible and professional role model whilst developing both personally and professionally to achieve your maximum potential delivering on the implementation and development of care standards to reflect the “Proud to Care” initiative and will ensure that nursing practice is evidenced based according to Professional and National guidelines.&lt;br /&gt;&lt;br /&gt;We will support you with a comprehensive induction and mentorship package providing you with a dedicated mentor to ensure that you are able to acquire the skills and knowledge to develop as a registered nurse within the Cardiothoracic Specialty.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;You will be responsible for ensuring that quality; safe, patient focused care is delivered within the Heart Centre, working with the other ward, departments and professions within the MDT to ensure efficient service delivery. &lt;br /&gt;&lt;br /&gt;The successful candidate will be enthusiastic, flexible, committed to the provision of excellent standards of care, a good communicator, and motivated to build on existing professional development.&lt;br /&gt;Essential requirements for the post are:&lt;br /&gt;&lt;br /&gt;• First level registration&lt;br /&gt;• Experience within an acute care setting as a registered nurse&lt;br /&gt;• Evidence of excellent attendance&lt;br /&gt;• Participation in a 24/7 roster within the inpatient areas&lt;br /&gt;&lt;br /&gt;We offer a comprehensive preceportship package and the ability to rotate into critical care to gain level 2/3 nursing skills.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Matron Angela Huscroft or Deputy Matron Joanne Hallett on 01782 675940&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Stoke Hospital, Stoke on Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Band 5 Staff Nurse Cardiothoracic Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246891", "validThrough": "2020-11-11T23:59:59+0000"}