{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 pa inc HCA"}}, "datePosted": "2020-10-26T15:46:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 - Highly Specialised Clinical Cardiac Physiologist, Clinical Cardiac Physiology &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Plus 10% RRP and 5% HCA&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hertfordshire is known for its historic estates, countryside and of course, that glorious cathedral... but the county is also awash with other wonders. Visit the sets from the Harry Potter films at Warner Bros studio, without catching the train from Platform 9¾! St Albans Cathedral, Tring Natural History Museum, Hatfield House, and Verulamium Park &amp; Museum are all waiting to be discovered within a short distance from any one of the 3 hospital sites.&lt;/p&gt;\n&lt;p&gt;West Herts Hospitals NHS Trust (WHHT) is a busy and dynamic acute trust covering a population of 700,000 across 3 sites in beautiful Hertfordshire (Watford, Hemel Hempstead, and St Albans) easily accessible via M1 and M25 motorways and within easy access of London by public transport with Watford only 20 minutes from Central London.&lt;/p&gt;\n&lt;p&gt;The Cardiology department is particularly forward thinking with 13 Consultant Cardiologists, 2 catheter laboratories (which are undergoing a £1.7m refurbishment this year) and the full range of invasive and non-invasive cardiology including PCI, complex device implantation and conventional EP.&lt;/p&gt;\n&lt;p&gt;West Herts provides an extensive CRM service that comprises of ILR, pacemaker, ICD and CRT optimisation clinics and includes a well-established remote follow-up service. This has been reviewed and extended during Covid-19 and we have taken the opportunity to not only develop the remote follow-up service but introduce flexible working, with staff having the benefit to ‘work from home’.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have had experience in both training and managing within CRM but would also relish the challenge of taking part in developing the IT structure of the department and it’s aspiration to become paperless.&lt;/p&gt;\n&lt;p&gt;Further modernisation will see a digital only cardiac devices database and Holter analysing system networked between the three sites.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have BSc in Physiological Sciences or equivalent and accreditation with BHRS or IBHRE (or equivalent). Personal research or clinical interests including on-going postgraduate study will be supported where possible.&lt;/p&gt;\n&lt;p&gt;The post holder will be primarily based at Watford with rotation to St Albans and Hemel Hempstead Hospitals.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Barbara Bosch - Cardiac Physiology Department Lead on 01923 436246 or Tony Mason – Lead Cardiac Physiologist for EP, Cath Lab &amp; Training on 01923 436491&lt;/p&gt;\n&lt;p&gt;CRM Consultant Cardiologist, Phillip Moore, phillip.moore@whht.nhs.uk or EP Consultant Cardiologist, Mike Koa-Wing, mike.koa-wing@whht.nhs.uk - can also be contacted.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford Hospital, Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 7 - Highly Specialised Clinical Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243204", "validThrough": "2020-11-09T23:59:59+0000"}