{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "6976", "minValue": "6976", "unitText": "YEAR", "value": "£4.15 per hour"}}, "datePosted": "2020-10-27T14:45:22+0000", "description": "&lt;h1&gt;Non-Emergency Patient Transport Services Apprentice **18 months fixed term apprenticeship**&lt;/h1&gt;\n&lt;p&gt;Salary:            £4.15 per hour&lt;/p&gt;\n&lt;p&gt;Hours:            37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Base:              Frankley, B45 0LD&lt;/p&gt;\n&lt;p&gt;West Midlands Ambulance Service University NHS Foundation Trust is looking to recruit apprentices for our Non-Emergency Patient Transport contract.&lt;/p&gt;\n&lt;p&gt;On successful completion of the apprenticeship you will obtain Healthcare Support Worker Level 2 Apprenticeship Standard in participation with Performance through People.&lt;/p&gt;\n&lt;p&gt;The post holder will perform the duties of a Non-Emergency Patient Transport Apprentice complying with protocols and local agreements with a high duty of care. The main purpose is to transport patients with varying mobility&#39;s to and from treatment centres or other venues as directed, this may be by car or ambulance or other vehicles.&lt;/p&gt;\n&lt;p&gt;The successful candidate must be willing to complete a Level 2 Intermediate Apprenticeship qualification and already hold English and Maths qualifications at Level 1&lt;/p&gt;\n&lt;p&gt;Applicants must also be willing to undertake training in the use of Ambulance Service lifting equipment and first aid and resuscitation techniques and Driver training.&lt;/p&gt;\n&lt;p&gt;During the 18 months contract, applicants &lt;strong&gt;must&lt;/strong&gt; obtain their full driving licence showing no more than 3 points and DVLA Group 2 Standards.&lt;/p&gt;\n&lt;p&gt;This position involves a regulated activity which will require an Enhanced Disclosure &amp; Barring Service check. The disclosure will, where appropriate to the role, include information against the Independent Safeguarding Authority barred lists for working with children, adults or both.&lt;/p&gt;\n&lt;p&gt;Where a Disclosure &amp; Barring Service (DBS) check is required for the post, applicants are required to cover the cost of the check. The cost (£49 for an enhanced check or £30 for a standard/basic check) is payable to our online provider at the time that the DBS application is submitted.&lt;/p&gt;\n&lt;p&gt;West Midlands Ambulance Service positively welcomes diversity and aims to be a truly inclusive place to work. We are looking for self-motivated, enthusiastic people from all backgrounds that care about making a difference.&lt;/p&gt;\n&lt;p&gt;We also support the ‘Disability Confident’ scheme and therefore guarantee to invite to assessment all applicants with a disability who meet the standards required for a job vacancy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Please ensure you check your NHS Jobs account regularly as this is how we will communicate with you.&lt;/li&gt;\n&lt;li&gt;Do not delete the job from your account until you are certain you have not been shortlisted as this will prevent you from accessing any messages or important documents you may need to download.&lt;/li&gt;\n&lt;li&gt;To enquire about your application or inform us of any changes in your circumstances please make contact by emailing the Recruitment Team (recruitment@wmas.nhs.uk) and not through the NHS Jobs website as these messages are not monitored.&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including their email address, telephone contact details and postal address.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;If you are unable to apply online, please contact the Recruitment Team on 01384 215896 for a paper application form.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE READ THE ATTACHED DOCUMENT ENTITLED INFORMATION AND GUIDANCE FOR APPLICANTS.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;                                                                                                                                   &lt;/p&gt;\n&lt;p&gt;Closing date for return of applications: &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Monday 9th November 2020&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note: Only fully completed application forms will be accepted.&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "West Midlands Ambulance Service University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122792"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B45 0LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4045", "longitude": "-2.00706"}}, "title": "NEPTS Apprentice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245014", "validThrough": "2020-11-09T23:59:59+0000"}