{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on Experience"}}, "datePosted": "2020-11-01T08:15:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Division of Anaesthetics and Pain Management&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for this post-completion of specialist training Clinical Fellow in Pain Medicine and Neuromodulation at ST7 level for a fixed term of twelve months. This is a continuation post working between Basildon and Orsett Hospitals for the Pain Management service as part of the Division of Surgery. The Pain Management Service offers a full range of outpatient and inpatient pain management services, in particular a vibrant neuromodulation service offering neurostimulation and intrathecal drug delivery. Most interventional pain procedures are undertaken with the exception of cordotomy and trigeminal treatments. The pain management service also provides other services including an out-patient group based pain management programme, understanding pain through education sessions, medication management, physiotherapy, psychology and TENS. There are weekly multi-disciplinary team meetings.&lt;/p&gt;\n&lt;p&gt;Pain management services are structured into 3 commissioning layers of community, specialist and highly specialist, through a hub and spoke arrangement with the University College Hospital, London. We expect to offer highly specialist pain services such as selection, implantation and maintenance of intrathecal drug delivery for pain and spasticity.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to commence in 2020/21 and should have full registration with the General Medical Council, evidence of CST and have completed Advanced Pain Training in Pain Management or equivalent.&lt;/p&gt;\n&lt;p&gt;The Pain Management Service (PMS) serves a population of 350,000 across South West Essex and offers neuromodulation services to Essex (population 1.8 million) and beyond. It is staffed by two Consultants (Dr Simon Thomson, Full Time Pain Medicine and Dr Malvern May, Part Time Pain Medicine) and one Locum Consultant (Dr Lalith Jayasekera, part time Pain Medicine. The PMS is managed and supported by a team of three outpatients and four inpatient Nurse Specialists in Pain Management. The service also has three part time pain specialist Physiotherapists and part time pain Psychology colleagues.&lt;/p&gt;\n&lt;p&gt;Currently about 70 new patients per year receive a trial of spinal cord stimulation with a greater than 90% implant rate. In addition to the spinal cord stimulator service we also have a number of patients with intrathecal pumps that are managed under the supervision of the consultant and refills are provided by a consultant/clinical fellow/neuromodulation nurse.&lt;/p&gt;\n&lt;p&gt;The post holder is expected to have experience and subspecialist knowledge in Pain Medicine and be able to work independently but under the mentorship of Dr. Thomson. The post holder is expected to work in conjunction with consultants and all colleagues from the Anaesthetic Department.&lt;/p&gt;\n&lt;p&gt;There is an active research portfolio, therefore the post holder will be expected to have an up to date Good Clinical Practice Training certificate and to participate fully in all allocated research projects.&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Current projects for 2018/2019 include a Health Economic assessment of a cohort of patients with chronic refractory low back pain who were selected for multifidus nerve stimulation with Reactiv8 device from Mainstay Medical.&lt;/li&gt;\n&lt;li&gt;A prospective double blind randomised controlled trial to evaluate the effects of neural dosage on analgesia in sub kilohertz SCS&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Basildon and Thurrock University Hospitals NHS Trust has an ongoing commitment to first class service delivery and innovative long-term initiatives and has Associate University Hospital Teaching Status with University College London.&lt;/p&gt;\n&lt;p&gt;The Trust is situated in the South East of England, close to London and the M25.&lt;/p&gt;\n&lt;p&gt;We have an on-site Nursery for under 5’s. Help and advice with childcare needs is also available via the Trust’s Childcare Co-ordinator&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSimon ThompsonJob titleLead Consultant in Pain ManagementEmail addressSimon.Thomson@btuh.nhs.ukTelephone number01268 524900 Ext 2268Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact: Dr. Simon Thomson via his Patient Pathway Co-ordinator on 01268 592268 or Simon.Thomson@btuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Angela Stark&lt;/p&gt;\n&lt;p&gt;Clinical Nurse Specialist for Pain Management&lt;/p&gt;\n&lt;p&gt;Orsett Hospital&lt;/p&gt;\n&lt;p&gt;01268 524900 Ext 2268&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Orsett Hospital, Orsett", "postalCode": "RM16 3EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.51", "longitude": ".365878"}}, "title": "Senior Clinical Fellow in Pain Management", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251170", "validThrough": "2020-11-13T23:59:59+0000"}