{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 per annum"}}, "datePosted": "2020-11-03T15:16:12+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen in the Shoreham Primary Care Network (PCN) community team. We are looking for a dynamic and enthusiastic Staff Nurse to join our supportive team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The emerging PCNs are groups of practices working together in collaboration with community and other health and care services. PCNs enable greater provision of proactive, personalised, coordinated and integrated health and social care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is ideal for a nurse who would like the opportunity to experience community work or further develop their interests in the community setting. We also encourage newly qualified nurses to apply and they will be fully supported with a preceptorship programme.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role incorporates the day to day management of patients within the community under the supervision of the Clinical Lead, involving a variety of skills including wound care, continence management, palliative care, health promotion, venepuncture and more. Training will be available and the successful candidate will be supported with an induction and a personal development plan.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must be able to work autonomously as well as part of a team. The team use SystmOne and mobile working. You must also hold a full driving licence and have the use of a car for work purposes.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are patient-centred, committed to delivering high quality care, have excellent communication skills, a “can do” attitude and a desire to be the best then this is the job for you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicky Bibey/Karin Morris-Team Lead&lt;/p&gt;\n&lt;p&gt;nickybibey@nhs.net&lt;/p&gt;\n&lt;p&gt;07909 938333&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Quadrant, Lancing", "postalCode": "BN15 8UW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.821", "longitude": "-.332133"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254512", "validThrough": "2020-11-15T23:59:59+0000"}