{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T12:16:40+0000", "description": "&lt;p&gt;&lt;span&gt;This post is being advertised to address a temporary need of 6 months however the Trust has made the commitment to offer Registered Nurses a permanent contract with the Trust. In the event that the need for this post ends, a suitable alternative post will be offered (this does not apply to other registered professions). Applicants should be aware that alternatives may require some flexibility on role and/or location.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The TEWV Early Intervention for Psychosis (EIP) service is looking for an individual with experience and skill to make a significant contribution to the delivery and development of EIP in Harrogate, Hambleton &amp; Richmondshire. The service works with people aged 14 -65 years interfacing with Adult and CAMHS services, delivering intervention for individuals experiencing a first episode of psychosis and At Risk Mental State. The service is commissioned to deliver the National Access and Waiting time standard which requires us to deliver timely NICE concordant care. The post holder will have a job plan that primarily focuses on providing family intervention to service users and their families.&lt;/p&gt;\n&lt;p&gt;You will be required to hold RMN or equivalent mental health core qualification at degree level post 1993 &amp; be trained in, and have experience delivering, Behavioural Family Therapy for Psychosis.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to providing support and supervision for continuing professional development and we have an excellent track record for developing our workforce. We provide excellent opportunities for peer support/supervision, CPD, teaching/training, and research and audit in line with strategic developments. There are also strong links to local Higher Education Institutions as we are key providers of academic and clinical experience components both in terms of teaching and supervision.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must ensure that prior to applying they have agreement from their current line manager that they can be released on a secondment basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In the event that permanent funding is secured for this post the successful applicant will be confirmed in post on a permanent basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Deborah Halliday, EIP Manager&lt;/p&gt;\n&lt;p&gt;deborah.halliday@nhs.net&lt;/p&gt;\n&lt;p&gt;01765632920&lt;/p&gt;\n&lt;p&gt;Also available :&lt;/p&gt;\n&lt;p&gt;Alix Bowler: Alix.bowler@nhs.net&lt;/p&gt;\n&lt;p&gt;Martin Hopkins: 01904 464850 Martin.hopkins1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Orchards Community Base, Ripon", "postalCode": "HG4 1HZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1392", "longitude": "-1.52021"}}, "title": "Community Senior Practitioner : Family Intervention post", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246523", "validThrough": "2020-11-11T23:59:59+0000"}