{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum"}}, "datePosted": "2020-11-05T14:01:01+0000", "description": "&lt;p&gt;Cornwall Foundation Trust - Child and Adolescent Mental Health Service’s Crisis Team are undergoing exciting development and changes due to significant investment to support crisis mental health services for young people across Cornwall.&lt;/p&gt;\n&lt;p&gt;We are therefore looking for individuals to expand our existing dynamic team that are good under pressure; place high worth in team based working but can also work autonomously; who have an unrelenting passion and dedication for working with young people and their families.&lt;/p&gt;\n&lt;p&gt;It is an exciting time to be joining Cornwall CAMHS with the recent opening of our amazing newly built in patient unit - Sowenna; Cornwall is leading the way on a ground-breaking Clinical Associate Psychology (CAP) service, the first of its kind anywhere in England and Wales. There has also been major investment in developing care pathways for CAMHS as well as the Crisis Team developments&lt;/p&gt;\n&lt;p&gt;Cornwall is a beautiful and fun place to live, with opportunities to enjoy activities on the sea, rivers, beaches and moors. Summers are busy and full of entertainment and winters allow you to have to have peace, quiet and whole beaches to yourself&lt;/p&gt;\n&lt;p&gt;The Crisis team work from the Sowenna inpatient unit and Royal Cornwall Hospital. We work intensively with young people with acute mental health difficulties and are in crisis, offer psychosocial risk assessment to young people who present at the general acute hospitals, work closely with our new CAMHS inpatient unit and community CAMHS teams&lt;/p&gt;\n&lt;p&gt;We have several opportunities across the Crisis team that include Support workers, practitioners and senior practitioners who have a keen desire to work with young people in mental health crisis.&lt;/p&gt;\n&lt;p&gt;Work is on a shift basis over 7 days a week, 365 days a year.&lt;/p&gt;\n&lt;p&gt;The team also offers short term intensive interventions to young people with a significant mental illness/disorder or are emotionally dysregulated and displaying high risk behaviour relating to their mental health offering home treatment as an alternative to hospital admission.&lt;/p&gt;\n&lt;p&gt;Additional support for the team is provided by the On Call Managers, the CAMHS consultants and the wider CAMHS team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Chloe Parkin&lt;/p&gt;\n&lt;p&gt;Job title Team Manager&lt;/p&gt;\n&lt;p&gt;Email addresschloe.parkin@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number07884233989&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact Chloe Parkin or Freya Watts on 01208 843342, for further information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sowenna, Bodmin Hospital / Royal Cornwall Hospital, Bodmin/Truro", "postalCode": "PL31 2QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4683", "longitude": "-4.74305"}}, "title": "CAMHS Crisis Practitioner - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258011", "validThrough": "2020-11-19T23:59:59+0000"}