{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-21T12:16:11+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Elderly and Acute Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Brighton &amp; Sussex University Hospitals&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a new colleague to join our friendly, supportive department. The post is based in Brighton at the Royal Sussex County Hospital.&lt;/p&gt;\n&lt;p&gt;Brighton is an exciting place to work, with our department due to move into the new building (as part of the 3T’s project) in 2021, and a rapidly improving reputation, including being rated “Outstanding” for care by the CQC in 2019. As an academic department we support research and innovative projects, such as Small Acts of Friendship, which has gained national attention.&lt;/p&gt;\n&lt;p&gt;This post involves day-to-day care of patients on the Acute floor, Rapid Access Clinic for Older People and other specialist roles such as syncope, falls, surgical liaison, community or other clinics as per the candidate’s interests. There is also the option for some sessions to be done within the acute medicine department.&lt;/p&gt;\n&lt;p&gt;We are a teaching hospital and as such are supportive of developing our consultants as educators. We operate a shared leadership model within the department which means we all participate in the running of the department. This provides an excellent space for support, with a mix of experience and skills within our group.&lt;/p&gt;\n&lt;p&gt;At RSCH we operate a hybrid rota and can accommodate full-time or less than full time working. We use Healthrota software for an annualised rota within the department, which increases flexibility while still working within the agreed number of PA’s.&lt;/p&gt;\n&lt;p&gt;Please refer to the person specification in the job description with regards to CCT requirements.&lt;/p&gt;\n&lt;p&gt;When completing the application form please ensure you complete the section relating to your CCT date. If you have already have your CCT please confirm when you will be on the GMC Specialist Register. Please be aware you only have 12 months from your CCT to join the specialist registrar otherwise you will have to go through the CESR Route.&lt;/p&gt;\n&lt;p&gt;In addition to supplying us with your referee details for the last 3 years please also provide us with the contact details of your Responsible Officer for Appraisal and Revalidation&lt;/p&gt;\n&lt;p&gt;In the interest of equal opportunities, we want to make sure that information about candidates is provided in the same format so all applicants should fill in the standard application form on the NHS Jobs website and attach their cv.&lt;/p&gt;\n&lt;p&gt;Closing date 22 November 2020&lt;/p&gt;\n&lt;p&gt;NO AGENCIES&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMuna Al-JawadJob titleConsultantEmail addressmuna.aljawad@nhs.netTelephone number01273 696955Additional contact information&lt;/p&gt;\n&lt;p&gt;If you are interested in discussing this post further, or visiting the Department prior to short-listing please contact Muna Al-Jawad (muna.aljawad@nhs.net) or Andrew Leonard (Andrew.leonard@nhs.net) via email or by calling 01273 696955.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Consultant in Elderly and Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236326", "validThrough": "2020-11-22T23:59:59+0000"}