{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-23T13:00:45+0100", "description": "&lt;p&gt;Shropshire Community Health NHS Trust provides a range of community-based health services for adults and children in Shropshire, Telford and Wrekin. We aim to provide high quality health services delivered wherever possible close to where people live - at home, in local clinics and at community hospitals.&lt;/p&gt;\n&lt;p&gt;We are recommended by colleagues as a place to work which is supported by the Trusts values to work as part of a team, being respectful, compassionate and professional. We are committed to investing in our workforce.&lt;/p&gt;\n&lt;p&gt;Following our recent CQC visit in 2019 the Trust received the overall rating as good.&lt;/p&gt;\n&lt;p&gt;We have a fantastic opportunity for you to join our motivated and dynamic Adult Community Services. The Locality Clinical Manager is responsible for the safe and effective delivery of a range of community services. This post is 1 of 6 localities across Shropshire, including Telford and Wrekin.&lt;/p&gt;\n&lt;p&gt;You will have a good understanding of leading, delivering and improving services in a changing system. You will be committed to high quality patient care, collaborate with our patients, families and carers and be committed to your own and others development.&lt;/p&gt;\n&lt;p&gt;In return we will offer you continual professional and personal growth and the opportunity to work in a supportive leadership team reporting to the Head of Nursing and Operations.&lt;/p&gt;\n&lt;p&gt;This post is suitable for candidates who are already qualified for the position and meeting the Person Specification, but also as a development opportunity for candidates looking to move into Operational Management. There would be support given by Operational Managers through using a ‘buddy’ system and mentoring. If you have the drive and ambition required for this position, please call to discuss further.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact: Mandee Worrall, Head of Nursing and Operations (Adults) 07783258573.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Stakeholder Panel Interview: 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Panel: 17th November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127016.jpg", "name": "Shropshire Community Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127016"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury", "postalCode": "SY3 8XL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7074", "longitude": "-2.79305"}}, "title": "Locality Clinical Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240619", "validThrough": "2020-11-08T23:59:59+0000"}