{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-26T10:30:57+0000", "description": "&lt;p&gt;&lt;strong&gt;Previous Candidates need not apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fire Safety Adviser&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to support the Trust with the effective management of Fire Safety. This post will work to the Trust Senior Fire Safety Adviser and is based within the Trust Health and Safety Team.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and enthusiastic individual with significant experience of Fire Safety to join the Trust Health and Safety Team.&lt;/p&gt;\n&lt;p&gt;This post will work across Trusts sites to support the Trust, Divisions, Directorates and Teams in meeting their statutory responsibilities and fire safety needs.&lt;/p&gt;\n&lt;p&gt;The Fire Safety Team provides a range of specialist expert advice and assistance to a wide range of staff, senior managers and Trust Directors and experience of fire risk assessments in complex settings is essential together with relevant fire safety qualifications.&lt;/p&gt;\n&lt;p&gt;You will require experience of producing and delivering training, supported by a relevant training qualification.&lt;/p&gt;\n&lt;p&gt;You will be required to provide specialist support to the Trust on all aspects of fire safety, providing support for implementing the Trusts Fire Safety Policy.&lt;/p&gt;\n&lt;p&gt;Knowledge of relevant Building Control Guidance documents and current fire safety legislation is essential. You should have significant experience of fire safety awareness including the relevant NHS standards and legislative requirements.&lt;/p&gt;\n&lt;p&gt;We aim to provide a friendly and professional working environment, whilst delivering a high standard of customer care.&lt;/p&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSimon ThomasJob titleSenior Fire Safety AdviserEmail addresssimon.thomas@nottshc.nhs.ukTelephone number07970115594Additional contact information&lt;/p&gt;\n&lt;p&gt;Ian Freegard – Trust Health and Safety Manager 07788416157– Simon Thomas – Senior Fire Safety Adviser - 07970115594&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Duncan Macmillan House, Nottingham", "postalCode": "NG3 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9796", "longitude": "-1.12644"}}, "title": "Fire Safety Adviser", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242027", "validThrough": "2020-11-09T23:59:59+0000"}