{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20760", "minValue": "20760", "unitText": "YEAR", "value": "12.35"}}, "datePosted": "2020-11-04T14:30:41+0000", "description": "&lt;p&gt;Title: &lt;strong&gt;Administrator (Band 4)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Location: &lt;strong&gt;Nursing and Governance,   Berkshire Healthcare Upton Hospital, SL1 2BJ&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job reference: &lt;strong&gt;36686&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Hours: &lt;strong&gt;30 Per Week - Combination of working from home and at Upton Hospital (this is an essential requirement)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have placement opportunities available for Administrators available at Berkshire Healthcare NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There are a number of opportunities for experienced Administrators with significant experience in managing spreadsheets.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A key role of the administrator will be to accurately co-ordinate and maintain the non-medical prescribing database for the organisation under the direction of the non-medical prescribing lead. Support process for receipt of community FP10 prescriptions and maintain a robust process for ensuring safe storage of prescriptions and an audit trail for supply to the named nurse prescriber.&lt;/p&gt;\n&lt;p&gt;To organise and co-ordinate a programme of 15 steps visits across the organisation including the recruitment of team members from within the organisation and a bank of volunteers.&lt;/p&gt;\n&lt;p&gt;To manipulate data in spreadsheets&lt;/p&gt;\n&lt;p&gt;To be methodical, attention to detail, can respond to queries via email, teams, letter etc. &lt;/p&gt;\n&lt;p&gt;To be competent in Microsoft applications – outlook, excel, word and be able to use Teams&lt;/p&gt;\n&lt;p&gt;At Berkshire Healthcare NHS Trust, they have around 6,000 highly trained, qualified doctors, nurses, midwives, health visitors, therapists, healthcare scientists and other support staff caring for more than half a million patients from Berkshire and neighbouring counties every year.&lt;/p&gt;\n&lt;p&gt;Berks deliver this care in a range of ways; from community health services provided in people’s homes or from one of our local bases, to hospitals at Prospect Park, Upton, and Wokingham etc.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Competitive Pay Rates- work this week, get paid next week!&lt;/p&gt;\n&lt;p&gt;First choice of placements at over 50 NHS Trusts in England&lt;/p&gt;\n&lt;p&gt;Dedicated consultants&lt;/p&gt;\n&lt;p&gt;Flexible working options&lt;/p&gt;\n&lt;p&gt;Free DBS and free training&lt;/p&gt;\n&lt;p&gt;Build holiday allowance&lt;/p&gt;\n&lt;p&gt;Support when you need it – 24/7 365 days&lt;/p&gt;\n&lt;p&gt;Stakeholder pension scheme&lt;/p&gt;\n&lt;p&gt;Who are NHS Professionals?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades, and specialties, saving the NHS over£70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Apply&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with the admin and clerical team on 03330 144354.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Disclaimer&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Upton", "postalCode": "SL1 2BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5054", "longitude": "-.59374"}}, "title": "Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256220", "validThrough": "2020-11-18T23:59:59+0000"}