{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum pro rata"}}, "datePosted": "2020-10-27T09:45:46+0000", "description": "&lt;p&gt;&lt;strong&gt;Dementia &amp; Frailty Clinical Service Manager &lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Inpatient Services, Care Home Liaison &amp; Community Enablement and Rehabilitation Team&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;Due to the retirement of the current post holder the Dementia and Frailty Service is seeking to recruit a highly motivated Clinical Nurse Manager to continue to take our services forward based on the needs of our service users.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an enthusiastic and highly motivated individual, with proven leadership and management experience within mental health services who also has the skills set and knowledge to ensure the delivery of high quality mental health care for older people..&lt;/p&gt;\n&lt;p&gt;We are very proud of our Dementia and frailty services and the services they provide to older people with dementia and functional mental health problems. We are committed to the ongoing development of our services to meet the needs of an ageing population across Birmingham &amp; Solihull. Our Inpatient services have played a significant part in the development of the Ageing well programme as part of the Birmingham &amp; Solihull Sustainability and Transformation Partnership (STP). This was very innovative work with our system partners and work we are keen to continue. We believe that our services are innovative, outward facing with a very committed staff group that makes this possible.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for the operational management, leadership, planning and delivery of clinical services across identified service areas. They will also be an active member of the senior management team, contributing to the shaping of our strategic, business and clinical service plans, staff wellbeing and upholding our Trust values across all services..&lt;/p&gt;\n&lt;p&gt;The post-holders will be highly visible spending time in service areas working alongside and supporting team managers and their staff. The post holders will ensure there is a strong focus on the delivery of high quality, safe and effective services. They will have a compassionate and supportive approach to leadership &amp; management. They will work within a multidisciplinary leadership team and develop links with key stakeholders both inside and outside of the organization.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are passionate about compassionate leadership, equality, diversity and inclusion and welcome applications from people with a range of diverse backgrounds who would role model our approach.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Derek Tobin, Associate Director of Operations, Specialties 0121 301 5838.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDerek TobinJob titleAssociate Director of Operations, SpecialtiesEmail addressderek.tobin1@nhs.netTelephone number0121 301 5838&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Juniper Centre, Birmingham", "postalCode": "B13 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4459", "longitude": "-1.89289"}}, "title": "Band 8b Clinical Service Manager - Juniper Centre, Community", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243873", "validThrough": "2020-11-08T23:59:59+0000"}