{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "AfC Band 4 equivalent"}}, "datePosted": "2020-10-28T16:14:49+0000", "description": "&lt;p&gt;&lt;strong&gt;About The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: AfC Band Equivalent 4&lt;/p&gt;\n&lt;p&gt;We are looking to recruit on permanent contract, enthusiastic and forward-thinking registered nurse associate.&lt;/p&gt;\n&lt;p&gt;To work as a member of the General Practice Nursing team, under the guidance of a Registered General Nurse, support the organisation and facilitation of clinical care in a holistic and proactive manner to patients registered at the practice.&lt;/p&gt;\n&lt;p&gt;To maintain a high professional standard of nursing care in adherence to all practice protocols/policies &amp; guidelines. To provide nursing assistance to the GPs and other members of the primary healthcare team.&lt;/p&gt;\n&lt;p&gt;The role of the Nursing Associate needs to be flexible in line with the present atmosphere for change within the health service delivery. It is essential that the nursing associate works within their own level of competency and expand her/his role in accordance with practice requirements and own scope of practice.  &lt;/p&gt;\n&lt;p&gt;This is a full time post working 37.5 hours per week covering the 4 Primary Care Network surgeries.&lt;/p&gt;\n&lt;p&gt;All flexible offers and working arrangements will be considered.&lt;/p&gt;\n&lt;p&gt;If you would like to find out more information and discuss further, please contact Georgina Morgan - georgina.morgan3@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This role is also being advertised on the Essex Primary Care Careers website – please &lt;/em&gt;&lt;em&gt;complete only one application.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have the right to close the advert earlier if we reach the maximum number of applications.&lt;br /&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;NO AGENCIES PLEASE&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are a qualified and experienced registered nurse associate looking for a new and exciting change in Primary Care then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;You will have the following skills and qualifications:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Foundation degree, Registered Nursing Associate and NMC Registration&lt;/li&gt;\n&lt;li&gt;Experience of working within a healthcare setting prior to foundation degree training.&lt;/li&gt;\n&lt;li&gt; Flexible and adaptable approach to a varied and high volume workload with the ability to multi-task and to work under pressure;&lt;/li&gt;\n&lt;li&gt;Consistently compassionate and respectful approach placing a high value on the dignity of patients, relatives, carers and colleagues.&lt;/li&gt;\n&lt;li&gt;Ability to communicate effectively with colleagues, patients, relatives, nurses, other staff and agencies;&lt;/li&gt;\n&lt;li&gt;Commitment to continuing professional development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants will be, self-motivated and work well as part of a large team. You will be flexible and adaptable and possess an appreciation of the management principles required to support clinically safe, evidence-based practice.&lt;/p&gt;\n&lt;p&gt;You should be computer literate, confident in working independently and be a car owner/driver. You will be required to lead by example, setting and maintaining high standards of professionalism within a team environment. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We formed our Primary Care Network, to work together to enable us to operate more efficiently and ensure that a greater proportion of our resource is focused on clinical care and improved access. Our PCN covers 4 practices across Mid Essex with 38,129 patients. We use SystmOne&lt;em&gt; &lt;/em&gt;clinical system across our practices.&lt;/p&gt;\n&lt;p&gt;Supporting your work life balance and professional development is important to us, so we will be happy to discuss any requirements for flexible working and offer the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary based on experience&lt;/li&gt;\n&lt;li&gt;Supportive and friendly environment&lt;/li&gt;\n&lt;li&gt;Flexible working hours&lt;/li&gt;\n&lt;li&gt;Peer support&lt;/li&gt;\n&lt;li&gt;CPD Support with training and development&lt;/li&gt;\n&lt;li&gt;Free Onsite Car Parking&lt;/li&gt;\n&lt;li&gt;NHS Pension&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135914.JPG", "name": "Essex Primary Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelmsford", "postalCode": "CM2 6ST"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7351", "longitude": ".505446"}}, "title": "Nurse Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247331", "validThrough": "2020-11-11T23:59:59+0000"}