{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-05T15:03:51+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you an experienced registered nurse motivated by providing outstanding person-centred support and would like to work in a passionate and inspiring environment? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’ve answered&lt;strong&gt; ‘yes’, &lt;/strong&gt;then we would like to hear from you. This is your opportunity to develop your assessment and leadership skills in a diverse setting.&lt;/p&gt;\n&lt;p&gt;Personal Health Commissioning (PHC) has undergone a significant transformation programme and has recently implemented a full-service restructure. We are embarking on a journey of continuous improvement to ensure we are at the forefront of providing high quality, efficient and sustainable services for our population and that the recovery from the Covid-19 crisis is efficient and smooth.&lt;/p&gt;\n&lt;p&gt;The role involves working within the National Framework for NHS Continuing Healthcare and NHS-funded Nursing Care and undertaking assessments for Funded Nursing Care (FNC) and making a determination of nursing needs. There may also be occasions where you are required to participate in a Multi-Disciplinary Team to assess whether an individual has a primary health need using a Decision Support Tool (DST)&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for motivated and experienced registered nurses with excellent communication skills and a flexible approach to work to join us as a Nurse Practitioner within our team.&lt;/p&gt;\n&lt;p&gt;The successful candidate must be able to work collaboratively with Health and Social Care practitioners, patients, families and carers, ensuring a high quality and timely service is delivered. The practitioner must demonstrate openness and honesty and have strong assessment skills and a knowledge of the National Framework for NHS Continuing Healthcare and NHS-funded Nursing Care&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to join the NHS Dorset CCG as part of the Personal Health Commissioning team as it continues its service transformation. We are committed to the ongoing learning and development of our team and provide opportunities in line with the CHC Competency Framework including peer development and external training.&lt;/p&gt;\n&lt;p&gt;Dorset CCG is a welcoming NHS employer and we offer a wide range of employee benefits and the opportunity to live and work in a beautiful area. We have current vacancies across both our East (Poole) locality.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role, there is a requirement to travel and a full driving licence is essential.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128199.png", "name": "Dorset Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128199"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Canford House, Poole", "postalCode": "BH12 5AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7513", "longitude": "-1.92773"}}, "title": "Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213269", "validThrough": "2020-11-08T23:59:59+0000"}