{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inclusive"}}, "datePosted": "2020-10-27T16:01:30+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a suitably qualified &lt;strong&gt;Registered Mental Health Nurse &lt;/strong&gt;(RMN), to apply for a permanent &lt;strong&gt;Band 6 Psychiatric Liaison Nurse&lt;/strong&gt; post with the &lt;strong&gt;Liaison Psychiatry Team at St Mary’s Hospital in Paddington, London. &lt;/strong&gt;The Team provides a 24 hour adult liaison psychiatry service to St Mary’s Hospital.&lt;/p&gt;\n&lt;p&gt;The Liaison Psychiatry Team is based at the Paterson Cabin which is on the St Mary’s Hospital site. The Liaison Psychiatry Team is an integrated mental health team which includes psychiatric liaison nurses, a specialist HIV nurse and Psychiatrists specialising in Liaison Psychiatry. The team provides assessment and consultation to any patient over the age of 18 years receiving treatment at St Mary’s Hospital.&lt;/p&gt;\n&lt;p&gt;The team has be re-accredited in 2019 by the Psychiatric Liaison Accreditation Network (PLAN).&lt;/p&gt;\n&lt;p&gt;This position is only open to applicants who have significant years or more post registration experience due to the requirement to appoint a nurse with significant knowledge and experience to a front line position. We would expect all applicants to have extensive experience of dealing with psychiatric emergencies and recent experience in one or more of the following areas;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An Adult Acute Psychiatric Admission/Triage ward&lt;/li&gt;\n&lt;li&gt;A Community Mental Health Team&lt;/li&gt;\n&lt;li&gt;A Crisis Resolution Team/Home Treatment Team&lt;/li&gt;\n&lt;li&gt;A Psychiatric Liaison Nurse position or role&lt;/li&gt;\n&lt;li&gt;An Assessment/Triage Team or similar service&lt;/li&gt;\n&lt;li&gt;A Psychiatric Assessment Team in an in-reach/outreach setting&lt;/li&gt;\n&lt;li&gt;A Primary Care Mental Health Team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As you will be expected to work as an autonomous practitioner within 4-8 weeks of commencing in this position, there will not be an opportunity to acquire all of these skills whilst in the position and therefore you must be able to show evidence that you already have extensive relevant experience and possess the skills and knowledge necessary for this challenging role. Appropriate training, support and supervision will be provided by the Team to prepare the successful candidate to work autonomously within a larger Multidisciplinary Team.&lt;/p&gt;\n&lt;p&gt;The applicant must have excellent clinical assessment skills, be able to demonstrate an ability to complete comprehensive mental state examinations, thoroughly assess risk, formulate safe and effective risk management plans and document this clearly and concisely.&lt;/p&gt;\n&lt;p&gt;The applicant must have a warm and friendly disposition and have very good communication and interpersonal skills. They must be a team player, be confident and motivated as well as being flexible and able to show initiative. They must be robust and resourceful and willing to work outside their comfort zone in an environment which can be demanding and stressful.&lt;/p&gt;\n&lt;p&gt;All applicants must have completed a Mentorship in Practice or equivalent course, or be willing to do so, as the Team base is a student nurse training placement&lt;/p&gt;\n&lt;p&gt;The liaison service operates a 24 hours service and it is essential that all applicants are able to work shifts and unsocial hours including nights. The successful candidate must be able to work on a regular shift rota.&lt;/p&gt;\n&lt;p&gt;St Mary&#39;s Hospital is part of Imperial College Healthcare NHS Trust and is based on a large Central London site adjacent to Paddington Mainline and Underground Stations. The hospital is in a very vibrant Central London location providing one of the 4 Major Trauma Centre&#39;s for London along with a busy A&amp;E Department which takes presentations from across London and beyond.&lt;/p&gt;\n&lt;p&gt;Interview Date:TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;James Hughes, Team Manager on 020 3312 3733/07976867992 or Million Moyo, Deputy Team Manager on 020 3312 3733.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paterson Cabin, St Mary&#39;s Hospital, London", "postalCode": "W2 1PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5173", "longitude": "-.176499"}}, "title": "Psychiatric Liaison Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245307", "validThrough": "2020-11-10T23:59:59+0000"}