{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28072", "minValue": "28072", "unitText": "YEAR", "value": "£16.70 per hour"}}, "datePosted": "2020-11-03T13:53:51+0000", "description": "&lt;p&gt;We are looking for a professional, ambitious &amp; confident Registserd Nurse to join our dedicated team, at our specialist personality disorders service in Gloucester.&lt;/p&gt;\n&lt;p&gt;You will be working 42 hours per week at Cygnet Alders Clinic&lt;/p&gt;\n&lt;p&gt;Cygnet Alders Clinic is a 20 bed rehabilitation service providing assessment, treatment and rehabilitation for women with personality disorder and complex needs. Cygnet Alders Clinic is on the Welsh Hospital Framework with specialist service status.&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt;Your Day-to-Day…&lt;/h2&gt;\n&lt;p&gt;• Produce outstanding written reports based on your nursing assessments and observations.&lt;br /&gt;• Work closely with the management team to develop the service, audit, and improve quality.&lt;br /&gt;• Under NMC guidelines, ensure that individual care plans are complete &amp; maintained collectively with residents, relatives and other healthcare professionals.&lt;br /&gt;• Administer prescribed medicines with Healthcare procedure and Healthcare Commission guidelines.&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt;Why Cygnet? We’ll offer you...&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;• NHS and employee discount scheme&lt;br /&gt;• 50% NMC registration renewal paid by Cygnet&lt;br /&gt;• Free meals on duty&lt;br /&gt;• Free parking&lt;br /&gt;• RCNi membership&lt;br /&gt;• Bespoke career pathways&lt;br /&gt;• Plus many more&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt;You will have…&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;br /&gt;• Experience as a Registered Nurse with a current Pin Number • Experience in a Mental Health service or working with those with mental healh and complex needs.&lt;br /&gt;• The ability to maintain documentation, undertake audits and demonstrate integrity in your role &lt;br /&gt;• A good understanding of the Mental Health Act 1983 and latest nursing practices&lt;br /&gt;• A commitment to patient recovery in order to effectively monitor, manage and reduce risk&lt;br /&gt;• Compassion, resilience and a dedication to empower and support service user independence&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Desirable:&lt;/strong&gt;&lt;br /&gt;• The ability to deputise in a clinical lead role&lt;br /&gt;• An interest in leadership, research and assessment&lt;br /&gt;• Experience in personality disorders&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Health Care&lt;/strong&gt; has been providing a national network of high quality specialist mental health services for 30 years.&lt;/p&gt;\n&lt;p&gt;At&lt;strong&gt; Cygnet Alders Clinic&lt;/strong&gt; we provide a specialist psychologically informed personality disorder pathway across three living areas; Severn, for assessment and stabilisation; Avon, where residents move as they engage and progress with their treatment pathway; and Coln, which focuses on transitioning to the community.&lt;/p&gt;\n&lt;p&gt;We adopt an integrated modular approach to treatment for women with a diagnosis of personality disorder, accounting for diagnostic differences, NICE guidelines and the work of Livesley (2004). With a focus on interpersonal relationships, we use individual formulation to deliver a personalised and integrated combination of psychotherapeutic and pharmacological interventions. These can include:&lt;/p&gt;\n&lt;p&gt;DBT-informed Therapy&lt;br /&gt;Cognitive Behaviour Therapy (CBT)&lt;br /&gt;Compassion Focused Therapy (CFT)&lt;br /&gt;Mentalisation Based Therapy (MBT)&lt;br /&gt;Schema Therapy&lt;/p&gt;\n&lt;p&gt;Our aim is to address the core features of personality disorder: emotional regulation, interpersonal functioning, and self-identity and to prepare the women in our care for a transition to life back in the community&lt;/p&gt;\n&lt;p&gt;Alders is rated ‘Good’ by the CQC.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you ready to make a positive change?&lt;/p&gt;\n&lt;p&gt;Please click on the&lt;strong&gt; ‘apply now’&lt;/strong&gt; link below.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Join us!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Podsmead, Gloucester", "postalCode": "GL1 5UA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.842", "longitude": "-2.2545"}}, "title": "Registered General Nurse (RGN) - Female Rehabilitation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254205", "validThrough": "2020-12-01T23:59:59+0000"}