{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum (pro rata for part tim"}}, "datePosted": "2020-11-05T15:31:19+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a qualified non-medical prescriber, or current RMN prepared to undertake the NMP qualification, and work as part of our memory assessment service team, within the MHSOP directorate. Part time hours will also be considered.&lt;/p&gt;\n&lt;p&gt;MHSOP is a directorate which has a positive approach to older people&#39;s mental health problems. It has been providing memory services for many years as well as supporting and promoting the development of non-medical prescribing.&lt;/p&gt;\n&lt;p&gt;As an NMP, you will be asked to work throughout Nottinghamshire supporting the MAS clinicians in that area. You will be responsible for completing specialist mental health assessments for individuals with memory problems, i.e. comprehensive mental, social care assessments and risk assessments and developing pharmacological treatment plans as an autonomous practitioner, monitoring interventions, ensuring compliance in accordance with Trust Policy.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;For applicants not currently NMP qualified you will be employed as a Band 6 Memory Assessment Nurse, and following successful completion of the NMP course you will secure a substantive Band 7 NMP role. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;You will receive full support and supervision to enable the assessment, delivery of diagnosis and treatment options of those attending clinics. As well as developing links outside of the service for signposting, you will also be contributing to developing robust links with primary care, providing training and supporting local GP&#39;s.&lt;/p&gt;\n&lt;p&gt;You must be RMN registered with the NMC and be educated to degree level or possess equivalent experience. You must also have a Non-Medical Prescribing Qualification (unless undertaking the development opportunity) and considerable experience of working with older people including current knowledge and understanding of older people&#39;s physical health needs with the ability to demonstrate clinical competence. You will have a high level of interpersonal and communication skills and be able to work both autonomously and as part of a team.&lt;/p&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emily Kirkham - Clinical Nurse Specialist / Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: emily.kirkham@nottshc.nhs.uk / Telephone number: 01159691300 or&lt;/p&gt;\n&lt;p&gt;07971495093&lt;/p&gt;\n&lt;p&gt; or try Sally Jones on Telephone number 0115 969 1300 ext 12670&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kirkby-in-Ashfield", "postalCode": "NG17 7AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1003", "longitude": "-1.24775"}}, "title": "Memory Assessment Practitioner / NMP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258342", "validThrough": "2020-11-18T23:59:59+0000"}