{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110000", "minValue": "110000", "unitText": "YEAR", "value": "Up to £110,000 per annum"}}, "datePosted": "2020-10-30T09:11:31+0000", "description": "&lt;p&gt;Your unfaltering dedication to quality is something you are very proud of; like us, you constantly strive to do things better for your patients. This ethos has led to you having a customer focused approach at all times when dealing with patients as part of a caring medical team. If you are an innovative individualwho would like to support a world class service and contribute to the planning and development of anaesthesia we would like to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Consultant Anaesthetist you will provide a full range of speciality diagnosis, treatment and care to inpatients, day cases and outpatients who require anaesthetic services and ensure responsive anaesthetic care.&lt;/p&gt;\n&lt;p&gt;Experienced in providing pre and post-operative assessment of patients, your role will include providing good quality written information to the patient’s GP. As a key member of the centre’s team you will be working closely with our team of Consultants across a wide range of specialisms and the hospital’s Medical Director, Ade Adeniyi, and local Leadership Team. Furthermore, you will be a key contributor to the development of Clinical Quality Standards and participate in our audit and clinical governance programme. At Practice Plus Group we believe in supporting each other and sharing best practise. You will be flexible enough to become an integral part of that team attending meetings and contribute to teaching of our centre staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With a current registration with the GMC’s specialist register of anaesthetists you’ll have several years’ experience, at least 2 of which are within the UK. You are committed to your own continuing medical education and professional development. We will also support you to ensure ongoing medical competence through participation in the annual revalidation and reaccreditation schemes of the GMC and the Royal College of Anaesthetists. As well as providing mandatory training through our excellent in house education programme. We could even give you the opportunity to develop into a specialist role of your interest.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Everything we do is focused on providing a high standard of safe and effective patient care. When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. If you want to move up the ladder, we’ll support you. If you just want to stay in your role, that’s fine too.We’ll help you be the best you can be.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contact &lt;strong&gt;glenn.coles@practiceplusgroup.com&lt;/strong&gt; in our friendly resourcing team, or call 01189 521 951.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidates but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Emersons Green", "postalCode": "BS16 7FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5033", "longitude": "-2.48431"}}, "title": "Consultant Anaesthetist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249420", "validThrough": "2020-11-26T23:59:59+0000"}