{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 Pro Rata"}}, "datePosted": "2020-10-26T11:16:07+0000", "description": "Highly Specialist Hepatopancreato-biliary and Private Patients Dietitian - Hammersmith Hospital\n&lt;p&gt;Band 7 part time, substantive, 0.80wte 30hrs - (0.4WTE HPB and 0.4WTE Private Patients)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fulfil your potential in hospitals that make history: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Charing Cross, Hammersmith, St Mary’s, Queen Charlotte’s &amp; Chelsea and Western Eye&lt;/p&gt;\n&lt;p&gt;With five world-renowned hospitals, Imperial College Healthcare NHS Trust is full of opportunity if you are looking to develop your healthcare career.&lt;/p&gt;\n&lt;p&gt;We are an NHS Trust of 10,000 people, providing care for over a million patients from North West London and beyond every year. We have a rich heritage and an ambitious vision for the future of our patients and local communities. &lt;/p&gt;\n&lt;p&gt;With our partners, Imperial College London, The Royal Marsden NHS Foundation Trust and The Royal Brompton &amp; Harefield NHS Foundation Trust, we form Imperial College Academic Health Science Centre, one of 11 academic health science centres in the UK, working to ensure the rapid translation of research for better patient care and excellence in education.&lt;/p&gt;\n&lt;p&gt;We are proud of our heritage in innovation and we are early adopters of new insights in technologies, techniques and treatments for improving health. &lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and dynamic Band 7 Dietitian to provide a split clinical dietetic service to both the Hepatopancreato-biliary (HPB) service and Imperial Private Healthcare (IPH)  inpatients at Hammersmith Hospital.  This Band 7 substantive post is a specialist Dietetic position dedicated to managing a nutritionally challenging clinical caseload and will require thorough understanding of complex nutrition support requirements including parenteral nutrition, jejunal feeding and PERT.&lt;/p&gt;\n&lt;p&gt;You will be working closely within the supportive environment of the specialist team at Hammersmith Hospital.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the delivery of a high quality, evidence-based clinical service to HPB and IPH patients. It is anticipated that your clinical experience and knowledge will contribute to the development of this specialist service.  You will provide specialist dietetic support for this patient cohort. &lt;/p&gt;\n&lt;p&gt;We are a large, high profile, friendly department involved in undergraduate and post graduate medical training.  We also facilitate placement 1, 2 and 3’s for dietetic students and are involved in teaching other health professionals such as nursing and therapy colleagues.  The department is forward thinking and our service delivery is very much influenced by the audits and research projects we carry out which are supported by excellent IT facilities and Quality Improvement initiatives.  The department also supports robust CPD for all staff members.&lt;/p&gt;\n&lt;p&gt;If you have excellent dietetic knowledge in complex nutritional support patient care within HPB or GI surgery or gastroenterology, have the ability to prioritise your workload, enjoy working within a dynamic team and can work under pressure we look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;Therapies has the benefit of having a Clinical Academic lead post in the structure to support the development of clinical academic career pathways for therapy staff and to lead on the therapies research strategy. Our newly appointed Chief Allied Health professional will be the strategic lead for therapies and will lead on the development of the AHP agenda in the trust both now and into the future.&lt;/p&gt;\n&lt;p&gt;Imperial College Healthcare NHS Trust (ICHNT) is an Academic Health Science Centre (AHSC) and the largest trust in the country.  Our mission is to provide world class healthcare for our patients, through excellence in research, education and training. &lt;/p&gt;\n&lt;p&gt;For further details, please contact: &lt;/p&gt;\n&lt;p&gt;Jacqui O’Flynn&lt;/p&gt;\n&lt;p&gt;Clinical Service lead dietitian for Critical care, Cardiothoracics, Neurosciences and Major Trauma&lt;/p&gt;\n&lt;p&gt;Email: Jacqui.o’flynn@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hammersmith Hospital, London", "postalCode": "W12 0HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5165", "longitude": "-.236635"}}, "title": "Band 7 Specialist Dietitian - Hpb /Pp", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242165", "validThrough": "2020-11-09T23:59:59+0000"}