{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "80000", "minValue": "80000", "unitText": "YEAR", "value": "Up to £80,000 + Benefits"}}, "datePosted": "2020-11-02T16:19:36+0000", "description": "&lt;p&gt;&lt;span&gt;Be part of the journey to work in an outstanding children’s hospital that is looking to define the centre of excellence in Eating Disorders within CAMHS.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a visible ward doctor across the ward, you will engage and assess our young people on a daily basis. You will be the first line doctor on the unit and will take a medical lead role in assessment, formulation and treatment including physical health reviews.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working, training and educating other CAMHS ward-based staff, working closely with nurses and support workers to ensure best practice care and treatment for our young people and be a key player in the implementation of our Clinical Framework and Model of Care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Carry out all clinical interventions in a timely and effective manner, and complete assessments, appropriate investigations, diagnosis and treatments under Consultant supervision of inpatients of the unit.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be responsible for taking blood samples and medical examinations, will ensure the ward is adequately covered and will liaise with mental health and other agencies and professionals as required for patient assessment and for co-ordination of discharge plans.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will participate in the ‘duty doctor’ on-call rota at the hospital. Supervision for on-call related issues will take place in consultation with the Consultant on call or the following day with the consultant for the respective Unit.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;What you will get:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Annual salary of £70,000 - £80,000&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Welcome bonus of £5,000&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Free meals and parking&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Wellbeing support and activities&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Career development and training&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Pension contribution&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Life Assurance&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Enhanced Maternity Package&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Where you will be working:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Location: Rhodes Wood Hospital. Shepherds Way, Hatfield AL9 6NN&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Join the vibrant team at Rhodes Wood Hospital, a specialist CAMHS Eating Disorder service with 3 wards, which empowers recovery in a fast-paced, challenging and fun environment for children and young people aged 8-18 years with eating disorders.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;With a new Hospital Director appointed, Rhodes Wood is working through a programme to continually innovate, improve and deliver excellent care to our young people and a rewarding experience for employees.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will support a warm and nurturing environment, allowing for the understanding of symptoms, patterns and origins of psychological distress, and will actively encourage children to personalise bedroom spaces to make these feel like a home from home.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hatfield", "postalCode": "AL9"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7455", "longitude": "-.18919"}}, "title": "Specialty CAMHS Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252819", "validThrough": "2020-12-02T23:59:59+0000"}