{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "11767", "minValue": "11767", "unitText": "YEAR", "value": "Equivalent Band 6/7 depending on experience"}}, "datePosted": "2020-10-12T14:15:30+0100", "description": "&lt;p&gt;&lt;strong&gt;Theatre Team Leader | Theatres | Equivalent Band 6/7 depending on experience | Elland | Huge Opportunity for future career progression into a more Senior role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Elland has a unique opportunity for a Senior Theatre Practitioner to take the next step in their career. We are offering full support, development and training for the right person who is driven, focused and a team player. We’re looking for someone who wants to develop their career and move into a Senior/Leader role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Elland Hospital has been providing high levels of medical treatment and personal care since 1985. Our hospital has a full multi-disciplinary medical team on-site who practice some of the most advanced treatments on the latest generation imaging and diagnostic technology. This means we can offer everything from screening and rehabilitation through to leading-edge surgical procedures and excellence in specialist fields like orthopaedics, general surgery, gynaecology, and cosmetic procedures&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Successful Theatre Team Leader will help lead the department and deputise the Theatre Manager. You will provide exemplary planned care for patients requiring perioperative intervention supporting the management and taking on the roles of Scrub practitioner. You will lead your team in the development of knowledge, ideas and work practice to improve quality and maintain our high standards of theatre practice.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HCPC or NMC Registered - your registration should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Minimum 3 years’ experience in Scrub and demonstrable experience in leader-ship&lt;/li&gt;\n&lt;li&gt;Previously employed in a Hospital/Theatre setting&lt;/li&gt;\n&lt;li&gt;Mentorship Certificate or equivalent&lt;/li&gt;\n&lt;li&gt;ILS trained – must be willing to complete ALS &amp; EPALS within 6 months&lt;/li&gt;\n&lt;li&gt;Anaesthetics and Recovery trained would be desirable but not essential&lt;/li&gt;\n&lt;li&gt;Surgical First Assist or working towards.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Grace Little on grace.little@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Halifax", "postalCode": "HX5 9EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6888", "longitude": "-1.82866"}}, "title": "Theatre Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222697", "validThrough": "2020-11-12T23:59:59+0000"}