{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "Band 3 £19,737  to £21,142 per annum, pro rata"}}, "datePosted": "2020-11-02T17:15:23+0000", "description": "&lt;p&gt;Central Cheshire Integrated Care Partnership is looking to recruit a number of health care assistants whose aim is to provide high quality care to patient within their own home.&lt;/p&gt;\n&lt;p&gt;The service provides care for patients at home and within bed based units, focusing on rehabilitation and promotion of independence and the provision of care needs. It also supports palliative care patients in the community setting through the provision of care packages with the support of other Care Community colleagues. The role will require the successful and candidate to undertake record keeping using an electronic device for which training will be provided.&lt;/p&gt;\n&lt;p&gt;The service operates seven days a week between the times of 8am and 10pm.&lt;/p&gt;\n&lt;p&gt;We are currently looking to recruit a number of caring, enthusiastic and compassionate individuals to join our dynamic and forward thinking team.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with patients, carers and multi professional staff.&lt;/p&gt;\n&lt;p&gt;This role will provide individuals with the opportunity to develop new skills through training and individual support, working close to home and the ability to work flexible hours.&lt;/p&gt;\n&lt;p&gt;We welcome applications from individuals with the following skills and attributes&lt;/p&gt;\n&lt;p&gt;• Kind, Caring and Compassionate individuals&lt;/p&gt;\n&lt;p&gt;• Good communication skills&lt;/p&gt;\n&lt;p&gt;• Experience of working within a health care setting&lt;/p&gt;\n&lt;p&gt;• NVQ level 2 or above (desirable) Or the willingness to undertake&lt;/p&gt;\n&lt;p&gt;• Ability to travel across geographical area.&lt;/p&gt;\n&lt;p&gt;• Ability to work on your own and as part of the wider team.&lt;/p&gt;\n&lt;p&gt;We strongly recommend that interested candidates contact the manager of this vacancy to discuss the role before applying.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nantwich", "postalCode": "CW5 5RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0755", "longitude": "-2.51825"}}, "title": "Placement of Care Hub Healthcare / General Nursing Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252998", "validThrough": "2020-11-22T23:59:59+0000"}