{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-27T12:01:05+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are recruiting! Come and join our innovative, award-winning Speech and Language Therapy team! The integrated Speech and Language Therapy service for Ipswich Hospital and East Suffolk recently won the ESNEFT ‘Team of the Year’ category at the staff Trust awards. We are an innovative service, open to developing through service re-design and implementation of emerging therapeutic techniques. We have recently expanded our team following exciting investments in new services including Learning Disabilities provision and a Specialist Dementia pathway. &lt;/em&gt; &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;This post offers an excellent opportunity for a highly motivated clinician to join our innovative, friendly team based in Ipswich and East Suffolk. If you are looking to work with a mixed caseload of adults with swallowing and communication problems, in both community and acute settings, this job could be for you.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The successful applicant will have the opportunity to work on the inpatient wards at Ipswich Hospital, cover a defined community area from the clinic base in Ipswich, and support the stroke pathway from acute admission through to community care, including Early Supported Discharge. There may be opportunities to work within our ENT service. Whilst our band 5 staff do not have fixed rotations, they will move through these clinical areas based on skill mix, developmental and service need. The post holder will be well supported in the development of their dysphagia competencies and their clinical work with communication-impaired clients.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The SLT service in East Suffolk covers the full range of clinical specialisms, including aphasia, dysphagia, stroke, progressive neurological conditions, learning disability and ENT. In Ipswich Hospital, we provide videofluoroscopy and FEES assessments, as well as the inpatient and ENT outpatient services. In the community, we work closely with our MDT colleagues, particularly in relation to MND and progressive neurological conditions. The community team also provides regular LSVT intervention and maintenance packages, and group interventions, according to patient need.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Anyone unfamiliar with Suffolk will discover a beautiful county which boasts a wealth of hidden gems, from historic market towns to picturesque villages, Constable Country and the stunning Heritage Coast. Ipswich itself is a vibrant university town, with over 1, 500 years of history, beautiful parks and the recently rejuvenated Waterfront. The county hosts many cultural events (eg Latitude Festival, Aldeburgh Music Festival, Snape Maltings). There are also excellent links by road or rail to London, Cambridge and nearby international air and ferry ports.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;span&gt;&lt;strong&gt;Please note this role is subject to a DBS Check which will be charged to the successful candidate. Further details can be found within &#39;DBS information&#39; attached to this advert.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Julia Dinley, Service Manager on 01473 275285&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Kate Harrall, Principal SLT on 01473 703118&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Allington Clinic / Ipswich Hospital, Ipswich", "postalCode": "IP4 4ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0619", "longitude": "1.17835"}}, "title": "Speech &amp; Language Therapist (Adult Services)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244375", "validThrough": "2020-11-10T23:59:59+0000"}