{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-05T13:31:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Deputy Sister/Charge Nurse &lt;/strong&gt;– Hampshire Hospitals NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Royal Hampshire County Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Description:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Emergency Department at Winchester is looking for a flexible Band 6 Nurse who is able to be in charge of an ever changing department on a shift to shift basis.&lt;/p&gt;\n&lt;p&gt;This will include managing staff development and wellbeing.&lt;/p&gt;\n&lt;p&gt;Successful candidates must be able to work within a multidisciplinary team, ensuring clinical services are delivered to a high standard.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexible working patterns will considered for all nursing applicants! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we look for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will need to be an enthusiastic and forward thinking to join our team&lt;/li&gt;\n&lt;li&gt;Applicants must have recent ED experience at Band 5 and be interested in assisting the Sister/Charge Nurses in the development of both the team and the department&lt;/li&gt;\n&lt;li&gt;You must have experience of promoting and maintaining high standards of nursing care within the ED&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we Offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are dedicated to training and developing our staff and are keen to see all staff members reach their clinical and leadership potential&lt;/li&gt;\n&lt;li&gt;Be part of a dynamic team, building for the future of the ED with new initiatives&lt;/li&gt;\n&lt;li&gt;Your life outside HHFT is important and the Trust are happy to consider applications with flexible working patterns that cater to individual requirements; this can be discussed at interview&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we are: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a dedicated team who work with a multidisciplinary team who aspire to provide a high standard of care for all our patients, both adults and children. Come and join our friendly, supportive, hard- working, motivated and adaptable team in Winchester&#39;s Emergency department. We are proud to have achieved a good rating from a recent CQC.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The vision at Hampshire Hospitals NHS Foundation Trust is to provide outstanding care for every patient. We serve a population of nearly 600,000 people across Hampshire and West Berkshire as well as some people who access our specialist services from across the country.&lt;/p&gt;\n&lt;p&gt;Created in January 2012 the Foundation Trust prioritises the provision of exceptional, compassionate, care delivered by the valued staff working in a culture of collaboration and mutual respect. HHFT employs circa 6,000 people and had a turnover of £382m in 17/18&lt;/p&gt;\n&lt;p&gt;Four core values (CARE) Compassion, Accountability, Respect and Encourage. These are in place to support of four clear objectives, provide outstanding care of patients, empowering all members of staff, sustainable growth and innovating for the future.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kirsty Edwards - Senior Sister&lt;/p&gt;\n&lt;p&gt;kirsty.edwards@hhft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01962 824950&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester, Winchester", "postalCode": "SO22 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0614", "longitude": "-1.33095"}}, "title": "Deputy Sister/Charge Nurse - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257898", "validThrough": "2020-11-19T23:59:59+0000"}