{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa (dependent on experience)"}}, "datePosted": "2020-10-22T15:15:51+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt; &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;span&gt;&lt;strong&gt;&lt;em&gt;Medical &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;Directorate&lt;/em&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Pharmacy Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Pharmacist - Medicines Optimisation and Medicines Safety&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Salary: £45,753 to £51,668 per annum&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;&lt;strong&gt;Location: Michael Carlisle Centre, Nether Edge Hospital, 75 Osborne Road, Sheffield S11 9DF&lt;strong&gt;         &lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Post Ref: HR will allocate&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking for a challenge and want to make a difference?...Sheffield Health and Social Care NHS Foundation Trust is the place for you. &lt;/p&gt;\n&lt;p&gt;We are seeking a dynamic Senior Pharmacist to lead on the medicines optimisation agenda and to be the named Medicines Safety Officer for the Trust.  &lt;br /&gt; You will lead the process of medicines incident reviews, and support the Chief Pharmacist in ensuring that effective medicines management and medicines safety systems operate throughout the Trust&lt;/p&gt;\n&lt;p&gt;The postholder will also lead on designated areas of pharmacy practice within the Trust and practice as a specialist pharmacist clinically within designated teams in inpatient and community mental health settings.&lt;/p&gt;\n&lt;p&gt;In addition to the focus above, as part of the SHSC pharmacy team you will also work to provide specialist mental health pharmaceutical support to across the trust to help achieve best outcomes with medicines&lt;/p&gt;\n&lt;p&gt;There will be a requirement to undertake on call support out of hours. This aspect of the service is currently under development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Candidate&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;You must be registered with the General Pharmaceutical Council and have a keen interest in mental health pharmacy.&lt;/p&gt;\n&lt;p&gt;This is a specialist post and you must be able to demonstrate your ability to provide a high level of clinical pharmacy practice through possession of a relevant Pharmacy Post Graduate Clinical Diploma or equivalent.&lt;/p&gt;\n&lt;p&gt;It would be advantageous to have experience of managing and investigating of medicines incidents and safety alerts and of developing and embedding medicines optimisation in routine clinical practice.&lt;/p&gt;\n&lt;p&gt;You will need to possess effective communication skills and have a high level of clinical pharmacy knowledge and a desire to develop this as part of your specialist practice.&lt;/p&gt;\n&lt;p&gt;It would be desirable if you hold a full driving licence and have access to a car however you must be able to travel within the geographical area in a timely and effective manner.&lt;/p&gt;\n&lt;p&gt;You will be expected to participate in the Trust systems of clinical supervision.&lt;/p&gt;\n&lt;p&gt;Development and peer support will be provided to enable you to develop your practice in line with the national NHS agenda.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Pharmacy Team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Pharmacy Team is well established within the Trust.  Weare both ambitious and motivated, focusing our work around the best interests of our patients and continually striving to improve the services we offer.  The Pharmacy Department currently employs approximately 32 staff, including Assistant Technical Officers, Pharmacy technicians, Pharmacists and administrators.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are also involved in the implementation of national guidelines and the development of local guidelines.  The Trust participates in national audits, e.g. through the Prescribing Observatory for Mental Health (POMH UK), with pharmacists taking a lead role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;i       For further information please contact Abiola Allinson, Chief Pharmacist, or Shrewti Moerman, Deputy Chief Pharmacist on 0114 271 8630&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sheffield Health and Social Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120808"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S11 9BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3615", "longitude": "-1.49796"}}, "title": "Senior Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239090", "validThrough": "2020-11-23T23:59:59+0000"}