{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-09T15:30:21+0100", "description": "&lt;p&gt;The Walton Centre NHS Foundation Trust currently has an exciting opportunity for an experienced and highly motivated Procurement professional to join the team as a Divisional Procurement Officer.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work closely with all divisions across the organisation to develop and maintain close working relationships with a wide range of stakeholders to help drive efficiencies and savings throughout the Trust.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be educated to degree level, be CIPS qualified (or working towards the Level 6 CIPS qualification), be confident in all Procurement processes/EU directives and will have demonstrable experiences of managing high value complex projects with successful outcomes.&lt;/p&gt;\n&lt;p&gt;Responsible for managing their own work plan the successful candidate will have the relevant skills, abilities and experiences to ensure the successful delivery of clinical and cost improvement opportunities. The Procurement department is a busy environment and the post holder will be expected to manage a number of large complex projects and demanding deadlines.&lt;/p&gt;\n&lt;p&gt;The Walton Centre operates an Agile Working Policy, therefore the post holder will be required to work onsite, from home and other Trusts.&lt;br /&gt; &lt;br /&gt;The post holder will support in the development and delivery of the Trust procurement strategy and any current/ upcoming national Procurement agendas, as well as deputising for the Deputy Head of Procurement as and when required.&lt;/p&gt;\n&lt;p&gt;If you have the relevant skills, abilities and experiences that this post demands and you are ready for a challenge, we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;For more information or an informal discussion, please contact Alan Burgess, Deputy Head of Procurement on 0151 556 3071 or e-mail alan.burgess@thewaltoncentre.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120725.JPG", "name": "Walton Centre NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120725"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L9 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4665", "longitude": "-2.93093"}}, "title": "Divisional Procurement Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916220857", "validThrough": "2020-11-09T23:59:59+0000"}