{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum"}}, "datePosted": "2020-10-29T12:31:28+0000", "description": "&lt;p&gt;Specialty Doctor Rheumatology&lt;/p&gt;\n&lt;p&gt;We have an opportunity available within the department of Rheumatology, The Services adopts a hub and spoke model and the successful candidate will be based at Eastbourne District general Hospital but working cross site providing clinics at the Conquest hospital, Bexhill Hospital and Uckfield Hospital.&lt;/p&gt;\n&lt;p&gt;This post will be a substantive post&lt;/p&gt;\n&lt;p&gt;The service provides regular specialised clinics such as early inflammatory arthritis, adolescent and young adults, temporal arthritis, joint paediatric and musculoskeletal ultrasound clinics. In addition, we work with tertiary centres providing joint connective tissue disorder clinic with Royal Free Hospital.&lt;/p&gt;\n&lt;p&gt;The service has a twice weekly meeting with consultants, junior doctors and specialist nurses. A fortnightly MDT with consultants, physiotherapists, specialist nurses and specialist radiologists. A inpatient weekly MDT on the wards and adhoc respiratory and rheumatology clinics (interstitial lung disease).&lt;/p&gt;\n&lt;p&gt;We have 3 Full time Consultant Rheumatologists (Dr Panthakalam, Dr Pool and Dr Subasinghe) supported by 1 SPR, 1 speciality middle grade doctor, 1 Educational Fellow, 1 CT and 1 F1 grades. We are also pleased to be able to work with an excellent team of 6 WTE Rheumatology Specialist Nurses. We are a forward thinking innovative team and look forward to your application.&lt;/p&gt;\n&lt;p&gt;These posts will allow successful candidates to develop their clinical skills and experience in a hospital with a track record of innovative service delivery, excellence in training and clinical research.&lt;/p&gt;\n&lt;p&gt;Around 525,000 people live in East Sussex and we are one of the largest organisations in the county. We employ 6,519 dedicated staff with an annual turnover of £356million.&lt;/p&gt;\n&lt;p&gt;It is important that if you have been employed as a doctor by another organisation that you provide details of your most recent Designated Body and Responsible Officer together with contact details to the Chair of the interview panel. We are committed to delivering equality of opportunity for all of our service users, and for our staff. Our aim is to create a workplace in which discrimination is outlawed, and staff and service users are equally valued and supported.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Sam PanthakalamJob titleConsultantEmail addressspanthakalam@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastbourne District General Hospital, Eastbourne", "postalCode": "BN21 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.787", "longitude": ".271136"}}, "title": "Specialty Doctor Rheumatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248335", "validThrough": "2020-11-12T23:59:59+0000"}