{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751- £73,664"}}, "datePosted": "2020-10-30T17:06:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Children in Care Clinical Pathway Lead - Consultant Clinical Psychologist Band 8c: O.5 WTE- 18.75 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BWC-Forward Thinking Birmingham 0-25 years Mental Health Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;12 months fixed term contract (with the likelihood of renewal)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applications for a secondment opportunity within BWC or across organisations will be considered.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date – Wed 2&lt;/strong&gt;&lt;strong&gt;nd&lt;/strong&gt;&lt;strong&gt;Dec 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an experienced Clinical Psychologist to join, develop and further progress the FTB Children in Care (CiC) Pathway. The post holder will be responsible for ensuring the systematic provision of ahigh quality clinical care and will have the experience and drive to seize clinical and strategic relationship opportunities across the city to further develop excellence in serving this specific cohort of children in Birmingham. The postholder will join a dedicated multidisciplinary team delivering a range of direct and indirect interventions, consultations and training to enhance services for this population and seek to work effectively across health, social care and other partners to improved joined up delivery through an integrated care system approach.&lt;/p&gt;\n&lt;p&gt;The post holder will be part of the wider Psychological Therapies department within Forward Thinking Birmingham 0-25 years Mental Health Service and be provided with a range of support and development opportunities to deliver to their role.&lt;/p&gt;\n&lt;p&gt;Due to the current commissioning process, this post will initially be appointed to a 12 month fixed term contract with the expectation of renewal in line with the usual recruitment procedure.&lt;/p&gt;\n&lt;p&gt;For further information please contact Dr Ashley-Christopher Fallon, Head of Psychological Therapies, via &lt;span style=&quot;text-decoration: underline;&quot;&gt;ashley-christopher.fallon@nhs.net&lt;/span&gt;or telephone 0121 333 9999.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B4 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4852", "longitude": "-1.89446"}}, "title": "Consultant Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251037", "validThrough": "2020-11-13T23:59:59+0000"}