{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 per annum/pro-rata"}}, "datePosted": "2020-10-28T15:46:26+0000", "description": "&lt;p&gt;The post holder will be responsible for leading all aspects of the implementation and delivery of the Electronic Prescribing and Medicines Administration Programme across the Trust, from programme initiation, recruitment of the implementation team, setting up the programme governance, contract management, stakeholder management, pilot implementation and evaluation through to complete rollout to all services and maturing to business as usual. This is a high-profile, large-scale, highly technical, system implementation and transformational programme which will impact the majority of services within the Trust. It also forms a key deliverable within the Trusts GDE Programme.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be enthusiastic, innovative and resourceful, whilst possessing a thorough knowledge of EPMA system implementation. Being driven and adaptable are essential characteristics for this role, this is a unique opportunity to shape the future pathway of a major Trust project as the system is implemented, ensuring key benefits are delivered.&lt;/p&gt;\n&lt;p&gt;The post is 1 year fixed term but with the opportunity to extend for the right candidate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;MAIN DUTIES AND RESPONSIBILITIES&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be required to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead on the implementation and delivery of the EPMA programme, including all aspects from programme initiation through to pilot implementation and evaluation initially.&lt;/li&gt;\n&lt;li&gt;Recruit the implementation team to deliver the pilot and further and have line management responsibilities accordingly.&lt;/li&gt;\n&lt;li&gt;Ensure operational clinical and pharmacy staff are fully engaged and business processes are transformative.&lt;/li&gt;\n&lt;li&gt;Ensure the team includes technical experts to take forward the critical configuration, development and integration projects; have sufficient technical knowledge to present complex technical issues and solutions.&lt;/li&gt;\n&lt;li&gt;Have the ability to consider the strategic view in terms of implementation and balancing risks, costs, benefits and schedule.&lt;/li&gt;\n&lt;li&gt;Set up robust governance structures and clear reporting lines.&lt;/li&gt;\n&lt;li&gt;Undertake stakeholder management - identifying and engaging key stakeholders. Working with the comms team to ensure internal and external comms are rigorous and on point.&lt;/li&gt;\n&lt;li&gt;Manage the contract and change management – familiarisation with the contract to ensure delivery within the contract boundaries, working alongside the supplier and key sub contractor as required.&lt;/li&gt;\n&lt;li&gt;Work as part of the wider Trust consortium, to ensure key synergies are achieved.&lt;/li&gt;\n&lt;li&gt;Be responsible for Programme documentation including programme plans, risk and issue logs, resource, stakeholder, communication and benefit plans.&lt;/li&gt;\n&lt;li&gt;Retain full ownership for managing and delivering the programme to the plan, within the budget and with the assured level of quality required.&lt;/li&gt;\n&lt;li&gt;Ensure clinical safety is in the forefront of all key plans and decisions.&lt;/li&gt;\n&lt;li&gt;Act as an expert in Programme and Change Management using recognised best practice methodologies.&lt;/li&gt;\n&lt;li&gt;Report to the Programme Board and other groups as required on the team’s progress against work plan and deliverables.&lt;/li&gt;\n&lt;li&gt;Develop sustainable and credible working relationships with internal and system stakeholders.&lt;/li&gt;\n&lt;li&gt;Negotiate, develop and agree the team’s work plan ensuring that they consistently meet the programme’s objectives, prioritising workload where required.&lt;/li&gt;\n&lt;li&gt;Design and agree evaluation and performance monitoring arrangements for the programme.&lt;/li&gt;\n&lt;li&gt;Develop, consult and implement alternative options for the delivery and outcome of the programme to meet the changing political, social and economic needs.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Alison Corfield Job title Head of Clinical Systems Email address alison.corfield@oxfordhealth.nhs.uk Telephone number07500103005&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Littlemore Mental Health Centre, Oxford", "postalCode": "OX4 4XN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7175", "longitude": "-1.22952"}}, "title": "Electronic Prescribing and Medicines Administration Programme Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247249", "validThrough": "2020-11-18T23:59:59+0000"}