{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum / pro rata"}}, "datePosted": "2020-11-02T11:16:02+0000", "description": "&lt;p&gt;&lt;strong&gt;The Central Oxford Older Adult Community Mental Health Team is looking for enthusiastic and a highly motivated Mental Health Nurse to join our team. Being awarded Placement of the year in 2018 for 2 categories namely, Adult and Mental Health Nursing and for Social Work, we continue to work to improve our service and provide excellent care to our patients and their families. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our team covers the geographical area of Oxford City and NE Oxfordshire (Kidlington and Bicester).&lt;/p&gt;\n&lt;p&gt;Working as part of our multi-disciplinary team you will be expected to offer assessments and manage a caseload as well as deliver evidence-based interventions to our patient group of older adults with moderate to severe mental health needs. In return you will receive supportive supervision and caseload management to enable you to develop as a clinician and further your career in mental health.&lt;/p&gt;\n&lt;p&gt;For newly qualified staff we offer a structured preceptorship programme to support your development through your first year of clinical work.&lt;/p&gt;\n&lt;p&gt;You will need to be organized, flexible and committed to delivering the highest possible care to our client group. Excellent written and verbal communication skills as well as good lT skills are essential. Ideally you will have experience of working in older adult mental health services and understand the challenges that working with this client group brings. However, if you have transferrable skills and are motivated to learn about our client group we would encourage you to apply.&lt;/p&gt;\n&lt;p&gt;We are a friendly, supportive and proactive team where you will receive regular supervision as well as plenty of opportunity to develop your skills. There is a culture of high standards of care and any successful applicant will need to be committed to maintaining this. The team works closely with a wide range of internal and external partner’s including GPs, district nursing, therapy services, ambulatory care, and physical and mental health inpatient providers.&lt;/p&gt;\n&lt;p&gt;The team’s primary base is at Manzil Resource Centre, Manzil Way with additional office spaces at the Warneford Hospital. Core working hours are Monday-Friday 09:00h-17:00h. Out-of-hours support services are managed via a team rota. Subject to experience, staff will be expected to work on this rota which includes occasional 09:00h-17:00h shifts at weekends and evening shifts in the week between 17:00h-20:00h.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDaniel MercierTelephone number01865 904010&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manzil Resource Centre, Oxford", "postalCode": "OX4 1XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7461", "longitude": "-1.23078"}}, "title": "Care Co-ordinator - RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251749", "validThrough": "2020-11-22T23:59:59+0000"}