{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20795", "minValue": "18813", "unitText": "YEAR", "value": "£18,813 - £20,795 per annum pro rata"}}, "datePosted": "2020-11-04T12:46:18+0000", "description": "&lt;p&gt;&lt;strong&gt;The Occupational Therapy provisions in Hertfordshire Secure Forensic Services are undergoing transformation in line with the national Recovery College agenda. We are developing the provision of specialised Occupational Therapy assessment / intervention alongside embedding meaningful activity in to the three forensic units across Hertfordshire. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The exciting opportunity has arisen for an Occupational Therapy Assistant to drive this change alongside the OT professional Lead. The successful applicant will also work closely with the MDT / rest of the recovery team including Occupational Therapy Technical Assistants and other recovery team staff to ensure that a high quality, person centred service is provided for people.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Herts Secure Services offers assessment and treatment in a Medium (MSU) and Low secure (LSU) setting to individuals who have a history of offending behaviour. The services consist of 30 beds in the Learning Disability MSU and 15 in the Mental Health LSU.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All patients are detained under the Mental Health Act 1983 and have complex health needs. Referrals come mainly via the courts and prisons but also from other health settings e.g. special hospitals or other secure environments&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Summary:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Band 3 Occupational Therapy Assistant – 0.8 WTE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To work as part of the therapy team in Herts Secure Services in 4 Bowlers Green LSU, Warren Court MSU and Beech Unit LSU. Working alone or with other MDT staff under the supervision of a registered Occupational Therapist, the post holder will be expected to:&lt;/p&gt;\n&lt;p&gt;Use technical and creative skills to assist in the provision of a flexible, client centred programme of therapeutic activities for individuals or groups of clients who experience have a learning disability and/or mental health difficulties&lt;/p&gt;\n&lt;p&gt;Hertfordshire Partnership NHS Trust (HPFT) is committed to providing excellent health and social care with the vision to be the leading provider of mental health and specialist learning disability services in the country.&lt;/p&gt;\n&lt;p&gt;The Trust has an outstanding track record of service delivery and quality. It provides services to over one million residents and is currently rated as “excellent” for quality of service provision and “excellent” for the use of resources by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;Key goals for the Trust include being the provider of choice; delivering high quality integrated health services in collaboration with local people, to improve overall health and well-being. To deliver this the Trust is committed to employing the best workforce, recruiting individuals with the ability to provide care at the cutting edge of innovative practice. We have excellent development and training programmes which rank us in the top 20% of Trusts in the UK and a strongly embedded learning culture to support and facilitate staff to develop their potential and progress in their careers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Car driver essential, or access to a car (unless you have a disability as defined by the Equality Act 2010 which prevents you from driving).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;In addition to the basic salary, this post attracts a High Cost Area Supplement of 5% of basic salary subject to a minimum payment of £1,017 and a maximum payment of £1,762 per annum (pro rata where applicable)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Lisa Ford (Professional Lead OT) on 01923 684602 or email lisa.ford6@nhs.net,&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warren Court, Woodside Road, Abbots Langley, Herts, WD5 0HT, Abbots Langley/Radlett", "postalCode": "WD5 0HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7023", "longitude": "-.402882"}}, "title": "Occupational Therapy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255915", "validThrough": "2020-11-18T23:59:59+0000"}