{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "105042", "minValue": "77913", "unitText": "YEAR", "value": "£77,913 - £105,042 Per Annum"}}, "datePosted": "2020-11-05T15:31:07+0000", "description": "&lt;p&gt;6 PA&#39;s LOCUM CONSULTANT IN RHEUMATOLOGY - 3 months - Fixed Term Contract&lt;/p&gt;\n&lt;p&gt;The Trust is seeking a forward thinking, dynamic, enthusiastic Consultant to work among a team of 2.6 Consultants, 1 Specialist Registrar and 4.5 nurse specialists in the department of Rheumatology.&lt;/p&gt;\n&lt;p&gt;The successful candidate should have the ability to adapt to the department quickly to ensure the transfer of clinical workload causes minimal disruption to the department and to continuity of patient care.&lt;/p&gt;\n&lt;p&gt;The Rheumatology department in Basildon and Thurrock University Hospitals provide a comprehensive Rheumatology service with outpatient clinics provided in designated Rheumatology suites on the Basildon and Orsett Hospital sites.. There are 2 clinic based ultrasound machines. The department has a very active and efficient Rheumatology Day Unit which is used for administration of intravenous therapy including cyclophosphamide and biologics and for various procedures including needle muscle biopsies, minor salivary gland biopsy, chemical synovectomy and ultrasound guided spine injections. The department work closely with other medical departments and provide prompt inpatients consultations for inpatients including those with complex multisystem disorders.&lt;/p&gt;\n&lt;p&gt;The department is currently collaborating with Orthopaedics, Pain management and Tier 2 Physiotherapy to develop a comprehensive well organised musculoskeletal service. The successful candidate would be expected to contribute actively to this on-going aspect of service development.&lt;/p&gt;\n&lt;p&gt;As a University Teaching Hospital Trust linked with the University College London we value teaching and audit skills and emphasise the role of Clinical Governance in everyday clinical practice. The Trust is committed to driving improvement in the quality of clinical care and to innovation in models of service. We seek colleagues with the ability and willingness to teach in a multi-disciplinary environment, be flexible and adaptable to the challenges faced in the department and be pro-active in audit and governance issues. We will also provide mentoring for the appointee.&lt;/p&gt;\n&lt;p&gt;The Trust is situated in the South of England providing excellent road and rail links to London, South East and the Continent.&lt;/p&gt;\n&lt;p&gt;It is desirable for candidates to hold a CCT in Rheumatology.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Bharadwaj, Clinical Lead on 01268 524900 extension 1557&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon, Basildon", "postalCode": "SS16 5NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5577", "longitude": ".450587"}}, "title": "Locum Consultant Rheumatologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258335", "validThrough": "2020-11-19T23:59:59+0000"}