{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata  + 5% of basi"}}, "datePosted": "2020-10-27T16:02:06+0000", "description": "&lt;p&gt;Hertfordshire&#39;s IAPT service, the Wellbeing Service, is looking for enthusiastic and motivated qualified High Intensity CBT Therapists &lt;strong&gt;or&lt;/strong&gt; Trainee CBT Therapists close to completion of their training, to join our award winning teams in Ware and Welwyn Garden City .&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be part of our hard working and consistently high quality services. We are seeking highly motivated, dynamic, flexible and creative therapists to contribute to our continued success. You will be part of a multi-professional workforce that will significantly increase access to treatment for people with depression, anxiety and other common mental health conditions, within a Primary Care setting, within a Partnership NHS Foundation Trust - rated by the CQC as Outstanding.&lt;/p&gt;\n&lt;p&gt;As an IAPT service we are in our second period of APPTS accreditation. We have a history of stable growth from year to year as we expand our reach in to the local community providing increasing access along our core pathway but also making huge strides in the effective treatment for those with long term conditions. Our waiting times are short and our recovery rates high, all of which come from our dedication, values, great team of clinicians, great supervisors, and a commitment to CPD .&lt;/p&gt;\n&lt;p&gt;Our core hours are 9-5, Monday to Friday and you will be asked to provide a small percentage of your clinical appointments outside of those hours, on weekdays. The posts are full time however part time hours would be considered.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You may need to travel efficiently and independently between bases during the working day so an independent form of transport is essential.&lt;/li&gt;\n&lt;li&gt;You will need to be BABCP accredited or actively working towards it.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tom Page, Service Manager&lt;/p&gt;\n&lt;p&gt;Email address thomas.page1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "59 New Road, Ware, Ware", "postalCode": "SG12 7BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8122", "longitude": "-.028988"}}, "title": "High Intensity CBT Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245331", "validThrough": "2020-11-10T23:59:59+0000"}