{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 per annum"}}, "datePosted": "2020-10-15T15:23:48+0100", "description": "&lt;p&gt;&lt;strong&gt;University Hospitals Plymouth NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Title &lt;/strong&gt;&lt;strong&gt;Consultant Microbiologist - 2 posts &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Grade Consultant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours 10 PA’s &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job ref &lt;/strong&gt;&lt;strong&gt;216-10002-MIC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary £79,860 - £107,668 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please apply via NHS Jobs, uploading your CV.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to imminent retirements we have an exciting opportunity for 2 individuals to join the Clinical Microbiology team providing a comprehensive infection service to the local population and tertiary services across the region. We are seeking applications from suitably qualified Consultant Medical Microbiologists, Consultant Clinical Scientists in Medical Microbiology, or dual accredited Consultants in Microbiology and Infectious Diseases.&lt;/p&gt;\n&lt;p&gt;These posts attract a recruitment and retention premium in addition to relocation package.&lt;/p&gt;\n&lt;p&gt;University Hospitals Plymouth NHS Trust is the largest hospital in the South West Peninsula. It is a major trauma centre and hosts tertiary services for neurosurgery, cardiothoracic surgery, renal transplantation, bone marrow transplantation, neonatal intensive care, and prosthetic joint revision surgery. There is ample scope for development of specialist interests within infection management, and the trust has an active research department. The state of the art microbiology department is based in purpose built laboratories and offers a wide range of diagnostic testing, and a full SARS-CoV-2 testing service (PCR and antibody). The locality has seen low numbers of COVID-19 cases throughout this pandemic, and a wide variety of clinical microbiology work continues.&lt;/p&gt;\n&lt;p&gt;New ways of working arising from the COVID19 pandemic have shown that there is flexibility for working from home when clinical commitments allow, and the 10PA jobplan (including 1:7 on-call) is usually worked across 4 weekdays.&lt;/p&gt;\n&lt;p&gt;Plymouth offers numerous opportunities for outdoor activities and a vibrant urban culture, lying on the beautiful natural harbour that is Plymouth Sound with rugged Dartmoor to the north and surrounded by the unspoilt beaches of Cornwall and South Devon.&lt;/p&gt;\n&lt;p&gt;Further information is available from Dr Jim Greig, Head of Department jamesgreig@nhs.net 01752 433216 or Dr Peter Jenks peter.jenks@nhs.net , Dr Rosie Fok r.fok@nhs.net , Dr Lewis Jones lewis.jones2@nhs.net , Consultant Microbiologists.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Undergraduate Medical Education&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Plymouth University Peninsular School of Medicine and Dentistry (PUPSMD) has been praised by the GMC for its innovative approach to undergraduate medical education. The curriculum is based around problem based learning and has been highly ranked by our graduates in how they felt prepared for postgraduate medicine. Your role will include important opportunities to engage with undergraduate education, in both the hospital environment and the school itself, to continue this vital job of producing tomorrow’s doctors and allied health care professionals&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Consultant Microbiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228784", "validThrough": "2020-11-12T23:59:59+0000"}