{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 p.a. inclusive of HCAS"}}, "datePosted": "2020-10-30T14:16:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Psychosis Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;2 x Full-time, permanent, Band 8a Psychologist posts in the Early Intervention Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Based at Greenland Road, London NW1&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for two Clinical or Counselling Psychologists to join our Early Intervention Service (EIS). One of these new posts will be based in Camden EIS and the other in the Islington EIS team.&lt;/p&gt;\n&lt;p&gt;We are looking for psychologists with excellent clinical, supervision and communication skills and demonstrated expertise and knowledge of working with people experiencing psychosis, bipolar and associated difficulties.&lt;/p&gt;\n&lt;p&gt;The post holders will be expected to apply assessment, formulation, therapeutic and consultation skills with individuals and their families and carers. They will also offer joint working with, and consultation to, multi-disciplinary team members on a regular basis.&lt;/p&gt;\n&lt;p&gt;With support from senior psychology managers in the Recovery and Rehab (R&amp;R) Division, the post holders will provide supervision, and possibly line management, to some of the psychologists within the EIS teams. These posts will also include provision of staff training, service audit and/or service development projects.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be members of the R&amp;R Division’s psychology team, which comprises approximately 20 clinical and counselling psychologists who work with service users with psychosis and bipolar. The team is an enthusiastic and creative group of psychologists who are passionate about working with this client group. The group meets regularly and is a forum for sharing of ideas and resources, as well as peer support.&lt;/p&gt;\n&lt;p&gt;There is a genuine commitment to strong supervision and good scope for continued professional development within the Trust. In addition, we have close links with UCL and other academic partners.&lt;/p&gt;\n&lt;p&gt;Previous experience of working as a psychologist with people with psychosis at Band 7 or higher, and a genuine enthusiasm for creative working with this group are essential. The post requires Health and Care Professions Council registration as a Clinical or Counselling psychologist.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;C&amp;I&lt;/strong&gt; is committed to the development and career progression of our internal staff and would like to remind candidates that there are numerous sources of support available in the recruitment process for internal candidates to access:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HR experts can provide support in completing applications and supporting statements&lt;/li&gt;\n&lt;li&gt;Access to an Interview Excellence E-learning module&lt;/li&gt;\n&lt;li&gt;HR experts can provide Interview Coaching&lt;/li&gt;\n&lt;li&gt;We encourage candidates to make arrangements to visit the areas they are interested in applying to work in&lt;/li&gt;\n&lt;li&gt;We offer shadowing opportunities before the interview either in the area or similar to provide exposure into what the new role may feel like&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGraham PickupJob titlePsychology Lead, Recovery and Rehabilitation DivisionEmail addressgraham.pickup@candi.nhs.ukTelephone number0203 317 6203&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121247.jpg", "name": "Camden and Islington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121247"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Greenland Road, London NW1 0AS, London", "postalCode": "NW1 0AS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5392", "longitude": "-.141722"}}, "title": "Psychologist - Band 8A  Early Intervention in Psychosis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250508", "validThrough": "2020-11-15T23:59:59+0000"}