{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum/pro rata"}}, "datePosted": "2020-10-28T15:01:25+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Nurse Specialist - Infection Prevention and Control&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Division: Corporate&lt;/p&gt;\n&lt;p&gt;Care Group: Infection Prevention and Control&lt;/p&gt;\n&lt;p&gt;Band: 7&lt;/p&gt;\n&lt;p&gt;Salary: £38,890 - £44,503 per annum/pro rata&lt;/p&gt;\n&lt;p&gt;Interview Date: Week Commencing 02 November 2020&lt;/p&gt;\n&lt;p&gt;We are recruiting for a &lt;strong&gt;Clinical Nurse Specialist - Infection Prevention and Control&lt;/strong&gt; who shares our ambition and vision to deliver the &lt;em&gt;&lt;strong&gt;Best of Care by the Best People&lt;/strong&gt;&lt;/em&gt; and has the drive to take us forward, by ensuring that the Trust continues to be the first choice for patients and our staff.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a qualified infection control practitioner who has completed or is near completion of their formal studies in infection prevention and control, with a passion to make a difference for patients and staff.&lt;/p&gt;\n&lt;p&gt;The post holder will be part of a multi-disciplinary team comprised of doctors, nurses and pharmacist, led by the Director of Infection Prevention and Control. This is an exciting time to join the team as we undergo improvements with an opportunity to lead on change projects and effect transformational improvements.&lt;/p&gt;\n&lt;p&gt;The role will be based in the hospital with some occasional travel to external partners and satellite clinic sites. Experience of working in an acute hospital infection prevention and control team will be required and the post holder will have autonomy work on audits, surveillance, education delivery supported to review policies.&lt;/p&gt;\n&lt;p&gt;The Trust and its employees are all committed to creating and maintaining a fair and supportive working environment and culture.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to you, we will give you the opportunity to utilise and enhance your talents to assist us in the development of shaping the future of Medway NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Trust offers a number of apprenticeships and training opportunities in Leadership and Management, Business Services, Finance, Accounting, Human Resources, Clinical Support Work, Research and Innovation, Nursing Associate and Assistant Practitioner alongside our in-house comprehensive clinical pathways.&lt;/p&gt;\n&lt;p&gt;Our hope is that our education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the protection of children, young people, their families and vulnerable adults accessing its services. Promoting the message that “safeguarding is everyone’s business” is vital to ensure our patients are protected and safe from abuse. To this end you must comply with Trust’s and the Kent and Medway Safeguarding Board’s policies on safeguarding children, young people and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ian Hosien - Head of Infection Prevention and Control&lt;/p&gt;\n&lt;p&gt;ian.hosein@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Clinical Nurse Specialist - Infection Prevention and Control", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247091", "validThrough": "2020-12-06T23:59:59+0000"}