{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pro rata"}}, "datePosted": "2020-10-27T17:00:21+0000", "description": "&lt;p&gt;&lt;span&gt;Are you passionate about supporting adoptees and their families to flourish? Are you interested in shaping an expanding, multidisciplinary team within a regional adoption agency? We wish to appoint two dynamic and enthusiastic Occupational Therapists to provide occupational therapy expertise, knowledge and skills within the OAWY Multidisciplinary team (MDT). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;One Adoption West Yorkshire (OAWY) is a shared regional adoption service across the 5 West Yorkshire Local Authorities. It is hosted by Leeds City Council with office bases across West Yorkshire and is responsible for the recruitment and assessment of adopters, family finding for children and adoption support. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The developing and expanding OAWY multidisciplinary team comprising therapeutic social workers, education professionals and health professionals, including psychologists, occupational therapists and a speech therapist. The team works in partnership with the wider adoption service to provide an integrated, multi-layered, inter agency service, focused on the individual needs of adopted children and their families, with an emphasis on early identification of issues, prevention and early intervention. The MDT supports OAWY and its partner agencies trough consultations and training. The team offers consultations, assessments and therapeutic support to children, young people and families. We strive to develop flexible partnership working models across health, education, and the voluntary and independent sectors. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leeds Community Healthcare Trust is working in partnership with OAWY to employ healthcare professionals for the MDT and link them to an enthusiastic group of clinicians to provide professional support, collaborative learning and development opportunities to the post holders. The occupational therapy posts are hosted by LCH Integrated Children&#39;s Additional Needs (ICAN) service and while you will have links with colleagues within this service, your clinical work will be with OAWY. The supervision will be provided by Band 7 Occupational Therapists in the OAWY MDT. This is a fantastic opportunity for an OT who is interested in working with children and families who have experienced developmental trauma from a neurodevelopmental / sequential perspective.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We seek to understand and support the child with the ongoing impact of early adversity as well as to recognise and respond to additional difficulties such as neurodevelopmental, educational or familial issues. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a developing team we are engaged in a dynamic process of continual improvement and development of the service, based on learning from direct work and feedback from families and staff. The service will offer an evidence based approach, building in robust outcome monitoring and review processes. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As one of the Occupational Therapists in the team the main part of your role will be working with colleagues to improve understanding of children&#39;s physical, emotional and relational development and design and deliver support services such as Building Underdeveloped Sensorimotor Systems (BUSS) model*. (Full training will be provided). As part of the team, you will also provide consultations, assessments and support to children, young people and families, and support staff and parents through consultations and training. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Assessment&lt;/strong&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Promote a screening practice within OAWY to measure child&#39;s foundation sensorimotor systems and other aspects of physical development to identify the children who require further support.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Facilitate a full assessment of those of identified children (either individually or as part of a multidisciplinary assessment) and create a plan for support, which fits in with the overall adoption support plan. &lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Interventions&lt;/strong&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Facilitate individual and group based interventions to develop and built children&#39;s underdeveloped sensorimotor systems and other aspects of physical development, which are age appropriate and take into account the impact of children&#39;s early life experiences.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Facilitate individual and group based support and training activities for parents, providing them with information about building underdeveloped systems and other aspects of physical development enabling parents to help children to develop, understand themselves and their bodies, regulate themselves physically and to thrive. &lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Supporting OAWY Staff&lt;/strong&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Support OAWY staff and the wider team around the child through consultation to increase understanding of underdeveloped systems and other aspects of physical development to ensure those needs are recognised and taken into account when support plans for children are created and put in place.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Support the OAWY staff to develop the skills and capacity run groups such as Building Underdeveloped Sensorimotor systems groups, which help children to understand themselves and their bodies, regulate themselves physically and to thrive. &lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Service Development&lt;/strong&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Contribute to the ongoing development of the multidisciplinary team with colleagues within the MDT, the OAWY management team and the wider staff. &lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Building pathways with universal services&lt;/strong&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;In partnership with the MDT develop pathways to universal services to ensure continuation of care.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;*More information about BUSS: Sarah Lloyd- Building Sensorimotor Systems in Children with Developmental Trauma: A Model for Practice (2020) &amp; Improving Sensory Processing in Traumatized Children: Practical Ideas to Help Your Child&#39;s Movement, Coordination and Body Awareness (2016).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be knowledgeable about the impact of early life experiences on a child&#39;s development and wellbeing and the importance of early and proactive intervention. You will understand the complexity, multifaceted nature of difficulties experienced by adopted children and young people and the need to take a whole-child approach and passionate about helping children to understand themselves and their bodies, regulate themselves physically and to thrive.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122058.jpg", "name": "(CS) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122058"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Citywide", "postalCode": "LS6 1PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8149", "longitude": "-1.56836"}}, "title": "Occupational Therapist (Two Posts)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245503", "validThrough": "2020-11-18T23:59:59+0000"}