{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inc HCAS"}}, "datePosted": "2020-11-04T10:46:03+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join our busy and progressive community children’s nursing team. The post sits in a friendly CCN team that delivers acute, ambulatory and chronic, complex care to children living in London Borough of Ealing. The post is full-time, mainly Mon-Fri, but the team is expanding to weekend service and extended hours, so evening and weekend (including some bank holiday) working will be required in the near future.&lt;/p&gt;\n&lt;p&gt;This challenging and rewarding role offers the opportunity to meet the needs of children, young people and their families within a multidisciplinary inter agency framework.&lt;br /&gt;&lt;br /&gt;We are looking for an enthusiastic forward thinking children’s nurse, with community experience. You will be a highly motivated independent practitioner with sound evidence based skills. The post holder will manage a varied caseload, act as a resource for an identified area of clinical special interest and contribute to the on-going development of the CCN team, lead by the Clinical Team Lead.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We will offer you clinical supervision, appraisal and support in achieving your professional and personal development plan, as well as peer support from colleagues in similar roles. &lt;br /&gt;Car owner, driver essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBianca PostelmansJob titleClinical Service Lead Community Specialist Children&#39;s Nursing ServiceEmail addressBianca.postelmans@nhs.netTelephone number07548 142 530Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Shabana Razak, Clinical Team Leader Community Children’s Nursing Team&lt;/p&gt;\n&lt;p&gt;on: 07548 141 805 or Shabana.razak@nhs.net&lt;/p&gt;\n&lt;p&gt;Bianca Postelmans, Clinical Service Lead Community Specialist Children&#39;s Nursing Service&lt;/p&gt;\n&lt;p&gt;on: 07548 142 530 or Bianca.postelmans@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carmelita House, Ealing", "postalCode": "W5 2PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5143", "longitude": "-.300322"}}, "title": "Community Childrens Nurse - band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255430", "validThrough": "2020-11-18T23:59:59+0000"}