{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-05T08:15:35+0000", "description": "&lt;p&gt;We are currently looking for skilled registered nurses (RMN/ RNLD) and student nurses completing their studies in the next 12 months to join our specialist teams at Guild Lodge. Guild Lodge provides secure care for men and women from across Lancashire and South Cumbria. Our specialist teams help people in their recovery from mental illness and support them to avoid risk-related behaviours in the future. As a member of our team you will receive training related to our clinical pathways, risk assessment (including HCR 20), relational security, supporting teams, positive behaviour support and specific clinical skills.&lt;/p&gt;\n&lt;p&gt;With 15 wards covering medium secure, low secure and step down services we are able to offer you a clinical experience that is interesting and will help you develop new skills. We have three separate care pathways men, women and men with an Aquired Brain Injury (ABI). Our ABI service is the only medium secure NHS provision in the country.&lt;/p&gt;\n&lt;p&gt;When you join our team you will be fully supported either through supervision or preceptorship, depending on your needs. We are focussed on staff wellbeing and have a number of intiatives to make sure you can achieve a good work life balance. Our inpatient service has links into a variety of community based teams Forensic CMHT, Forensic Outreach Service, Liaison and diversion Teams and Counter Terrorism.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be able to experience a broad range of clinical specialities and will have access to a comprehensive package of professional coaching, education and clinical support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You may also be eligible for a Relocation Package or Golden Hello incentives (subject to confirmation). Apply now for further details.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Guild Lodge hospital site is situated in beautiful rural area, yet has close to motorway links from all directions of travel&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free parking 24/7&lt;/li&gt;\n&lt;li&gt;Long day shift pattern – meaning more rest days&lt;/li&gt;\n&lt;li&gt;Excellent holiday entitlement: 27 days, rising to 29 after five years NHS service and rising to 33 after 10 years. Also, a chance to purchase additional Annual Leave&lt;/li&gt;\n&lt;li&gt;Extra payments for &lt;strong&gt;Bank Holiday&lt;/strong&gt;, &lt;strong&gt;evenings, nights &lt;/strong&gt;and&lt;strong&gt; weekend&lt;/strong&gt; working&lt;/li&gt;\n&lt;li&gt;An extensive Preceptorship and support for those new to the services&lt;/li&gt;\n&lt;li&gt;Access to flexible working arrangements&lt;/li&gt;\n&lt;li&gt;An excellent salary sacrifice car and electronics scheme&lt;/li&gt;\n&lt;li&gt;Onsite restaurant facilities&lt;/li&gt;\n&lt;li&gt;Access to newly built housing areas&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Our valued staff receive: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Pension&lt;/li&gt;\n&lt;li&gt;Excellent support and Wellbeing services&lt;/li&gt;\n&lt;li&gt;Superb external training and development opportunities&lt;/li&gt;\n&lt;li&gt;Opportunities to develop leadership skills across differing care environment&lt;/li&gt;\n&lt;li&gt;Talent Management Programme&lt;/li&gt;\n&lt;li&gt;1:1 support from Clinical Educators&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;NHS Terms and Conditions:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Occupational Health Service including access to counselling and physiotherapy services&lt;/li&gt;\n&lt;li&gt;Confidential Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;Variety of discounts from local attractions and businesses&lt;/li&gt;\n&lt;li&gt;Child Care Vouchers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Job share and flexible working arrangements are available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Placement on the incremental pay band will be in line with relevant experience to date and unsociable payments will be in addition to stated salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Natalie Mitchell (Network Administrator for the Matrons) 01772 401360 to arrange a discussion with one of our Matrons.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guild Lodge, Preston", "postalCode": "PR3 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8165", "longitude": "-2.65834"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256917", "validThrough": "2020-11-19T23:59:59+0000"}