{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-02T13:30:13+0000", "description": "&lt;h2&gt;Chaplain&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;We are pleased to announce we are recruiting for permanent Band 5 Chaplains to work with the Chaplaincy Team to proactively deliver spiritual, pastoral and religious care to patients, relatives and staff at Queen Alexandra Hospital. We’re looking for committed and passionate individuals who have proven pastoral experience, good communication skills, and can work in a sensitive environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer a 24 hour service so candidates will be required to join the on-call rota in addition to their contractual hours, for which further payment will be made. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We want our chaplaincy team to be an active and visible presence on our wards which ensures that all patients and staff have an opportunity to request and participate in chaplaincy support. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You must be an ordained Anglican priest or a minister of a Free Church affiliated to the Churches together in England, with at least two years post-ordination experience. This post involves bed-to-bed visiting on wards.As part of your role you will be responsible for Presiding at the C of E/Free Church Eucharistic service on a Sunday morning during your on call weekend. You can expect to offer sacramental and non-sacramental ministry in difficult and demanding situations to people of all faiths and none in line with Trust policy.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We have an extensive team of Chaplaincy Volunteers that the Chaplaincy team are required to supervise and support. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The chaplaincy service forms part of the Patient Experience team and we are committed to developing our service in terms of what matters to patients and how we can learn and improve from their feedback.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to know more about the service we provide or about the post please contact Dawn Banting, Lead Chaplain.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Closing date: 16/11/2020&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Interview date: 24/11/2020&lt;/strong&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Chaplain", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252231", "validThrough": "2020-11-16T23:59:59+0000"}