{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-05T09:31:16+0000", "description": "&lt;p&gt;The Liverpool University Hospitals NHS Foundation Trust is the largest hospital in Merseyside and Cheshire. Located close to the City Centre, the hospital provides emergency, general and specialist treatment to patients from across the North West, North wales and the Isle of Man.&lt;/p&gt;\n&lt;p&gt;It currently has more than 700 beds and has the Main emergency department for the city of Liverpool, the largest of its kind in the country with the ability to treat complex trauma as well as minor injuries.&lt;/p&gt;\n&lt;p&gt;We have built on the historical excellence and innovation that brought Liverpool to the forefront of the medical world. We have achieved this by continuing to provide innovation in education, rehabilitation, surgical techniques and implant developments. We continue to maintain a reputation for excellence that is recognised throughout the world.&lt;/p&gt;\n&lt;p&gt;A fabulous opportunity has arisen to join our Gerontology service at The Broadgreen University Hospital as a Staff Nurse. You will be working within a fabulous team of nurses, doctors and many members of the multidisciplinary team looking after patients on the stroke transitional unit . Ward 8 is located on the Broadgreen site as a specialised in stroke rehabilitation. . There is an excellent team ethos with consultants, doctors, nurses and therapists working closely together to provide excellent care to patients.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have acute medical experience preferably within Gerontology, and will be dedicated and proactive in ensuring high quality, evidence based care. You will be an individual who demonstrates excellent organisational and interpersonal skills and can work under pressure on a ward with a rapid turnover of acute patients. You will be required to demonstrate continuing professional development through evidence based practice.&lt;/p&gt;\n&lt;p&gt;We can offer you an individualised program of support in your induction to working within our unit and supported training with our clinical nurse educator. This will include a week long clinical preceptorship course for those new to the Trust. There will be opportunities for professional development depending upon individual needs.&lt;/p&gt;\n&lt;p&gt;Informal visits are welcome and encouraged and we look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Name Nicola Richadrson&lt;/p&gt;\n&lt;p&gt;Job title Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address nicola.richadrson@liverpoolft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0151 282 6762&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broadgreen Hospital site, Liverpool", "postalCode": "L7 8XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.96481"}}, "title": "Staff Nurse - Ward 8 BGH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257069", "validThrough": "2020-11-19T23:59:59+0000"}