{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T13:30:47+0000", "description": "&lt;p&gt;Eastways is a purpose built nine bedded Assessment &amp; Treatment Unit for Adults with Learning Disabilities and complex needs. Admissions are short term for people requiring a period of intensive assessment and treatment/therapy away from home.&lt;br /&gt;&lt;br /&gt;A vacancy has arisen for a full time permanent contract as a staff nurse on the Unit.&lt;br /&gt;&lt;br /&gt;You will be part of a supportive multi-disciplinary team who work closely with other community services in providing a holistic approach to care. Post registration experience of working with adults with learning disabilities and/or working within an assessment &amp; treatment unit is desirable but not essential as the post would also offer an opportunity for the successful candidate to undertake their preceptorship within the six month period.&lt;/p&gt;\n&lt;p&gt;The ward offers a 24 hour service; therefore the successful candidates must be able to work a full range of 12 hour shifts including night shifts and weekends.&lt;/p&gt;\n&lt;p&gt;As a Staff Nurse you will be required to take charge and offer management supervision sessions to the Clinical Support Workers who are assigned to you. You will also have the responsibility of being a named nurse for patients on the ward. The ideal candidates must be enthusiastic, have good communication skills and able to build effective working relationships within a multi-disciplinary team.&lt;br /&gt;&lt;br /&gt;The successful candidates will be encouraged to excel within their nursing role and we offer a number of development opportunities both internally through our education department and externally though a range of colleges and universities we are associated with.&lt;br /&gt;&lt;br /&gt;In return, not only does CWP offer a Preceptor Programme for newly qualified nurses, but we also offer a comprehensive benefits package which includes an excellent pension scheme, 35 days annual leave on commencement (pro rata) inclusive of bank holidays which rises to 37 days after 5 years and 41 days after 10 years. CWP also offer a competitive salary based upon agenda for change which is part of the incremental pay progression. There are also regular opportunities for career progression throughout the organisation.&lt;br /&gt;&lt;br /&gt;If you feel that this sounds like you, then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Amanda Atkinson, Unit Manager,  Email: amanda.atkinson1@nhs.net Tel: 01244 397224&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Countess of Chester Health Park, Chester", "postalCode": "CH2 1BQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2118", "longitude": "-2.89903"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252236", "validThrough": "2020-11-16T23:59:59+0000"}