{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata per annum"}}, "datePosted": "2020-11-03T17:30:36+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a caring individual looking for a new flexible working life? Do you have the passion and skills to support across our wonderful hospital at short notice? Amazing – our Temporary Staffing Bank needs you! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our staffing bank is looking to grow its team of incredible Health Care Assistants (HCA’s). Working on our bank allows you the flexibility of a zero hours contract, whilst allowing you to be part of one amazing team. We are looking for HCA’s who can commit to at least 2-3 shifts a month but&lt;strong&gt; ideally 3-4 shifts a week&lt;/strong&gt; – you will have a choice of preference with surgical or medical but will need to be flexible and be able to move if required. We are a growing and changing organisation, and are looking for new team members to work with us during this time of change.&lt;/p&gt;\n&lt;p&gt;The role of a Healthcare Assistant is a very privileged role, as a HCA you will provide personal care and support to patients at their most vulnerable times. You will work alongside a multidisciplinary team to provide a compassionate, caring and safe environment for our patients.&lt;/p&gt;\n&lt;p&gt;To excel in this role you will&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have 3 months experience as a Health Care Assistant.&lt;/li&gt;\n&lt;li&gt;Have excellent communication skills and be able to work as part of a team.&lt;/li&gt;\n&lt;li&gt;Have an eye for detail and be able to maintain accurate documentation.&lt;/li&gt;\n&lt;li&gt;Be flexible and willing to work across a variety of adult wards within DCHFT.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return we can offer you..&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Access to first class training to support you in your role. This includes a week of initial training which will result in you achieving a Care Certificate.&lt;/li&gt;\n&lt;li&gt;A truly special team environment as part of #TeamDCH.&lt;/li&gt;\n&lt;li&gt;A variety of NHS Discounts wide range of shops, restaurants and retailers.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Make sure to check our benefits page by searching JoinDCHFT online.&lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application!&lt;/p&gt;\n&lt;p&gt;We are a Trust that celebrates diversity and we are committed to creating an inclusive environment for all employees. We would welcome applications from people in groups which are under-represented in our organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: Wednesday 25th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Robert Membury - Temporary Staffing Bank Team Leader - Robert.Membury@dchft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121023.jpg", "name": "Dorset County Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121023"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorset County Hospital, Dorchester", "postalCode": "DT1 2JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7135", "longitude": "-2.44712"}}, "title": "Bank Healthcare Assistant at DCH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254929", "validThrough": "2020-11-15T23:59:59+0000"}