{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-03T12:26:26+0000", "description": "&lt;p&gt;As part of Norfolk and Waveney CCGs’ commitment to reducing health inequalities we have the opportunity to employ 4 health outreach workers for a fixed term contract of 12 months each.&lt;/p&gt;\n&lt;p&gt;Our pilot projects have two strands:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To outreach and support our residents with learning disabilities from a Black Asian Minority Ethnic, Gypsy and Travelling families and asylum seeker background to enable them to participate in their annual health checks and support with their personal health action plan.&lt;/li&gt;\n&lt;li&gt;To support any residents with learning disabilities with access to attend their health checks with their GP.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;We are looking for people to join our team who have experience in working with people with learning disabilities and are able to undertake basic health observations.&lt;/p&gt;\n&lt;p&gt;The team will be comprised of 2 teams who will work together.&lt;/p&gt;\n&lt;p&gt;For the Black Asian Minority Ethnic, Gypsy and Traveller families &amp; asylum seekers outreach workers we have 1.5 posts but are able to support part time workers within our scope of 57 hours per week. Our full time posts are 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;For the supporting people to undertake their health checks the team is for 2 full time posts and we are able to consider part time workers.&lt;/p&gt;\n&lt;p&gt;As well as supporting access to health checks we expect the health outreach workers to engage with local communities to help shape how we commission future services.&lt;/p&gt;\n&lt;p&gt;Therefore you will need basic clinical skills and excellent communication skills to undertake this work.&lt;/p&gt;\n&lt;p&gt;We would like to offer applicants with a BAME or Gypsy/traveller family background to apply for any of the posts advertised and would request applicants to specify in their supporting statement which post they are interested in and how many hours up to a maximum of 37.5 they wish to be considered for.&lt;/p&gt;\n&lt;p&gt;Within your supporting statement we would also like you to provide a short explanation (maximum of 500 words) of what experience you have in outreach and working with people with learning disabilities.&lt;/p&gt;\n&lt;p&gt;We really look forward to receiving your applications,&lt;/p&gt;\n&lt;p&gt;For informal discussion please contact:&lt;/p&gt;\n&lt;p&gt;Bob Purser: b.purser@nhs.net&lt;/p&gt;\n&lt;p&gt;Trish Hagan: patriciahagan@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be via Microsoft Teams on 25 November 2020 – a basic word and excel spreadsheet test will be required as part of the interview as some of the work will involve collecting and recording information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be aware that this vacancy may close before the expiry date if sufficient applications have been received&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;DBS Enhanced - Unsupervised, direct, regular access to Children and Vulnerable adults&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128192.JPG", "name": "The NHS Norfolk and Waveney Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lakeside 400, Old Chapel Way, Broadland Business Park, Norwich, NR7 0WG", "postalCode": "NR7 0WG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6294", "longitude": "1.37179"}}, "title": "Health Improvement Support Worker for Learning Disabilities x2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253967", "validThrough": "2020-11-15T23:59:59+0000"}