{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31346", "unitText": "YEAR", "value": "£31,346 - £37,890 pro-rata, per annum"}}, "datePosted": "2020-11-02T14:27:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Job details&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary range: £31,346 - £37,890 pro-rata, per annum&lt;/p&gt;\n&lt;p&gt;Work location: Banbury, Witney, Oxford, Abingdon, Bicester&lt;/p&gt;\n&lt;p&gt;Hours per week: 37 - we are open to discussions about part-time and flexible working&lt;/p&gt;\n&lt;p&gt;Contract type: Permanent&lt;/p&gt;\n&lt;p&gt;Closing date: Sunday 22nd November 2020&lt;/p&gt;\n&lt;p&gt;Interview date: Monday 30th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Vetting requirements: This role is subject to a Criminal Records Check. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you looking for your next rewarding role as an Occupational Therapist? &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Oxfordshire County Council have fantastic opportunities for enthusiastic and motivated Occupational Therapists to join our fast-paced and dynamic service within the Adult Social Care Teams in both locality and specialist countywide teams.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our priority is to support the most vulnerable people in our communities. We do this by working as creatively and efficient as possible, whilst utilising the opportunities afforded by closer working with health and housing and working proactively to encourage independent and safe living within the community. Good outcomes will be achieved by providing the right support, in the right way at the right time. We actively collaborate with other agencies to put the people of Oxfordshire at the heart of decision-making.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be responsible for providing Occupational Therapy services to adults, their families and carers living in Oxfordshire in line with the requirements of the Care Act 2014 and any other legislation and guidance as may be relevant including the HCPC codes of practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will require a high standard of clinical professional reasoning, creative problem-solving skills as well as an ability to demonstrate accurate and clear recording. You will also need to possess highly-developed specialist skills and be registered as an Occupational Therapist with the HCPC.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You should have the ability to travel to and access a variety of premises across Oxfordshire. The teams work across the County and staff are expected to work agilely. However, we will try to assign your patch based on your home residency area/location, whilst limiting travel time where this is practical to accommodate the needs of the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rewards and benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;It really is true that every single job role here contributes to bettering the lives of the people in our county - we want to do this for our employees too. We are proud of our strong flexible working culture, including the opportunity for flexibility on working hours and the use of technology to support agile working. We offer some of the very best learning and development opportunities to support your ongoing development. &lt;br /&gt;  &lt;br /&gt; We have a generous holiday allowance which rises as you remain in employment with us up to 32 days, as well as giving you the option to buy additional holiday. You will also have access to a Local Government Pension Scheme with employer contributions of up to 19.9% of your salary; a range of local and national retail discounts; and a host of enhanced family friendly policies including carers leave and paid time off for volunteering.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to know more?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role please contact Karl Dickens, Team Manager, on 07776 997323 or Parish Rawlins, Practice Supervisor, on 0758 4174 671.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxfordshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129518"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Banbury, Witney, Oxford, Abingdon, Bicester", "postalCode": "OX4 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7315", "longitude": "-1.18245"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252419", "validThrough": "2020-11-22T23:59:59+0000"}