{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Anuum"}}, "datePosted": "2020-11-04T11:45:59+0000", "description": "&lt;p&gt;&lt;br /&gt;TB Service Staff Nurse (Band 5) – 37.5hrs&lt;/p&gt;\n&lt;p&gt;Do you have a passion for TB nursing and the skills required make a difference to patients accessing the TB service? If so this could be your opportunity to join the growing and dynamic TB Nursing Team at the Royal Wolverhampton NHS Trust.&lt;/p&gt;\n&lt;p&gt;We have an opportunity to join an existing team of TB Nurses, outreach worker and administrative staff to provide the TB Nursing service to the City of Wolverhampton, into South Staffordshire and Cannock, including the prison population within these areas (HMP Brinsford, Featherstone and Oakwood).&lt;/p&gt;\n&lt;p&gt;You will support the service in actively managing positive TB cases and their contacts and supporting them to complete their treatment, seeking cases of latent TB and managing subsequent positives, supporting TB incidents and support the BCG vaccination programme.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate a sound knowledge base and possess the experience and skills required to positively contribute to the TB team and TB caseloads. The successful candidate will ideally be educated to degree level or equivalent and have at least 2 years post qualification nursing experience. It is essential that you have the ability to work collaboratively at all levels and across disciplines and agencies.&lt;/p&gt;\n&lt;p&gt;You will be highly motivated, conscientious and an organised nurse with the ability to be efficient in a busy clinical environment. You will need to have excellent communication skills and the ability to work well with colleagues, patients, children and young people, and those from diverse ethnic and cultural backgrounds. You must be able to work autonomously with minimum medical supervision ensuring the complex physical, psychological and social needs of individuals being investigated or treated for tuberculosis are met.&lt;/p&gt;\n&lt;p&gt;Informal enquiries and visits are welcomed and can be arranged by contacting Neil Jarvis, TB Lead Nurse (ext 5940/5692) or Kim Corbett, Infection Prevention Nurse Manager (ext 5293), New Cross Hospital, Wolverhampton.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNeil JarvisJob titleTB Lead NurseEmail addressneiljarvis@nhs.netTelephone number01902 695940Additional contact information&lt;/p&gt;\n&lt;p&gt;Paul Juggins 01902 695940&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Wolverhampton Trust, Newcross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "TB Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255659", "validThrough": "2020-11-18T23:59:59+0000"}