{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40944", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £40,944 ST1/2"}}, "datePosted": "2020-10-20T10:46:15+0100", "description": "&lt;p&gt;Cardiology SHO&lt;/p&gt;\n&lt;p&gt;This exciting role is for an initial period of 1 year as a cardiology SHO and will provide you with the opportunity to develop your clinical skills and enhance your understanding of all aspects of cardiology either as an introduction or to develop further expertise in cardiology. You will work on the cardiology wards managing patients with acute cardiac conditions and those undergoing elective procedures including transthoracic/transoesophageal echocardiography, cardiac pacing and coronary intervention including primary percutaneous intervention, and separately electrophysiology/ablation studies. St George’s Hospital is particularly renowned for its stress echo, Cardiac Risk in the Young (CRY), Trans-catheter aortic valve implantation (TAVI), Chronic Total Occlusion (CTO), and Ventricular Tachycardia ablation services. You will be very well-supported by a cardiology registrar dedicated to covering the wards, and during this post we also strongly encourage you to observe the great variety of cardiac diagnostic and interventional procedures being practised daily at this busy London tertiary centre. The post also will provide opportunities to participate in clinical audit, participate in recruiting patients to large randomised controlled trials, and will allow you to develop clinical research skills with a view to obtaining peer reviewed publications. There will also be opportunities in medical education and teaching of the St George’s medical students.&lt;/p&gt;\n&lt;p&gt;The Trust has an excellent reputation for providing high quality and well-structured care in a friendly and supportive environment.&lt;/p&gt;\n&lt;p&gt;The successful candidate must have up to date GMC registration&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFadi JouhraJob titleHeart Failure ConsultantEmail addressFadi.Jouhra@stgeorges.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George&#39;s Hospital, Tooting", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Clinical Fellow in Cardiology (ST1/2)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233937", "validThrough": "2020-11-10T23:59:59+0000"}