{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata per annum"}}, "datePosted": "2020-11-06T12:32:02+0000", "description": "&lt;p&gt;We require friendly, positive thinking, organised and motivated individuals to work as a Bank Housekeeper within the Trusts Hotel Services Team.&lt;/p&gt;\n&lt;p&gt;Housekeepers are responsible to provide and maintain cleaning and catering services as part of the Hotel Services team to office, patient and communal areas within the Trust. Ensuring a clean, safe and supportive environment for staff and patients working towards their recovery.&lt;/p&gt;\n&lt;p&gt;You will need to be passionate and enthusiastic about patient care putting patients at the heart of everything you do. You will be working in a multi-professional team and will need to be able to think on the spot and be empathetic. You will be passionate about our business, creating a culture of continuous improvement.&lt;/p&gt;\n&lt;p&gt;The post holder will be based at Roseberry Park and will be required to work shifts between the hours of 07:00am and 18:00pm including weekends.&lt;/p&gt;\n&lt;p&gt;You should be highly motivated, reliable, and flexible also willing to work at short notice as there may be opportunities for extra hours.&lt;/p&gt;\n&lt;p&gt;Experience in cleaning duties and use of chemicals and equipment are essential as you will be working in a demanding environment. Catering and food service experience would be beneficial along with a passion to providing high standards of customer service.&lt;/p&gt;\n&lt;p&gt;Experience of working or volunteering in a mental health and learning disabilities environment is essential. Also the ability to provide a positive approach and image, when working with relevant client groups throughout the Trust.&lt;/p&gt;\n&lt;p&gt;Candidates must possess Food Hygiene Certificate level 2 or work towards successful completion in an agreed timescale.&lt;/p&gt;\n&lt;p&gt;Essential are; Numeracy, Literacy and IT level 2. (Equivalent to GCSE grades 9 to 4 (A* to C in old GCSE grading system)&lt;/p&gt;\n&lt;p&gt;NVQ Level 2 Housekeeping is desirable. All candidates should demonstrate a commitment to undertake further training and qualifications as deemed necessary to the position within agreed timescales.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sharon Walker, Hotel Services Supervisor&lt;/p&gt;\n&lt;p&gt;sharon.walker25@nhs.net&lt;/p&gt;\n&lt;p&gt;01642 838118&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Roseberry Park Hospital, Middlesbrough", "postalCode": "TS4 3AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.554", "longitude": "-1.21524"}}, "title": "Bank Housekeeper", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259694", "validThrough": "2020-11-13T23:59:59+0000"}