{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro"}}, "datePosted": "2020-11-02T11:15:58+0000", "description": "&lt;p&gt;Salisbury Therapy Services are looking for new (or experienced) and talented Band 5 Occupational Therapist to help support developing patient pathways and new projects within this medium sized and friendly District Hospital. We have immediate vacancies available within our Band 5 rotation. Salisbury has all the expected core rotations as well as opportunities in regional centres such as the Spinal Rehabilitation Centre &amp; Burns &amp; Plastics.&lt;/p&gt;\n&lt;p&gt;As a Band 5 you will be supported in developing your core skills in assessing, treating and managing a caseload of patients across various wards and departments. You will have the freedom to act within broad occupational policies and will be accountable for your own actions. You will be expected to monitor and support the work of the Therapy Assistants, as well as contributing to the improvement of therapy services.&lt;/p&gt;\n&lt;p&gt;We would also welcome applications from undergraduates qualifying in the summer, as we are able to be flexible regarding start dates, potentially starting in an assistant role pending HCPC registration&lt;/p&gt;\n&lt;p&gt;Your development is important to us and so you will have access to supervision, mentorship and internal leadership training, as well as encouragement to contribute to service development and staff training.&lt;/p&gt;\n&lt;p&gt;Early applications would be welcome and may result in an interview before the closing date if appropriate. You will be HCPC registered, with a BSc, Diploma or equivalent in Occupational Therapy. Experience in the NHS will be necessary (this could be on clinical placements) and experience of working with a variety of conditions would be an advantage.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anita Whalley, Team Lead a.whalley@nhs.net 01722336262 bleep 1242 &lt;/p&gt;\n&lt;p&gt;Donna Gurd, telephone 01722 336262 - ext 3103, email: donna.gurd@nhs.net or Cris Mulshaw (Head of Therapies) via email - crispian.mulshaw@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120765.jpg", "name": "Salisbury NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120765"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salisbury District Hospital, Salisbury", "postalCode": "SP2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0439", "longitude": "-1.78981"}}, "title": "Occupational Therapist (Rotation)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251746", "validThrough": "2020-11-16T23:59:59+0000"}