{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-03T15:00:47+0000", "description": "&lt;p&gt;Are you interested in working in a beautiful part of the country, in a friendly, dynamic and forward thinking team specialising in the treatment and holistic care of cancer patients from across Cornwall? The Royal Cornwall Hospitals NHS Trust has launched a significant investment in its Cancer Services workforce, extending over the few years. This post will play an integral part in delivering the Living with and Beyond Cancer agenda as set out in Achieving World-Class Cancer Outcomes Strategy.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the current specialist team based in the acute hospital. We are looking for an experienced and enthusiastic nurse. This will be training post to prepare a nurse to develop towards becoming an expert practitioner in caring for patients with cancer. It will enable a nurse to develop the practical and theoretical skills to be able to deliver high quality cancer nursing to patients and their families with cancer.&lt;/p&gt;\n&lt;p&gt;This position offers an opportunity to someone wishing to progress their career to gain additional experience in this field. Candidates will ideally have some experience in cancer care and hold post registration modules in relevant subjects. The candidates will be fully supported and guided by the current Cancer Nurse Specialist (CNS) team, but will be expected to be able to manage their own caseload of patients. The individual will be competent and confident to undertake holistic needs assessments and respond to concerns of cancer patients and families. In addition they will have the ability to give specialist nursing advice, teach on cancer education days, undertake audit and possess advanced communication skills.&lt;/p&gt;\n&lt;p&gt;Applications are invited for the above posts from highly motivated and enthusiastic trained nurses. Candidates must be registered nurses qualified to Diploma level with post-registration experience, preferably within Oncology/Palliative Care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role if Full Time 37.5 hours per week.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicola Devlin - Lead Surgical Care Practitioner on Tel: 07557 499751. Or email: ndevlin@nhs.net&lt;/p&gt;\n&lt;p&gt;Clare Ferris - Colorectal Nurse Specialist on 01872 252693.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Colorectal Cancer Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254451", "validThrough": "2020-11-16T23:59:59+0000"}