{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069"}}, "datePosted": "2020-11-04T10:46:31+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An experienced and enthusiastic doctor (ST3 equivalent) is required for a fixed-term position in Acute and General Medicine. The posts will start in &lt;strong&gt;October 2020&lt;/strong&gt; for six months. Candidates need excellent skills in active decision-making, in practical procedures and the liaison with diagnostic and other specialist departments to achieve the best and timely provision of care. The successful candidate will be responsible for managing patients in the Winter Ward at St George’s Hospital together with an Acute Medicine Consultant and 3 CT1/2 equivalent doctors.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holders will not be on an on call rota, although may be able to contribute the Acute Medicine on call if they so wish.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The posts offer an excellent opportunity for candidates wishing to pursue a career in Medicine, either to apply for IMT or ACCS training in the future. There will be ample opportunities to increase your clinical experience, as well as opportunities to further develop other interests, for instance, in teaching both undergraduates and other health professionals, such as Physician Associate Students. The successful candidates will also be encouraged to participate in Audit and Quality Improvement actively.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Although not yet formally recognised for training, this position provides ample experience in all aspects of the service, and the post holders are actively encouraged to attend the training sessions offered and actively participate in professional development.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic individuals to take an extra responsibility in addition to their clinical role in critical areas of service development. The time dedicated to the project will be adjusted in agreement with the specialty and Acute Medicine but should not be less than half a day per week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please direct informal enquiries to Dr Joao Albuquerque, Consultant for Acute Medicine &amp; Nephrology via his secretary on 020 8266 6092 or email joao.albuquerque@stgeorges.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoao AlbuquerqueJob titleConsultant for Acute Medicine and NephrologyEmail addressjoao.albuquerque@stgeorges.nhs.ukTelephone number020 8266 6092&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "STG, London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Senior Clinical Fellow (ST3 equivalent) Acute Medcine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255450", "validThrough": "2020-11-18T23:59:59+0000"}