{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-26T12:31:07+0000", "description": "&lt;p&gt;We recruit staff that are open, honest and focused on striving for excellence, having built an enviable international reputation on five unwavering principles for clinical excellence, research and development, teaching, learning and for treating patients with compassion, respect and dignity.&lt;/p&gt;\n&lt;p&gt;If you are motivated and driven and want to be part of a team who are dedicated to delivering high quality care to patients and their carers then take some time to read through what we have to offer. We are a multidisciplinary team who work closely together and support each other, whilst providing high quality care to our patients.&lt;/p&gt;\n&lt;p&gt;We have 19 theatres over two sites within the hospital that undertake a wide range of scheduled surgery covering many disciplines and emergency surgery . The role would involve internal rotation and working within both Recovery. &lt;br /&gt;&lt;br /&gt;The role involves critical care nursing of which you need to ideally have HDU/ Critical care experience and you will be required to be skilled in airway management, pain management and cardio resuscitation at immediate life support level (ILS). You should be proactive in providing a seamless service to all patients throughout their theatre journey, and have an educational role to play to all junior staff and students.&lt;br /&gt;&lt;br /&gt;You should be an effective communicator within the team and take charge on the unit in the absence of the shift leader. You will be educated to degree level or able to provide the equivalent portfolio of evidence.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Its a 24 hours service department ,shifts include weekend and nights.&lt;/em&gt;&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;If you are interested in enhancing your skills within the specialist field of recovery care and posses’ excellent communication skills we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;We will also ensure that you have a tailored, individual personal development plan and we will support further training. Opportunities for developing clinical skills are available and actively encouraged. You will be given the opportunity to enroll Anesthetic in house training.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Shiji Biben Job title: Theatre Recovery Manager Email address : shiji.biben@srft.nhs.uk Telephone number 01612069881&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Recovery Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242439", "validThrough": "2020-11-09T23:59:59+0000"}