{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inclusive of HCAS"}}, "datePosted": "2020-11-06T15:01:34+0000", "description": "&lt;p&gt;Exciting opportunities has arisen for highly motivated, proactive, dynamic, enthusiastic and registered Band 5/6 midwives to join our Maternity unit team. You must be a student midwife about to qualify (Preceptorship Band 5/a registered Midwife with post registration experience within Women’s Health. We have a fantastic 12 Months Preceptorship programme for newly qualified midwives with good support from our education team. The job involves rotation within the maternity unit as Band5/6 midwives and a flexible approach is essential.&lt;/p&gt;\n&lt;p&gt;You must be driven and motivated to work within our team of midwives to provide the highest quality of midwifery care. We are striving to achieve continuity of carer model throughout the antenatal, intrapartum and postnatal period and we are committed as a Trust to implement Better births.&lt;/p&gt;\n&lt;p&gt;As Band 6 midwives you must be passionate about providing continuity of care. Do you have experience of providing care for women at home? Would you like to be involved in an exciting team providing continuity of care to women who choose to birth within the community, hospital and women planning a home birth?. Let us hear from you. We are looking forward to welcoming you.&lt;/p&gt;\n&lt;p&gt;Successful candidates will benefit from in house mandatory training, teaching, on-going support from professional Midwifery Advocates (PMA) and professional development to help you deliver the best innovative service and improvements for women and their families throughout their pathway. You will work closely with the Obstetric teams, matrons, existing specialist midwives and other MDT members.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Abiola Jinadu Senior Midwifery Manager 07825011021&lt;/p&gt;\n&lt;p&gt;Email: Abiola.jinadu@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital, London", "postalCode": "NW10 7NS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5316", "longitude": "-.269746"}}, "title": "Preceptorship Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260264", "validThrough": "2020-11-20T23:59:59+0000"}