{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum (pro rota)"}}, "datePosted": "2020-11-02T15:01:29+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced HCPC registered band 7 Specialist Dietitian to join the LSCFT All Age Eating Disorder Service (EDS), East locality based at Pendle House Nelson.&lt;/p&gt;\n&lt;p&gt;Using a recovery model, our vision is to sustain our reputation as an outstanding Eating Disorder service that provides non-judgmental timely support for people and their families who may require specialist support for an eating disorder, so they can build confidence enabling them to live their lives.&lt;/p&gt;\n&lt;p&gt;The post holder will provide a high quality, evidence based up to date nutrition and dietetic service to people across the age range with eating disorders, in line with NG69. There is also an opportunity to develop the dietetic service provision to support young people and adults with weight management, nutritional support and re-feeding syndrome. Therefore, the ability to form and maintain key relationships with our partners in Acute Trusts, for example, is absolutely critical to the role.&lt;/p&gt;\n&lt;p&gt;The post holder will work as a key member of the multi-disciplinary team setting to deliver a specialised dietetic service to the East EDS team. The MDT includes clinical psychologists, psychiatrists, GP, specialist eating disorder nursing staff, family and CBT therapists. The service also embraces a culture of service user participation and works closely with the local communities to enhance the clinical offer.&lt;/p&gt;\n&lt;p&gt;You will be expected to serve the whole of the multi-racial and multi-cultural community of Lancashire and South Cumbria with demonstrable values and commitment to diversity and anti-discriminatory practice. This will require the successful Band 7 applicant to be a leader, mentor, teacher and role model. An understanding of systematic family interventions and relationship based practice is highly desirable.&lt;/p&gt;\n&lt;p&gt;This is an outstanding opportunity for career development, in an emerging area of highly specialised clinical practice. Regular line management and clinical supervision will be offered, and we will actively look at developing the successful applicant in this exciting role.&lt;/p&gt;\n&lt;p&gt;Currently this role is within a Monday – Friday 9am to 5pm post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Maxine Hope 01282 657999&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pendle House, Nelson", "postalCode": "BB9 9TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8384", "longitude": "-2.21189"}}, "title": "Specialist Dietician -  All-Age Eating Disorder Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252532", "validThrough": "2020-11-16T23:59:59+0000"}