{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T22:00:25+0000", "description": "&lt;p&gt;Medway Community Mental Health Team is a diverse multi-cultural team that is looking to recruit a band 6 Mental Health Nurse to work within the team, providing specialist mental health care for people with multiple and complex needs that require intensive support and to take a lead role in the Clozapine Clinic and Physical Health Clinic.&lt;/p&gt;\n&lt;p&gt;Our service focuses on promoting recovery for those people diagnosed with severe and enduring mental ill health. We provide comprehensive multi-disciplinary services and work closely with local specialist mental health teams, tertiary service providers, primary care, local statutory and non-statutory agencies, service users and carers.&lt;/p&gt;\n&lt;p&gt;What we offer:&lt;/p&gt;\n&lt;p&gt;- Participation in groups with Psychology and Occupational Therapy&lt;/p&gt;\n&lt;p&gt;- Opportunities to run groups&lt;/p&gt;\n&lt;p&gt;- Preceptorship for new qualified staff&lt;/p&gt;\n&lt;p&gt;- Leadership Modules to develop in senior roles&lt;/p&gt;\n&lt;p&gt;- Mentorship and Supervision&lt;/p&gt;\n&lt;p&gt;What you can expect once you join the team:&lt;/p&gt;\n&lt;p&gt;- Monthly supervision&lt;/p&gt;\n&lt;p&gt;- Reflective Group to discuss complex cases and share learning&lt;/p&gt;\n&lt;p&gt;- MDT Risk Forum to discuss complex cases with high risks&lt;/p&gt;\n&lt;p&gt;- Mandatory training&lt;/p&gt;\n&lt;p&gt;- Clinical Review of caseload with Consultant Psychiatrist and Team Leader&lt;/p&gt;\n&lt;p&gt;-Bespoke CPD programme&lt;/p&gt;\n&lt;p&gt;- Admin support&lt;/p&gt;\n&lt;p&gt;- Peer support&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and enthusiastic Mental Health Professional. You will have a strong sense of initiative and an excellent team working ability.&lt;/p&gt;\n&lt;p&gt;Effective communication skills and self-governance are required. You will be able to demonstrate knowledge of high level interventions &amp; community nursing skills. Existing qualifications or a willingness to undertake training relevant to the post is expected.&lt;/p&gt;\n&lt;p&gt;This post offers an excellent opportunity to work in an interesting and developing service environment. You will be offered considerable opportunities for training and professional development. The service line is currently developing care pathways which offers the opportunity to gain skills in offering specialist interventions to the different client groups that we work with.&lt;/p&gt;\n&lt;p&gt;As part of the Band 6 Nursing team you will be required to attain a mentoring qualification.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Cathy Hay &amp; Jasmine Dickens, Operationla Teaam Managers&lt;/p&gt;\n&lt;p&gt;Email addresscatherine.hay1@nhs.net, Telephone: 03003033189&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Britton House, , Gillingham", "postalCode": "ME7 1AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3885", "longitude": ".544437"}}, "title": "Community Mental Health Nurse-Clozapine Clinic and Physical Health Cl", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255012", "validThrough": "2020-11-18T23:59:59+0000"}