{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Per Annum"}}, "datePosted": "2020-10-26T12:31:16+0000", "description": "&lt;p&gt;We are looking for a well-motivated committed HCPC registered individual, to join our team as a Lead Biomedical Scientist for the Immunology and Allergy Service at University Hospital of Wales.&lt;/p&gt;\n&lt;p&gt;The successful candidate will act as the technical and staff lead of the Immunology Department on a day to day basis, in order to maintain the provision of a high quality service to patients, and will assist in the implementation of policies and procedures as defined by the Laboratory Service Manager and Clinical Leads.&lt;/p&gt;\n&lt;p&gt;It is essential that the successful candidate has experience of supervising staff and must have a proven ability to work within a team while also being able to motivate the team.&lt;/p&gt;\n&lt;p&gt;The Immunology Service at UHW performs over 250,000 tests per year to enable clinicians to diagnose and monitor a wide range of immunological conditions including allergies, immunodeficiencies and autoimmunity. We also offer a comprehensive range of complement tests as well as flow cytometry and NGS sequencing for Immunodeficiency (undertaken by our Molecular Immunology Clinical Scientist). The integration of laboratory and clinical services allows us to provide a cutting-edge laboratory testing service.&lt;/p&gt;\n&lt;p&gt;The Immunodeficiency Centre for Wales receives tertiary adult and paediatric referrals for immune deficiencies and allergy from across Wales and the expertise within the laboratory is essential in the diagnosis and monitoring of patients with complex immune disease.&lt;/p&gt;\n&lt;p&gt;The laboratory supports the monitoring and diagnosis of a large cohort of immunodeficiency disorders as well as specialist 22q11 MDT clinics, BMT clinics and Fever Syndrome clinics. There is close liaison with the clinical teams including nursing, medical and SpRs in Immunology with opportunities for involvement in the multiple ongoing research activities.&lt;/p&gt;\n&lt;p&gt;A full list of duties and responsibilities can be found in the Job Description.&lt;/p&gt;\n&lt;p&gt;The department actively encourages participation in CPD to develop skills that will assist in the pursuit of career ambitions and generally is willing to support appropriate study arrangements and leave.&lt;/p&gt;\n&lt;p&gt;There are excellent sports, social and crèche facilities available on the UHW site.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: 9th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mo Moody, Immunology Service Lead, 029 2074 8489, mo.moody@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of Wales, Cardiff", "postalCode": "CF14 4XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5068", "longitude": "-3.18937"}}, "title": "Lead Biomedical Scientist (Immunology) Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242444", "validThrough": "2020-11-09T23:59:59+0000"}