{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-23T16:01:21+0100", "description": "&lt;p&gt;&lt;strong&gt; Theatre Practitioner Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an ODP/RGN looking for a new challenge? Are you passionate about delivering high quality care within a modern Day Surgery Unit? Are you flexible and work well within a team? If so then this post may be for you.&lt;/p&gt;\n&lt;p&gt;The Alliance Day Surgery Theatre in Melton Mowbray has a 25-30 Hour per week vacancy and is looking to recruit a motivated and enthusiastic individual to join an existing team of staff who are passionate about delivering high quality patient centred care. You will have the opportunity to develop new skills and consolidate existing skills whilst working as part of a strong and cohesive team.&lt;/p&gt;\n&lt;p&gt;You will need excellent communication skills and the ability to build and maintain good working relationships with colleagues and service users.&lt;/p&gt;\n&lt;p&gt;Good organisational skills and a flexible approach to work are essential.&lt;/p&gt;\n&lt;p&gt;Your daily duties will consist of caring for patients during the peri operative phase. Providing anaesthetic support, surgical support and assistance and post operative recovery. We offer procedures for a number of specialities including Podiatric Surgery, Maxillo Facial, Plastic surgery, Gynaecology, Ocular plastics, Urology and General surgery. Current theatre practice is essential.&lt;/p&gt;\n&lt;p&gt;Your base will be Melton Mowbray Hospital. However, there will be times where you will be expected to travel across site and help cover at one of the other Alliance hospitals. We have 3 Day Surgery Units in The Alliance, the other two being at Loughborough Hospital and Hinckley and District Hospital. Therefore the ability to travel between sites and be a car driver is essential for the role.&lt;/p&gt;\n&lt;p&gt;At all Alliance hospitals there is free parking.&lt;/p&gt;\n&lt;p&gt;For more information please contact Trudy Thompson, Sister 07950 882784 or Rebecca Brown (Deputy sister) 01664854904.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Trudy Thompson Job title Sister Email address trudy.thompson@uhl-tr.nhs.uk Telephone number 01664 854904 Additional contact information&lt;/p&gt;\n&lt;p&gt;Our Unit is open Mon-Fri between 08:00-18:00&lt;/p&gt;\n&lt;p&gt;Informal visits are welcomed, come and meet us.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Melton Mowbray Hopspital, Melton Mowbray", "postalCode": "LE131SJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.766", "longitude": "-.877289"}}, "title": "Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241210", "validThrough": "2020-11-08T23:59:59+0000"}