{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15683", "minValue": "15683", "unitText": "YEAR", "value": "£9.33 per hour"}}, "datePosted": "2020-11-05T14:45:16+0000", "description": "&lt;p&gt;&lt;span&gt;Synchronicity Care Limited (SCL) /CDD Services are a wholly owned subsidiary company of County Durham and Darlington NHS Foundation Trust (CDDFT). SCL/CDD Services provides a range of non-clinical Estates, Facilities and Procurement services to CDDFT.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;SCL/CDD Services are looking to recruit a hardworking, flexible, enthusiastic and customer focussed individual to join our Domestic Services Team at Darlington Memorial Hospital. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Domestic Assistants are important members of the team who assist with maintaining a clean and welcoming environment over a 24/7 period for patients, staff and visitors within a busy acute hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful post holders will be required to carry out specific cleaning and other related duties to set procedures and standards and required to work as part of a team and have the ability to use a degree of initiative to prioritise and organise the daily duties, whilst maintaining a professional approach at all times regardless of the situation. Post holders will be also be expected to be flexible to the needs of the service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant should preferably have previous cleaning experience in a healthcare environment however full training will be provided and all successful post holders will be expected to work towards gaining a NVQ Level 2 Certificate in Cleaning and Support Services &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All posts will be subject to a 6 month probation period &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;For this advertised role successful post holders will be expected to work shifts including evening and weekends, full rota will be discussed at interview &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;SCL offers its own Terms and Conditions of employment which differ to the national NHS Terms and Conditions. As an employee in the company you will benefit from:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• A Competitive salary&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Excellent Performance Related Bonus Scheme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Up to 27 days annual leave plus bank holidays (dependant on service and contracted hours)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Access to a pension scheme - National Employment Savings Trust (NEST) – CDD Services will pay a 3% contribution (this is over and above the minimum contribution rate at the present time)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Night Shift Working Allowances (where appropriate)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Bank Holiday Working Allowances (where appropriate)&lt;/span&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "CDD Services (Synchronicity Care Ltd)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Domestic Services Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258155", "validThrough": "2020-11-19T23:59:59+0000"}