{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T13:01:07+0000", "description": "&lt;p&gt;CNTW and Newcastle Outer West Primary Care Network are extremely excited to be able to advertise a Band 6 Occupational Therapist Post for 3 years. This is a unique and innovative post and the successful candidate would need to have extensive experience of working within mental health and of managing risk.&lt;/p&gt;\n&lt;p&gt;The post is being developed to help individuals with psychiatric and psychological disorders live as healthy and independent lives as possible, focusing on those individuals who may not meet the thresholds for secondary care mental health services, but who may benefit from a comprehensive treatment plan for mental health that addresses multiple areas. This includes Occupational Therapy assessment and evidence based interventions using the model of human occupation, risk assessment for acute distress, personalised care plans for self-management, patient activation to achieve personal goals, social prescribing and signposting or referral onto recovery support and services.&lt;/p&gt;\n&lt;p&gt;This aspect of the role would involve being sub-contracted to working accross Newcastle Outer West GP Primary Care Network for 30 hours per week. GP practices include&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Throckl&lt;strong&gt;ey&lt;/strong&gt; Primary Care Centre&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Parkway Medical Group &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Denton Park Medical Group &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NewburnSurgery &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Denton Turret Medical Centre &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Westerhope Medical Group&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This would involve close working with an extensive team of GP&#39;s, ANP&#39;s, Clinical Pharmacists, Social Prescribers alongside other clinical and administrative support staff.&lt;/p&gt;\n&lt;p&gt;An integral part of this role will be to measure the Occupational Therapy clinical effectiveness and share outcomes with CNTW and the outer Wesr Primary Care Network. There will be opportunities to develop this new role and the service.&lt;/p&gt;\n&lt;p&gt;The additional 7.5 hours per week would be dedicated to working within CNTW, specifically within Newcastle West Community Treatment Team providing care-coordination to patients within secondary care services.&lt;/p&gt;\n&lt;p&gt;The successful candidate must be passionate about delivering excellent patient care, and be dynamic and motivated. You must have the ability to work autonomously but also as part of a multi-disciplinary team, and demonstrate excellent leadership skills.&lt;/p&gt;\n&lt;p&gt;As a CNTW employee you will receive in-depth training and CPD development opportunities as well as ongoing support via supervision, appraisal and MDT working. There will be opportunities to link with Occupational Therapists in Newcastle and Gateshead locality for professional and service development.&lt;/p&gt;\n&lt;p&gt;This is a bespoke, creative and innovative opportunity that will help facilitate career development.&lt;/p&gt;\n&lt;p&gt;Interviews can be conducted via MS Teams or Skype if required&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Paul Wales&lt;/p&gt;\n&lt;p&gt;Job title: Central Community Occupational Therapy Clinical Lead&lt;/p&gt;\n&lt;p&gt;Email address: paul.wales@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07866 151222&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle", "postalCode": "NE3 3XT"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0063", "longitude": "-1.63477"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246688", "validThrough": "2020-11-11T23:59:59+0000"}