{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753-£51,668"}}, "datePosted": "2020-10-30T13:28:00+0000", "description": "&lt;p&gt;We have an exciting opportunity for an experienced, dynamic and hands-on individual to join us as we build on the increasing evidence base that there is a need to coordinate rehabilitation for people experiencing symptoms of “long-Covid” with the new role of the Covid Rehabilitation lead&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;There is growing medical evidence and patient testimony showing that a small but significant minority of people who contract Covid cannot shake off the effects of the virus months after initially falling ill. Some estimates suggest that 10% of Covid patients may still be experiencing symptoms more than three weeks after infection, termed recently as “long-Covid”. Rehabilitation is critical to ensuring population recovery from the impacts of the pandemic and the long-term sustainability of the health and social care system. Community services are at the centre in shaping the rehabilitation agenda whilst working as part of the wider multidisciplinary and multiagency teams across all sectors.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As COVID rehabilitation lead for Sirona, you will provide coordination, leadership and support to staff across our community teams regarding the optimal delivery of the rehabilitation and advice &amp; guidance services for people post COVID-19. The role will work closely with the Specialist Services manager and the respiratory Clinical Lead as well as our system partners to articulate, develop and bolster pathways aiming to support.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role will act as a clinical expert; providing leadership, expertise, education and supervision to individuals across the organisation and wider system drawing from and embedding national and local best practice. You will work with us to identify training needs of staff within the system and develop, coordinate and deliver appropriate training plans. This training will be multi-disciplinary and across provider organisations&lt;br /&gt;The role will work to ensure collaborative working with MDT members and with colleagues across health, social care and the voluntary sectors to ensure the delivery of a co-ordinated multidisciplinary service for patients with long-Covid, working to ensure that gaps are plugged.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a rehabilitation specialist clinician, you will also plan and manage complete episodes of complex care, working in partnership with others, to small number of service users.&lt;br /&gt;The role will be part of a large Specialist Services portfolio including our Respiratory, Diabetes &amp; wound care specialist teams who all work with this ethos of supporting others through advice &amp; guidance, education &amp; embedding emerging evidence into practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are a clinician who is looking to develop their leadership skills in a supportive team of like-minded clinicians, enjoys working across community &amp; secondary care boundaries and is excited about being part of a service in a new and emerging area of evidence &amp; practice, this could the role for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed-term Contract/Secondment Opportunity(6 month), with likely extention.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base: New Friends Hall&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Hours: 0.8-1.0 WTE Flexible hours between 8am &amp; 6.30pm&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further Information Ceridwen Massey 07920077567&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: Thursday 12th November&lt;br /&gt;Interviews: Friday 20th November&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS16 1EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4797", "longitude": "-2.56677"}}, "title": "Advanced Specialist Clinical Practitioner- COVID-19 Rehabilitation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250348", "validThrough": "2020-11-12T23:59:59+0000"}