{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-23T09:45:42+0100", "description": "&lt;p&gt;We have an opportunity for an experienced nurse to join our accredited community mental health service covering Ware and Hertford, working in our outstanding organisation. Our teams can offer you opportunities to work in supportive multi disciplinary settings to develop your nursing career.&lt;/p&gt;\n&lt;p&gt;We can offer you a competitive salary, staff benefits package and excellent career development and training that comes from working for Hertfordshire Partnership University NHS Foundation Trust . In addition this post attracts a £6,000 Recruitment &amp; Retention premia. T&amp;C’s apply.&lt;/p&gt;\n&lt;p&gt;We are seeking nurses who can provide effective support and interventions to adults with mental health conditions to work collaboratively with service users in developing recovery goals and plans&lt;/p&gt;\n&lt;p&gt;You will have opportunity to contribute to service development working jointly with other agencies, and to provide specific nursing interventions and contribute a nursing voice in multi-disciplinary clinical discussions, care planning and assessments.&lt;/p&gt;\n&lt;p&gt;We can provide opportunities to specialise in clinic based work or community based work so do discuss this further with us at interview.&lt;/p&gt;\n&lt;p&gt;In return we offer regular supervision, access to regular nursing, CPD and MDT support and the chance to work in a joyful and supportive team. The area is well served with transport infrastructure to London and further afield. Hertfordshire is a diverse county offering cultural pursuits, market towns, beautiful countryside and historical sites.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGarikayi TeeraJob titleService ManagerEmail addressgarikayi.teera@nhs.netTelephone number07880082168&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cygnet House, Priory Street, Ware, SG12 0DE, Ware", "postalCode": "SG12 0DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8119", "longitude": "-.037244"}}, "title": "Community Mental Health Nurse with Recruitment Incentive", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239881", "validThrough": "2020-11-06T23:59:59+0000"}