{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18171", "minValue": "18171", "unitText": "YEAR", "value": "Band 3: £10.81 per hour plus HCA"}}, "datePosted": "2020-10-28T14:46:05+0000", "description": "&lt;p&gt;This post will provide a venepuncture service to Patients and Service Users who are housebound or attend Community Phlebotomy Clinics. The Phlebotomist will work under the direction of the Phlebotomy Supervisor and will ensure a clean, comfortable and safe environment for service users. &lt;br /&gt;&lt;br /&gt;The post holder will be expected to:&lt;br /&gt;&lt;br /&gt;To collect blood samples from patients attending clinic or all allocated Housebound patients using Butterfly or Vacutainer methods, ensuring the correct colour bottles are used for each sample&lt;br /&gt;&lt;br /&gt;To correctly label all samples once taken and package them in the appropriate manner ready for transportation to the laboratory&lt;br /&gt;&lt;br /&gt;To transport blood samples to the laboratory if and when required&lt;br /&gt;&lt;br /&gt;The main responsibilities of the post: &lt;br /&gt;&lt;br /&gt;To check patient details are correct and explain the procedure to the patient and ensure that the patient is comfortable throughout the procedure. &lt;br /&gt;&lt;br /&gt;To liaise with the hospital/pathology to ensure that all bottles are delivered&lt;br /&gt;&lt;br /&gt;To communicate with service users including booking appointments.&lt;br /&gt;&lt;br /&gt;To use the patient data forms available and ensure that you correctly list all relevant patient information that is requested&lt;br /&gt;Be willing to take an active interest in the service you provide, ensuring that you promote the service wherever possible to ensure a high level of attendance from patients&lt;br /&gt;&lt;br /&gt;To complete weekly stock checks to ensure there is adequate quantities of consumables and place orders for any stock requirements through the ordering system.&lt;br /&gt;&lt;br /&gt;Maintain cleanliness and hygiene as per NELFT infection control policies.&lt;br /&gt;&lt;br /&gt;A U.K drivers licence and access to a vehicle is crucial as you will be required to drive to housebound patient appointments as well as driving to various Health Centres (except where excluded under DDA)&lt;br /&gt;&lt;br /&gt;Flexibility is essential as you may be asked to work extra/unsociable hours &lt;br /&gt;&lt;br /&gt;The post holder will be expected to use own initiative during clinical sessions and escalate to line manager when necessary.&lt;br /&gt;&lt;br /&gt;Be willing to provide practical training/induction or observe and rate any newly qualified staff /agency from any community health service&lt;br /&gt;&lt;br /&gt;Be willing to attend any training and development in line with the needs of the organisation&lt;br /&gt;&lt;br /&gt;Input patient data onto relevant system. Being able to retrieve reports from RiO or equivalent.&lt;br /&gt;&lt;br /&gt;PLEASE NOTE: We can only accept applications from fully qualified phlebotomists with substantial experience of working as a qualified phlebotomist&lt;br /&gt;&lt;br /&gt;If shortlisted, you will be required to take a Literacy &amp; Numeracy assessment, date to be confirmed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;temporarystaffingrecruitment@nelft.nhs.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various, London &amp; Essex", "postalCode": "RM13 8GQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5218", "longitude": ".172052"}}, "title": "Bank- Phlebotomists", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247042", "validThrough": "2020-11-22T23:59:59+0000"}