{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-04T12:01:36+0000", "description": "&lt;p&gt;We are currently looking to recruit two enthusiastic experienced and motivated Band 5 Learning Disability Nurses (RNLD) or Mental Health Nurses (RNMH) dependent on experience and skills to join our Intensive Support Team, based in Peterborough at the Gloucester Centre. The successful applicants must be an NMC Registered Learning Disability Nurses or Registered Mental health Nurses or awaiting their PIN&lt;/p&gt;\n&lt;p&gt;The successful applicants will possess practical skills; have lived experience of supporting a person with learning disabilities or experience of working with people with learning disabilities with challenging communication needs; experience of working as part of a team; possess experience of undertaking holistic health care, be capable of providing accurate report writing, possess practical clinical skills and have a sound understanding of the legislation around individuals with Learning disabilities, Mental Health Act (83), Care Act (14) and Capacity Act (05) Children Act (89).&lt;/p&gt;\n&lt;p&gt;You will be joining an establish service of highly motivated health professionals where we value Multi-Disciplinary working and continually strive to develop our skills and knowledge to help us to be able to meet the needs of our service users in a creative and holistic way using a Positive Behavioural (PBS) approach .&lt;/p&gt;\n&lt;p&gt;The IST supports adults with learning disabilities with complex needs. The team supports the return of people from out of area placements to suitable local housing. The team works closely with services that support young people to prevent young people leaving Peterborough unnecessarily. The team also works closely with service users, their carers and families, and a range of non- statutory and statutory partners including housing, care support, primary and secondary health care, and the police, delivering high quality individualised programmes of care and support. IST also has a crisis stabilisation pathway where we support individuals to remain in the community when in crisis instead of requiring a hospital admission.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work with people with learning disabilities and contribute to Transforming Care and future development of the IST.&lt;/p&gt;\n&lt;p&gt;The IST runs an enhanced hours service from 8.00 am to 8.00 pm 5 days Monday to Friday with on call at weekends 9 am-5 pm (for individuals currently known to our service and supports them in a planned way). The successful candidate will be based in Peterborough although they will be expected to travel both locally and to other out of area placements.&lt;/p&gt;\n&lt;p&gt;The post is a full-time substantive post,&lt;/p&gt;\n&lt;p&gt;The ideal candidates will have a strong team work ethic, sense of accountability, accompanied by an ability to work under considerable pressure at times. This post is open to professionals with the right attributes to enhance a team.&lt;/p&gt;\n&lt;p&gt;We will provide the necessary support to ensure your development within your role. We are keen to support and develop our staff through a clear career pathway and encourage promotional opportunities within the Trust.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference for our community by supporting people with mental health or learning disability needs then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Sallyanne Broughton - Manager Intensive Support Team&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;sallyanne.broughton@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Mobile: 07903331037&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Andrew key - Deputy Manager &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;IST Office number : 01733 363101 answer Machine please leave a message&lt;/p&gt;\n&lt;p&gt;Mobile : 07944193672&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Intensive Support Team Gloucester Centre, Peterborough", "postalCode": "PE2 7JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5546", "longitude": "-.270029"}}, "title": "Community Nurse Intensive Support Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255724", "validThrough": "2020-11-18T23:59:59+0000"}