{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inc HCAS"}}, "datePosted": "2020-11-04T16:01:19+0000", "description": "&lt;p&gt;A wonderful opportunity has become available for Registered Mental Health Staff Nurses to develop their expertise in a specialist Eating Disorder Service, which forms part of CNWL NHS Foundation Trust. We are seeking a friendly, motivated individual who is committed to providing person centred care to patients with eating disorders.&lt;br /&gt;&lt;br /&gt;Experience of working with Eating Disorders is desirable but not essential for this post.&lt;br /&gt;&lt;br /&gt;You will work within the MDT in developing and implementing care for patients, you will receive support from your Ward Manager and Matron to help you develop your PDP and Re validation portfolio.The service is constantly evolving and therefore genuine opportunities for professional development.&lt;br /&gt;&lt;br /&gt;The ability to maintain boundaries is required for the post and candidates should be skilled in reflection and understanding of team dynamics.&lt;br /&gt;&lt;br /&gt;You will receive individual supervision as well as support in Staff and Reflective practice groups. In addition there are excellent training and development opportunities.&lt;br /&gt;&lt;br /&gt;The team are well established, dynamic, with a strong commitment to multidisciplinary working, service development and continued professional development. &lt;br /&gt;&lt;br /&gt;Vincent Square Clinic is a specialist eating disorder service centrally located in Chelsea. The unit has capacity for 15 inpatients, 12 day patients and also has a busy outpatient service as well as a Children and Young peoples service. We also have a satellite outpatient clinic at Northwick Park Hospital.&lt;br /&gt;&lt;br /&gt;A fully comprehensive daily programme comprising of activity and dynamic groups is an intrinsic part of the overall treatment process. The unit serves the boroughs of Kensington, Chelsea, Westminster, Ealing, Hammersmith, Hounslow, Hillingdon, Harrow and Hillingdon.&lt;br /&gt;&lt;br /&gt;Applicants applying from outside CNWL will be required to complete the CNWL Assessment centre which will consist of a Medication Numeracy Test along with completing a Care Plan based on a written scenario provided.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKuda KaliJob titleLead NurseEmail addresskkali@nhs.netTelephone number02033152104Additional contact information&lt;/p&gt;\n&lt;p&gt;Kuda Kali - Lead Nurse or Elizabeth Walsh - Ward Manager on 02033152104&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Vincent Square, South Kensington and Chelsea, London", "postalCode": "SW10 9NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.180208"}}, "title": "Staff Nurse - Eating Disorders", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256550", "validThrough": "2020-11-18T23:59:59+0000"}