{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-02T03:46:32+0000", "description": "&lt;p&gt;Our communications and engagement team is looking for a passionate and creative senior communications officer to be part of their busy team, helping to promote the CCG’s work and NHS services to local people, patients, GPs and others.&lt;/p&gt;\n&lt;p&gt;You will be the lead communications officer for a number of directorates/teams working with the directorate leads to develop and implement innovative and successful communications campaigns.&lt;/p&gt;\n&lt;p&gt;This opportunity comes at an exciting time as projects within the CCG are picking up pace. You will be responsible for working with staff within the CCG, staff from partner organisations and GP practices to develop and deliver communications plans.&lt;/p&gt;\n&lt;p&gt;You should have experience in using a range of tools and channels including: social media, filming and editing, web content, newsletters, blogs, press releases, media monitoring and events.&lt;/p&gt;\n&lt;p&gt;You will need to be educated to degree level (or have equivalent level of experience) and also have experience of communications, PR or marketing through working in or studying these areas.&lt;/p&gt;\n&lt;p&gt;If you have excellent writing skills, an attention to detail, are well organised, creative and have the ability to work to tight deadlines then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Please note that due to the ongoing coronavirus pandemic this role is currently home based, the successful candidate will be provided with IT equipment to ensure they are able to work effectively from home.&lt;/p&gt;\n&lt;p&gt;If you are interested in the role and think you have the right experience and abilities as detailed in the job description, please contact Erin Brady on erin.brady@nhs.net to arrange an informal discussion.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Sheffield Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128238"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S9 4EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3834", "longitude": "-1.41113"}}, "title": "Senior Communications Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251265", "validThrough": "2020-11-16T23:59:59+0000"}