{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa inc"}}, "datePosted": "2020-10-28T08:16:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Highly Specialist Speech &amp; Language Therapist – Adult Acute &amp; Critical Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fulfil your potential in hospitals that make history: Charing Cross, Hammersmith, St Mary’s, Queen Charlotte’s &amp; Chelsea and Western Eye&lt;/p&gt;\n&lt;p&gt;With five world-renowned hospitals, Imperial College Healthcare NHS Trust is full of opportunity if you are looking to develop your healthcare career.&lt;/p&gt;\n&lt;p&gt;We are an NHS Trust of 10,000 people, providing care for over a million patients from North West London and beyond every year. We have a rich heritage and an ambitious vision for the future of our patients and local communities.&lt;/p&gt;\n&lt;p&gt;With our partners, Imperial College London, The Royal Marsden NHS Foundation Trust and The Royal Brompton &amp; Harefield NHS Foundation Trust, we form Imperial College Academic Health Science Centre, one of 11 academic health science centres in the UK, working to ensure the rapid translation of research for better patient care and excellence in education.&lt;/p&gt;\n&lt;p&gt;We are proud of our heritage in innovation and we are early adopters of new insights in technologies, techniques and treatments for improving health.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and experienced speech &amp; language therapist to join our Adult Acute Speech &amp; Language Therapy Service (SLT) who exemplifies our Trust values. You will support the adult acute team on Charing Cross Hospital (CXH) site to deliver a high quality, evidence-based clinical service to patients with acquired communication and swallowing impairments across a range of medical and surgical specialties including Acute &amp; Specialist Medicine, Neurosciences, Elderly Medicine, Surgery and Cancer. The post has a particular focus on oncology, neuro-surgery and critical care. Based primarily at CXH, there will be cross-site working to St.Mary’s and Hammersmith hospitals as required&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have completed competencies in tracheostomy and videofluoroscopy, and have experience of independently managing patients with complex communication and swallowing problems in level 2 and 3 critical care settings. Experience with FEES would be an advantage, as would experience in the management of neuro-oncology patients including SLT input to awake craniotomy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The adult acute speech and language therapy service operates across 3 hospital sites with small friendly teams on each site. We hold weekly videofluoroscopy clinics and provide an SLT-led FEES service across all sites. The service is focused on driving forward evidence based practice and service improvements across all medical and surgical specialities, and staff are actively encouraged and supported to participate in CPD activities, audit and research.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Key responsibilities of the post include:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To provide a highly specialist clinical SLT service to a caseload of adult inpatients with communication/swallowing disorders resulting from acquired neurological/ medical/ surgical conditions of an acute or chronic nature.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To provide support and second opinion for colleagues and junior staff in these specialist areas and participate fully in multi-disciplinary working, service development and training.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To participate in the provision of videofluoroscopy clinics and the FEES service on CXH site.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To be a senior member of the Adult Acute CXH SLT Team, maintaining a high quality evidence-based service, and participating in development of the SLT service and the development of junior staff, including clinical supervision of junior SLTs and deputising for the Clinical Lead SLT as required.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karima Collins, Clinical Lead SLT – Adult Acute CXH, Stroke &amp; Neuro-rehabilitiation at karima.collins@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charing Cross Hospital, London", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Band 7 Highly Specialist Speech &amp; Language Therapist – Adult Acute &amp;", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245704", "validThrough": "2020-11-11T23:59:59+0000"}