{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-14T10:46:21+0100", "description": "&lt;p&gt;&lt;strong&gt;Principal Clinical / Counselling Psychologist &lt;/strong&gt;&lt;strong&gt;Clinical Health Psychology Service – Circle MSK Services&lt;/strong&gt;Grade/Salary: Band 8bLocation: BedfordHours: 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;The Psychological Services Directorate at EPUT invests in our staff through robust supervision, CPD opportunities and flexible working; welcomes innovative thinking; values and cares about the wellbeing of our staff. We want to welcome a Principal Clinical/Counselling Psychologist to our Clinical Health Psychology Family- a service which works with patients with a range of long term conditions, including Cancer, Stroke, COPD, Pain, HIV and obesity, amongst others.&lt;/p&gt;\n&lt;p&gt;The successful candidate will lead the Psychology provision in Circle MSK (Musculoskeletal Services) in Bedford whilst being a core part of our wider Clinical Health Psychology Service through regular meetings, trainings and supervision opportunities. The successful candidate will form a strong connection and undertake peer supervision with our other Pain Psychologists based in Luton, Harlow, Southend and Basildon. The successful candidate will supervise an Assistant Psychologist and work closely with multi-professional colleagues whilst enjoying regular supervision and support from a Consultant Psychologist. The successful candidate will be encouraged to further their training with pain / therapy related CPD opportunities.&lt;/p&gt;\n&lt;p&gt;Psychology is now well established within Circle MSK services, having been set up over the past 3 years. Multidisciplinary colleagues work closely with the Psychologist on complex case issues, service development and the Pain Management Programme group provision. The role is respected and valued by Circle MSK, who have increased the provision of Psychology in recent times in order to meet the needs of the population it serves. Teaching and training delivered by the Psychologist on issues concerning mental health for patients with persistent pain has been welcomed.&lt;/p&gt;\n&lt;p&gt;The post would suit a candidate with experience in Clinical Health Psychology settings who is ready for the challenge of service development; networking with other professionals and organisations; working with patients from a range of cultures and backgrounds; supervising a small team.&lt;/p&gt;\n&lt;p&gt;Join EPUT for a wealth of benefits, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A generous relocation package of up to £8000 (offered under specific terms)&lt;/li&gt;\n&lt;li&gt;Flexible working&lt;/li&gt;\n&lt;li&gt;Support to further CPD training&lt;/li&gt;\n&lt;li&gt;A range of well-functioning Staff Networks, including: BAME; LGBTQ+; Faith; Carers; Disability (please contact staff epunft.staffengagement@nhs.net for more information on Staff Networks)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Interview date:6th November2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;We would welcome an initial informal conversation with anyone interested in the post. Please contact Dr Judith Friedman, Head of Clinical Health Psychology at Judith.friedman1@nhs.net or 07813069114 for more information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Regent House, Wolseley Road, Woburn Road Industrial Estate, Kempston, Bedford, Bedford", "postalCode": "MK42 7JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1054", "longitude": "-.500298"}}, "title": "Principal Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225787", "validThrough": "2020-11-08T23:59:59+0000"}