{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T15:01:37+0000", "description": "&lt;p&gt;The pulmonary rehab team is looking for a physiotherapist to join our pulmonary rehab service to cover a one year period of maternity leave.&lt;/p&gt;\n&lt;p&gt;The post will be based at Nevells rd health centre in Letchworth and will involve running online and offline pulmonary rehab using resources such as video or telephone support as currently pulmonary rehab is not being run on a face to face basis due to the covid-19 pandemic situation.&lt;/p&gt;\n&lt;p&gt;Group exercise sessions at multiple venues in East &amp; North Herts may re start in 2021 with support as required from more senior staff.&lt;/p&gt;\n&lt;p&gt;Duties will include: the assessment and triaging of patients as either suitable/ not suitable for online/offline pulmonary rehab as well as running the 8 week pulmonary rehab groups when face to face services resume.&lt;/p&gt;\n&lt;p&gt;Delivery education to patients using online platforms such as MS teams is a likely requirement of the role.&lt;/p&gt;\n&lt;p&gt;In addition, depending upon experience, there will be an opportunity to carry a respiratory physiotherapy caseload e.g pts with bronchiectasis, cough and breathing pattern disorders.&lt;/p&gt;\n&lt;p&gt;Candidates must be able to demonstrate knowledge of pulmonary rehab with experience preferred but not essential. Candidates must have a good knowledge of common respiratory conditions and how they present. Visiting patients in their own home may be required.&lt;/p&gt;\n&lt;p&gt;Full induction and training will be provided.&lt;/p&gt;\n&lt;p&gt;Key skills-exceptional organisational/communication/motivational skills are required.&lt;/p&gt;\n&lt;p&gt;Candidates should be familiar with Word, Excel and Powerpoint as well as common social media platforms and all common IT applications&lt;/p&gt;\n&lt;p&gt;You must hold a full valid driving licence and have access to a car to use regularly for business purposes is essential (unless you have a disability as defined by the Equality Act 2010).&lt;/p&gt;\n&lt;p&gt;Interview - 19th November&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Gillian Austin&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Lead Physiotherapist&lt;/p&gt;\n&lt;p&gt;Email address: g.austin@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07500 991112&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hertfordshire Community NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nevells Road Health Centre, Letchworth", "postalCode": "SG6 4TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9809", "longitude": "-.22939"}}, "title": "Pulmonary Rehab Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243035", "validThrough": "2020-11-08T23:59:59+0000"}