{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T14:02:04+0000", "description": "&lt;p&gt;Sherwood Forest Hospitals and Nottinghamshire Healthcare are jointly recruiting for a full time Advanced Clinical Practitioner Physiotherapist. As an Advanced Clinical Practitioner Physiotherapist you will work within the integrated MSK team triaging all orthopaedic referrals to secondary care as well as reviewing patients face-to-face, completing relevant investigations, discussing and carrying out a range of treatment options in line with evidence based pathways, and making appropriate onward referrals. The MSK Together service has bases in Mansfield, Ashfield and Newark and the post holder will be required to work at all 3 sites.&lt;/p&gt;\n&lt;p&gt;This is an ideal role for a motivated individual who is passionate about delivering high quality, joined up clinical management of musculoskeletal conditions. Successful candidates will be provided with a comprehensive induction plan, mentorship and ongoing support.&lt;/p&gt;\n&lt;p&gt;MSK Together sees high quality teams coming together from a range of providers to deliver services across boundaries, providing seamless pathways of care with positive patient outcomes for the entire in-scope MSK pathway. Its aim is to improve patient experience and add value to the Health Economy within the Mid-Nottinghamshire area. The MSK hub enables patients to be navigated through the relevant parts of their pathway while being offered choice and being empowered to make decisions about their management options. MSK Together provides seamless and coordinated service across multiple providers.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karen Street Therapy Operational Manager Email karen.street6@nhs.net Tel: 01623 622515 ext 4274&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s Mill Hospital, Sutton-in Ashfield", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Advanced Practitioner Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252338", "validThrough": "2020-11-07T23:59:59+0000"}