{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 pa pro rata"}}, "datePosted": "2020-11-05T14:16:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Full-Time Senior clinical fellow Post in Paediatric Gastroenterology, Hepatology &amp; Nutrition&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bristol Royal Hospital for Children, Bristol UK&lt;/p&gt;\n&lt;p&gt;University Hospitals Bristol NHS Foundation Trust seeks applicants for a full-time Senior Clinical Fellow post for training in Paediatric gastroenterology, hepatology and nutrition based at Bristol Royal Hospital for Children.&lt;/p&gt;\n&lt;p&gt;Full educational support will be provided to the successful candidate. There is opportunity to train in diagnostic and therapeutic endoscopy alongside a commitment to medical on-call rota. The post is due to start January 2021 or as soon as possible, for 12 months. GMC sponsorship may be available to the right candidate.&lt;/p&gt;\n&lt;p&gt;Bristol Royal Hospital for Children is a tertiary, regional paediatric teaching hospital providing care in all paediatric specialities such as intensive care, neonatal care, trauma centre, national plastic referral centre, neurosurgery and bone marrow transplant centre etc. Paediatric gastroenterology department serves a population of approximately 1 million from Avon and the South West of England. The department diagnoses approximately 65 new cases of Inflammatory Bowel disease annually, has 25 home TPN patients and cares for children with liver disease.&lt;/p&gt;\n&lt;p&gt;You will join an enthusiastic, hardworking and supportive team of Consultants and allied health professionals in exciting city of Bristol.&lt;/p&gt;\n&lt;p&gt;Interview date: TBC&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For enquiries please contact Dr Dharam Basude (clinical lead) via Mrs Pauline Spencer on 0117 342 29450 or by email: Pauline.Spencer@UHBristol.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Hospital for Children, Bristol", "postalCode": "BS2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4578", "longitude": "-2.5973"}}, "title": "Clinical Fellow in Paediatric Gastroenterology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258064", "validThrough": "2020-11-19T23:59:59+0000"}