{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751-£73,664 per annum"}}, "datePosted": "2020-10-27T13:06:44+0000", "description": "&lt;p&gt;We are looking to appoint a talented leader, who will have a key role in shaping, planning and delivering patient focused quality improvement, governance and second Line of Defence assurance activity, as part of Headquarters Defence Medical Services (HQ DMS) and the wider Defence Medical Services (DMS).&lt;/p&gt;\n&lt;p&gt;The main objectives of the role are to provide professional leadership and expert advice and support on Healthcare Assurance, Patient Safety, Governance and Innovation within DMS, in support of the delivery of Healthcare and Medical services to entitled personnel.&lt;/p&gt;\n&lt;p&gt;As part of the Joint Medical Corporate Governance Team, you will be expected to lead on reporting to Defence and any other Superior Organisation that the DMS are providing safe, efficient and effective Healthcare and Medical Advice. This role will also be responsible for reporting in to the 3* (Director General) Joint Medical Management Board (JMGB), the 3* DMS Board (DMSB), the Strategic Risk Assessment Panel (SRAP) and the Quality Assurance and Risk Committee (QuAC), as well as reporting into UK Strategic Command 4* Boards and Defence Risk and Assurance 4* Boards. This role will be key to preparing the DG DMS for these holding to account sessions. You will also take a leading part in driving areas for improvement across a range of integrated and sometimes highly complex systems, processes, policies, and regulations.&lt;/p&gt;\n&lt;p&gt;Benefits for this post include; learning and development tailored to your role; a culture encouraging inclusion and diversity; free parking; access to a gym; hairdresser/barber on-site; Costa Coffee; convenience store and an on-site canteen.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please refer to the attached Job Description and Personal Specification for the role&#39;s responsibilities in further detail.&lt;/strong&gt;&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;Essential Criteria&lt;/h1&gt;\n&lt;ul&gt;\n&lt;li&gt;Professionally registered with GMC/NMC/HCPC/GDC/GPhC&lt;/li&gt;\n&lt;li&gt;Post Graduate qualification in Governance/ Assurance/Quality Improvement or in a healthcare related area&lt;/li&gt;\n&lt;li&gt;Graduate in Governance/Assurance/Quality Improvement and /or Risk Management&lt;/li&gt;\n&lt;li&gt;Quality improvement skills training&lt;/li&gt;\n&lt;li&gt;Active participant in CPD&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Desirable Criteria includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience of CQC Key Lines of Enquiry (KLoE)&lt;/li&gt;\n&lt;li&gt;Experience of military healthcare delivery&lt;/li&gt;\n&lt;li&gt;Full UK Driving Licence and C1 category and 2 years Driving experience&lt;/li&gt;\n&lt;li&gt;IT literate&lt;/li&gt;\n&lt;li&gt;Excellent interpersonal and communication skills&lt;/li&gt;\n&lt;li&gt;Previous experience of senior leadership/management role in clinical governance, assurance and quality improvement&lt;/li&gt;\n&lt;li&gt;Clinical experience in primary care and/or primary care senior leadership/management role&lt;/li&gt;\n&lt;li&gt;Experience in relevant areas, e.g. clinical supervision, training,mentorship and/or teaching skills&lt;/li&gt;\n&lt;li&gt;Proven ability to evaluate the safety and effectiveness of their own practice&lt;/li&gt;\n&lt;li&gt;Experience in the management of complex information and sharing across a wide variety of stakeholders using a variety of methodologies&lt;/li&gt;\n&lt;li&gt;Evidence of working autonomously and contributing effectively as part of a team&lt;/li&gt;\n&lt;li&gt;Act as an exemplar, with integrity, competently leads by example&lt;/li&gt;\n&lt;li&gt;Demonstrate inspirational, innovative and motivational leadership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;Selection Process&lt;/h1&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV.&lt;/p&gt;\n&lt;p&gt;Applications that progress to interview stage will be tested against the following NHS Key Skills Framework and Functional Competence Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core – NHSC1 – Communication&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC2 – Personal &amp; People Development&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC3 – Health, Safety &amp; Security&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC4 – Service Improvement&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC5 – Quality&lt;/li&gt;\n&lt;li&gt;NHS General – NHS G2 – Development &amp; Innovation&lt;/li&gt;\n&lt;li&gt;NHS Information &amp; Knowledge – NHS IK2 – Information Collection &amp; Analysis&lt;/li&gt;\n&lt;li&gt;NHS AfC Leadership and management - Level 4&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;Further Information&lt;/h1&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel, but you will support the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Coltman House, DMS Whittington, Lichfield, Staffordshire WS14 9PY", "postalCode": "WS14 9PY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6613", "longitude": "-1.77514"}}, "title": "Band 8C Healthcare Assurance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244661", "validThrough": "2020-11-18T23:59:59+0000"}