{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142"}}, "datePosted": "2020-10-29T17:15:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Therapy Support Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NHS is the biggest employer in Europe. It’s a world-renowned institution and an exciting place to work, full of challenges and opportunities.&lt;/p&gt;\n&lt;p&gt;The Robert Jones and Agnes Hunt Orthopaedic Hospital (RJAH) is one of the leading specialist orthopaedic hospitals in the country, with some of the highest levels of staff and patient satisfaction, as well as a strong reputation for innovation. We work together as a team of over 1,600 expert members of staff to make a difference for our patients and their families.&lt;/p&gt;\n&lt;p&gt;Our latest CQC Report was published in February 2019 and saw us rated as ‘Good’ overall and ‘Outstanding’ for care.&lt;/p&gt;\n&lt;p&gt;We have a proactive therapy team with motivated staff who are keen to develop further the role of therapy within our Trust. A core part of the Trust&#39;s clinical activity involves the multidisciplinary work across all our specialities.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a full time Therapy Support Worker to work within the Orthopaedic Unit.&lt;/p&gt;\n&lt;p&gt;Hours of work will be between 8am – 6.00pm, over a 7 day period.&lt;/p&gt;\n&lt;p&gt;Working within the existing team of dynamic therapists, the successful candidate will be actively involved in patient rehabilitation and provide clinical support to the therapy staff.&lt;/p&gt;\n&lt;p&gt;The therapy service aims to provide the patient with maximum independence and to equip them with functional skills to be able to reach their potential.&lt;/p&gt;\n&lt;p&gt;The successful post holder will contribute to the delivery of our orthopaedic therapy and will have excellent team working skills. Management of your own caseload is essential and therefore you must have the ability to work on your own initiative. Flexibility in your approach would be advantageous.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications/Experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a proactive, forward thinking individuals. Opportunities are available to develop and expand knowledge and skills. The successful applicant will need to demonstrate excellent communication skills and the ability to support and influence MDT working within the setting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for someone who wishes to expand their knowledge, is a good team player and enjoys a challenge. NVQ Level 3 (or equivalent) in a Clinical subject is essential or demonstrable relevant experience/knowledge and skills.&lt;/p&gt;\n&lt;p&gt;All applicants must have evidence of basic education in literacy and numeracy&lt;/p&gt;\n&lt;p&gt;There are excellent learning opportunities within this role and the service is committed to CPD, encouraging supervision at all levels.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Informal enquiries are encouraged, please contact Catherine Darley (Orthopaedic Therapy Team Leader) 01691 404240 or email catherine.darley@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121259.jpg", "name": "Robert Jones and Agnes Hunt Orthopaedic Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121259"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RJAH Orthopedic Hospital, Oswestry", "postalCode": "SY10 7AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8842", "longitude": "-3.03268"}}, "title": "Therapy Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249221", "validThrough": "2020-11-09T23:59:59+0000"}