{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 per annum"}}, "datePosted": "2020-11-04T09:46:35+0000", "description": "&lt;p&gt;If you are looking for an exciting opportunity in a brilliant forward thinking Trust, working with a brilliant team, look no further!&lt;/p&gt;\n&lt;p&gt;University Hospitals of North Midlands NHS Trust has an annual income of c£750m and over 11,000 dedicated staff operating across our two busy acute sites at Royal Stoke University Hospital and the County Hospital at Stafford. We provide a wide range of acute and specialist healthcare services to our local populations in Staffordshire, South Cheshire and Shropshire and we are also a Major Trauma Centre to a wider population of 3 million people stretching from Anglesey to the Peak District.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced senior nurse with passion and enthusiasm to join our corporate nursing team as the Deputy Chief Nurse. This is a unique opportunity for a talented individual to join an amazing team. You will need to have the necessary energy and credibility to lead the professional nursing and midwifery agenda in an exciting and innovative major teaching Trust.&lt;/p&gt;\n&lt;p&gt;As a key member of the Nursing and Midwifery leadership team, you will have responsibility for the patient safety and quality governance agendas along with the development and leadership of the Quality Improvement team that will support the roll out of our Continuous Quality Improvement Journey, ‘Delivering Exceptional Care’ which is very exciting!&lt;/p&gt;\n&lt;p&gt;You will have a key role in contributing to a culture that demonstrates our values and behaviours through your engaging and visible leadership style. You should have a track record in leading teams and delivering change in an engaging and thoughtful way. Working in and across teams is an important component of the role.&lt;/p&gt;\n&lt;p&gt;You will have opportunities to deputise for the Chief Nurse at both internal and external commitments, and you will be supported to fulfill your potential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Michelle Rhodes&lt;/p&gt;\n&lt;p&gt;Chief Nurse&lt;/p&gt;\n&lt;p&gt;michelle.rhodes@uhnm.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospitals of North Midlands NHS Trust, Stoke-on-Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Deputy Chief Nurse - Quality, Improvement and Innovation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255246", "validThrough": "2020-11-18T23:59:59+0000"}