{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35000", "minValue": "29000", "unitText": "YEAR", "value": "£29,000 - £35,000"}}, "datePosted": "2020-10-21T09:42:03+0100", "description": "&lt;p&gt;&lt;strong&gt;Job title: &lt;/strong&gt;Physiotherapist (MSK) &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Greater Manchester&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£29,000 - £35,000 depending on experience &lt;/p&gt;\n&lt;p&gt;InHealth is one of the leading providers of diagnostic and healthcare services to the NHS and Private sectors. Our primary goal is to make healthcare better by providing rapid and accurate assessment of every patient’s condition, enabling the right treatment to be delivered swiftly and effectively by specialist providers.&lt;/p&gt;\n&lt;p&gt;We have recently secured a major contract to provide First Contact Practitioner MSK services to one of our local CCG’s. We are committed to delivering a high quality FCP MSK service that will include the training and development of clinicians interested in pursuing a role as an FCP in Primary Care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;With that in mind, we are recruiting for Physiotherapists with suitable MSK experience to join our NWCATS team in Greater Manchester! The successful candidates may have an opportunity to train as a First Contact Practitioner in the near future. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our North West clinical assessment and treatment services are &lt;strong&gt;open 7 days a week, Monday to Sunday, and this is a full-time role working 37.5 hours per week on a rota/shift pattern basis.  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Overall summary of the position:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To provide an effective and efficient clinical physiotherapy service within the framework of clinical governance for patients that are referred to the NWCATS community service with diverse presentations and complex physical and psychological conditions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will you do as a Physiotherapist with InHealth?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work towards a diagnosis to develop and plan an individualised treatment programme for patients referred to the NWCATS service.&lt;/li&gt;\n&lt;li&gt;Monitor and evaluate the effectiveness of Physiotherapy interventions for patients.&lt;/li&gt;\n&lt;li&gt;Provide specialist advice to colleagues concerning the care or treatment of patients.&lt;/li&gt;\n&lt;li&gt;Work with senior colleagues to manage delegated responsibilities, for the management of patients with specific conditions. Be responsible for providing specialist physiotherapy and treatment plans for patients with these conditions.&lt;/li&gt;\n&lt;li&gt;Contribute to achieving performance targets for the service and oneself within specific clinical areas.&lt;/li&gt;\n&lt;li&gt;Liaise with higher education establishments for planning and provisioning of student placements through student liaison officers.&lt;/li&gt;\n&lt;li&gt;Take part in clinical audits and record outcome measures.&lt;/li&gt;\n&lt;li&gt;Interpret and analyse clinical and non-clinical data to modify and adapt treatments accordingly.&lt;/li&gt;\n&lt;li&gt;Access opportunities for professional development and career progression into First Contact Practitioner and Extended Scope Practitioner Roles.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You should apply if you have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Specialist knowledge in the management of MSK conditions&lt;/li&gt;\n&lt;li&gt;Proven ability of complex case management&lt;/li&gt;\n&lt;li&gt;A caseload portfolio which demonstrates evidence of CPD and reflective practice&lt;/li&gt;\n&lt;li&gt;Awareness of appropriate NICE guidance and evidence-based practice&lt;/li&gt;\n&lt;li&gt;Strong assessment and diagnostic skills which allow in depth provision of care for a complex caseload&lt;/li&gt;\n&lt;li&gt;Ability to work in a fast-paced environment with quick turnaround times&lt;/li&gt;\n&lt;li&gt;Degree in Physiotherapy and relevant HCPC registration&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We can facilitate opportunities for you to grow in something you enjoy, with focused support and access to roles you may want to develop in.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;InHealth is an equal opportunities employer and welcomes applications from all areas of the community.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "InHealth Pain Management Solutions Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Greater Manchester", "postalCode": "M18 7BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.18453"}}, "title": "Physiotherapist / Possible Trainee FCP (MSK)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235687", "validThrough": "2020-12-31T23:59:59+0000"}