{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 gross per annum"}}, "datePosted": "2020-11-02T08:16:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Lead Information Analyst (Business Intelligence) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A new opportunity has arisen within the Information Department at the Norfolk and Suffolk NHS Foundation Trust. As a Lead Information Analyst focussing on Business Intelligence (BI) you will be key to delivering Information and Intelligence across the Trust aimed at improving service user care. The Department is evolving as we focus on improving how we collate, analyse and share our information to drive better clinical performance. The Trust is seeking to appoint a confident, committed, skilled and motivated analyst to work as part of the Information Department. You will play a pivotal role in the development of BI analytics alongside the Information Service provision by offering knowledge and guidance, ensuring that an information analysis service is maintained.&lt;/p&gt;\n&lt;p&gt;Working closely with the Information Reporting Manager you will support Business Intelligence development across the Trust. This will entail supporting the delivery of the Information Strategy, possessing an understanding and awareness of; National NHS reporting requirements, NHS Data Standards and Definitions, information data flows and benchmarking. Being responsible for ensuring the day to day delivery of reporting you will have previous experience of working flexibly, under pressured conditions, and be adaptable to changing requirements and deadlines.&lt;/p&gt;\n&lt;p&gt;You should have the ability to produce intelligence derived from a range of data collected via Trust systems held locally and deliver succinct reporting that supports stakeholder requirements that may be used for service delivery, service improvement, business planning and commissioning. You will possess good technical, analytical, communication and organisational skills with a flair for improvement. Candidates should be educated to Degree level or equivalent experience. This post requires the use of Microsoft applications including Power BI, SQL Server Reporting Services (SSRS), SQL Server Management Studio (T-SQL), and Excel to interrogate, analyse and present data in appropriate formats.&lt;/p&gt;\n&lt;p&gt;This is a full time post (37.5 hours per week) and will be based in Ipswich. In line with the current Trust approach, this role will initially be based working from home. This may be subject to change in line with Trust policy and government reommendations. There will be a requirement to travel across Norfolk and Suffolk on occasion.&lt;/p&gt;\n&lt;p&gt;For further details or an informal discussion please contact Angela Bowman on angela.bowman@nsft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAngela BowmanJob titleInformation reporting managerEmail addressangela.bowman@nsft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Endeavour House, Ipswich", "postalCode": "IP1 2BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0542", "longitude": "1.14344"}}, "title": "Lead Information Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251309", "validThrough": "2020-11-22T23:59:59+0000"}