{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50000", "minValue": "42000", "unitText": "YEAR", "value": "£42-50K dependent on experience"}}, "datePosted": "2020-11-03T14:08:15+0000", "description": "&lt;p&gt;Sphere Primary Care Network is a collection of constituent GP Practices which was established in November 2019. The role of the Network is to enable practices to work collaboratively and in a mutually supportive way to deliver scalable services for patients.&lt;/p&gt;\n&lt;p&gt;Harrow Health GP Federation are looking to recruit a Primary Care Network Manager on behalf of Sphere Primary Care Network. This is a newly established and exciting post for a hands on manager to lead a Network of 6 GP practices with a collective list size of approximately 64,000 patients. The successful candidate will be flexible and adaptable with the ability to work at both an operational and strategic level to develop the opportunities available to the Network. The desired candidate will have experience of working within the primary care environment and engaging effectively with all partner practices, GPs and other key stakeholders across the locality.&lt;/p&gt;\n&lt;p&gt;Some of the key areas of responsibility would include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supporting practices to employ additional roles including contracts of employment, claims and Human Resources.&lt;/li&gt;\n&lt;li&gt;Ensure utilisation of full budget and strategic planning until 2024.&lt;/li&gt;\n&lt;li&gt;Co-ordinate PCN wide enhanced services such as Effective Resource Management (ERM) Medicines management, including service continuity planning and Covid contingency plans (Flu Vaccinations and Diagnostics).&lt;/li&gt;\n&lt;li&gt;Facilitate implementation of PCN DES requirements, ensuring the delivery of structured medication reviews, enhanced care in care homes and cancer care.&lt;/li&gt;\n&lt;li&gt;Link in with other work-streams and feeding back to the wider Network&lt;/li&gt;\n&lt;li&gt;Supporting leads to develop new models of care such as frailty, dermatology and cardiology.&lt;/li&gt;\n&lt;li&gt;Be a point of contact for all PCN queries and oversee all PCN related projects.&lt;/li&gt;\n&lt;li&gt;Work closely with Harrow practice managers and liaise with the leads from the other four Primary Care Networks and the GP Federation to build and maintain effective collaborative relationships that enable us to share knowledge, ideas, learning and developing joint initiatives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To arrange an informal discussion about the role, please contact Benilda Rodrigues on 020 8866 4100 Ext 220 or benilda.rodrigues@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrow Health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrow", "postalCode": "HA5 3HR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5947", "longitude": "-.383733"}}, "title": "Primary Care Network Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254266", "validThrough": "2020-11-16T23:59:59+0000"}