{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 pro rata, per annum"}}, "datePosted": "2020-10-23T13:30:46+0100", "description": "&lt;p&gt;We are looking for a Band 5 or Band 6 Physiotherapist (dependant on experience) to join our pathway 3 team. post is full time&lt;/p&gt;\n&lt;p&gt;Pathway 3 teams are based within care home across Somerset and have the purpose of providing rehabilitation to patient who have a longer rehab journey ahead of them and who might have slightly more complex pre-existing condition and/or social situation which impact their abilities&lt;/p&gt;\n&lt;p&gt;Our Taunton/ West Somerset Vacancies will be based within a nursing home in Taunton and provide outreach therapy to a small unit in Minehead and you will join the existing team based within this Care home. The pathway units are therapy focussed and therapy lead with regarding to goal setting and discharge planning&lt;/p&gt;\n&lt;p&gt;We are looking for a Physiotherapist who has experience working within both the community and within a bedded environment, your will need to use your enhanced clinical reasoning to provide rehabilitation assessment and treatment to the patient within the unit.&lt;/p&gt;\n&lt;p&gt;We are looking for an Physiotherapist to come in to the team help support the rehabilitation delivery within these units&lt;/p&gt;\n&lt;p&gt;There will be an expectation to travel between the units and cover across both sites and we provide a 7 day week model so weekend working will be required to support service need.&lt;/p&gt;\n&lt;p&gt;You as a team will be linked with the existing integrated rehabilitation team and local neighbourhood teams and help transition patient from the unit back into the community setting via the discharge to assess model.&lt;/p&gt;\n&lt;p&gt;Contact Louise Bird on 07917371972&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namelouise birdJob titleIRT service development leadEmail addresslouise.bird@somersetFT.nhs.ukTelephone number07917371972&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oak Meadows Nursing home, , Taunton", "postalCode": "TA6 4RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1479", "longitude": "-2.99453"}}, "title": "Physiotherapist, Band 5/6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240713", "validThrough": "2020-11-06T23:59:59+0000"}