{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T08:45:26+0000", "description": "&lt;p&gt;Are you interested in a career in paediatric emergency nursing? If so there is a position here for you at East Kent. We are one of the largest acute Trusts in England and are in the enviable position of being surrounded by beautiful beaches and the Kent countryside but with easy links to the centre of London. So, whether you are interested in cathedrals, castles, exceptional grammar schools or chic and stylish restaurants, East Kent has something for everyone.&lt;/p&gt;\n&lt;p&gt;Now is an exciting time to join the Urgent &amp; Emergency Care Group at East Kent Hospitals. We were one of the Top Ten trusts in England for improvements in our emergency care access standards last year. We have also recently invested £6.2million in improvements across our emergency floor.&lt;/p&gt;\n&lt;p&gt;We are a multi-site Trust with two acute hospitals in Ashford and Margate; we are a trauma unit and regularly receive major trauma and helicopter emergencies from the regional air ambulance and coastguard. We pride ourselves on being a clinically led organisation and are passionate about developing and empowering our staff.&lt;/p&gt;\n&lt;p&gt;Our paediatric emergency department team at East Kent Hospitals work closely together to provide a service to the local population of children and young people in East Kent. This includes links with the urgent care centres, community nursing teams and the South Thames Retrieval Services.&lt;/p&gt;\n&lt;p&gt;We work closely with adult ED, the paediatric inpatient wards and Children’s Assessment Units who have Children’s Advanced Nurse Practitioners providing senior clinical leadership.&lt;/p&gt;\n&lt;p&gt;Due to an organisational re structure, new nursing leadership and internal promotion we are investing in our front-line services and are redesigning our pathways to promote collaborative working and enhance the experience for our paediatric patients and their families.&lt;/p&gt;\n&lt;p&gt;You will be supported in our team with a mentor and career develop is encouraged. We have a variety of local development opportunities including; EPALS (European Paediatric Advanced Life Support), Paediatric Trauma team days, neonatal teaching, in-house simulation, children and young people’s mental health, Emergency Nurse Practitioner development. We support and encourage education and learning to help you to reach your academic potential, to promote this we offer a generous study leave package, if you are new to the Trust we provide a recruitment and retention initiative of up to £3000.&lt;/p&gt;\n&lt;p&gt;We support every member of our team to bring their own individualised interests, personality and experience to enable our department to be a great place to work.&lt;/p&gt;\n&lt;p&gt;Staff and patients from across East Kent Hospitals (EKHUFT) are the feature of the biggest NHS recruitment drive in its 70-year history.&lt;/p&gt;\n&lt;p&gt;‘We are the NHS’ campaign highlights the extraordinary work that staff across our organisation do every single day. Serving a population of over one million people, EKHUFT was perfectly placed to demonstrate the care, cutting-edge treatments, research, innovations and life-saving operations that the campaign needed. If you are a junior nurse looking for a new career or an experienced nurse looking for promotion then look no further. We would be delighted to talk to you about joining our organisation which is like a supportive family.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tracey Bridges&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Paediatric Matron&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;QEQM Emergency Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;07976210869&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;tracey.bridges1@nhs.net &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth the Queen Mother Hospital, Margate", "postalCode": "CT9 4AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3781", "longitude": "1.38941"}}, "title": "Paediatric Nurse - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251343", "validThrough": "2020-11-16T23:59:59+0000"}