{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per anum"}}, "datePosted": "2020-10-28T14:01:44+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;We are currently looking to recruit a skilled and highly motivated practitioner into the role as Clinical Nurse Specialist (CNS). This is an exciting and dynamic role that offers the opportunity for development within the role.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will be an integral part of a Forensic Healthcare team and provide strong clinical leadership, contribute to service development and the maintenance of high clinical standards, utilizing extensive clinical experience and guided by NICE recommendations.&lt;/p&gt;\n&lt;p&gt;You will be based at the Hellingly Centre and currently this post is for the woman’s service attached to Low secure ward where you will be working alongside the ward manager in developing the service and ensure the team are delivering care to the highest standard. The post holder will have the opportunity to lead on and develop clinical supervision within the ward, from individual supervisions to group supervisions in the format of Clinical Issues Groups. You will be required to work autonomously and provide leadership during, and following, complex clinical dilemmas that may arise on the ward, in some instances this may also require you to guide and support other professionals within the hospital when carrying out investigations relating to serious instances. We will provide you with support and you will also have the opportunity to develop and facilitate development days in line with the nursing strategy. We will actively be encouraging you with your professional development.&lt;/p&gt;\n&lt;p&gt;You will need to develop a thorough understanding of the key policies and how to ensure they are delivered accurately in this environment, alongside an ability to lead change to improve patient and staff experience of working in our services.&lt;/p&gt;\n&lt;p&gt;You will have support from the MDT within your role, as well the wider leadership team and receive supervision from the Matron and Nurse Consultant.&lt;/p&gt;\n&lt;p&gt;The post may be completed 9-5 over a 7 days a week or alternatively worked across 3 days a week by doing 12 hrs shift which would be 50% in rota to support safer staffing this would be discussed further at interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please contact Anita Lambert anita.lambert@sussexpartnership.nhs.uk for more details 01323 444185&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hellingly Centre, Hellingly", "postalCode": "BN27 4ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8889", "longitude": ".268666"}}, "title": "Forensic Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246897", "validThrough": "2020-11-11T23:59:59+0000"}