{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20371", "minValue": "19039", "unitText": "YEAR", "value": "£19,039 - £20,371"}}, "datePosted": "2020-10-30T15:56:31+0000", "description": "&lt;p&gt;As a leading provider of NHS Services in Surrey, we are passionate about supporting our staff to fulfil their true potential&lt;/p&gt;\n&lt;p&gt;To help us achieve this we need to grow our team of Healthcare Support Workers across Royal Surrey Hospitals including, St Luke’s Cancer Centre and our Community Hospitals, with both Permanent and Temporary (Bank staff), Full and Part Time.&lt;/p&gt;\n&lt;p&gt;In this vital care support role, you’ll develop professional healthcare experience, gain a formal qualification and be part of the nursing team working hands-on in a hospital environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why be a Healthcare Support Worker?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As well as an opportunity to gain or increase your healthcare experience and knowledge, joining Royal Surrey is a great way into a long-term NHS career with prospects. It’s a rewarding and varied role, making a positive difference to people’s lives every day.&lt;/p&gt;\n&lt;p&gt;You don’t necessarily need previous care experience, we will give you full and ongoing training to achieve your true potential, in addition to growing your skills and knowledge working with other registered healthcare professionals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Being a Healthcare Support Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You’ll provide a variety of care and support for hospital patients as part of a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your day-to-day responsibilities will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Clinical tasks, like collecting samples, swabs and recording patients’ fluid intake/output.&lt;/li&gt;\n&lt;li&gt;Ensuring patients’ safety and comfort, supporting them with daily activities, including helping them to eat, drink and maintain personal hygiene, and using equipment to move and assist in your care of them.&lt;/li&gt;\n&lt;li&gt;Observing temperature, pulse and blood pressure, maintaining patient records and reporting any abnormalities to senior colleagues.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You will demonstrate that you have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Been part of a team that delivered or exceeded against expectations.&lt;/li&gt;\n&lt;li&gt;Flexibility, patience, and the ability to work under pressure.&lt;/li&gt;\n&lt;li&gt;Used your own initiative as well as taking direction.&lt;/li&gt;\n&lt;li&gt;Performed routine tasks as well as responding to quickly changing priorities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Training, Development &amp; Progression&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We will ensure that you receive the full training required to enable you to provide excellent patient care and clinical support. In addition you will gain some nursing skills and work towards a recognised Care Certificate.&lt;/p&gt;\n&lt;p&gt;As you develop, you’ll have more opportunities to gain further qualifications and progress your career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Outstanding benefits package, including NHS Pension,&lt;/li&gt;\n&lt;li&gt;Innovative on line learning to help develop your career&lt;/li&gt;\n&lt;li&gt;NHS staff discounts at a wide range of providers Including Nike, Tesco, Argos, O’Neills, Pizza Hut &amp; Deliveroo&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250845", "validThrough": "2020-11-13T23:59:59+0000"}