{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-05T09:46:36+0100", "description": "&lt;p&gt;We are looking for an enthusiastic Principal Clinical Scientist - to join us in the Department of Clinical Biochemistry to assist in the provision and development of the Clinical service at East Suffolk and North Essex Foundation Trust (ESNEFT). There is a dedicated and friendly team of four Clinical Scientists (two consultants, one principal and one senior) and one Consultant Chemical Pathologist working across the two laboratory sites (Ipswich and Colchester). Additionally we have two new STP trainees commencing their training with us in September 2020.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be working across both Trust sites, but will be based primarily at the hub laboratory at Ipswich. Both laboratories use Roche analysers for routine automated general chemistry and immunoassays and this equipment is currently being upgraded. The hub laboratory is also well-equipped with additional analytical equipment for protein electrophoresis, renal stone analysis, faecal immunochemical testing and vitamin D. You will participate in the Duty Biochemist rota for both sites and will be expected to join the out of hours clinical advice rota in the future when appropriate. You will contribute to the training of more junior clinical scientists and you will be supported in your own training and development.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be HCPC registered as a Clinical Scientist with an MSc in Clinical Biochemistry (or closely related subject) and ideally a PhD. Appointment to Band 8b will require you to have 5 years post registration Clinical Biochemistry experience and Part 1 FRCPath with demonstrated commitment and progression towards Part 2. Applications will be considered for appointment to Band 8a for candidates who do not meet the full person specification for band 8b.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Previous applicants need not apply.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details or to arrange an informal visit please contact one of the Consultant Biochemists:&lt;/p&gt;\n&lt;p&gt;Dr Catherine Street on 01206 742415 or&lt;/p&gt;\n&lt;p&gt;Ms Sophie Hepburn 01473 712233&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ESNEFT - Ipswich Hospital, Ipswich", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Principal Clinical Scientist - Biochemistry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212056", "validThrough": "2020-11-15T23:59:59+0000"}