{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-04T12:15:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Secondment Opportunity with the Arranging Support Team for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Arranging Support Team Broker x 2 FTE Posts&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Arranging Support Team are seeking an enthusiastic, motivated team members to join the new Arranging Support Team function.&lt;/p&gt;\n&lt;p&gt;The Arranging Support Team has been in place since April this year and is responsible for researching, and sourcing personal care and/or enabling support options to meet individual assessed needs which promote independence and maintain wellbeing in line with Torbay’s model of care.&lt;/p&gt;\n&lt;p&gt;Potential candidates must have excellent communication skills, be able to accurately interpret a range of referral forms from Health &amp; Social Care colleagues as well as an understanding and awareness of a wide range of available resources; including commissioned services, technology and other community offers. Candidates must have the ability to prioritise and manage their workloads, work to deadlines, and be able to complete contractual documentation accurately and in line with agreed processes.&lt;/p&gt;\n&lt;p&gt;Applicants must also be able to demonstrate excellent computer skills and be willing to learn to utilise a range of systems in line with the Arranging Support Team function.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These posts are for 12 months fixed term initially with a view to becoming permanent.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For more information please contact Reece Reid&lt;/p&gt;\n&lt;p&gt;reece.reid@nhs.net / 01803 219853&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torquay ISU", "postalCode": "TQ1 3YA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4675", "longitude": "-3.53032"}}, "title": "Arranging Support Team Broker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255763", "validThrough": "2020-11-18T23:59:59+0000"}