{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "52036", "minValue": "38694", "unitText": "YEAR", "value": "£38,694- £52,036 per annum"}}, "datePosted": "2020-10-19T11:16:47+0100", "description": "&lt;p&gt;We are seeking a Clinical Research Fellow to pursue a MR-Linac-based research project in abdominal malignancies. The MR-Linac is a state-of-the-art radiotherapy machine that uses magnetic resonance imaging to direct image-guided radiotherapy and offers the potential of adapting treatment delivery in real-time to account for inter- and intra-fraction variations in the positions of target volumes and organs-at-risk. We are seeking a motivated individual with a strong background in radiation oncology, preferably having passed first and second parts of the FRCR to support research activities for Hepatobiliary and Pancreatic cancers (HPB) and Paediatric upper abdominal tumours, focussing on the development and implementation of MR guided radiotherapy, and 4DMRI planning. Further detail can be found in the attached job description.&lt;/p&gt;\n&lt;p&gt;The successful candidate would be expected to register and complete an MD(Res) research degree at The Institute of Cancer Research during the post.&lt;/p&gt;\n&lt;p&gt;As a Clinical Research Fellow at The Institute of Cancer Research and the Royal Marsden Hospital you will&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Register for a two year post-graduate research degree (MD Res) at The Institute of Cancer Research;&lt;/li&gt;\n&lt;li&gt;Receive expert supervision from ICR’s top-class Faculty and participate in the highly successful translational research culture;&lt;/li&gt;\n&lt;li&gt;Be expected to make a substantial contribution to knowledge in your clinical area through hypothesis-driven original research, normally leading to published work and the award of a MD(Res) degree&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The starting salary will be in the range £38,694 - £52,036 per annum.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Katharine Aitken (Katharine.aitken@rmh.nhs.uk) or Dr Henry Mandeville (henry.mandeville@rmh.nhs.uk)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden Hospital, Chelsea and Sutton", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Clinical Research Fellow MR-guided Radiotherapy for Abdominal Tumours", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232011", "validThrough": "2020-11-16T23:59:59+0000"}