{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44802", "minValue": "44802", "unitText": "YEAR", "value": "£44,802.70 per annum"}}, "datePosted": "2020-10-20T09:36:33+0100", "description": "&lt;p&gt;&lt;em&gt;Ready for the recognition&lt;em&gt;and rewards you deserve?&lt;/em&gt;&lt;/em&gt;We don’t just talk about putting employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort. So we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Kneesworth House offers purpose built services withmedium secure, low secure, and both locked and open rehabilitation opportunities.&lt;/p&gt;\n&lt;p&gt;Thewide range of care settings maximises the opportunity for patients to have step down pathways and move easily between care settings to whatever level of security is most appropriate for their care. In addition to ward-based living and activity areas there is patient engagement opportunity in varied occupational therapy facilities. Patients here report high levels of satisfaction. Four residential houses afford a clear step down pathway for patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Ward Manager role involves:&lt;/p&gt;\n&lt;p&gt;To provide clinical management and leadership of the full nursing team on the ward; this includes being a highly visible role model and mentor to the nursing team. The post holder has responsibility for overseeing and maintaining the highest standards of nursing care. The role will act as a senior clinical member of the team, providing advice and support from a nursing perspective and oversee and hold responsibility for the ward environment and its resources.&lt;/p&gt;\n&lt;p&gt;To be successful as Ward Manager, you’ll need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;First level Registered Nurse – RMN/RNLD with at least 2 years in a supervisory capacity;&lt;/li&gt;\n&lt;li&gt;Appropriate registration required for the ward&lt;/li&gt;\n&lt;li&gt;Mental health for mental health wards;&lt;/li&gt;\n&lt;li&gt;Learning disabilities for LD wards;&lt;/li&gt;\n&lt;li&gt;Evidence of continuing professional development&lt;/li&gt;\n&lt;li&gt;Willingness to complete further clinical, managerial and leadership training and development relevant to your area of practice in management and leadership;&lt;/li&gt;\n&lt;li&gt;Trained and current mentor;&lt;/li&gt;\n&lt;li&gt;Computer literate;&lt;/li&gt;\n&lt;li&gt;Experience of clinical audit and/or service improvement based on evidence is desirable;&lt;/li&gt;\n&lt;li&gt;Experience of working in an environment that requires the ability to manage multiple priorities;&lt;/li&gt;\n&lt;li&gt;Experience of supervising nursing staff&lt;/li&gt;\n&lt;li&gt;Efficient and effective use of nursing resources; and all resources in that ward area that contribute to service user care, including medicines management, equipment, staffing&lt;/li&gt;\n&lt;li&gt;Work 40% per week clinical time (equivalent to 15 hours) on their wards&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;About our benefits In return for your expertise and hard work, we offer a wide range of benefits:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;25 days annual leave plus bank holidays (at commencement of employment)&lt;/li&gt;\n&lt;li&gt;£5,000 Welcome Bonus&lt;/li&gt;\n&lt;li&gt;Relocation support (including payment for accommodation or moving costs), paid as a lump sum\n&lt;ul&gt;\n&lt;li&gt;Moving less than 100 miles up to £2,000&lt;/li&gt;\n&lt;li&gt;If more than 100 miles up to £4,000&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;CPD top up&lt;/li&gt;\n&lt;li&gt;Donation to a charity of their choice&lt;/li&gt;\n&lt;li&gt;A Group Personal Pension Plan (GPPP)&lt;/li&gt;\n&lt;li&gt;Private Medical Insurance Scheme&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Free meals while on duty&lt;/li&gt;\n&lt;li&gt;Carefirst – Employee Assistance Services&lt;/li&gt;\n&lt;li&gt;Continuous learning and development&lt;/li&gt;\n&lt;li&gt;Career development&lt;/li&gt;\n&lt;li&gt;Personal health insurance&lt;/li&gt;\n&lt;li&gt;Voluntary Benefits&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;Disclosure&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royston, Hertfordshire", "postalCode": "SG8 5JP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0781", "longitude": "-.03059"}}, "title": "Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233603", "validThrough": "2020-11-13T23:59:59+0000"}