{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "38,890 - £44,503"}}, "datePosted": "2020-10-23T08:27:06+0100", "description": "&lt;p&gt;&lt;strong&gt;St Mary’s Hospital, Newport, Isle of Wight&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Breast Clinical Nurse Specialist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Agenda for Change - Band 7 Full Time Permanent Position&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an advanced practitioner to take on this specialist nursing role working as a key member within the Breast multidisciplinary team. The post requires vision, innovation and the ability to work across professional boundaries, underpinned by a real desire to provide the highest standards of patient care.&lt;/p&gt;\n&lt;p&gt;This post will work in collaboration with, and autonomously as part of, the Breast team to help develop and deliver services across organisational, professional and geographical boundaries. This role will work closely with key areas of the Trust, forging close working relationships with the visiting consultants from the Cancer Centres, the Medical and Cancer teams and the Specialist Palliative Care team.&lt;/p&gt;\n&lt;p&gt;It is essential that you possess a high level of up-to-date relevant clinical knowledge and experience in Breast procedures, Oncology or specialist Palliative Care with evidence of ongoing continuous professional development. You must be highly motivated with strong leadership and excellent communication skills.&lt;/p&gt;\n&lt;p&gt;Working with the Cancer Management Team this post will be responsible for the implementation and assessment of the service against the NHSi Quality Measures for breast cancer.&lt;/p&gt;\n&lt;p&gt;If you have not attained the aforementioned clinical knowledge, consideration will be given to appointing in accordance with Annex 21 Band 7 with progression on appraisal and completion of relevant educational courses.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; For further information about the role or an informal discussion please contact Anne Snow- Consultant Lead Cancer Nurse and Lead Clinician 01983 534379 or email annesnow1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127355.jpg", "name": "Isle of Wight NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127355"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": ", Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Breast Cancer Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239690", "validThrough": "2020-11-06T23:59:59+0000"}