{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £51,668 pa"}}, "datePosted": "2020-10-15T11:02:13+0100", "description": "&lt;p&gt;Band 7/8a Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;You are invited to join the Community Neuro-Rehabilitation Team based at Gravesend Community Hospital. You will be working closely with an experienced clinical psychologist and multidisciplinary colleagues in a stable and supportive team environment with good working relationships. You will receive regular supervision and encouragement to develop your career. The post involves working with patients with acquired brain injury and stroke, mainly in a clinic setting but with home visits as required and occasional liaison with the Stroke Unit at Darent Valley Hospital to facilitate a smooth pathway of care.&lt;/p&gt;\n&lt;p&gt;The Kent Clinical Neuropsychology Service is one of the largest Neuropsychology Departments in the country. We provide neuropsychological assessment and rehabilitation in a variety on inpatient and community settings across the county. We work with a variety of rehabilitation, mental health, neuropsychiatry and social services teams to support the needs of adults with traumatic brain injury, acquired brain injury and those with long term neurological conditions.&lt;/p&gt;\n&lt;p&gt;The post is based at Gravesend Community Hospital and is easily accessible for train routes to/from London and the north Kent coast. A key aspect of this role will be to provide specialist neuropsychological assessment and cognitive rehabilitation. The service has a strong rehabilitation ethos and members of the service have interests in a range of different therapeutic approaches including Acceptance and Commitment Therapy, mindfulness, CBT and systemic approaches.&lt;/p&gt;\n&lt;p&gt;Many of our department are actively involved in teaching and research. There are ample opportunities to teach on our rolling programme of stroke workshops for allied health professionals and on the Salomons Clinical Psychology doctorate. We also have links with Kent University. Members of our service receive regular clinical, management and peer supervision and there is a commitment to ongoing training and professional development. There are opportunities to work in other parts of the Kent Clinical Neuropsychology Service, should you wish to extend your experience.&lt;/p&gt;\n&lt;p&gt;The current post would be suitable for someone at the early stages of their neuropsychology career .&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLorna MorrisJob titleConsultant Clinical NeuropsychologistEmail addresslorna.morris6@nhs.netTelephone number01732 228226Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact for more information or to arrange an informal visit&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gravesend Community Hospital, Gravesend", "postalCode": "DA11 0DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4432", "longitude": ".365561"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227864", "validThrough": "2020-11-09T23:59:59+0000"}