{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36689", "minValue": "32703", "unitText": "YEAR", "value": "£32,703.19 - £36,689.49"}}, "datePosted": "2020-10-22T11:10:50+0100", "description": "&lt;p&gt;Do you want to make a difference? Do you want to work in an environment where you can use your skills, knowledge, and creativity to achieve the best for people?&lt;/p&gt;\n&lt;p&gt;Working in this thriving University City in the South of England, you would be based in our new and accessible CQC registered hub in the centre of the city; designed using a Psychologically Informed Environment approach to enhance the experience of staff and those who use our service.&lt;/p&gt;\n&lt;p&gt;Our team is made up of many skilled staff &lt;strong&gt;working together&lt;/strong&gt; – including our Operational Managers, a Consultant Psychiatrist, Nurses, Recovery Coordinators, NMPs, Peer Mentors, Health Care Assistants and local GPs and Pharmacists. Our collective aim is to &lt;strong&gt;make a difference&lt;/strong&gt; to the lives of service users and their families across the city.&lt;/p&gt;\n&lt;p&gt;Please see the job description and role specifics sheet for more detailed information about the roles and responsibilities of this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Change Grow Live offers opportunities for growth and development all our staff are encouraged to take a wellbeing hour every week plus our nurses benefit from half a day a month CPD, active support with revalidation and their NMC fees paid.&lt;/p&gt;\n&lt;h2&gt;Responsibilities&lt;/h2&gt;\n&lt;p&gt;We are looking for someone who can actively contribute to the service, ensuring that we deliver consistently excellent clinical services in the city. As the lead nurse in the team, you will provide advice and support on mental and physical health concerns and interventions. You will facilitate empowerment of teams and individuals to increase knowledge, skills, and professional confidence. With coaching and collaboration, you will nurture and grow a confident and competent clinical team. You will play a key part in developing and delivering the healthcare offer whilst working flexibly with the team to establish what else is needed to have the most positive impact for people who use our service, their families and the wider community.&lt;/p&gt;\n&lt;p&gt;At Change Grow Live services no two days are the same and we treat every person who comes into our service as an individual being curious, a good listener and having an intuitive approach are essential. Plus an availability that may include working occasional evenings.&lt;/p&gt;\n&lt;p&gt;Does this sound like you? If so, please read the job description and we look forward to reading your application soon. If you have any questions, please do not hesitate to contact Claire James (Associate Director of Nursing) on claire.james@cgl.org.uk or Mary Chiyanike (Regional Lead Nurse) on mary.chiyanike@cgl.org.uk&lt;/p&gt;\n&lt;p&gt;This post is subject to a Disclosure and Barring Service (DBS) check at an enhanced level.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132514.png", "name": "change, grow, live (CGL)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO15 2AH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9119", "longitude": "-1.40357"}}, "title": "Lead Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238074", "validThrough": "2020-11-19T23:59:59+0000"}