{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23000", "minValue": "21000", "unitText": "YEAR", "value": "£21,000 - £23,000 per annum"}}, "datePosted": "2020-11-03T14:01:29+0000", "description": "&lt;p&gt;Royal Free London Pharmacy is a wholly owned subsidiary of Royal Free London NHS Foundation Trust and works in partnership with the trust to provide World Class standards of pharmaceutical care to all of our patients. The Pharmacy Department is a busy but friendly, progressive and expanding unit, which is dedicated to supporting and promoting good clinical outcomes, enhance the patient experience and enable staff to deliver world class care.&lt;/p&gt;\n&lt;p&gt;The Royal Free London NHS Foundation Trust is one of the biggest NHS Trusts in the UK, delivering care to more than 1.6 million people a year through our three main hospitals: Barnet, Chase Farm and Royal Free.&lt;/p&gt;\n&lt;p&gt;The Trusts mission is to deliver world class care and expertise in our clinical services, underpinned by world class teaching and research and we will continue to measure our progress against our five governing objectives: excellent outcomes, excellent patient and staff experience, excellent value for taxpayers’ money, being safe and meeting our external duties, and building a strong organisation.&lt;/p&gt;\n&lt;p&gt;We are looking for dynamic, enthusiastic and forward thinking candidate to join the Royal Free London Pharmacy family. Experience in pharmacy is not essential but desired. You will need to be organised and well-motivated and have excellent communication and people skills, as well as the ability to adapt quickly to new situations. If you are looking for a challenging role in which to develop your skills and knowledge then this post will provide an excellent opportunity for you, while providing you with the all of the support and training that you need.&lt;/p&gt;\n&lt;p&gt;If you would like to be a part of a successful, friendly, high-profile service, where your top priority is to provide World Class patient care, then this may be the job for you.&lt;/p&gt;\n&lt;p&gt;Applications are welcome from all sectors of pharmacy practice, including community, primary care, industry and academia however hospital experience is desirable. The successful candidate will be enrolled onto a fully funded GPhC approved NVQ2 pharmacy programme.&lt;/p&gt;\n&lt;p&gt;This is a full time post and is &lt;strong&gt;not &lt;/strong&gt;subject to NHS AFC terms and conditions. Informal enquiries about the post are very welcome&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Nicola Forman&lt;/p&gt;\n&lt;p&gt;Job title: Chief Pharmacy Technician&lt;/p&gt;\n&lt;p&gt;Email address: nicola.forman@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135894.JPG", "name": "Royal Free London Pharmacy", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free Hospital, Hampstead", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Band 2 Dispensary Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254245", "validThrough": "2020-11-17T23:59:59+0000"}