{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata, per annum"}}, "datePosted": "2020-11-04T09:15:43+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for dynamic, innovative and highly motivated Renal OPD Receptionist at the Liz Baker Unit in Morriston Hospital.&lt;/p&gt;\n&lt;p&gt;The successful post holder will carry out the duties delegated within the out-patient reception/medical records office. This includes the organisation and management of out-patient clinics for patients attending the unit from a large geographical area.&lt;/p&gt;\n&lt;p&gt;The post holder will also have to receive and manage telephone calls from patients and/or their carers regarding appointments. To direct clinical calls to the appropriate clinician or secretary. To use own initiative to resolve straightforward problems. Prepare notes for patients, ensuring all relevant documentation is included in the correct format. This may include retrieving notes from other departments within the hospital. Prepare and post mail on a daily basis. To maintain an efficient and confidential filing system.&lt;/p&gt;\n&lt;p&gt;Responsible for appropriately greeting patients at the reception desk and directing them to the appropriate waiting area. Track medical records of patients. To make timely appointments when requested by the clinical team and in agreement with the patients whenever possible. Prepare notes for transplant patients. To work with ambulance transport colleagues to ensure booking and timely pick up of patients and to monitor clinic efficiency levels and notify supervisor and / or consultant of overbooking/ appointment gaps.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLinda HesfordJob titleRenal OPD SupervisorEmail addresslinda.hesford@wales.nhs.ukTelephone number01792 532174Additional contact information&lt;/p&gt;\n&lt;p&gt;Linda Hesford&lt;/p&gt;\n&lt;p&gt;Liz Baker Unit&lt;/p&gt;\n&lt;p&gt;linda.hesford@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liz Baker Renal Unit, Morriston Hopsital, Swansea", "postalCode": "SA66NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6847", "longitude": "-3.93527"}}, "title": "Renal OPD Receptionist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255163", "validThrough": "2020-11-11T23:59:59+0000"}