{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum (pro rata)"}}, "datePosted": "2020-10-29T17:01:35+0000", "description": "&lt;p&gt;&lt;strong&gt; &lt;span&gt;Lead Health Facilitation Nurse &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a creative and innovative person to join the health facilitation team. You will be working to improve access to mainstream, primary and acute services. You will promote health enhancing activities to improve the health outcomes for people with learning disabilities&lt;/p&gt;\n&lt;p&gt;You will work within the framework of a multi-disciplinary team to provide specialist guidance to actively promote and offer clinical leadership in the implementation of health facilitation.&lt;/p&gt;\n&lt;p&gt;You will work in partnership with Birmingham community health care clinicians and Primary Health, Mental Health and Acute services to provide an evidence-based approach to the effective delivery of Health facilitation, which aims to inform, educate and support all stakeholders according to their individual needs.&lt;/p&gt;\n&lt;p&gt;You will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Explore, develop and recommend ways of identifying and improving interventions to meet the health needs of individuals with Learning Disabilities.&lt;/li&gt;\n&lt;li&gt;Lead innovation in developing effective models of care delivery, for example nurse led clinics.&lt;/li&gt;\n&lt;li&gt;Clinically lead the processes of effective delivery and timely implementation of service wide Health Facilitation for people with Learning Disabilities.&lt;/li&gt;\n&lt;li&gt;Develop and maintain effective links with Primary Health Care Partners to support interventions to reduce health inequalities and supporting the implementation of health screening and Health Action Plans.&lt;/li&gt;\n&lt;li&gt;Develop and deliver training and input to Birmingham GP Practices, hospitals and coordinate the self assessment framework for LD in support of joint commissioning.&lt;/li&gt;\n&lt;li&gt;Provide teaching, clinical presentation and representation at meetings to stakeholders and as a link to the wider health economy and local MDT.&lt;/li&gt;\n&lt;li&gt;Maintain effective links with the public Health Department.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will work within the framework of level one and level two Health Facilitation.&lt;/p&gt;\n&lt;p&gt;This list is not exhaustive.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Informal contact:&lt;/p&gt;\n&lt;p&gt;Maureen Hobbis&lt;/p&gt;\n&lt;p&gt;Maureen.hobbis@bhamcommunity.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Greenfields, Birmingham", "postalCode": "B30 3QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4124", "longitude": "-1.90439"}}, "title": "Band 7 Health Facilitation Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249192", "validThrough": "2020-11-12T23:59:59+0000"}