{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-11-03T14:47:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialist Women’s Health Counsellor - Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Royal Devon and Exeter NHS foundation Trust is seeking to appoint a self-motivated, senior, specialist counsellor. This is a challenging and rewarding post within a well-established Counselling service. As a counsellor for the departments of Maternity, Gynaecology and Neonatology you will provide counselling for women referred for a wide range of reproductive health issues and support families with babies in the Neonatal Unit.&lt;/p&gt;\n&lt;p&gt;The successful applicant would be 2 years post-qualification at Diploma level.&lt;/p&gt;\n&lt;p&gt;They would be expected to have gained additional specialist training in EMDR or Trauma focussed CBT, and show evidence of bereavement training.&lt;/p&gt;\n&lt;p&gt;They would be expected to have experience of working alongside women with health issues.&lt;/p&gt;\n&lt;p&gt;They would need to be able to work autonomously, whilst also working collaboratively within the boundaries of a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;This post is currently a part time post of 15 hours for 6 months, following this, due to retirement, there is potential for the post to become substantive and the hours increased to 30 hours.&lt;/p&gt;\n&lt;p&gt;(This is a fixed term contract for 6 months.  For current NHS Employees this post could be a secondment opportunity)&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;/p&gt;\n&lt;p&gt;Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Womens Health Counsellor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254423", "validThrough": "2020-11-17T23:59:59+0000"}