{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inclusive"}}, "datePosted": "2020-10-30T16:17:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Charge Nurse– Emergency Department&lt;br /&gt;Band 7&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;University College London Hospitals NHS Foundation Trust (UCLH) where outstanding care and clinical excellence come together every day.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced nurse to join our team in a busy central London teaching hospital as a Band 7 Charge Nurse in the Emergency Department. This is an exciting opportunity for an enthusiastic and experienced Emergency Nurse to join one of the largest and most successful Foundation Trusts in the UK with an international reputation and a tradition of innovation. We have almost completed our £21.7 million re-development of our Emergency department where we have increased our Majors and Rapid Assessment Treatment (RAT) bays in order to improve services for our growing number of patients as the Department provides ready access to emergency nursing for over 142,000 patients a year.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;So why join our team?&lt;br /&gt;&lt;br /&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We have a &lt;strong&gt;new Development Programme&lt;/strong&gt; that is fully funded to support and nurture your Band 7 career. This includes academic courses and study days to enhance your leadership role and guide your development as an experienced Emergency Nurse.&lt;/p&gt;\n&lt;p&gt;We will provide&lt;strong&gt; the funding and study leave &lt;/strong&gt;to help you grow and develop your Emergency career. Please see the attached development plan for more information.&lt;/p&gt;\n&lt;p&gt;We have a very &lt;strong&gt;friendly and supportive team&lt;/strong&gt; which is led by two Senior Nurses and a Matron. You will be working alongside a Consultant Nurse and a team of accredited advanced clinical practitioners (ACPs) as well Emergency Nurse Practitioners (ENPs) as part of the team.&lt;/p&gt;\n&lt;p&gt;We have a reputation as a centre of clinical excellence and our hospitals are in great central London locations and we have a wide range of career opportunities that we can offer within the Trust.&lt;/p&gt;\n&lt;p&gt;In return, we are looking for a Charge Nurse that can offer us:-&lt;br /&gt;- Significant Emergency Nursing experience to be able to share new skills and knowledge to our excellent team of emergency nurses &lt;br /&gt;- A passion for delivering excellent leadership and patient care &lt;br /&gt;- A willingness to learn new skills, take charge of the emergency department on a shift by shift basis and lead by example&lt;br /&gt;- The ability to communicate effectively and maintain professionalism at all times&lt;/p&gt;\n&lt;p&gt;-Manage a team of nurses including developing potential and managing performance&lt;/p&gt;\n&lt;p&gt;Please read the person specification regarding the qualifications required for this post.&lt;/p&gt;\n&lt;p&gt;Based in the busy West End of London, we have a lively and vibrant working atmosphere, with quick and easy transport links to all our sites. We have an extensive portfolio of in-house training and aim to provide personal development through to clinical excellence and leadership skills. UCLH prides itself on its investment in staff both in terms of developing career skills but also its commitment to staff health and wellbeing. &lt;br /&gt;&lt;br /&gt;If you are looking to further your career in a hospital that has cutting edge technology, please apply online.&lt;/p&gt;\n&lt;p&gt;All posts are subject to Internal Rotation to night duty and pro rata weekends/BH.&lt;/p&gt;\n&lt;p&gt;This vacancy may close before the current listed closing date. Therefore, if you intend to apply for this post, you are advised not to delay submitting your completed application. &lt;br /&gt;&lt;br /&gt;We offer our permanent staff an interest free ticket loan, a subsidised social club including gym and swimming facilities, a library for staff to use, free independent and confidential support for all staff and large retail discounts.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details and to arrange an informal visit then please contact: Rebecca Jarman on 07813 994 006 &lt;/strong&gt;&lt;strong&gt;rebecca.jarman@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH, London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Emergency Department Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250921", "validThrough": "2020-11-13T23:59:59+0000"}