{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42969", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 to £42,969 per annum plus LW"}}, "datePosted": "2020-11-02T11:32:00+0000", "description": "&lt;p&gt;IMPERIAL COLLEGE HEALTHCARE NHS TRUST&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;MAJOR TRAUMA CENTRE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ST MARY’S HOSPITAL&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;MAJOR TRAUMA TRUST DOCTOR ST1-2 LEVEL&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;6 MONTH/ 1 YEAR POSTS 2nd FEBRUARY – 3rd AUGUST 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting post for doctors finishing Foundation training, or to ST1-2 level physicians who wish to gain experience in the care of severely injured patients and would be suitable for aspiring surgeons, anaesthetists or intensive care trainees.&lt;/p&gt;\n&lt;p&gt;The Major Trauma Centre at St Mary&#39;s Hospital covers north-west London and is one London&#39;s four major trauma centres. Currently the busiest of London’s MTCs, the centre was actively involved in past major incidents, including the Westminster Bridge, London Bridge and Grenfell fire events. The post holder will work alongside a dedicated team of junior doctors for Major Trauma, under the supervision of the Major Trauma Consultants, to care for those patients with significant trauma. Currently there are 50-60 trauma calls each week, with around 60% requiring admission.&lt;/p&gt;\n&lt;p&gt;The post holder’s duties will include the initial assessment in ED, as part of the trauma team, and the ongoing management for those patients admitted to the Major Trauma Ward and the Intensive Care unit. There is currently responsibility for looking after acute non-traumatic Neurosurgery patients as well as covering Plastic Surgery patients out of hours. There are 5 added SHO’s from those specialities to help strengthen the current rota.&lt;/p&gt;\n&lt;p&gt;There is wide exposure to a variety of conditions as a result of Major Trauma, as well as plenty of opportunity to learn new practical skills, including chest drainage, central lines, arterial lines and exposure to operative procedures. The multidisciplinary team on the Major Trauma Ward takes pride in delivering expert care for seriously injured patients.&lt;/p&gt;\n&lt;p&gt;A wide variety of learning opportunities are available with weekly trauma teaching, weekly case MDT presentation and review, training in trauma procedures and skills and a well-developed research program. There will be opportunities to undertake research and audit within the Major Trauma service. The post holder will also gain experience in Intensive Care, with regular sessions within the Critical Care Unit, comprising level 2 &amp; 3 care.&lt;/p&gt;\n&lt;p&gt;The posts will initially be for 6 months, but may be extendable to a year pending appropriate progress.&lt;/p&gt;\n&lt;p&gt;For an informal discussion and further information please contact:&lt;/p&gt;\n&lt;p&gt;Mr. Christopher Aylwin, Head of Specialty (Christopher.Aylwin@nhs.net).&lt;/p&gt;\n&lt;p&gt;Applicants are required to have full GMC registration with a license to practice. For further requirements for the post, please read the Person Specification.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;(Late applications will not be accepted&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that the vacancies advertised may be subject to change prior to interview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr. Christopher Aylwin, Head of Specialty (Christopher.Aylwin@nhs.net).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, London", "postalCode": "W12 0HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5165", "longitude": "-.236635"}}, "title": "Junior Clinical Fellow in Major Trauma", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251803", "validThrough": "2020-11-16T23:59:59+0000"}