{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18185", "unitText": "YEAR", "value": "£18,185 - £19,337 per annum pro rata"}}, "datePosted": "2020-11-04T14:16:03+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to work within Administrative Services for the Mental Health and Learning Disabilities Directorate.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Applications are invited from enthusiastic, innovative, motivated and suitably qualified individuals for the post of a Part Time, 22.5 hrs per week, Band 2 Clerical Officer within the IPTS, (Integrated Psychological Therapies Service) based in Gorwelion Resource Centre, Llanbadarn Road, Aberystwyth, SY23 1HB.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;An understanding of confidentiality is essential. Experience of working within the NHS and Mental Health Services as well as knowledge of Health Systems is desirable, but an enthusiastic attitude and willingness to learn is also very important. The applicants must possess RSA II or equivalent demonstrable experience of administrative / office skills and knowledge, plus additional experience of working in a busy administrative / office environment. Minute taking and Audio typing would be advantageous as would experience of Data Entry using Excel Spreadsheets.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful individual will need to be a hard working, team player with good verbal and written communication skills. The ideal candidate would have office administration experience, with a good knowledge of Microsoft Office packages and databases. The post holder will also be required support reception duties during staff absences.&lt;/p&gt;\n&lt;p&gt;The applicant will be required to have a flexible approach towards the needs of the service and be able to travel between sites in a timely manner.&lt;/p&gt;\n&lt;p&gt;The ability to prioritise work to meet deadlines and the ability to work without supervision is essential for this post.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and / or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Michelle Morris – Admin Manager&lt;br /&gt;Michelle.morris@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Sarah Shute – Interim Clinical Service Manager, Integrated Psychological Therapies Service&lt;br /&gt;Sarah.shute@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gorwelion Resource Centre, Aberystwyth", "postalCode": "SY23 1HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4118", "longitude": "-4.07087"}}, "title": "Receptionist/Clerical Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256187", "validThrough": "2020-11-11T23:59:59+0000"}