{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T12:17:06+0000", "description": "&lt;p&gt;The Newcastle upon Tyne Hospitals NHS Foundation Trust is one of the most successful teaching NHS Trusts in the country. We have one of the highest number of specialist services of hospitals in the UK. With around 15,000 staff, the Newcastle Hospitals is one of the region’s major employers. We have a long-standing reputation for high quality clinical care with our staff’s commitment to excellence reflected in our consistent performance at the highest level. We are committed to being an “employer of choice” offering our staff superb benefits, looking after their wellbeing, and providing access to high-quality education, training, career progression and support which enables them to provide “Healthcare at its best with people at our heart”.&lt;/p&gt;\n&lt;p&gt;The Care Quality Commission has rated us ‘Outstanding’ for the second time in a row.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arose for a Senior Theatre Practioner in Orthopaedic Trauma and Spinal surgery.&lt;/p&gt;\n&lt;p&gt;This unit is based a the Royal Victoria Infirmary within the New Victoria Wing Adult Theatre Suite. This speciality is staffed 24/7 and is equipped to provide specialised and expert care for both Adults and Children requiring Orthopaedic and Spinal Surgery .&lt;/p&gt;\n&lt;p&gt;Applicants should possess strong leadership , interpersonal and communication skills and have the confidence and ability to lead a team of staff on a daily basis in and out of hours.&lt;/p&gt;\n&lt;p&gt;A sound knowledge of Orthopaedic&#39;s is essential for this role but specialised training will also be provided in house as required.&lt;/p&gt;\n&lt;p&gt;You will join a dedicated, hardworking team of professionals who are totally focused on delivering patient centred care. If you are ready for a challenge and progress in your career, this is an excellent opportunity for you !&lt;/p&gt;\n&lt;p&gt;Full Time 37 hours 30 minutes/week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 02 Royal Victoria Infirmary", "postalCode": "NE1 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9786", "longitude": "-1.61846"}}, "title": "Sister/Charge Nurse/ODP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250143", "validThrough": "2020-11-08T23:59:59+0000"}