{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-23T16:16:18+0100", "description": "&lt;p&gt;&lt;strong&gt;Crisis Care Practitioner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of our current local transformation work Nottinghamshire Healthcare Trust have received investment to develop Improved Crisis Home Resolution services in Greater Nottingham, Mansfield and Bassetlaw area. We provide intensive home support to service users aged 18 and over, through a range of referral routes, which include self-referral and work with our community teams and partner organisations to provide a range of support options for people experiencing mental health crisis.&lt;/p&gt;\n&lt;p&gt;The service ‘gate keeps’ all admissions to acute mental health wards, and our crisis house and aims to provide care in the least restrictive manner by offering an alternative to hospital admission through intensive home treatment. Where required, the team support planned admission to wards and facilitates timely discharge from inpatient care, working closely with wards to identify patients who could be better supported in their communities. The service is also responsible or the management of beds, capacity and flow which at times is a requirement for this post.&lt;/p&gt;\n&lt;p&gt;We are seeking experienced practitioners to join our team of Consultant Psychiatrists, Junior Doctors, Non-Medical Prescribers, Nurses, Social Workers and Support Workers providing rapid response for adults who are experiencing an acute psychiatric crisis.&lt;/p&gt;\n&lt;p&gt;Suitable applicants will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;be a qualified RMN/RNLD, Occupational Therapist or Social Worker, holding current registration;&lt;/li&gt;\n&lt;li&gt;have experience of working with people with mental health problems in an Acute health care/ community setting;&lt;/li&gt;\n&lt;li&gt;be required to assess, the needs of individuals when they are acutely unwell, develop and continually review treatment plans that enable the individual to manage their period of crisis effectively;&lt;/li&gt;\n&lt;li&gt;have the ability to work as part of a multidisciplinary team, be reliable and motivated;&lt;/li&gt;\n&lt;li&gt;be able to demonstrate high functioning in risk management;&lt;/li&gt;\n&lt;li&gt;Act as gatekeeper to all psychiatric admissions to adult mental health acute wards when role is allocated to them&lt;/li&gt;\n&lt;li&gt;Act as CRHT duty worker managing and delegating team work load and responsibilities when allocated this role including triage of new referrals to the team and signposting&lt;/li&gt;\n&lt;li&gt;compassionate, person-centred individual who is hard working and can be flexible in their approach to helping service users experiencing a mental health crisis;&lt;/li&gt;\n&lt;li&gt;have excellent verbal and written communication skills;&lt;/li&gt;\n&lt;li&gt;Be committed to delivery of mental health care in the least restrictive environment&lt;/li&gt;\n&lt;li&gt;be able to problem solve and an able negotiator;&lt;/li&gt;\n&lt;li&gt;be able to work 24/7 365 days a year rota with the other staff in the team;&lt;/li&gt;\n&lt;li&gt;hold full UK driving licence with access to a vehicle for business use. Reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applications from those who have worked with older adults are welcomed.&lt;/p&gt;\n&lt;p&gt;Appointed applicants will have access to clinical and managerial supervision, career development opportunities, enhancement for any unsocial hours of working and access to relocation expenses for those meeting the criteria for reimbursement of such expenses.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details about the role, or an informal visit, please contact&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Matt Callaghan; Team Leader, City CRHT, Tel: 0115 956 0805&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Claire Wade; team leader, County south CRHT, Tel: 0115 9560800&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Jonathon Guy; Team Leader, Mid Notts CRHT, Tel: 0115 9560860&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nicola Aisthorpe; Team Leader, Bassetlaw CRHT, Tel: 03001231804 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah TaylorJob titleService ManagerEmail addresssarah.taylor4@nottshc.nhs.ukTelephone number01159560800&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Highbury Hospital, Nottingham", "postalCode": "NG6 9DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9927", "longitude": "-1.19201"}}, "title": "Crisis Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241261", "validThrough": "2020-11-15T23:59:59+0000"}