{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Depending on the strength of the candidate"}}, "datePosted": "2020-10-09T09:43:40+0100", "description": "&lt;h2&gt;&lt;strong&gt;Nurse &lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Operating in a community setting within our acclaimed &lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;York Integrated Care Team&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you a registered Nurse looking to work in a team who are receiving national recognition for the important, innovative and exciting work it is doing?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you recently registered nurse and looking for a fantastic career?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you looking for an opportunity to work in an exciting team which is making a real difference to patients?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Would you thrive working in a multidisciplinary team, involving General Practitioners, Registered Nurses, Holistic Care Workers, Carers and Social Workers as well as Physiotherapists, Mental Health Professionals and other agencies?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you looking to within a supportive environment with passionate and very capable colleagues?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If the answer is yes…we have an exciting opportunity for you to join Priory Medical Group.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Culture…Our People&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Priory Medical Group, we are a forward thinking, innovative and driven organization and we recognise the quality of our work is through the quality of our people.&lt;/p&gt;\n&lt;p&gt;The York Integrated Care Team was established to bring together primary and secondary care, social care and the voluntary sector to form a genuinely multidisciplinary team of different professions. The team reviews all hospital admissions and discharges everyday, contacting people who need support and accessing support from a range of agencies. These services can ensure people stay in their own homes or return home as soon as its appropriate&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What are the main duties of the role?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role will make a real difference in enhancing the quality of patient management, maximise patient satisfaction and reduce avoidable admissions whilst facilitating discharge from hospital.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for the assessment, planning and implementation of care to Practice Patients. The role includes defining, monitoring and evaluating actions taken to meet the client’s health and psychosocial needs.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Co-ordinate and provide care that is safe, timely, effective, efficient, equitable and client-centred&lt;/li&gt;\n&lt;li&gt;Manage and review caseload, review case progress and determine case closure&lt;/li&gt;\n&lt;li&gt;Facilitate support as needed (case coordination, information sharing etc.)&lt;/li&gt;\n&lt;li&gt;Help patients make informed decisions by acting as their advocate regarding their clinical status and treatment options&lt;/li&gt;\n&lt;li&gt;Develop effective working relations and cooperate with health teams and liaise with social services, health and voluntary agencies&lt;/li&gt;\n&lt;li&gt;Record care plans accurately and produce audit information for the service&lt;/li&gt;\n&lt;li&gt;Promote quality and cost-effective interventions and outcomes&lt;/li&gt;\n&lt;li&gt;Maintain accurate and appropriate patient records on our clinical system&lt;/li&gt;\n&lt;li&gt;Other duties as deemed appropriate for the role.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At Priory Medical Group, all our employees should enjoy coming to work and enjoy feeling a part of the team! We will ensure you are provided with a clinical supervisor and a supportive network around you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we look for in your application&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Registered with the Nurse and Midwifery Council (NMC)&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ability to communicate effectively with patients from all walks of life&lt;/li&gt;\n&lt;li&gt;Ability to build positive rapport with a diverse range of internal colleagues and clients&lt;/li&gt;\n&lt;li&gt;Use of own vehicle and driving license to fulfil the requirements of this community based role&lt;/li&gt;\n&lt;li&gt;Ability to work autonomously whilst also having an awareness of the scope of your role when identifying the need to access the wider clinical team appropriately and safely&lt;/li&gt;\n&lt;li&gt;Ability to function well and work flexibly within a wider clinical team&lt;/li&gt;\n&lt;li&gt;Experience in case management is desirable&lt;/li&gt;\n&lt;li&gt;First class organisational and time management skills in a fast-paced environment are essential.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;So are you in or are you out?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working Hours: Full Time - 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Rate of Pay: Competitive (depending on the strength of the candidate)&lt;/p&gt;\n&lt;p&gt;Location: The role operates in a number of health care settings (home visits, in the community/nursing homes etc.)&lt;/p&gt;\n&lt;p&gt;The Integrated Care Team are based at Tang Hall Lane Surgery 190 Tang Hall Lane, York, YO10 3RL&lt;/p&gt;\n&lt;p&gt;The Practice recognises that discrimination of any kind is both unlawful and would act as a barrier to finding the most talented individuals for our organisation. As such, our recruitment and selection procedures exist to ensure no job applicant, employee or worker is discriminated against either directly or indirectly on the grounds of age, disability, gender reassignment, marriage and civil partnership, pregnancy or maternity, race, religion or belief, sex or sexual orientation.&lt;/p&gt;\n&lt;p&gt;A great deal of careful consideration has been invested in preparing the advert for this post based on the specification for this role and the person we are looking for. &lt;strong&gt;Our selection for the interview process is designed to ensure individuals are selected for interview on the merit of their application only&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;If you are applying through NHS Jobs, you will notice you are asked if you would like a guaranteed interview as part of the ‘Two Tick’ disability scheme. Whilst this is an admirable government initiative, please be aware we are not signed up to this scheme. This is a question on the NHS jobs application form which is outside of our own control. Our own process ensures we consider candidates on the merit of their application only and we do not ask any questions regarding disability as part of our selection process. We only give candidates the opportunity to share information regarding any disability after candidates are invited to interview and only if the candidate feels they require adjustments in the interview process.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Medical Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO10 3RL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9571", "longitude": "-1.04877"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219583", "validThrough": "2020-12-08T23:59:59+0000"}