{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5 dependent on experience"}}, "datePosted": "2020-10-15T16:06:04+0100", "description": "&lt;p&gt;&lt;strong&gt;Physiotherapist | Physiotherapy | Band 5 dependent on experience | Leicester | Full Time, No Nights.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Leicester Hospital has an exciting opportunity for an experienced Physiotherapist to join our busy and fast paced Outpatients team.&lt;/p&gt;\n&lt;p&gt;Founded in 1989, Spire Leicester is a high performing hospital with a great track record in superior patient care. We practice some of the most advanced treatments on the latest generation imaging, and diagnostic technology, meaning we can offer everything from screening, rehabilitation and cutting-edge surgical procedures in specialist fields like orthopaedics and cancer care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be joining this high performing team of experienced Physios who constantly receive excellent patient satisfaction feedback, you will also work very closely with our consultants. The role MSK focused predominately based in Outpatients but you will support Inpatients on a regular basis. The shifts are 8:30am to 16:30pm, with one late per week which is 12pm to 8pm.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be HCPC registered - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Have a minimum of 2 years physio experience, ideally with some MSK experience.&lt;/li&gt;\n&lt;li&gt;Compassionate and able to showcase excellent patient care&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Andy Owen on Andrew.owen@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE2 2FF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6147", "longitude": "-1.08343"}}, "title": "Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228929", "validThrough": "2020-11-15T23:59:59+0000"}