{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "66823", "minValue": "57990", "unitText": "YEAR", "value": "£57,990 - £66,823"}}, "datePosted": "2020-10-27T16:30:58+0000", "description": "&lt;p&gt;An opportunity has arisen for an exceptional nursing leader to join our senior leadership team in the division of Emergency Medicine. You will be focused on Emergency Medicine and committed to maintaining strong professional oversight and governance which is pivotal to the quality and safety of our services to support good clinical outcomes for the patients and staff with visible leadership presence, this will involve cross cover across the division as required.&lt;/p&gt;\n&lt;p&gt;We are seeking an exceptional and inspirational Head of Nursing to lead our service which provides high quality, evidence based care within Emergency Medicine looking after both our Emergency Departments, Same Day Emergency Care and Medical Assessment Units.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work closely with the Associate Director of Nursing for Emergency Medicine care, to drive high standards of care and patient safety, leading on the provision of nursing excellence, care delivery and improving the patient experience, clinical outcomes, effectiveness and efficiency. Your leadership skills will empower teams to achieve above and beyond expectations and you will support and foster a culture of respect and compassion in a safe and supportive environment.&lt;/p&gt;\n&lt;p&gt;You will be a strong collaborator, able to work across organisational boundaries with a passion for quality improvement and skillful in staff engagement.&lt;/p&gt;\n&lt;p&gt;Applicants should be able to demonstrate success in delivering effective, safe and cost efficient services in a complex healthcare environment, including staff management, financial, risk and change management.&lt;/p&gt;\n&lt;p&gt;We welcome and encourage informal discussions about the post.&lt;/p&gt;\n&lt;p&gt;On call is required&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anne Powell   Associate Director of Nursing&lt;/p&gt;\n&lt;p&gt;annelouise.powell@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom and St Heleir, Sutton", "postalCode": "KT18 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.325", "longitude": "-.273383"}}, "title": "Head of Nursing Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245430", "validThrough": "2020-11-09T23:59:59+0000"}