{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-30T14:00:46+0000", "description": "&lt;p&gt;Applications are invited from suitably qualified and accredited (BABCP/ACAT/HCPC) practitioners with the experience, skills and competencies to undertake the duties and responsibilities of the above post in adult mental health work. The post is permanent, providing assessment, psychological therapy and consultation for the care of Service Users within two (co-located) CMHTs. The post holder will work alongside clinical psychologists and psychological therapists, and will work flexibly with the senior colleague to match skills and competencies to the needs of the teams.&lt;/p&gt;\n&lt;p&gt;The teams provide services to people with complex mental health needs. Psychological therapies and psychologically informed care are valued within the teams and network, and are fully integrated within mainstream adult mental health services. The post holder will operationally managed within the teams as a core team member, while strong professional leadership works alongside operational management to support the role.&lt;/p&gt;\n&lt;p&gt;An interest in working with individuals experiencing significant levels of complexity and personality difficulties will be essential. Good team working skills are also essential, as are abilities in providing consultation / supervision to team colleagues.&lt;/p&gt;\n&lt;p&gt;The post holder will work alongside a consultant clinical psychologist and senior psychological therapists within the teams, and will develop links with psychological therapists within other CMHTs and Specialist networks. Good clinical and professional supervision is provided, and a growing network of complex case for a and psychological therapy models afford excellent opportunity for the post holder to develop their skills in multidisciplinary team working and psychologically informed care.&lt;/p&gt;\n&lt;p&gt;To find out more about the post please contact: Ed Johnston, Service Manager BwD CMHTs on 01254 226150 or ed.johnston@lscft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CMHT Blackburn (25-65), Blackburn", "postalCode": "BB1 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7518", "longitude": "-2.4674"}}, "title": "Clinical Psychologist/CBT Therapist/Cognitive Analytical Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250455", "validThrough": "2020-11-13T23:59:59+0000"}