{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum, inc HCA"}}, "datePosted": "2020-11-05T10:16:50+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Would you like to gain more experience in research?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We currently have an opportunity for an enthusiastic and dynamic nurse to join us in Gerontology research. The post will be based at the PRUH site. Gerontology research recruits for and conducts research in a range of areas related to ageing including exercise, dementia, falls and frailty. This post will also support recruitment to urgent public health studies relating to COVID and provide expertise to ensure older people’s participation in these studies. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role will involve working with patients and volunteers, clinical staff and the research team and will include; identifying, engaging and recruiting participants, collecting data, carrying out clinical assessments and ensuring research follows good clinical practice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post offers the opportunity to gain experience in approaching and recruiting patients to studies and in following research protocols for assessment and clinical care. This post will offer the prospect of further developing communication, organisational, time management, documentation and clinical skills. Training will be provided in research processes, procedures and governance.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Julie Whitney&lt;/p&gt;\n&lt;p&gt;Job title Research Lead Gerontology&lt;/p&gt;\n&lt;p&gt;Email address julie.whitney@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 02032993420&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Clinical Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257206", "validThrough": "2020-11-19T23:59:59+0000"}