{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-05T14:01:03+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you looking for a change then why not consider joining our small friendly team on the Intensive Care Unit at Weston General Hospital?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Intensive Care Unit has 5 level 3 beds, providing high quality care, ventilation, hemofiltration and inotropic therapies for patients with a wide variety of medical, surgical conditions during their&lt;br /&gt;critical care stay.&lt;/p&gt;\n&lt;p&gt;We are currently seeking enthusiastic and motivated, registered nurses with excellent care values, to join our friendly and talented Critical Care team. Recent Critical Care or other acute nursing experience is essential. There will be future amalgamation of the critical care and outreach team offering new experiences within the team which is an exciting opportunity for members of the team.&lt;/p&gt;\n&lt;p&gt;Excellent written, verbal communication and interpersonal skills, a sense of humor, proactive thinking and passion for delivering high standards of care with empathy and compassion are essential.&lt;/p&gt;\n&lt;p&gt;We offer a welcoming working environment for your commitment to working internal rotation throughout the 24hr period, encompassing Bank Holidays and weekends.&lt;br /&gt;Our investment in your further development will be supported by nationally recognized competency based pathways and our strong relationships with University of the West of England ensures there would be opportunity for the individual to apply for accredited post registration courses.&lt;/p&gt;\n&lt;p&gt;As a department we are committed to appraisal, education and professional development.&lt;br /&gt;Weston General Hospital is a district general hospital and which has a particularly busy Emergency Department.&lt;/p&gt;\n&lt;p&gt;The Hospital serves the population of Weston super Mare and surrounding rural community. With its award winning sandy beach and newly developed promenade, is one of the most rapidly growing towns in the South West. Weston Super Mare is conveniently located near the M5, allowing instant access to the glorious south west region as well as the vibrancy of Bristol to the north. A great location to work!&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you. Please feel free to contact us for further information or why not pop in for an informal visit?&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie ManlowJob titleSenior SisterEmail addressdeborah.manlow@nhs.netTelephone number01934 636363 Ext. 3530&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Weston General Hospital, Weston-super-Mare", "postalCode": "BS23 4TQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3223", "longitude": "-2.97141"}}, "title": "Staff Nurse - Intensive Care Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258012", "validThrough": "2020-11-19T23:59:59+0000"}