{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-14T11:31:28+0100", "description": "&lt;p&gt;We have an exciting opportunity for a highly motivated and enthusiastic Registered Nurse/Physiotherapist/Speech and Language Therapist to join our Tracheostomy Support Service. You will be joining our Tracheostomy Specialist Practitioner in providing a six day a week Tracheostomy Support Service, supporting patients and staff in the Acute and Community Care settings, as well as lecturing at study days, in-service training days and at the Trusts Tracheostomy Mandatory Training sessions.&lt;/p&gt;\n&lt;p&gt;You will represent the service in the absence of the Tracheostomy Specialist Practitioner at local and regional forums and at multi-disciplinary team meetings. You will be required to work independently, managing your own workload and delegate as required. We would therefore welcome applicants with experience of management, working across boundaries and with a strong understanding of multi-disciplinary team working.&lt;/p&gt;\n&lt;p&gt;The post will be based at the Norfolk and Norwich University Hospital. Ideally you will have past experience of working with both Tracheostomy and Laryngectomy patients, with a sound knowledge of types of tracheostomy tubes, tube accessories and laryngectomy accessories. You should have an up to date knowledge of current national guidelines and initiatives.&lt;/p&gt;\n&lt;p&gt;Why Norwich?&lt;/p&gt;\n&lt;p&gt;In Norwich a staggering 77% of people say they love their job. Although less than 2 hours from London and serviced by excellent transport links , Norwich is one of few UK cities that still retain a strong local identity and with that a strong sense of community – people walk down the street and say hello to each other, baristas remember our coffee order, you get to know about interesting local projects.&lt;/p&gt;\n&lt;p&gt;This strong sense of self along with excellent shopping, eating out, affordable house prices and excellent schooling is why Norwich has been ranked by the Guardian as the best city to work in. It’s a really exciting time for us at NNUH; if you’ve got the drive, enthusiasm and skills to make the most of this great opportunity, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;To support the delivery of a high quality, safe and compassionate healthcare service, all staff are expected to act as a role model to others in all aspects of their work and consistently demonstrate NNUH’s ‘PRIDE’ values of People focused, Respect, Dedication, Integrity and Excellence.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The successful applicant will be required to work some Saturdays, other days are variable depending on the service rota.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Part time: 21.5 hours per week&lt;/p&gt;\n&lt;p&gt;Open for applications: 14th October 2020&lt;/p&gt;\n&lt;p&gt;Close for applications: 6th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Erica Everitt, Tracheostomy Specialist Practitioner&lt;/p&gt;\n&lt;p&gt;Tel: 01603 287581&lt;/p&gt;\n&lt;p&gt;Email: erican.everitt@nnuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk &amp; Norwich University Hospital, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Tracheostomy Support Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225982", "validThrough": "2020-11-06T23:59:59+0000"}