{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum excl HCAs"}}, "datePosted": "2020-11-02T18:15:15+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Staff Nurse, Band 5 - UCLH@Home&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join our UCLH@HOME team, a service provided by Whittington Health in partnership with UCLH. We are at the forefront of integrated care – providing innovative and transformational care that best serves local communities.&lt;/p&gt;\n&lt;p&gt;UCLH@Home is an NHS service that helps by supporting patients to leave hospital once medically optimised and safe to be managed in the community. Whilst under this service patients remain under the care of their consultant team.&lt;/p&gt;\n&lt;p&gt;The post holder will work with colleagues from acute specialities, the emergency admissions unit, as well as community services. The role will provide a unique opportunity to be part of a service that is able to provide a truly integrated care pathway for patients across acute and community settings; developing and expanding the services to provide the best care possible for our patients in the best way for them.&lt;/p&gt;\n&lt;p&gt;We welcome applicants from a range of backgrounds including emergency nurses, primary care and acute medicine. It is an exciting time to join our team and be supported to enhance your scope of autonomous practice.&lt;/p&gt;\n&lt;p&gt;If you are seeking a challenge, are passionate about patient care and interested in joining an enthusiastic, dynamic and dedicated team we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE POSITION IS FIXED TERM UNTIL 31 MARCH 2021&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit, please contact Nigel Steventon , Matron(07795496260) or email: nigel.steventon@nhs.net)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College Hospital, London", "postalCode": "NW1 2BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5249", "longitude": "-.136987"}}, "title": "Staff Nurse, Band 5 - UCLH@Home", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253047", "validThrough": "2020-11-16T23:59:59+0000"}