{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum, inc HCA"}}, "datePosted": "2020-10-29T17:01:42+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The liver service at King’s College Hospital is the best in Europe and is at the forefront of many innovative treatments for liver disease. Acting as a supra-regional/international referral centre, we care for all types of patients with liver disease including hepatobiliary surgery, general Hepatology, pre and post transplantation. In addition to our three wards; Howard, Todd and Dawson, the department has its own Intensive Care Unit, research facility, outpatient centre and dedicated theatres.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We currently have vacancies for Staff Nurses on Todd and Howard Wards.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Todd Ward is a 22-bedded liver transplant ward. Due to the complexity of the patients, you would develop an in-depth knowledge in medical and surgical skills as we take patients both pre and post-transplant.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Howard Ward is a brand new 16-bedded ward caring for general Hepatology patients. You would develop skills in dealing with acute medical liver conditions and gain a wealth of knowledge in managing critically ill patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for nurses with an interest in liver disease who would like to join our experienced and friendly team. You will have excellent communication skills, work well as part of our team and be dedicated to provide a high quality patient experience in line with the King’s Values. In return, we will provide you with robust local induction with our dedicated and supportive ward PDNs. You also have access to numerous study days including the bespoke liver staff development programme, and continuous training opportunities with the support of clinical nurse specialists and transplant coordinators.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Michelle Babington&lt;/p&gt;\n&lt;p&gt;Email address michelle.babington@nhs.net&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Stefania Ogkounsoui stefania.ogkounsoui@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Staff Nurse - Liver", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249198", "validThrough": "2020-11-12T23:59:59+0000"}