{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-29T12:16:10+0000", "description": "&lt;p&gt;Welcome to East Sussex, a place that boasts a beautiful coastline, beaches and the South Downs National Park. Close to Brighton and rail links to London. Come and join our friendly, sociable, experienced team working within an integrated Health and Social Care community rehabilitation service based in Eastbourne.&lt;/p&gt;\n&lt;p&gt;The Joint Community Rehabilitation and Falls Prevention Service is a short-term 7 day service which assesses and treats people within their own homes. Our service aims to prevent unnecessary admissions to hospital or long-term care, enable earlier discharges from hospital and promote independence and quality of life. The ability to travel around the county in a timely fashion is essential.&lt;/p&gt;\n&lt;p&gt;You will be part of a friendly, supportive, professional integrated team which includes Physiotherapists, Occupational Therapists, Podiatrists, Falls Practitioners and Rehabilitation Support Workers using an inter-professional model of working. We key work and provide rehabilitation to adults with a variety of medical and surgical conditions. You will be fully supported to develop your inter-professional skills and areas of special clinical interest. We offer regular supervision and training opportunities for professional development. By joint working with physiotherapists, occupational therapists, nurses, rehabilitation support workers and Adult Social Care reablement you as a podiatrist will be contributing to treatment planning, striving towards providing a gold standard of care. With the ambition being that the integrated system will ensure every patient enjoys proactive, joined up working approach with the local authority, adult social care and health services enabling the provision of care that supports patients to live as independently as possible and achieve the best possible outcomes.&lt;/p&gt;\n&lt;p&gt;As a podiatrist within the joint community rehabilitation team and falls prevention service you will be working as part of a multidisciplinary team providing podiatry assessments, treatment plans and support to ensure timely and appropriate interventions for our patients as part of their rehabilitation programme along with close links with the community podiatry team and community nursing. You will also undertake training and competencies on how to carry out multifactorial assessments to identify modifiable risk factors may be present to along with home hazards as an indication to why people may be falling at home and how we can work together with our clients to minimise these. This is done by supporting patients within their own homes to increase their confidence and maintain independence, along with improving their strength and mobility to ensure they are safe and to help reduce the risk of further falls.&lt;/p&gt;\n&lt;p&gt;We encourage you to contact us for an informal chat or visit. We look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Hannah Perry, Lead Podiatrist for Intermediate Care, hannahperry@nhs.net, 07554439175&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Firwood House, Eastbourne", "postalCode": "BN22 9QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7984", "longitude": ".270185"}}, "title": "Podiatrist - Joint Community Rehab including Falls Prevention", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248289", "validThrough": "2020-11-15T23:59:59+0000"}