{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-10-27T13:16:26+0000", "description": "&lt;p&gt;The Thame Adult Community Health Care Team (ACHT) is delighted to announce a Band 6 Community Nurse /Case Manager position. &lt;br /&gt;&lt;br /&gt;The ACHT reflects an integrated approach that has been designed in response to the changing needs of the local population, with a special emphasis being placed on the proactive vision of care for patients in the community setting, including caseload management, prevention of admission, reablement and end of life care. In addition, emphasis is being placed on candidates to successfully facilitate timely discharge from hospital utilising a co-ordinated approach to care in partnership with key care partners. &lt;br /&gt;&lt;br /&gt;The ACHT provide a 7 days a week service, which can react to the patients needs as and when required. The successful candidates will be expected to work within a shift patterns.&lt;/p&gt;\n&lt;p&gt;There is the opportunity for District nurse training if you are not already holding the qualification. The training for extended roles is always fully supported ie non-medical prescribing, advanced assessment and leadership. Our case managers are supported to attend regular multidisciplinary team meetings to ensure the most appropriate pathway is found.&lt;/p&gt;\n&lt;p&gt;The team leadership is made up of a Community team lead, An Advanced Case Manager who is qualified as Clinical Practice Teacher in district nursing, An advanced case manager who has extensive skills managing teams and a Complex Case Manager leading on keeping people in their homes.&lt;/p&gt;\n&lt;p&gt;Required skills include: &lt;br /&gt;* Co-ordination and ability to lead a team within a primary healthcare setting utilising an integrated approach to care. &lt;br /&gt;* Setting, maintaining and delivering high standards of care in a variety of locations. &lt;br /&gt;* Ensuring rapid access to complex care provision to improve end of life care. &lt;br /&gt;* Case load management: being responsible for the assessment, implementation and evaluation of individualised evidence based care plans. &lt;br /&gt;* Working in partnership with other agencies to address the needs of the patient. &lt;br /&gt;* Leadership / management role within a designated team. &lt;br /&gt;&lt;br /&gt;We are looking for a qualified District Nurse or an experienced Community Nurse who has experience within the community setting as a development role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jacqueline Carr 07917596463&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thame Annex East Street Thame, Thame ACHT", "postalCode": "OX9 3JT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7453", "longitude": "-.969986"}}, "title": "Community Case Manager - Nurse Thame ACHT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244698", "validThrough": "2020-11-10T23:59:59+0000"}