{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependant on years of Consultant Experience"}}, "datePosted": "2020-10-01T14:01:39+0100", "description": "&lt;p&gt;&lt;span&gt;London North West University Healthcare Trust (&lt;/span&gt;LNWUHT) and &lt;span&gt;Imperial College Healthcare NHS Trust (&lt;/span&gt;ICHNT) are delighted to offer this exciting new joint Genetics Consultant post, representing a collaboration between the Regional Genetics Service in the NW Thames region and an independent tertiary provider to maximise benefit from advances in genomic medicine. This post builds on an increasingly close relationship between North West Thames Region Genetic Service (NWTRGS) and ICHNT in delivering genetic services, and the legacy of the West London Genomic Medicine Centre, hosted by ICHNT. The post would be suited to an enthusiastic and self-motivated clinician with excellent interpersonal skills, the ability to communicate complex information to a wide range of audiences, and the ability to work in a team to develop and implement a vision for Genomic Medicine.&lt;/p&gt;\n&lt;p&gt;A key aspect of the role within ICHNT will be working with individual specialties to recognise and exploit opportunities to enhance care for patients and families through genomics. You will support and be supported by our Genomic Champions, an existing joint NWTRGS-ICHNT Genetic Counsellor, and genomic practitioners.&lt;/p&gt;\n&lt;p&gt;The main aspect of the role within NWTRGS will be to deliver genetic services to patient through clinics as part of the NWTRGS consultant team.&lt;/p&gt;\n&lt;p&gt;Within NWTRGS and ICHNT, we are keen to add new skills and interests to our clinical team, and to develop new services. A demonstrable special interest that could be developed into new services, particularly in a multidisciplinary setting, would be welcomed. A documented interest and experience in Cancer Genetics will also be welcome.&lt;/p&gt;\n&lt;p&gt;While this is a clinical role, NWTRGS provides input into the Imperial College London MSc in Human Molecular Genetics and has a developing relationship with the College through the NIHR Imperial Biomedical Research Centre, hosted jointly with ICHNT. There will be opportunities for teaching, and a desire to be actively involved in research for patient benefit. An ability and experience in initiating research projects locally, would be considered an advantage.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview Date - TBC&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Jan CobbenJob titleConsultant Clinical GeneticistEmail addressjan.cobben@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;Teena Ferguson&lt;/p&gt;\n&lt;p&gt;teena.ferguson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Consultant in Clinical Genetics and Genomic Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916208787", "validThrough": "2020-11-23T23:59:59+0000"}