{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-21T08:40:36+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 6 – Senior Registered Nurse&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Intermediate Care Beds&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;22.5 hours– negotiable - with 1 in 4 weekends included&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a key member of our Intermediate Care Bed service, you will provided a lead for Nursing within the Multi-disciplinary Team, principally for the nurses and will report to Team Leaders. Providing a holistic patient care approach for all patients occupying one of the Intermediate Care Beds. Ensuring patients wellbeing and safety within a multi-disciplinary setting.&lt;/p&gt;\n&lt;p&gt;We are looking to expand our Team with band 6 Nurses. For the right candidates, development opportunities will be available, such as prescribing and long term condition courses. We are committed to supporting CPD through our robust appraisal system. This is supported and delivered by in-service training, access to external courses and clinical supervision.&lt;/p&gt;\n&lt;p&gt;This post will include working a variety of shift patterns covering the service between 8-7 weekdays and 8-4 on weekends&lt;/p&gt;\n&lt;p&gt;The role includes both hands on and non-clinical aspects such as; supporting staff, assisting with identifying and implementing service improvements, and maintaining high standards of care.&lt;/p&gt;\n&lt;p&gt;Ensuring effective communication between the whole multidisciplinary team is essential and the successful candidate will need to show leadership skills both professionally and managerial. Ensuring implementation and maintenance of policy’s and staff compliance.&lt;/p&gt;\n&lt;p&gt;The role will include offering aspects of training to the multi-disciplinary team comprising of therapists and non-qualified colleagues and may at times extend to social care colleagues in the bed bases. They will also be involved with all multi-disciplinary team meetings.&lt;/p&gt;\n&lt;p&gt;They will demonstrate safe, clinical decision-making and expert care, including assessment and diagnostic skills, for those resident in Intermediate Care Beds. The post holder will also be expected to offer support to colleagues in the acute when required, to facilitate discharge and or emergency admissions.&lt;/p&gt;\n&lt;p&gt;The post holder will need to have and active NMC pin with no restrictions.&lt;/p&gt;\n&lt;p&gt;Locala supports employees to achieve a positive work- life balance and promotes mobile working with colleagues when required and will be provided with the technology to make it happen.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information please contact: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Judith Upton – Band 6 Nurse – Intermediate care beds – Moorlands grange – 07763557926 – judith.upton@locala.org.uk&lt;/p&gt;\n&lt;p&gt;Anna Laverick – Band 6 Nurse – Intermediate care beds – Ings Grove House – 01924 4989324 – anna.laverick@locala.org.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126414.png", "name": "Locala Community Partnerships CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126414"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield", "postalCode": "WF14 8DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6761", "longitude": "-1.69668"}}, "title": "Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235558", "validThrough": "2020-11-08T23:59:59+0000"}