{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-02T09:45:56+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to work for our high performing IAPT Service TalkingSpace Plus. We are seeking to recruit an ambitious therapist to join our Locality Lead team who can contribute to supervision and clinical case work and assist in the clinical leadership of one of our three localities.&lt;/p&gt;\n&lt;p&gt;You will need to have experience of working in an IAPT service and be a BABCP accredited CBT therapist and/or a clinical /counselling psychologist. You will also have completed further relevant training in clinical supervision and have substantial experience of supervising others.&lt;/p&gt;\n&lt;p&gt;We are a well-established service with a great reputation for providing a full range of high-quality evidence-based treatments and interventions for patients with and without long-term physical health conditions experiencing common mental health problems. TalkingSpace Plus was a DoH Pathfinder site and NHSE Wave 1 integrated IAPT LTC site and continues to develop its staff to be able to work with patients with anxiety and/or depression, with and without comorbid long-term physical health conditions. Training opportunities in other NICE recommended therapies may also available.&lt;/p&gt;\n&lt;p&gt;We offer supervision, CPD opportunities to support career progression and have excellent links with the Oxford Centre for Psychological Health that includes Oxford Centre for Cognitive Therapy (OCTC) and Oxford Institute for Clinical Psychology Training, which is hosted by the Trust. We actively encourage innovation and research with opportunities for collaborations with Oxford Academic Health Science Network, University of Oxford Department of Psychiatry and Department of Experimental Psychology.&lt;/p&gt;\n&lt;p&gt;TalkingSpace Plus is a partnership between Oxford Health NHS Foundation Trust, Oxfordshire Mind and Principle Medical Limited.&lt;/p&gt;\n&lt;p&gt;Whether this feels like it is the next step up in your career, or you would like to move to a beautiful county boasting one of the highest performing IAPT services in the UK, we are interested in hearing from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie ClarkeJob titleDeputy Clinical LeadEmail addressDebbie.Clarke@oxfordhealth.nhs.ukTelephone number01865901222&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Abell House, The Slade, Oxford, Oxfordshire", "postalCode": "OX3 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7435", "longitude": "-1.19866"}}, "title": "Clinical Supervisor (CBT) and Locality Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251456", "validThrough": "2020-11-16T23:59:59+0000"}