{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-20T10:16:36+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for band 5 staff nurses to join our busy and friendly caring and compassionate Team on Ward C7, Gastroenterology at the Dudley Group Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Whether you’re a student nurse looking for your first professional nursing job, you’re looking to return to the profession after a break in practice or seeking out the next challenge to develop and enhance your nursing skills - this is the job for you.&lt;/p&gt;\n&lt;p&gt;We are a rapidly developing and forward-thinking ward with an established nursing team who strive to provide an excellent standard of care to all patients. We are looking to appoint dynamic individuals with strong interpersonal skills that will look forward to the challenges of nursing patients who have Gastric conditions.&lt;/p&gt;\n&lt;p&gt;We need you to help us make a difference to the lives of those who enter our care and to continue to deliver a high standard of treatment to our patients. This role would be suited to an individual who is highly committed, motivated and enthusiastic who also has a desire to develop skills within GI medicine.&lt;/p&gt;\n&lt;p&gt;No previous experience in GI medicine is required for any applicants wishing to apply but it would be an advantage if you have some background experience in caring for adults in an acute hospital setting.&lt;/p&gt;\n&lt;p&gt;Full time and part time hours will be considered.&lt;/p&gt;\n&lt;p&gt;Vacancies will close from further applications when we have received a minimum amount of applications from which to make a shortlist.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lead Nurse Sarah Gregory on 01384 456111 EXT 1802 or email sarah.gregory7@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Staff Nurse - Ward C7 - RA", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233765", "validThrough": "2020-11-16T23:59:59+0000"}