{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907- £30,615"}}, "datePosted": "2020-10-09T07:57:56+0100", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a Band 5 Community Staff Nurse to join the Out of Hours community nursing service - based at Merlin House, Tamworth. The Out of Hours service for the south division of the organisation provides nursing care to the following areas: Seisdon, Stafford, Cannock, Burntwood, Lichfield and Tamworth.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Staff are located geographically over four bases and spread across the area. It is not expected that the successful candidate will cover this extensive geography each shift and the staff member will be located to their nearest base. Consideration will be given to where you live when planning rotas, however, you must be prepared to travel and organise your time accordingly. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The Out of Hours team is a continuation of care from the day teams, thus providing a 24 hour nursing service in the community to service users in their own homes or residential homes. The shift patterns available are between the hours of 18.15 and 08.15hrs. The successful applicant will be asked to be flexible in working evenings and nights, covering the 7 day week.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must also be able to care for people who live in the community, who are at risk of deteriorating health resulting in a reduced quality of life, with an emphasis on avoiding hospital admission or unnecessarily long lengths of stay.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a dynamic, enthusiastic and motivated individual to join our Integrated Locality Care Team. There will be opportunities for personal development.&lt;br /&gt; &lt;br /&gt; You should have excellent communication and interpersonal skills and the ability to organise and prioritise your workload without direct supervision. You should be committed to delivering a high quality service through an integrated and holistic approach to patient care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; For further information please contact;&lt;/p&gt;\n&lt;p&gt;Carolyn Fleurat -Operational Manager&lt;/p&gt;\n&lt;p&gt;carolyn.fleurat@mpft.nhs.uk or tel: 07811 249543&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Merlin House, Tamworth", "postalCode": "B78 3HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6217", "longitude": "-1.71561"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219417", "validThrough": "2021-01-10T23:59:59+0000"}