{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 Per annum"}}, "datePosted": "2020-11-06T12:31:54+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a full time Administration Support Officer to join the North Powys Wellbeing Programme on a fixed term/secondment basis until end of March 2021.&lt;/p&gt;\n&lt;p&gt;The successful person will work as part of a dynamic team on the North Powys Wellbeing Programme. This opportunity is open to someone that is:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Motivated and enthusiastic&lt;/li&gt;\n&lt;li&gt;Able to effectively communicate&lt;/li&gt;\n&lt;li&gt;Well organised/multi-tasker - able to efficiently manage time and prioritise workload&lt;/li&gt;\n&lt;li&gt;Efficient in note taking&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If the answer is ‘yes’ to the above questions, then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role will involve:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will work closely with the Programme Lead and Programme Team to provide a range of clerical and secretarial services:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be a source of contact for the programme, receive and deal with enquiries, directing people to the appropriate person&lt;/li&gt;\n&lt;li&gt;Have excellent communication skills to communicate complex information and to maintain a high standard of confidentiality&lt;/li&gt;\n&lt;li&gt;Order and maintain supplies and process invoices using Oracle&lt;/li&gt;\n&lt;li&gt;Retrieving information, photocopying and filing&lt;/li&gt;\n&lt;li&gt;Managing diaries, organising meetings, utilising diary time effectively, coordinating attendance, booking venues, equipment etc.&lt;/li&gt;\n&lt;li&gt;Dealing with routine items, managing and responding to and tracking correspondence, dealing with routine items and follow up action reminders&lt;/li&gt;\n&lt;li&gt;Developing and maintaining efficient filing systems/record keeping&lt;/li&gt;\n&lt;li&gt;Prepare accurate papers and taking minutes, monitoring follow up action.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mae cyfle cyffrous wedi codi i Swyddog Cymorth Gweinyddol ymuno â Rhaglen Llesiant Gogledd Powys ar sail tymor penodedig / secondiad o 12 mis.&lt;/p&gt;\n&lt;p&gt;Bydd yr unigolyn llwyddiannus yn gweithio fel rhan o dîm dynamig ar Raglen Llesiant Gogledd Powys. Mae’r cyfle yn agored i rywun sy’n:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Llawn cymhelliant a brwdfrydedd&lt;/li&gt;\n&lt;li&gt;Gallu cyfathrebu’n effeithiol&lt;/li&gt;\n&lt;li&gt;Trefnus / gallu aml-dasgio – gallu rheoli amser yn effeithlon a blaenoriaethu llwyth gwaith&lt;/li&gt;\n&lt;li&gt;Gallu cymryd nodiadau’n effeithlon&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Os mai ‘ydw’ yw’r ateb i’r cwestiynau uchod, yna fe hoffem ni dderbyn gair oddi wrthych.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bydd y rôl yn cynnwys y canlynol:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bydd yr ymgeisydd llwyddiannus yn gweithio’n agos gydag Arweinydd y Rhaglen a Thîm y Rhaglen i ddarparu amrywiaeth o wasanaethau clercio ac ysgrifenyddol:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bod yn fan cyswllt i’r rhaglen, derbyn a thrin ymholiadau, gan gyfeirio pobl i’r unigolyn priodol&lt;/li&gt;\n&lt;li&gt;Sgiliau cyfathrebu rhagorol i gyfathrebu gwybodaeth gymhleth a chynnal safon uchel o gyfrinachedd&lt;/li&gt;\n&lt;li&gt;Archebu a chynnal cyflenwadau a phrosesu anfonebau gan ddefnyddio Oracle&lt;/li&gt;\n&lt;li&gt;Dod o hyd i wybodaeth, llungopïo a ffeilio&lt;/li&gt;\n&lt;li&gt;Rheoli dyddiaduron, trefnu cyfarfodydd, defnyddio amser yn y dyddiadur yn effeithiol, cydlynu presenoldeb, bwcio lleoliadau, cyfarpar, ac ati&lt;/li&gt;\n&lt;li&gt;Trin eitemau beunyddiol, rheoli ac ymateb i, a mynd ar drywydd gohebiaeth, a gweithredu ar nodiadau atgoffa&lt;/li&gt;\n&lt;li&gt;Datblygu a chynnal systemau ffeilio/cadw cofnodion effeithlon&lt;/li&gt;\n&lt;li&gt;Paratoi papurau manwl-gywir, monitro camau gweithredu dilynol&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Mae&#39;r gallu i siarad Cymraeg yn ddymunol ar gyfer y swydd hon; mae croeso cynnes i siaradwyr Cymraeg a/neu Saesneg ymgeisio.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHayley GriggJob titleNorth Powys Project OfficerEmail addressHayley.grigg@wales.nhs.ukTelephone number07792 129677&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123203.jpg", "name": "Powys Teaching Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123203"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "To be completed on recruitment, Newtown", "postalCode": "LD3 0LS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0102", "longitude": "-3.26181"}}, "title": "Administration Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259687", "validThrough": "2020-11-19T23:59:59+0000"}