{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum + Outer London HCAS"}}, "datePosted": "2020-10-28T11:16:54+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Community Care Co-ordinator - Band 6&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a Mental Health Nurse or Occupational Therapist to join a supportive, reflective and creative multidisciplinary Team. The MAP Treatment Pathway is based within Haringey Community Services (BEH) and offers treatment for people with chronic difficulties with anxiety, depression, avoidance and dependency (Cluster C Personality difficulties). MAP patients are often withdrawn, isolated, limited in their functioning and have multiple social and psychological needs. The aim of the pathway is to help increase people’s emotional, social and practical functioning, so they can engage better with relationships and meaningful activity outside of services.&lt;/p&gt;\n&lt;p&gt;The pathway has developed innovative ways of working with this group of patients, involving various integrated interventions, such as Key-Clinician (care coordination) sessions, regular joint reviews, brief interventions (e.g. Behavioural Activation, Anxiety management, Agoraphobia treatments) and a group interventions (4x groups). It is a small, supportive and contained team of Nurses, Social Workers, Psychologists, Psychiatrists, an Associate Mental Health Worker and an Assistant Psychologist. An aptitude and interest to work collaboratively and respectfully in multidisciplinary teams is thus essential.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with a minimum of 24 months post qualification experience and is interesting in developing as a care coordinator. The successful applicant will have experience of care coordination, assessments and an interest in this client group. The successful applicant will hold a mixed caseload of patients on CPA and will also work as a Key Clinician (non-CPA). This allows an increased sense of agency for patients who are stepped down from being held on CPA. Care Coordinators work closely with Psychologists, Psychiatrists and Associate Mental Health Workers to develop a treatment plan that will offer either structured task based care coordination and/or psychologically informed group treatments as needed.&lt;/p&gt;\n&lt;p&gt;Psychological models used within the pathway include Cognitive Analytic Therapy and Cognitive Behavioural Therapy and we have psychodynamic and family work expertise and input as well. Psychological treatment is offered in the format of a phased programme largely (but not solely) delivered in groups aiming to introduce new skills to self-manage. We welcome applicants who are interested to be involved in co-facilitating therapeutic groups.&lt;/p&gt;\n&lt;p&gt;There is an emphasis on team based multi-disciplinary decision making which lends itself to creating a supportive environment for staff. We value rich and thoughtful discussion about our patients and consider their needs holistically, privileging neither psychiatric, psychological nor social perspectives. Much of the treatment programme has been developed by staff currently working within the pathway and we have a culture of active service development with staff involvement in this process. We have also provided both formal and informal training for staff working with this population and would expect to continue with this.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Occupational Therapists must be registered with HCPC and Mental Health Nurses must be registered with NMC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ephraim Chitenhe (Team Manager) on &lt;/strong&gt;&lt;strong&gt;ephraim.chitenhe@nhs.net&lt;/strong&gt;&lt;strong&gt; or 0208 702 4572 or Dr Leon Simpson (MAP Clinical Lead, Clinical Psychologist) on 020 8702 3974 or &lt;/strong&gt;&lt;strong&gt;leon.simpson@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Virtual Interviews will be either 1st or 2nd Week of December via MST/ ZOOM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Marcia Graham-Fadiora&lt;/p&gt;\n&lt;p&gt;Job title: Team Manager&lt;/p&gt;\n&lt;p&gt;Email address: Marcia.graham-fadiora@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St. Anns Hospital, Haringey", "postalCode": "N15 3TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5807", "longitude": "-.092156"}}, "title": "Care Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246249", "validThrough": "2020-11-11T23:59:59+0000"}