{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "40944", "unitText": "YEAR", "value": "MN37 - £40,944 - £51,069"}}, "datePosted": "2020-11-03T15:46:24+0000", "description": "&lt;p&gt;Applications are invited for the above full time post until 3rd of August 2021 with the potential to extend for this 641 bed acute hospital serving a local population of approximately 400,000. This appointment will be made in accordance with the Terms and Conditions of Service for Hospital Medical and Dental Staff (England) 2002.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The appointees will have good all round experience in Emergency Medicine, having completed 24 months at ST1-2 level (or equivalent) in Emergency Medicine. The appointee should also have MRCEM Part A Completed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you an experienced Emergency Medicine doctor who is looking to advance your career and possibly gain entry to the EM specialist register via the CESR route? These posts, being offered at Registrar level, offer a 3 month secondment for every 12 months worked in specialties where evidence of experience and competencies are required for CESR (usually anaesthetics, ITU, acute medicine, paediatrics).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Emergency Department (ED) is amongst the top performing departments in England. We are one of the busiest in the region, serving a diverse local population. We are part of the East of England Trauma Network, but as a designated Trauma Unit in a unique location we still manage a large amount of trauma. The hospital is the regional stroke centre, and we have access to a full range of specialty support.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our department underwent a recent refurbishment and there are plans for a major site redevelopment, providing exciting opportunities for further enhancing our service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Come and join us in shaping the future of Emergency Care in a Major Centre. This is a perfect opportunity to develop and expand a service that is made for 21st century care. We are looking for forward thinking candidates, who may have skills in areas allied to EM.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ED sees over 80,000 cases per year – a further 40,000 are streamed from the front door to the adjacent GP led Urgent Clinic. Our proportion of minor illness is much lower than in many other ED’s, thus our incidence of pathology is proportionately higher. Around 20% of our workload is paediatric. We are a Trauma Unit and the regional hyper-acute stroke centre, and have recently started interventional cardiology services. As part of a £3m redevelopment, we have a dedicated paediatric ED, and are currently expanding our cubicle space. The trust has committed to being a Hyper-Acute Hospital, which will see a completely new model of emergency care in line with the expectation that we will be a Major Emergency Centre for the region.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The trust acknowledges that clinical fellows have training needs as much as those who participate in the deanery training programs. These training needs are specific to the individual, and if appointed to this role the trust is committed to supporting your training and development so that you can progress in your chosen career. The trust actively supports career progress either to the Staff and Associate Specialist grade, or through article 14 to achieve full CCT, with the potential for obtaining a full consultant post subsequently.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Each Senior Clinical Fellow has a Consultant to act as their educational supervisor, with specific time allocated in the Consultants job plans to provide support and mentoring. In addition within the division of medicine there will be a tutor for Senior Clinical Fellows to provide overall coordination of educational support. They will be supported by the Director of Medical Education. The Study Leave and funding are available with this role is detailed further in the Job Description.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The L&amp;D has always been renowned for its friendly atmosphere and good working relationships. The Hospital has an excellent track record of financial and senior executive stability and in recognition of this excellent performance, with our CEO seconded to NHS England as the National Urgent and Emergency Care Director to lead the national implementation of the Urgent and Emergency Care Review and the associated components of the NHS Five Year Forward View. The L&amp;D is also one of only a small percentage of hospitals in England to receive an overall rating of ‘good’ by CQC in their recent report, with some areas such as Urgent and Emergency Care rated as ‘outstanding’.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust has University Hospital status which provides an academic environment to the hospital. In addition to postgraduate training, we welcome medical students from the UCL Medical School throughout the year and by arrangement with the medical school provide a programme of clinical placements to support their education. We have an excellent reputation for junior staff training. Within the Centre of Multi-Professional Educational &amp; Training (COMET) is the Medical Education Department, the library including an IT suite, and the Training &amp; Development Department. The main aim of the Medical Education Department is to promote postgraduate and continuing medical education and training for all doctors and dentists. The Hospital actively promotes career development and progression for all staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Hospital has excellent access to the surrounding areas with easy access to central London and the rural Chilterns. The rural areas include many attractive villages and towns within easy reach of the Hospital including St Albans and Harpenden. Excellent schools are found nearby. There is also very good access to the Midlands and North by road using the M1 or A1, or by rail to one of the Luton’s three stations. A direct link using the new ‘Busway’ takes passengers from Luton Train station just 7 minutes to reach a stop that is within a short walking distance of the hospital. London Luton Airport is within fifteen minutes of the hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants will be required to demonstrate a working knowledge of the Englis&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Luton and Dunstable Hospital, Luton", "postalCode": "LU4 0DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8942", "longitude": "-.474244"}}, "title": "LAS Senior Clinical Fellow (ST5+) in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254623", "validThrough": "2020-11-17T23:59:59+0000"}