{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-04T14:46:10+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Forensic Consultant Psychiatrist (10PA)&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Lancashire &amp; South Cumbria NHS Foundation Trust is one of the largest Trusts in the North West of England and provides health &amp; well-being services to a population of around 1.5 million people, covering the whole of the county. The secure (forensic) services are based at Guild Lodge in Preston where inpatient facilities are available in medium and low secure environments. There are inpatient beds to provide locked (step down) rehabilitation.&lt;/p&gt;\n&lt;p&gt;We are now seeking to recruit a Consultant Forensic Psychiatrist to join our well established team of 14 Consultants. This post will provide an excellent opportunity to develop a special interest in education and teaching, research, and management.&lt;/p&gt;\n&lt;p&gt;The post will be based at Guild Lodge (Preston) with responsibility for inpatients. The candidate will work in multi-disciplinary teams.&lt;/p&gt;\n&lt;p&gt;Applicants should hold full GMC registration and be included on the Specialist register of the GMC or they should be eligible for entry to the Specialist Register within 6 months of the interview date. A CCT in Forensic Psychiatry would be desirable. A commitment to education and training or other evidence of academic achievement will be an advantage.&lt;/p&gt;\n&lt;p&gt;It is a requirement that applicants are Section 12 Approved at the time of commencing employment and have or are eligible to have Approved Clinician Status. Remuneration will be as set out in the terms of the New Consultant Contract according to previous experience, based on 10 Programmed Activities (PAs) per week.&lt;/p&gt;\n&lt;p&gt;Whilst this post is advertised as full time we are happy to consider a candidate wanting to work part time to fit around work-life needs and would welcome and encourage such applications.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Lucy Bacon&lt;/p&gt;\n&lt;p&gt;Consultant Psychiatrist and AMD (Secure Services)&lt;/p&gt;\n&lt;p&gt;Email address: medicalrecruitment@lscft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01772 406631&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guild Lodge, Preston", "postalCode": "PR3 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8165", "longitude": "-2.65834"}}, "title": "Consultant Forensic Psychiatrist, Preston", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256273", "validThrough": "2020-11-25T23:59:59+0000"}