{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-11-04T12:31:09+0000", "description": "&lt;p&gt;We have an exciting opportunity for a qualified and registered Accuracy Checking Pharmacy Technician to join our pharmacy team.&lt;/p&gt;\n&lt;p&gt;We are a department that is committed to the extended role of technicians, and you will gain experience in all aspects of hospital pharmacy practice in our busy department. We offer excellent in house training where you will be supported and encouraged to further develop your skills. Your duties will include dispensary services, patient counselling, ward based work and accuracy checking.&lt;/p&gt;\n&lt;p&gt;You must possess excellent communication and organisational skills in order to provide efficient and safe pharmacy services for patients.&lt;/p&gt;\n&lt;p&gt;You will be a qualified pharmacy technician with BTEC/NVQ3 in pharmaceutical sciences or recognised equivalent and a BTEC accuracy checking qualification or equivalent. In addition to this you should have current professional registration with the General Pharmaceutical Council.&lt;/p&gt;\n&lt;p&gt;This post is Permanent&lt;/p&gt;\n&lt;p&gt;Hours per week: 37.5&lt;/p&gt;\n&lt;p&gt;Closing date: 18th November 2020&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced with Barred list Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Karen Waltho-jones Job title Senior Technician Dispensary &amp; Ward based services Email address karen.waltho-jones@nhs.net Telephone number 01625 663043&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255840", "validThrough": "2020-11-18T23:59:59+0000"}