{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-29T16:15:48+0000", "description": "&lt;p&gt;Stoke Mandeville operating theatres are looking for a self-motivated, experienced theatre scrub practitioner to take on this exciting and challenging role in New Wing Theatres. This department comprises of five emergency operating theatres and two obstetric theatres. Which cover a wide range of emergency surgery including - General, Gynaecology, Plastics, Trauma Orthopaedics, Spines and Obstetrics. &lt;br /&gt;&lt;br /&gt;The successful applicant will be a Registered Nurse/Operating Department Practitioner with substantial scrub experience at band 5. You will be responsible for leading a theatre team on a day to day basis, whilst supporting the longer term planning of care delivery within one specific speciality. You will have excellent communication skills and the ability to work using your own initiative as well as working effectively within a team. &lt;br /&gt;&lt;br /&gt;You will:&lt;br /&gt;&lt;br /&gt;* Be a NMC registered nurse or HCPC registered ODP with recent experience within theatre services.&lt;br /&gt;* Be motivated and enthusiastic about your own professional development and keen to enhance skills and competencies within the team.&lt;br /&gt;* Have a recognised mentorship qualification, or be prepared to gain this. &lt;br /&gt;* Demonstrate a good understanding of the importance of supportive and flexible team working.&lt;br /&gt;&lt;br /&gt;Only Practitioners with significant post-qualification theatre experience will be considered. Both part time and full time applicants will be considered.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Marc Lingwood&lt;/p&gt;\n&lt;p&gt;Trauma Orthopaedic and Spine Theatre Lead&lt;/p&gt;\n&lt;p&gt;New Wing Theatres&lt;/p&gt;\n&lt;p&gt;01296 315600&lt;/p&gt;\n&lt;p&gt;marc.lingwood1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke Mandeville, Stoke Mandeville - Expected to work cross sites", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Scrub Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249037", "validThrough": "2020-11-12T23:59:59+0000"}