{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inc"}}, "datePosted": "2020-11-04T11:31:17+0000", "description": "&lt;p&gt;The Acute Medicine team at the Royal London Hospital is looking to appoint outstanding nurses to the post of Staff Nurse within the Acute Admissions Unit (AAU).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closely supported by a large team of Sisters/Charge Nurses we will help you to develop your role as a nurse within the busy and exciting field of acute medicine. We admit patients directly from A&amp;E and ambulatory care to our 52 bedded AAU and aim to provide an exceptional standard of care whilst maintaining the flow of patients throughout the hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will work closely with our dedicated team of acute medical consultants as well as teams from all other medical specialties. We are able to provide level 1A care for more acutely unwell patients and have 8 beds with cardiac monitors.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The 727-bed Royal London Hospital is one of the UKs largest and most advanced healthcare facilities. As the UK’s leading trauma and emergency care centre, it is also the home of London’s Air Ambulance, which operates from a special area on the roof, as well as Europe’s largest renal service. A dedicated unit for women and children features London’s second-largest paediatric service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hospital also offers general acute services for the City of London and Tower Hamlets. The cluster of interconnected, contemporary glass buildings includes two 17-story towers, one equipped with the helipad for London’s Air Ambulance, and a 10-story tower. These new facilities form a health campus incorporating the neighbouring Queen Mary University of London’s Medical School, the School of Midwifery and the Dental Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer to our new recruits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support and development from your Band 7 nursing team , including Senior Sisters/Charge Nurses and a dedicated Practice Development Nurse for the Acute Admissions Unit.&lt;/li&gt;\n&lt;li&gt;Newly qualified nurses can undertake our dedicated Preceptorship Program and we have wealth of different training opportunities for more experienced nurses.&lt;/li&gt;\n&lt;li&gt;An opportunity to work alongside a dynamic consultant body who are breaking new boundaries within the field of outpatient and inpatient emergency care medicine.&lt;/li&gt;\n&lt;li&gt;Support to undertake the further education that you need to develop.&lt;/li&gt;\n&lt;li&gt;An opportunity to be developed by your professional nurse leads.&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are committed to developing and supporting your nursing career. We will support you, every step of the way.&lt;/p&gt;\n&lt;p&gt;For futher information please contact Rachel Keith - Ward Manager&lt;/p&gt;\n&lt;p&gt;r.keith@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal London Hospital, London", "postalCode": "E1 1FR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.059802"}}, "title": "Staff Nurse AAU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255618", "validThrough": "2020-11-18T23:59:59+0000"}