{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-10-26T03:31:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Support Worker – Band 3 – Emergency Department – Full time and part time positions available – Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Could you help West Suffolk Hospital to deliver the best quality and safest care to our local community?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Emergency Department at the West Suffolk Hospital Foundation Trust. We are seeking to recruit Band 3 Clinical Support Workers into our team. We are looking for workers with a minimum of one years’ experience in an acute care setting. Our main goal at the WSH Emergency Department is to provide quality patient centred care, whilst striving as a team and as a Trust, to achieve the national ED targets.&lt;/p&gt;\n&lt;p&gt;Applicants will need to demonstrate a self-motivated, hardworking and passionate approach to delivering the highest quality patient care. The successful will have the opportunity to work clinically in all areas of the department, as well as actively continuing to be proactive in advancing your own practice development and education, supported by the Unit Manager, Education Lead and Matron.&lt;/p&gt;\n&lt;p&gt;We have recently undertaken a major expansion project which is due for completion in early 2021. This together with a Rapid Assessment Area means we can ensure we meet all our patients’ needs and ensure optimised service delivery. It doesn’t stop here! We have a dedicated and passionate ED work force that includes Acute Clinical Practitioners (ACPs) and Emergency Nurse Practitioners (ENPs) who can see, treat and discharge their own patients, assisting the medical ED team in delivering excellent care.&lt;/p&gt;\n&lt;p&gt;Following a CQC inspection in 2019, our Emergency Department received an overall rating of ‘Good’. We are passionate supporters of our nursing team at every grade, but recognise the unique skills and experience that our Band 3 staff bring to the team.  As our ideal candidate you must have a strong desire to deliver high quality ED nursing care as part of a motivated team.&lt;/p&gt;\n&lt;p&gt;Informal visits are welcomed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further enquiries please contact Donna Bowd ED Unit Manager&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;donna.bowd@wsh.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does&lt;/strong&gt; entitle you to apply to park on the Hospital site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at Enhanced level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Clinical Support Worker - Band 3 - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241665", "validThrough": "2020-11-09T23:59:59+0000"}