{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21892", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 per annum"}}, "datePosted": "2020-11-06T16:01:00+0000", "description": "&lt;p&gt;Health Education England (HEE) exists for one reason only: to support the delivery of excellent healthcare and health improvement to the patients and public of England by ensuring that the workforce of today and tomorrow has the right numbers, skills, values and behaviours, at the right time and in the right place.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a Business Support Administration Assistant in the Regional Business Management (RBM) function within HEE’s North East and Yorkshire region.&lt;/p&gt;\n&lt;p&gt;The RBM function provides business, PA and administrative support to senior staff and other functions within the North East and Yorkshire region and is also responsible for local office facilities management.&lt;/p&gt;\n&lt;p&gt;The Business Support Administration Assistant will be a member of the Business Support team for North East and Yorkshire, undertaking a range of administrative tasks and reporting to the Regional Business Support Coordinator.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be able to demonstrate a flexible, customer-focused approach and a strong commitment to achieving high standards of service.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants will commence at the bottom of Band 4 with a full-time starting salary of £21,892, with a pay step increase after 3 years’ service.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today!  We get lots of applications for our roles and so we sometimes have to close our posts early.  Don&#39;t miss out! &lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name: Susan Holland&lt;/p&gt;\n&lt;p&gt;Job title: Business Support Coordinator&lt;/p&gt;\n&lt;p&gt;Email address: Susan.holland@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0191 2754787&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Waterfront 4, Newcastle Upon Tyne", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Business Support Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260507", "validThrough": "2020-11-15T23:59:59+0000"}