{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-05T12:00:19+0000", "description": "&lt;p&gt;An exciting position has arisen in the Calderdale Home Treatment Team, for a Band 6 Police Liaison Practitioner&lt;/p&gt;\n&lt;p&gt;The working hours will be 6pm till 6 am, full time.&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced practitioner who has an interest in working within our busy crisis pathway. We work closely with our colleagues in the Mental Health Liaison pathway, to ensure service users receive timely interventions with optimum outcomes.&lt;/p&gt;\n&lt;p&gt;Working from the police patrol room and Home Treatment Team office you will be expected to offer, support and advice to officers attending incidents where there are mental health concerns.&lt;/p&gt;\n&lt;p&gt;The role encompasses triaging police logs and advising on the most appropriate form of action. Support calls to individuals may be required and there will be occasions where it is necessary to attend incidents in the community with officers, to facilitate comprehensive mental health assessments. You may also have occasional need to assess individuals at the police station if required.&lt;/p&gt;\n&lt;p&gt;You will advise on the appropriate pathways and signpost to various agencies where indicated, reducing the need for any police interventions and avoiding the use of section 136 (MHA) where appropriate. Wherever possible we aim to practice proactively to avert a crisis and de-escalate situations which may be highly charged.&lt;/p&gt;\n&lt;p&gt;A background in crisis / liaison work would be an advantage but more importantly you will be confident in working independently, be resilient and enjoy a challenge with a ‘can do’ approach and attitude. You must be able to formulate and document plans and strategies to manage risk effectively whilst involving the service user, police colleagues; family and carers. The environment can be fast paced so an ability to work under pressure is a must.&lt;/p&gt;\n&lt;p&gt;The successful applicant must have experience in risk assessment within an acute setting, be highly motivated and feel confident in working with service users who have complex mental health and social needs.&lt;/p&gt;\n&lt;p&gt;The team has an excellent relationship with the criminal justice system as well as health and social care agencies and have been very successful in the reduction of S136 detentions.&lt;/p&gt;\n&lt;p&gt;We share good relationships with police officers who report they feel more confident when dealing with individuals and it is of paramount importance that we continue to foster these relations, offering our police colleagues ongoing support and education in mental health matters.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Halifiax", "postalCode": "HD1 3LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.64", "longitude": "-1.78864"}}, "title": "Police Liaison Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257538", "validThrough": "2020-11-20T23:59:59+0000"}