{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "0"}}, "datePosted": "2020-11-05T14:16:10+0000", "description": "&lt;p&gt;Volunteers are extremely valuable in supporting our Organisation undertake its work and provide a great opportunity for people to gain experience within an NHS setting.&lt;/p&gt;\n&lt;p&gt;We are looking for caring and passionate people who want to make a difference to join our organisation. Providing excellent, high quality care is our priority and we want people who share our vision to join us.&lt;/p&gt;\n&lt;p&gt;The work volunteers do makes such a difference to staff, patients and visitors, and we are very grateful for their efforts. Volunteers play a valuable role across the hospital and within our community and can do from two hours a week to as many hours as they can spare. The hours and duties are adapted to fit in with the lives and interests of the volunteer, with some working during the days and some in the evenings or weekends.&lt;/p&gt;\n&lt;p&gt;Working as part of a team, our volunteer drivers transport our patients to and from their homes to our hospital sites for outpatient appointments and also provide transportation to patients who are being discharged and in need of support to get home. Volunteers also support in the delivery of medication and equipment to patients in the community.&lt;/p&gt;\n&lt;p&gt;The role will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Collecting patients from their home and taking them to and from our hospital sites within Stockton, Hartlepool and surrounding areas&lt;/li&gt;\n&lt;li&gt;Being an ambassador of the Trust at all times, whilst meeting the needs of the of the wider community&lt;/li&gt;\n&lt;li&gt;Taking patients to specific destinations using your own vehicle&lt;/li&gt;\n&lt;li&gt;Assisting patients in and out of the vehicle ensuring their and your own safety at all times&lt;/li&gt;\n&lt;li&gt;In some cases accompanying patients until they are ready to return home&lt;/li&gt;\n&lt;li&gt;Logging mileage and completing expense forms to ensure reimbursement of out of pocket expenses.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;An enhanced DBS will be required for this role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePaul Wharton &amp; Lindsay Rutherford-HoeTelephone number01642 383933Additional contact information&lt;/p&gt;\n&lt;p&gt;Paul Wharton &amp; Lindsay Rutherford-Hoe on 01642 383933&lt;/p&gt;", "employmentType": "VOLUNTEER", "hiringOrganization": {"@type": "Organization", "name": "North Tees and Hartlepool NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120670"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockton-on-tees", "postalCode": "TS19 8PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5829", "longitude": "-1.34677"}}, "title": "Volunteer Driver", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258067", "validThrough": "2020-11-19T23:59:59+0000"}