{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-28T15:00:20+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for two Trainee Advanced Care Practitioners to work within the Division of Surgery &amp; Cancer, one in General Surgery and one in Orthopaedics. We already have two excellent teams of established Advanced Care Practitioners (ACP) who support the medical teams in providing daily clinical review and management plans for all of our general surgical and orthopaedic patients, including emergency admissions and level one patients. The ACP’s form a vital and integral part of the surgical &amp; orthopaedic multidisciplinary teams.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; We are looking for professional, friendly and dynamic individuals to join these teams. Applicants require a high level of clinical expertise and experience in the field of surgical/orthopaedic nursing, as appropriate, and the care of the acutely unwell adult in order to work autonomously within a specified scope of practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant will be required to undertake the MSc Advanced Clinical Practitioner Apprenticeship Programme at the University of Liverpool over a three year period, commencing February 2021, and will be allocated two days each week to meet the demands of academic study.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an Advanced Care Practitioner, you will be expected to work alongside the medical and nursing teams to promote the delivery of a high standard of patient centered care within a supported environment. Following successful completion of the MSc, the applicant will assess, plan, implement and evaluate the immediate care and subsequent management of the adult patient, liaising and reporting to middle grade medical staff. Utilising specialised clinical and theoretical knowledge, the ACP will assess the health status of the patient through complete physical examination, medical history and psychosocial history demonstrating a systematic and thorough approach toward problem solving. Once qualified, the successful candidate will support in the provision of specialist education and training to facilitate the development of other members of the multidisciplinary team. Other key areas of the role include leading the development of clinical services and enhanced practice within the specialist field, working with clinical colleagues to develop and review both medical and nursing protocols, guidelines and standards of care through the process of clinical audit and quality improvement projects.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The posts are both a full time position that require flexibility in working, with rotation to weekends as part of an agreed rota with other members of the ACP team.&lt;/p&gt;\n&lt;p&gt;To discuss the role or arrange a visit please contact Helen Williamson or Sarah Dawson&lt;/p&gt;\n&lt;p&gt;helen.williamson@mcht.nhs.uk / sarah.dawson@mcht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crewe", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Trainee Advanced Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247073", "validThrough": "2020-11-13T23:59:59+0000"}