{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31365.00 to £37890 pro rata per annum"}}, "datePosted": "2020-11-03T12:30:47+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An opportunity has arisen to join the Hastings based integrated therapy team as a Band 6 Occupational Therapist on a full time, permanent contract. We are currently providing flexible working across home, main hub in Polegate and satellite hubs in the Hastings area due to COVID restrictions. Telehealth experience is not essential but will be advantageous. Flexible working patterns will be considered if applicable.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be joining a multidisciplinary team with significant shared experience within paediatrics, including Speech and Language Therapists, Physiotherapists, Occupational Therapists including Adaptations specialists and Integrated Therapy Assistants.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a forward-thinking OT with a drive for innovation and excellent communication skills, ability to adapt their approach to ensure child-centred practice whilst working within current resources. The individual needs to be able to demonstrate aspirational values, positivity and a solution-focused approach to their practice.&lt;/p&gt;\n&lt;p&gt;The post-holder will be required to supervise other individuals (Integrated Therapy Assistants) in the service as well as students and support the learning of apprentices in the team. A good knowledge of ASD, sensory processing difficulties and child development is essential. It would be advantageous to have neuro-disability experience and knowledge related to equipment prescription (adult or paediatric).&lt;/p&gt;\n&lt;p&gt;There will be an expectation for the post-holder to attend tribunals as required, to act as an expert witness as well as comment on private therapy reports. Training and support within the service will be provided. An ability to deal with conflict and experience of mediation is essential to the role.&lt;/p&gt;\n&lt;p&gt;The interview will be conducted in line with COVID restrictions including interview via Microsoft Teams and an unseen written task/presentation on the day of interview.&lt;/p&gt;\n&lt;p&gt;The interviews will take place on &lt;strong&gt;27th November 2020&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFiona MiddlemassJob titleProfessional Lead OTEmail addressfiona.middlemass@nhs.netTelephone number0300 1232652Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact: Fiona Middlemass - Professional Lead OT to discuss any further details on&lt;/p&gt;\n&lt;p&gt;0300 1232652.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chaucer Clinic, Polegate", "postalCode": "BN26 6QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8197", "longitude": ".269956"}}, "title": "Specialist Paediatric Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253987", "validThrough": "2020-11-13T23:59:59+0000"}