{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 gross per annum"}}, "datePosted": "2020-10-27T13:29:59+0000", "description": "&lt;p&gt;Hello. My name is Danni and I am the Modern Matron of Lark Ward which is a psychiatric intensive care unit based at Woodlands in Ipswich. I wanted to personally introduce myself and explain to you why you should choose to come and join my team.&lt;/p&gt;\n&lt;p&gt;We are a 10 bed unit supporting people at the most critical time of their Mental Health.&lt;/p&gt;\n&lt;p&gt;What comes to mind when you think of working on a PICU? Well, we are on a mission to challenge these pre -existing beliefs. As a team we are committed to working collaboratively with our service users and carers and we belief this this is the key to understanding the best way to care for our service users.&lt;/p&gt;\n&lt;p&gt;So why join my team?&lt;/p&gt;\n&lt;p&gt;I’m a realist, PICU is busy. The days are long as we work in an environment supporting people at their most vulnerable time. As a team we recognise this and make sure that all members of the team are fully supported and we look after you. I am really lucky to have a team of amazing Charge Nurses and CTL and our doors are open, we encourage our team to come speak to us. How can we expect you to look after others if we don’t look after you?&lt;/p&gt;\n&lt;p&gt;Lark Ward has recently been part of a national QI programme to reduce restrictive interventions. We approached this with collaborative care at the front of our minds, asking the people in our care what they wanted from us. The results have been fantastic with a 40% reduction in our restrictive interventions. This has had a really positive impact on my team who have worked hard and together to achieve this, and all took an active part when we presented our successes across the country.&lt;/p&gt;\n&lt;p&gt;I understand the importance of a fresh way of thinking, I want people to join my team who will bring new ways of thinking with them.&lt;/p&gt;\n&lt;p&gt;Whatever stage you are in your career NSFT will support you. We offer a truly unique preceptorship programme which is co-produced and co-delivered for our newest nurses. I want to recruit ambition, you will be encouraged to join one of our outstanding staff development programmes including our aspiring band 6, encompassing such modules as trauma informed care, human rights and collective leadership to name a few.&lt;/p&gt;\n&lt;p&gt;Working in a PICU is a brilliant platform to expand your skillset, we see people with a range of mental health conditions, offering opportunities to learn and giving you an underpinning knowledge you can take with you throughout your career.&lt;/p&gt;\n&lt;p&gt;What is it like living in Ipswich?&lt;/p&gt;\n&lt;p&gt;It’s great! Trip advisor recently names Ipswich amongst the world’s top emerging destinations, the only place in the UK to make the list. Could it be that Ipswich is a destination that&#39;s managed to keep its historical charm intact and is a cultural hub of activity?&lt;/p&gt;\n&lt;p&gt;From strolling through the arboretum at Christchurch Park, taking in a show at the famous Regent Theatre, viewing Constable&#39;s art at Christchurch Mansion, it is very easy to fall in love with Ipswich.&lt;/p&gt;\n&lt;p&gt;I’m sure part of the charm relates to Ed Sheeran being one of our most famous residents!&lt;/p&gt;\n&lt;p&gt;I would love you to come join my team and not only come work for me but come start a long and rewarding career at NSFT. If you would like more information please give me a call on 01473 891 720 or drop me an email Dannielle.Robinson@nsft.nhs.uk. Any interested nurses are welcome to come for an informal meeting to have a look round and meet the team. I am also a flexible; if attending an interview is difficult to fit around shift working we can facilitate skype interviews. We offer full time and part time vacancies with the usual mix of days and nights.&lt;/p&gt;\n&lt;p&gt;I’m really looking forward to hearing from you and thank you for your time&lt;/p&gt;\n&lt;p&gt;Danni&lt;/p&gt;\n&lt;p&gt;**This post attracts a recruitment premium of £3,000 (pro-rata for part time roles). This is a one off payment with half paid on appointment and half paid after the completion of a satisfactory probation period (6 months). The premium is taxable. Please note that should you leave employment, or choose to move to an alternative post within the Trust that does not attract this recruitment premium, you will be required to reimburse all or some it, as follows: 100% of the value of the premium in the first 12 months; 50% of the value of the premium in the period 12 months to 2 years following appointment. Please note this recruitment premium is for external Nursing staff only.**&lt;/p&gt;\n&lt;p&gt;A fixed term contract for 10 months could also be offered.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interview dates are yet to be set; you will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dannielle Robinson on 01473 891720 or dannielle.robinson@nsft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woodlands Hospital, Ipswich", "postalCode": "IP4 5PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "1.19795"}}, "title": "Mental Health Nurse, Psychiatric Intensive Care Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244722", "validThrough": "2020-11-08T23:59:59+0000"}