{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-21T09:31:13+0100", "description": "&lt;h2&gt;The role&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Are you someone looking for a career in one of the UK’s most respected mental health and learning disability trusts?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to be part of a dedicated team committed to helping those with mental health &amp; learning disability problems enjoy a better future?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to do a job that makes a difference every day?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; We are seeking Band 5 Mental Health Nurses (Registered Nurses - Mental Health) for our Mother &amp; Baby Unit (MBU); this is an exciting opportunity to join us in the new Jasmine Lodge 8 bedded unit in Exeter, Devon.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an opportunity for both newly qualified staff who would still receive our supportive and excellent preceptorship programme, and those staff that have been qualified for a period of time but would like to expand their experience.&lt;/p&gt;\n&lt;p&gt;Devon Partnership Trust Perinatal Service is a well-established one &amp; nationally awarded (Positive Practice in Mental Health - Community Perinatal Team 2016 &amp; 2018 winner). We have close working partnerships with our local Maternity Departments, Exeter University, Plymouth University &amp; a well-respected Research Department.&lt;/p&gt;\n&lt;p&gt;Devon Partnership NHS Trust is growing as we establish ourselves us as one of the leading providers of mental health services in the country.&lt;/p&gt;\n&lt;p&gt;Working as part of Devon Partnership NHS Trust, you will make a difference to people’s lives from the moment you start.&lt;/p&gt;\n&lt;p&gt;£24,907 - £30,615 per annum pro rata (Band 5)&lt;/p&gt;\n&lt;h2&gt;About you&lt;/h2&gt;\n&lt;p&gt;The successful candidate will be able to demonstrate sound clinical decision making and clinical leadership skills for running the ward as the Nurse in Charge. We are looking for a person/family centred Nurse who is compassionate and caring towards the women in our care.&lt;/p&gt;\n&lt;p&gt;The successful candidates will have excellent communication skills, commitment to working flexibly, participating in the internal 24 hours, 7 day a week rota to meet the needs of people who use our services, be able to demonstrate effective working in a multi-disciplinary team setting and demonstrate a commitment to further development with the support of the team.&lt;/p&gt;\n&lt;p&gt;There will be an excellent level of professionalism demonstrated in the successful candidate who leads by example and supports junior staff through supervision and when leading the shift.&lt;/p&gt;\n&lt;p&gt;If you would like to arrange a visit to Jasmine Lodge please contact the unit on 01392 539100 and speak with Hannah Fieldhouse (ward Manager) or Hannah Maker, Adelle Rees or Josh Ayres (Deputy ward managers).We welcome interested applicants to find out more.&lt;/p&gt;\n&lt;p&gt;Staff are encouraged and supported to use quality improvement methodology to help improve on the services we offer. The Trust Quality improvement Academy provides access to expert advice and support in your work area.&lt;/p&gt;\n&lt;h2&gt;The location&lt;/h2&gt;\n&lt;p&gt;Your base will be the MBU Exeter however under the current COVID-19 conditions this may be subject to alternative arrangements/change for example home working. Please be assured that any alternatives will be discussed fully with you and the organisation. Please ask the appointing manager if you have any questions.&lt;/p&gt;\n&lt;h2&gt;About us&lt;/h2&gt;\n&lt;p&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/p&gt;\n&lt;p&gt;You’ll be part of a team that is compassionate and supportive, and genuinely committed to working together with the people who use our services, their families and carers in everything that we say and do.&lt;/p&gt;\n&lt;h2&gt;Our offer to you&lt;/h2&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. &lt;br /&gt; &lt;br /&gt; Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working where this is possible&lt;/li&gt;\n&lt;li&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service withtheNHS so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Living here&lt;/h2&gt;\n&lt;p&gt;Devon offers beautiful coastal and countryside locations with a wide range of social &amp; leisure opportunities. This ranges from some of the best beaches in the Country, The Moors, Canals and rivers all of which can be accessed easily via foot, car, bike or boat.&lt;/p&gt;\n&lt;p&gt;Great place to work. Great place to live&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235671", "validThrough": "2020-11-30T23:59:59+0000"}