{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-08T11:00:29+0100", "description": "&lt;p&gt;&lt;strong&gt;Community Staff Nurses&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are pleased to announce fantastic opportunities for Registered Nurses who wish to develop their career within our energetic and highly skilled District Nursing teams.&lt;/p&gt;\n&lt;p&gt;The posts involve delivering skilled and evidence-based care to patients within their home environment who can have very complex needs. Our District Nursing teams work closely with specialist nurses and Drs, GPs, Therapists and Social Work teams in providing and facilitating collaborative support and care to patients and their families and in preventing avoidable hospital admissions.&lt;/p&gt;\n&lt;p&gt;The individuals we are looking for will be highly motivated, enthusiastic and innovative who pride themselves in delivering exceptional standards of quality care and have the ability to embrace the challenges of the changing and growing demands of the primary care setting.&lt;/p&gt;\n&lt;p&gt; Previous community experience is not essential as full training and support will be provided to the right candidates. We offer a robust induction package, competency frameworks as well as development and training programmes. These will include individual and personalised support, coaching and assessment from our Quality Improvement Lead in order to maximise your full individual potential.&lt;/p&gt;\n&lt;p&gt;We welcome applications from student and newly qualified nurses and are able to offer an excellent preceptorship programme and the allocation of a buddy mentor within the teams.&lt;/p&gt;\n&lt;p&gt;We have a clear career development pathway with opportunities to band 6 Deputy District Nurse posts which allow you to continue developing your clinical, leadership and theoretical skills in District Nursing Practice while undertaking further seconded study to achieve the District Nurse Specialist Practitioner qualification.&lt;/p&gt;\n&lt;p&gt;You will need to be able to meet the demands of this service by being available to work flexibly between the hours of 07.00 to 23.00 hours on a rota basis over a 7 day period and you need to be able to drive.&lt;/p&gt;\n&lt;p&gt;The interview will be carried out remotely.&lt;/p&gt;\n&lt;p&gt;We have full &amp; part time posts available across the boroughs (Shirley, Rural &amp; North)&lt;/p&gt;\n&lt;p&gt;We would welcome informal discussions, please contact;&lt;/p&gt;\n&lt;p&gt;Kelly Frail, Senior District Nurse (Shirley Team) 07812 162112, Zoe Makin, Senior District Nurse (Rurual Team) 07584 527944, Kim Drummond, Senior District Nurse (North Team) 07852 567356&lt;/p&gt;\n&lt;p&gt;Closing date: 08/11/2020&lt;/p&gt;\n&lt;p&gt;Interview date: 18/11/2020&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Solihull", "postalCode": "B91 2JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4171", "longitude": "-1.77436"}}, "title": "Band 5 - Community Staff Nurse CS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217945", "validThrough": "2020-11-08T23:59:59+0000"}