{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "£0.00"}}, "datePosted": "2020-11-03T10:35:36+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Voluntary Car Drivers&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Location: Canterbury,CT3 3DW&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Voluntary Car Service (VCS) is a critical part of any solution to improve experience for patients who have to travel to and from hospital for treatment. Volunteer drivers offer practical and convenient transport for patients who are able to walk, but need transport to and from their homes, hospitals, clinics, and other health premises.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The great advantage&lt;/strong&gt; of our volunteer drivers is that we can offer patients regular transport with the same driver. Our patients prefer to see the same person when possible where a genuine understanding of individual needs and circumstances can be appreciated on both sides in a friendly way. Some of our volunteer drivers and patients have become great friends over time. We understand that our volunteers may only be able to do certain times/days and will work with you to fit around your availability.&lt;/p&gt;\n&lt;p&gt;If you have some time and are looking for a vocation that provides real satisfaction that will make a real differences to people’s lives, then this is a role that might suit you.&lt;/p&gt;\n&lt;p&gt;If you are interested in becoming a Volunteer Driver, we would dearly love to hear from you. Our drivers, and the service they provide, is invaluable to the community we all serve.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Suitability and Vehicle Criteria:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As our drivers will be looking after patients during their journeys we need to ensure some simple criteria can be met which are:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Volunteer Drivers must hold a full driving licence appropriate for the type of vehicle being driven and upon which there must be no more than six penalty points.&lt;/li&gt;\n&lt;li&gt;Applicants will need to be contactable by mobile telephone and own or provide a 4-door vehicle not more than 5 years old in a clean and suitable condition for the carriage of patients.&lt;/li&gt;\n&lt;li&gt;An original copy of the vehicles current valid MOT certificate, if required, insurance certificate, and breakdown cover.&lt;/li&gt;\n&lt;li&gt;It is also important that all Volunteer Drivers notify their insurance company of the type of work being undertaken by them.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Person Criteria:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In line with our safeguarding policies, potential drivers will be asked for two character references and a DBS check will be carried out. We can carry this out at a place closest to you, and there will be no cost to you.&lt;/p&gt;\n&lt;p&gt;Volunteer Drivers are often required to assist patients into and out of the vehicle. There may also be suitcases, walking aids and personal belongings to be carried for patients, therefore Volunteer Drivers need to enjoy general good health and be physically able.&lt;/p&gt;\n&lt;p&gt;The aim of G4S is to find drivers who are closest to the patient therefore drivers generally undertake local, mid-range requests, and are free to opt in or out of long distance requests .&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tax Free Expense claims:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For this valuable service reimbursement for mileage incurred is currently set by the government at £0.45p/mile with a maximum tax free allowance of 10,000 miles per annum.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Example of Earnings&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tax free earnings up to 10,000 miles at £0.45p/mile. There are many examples but using say a driver doing 1000 miles/month, will provide £450.00 plus any expenses in return for 10 months.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131154.JPG", "name": "G4S", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Canterbury", "postalCode": "CT3 3DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2226", "longitude": "1.19144"}}, "title": "Voluntary Car Driver- Canterbury", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253488", "validThrough": "2020-11-16T23:59:59+0000"}