{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "tbc"}}, "datePosted": "2020-10-28T11:46:30+0000", "description": "&lt;p&gt;&lt;strong&gt;DUDLEY INTEGRATED HEALTH AND CARE&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Title: &lt;/strong&gt;First Contact Podiatrist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Dudley PCNs&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;Primary Care&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band: &lt;/strong&gt;7&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Up to 37.5 hour per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type: &lt;/strong&gt;Permanent&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dudley Integrated Health and Care NHS Trust is the first Integrated Care Provider in the country. It was launched in April 2020 following a period of development and integrates primary care with community services across within our healthcare system. Our aim is Dudley first…… community where possible and hospital where necessary and our purpose is to improve the health and wellbeing of our local population in Dudley.&lt;/p&gt;\n&lt;p&gt;People are living longer, with more complex health issues which brings increasing financial pressures on health services and these are mirrored locally. The local health and care system recognises that to really meet these challenges we must take a longer view, they are not things that can be fixed overnight and we need to look at new ways of thinking and doing to make the difference that we have not been able to make to date. This requires changes to the way that we provide services to meet the changing needs of our local population.&lt;/p&gt;\n&lt;p&gt;Dudley is an area that has risen to that challenge. We are working differently to make the changes required, to think about solutions and make them happen. We have established teams without walls who focus on the person at the centre and their care needs and our aim is to wrap community and primary care services around the needs of the population.&lt;/p&gt;\n&lt;p&gt;We are looking for exceptional individuals with the drive and enthusiasm to change how healthcare is delivered and make a real difference to the people we serve. We are looking for people unafraid to challenge the norm and to innovate new ways of delivering care whilst engaging and managing their teams to feel passionate about improving patient experience.&lt;/p&gt;\n&lt;p&gt;We are currently looking for B3 Foot Care Specialists and B7 First Contact Podiatrist to add to our workforce within the Dudley PCNs&lt;/p&gt;\n&lt;p&gt;Dudley Integrated Health and Care NHS Trust presents the unique opportunity to welcome staff into a new type of NHS Trust where they can work in partnership with others to create A Great Place to Work.&lt;/p&gt;\n&lt;p&gt;For further information about the role please contact Alec Gandy, alec.gandy1@nhs.net&lt;/p&gt;\n&lt;p&gt;The closing date for applications is 25/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlec GandyEmail addressalec.gandy1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dudley Wide PCNs, Dudley", "postalCode": "B70 9PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5193", "longitude": "-2.0188"}}, "title": "First Contact Podiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246395", "validThrough": "2020-11-10T23:59:59+0000"}