{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-06T09:00:32+0000", "description": "&lt;p&gt;The District Nursing service covers the 5 localities of Burnley, Pendle Rossendale, Hyndburn and Ribblesdale and provides personalised nursing care to patients within these geographic locations who are housebound. The service operates 365 days per year and teams work a shift system covering the hours of 07:30-22:00.There is a separate Community Night Nursing team. We work as part of the wider multidisciplinary team including the Integrated Neighbourhood Teams,Intensive Home Support Team, Primary Care, Bladder &amp; Bowel Service, Tissue Viability, Lower Limb Vascular Service, Palliative Care Team, Podiatry, Treatment rooms and Lymphoedema team.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for experienced Registered Nurses who have a passion for Community Nursing, to join the team during a time when the 10 year NHS Plan is promoting community care and out of hospital services as the driving force for patient centred care closer to home.&lt;/p&gt;\n&lt;p&gt;General duties:&lt;/p&gt;\n&lt;p&gt;Car driver with access to a vehicle for work is essential. Working as a member of the team, the post holder will provide holistic, high quality, clinically effective care to patients, working under the direction of the Team Sisters and Clinical Team Leaders. The post will involve shift work to include weekends, evenings, bank holidays and occasionally night working on a rota basis and lone working.&lt;/p&gt;\n&lt;p&gt;Nursing practice includes skills such as:&lt;/p&gt;\n&lt;p&gt;· Holistic assessment of needs&lt;/p&gt;\n&lt;p&gt;· Wound care&lt;/p&gt;\n&lt;p&gt;· End of life and palliative care (including care of central venous lines)&lt;/p&gt;\n&lt;p&gt;· Out Patient Intravenous Antibiotic Therapy&lt;/p&gt;\n&lt;p&gt;· Leg Ulcer management and compression therapy&lt;/p&gt;\n&lt;p&gt;· Diabetes management&lt;/p&gt;\n&lt;p&gt;· Bladder and bowel care (including catheterisation of males, females and supra-pubic)&lt;/p&gt;\n&lt;p&gt;· Safeguarding&lt;/p&gt;\n&lt;p&gt;· Mobile electronic working with access to EMIS patient records&lt;/p&gt;\n&lt;p&gt;· Link nurse roles&lt;/p&gt;\n&lt;p&gt;Type of candidate:&lt;/p&gt;\n&lt;p&gt;The successful candidate must demonstrate excellent clinical and communication skills to provide a high standard of care, and to ensure a positive patient experience. An enthusiasm for patient centred care, service development and multi-agency working is important. Experience in community care is an advantage however the post is also suitable for newly qualified nurses who have completed an internship placement in community as part of their pre-registration training. The post holder will be supported to develop their role to meet the changing needs of the service and their own professional development goals. We are looking for experienced nurses with personal and professional integrity and an ability to work autonomously in a supportive team environment.&lt;/p&gt;\n&lt;p&gt;We welcome enquiries regarding the post and informal visits can be arranged&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen DaviesJob titleMatron CIC Division - District NursingEmail addressHelen.davies2@elht.nhs.ukTelephone number01254 736314&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ribblesdale: East Lancashire Hospitals Trust, East Lancashire", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258953", "validThrough": "2020-12-06T23:59:59+0000"}