{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-23T09:30:55+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;6 Are you passionate about making a difference and leading change?&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Bradford District Care Foundation Trust is a mental health and community services NHS Trust covering the Bradford, Airedale, Craven and Wakefield areas. We aim to deliver services that build better lives, together. Our values to listen, care and deliver are at the heart of everything we do. This exciting new opportunity to join the Trust as a Band 6 Equality, Diversity and Inclusion Lead is an integral role in delivering our goals to be the best place to work, ensure our communities are as health as possible, deliver the best quality services and have provide seamless access for all. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a Band 6 Equality, Diversity and Inclusion Lead to be part of a small team reporting to the Head of Equality within the Human Resources and Organisational Development. You will work closely with people from across the organisation to embed the Trusts exciting and ambitious Equality, Diversity and Inclusion plans and strategies and lead culture and system change. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity to become part of a small team making big change supporting the organisations compliance with the Equality Act, NHS Workforce Standards and the Covid-19 Phase Three Implementation Plan. Working closely in partnership with the Head of Equality, champions, staff and managers from across the organisation you will develop and implement initiatives that reduce workforce and health inequalities. You will lead on some specific projects for example the Trusts career development programme Moving Forward Plus. You will work closely with the Trust Board, staff side representatives and staff and service users networks to engage on key equality issues co-producing pathways to change.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you have are passionate about equality, diversity and inclusion and have experience promoting and sustaining culture change around equality, diversity and inclusion we would like to hear from you. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Shortlisting date: 30th November &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Provisional interview date: 7th December&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Wright, Head of Equality&lt;br /&gt;lisa.wright@bdct.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120637.jpg", "name": "Bradford District Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120637"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Mill (though the post holder will be expected to work from home), Bradford", "postalCode": "BD18 3LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8389", "longitude": "-1.78913"}}, "title": "Equality Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239830", "validThrough": "2020-11-29T23:59:59+0000"}