{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 plus £149 HCAS pa"}}, "datePosted": "2020-10-20T17:10:00+0100", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Consultants in Respiratory Medicine&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This is an exciting opportunity based at Ashford and St Peter’s Hospitals to become part of the Respiratory Team. The successful applicant to this post will work alongside 6 consultant colleagues to provide core respiratory services.&lt;/p&gt;\n&lt;p&gt;The respiratory department is an active and forward‐looking team currently composed of 6 consultants, two Respiratory specialist registrars, one clinical fellow and a team of core medical trainees, foundation trainees and trust grade doctors. The successful candidate will join our existing team of consultant respiratory physicians to deliver a 5 day a week specialist respiratory service for inpatients, to take part in intervention lists such as bronchoscopies, thoracoscopies and ambulatory pleural lists and to help achieving the national cancer targets. Bronchoscopy, EBUS, Medical Thoracoscopy and Sleep Apnoea services are provided at St Peter’s Hospital. Respiratory outpatient clinics are run across both sites.&lt;/p&gt;\n&lt;p&gt;The respiratory team will provide a consultant delivered Specialist Respiratory in-reach service during weekdays for acute admissions and take part in GIM on calls . The post holders will also deliver out‐patient respiratory clinics including supporting cancer target with specialist TWR clinics. The team is supported by dynamic specialist Lung Cancer, TB, Asthma nurses and physiotherapists who deliver domiciliary NIV service. In addition to this physiologist, based in lung function lab, conduct independent CPAP clinics. The team supports community Respiratory Care Team who help to deliver care for patients with COPD, asthma, ILD, NIV.&lt;/p&gt;\n&lt;p&gt;For more information please contact Dr Shashank Sharma – Clinical Lead on shashank.sharma@nhs.net or Bernadett Balogh – Assistant Service Manager on b.balogh@nhs.net or 01932723924&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Consultants in Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235400", "validThrough": "2020-12-06T23:59:59+0000"}