{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-31T17:08:42+0000", "description": "&lt;p&gt;&lt;span&gt;We are currently looking to recruit a dynamic, enthusiastic, motivated and forward thinking Clinical Nurse Specialist (CNS) in Endocrinology for a fixed term period of 12 months. This excellent opportunity is open to experienced registered nurses with at least 5 years experience in acute care setting. Successful candidate will join a team of experienced specialist nurses in a tertiary Endocrine referral centre and will be given full structured training and supervision to develop his/her skills in Endocrinology. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The department has close links with the University of Birmingham, Birmingham Children’s and Women’s Hospital. The CNS team works in close collaboration with endocrine consultants, endocrine surgeons, neurosurgeons, oncologists, paediatricians, obstetricians, gynaecologists, rheumatologists, renal clinicians and other clinical nurse specialists within the Trust. The service centres around a busy outpatient department located at UHB, and the post holder will support the Late Effects service and other endocrine clinics including day case activities by performing dynamic function testing. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must be registered with the NMC with recognised nursing qualification and proven experience in acute care setting. Experience in Endocrinology is highly desirable. Applicants must be competent in cannulation, venepuncture, intravenous therapy and ECG. Nurse prescribing qualification is desirable but not essential. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants are invited to contact Sherwin Criseno (Lead Nurse in Endocrinology) on 0121-371-6950 or e-mail Sherwin.criseno@uhb.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Clinical  Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251144", "validThrough": "2020-11-18T23:59:59+0000"}