{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-16T13:31:17+0100", "description": "&lt;p&gt;&lt;strong&gt;Clinical Psychologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Area: Adult Mental Health &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band: 8a &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Full time (37.5 hours per week) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Service: Adult Acute Inpatient Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Brooker centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced Clinical/Counselling Psychologist within the Adult Mental Health Inpatient Speciality. We welcome applications from experienced band 7’s and current 8a’s who are looking to broaden and further develop their expertise.&lt;/p&gt;\n&lt;p&gt;The post will work with the support of an established assistant psychologist into two busy adult acute in-patient services based at the Brooker Centre. The post-holder will provide specialist assessment, formulation, intervention and evaluation, alongside staff training and reflective practice, staff supervision and consultation, advice and support to one male and one female inpatient acute ward. This is a great opportunity for applicants with a specific interest in team working and promoting positive and least restrictive care. The post holder will support the existing inpatient wards multi-disciplinary leadership teams and have a keen interest in service/team development and supporting our inpatients care pathways. Both teams are keen on proactive care and have adopted team innovative practices such as the Self-harm Pathway on the female ward and the Substance Misuse pathway on the male ward, with positive behavioural support approaches underpinning the care delivered across both wards.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join with other inpatient psychologists for clinical supervision, CPD opportunities and clinical leadership guidance and will receive managerial supervision from the Clinical Team Manager&lt;/p&gt;\n&lt;p&gt;Please ensure you read the job description and person specification attached below and that your supporting information reflects this as your application will be judged against these criteria.&lt;br /&gt;&lt;br /&gt;All successful applicants will be notified via the email address provided and all further correspondence will be through email, therefore please ensure that you regularly check your emails after the closing date for this post. Please note that we would be grateful if you could provide us with email addresses for your referees when prompted by the application form.&lt;br /&gt;&lt;br /&gt;If you do not receive any correspondence from us within 2 weeks of the closing date, Please assume that on this occasion you have not been successful at the short-listing stage.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is subject to an enhanced check with adults barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50, the cost of which will be deducted from first salary.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Georgia Konstantinou – Inpatient Counselling Psychologist on 01928 753852 or georgia.konstantinou@nwbh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Debbie Murray, Clinical Team Manager on 01928 753852 or email Debbie.Murray@NWBH.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brooker Centre, Runcorn", "postalCode": "WA7 2DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3233", "longitude": "-2.69459"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230419", "validThrough": "2020-11-08T23:59:59+0000"}