{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 Per Annum Pro Rata"}}, "datePosted": "2020-10-30T14:00:20+0000", "description": "&lt;p&gt;Staff Nurse&lt;/p&gt;\n&lt;p&gt;Would you like to have a 12 month fixed term contract to work with the amazing Plym Covid ED team with the possibility of a full time contract to stay and work in the South West&lt;/p&gt;\n&lt;p&gt;Have you ever wanted to live in a diverse and forward thinking city whilst also having the option to escape to the countryside or beach without having to travel for miles? Well, Plymouth boasts both a beautiful scenic coastline whilst also being just a stone’s throw from Dartmoor National Park.&lt;/p&gt;\n&lt;p&gt;Are you a dynamic and motivated individual? Could you provide expert care for all patients from all walks of life? Could you hold the hand of a patient who is scared? Could you remain calm and collected while looking after patients attending with covid symptoms with in Plym covid ED during the second wave of the national Pandemic ? If so then we want you in our Plym ED unit looking after those that are unwell with Covid symptoms.&lt;/p&gt;\n&lt;p&gt;As a band 5 within this department the successful candidate’s role would need excellent written and verbal communication skills as well as ensuring patient safety, equipment maintenance, working as part of an inter-professional team including doctors, nurses and other allied health professionals. We are looking for applicants who share our vision and passion to provide all patients with high quality specialist care whilst remaining open minded and embracing the fast paced and ever changing nature of the covid Department.&lt;/p&gt;\n&lt;p&gt;As a band 5 this role will include basic patient care and the assessment of all patients that attend the department, with the scope to build your skills with venepuncture, cannulation, taking ECG’s, plastering and patient assessment. Within this role you will required to rotate through the department working within plym , majors, resuscitation and you will also be expected to rotate between day, night and weekend duty.&lt;/p&gt;\n&lt;p&gt;Our emergency department within University hospitals Plymouth NHS trust is also classified as a Major Trauma Centre. We see approximately 100,000 adult and paediatric patients per year, from both rural and urban environments. We in the ED pride ourselves on being a friendly and supportive team with a reputation of giving high quality care to our patients, relatives and staff. As a department we pride ourselves on ensuring all our staff are supported in all aspects of their role, with education and development opportunities arising all the time.&lt;/p&gt;\n&lt;p&gt;Interview date 11th Novembver 2020&lt;/p&gt;\n&lt;p&gt;***Preference will be given to internal Trust staff, as well as ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon who are able to display recent relevant experience as dictated by the Person Specification.***&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250447", "validThrough": "2020-11-08T23:59:59+0000"}