{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-27T13:09:55+0000", "description": "&lt;p&gt;Nuffield Health, the UK’s largest not for profit healthcare provider, is seeking an Emotional Wellbeing Therapist/ Psychological Wellbeing Practitioner (PWP) based from home, but the successful candidate must be able to travel across the East Midlands. &lt;br /&gt;&lt;br /&gt;As a PWP you will support the delivery of a range of Cognitive Behavioural Therapy (CBT) based psychological interventions and stepped care treatment in a private care setting to people with common mental health problems – this will include Telephone Triage, Video Therapy, Guided on line therapy and Wellbeing training, both on a one to one basis or in a group setting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To succeed as a PWP, you will need:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Tohave already successfully completed a British Psychological Society (BPS) accredited certificate course as a PWP and can demonstrate experience in the delivery of low intensity, evidence-based interventions in a primary or private care context.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In addition to being a qualified PWP with a Post Graduate Certificate in Low Intensity Interventions you will also have the following skills:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Have evidence of working with people who have experienced a mental health problem.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be able to work with high caseloads and have experience of working to performance targets.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be familiar with a step-care approach to Therapy&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be flexible to work at a variety of locations including home&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Our Benefits&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;In return, we offer a working environment that will help you grow your skills and experience and get the best out of life. Other benefits include 25 days’ annual holiday (increasing with service), gym membership, private healthcare and a range of lifestyle and financial wellbeing benefits.&lt;br /&gt;&lt;br /&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - Up to £25,000 per annum (dependant on experience)&lt;br /&gt;Closing date - 24/11/2020&lt;br /&gt;Location - Home Based and across Nuffield site in the East Midlands&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type - Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours - Full or part time roles available (Flexible roster 8am to 7pm Monday to Friday)&lt;/strong&gt;&lt;strong&gt; with a minimum of 3 days per week.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Home based &amp; across Nuffield sites in the East Midlands", "postalCode": "DE74 2SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8261", "longitude": "-1.32962"}}, "title": "Psychological Wellbeing Practitioner (PWP) - East Midlands", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244667", "validThrough": "2020-11-24T23:59:59+0000"}