{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-15T09:46:02+0100", "description": "&lt;p&gt;We are looking for a dynamic and motivated Consultant in Medical Microbiology to join the team at the North Cumbria Integrated Care NHS Foundation (NCIC) Trust. Our responsive and forwardthinking department is looking for a full-time microbiologist (10 PAs) to become a member of a team of four consultants based in the Department of Infection Sciences at the Cumberland Infirmary, Carlisle (CIC).&lt;/p&gt;\n&lt;p&gt;The Department of Infection Sciences consists of Microbiology, Virology, and Immunology, centralised at CIC. The department provides services for the Cumberland Infirmary, Carlisle and West Cumberland Hospital (WCH), Whitehaven, and for GP and community hospital services in west, north, and east Cumbria. The department has been accredited by UKAS against the ISO 15189 standard.&lt;/p&gt;\n&lt;p&gt;This replacement post is based at the Cumberland Infirmary, Carlisle. The successful candidate will be expected to work across the two hospital sites (CIC and WCH) to provide clinical advice, antimicrobial stewardship, and infection prevention and control services. The out-of-hours on-call duty is shared equally between four consultants.&lt;/p&gt;\n&lt;p&gt;Informal enquiries can be made by contacting: Dr Ed Barton, Consultant Microbiologist e-mail: edward.barton@ncic.nhs.uk tel: 01228 814640&lt;/p&gt;\n&lt;p&gt;or&lt;br /&gt;Dr Fergus Young, Clinical Director e-mail: fergus.young@ncic.nhs.uk tel: 01228 814534&lt;/p&gt;\n&lt;p&gt;Relocation assistance of up to £8,000 may be available for successful applicants moving to the region. As a Consultant you will be required to participate in Consultant Appraisal and Job Plan Reviews on an annual basis and the revalidation process in line with your professional registration.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to work across the two hospital sites (Cumberland Infirmary Carlisle and the West Cumberland Hospital, Whitehaven). Please see full job description and personal specification for details.&lt;/p&gt;\n&lt;p&gt;Closing date - 11th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlisle &amp; Whitehaven", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Consultant in Microbiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227553", "validThrough": "2020-11-11T23:59:59+0000"}