{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 gross per annum"}}, "datePosted": "2020-10-23T14:43:51+0100", "description": "&lt;p&gt;Are you someone who is passionate about delivering compassionate &amp; individualised care, driving quality improvement and looking to add value to an inpatient mental health team?&lt;/p&gt;\n&lt;p&gt;Waveney is a 17 bedded female Acute Ward at Hellesdon Hospital and we have an exciting opportunity for a mental health staff nurse with a passion for caring, creative thinking and promoting recovery. Whether you have been nursing for years or recently or just about to qualify we would like to hear from you about the possibility of you joining our team.&lt;/p&gt;\n&lt;p&gt;Waveney ward is very proud to be leading 3rd in the country for reducing restrictive practices and we pride ourselves on being a very hard working, friendly team.&lt;/p&gt;\n&lt;p&gt;If you are passionate about providing high quality care and wish to make a positive difference to service users and colleagues alike, then we would love to hear from you! You will play a vital role in helping to develop the service to provide holistic care and support to service users and carers. Are you proactive, positive and professional? Help us to get better together.&lt;/p&gt;\n&lt;p&gt;If you have the qualities described above then we want you to think about coming to be part of our team. We welcome informal discussions and would love you to get in touch to talk about the opportunities available.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Benefits included with this role are:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;A comprehensive in house &amp; external training programmes&lt;/li&gt;\n&lt;li&gt;Career progression&lt;/li&gt;\n&lt;li&gt;Starting annual leave of 27 days per annum increasing to 33 days pa based on length of service (plus paid bank holidays)&lt;/li&gt;\n&lt;li&gt;Staff physio service&lt;/li&gt;\n&lt;li&gt;Gym membership&lt;/li&gt;\n&lt;li&gt;NHS discounts and many more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To find out more about the job role click the job description, then click APPLY to start your candidate experience today!&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interview dates are to be confirmed, candidates may only be given a minimum of 3 days’ notice, please note this date is provisional and may be subject to change. You will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NSFT is committed to lifelong learning and continuous professional development (CPD) for its entire staff. There are a variety of definitions of CPD across the professions but it is usually taken to mean learning activities which update existing skills. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CPD is determined through appraisal with a personal development plan agreed between an individual and their manager, with the commitment of the necessary time and resources. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are working hard to maintain usual recruitment process however please be aware that we may ask you to be interviewed via MS Teams rather than in person. Please also bear with us as we endeavour to recruit as many people as we can in unprecedented times.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah Hamilton - Ward Manager sarah.hamilton@nsft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01603 421665&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hellesdon Hospital, Norwich", "postalCode": "NR6 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6596", "longitude": "1.25089"}}, "title": "Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240975", "validThrough": "2020-11-06T23:59:59+0000"}