{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 Pa Inc"}}, "datePosted": "2020-10-23T18:30:23+0100", "description": "&lt;p&gt;&lt;strong&gt;Cardiology Band 6 Sister/Charge Nurse Vacancy&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hammersmith Hospital - Heart Assessment Centre (HAC)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Imperial has 5 cardiac catheter laboratories. 3 interventional labs that treat patients undergoing elective angiography, heart failure, complex stenting, rotablation, transcatheter valve implantation (TAVI). In addition to 2 dedicated electro physiology laboratories where patients undergo cardiac resynchronisation (CRT) device implantation and ablations.&lt;/p&gt;\n&lt;p&gt;The Heart Assessment Centre (HAC) is 9 short stay cardiology beds with an additional 3 assessment beds receiving patients via LAS as part of Imperial&#39;s 24/7 Primary PCI service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 Sister/Charge Nurse – Heart Assessment Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Heart Assessment Centre (HAC) is the front door to Cardiology at Imperial receiving patients directly from the London Ambulance Service, tertiary referral hospitals and A &amp; E. Working on this unit is both exciting and challenging. Due to the high turnover of patients you are required to be quality focused and an effective time manager.&lt;/p&gt;\n&lt;p&gt;We are seeking a Band 6 Sister/Charge Nurse and are keen to hear from experienced nurses who can assist with our quality agenda, raise standards and provide both emergency and elective cardiology care.&lt;/p&gt;\n&lt;p&gt;We are looking for innovative, highly motivated individual with a passion for cardiology with previous experience in cardiology/HAC and CCU.&lt;/p&gt;\n&lt;p&gt;A relevant specialist course and mentorship course in addition to ILS, venepuncture and cannulation skills are essential for this post. ECG interpretation skills are a prerequisite for all candidates.&lt;/p&gt;\n&lt;p&gt;This role requires the successful candidate to hold the cardiology bed bleep out of hours and work collaboratively throughout the cardiology inpatient areas, ensuring patient flow is maintained. Experience of leading a clinical shift is essential.&lt;/p&gt;\n&lt;p&gt;The successful candidate must be pro-active and take a lead in mentoring others whilst supporting the development of the cardiology service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Post is full time and requires flexibility in working, supporting/rotating to other clinical areas when required. Shift pattern: internal rotation of long days and night duty.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a flexible approach to working hours to meet the needs of the individual and the service. Please talk to us at interview about the flexibility you may need.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Sarah Storey – Cardiology Matron. Tel: 0203 313 3403 Email: sarah.storey1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hammersmith Hospital, London", "postalCode": "W12 0HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5165", "longitude": "-.236635"}}, "title": "Band 6 Sister Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241492", "validThrough": "2020-11-06T23:59:59+0000"}