{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "109830", "minValue": "82022", "unitText": "YEAR", "value": "£82,022 - £109,830 per annum, inc London Weighting"}}, "datePosted": "2020-10-16T16:02:00+0100", "description": "&lt;p&gt;King’s College Hospital NHS Foundation Trust is one of the UK’s largest and busiest teaching hospitals with over 1.5 million patient contacts a year and more than 13,000 staff based across five main sites in South East London and Kent. The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup. The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major traum, and Emergency Department.&lt;/p&gt;\n&lt;p&gt;King’s is a key partner in one of London&#39;s foremost Academic Health Science Centres, King&#39;s Health Partners (KHP). KHP is one of only six Department of Health-designated AHSCs in England. It brings together a world-leading research-led university – King’s College London – and three successful NHS Foundation Trusts: King’s College Hospital, Guy’s and St Thomas’, and South London and Maudsley.&lt;/p&gt;\n&lt;p&gt;We are looking for dynamic individuals to join King’s as Acute Consultant Physician. The post(s) will allow us to expand the Acute Medicine department and provide support to the Modernising Medicine transformation project, which will build upon areas of good practice at King’s and drawing on innovative practices at a regional and a national level. The transformational context of this role presents a unique opportunity to co-design and deliver a best practice in acute and general patient care delivery.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join and support a friendly and engaged team of 12, with responsibility for the management of acutely ill medical patients. This may include establishing early plans for future management through ambulatory emergency care or hot clinics, admission to our AMUs or a referral to specialist clinics. You will work closely with our colleagues from Emergency Medicine and other medical sub-specialties and with primary care and community services. The post will include the requirement to contribute to the out-of-hours on call rota and deliver seven-day care. We are an expanding and evolving service, join us and help develop a great clinical, academic and management team&lt;/p&gt;\n&lt;p&gt;You must be fully registered with the GMC and hold a Licence to Practice and be on the Specialist Register, or within six months of attaining your CCT or equivalent to be eligible for interview.&lt;/p&gt;\n&lt;p&gt;The postholder will have regular contact with vulnerable adults therefore this post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975, and as such, it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;Closing date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;Interview date: 26th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information or informal visits, please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Vivek Sharma, Clinical Lead for Acute Medicine on viveksharma@nhs.net or Maria del Busso, Service Manager for Acute Medicine on mdelbusso@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s College Hospital, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Consultant Physician – Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231022", "validThrough": "2020-11-08T23:59:59+0000"}