{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa (pro rata)"}}, "datePosted": "2020-10-19T14:31:50+0100", "description": "&lt;p&gt;The Urgent and Primary Care Division, which is part of Wirral Community Health and Care Foundation Trust, is seeking a dynamic, flexible and highly motivated individual with a passion for exceptional clinical care and leading by example. The post holder will work closely with the Divisional Manager, the Clinical Quality Lead and the other Lead Nurse to continue to maintain existing quality and excellent delivery of services. This is a key and exciting post within the Divisional Senior Leadership team.&lt;/p&gt;\n&lt;p&gt;The post is fundamental for clinical leadership and the assurance around quality delivery of services across the Urgent treatment center and Eastham primary care hub&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for supporting clinical and quality delivery of urgent care services within the Division and for supporting strategic leadership, with visibility at service level.&lt;/p&gt;\n&lt;p&gt;The Lead Nurses will be fundamental in delivery of services that are delivered both in and out of hours. The Lead Nurse will support the Divisional Manager and Service Leads in delivering a range of services that provide both planned and unplanned services whilst working on developing new initiatives.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an individual who has experience in leading a clinical team at senior level and has a passion for urgent care. It comes at a time when the health economy has a real focus of delivering an urgent care agenda that is responsive to current pressures while supporting transformation change. The successful candidate will need to be both dynamic and resilient in leading the team to achieve these changes while maintain the excellent standards that are currently portrayed.&lt;/p&gt;\n&lt;p&gt;The Lead Nurse will identify and support growth with the implementation of projects and new services as well as supporting teams in existing models of delivery.&lt;/p&gt;\n&lt;p&gt;If you feel you have the skills, knowledge, drive and enthusiasm for this exciting post please apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Alison Hunt&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Quality Lead&lt;/p&gt;\n&lt;p&gt;Email address: alison.hunt5@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0151 514 2888 (ext. 6681)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126754.png", "name": "Wirral Community Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Urgent Treatment Center and Eastham Primary Care Hub, Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Lead Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232685", "validThrough": "2020-11-08T23:59:59+0000"}