{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14725", "minValue": "14725", "unitText": "YEAR", "value": "£8.76 Per Hour Free DBS check, Flu vaccination and"}}, "datePosted": "2020-10-15T10:16:57+0100", "description": "&lt;p&gt;Salary:£8.76 per hour&lt;/p&gt;\n&lt;p&gt;Desirable / Requirements:QCF Level 2 Health &amp; Social Care or willing to work towards&lt;/p&gt;\n&lt;p&gt;Hours of Work:Various, working on a rolling rota basis&lt;/p&gt;\n&lt;p&gt;Contract Type:Permanent&lt;/p&gt;\n&lt;p&gt;Benefits of Working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meals Provided, On-site parking, Free Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Enhancements for Night Shifts (+20p per hour night allowance), and Bank Holiday&#39;s (double pay)&lt;/li&gt;\n&lt;li&gt;Comprehensive Learning &amp; Development package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Company Funded Benefits: Free DBS check, Flu vaccination and Hepatitis B vaccination.&lt;/p&gt;\n&lt;p&gt;About the Role: We are currently recruiting for night, full time and part time team members. We also have bank opportunities for added flexibility.&lt;/p&gt;\n&lt;p&gt;The role of a Support Worker is to enable the residents to lead a meaningful life through the implementation of a person centred support plan. You will support them to achieve their full potential through well planned support and care that you will deliver as part of a dedicated, qualified and capable staff team who put the people living here at the heart of what we do. We strive to help people remain as independent as possible and to maximise their quality of life.&lt;/p&gt;\n&lt;p&gt;The ideal candidate for this post may have experience in learning disabilities and mental health issues (however this is not essential). Within this role you will be supported to develop an understanding of, medication procedures, safeguarding policies and person centred care.&lt;/p&gt;\n&lt;p&gt;If you are an experienced care worker or support worker, or if you feel you can make a real difference to the lives of others, we want to hear from you! Please complete the short application and upload your CV.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Llangwyfan", "postalCode": "LL16 4LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1846", "longitude": "-3.31823"}}, "title": "SUPPORT WORKER", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227685", "validThrough": "2020-11-14T23:59:59+0000"}