{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22199", "minValue": "20771", "unitText": "YEAR", "value": "£20,771 to £22,199 pa inc. HCAS"}}, "datePosted": "2020-10-22T14:30:26+0100", "description": "&lt;p&gt;&lt;strong&gt;Stroke and Neuro services Therapy Assistant &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hours: 37.5 per week over 7 days&lt;/p&gt;\n&lt;p&gt;Band: 3&lt;/p&gt;\n&lt;p&gt;Base: St Peter’s&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a Therapy Assistant to join our dynamic, friendly and supportive team of specialist physiotherapists and occupational therapists.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic, motivated person with physiotherapy or occupational therapy assistant experience, good communication skills and the ability to work with people as part of a multidisciplinary team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Stroke services have expanded at St Peter’s Hospital and in order to be able to collocate the hyper acute/acute stroke and rehab of stroke patients based at St Peter’s Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The stroke service is supported by a dedicated stroke multi-disciplinary team, who support the patient from their admission following a stroke through to their discharge from the hospital or for onward rehabilitation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will work predominantly with the physiotherapists and occupational therapists but will have an opportunity to work alongside the other health professions on the ward.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to manage their own clinical caseload under the supervision of the therapists and support the team with non-clinical duties and work closely with the other therapy assistants on the unit. Non-clinical duties will include; cleaning and maintenance of therapy equipment and treatment areas, and stock maintenance. Administrative support duties will include inputting data, stock management and managing email correspondence.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be expected to work flexibly at times across the other inpatient ward areas, which include medicine, stroke and elderly medicine on both hospital sites. Our primary objective is to ensure patient focused therapy that supports safe and successful discharges and our assistants are an integral part of this.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a positive approach to training and want our service and the staff within it to feel valued and supported. We offer all staff 1 day of CPD per month. You will be fully supported by the experienced therapists and be provided with regular training, formal supervision and appraisal.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be required to work your hours over a seven day period&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information please contact&lt;/p&gt;\n&lt;p&gt;Natalie Fearn, Team Leader, HASU &amp; ASU&lt;/p&gt;\n&lt;p&gt;Natalie.fearn@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Therapy Assistant - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238884", "validThrough": "2020-11-06T23:59:59+0000"}