{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "104927", "minValue": "91004", "unitText": "YEAR", "value": "£91,004 - £104,927 per annum"}}, "datePosted": "2020-11-06T13:46:25+0000", "description": "&lt;p&gt;CY Executive Resourcing are delighted to be working in conjunction with East Sussex Healthcare NHS Trust in the recruitment of this key leadership position, the Deputy Director of Finance (Band 9).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;East Sussex Healthcare NHS Trust provide safe, compassionate and high quality hospital and community care to the half a million people living in East Sussex or visiting our local area. They are one of the largest organisations in East Sussex with an annual income of £476 million. Their extensive health services are provided by over 7000 dedicated members of staff working from two acute hospitals in Hastings and Eastbourne, three community hospitals in Bexhill, Rye and Uckfield, over 100 community sites across East Sussex and in people’s own homes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In November and December 2019 the Care Quality Commission (CQC), the health and care services regulator, undertook their latest inspection of the quality of care and services at the Trust. The results, which were published in February, rated the Trust ‘Good’ overall, ‘Outstanding’ for Caring and ‘Outstanding’ for Effective. Against the backdrop of increased demand they have continued to build on the financial improvements they made last year by improving the quality, efficiency and effectiveness of the care they provide. As a result they exceeded their financial plan and these improvements led to them coming out of Special Measures for Finance in July 2019 and earned an additional FRF payment at year end to bring their final outturn to a small surplus of £50k.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It’s an exciting time to join the Trust as they plan for the £500m investment that has been committed to ESHT over the next decade, through their ‘Building for the Future’ programme. These extensive plans over the next decade will leave no part of the Trusts hospital infrastructure left untouched. They are aiming to provide a new hospital at Eastbourne; new medical wards and refurbishment at Conquest and a new clinical building at Bexhill.&lt;/p&gt;\n&lt;p&gt;Responsible to the Chief Finance Officer , the Deputy Director of Finance will have overall strategic leadership and performance management of the Finance and Procurement Directorate, ensuring department systems and processes are fit for purpose and staff are trained and equipped to ensure delivery of statutory financial duties.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Senior Member of the Finance leadership team, delivery against the Trust’s corporate objectives is paramount. As Deputy Director of Finance you will ensure the department contributes to the Trust’s efficiency targets as agreed during the annual business planning process, which has a major impact on the ability of the Trust to deliver patient services, on time, within corporate and clinical governance and within budget.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Deputy Director of Finance will deputise across the full range of duties undertaken by the Chief Finance Officer both within and outside the Trust. You will advise and influence Executive/Non-Executive Directors and senior managers on highly complex, multi health economy/Trust wide/directorate, financial and wider performance issues, influencing decision making to achieve specific outcomes that impact the achievement of Trust strategies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For the right candidate this will be a career enhancing opportunity to work collaboratively as a professional leader, whilst gaining substantial personal and professional development in a supportive and inclusive environment. You will be a natural leader who displays resilience and scale, who can motivate and engage your staff whilst also building strong relationships with a range of stakeholders and partners.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Deputy Director of Finance will be CCAB qualified with extensive financial management experience within a large and complex Organisation and come with an outstanding track record of delivering.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information and a confidential discussion please speak to Kurt Rimell-Lejeune at our recruitment partners CY Executive Resourcing on 01216326776 or kurt@cyresourcing.com&lt;/p&gt;\n&lt;p&gt;Formal applications are to be made strictly in the same way, to kurt@cyresourcing.com&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKurt Rimell - LejeuneJob titleManaging Partner CY Executive ResourcingEmail addressKurt@cyresourcing.comTelephone number07531 140479&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross site, East Sussex", "postalCode": "BN21 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.787", "longitude": ".271136"}}, "title": "Deputy Director of Finance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259982", "validThrough": "2020-11-22T23:59:59+0000"}