{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43500", "minValue": "43500", "unitText": "YEAR", "value": "£43,500"}}, "datePosted": "2020-11-05T11:01:33+0000", "description": "&lt;p&gt;&lt;em&gt;Step 3 High Intensity Team Leader&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Everyone&#39;s Turning Point is unique. It&#39;s the moment when they realise they&#39;ve made a small, but important, step forward. Very often, that small step is the start of something bigger. But only when the right support, advice and services are in place. That&#39;s where you come in, working as part of Turning Point Luton Total Wellbeing Service.&lt;/p&gt;\n&lt;p&gt;We support people who are having difficulty in coping and who may be suffering from a common mental illness such as depression, anxiety or phobias. Our approach embeds the notion of well-being and recovery and promotes personal responsibility for lifestyle choices and self-management of mental well-being. For our clients, this has resulted in a highly accessible and user-friendly service available across a wide geographical area.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a High Intensity Step 3 Team Leader, with a qualification in CBT; you&#39;ll be a trained accredited therapist. Alongside vast experience of working within Mental Health, you&#39;ll also have experience of leading and managing teams with a proven ability to develop good therapeutic relationships with clients and working relationships with your colleagues. You&#39;ll also manage your own caseload and inspire your team to meet both service and individual targets, having an IAPT Supervision Course under your belt would be helpful too- but not essential.&lt;/p&gt;\n&lt;p&gt;In return for your experience and commitment Turning Point offer a range of benefits&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive Learning and Development opportunities – we are Investors in People Silver accredited&lt;/li&gt;\n&lt;li&gt;28 days holiday, increasing with each year of service until 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including, bike to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive Pension and Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme and access to online Health and Wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work/life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts including Cinema, Groceries and Gym.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you&#39;re inspired by the social model of mental health that works holistically according to need rather than diagnosis and would like to help us achieve our vision, we can offer a competitive remuneration package and excellent training and development opportunities.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Luton", "postalCode": "LU2 0JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8856", "longitude": "-.408859"}}, "title": "CBT Team Leader - Total Wellbeing Luton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257357", "validThrough": "2020-12-03T23:59:59+0000"}