{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38890", "minValue": "38890", "unitText": "YEAR", "value": "From £38,890 per annum"}}, "datePosted": "2020-10-27T11:02:30+0000", "description": "&lt;p&gt;The Nexus Service within HMP Eastwood Park aims to deliver the high level objectives of reducing re-offending, improving psychological well-being and developing the workforce.&lt;/p&gt;\n&lt;p&gt;The Nexus service encompasses a residential PIPE treatment service (Psychologically Informed Planned Environment), a Day treatment service and an Outreach service (to other parts of the prison). Individuals accessing the Day treatment service engage in psychological treatment to help understand the origins and nature of their difficulties, and develop an individualised treatment plan. Individuals accessing the Outreach service may not be ready to access treatment in the day service and may have previously experienced difficulties in engaging with services. They may regularly be in crisis and have involvement from other services within the prison.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a Forensic, Clinical or Counselling Psychologist to join the existing multi-disciplinary team. They will be located within the prison to support the delivery of all aspects of the Personality Disorder Service. The role will include assessment, formulation and intervention (1:1 and group) with offenders, in addition to offering consultation and supervision to other agencies and colleagues as appropriate. The post-holder will also take on other duties in the team as required, including conducting risk assessments, audit and service evaluation.&lt;/p&gt;\n&lt;p&gt;The post-holder should have a relevant qualification with registration, and ideally experience of working with service users with personality/complex needs. Experience of working with female service users in a forensic setting would be advantageous, although not essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Cat Shanahan, Day Service Clinical Lead&lt;/p&gt;\n&lt;p&gt;catherine.shanahan1@nhs.net  Telephone number  01454 382292&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Madeleine Hamilton (Outreach Clinical Lead)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; madeleine.hamilton@nhs.net &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01454 382292&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Eastwood Park", "postalCode": "GL12 8DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6345", "longitude": "-2.46738"}}, "title": "Band 7 Forensic/Clinical/Counselling Psychologist - HMP Eastwood Park", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244139", "validThrough": "2020-11-17T23:59:59+0000"}