{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-11-05T09:30:51+0000", "description": "&lt;p&gt;Health Records &amp; Reception Clerk, hours between 8am &amp; 8pm .The opening hours for Health Records is 08:00 – 20:00 Monday to Sunday.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Health Records and Reception Team based at the Kent and Canterbury Hospital. The successful applicant will be joining a highly motivated and effective team who strive to ensure patient care is at the forefront of our service. The position requires the applicant to have knowledge of Microsoft Office alongside an ability to communicate effectively. The job purpose involves organization of own work loads and contact with front line service users, members of the public and other external stakeholders in order to provide healthcare records for outpatient’s clinics. Ensure all volumes of healthcare records are correctly tracked to the library to facilitate the on-line requesting of healthcare records. File healthcare records in the correct order within the libraries, maintaining accuracy to ensure future retrieval.&lt;/p&gt;\n&lt;p&gt;This post may support one or more team(s) (these could be Medical or non Medical staff). The focus of this role will include keyboard skills, data inputting, photocopying, frequent exposure to manual handling activities and moderate use of display screen equipment. Compliance with the Health Records Operational Policy and the Data Protection Act 1998 must be followed at all times.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sian Mcintosh, Outpatient Supervisor&lt;/p&gt;\n&lt;p&gt;Email address:smcintosh@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Health Records &amp; Reception Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257051", "validThrough": "2020-11-15T23:59:59+0000"}