{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-29T11:46:52+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;em&gt;&lt;strong&gt;**PLEASE BE ADVISED THAT THIS POST IS CURRENTLY ONLY OPEN TO EMPLOYEES OF CPFT**&lt;/strong&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Clinical Trials Nurse Lead to be part of the well-established Windsor research unit - one of the top three NHS trusts in the country for mental health, dementia, rare diseases, learning disability and physical health research, supporting hundreds of studies and helping thousands of volunteers access new treatments and therapies every year.&lt;/p&gt;\n&lt;p&gt;This is a participant/patient facing position, requiring a candidate with nursing, clinical trials and project coordinating experience.&lt;/p&gt;\n&lt;p&gt;The Clinical Trials Nurse Lead is accountable for the day-to-day operational oversight of all clinical trials (CTIMPs) including trial set-up, conduct, and close-out activities in accordance with the protocol, standard operating procedures (SOP), good clinical practices (GCP) and other applicable regulatory requirements. The individual must have the ability to work independently as an effective and engaged team member in a fast-paced environment. Strong initiative and follow through are essential for this job. The ability to maintain confidentiality and to operate in the role with the highest of ethical standards and professionalism are required.&lt;/p&gt;\n&lt;p&gt;You will be negotiating, setting and leading the clinical trials at the WRU from the beginning to completion: working closely with organizational research and development department, CRO, pharmaceutical companies, WRU clinical personnel, pharmacy, laboratory, statisticians, data managers, other vendors, and also liaise with medical staff involved in clinical trials and monitor their conduct.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gloria Calderon, Windsor Research Unit Manager&lt;/p&gt;\n&lt;p&gt;gloria.calderon@cpft.nhs.uk / 01223 219534&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Windsor Research Unit, Cambridge", "postalCode": "CB21 5EF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1852", "longitude": ".188204"}}, "title": "Clinical Trials Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248181", "validThrough": "2020-11-12T23:59:59+0000"}