{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T16:31:04+0000", "description": "&lt;p&gt;We have an opportunity for a qualified and registered mental health staff nurse to join our compassionate and recovery focused team caring for the older people on our ward at Bassetlaw Hospital&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ward B1 is a 15 Bed Mental Health Services for Older People ward split into 2 units. We have Blyth unit which is a 10 Bed Dementia unit and Clumber unit which is a 5 Bed Mental Health Unit.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role will be incredibly rewarding, supporting many of our patients in returning home to their lives in the community, or into a Care Home environment. A great ending to the therapeutic relationship which we have built with them and pride ourselves on.&lt;/p&gt;\n&lt;p&gt;We recognise our services as highly specialised, whereby our nurses are able to develop professionally within both mental and physical health. Our ward is supported by a range of allied health professionals, who support and guide our team, enhancing our nursing skills to improve the lives of our patents and ultimately promote their optimum recovery.&lt;/p&gt;\n&lt;p&gt;Suitable Applicants will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;be a registered mental health nurse with experience of working with this patient group;&lt;/li&gt;\n&lt;li&gt;have excellent verbal and written communication skills;&lt;/li&gt;\n&lt;li&gt;be able to problem solve and be an able negotiator;&lt;/li&gt;\n&lt;li&gt;have the ability to work as part of a multidisciplinary team;&lt;/li&gt;\n&lt;li&gt;be reliable, motivated, and flexible with the desire to work with older adults;&lt;/li&gt;\n&lt;li&gt;be an effective team player, able to work with a wide range of professionals as well as patients and their families;&lt;/li&gt;\n&lt;li&gt;be hard-working and able to maintain and contribute to a high standard of care;&lt;/li&gt;\n&lt;li&gt;be able to work on a 24-hr rota basis, including nights, weekends and Bank Holidays.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applications from Nurses with specific interests or areas of expertise to expand current team knowledge and service provision to patients.&lt;/p&gt;\n&lt;p&gt;Interested? We would like to hear from you. &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Wheeler - Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address: Claire.wheeler@nottshc.nhs.uk / Telephone number: 01909 572035&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Carol MacConnachie - Clinical Lead&lt;/p&gt;\n&lt;p&gt;Email address: carol.macconnachie@nottshc.nhs.uk / Telephone number: 01909 572035&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worksop", "postalCode": "S81 0BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3177", "longitude": "-1.1099"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258569", "validThrough": "2020-11-19T23:59:59+0000"}