{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "Band 8a £45,753 to £51,668 per annum, pro rata"}}, "datePosted": "2020-11-02T11:00:17+0000", "description": "&lt;p&gt;&lt;strong&gt;8a Clinical Psychologist – Chronic Pain&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting permanent opportunity has arisen to join Central Cheshire Integrated Care Partnership (CCICP) as a Band 8a Clinical Psychologist within the Community Pain Management Service. We require an enthusiastic, self-motivated individual with experience of working with patients in the community.&lt;/p&gt;\n&lt;p&gt;The philosophy of the Community Pain Management Service is to provide high quality integrated care, ensuring patients are seen by the most appropriate healthcare professional, at the appropriate time and in the appropriate place, whilst optimising the best health outcome for the patient. This will be managed through effective collaborative multi-disciplinary working to deliver a comprehensive bio-psychosocial model approach. The service promotes and empowers patients to self-management their condition long-term, to achieve less dependency on wider health care services such as A&amp;E, GPs, secondary care, ambulance services and mainstream physiotherapy.&lt;/p&gt;\n&lt;p&gt;The multi-disciplinary team is formed of a Clinical lead, Consultant, Advanced Clinical Specialists: Physiotherapists, Occupational Therapists and Assistants.&lt;/p&gt;\n&lt;p&gt;This post is open to band 8a Clinical Psychologist.&lt;/p&gt;\n&lt;p&gt;The post holder will also be responsible for managing a caseload of chronic pain patients and attending chronic pain management MDT meetings.&lt;/p&gt;\n&lt;p&gt;CCICP fully supports staff development through internal and external training and supervision to maintain and enhance clinician’s skills within areas of clinical interest.&lt;/p&gt;\n&lt;p&gt;For further information on the role please contact donna.lord@mcht.nhs.net&lt;/p&gt;\n&lt;p&gt;[ Please note job description awaiting Agenda for Change Job matching at point of advertising, expected banding 8a]&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Cheshire &amp; Vale Royal", "postalCode": "CW5 5RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0755", "longitude": "-2.51825"}}, "title": "Clinical Psychologist - Chronic Pain", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251672", "validThrough": "2020-11-16T23:59:59+0000"}