{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Dependant on experience"}}, "datePosted": "2020-10-29T09:46:23+0000", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANT HISTOPATHOLOGIST &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Maidstone and Tunbridge Wells NHS Trust is seeking an enthusiastic consultant histopathologist to join this dynamic friendly Cellular Pathology service.&lt;/p&gt;\n&lt;p&gt;The department is housed in a dedicated Cellular Pathology building at Maidstone Hospital that opened in spring 2011. The successful candidates will join a team of 19 Consultants, 2 Consultant Biomedical Scientists reporting GI and Gynae, a Molecular Clinical Scientist, two Cut up Practitioners and one trainee Cut up practitioner. The department is sub-specialised and provides a cellular pathology service to Maidstone and Tunbridge Wells NHS Trust, including the Kent Oncology Centre, Medway NHS Foundation Trust and Dartford and Gravesham NHS Trust. It also has links with the developing Kent Medical School. Interest in teaching and research is therefore welcomed and encouraged.&lt;/p&gt;\n&lt;p&gt;The department supports a busy Coronial service with plenty of opportunity for non-forensic autopsy work, a wide range of MDT meetings and is a popular training department for histopathology trainees. The department curates the Southeast England general EQA scheme and has a thriving molecular pathology service. The laboratory is ISO 15189 accredited and participates in appropriate national EQA schemes for general histopathology, immunohistochemistry, Diagnostic Cytology and molecular diagnosis.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Maidstone Hospital provides a wide range of complex and routine surgical and medical services and has the latest in diagnostic facilities. It is also home to the main base of Kent Oncology Centre, which provides complex radiotherapy and chemotherapy for patients throughout Kent and north East Sussex.&lt;/p&gt;\n&lt;p&gt;Tunbridge Wells Hospital is the first NHS hospital in England to provide en-suite, single rooms for all inpatients, most of which have woodland views. The hospital is seen, nationally, as an example of best practice in the design of patient-safe facilities and has attracted widespread international interest. It provides a range of complex and routine surgical and medical services and is a recognised Trauma Centre with state-of-the-art facilities.&lt;/p&gt;\n&lt;p&gt;Both our hospitals are located within a short distance of the nearest, large town centres which offer a bustling bar and restaurant culture with theatre, the opportunity to experience live outdoor music, both classical and popular at the nearby National Pinetum at Bedgebury. Taste the thrills of Go Ape for young and old alike! The area also offers summer classical concerts with fireworks at Hever and Leeds castles and Sissinghurst and Wisley for the green fingered along with the sprawling golden dunes and beaches of Camber sands, which are all within easy reach. Golfers will delight in the number and diversity of courses all set in the garden of England whose sparkling wines rival those of Champagne just across the Channel&lt;/p&gt;\n&lt;p&gt;Both are also on the doorstep of some of Kent’s most beautiful countryside – the best of both worlds. There are fantastic travel links which make all parts of the county, country and beyond, easily accessible.&lt;/p&gt;\n&lt;p&gt;The area also houses many high-performing schools, including some of the top private schools in the country. There are also a number of excellent universities and colleges, with most London universities within a commutable distance.&lt;/p&gt;\n&lt;p&gt;Come to us and you’ll join an amazing team, in modern, state-of-the-art hospitals in a beautiful part of South East England, and you’ll be given all the support and training you need. We have a fantastic medical workforce and want to expand our substantive workforce to provide to best possible care to our patients and build on our existing clinical excellence.&lt;/p&gt;\n&lt;p&gt;Potential applicants will be welcome to visit the department and discuss this post.&lt;/p&gt;\n&lt;p&gt;Applicants must be on the specialist register for Cellular Pathology or be within 6 months of CCT at date of interview.&lt;/p&gt;\n&lt;p&gt;Interview date: 7th December 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To discuss the post and arrange informal visits please contact: Dominic Chambers, Clinical Lead for Histopathology 01622 224055 or d.chambers@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Consultant Histopathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247779", "validThrough": "2020-11-17T23:59:59+0000"}