{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inc"}}, "datePosted": "2020-10-28T18:30:21+0000", "description": "&lt;p&gt;Barts Health NHS Trust has a vision to be a high performing group of NHS hospitals, renowned for excellence and innovation and providing safe and compassionate care to our patients in east London &lt;br /&gt;and beyond.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced and highly motivated physiotherapist to join our expanding service. You will support this innovative team with excellent clinical and team leadership skills that deliver high quality patient centered care and support the service leads to deliver department objectives and service developments.&lt;/p&gt;\n&lt;p&gt;You will work as part of a large Multidisciplinary Spinal Surgery secondary care service, working closely with the Extended Scope Practitioner, Spinal Surgeons, Clinical Nurse Specialists and support staff. The Extended Scope Practitioner will be your line manager.&lt;/p&gt;\n&lt;p&gt;Your primary role will be managing a mix of primary and secondary care referrals, supporting the development of junior staff, participating in teaching programmes, and leading service developments.&lt;/p&gt;\n&lt;p&gt;In the role you will receive support from the Extended Scope Practioner. We have a well established in-service training programme, but also encourage post-graduate courses and professional development opportunities. Our service also has close links with the internationally renowed QMUL Sports Medicine Department with staff often collaborating on research and service developments.&lt;/p&gt;\n&lt;p&gt;If you feel that you have the required experience, skills and attributes we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;For further information or informal visits, please contact Francesca Howes, Extended Scope Practioner Francesca.howes@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal London Hospital, London", "postalCode": "E1 1FR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.059802"}}, "title": "Highly Specialist MSK Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247533", "validThrough": "2020-11-11T23:59:59+0000"}