{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum pro"}}, "datePosted": "2020-11-04T14:46:09+0000", "description": "&lt;p&gt;Are you a motivated and committed individual who wishes to work for an organisation which has successfully turned itself around and is now committed to providing outstanding patient care? If so then an exciting opportunity has arisen to join our friendly and supportive Urgent Care Centre.&lt;/p&gt;\n&lt;p&gt;At Sherwood Forest Hospitals NHS Foundation Trust you get to be part of the team helping shape the changing structures of health and social care today.&lt;/p&gt;\n&lt;p&gt;A Specialty Doctor in the Urgent Care Centre at Newark Hospital is required. This is a 10 - 12 PA contract.&lt;/p&gt;\n&lt;p&gt;This is a full-time position but candidates wishing to work part-time or in a job-share are encouraged to apply. If such a person is appointed modification of the job content will be discussed with the appointee on a personal basis. They will be required to devote substantially the whole of his/her time for the appointed programmed activities to the duties of the post and to give them priority at these times.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be contracted with the Sherwood Forest Hospitals NHS Foundation Trust. As a consequence he/she is expected to be aware of local policies and procedures and to comply with standing orders and standing financial instructions of the Sherwood Forest Hospitals NHS Foundation Trust. In particular, where the Specialty Doctor is responsible for the management of employees of the Trust, he/she will be expected to observe the local employment and human resource policies and procedures.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Eligibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You must have full GMC registration with a licence to practice.&lt;/p&gt;\n&lt;p&gt;The post is suitable for a Doctor with an emergency medicine, general practice, previous urgent care or general medicine (with previous exposure to minor injuries and minor illness) background.&lt;/p&gt;\n&lt;p&gt;Candidates are encouraged to visit the Trust by arrangement.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newark Hospital, Newark", "postalCode": "NG24 4DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0679", "longitude": "-.806489"}}, "title": "Specialty Doctor - Urgent Care Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256272", "validThrough": "2020-11-18T23:59:59+0000"}