{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25000", "minValue": "25000", "unitText": "YEAR", "value": "£25,000pa FTE DoE"}}, "datePosted": "2020-10-19T15:54:53+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you a confident Band 5 or newly qualified Band 5 Occupational Therapist who would like to explore a more rewarding clinical challenge in CAMHS Mental Health Services? Are you ready to develop your clinical skills?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post:&lt;/strong&gt;Band 5 Occupational Therapist (Maternity Cover 9 Months)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base: &lt;/strong&gt;Cygnet Hospital Bury, Buttercup Ward&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible for:&lt;/strong&gt;8 Bedded Female Low Secure CAMHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible to:&lt;/strong&gt;Jenna Abernethy, Senior Occupational Therapist, CAMHS Service&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt;32 hours per week, over 4 days.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;Cygnet Hospital Bury, Buttercup Ward&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Join our supportive friendly team near the lively city of Manchester and make an application today.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role please contact Jenna Abernethy Senior OT - JennaAbernethy@cygnethealth.co.uk or our in house recruiter Hayleyvalentine@cygnethealth.co.uk.&lt;/p&gt;\n&lt;p&gt;With over 150 OTs in the company, we also work together as a large team providing support to each other across the group, with various specialist interest groups to tap into, including Mental Health, Neuropsychiatry, Autism, Learning Disabilities and Sensory Integration, to name a few.&lt;/p&gt;\n&lt;p&gt;Buttercup ward is a low secure female ward for young people aged between 13 and 17. Young People needing admission to the Low secure service will have severe mental illness symptoms and will exhibit a high level of risk that cannot be safely managed in an acute unit or will require longer term therapeutic intervention.&lt;/p&gt;\n&lt;p&gt;As an Occupational Therapist, you will provide direct clinical care which will encompass OT assessments, treatment and management of patients within the service.&lt;br /&gt; &lt;br /&gt; In this role you will assess, implement and develop an OT treatment programme according to service user’s diagnosis and identified needs. This will be based upon findings from assessments including associated risks, in order to develop treatment plans accordingly.&lt;br /&gt; &lt;br /&gt; Prioritisation skills are key to manage the caseload of clients effectively and you will work closely with the Occupational Therapy and multidisciplinary team onsite.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;5 reasons why you should make an application today…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We care about people in our services&lt;/li&gt;\n&lt;li&gt;Career pathway progression within the company to support your development and skills&lt;/li&gt;\n&lt;li&gt;You will be a part of a large service at Bury comprising of 14 different wards and a wide range of experience to draw from within the OT team.&lt;/li&gt;\n&lt;li&gt;National networks of over 150 OTs in the Cygnet Group within different specialisms including Forensic Practice, LD and ASD, Acute mental health, PICU, and inpatient CAMHS&lt;/li&gt;\n&lt;li&gt;Low caseload number to support intensive OT focused interventions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Successful Candidate should be/have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This role is suitable for a newly qualified occupational therapist&lt;/li&gt;\n&lt;li&gt;A registered Occupational Therapist with the HCPC (Health Care Professions Council) or registering imminently&lt;/li&gt;\n&lt;li&gt;Experienced in the field of adult/CAMHS mental health or Low Secure environments&lt;br /&gt; An understanding of Occupational Therapy process/interventions and can take a “hands on” approach&lt;br /&gt; Excellent communication and time management skills&lt;/li&gt;\n&lt;li&gt;Ability to manage highly demanding clinical presentation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary £25,00opa (Full Time Equivalent)&lt;/li&gt;\n&lt;li&gt;Opportunities for CPD and to undertake further learning and development. For example:&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Leadership and Management, Sensory Integration.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Training days provided by highly experienced and renowned OT specialists&lt;/li&gt;\n&lt;li&gt;Expert on site clinical supervision and peer support (x3 Band 7 posts at our Bury hospital)&lt;/li&gt;\n&lt;li&gt;Bi-monthly OT CPD meetings focused on skill and strategic service development.&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;NHS Discount Cards &amp; Blue Light Card&lt;/li&gt;\n&lt;li&gt;Free parking &amp; meals on duty&lt;/li&gt;\n&lt;li&gt;Relocation packages offered&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;br /&gt; The successful candidate will be required to undergo an enhanced DBS and reference check and an offer of employment will be subject to successful clearance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*Please note - speculative recruitment emails are not to be sent directly to our clinical staff, these need to go via our internal recruitment team. If speculative candidates are sent directly to a member of the clinical team, we will consider these candidates as our own*&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Off Buller St, Bolton Rd, Bury", "postalCode": "BL8 2BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5872", "longitude": "-2.31677"}}, "title": "Band 5 Occupational Therapist (Mat Leave)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233014", "validThrough": "2020-11-27T23:59:59+0000"}