{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24491", "minValue": "22183", "unitText": "YEAR", "value": "£22,183 to £24,491 (pro-rata)"}}, "datePosted": "2020-11-06T11:13:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Employment Support Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: £22,183 to £24,491 (pro-rata)&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen within Worcestershire County Council, in conjunction with Worcestershire Health and Care NHS Trust to recruit an Employment Support Worker to work with Community Assessment &amp; Recovery Service (CARS). The service is county based and the post holder will be based at either New Brook, Princess of Wales Community Hospital in Bromsgrove or Studdert Kennedy House in Worcester. This is to join an existing, well established Employment Services Team which covers the county of Worcestershire and holds accreditation from the Centre of Mental Health as a Centre of Excellence for Individual Placement and Support (IPS).&lt;/p&gt;\n&lt;p&gt;You will be required to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proactively manage a caseload of people who have experienced mental health problems who are unemployed and economically inactive.&lt;/li&gt;\n&lt;li&gt;Provide employment support for our client group who are furthest away from the job market to move them closer to their employment goals, in the hope that these achievements aid individuals’ recovery and social inclusion goals.&lt;/li&gt;\n&lt;li&gt;Work within a multidisciplinary environment with service users with complex needs, supporting them to move into employment and sustain this to aid recovery, in conjunction with key stakeholders.&lt;/li&gt;\n&lt;li&gt;Supporting clients once gained employment, and/or aiding those who are employed and experiencing difficulties within the work place retain employment&lt;/li&gt;\n&lt;li&gt;Liaise closely with DWP providers.&lt;/li&gt;\n&lt;li&gt;Work proactively at employer engagement including educational, voluntary work and pre-vocational training opportunities and supporting employers on reasonable adjustments and retention of employees where necessary.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will have experience both in the field of employment support and with clients experiencing mental ill health&lt;/p&gt;\n&lt;p&gt;You be capable of working independently and have the ability to take initiative, including making direct approaches to employers.&lt;/p&gt;\n&lt;p&gt;Personal experience of recovery from mental ill health is seen as an additional advantage in applying for this post although not essential.&lt;/p&gt;\n&lt;p&gt;Closing date: Sunday 29th November 2020 at 23:59&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bromsgrove", "postalCode": "B61 0BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3437", "longitude": "-2.05726"}}, "title": "Employment Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259358", "validThrough": "2020-11-29T23:59:59+0000"}