{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 per annum"}}, "datePosted": "2020-11-02T12:16:01+0000", "description": "&lt;p&gt;Higher Assistant Psychologist – Excellent learning environment, friendly team with great opportunities&lt;/p&gt;\n&lt;p&gt;Come to work in a transforming team in a role that offers great benefits with opportunities to learn from accomplished qualified clinicians.&lt;/p&gt;\n&lt;p&gt;Following the successful graduation of the existing Higher Assistant Psychologist the chance to work in the Harrogate Memory Service and Harrogate Older Peoples Community Mental Health Team based at Alexander House, Knaresborough has arisen. The role offers the opportunity to work alongside the experienced Consultant Psychologist and Trainee Psychologist in a specialist MHSOP Service, undertaking a variety of clinical interventions. These included neuropsychological assessment and group work within a diverse Multi-Disciplinary Team and greater responsibility over time due to the Higher nature of the Assistant Psychologist role. It is essential that at all times excellent quality care is delivered to individuals living with complex mental health problems over a variety of environments across the geographical locality.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to demonstrate their skills as a motivated team player, with a curiosity and interest in the clinical area. This will be rewarded by enhanced skills and knowledge in the clinical area through regular supportive supervision, which in turn would be good experience if applying for further training.&lt;/p&gt;\n&lt;p&gt;The post holder will be joining at a time of service transformation and challenge. They are expected to demonstrate a flexible and adaptable approach, required with the advent of COVID-19 using technology and being innovative in their support of our patients and carers.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity for both individuals looking to gain experience at a Band 5 level, as well as those with existing experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr John Kelly (Consultant Psychologist) 01423 795150&lt;/p&gt;\n&lt;p&gt;johnkelly3@nhs.net&lt;/p&gt;\n&lt;p&gt;or Rachel Hargreaves (Community Team Manager) 01423 795150&lt;/p&gt;\n&lt;p&gt;rachel.hargreaves@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Alexander House, Knaresborough", "postalCode": "HG5 0UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0108", "longitude": "-1.46588"}}, "title": "Higher Assistant Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252005", "validThrough": "2020-11-16T23:59:59+0000"}