{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive pro rata"}}, "datePosted": "2020-10-28T18:15:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Elderly Medicine Staff Nurses: BAND 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;University College Hospital in London is looking for enthusiastic and motivated Band 5 nurses to work in our Internal Medicine Service&lt;/p&gt;\n&lt;p&gt;Do you have a passion to work in this exciting specialty? Would you like to work in an environment that is designed to meet the needs of older people? Come and join a great team of staff who pride themselves in the care they provide to this vulnerable patient group.&lt;/p&gt;\n&lt;p&gt;Speciality information: We have recently co-located our elderly medicine department on T10 ward here at UCH. Our ward and team are seen as the experts in providing top quality care to older people at UCLH. This most recent move offers us the opportunity to further develop our workforce through specialist educational and training packages supported by our Consultant Nurse for Older People and Older Adults Assessment Team.&lt;/p&gt;\n&lt;p&gt;T10 Ward is a mixed sex ward caring for acutely ill older adults. Many of these patients will have a diagnosis of dementia along with complex medical problems and long term condition management. Our patients are very dependent and rely on us to provide them with the highest standards of care to prevent such patient harms as pressure ulcers and falls. This is an exciting time to be part of this great team as we work towards meeting our same day emergency care goals and developing our service to meet the changing landscape as a result of Covid 19.&lt;/p&gt;\n&lt;p&gt;We offer full orientation and development for staff using the support of our dedicated Clinical Practice Facilitator. There are opportunities for staff to pursue academic courses at university and the potential for developing a career pathway in elderly medicine has recently increased with the addition of trainee Advanced Clinical Practitioner roles.&lt;/p&gt;\n&lt;p&gt;We are looking for committed and dynamic nurses with excellent communication skills and above all a real desire and passion to work with older people. This is an excellent opportunity to develop your skills and learn about a wide variety of medical problems including diabetes, renal, cardiac and respiratory. We offer training in IV therapy, cannulation, phlebotomy and male catheterisation with the addition of advanced delirium and dementia training and enhanced discharge planning skills.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is passionate about medical and elderly nursing, about delivering high standards and ensuring that our patients have a good experience whilst under our care. Newly qualified and nurses from non-acute backgrounds are welcome to apply.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to develop your skills as a professional nurse in a friendly and forward-thinking environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please make sure you are available for the upcoming assessment day:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;TBC&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Owain Mcateer owain.mcateer@nhs.net or Kirsty McCune kirsty.mccune@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Staff Nurse - Elderly Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247527", "validThrough": "2020-11-11T23:59:59+0000"}