{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-06T15:46:36+0000", "description": "&lt;p&gt;We are looking for a motivated nurse with a professional outlook to join our team in the Main Haemodialysis Unit as a Staff Nurse.&lt;/p&gt;\n&lt;p&gt;The Sussex Kidney Unit is a state of the art purpose-built unit at the Royal Sussex County Hospital, and provides a comprehensive range of acute and chronic renal services. The department is located in Brighton and is the hub for renal services in Sussex. You will work within a specialized area, providing high quality care to patients with acute and chronic renal failure. We are open Monday to Saturday- 07:00-22:30 and dialyses 200 patients per week.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic, enthusiastic, hard-working individual with at least several years post registration experience combined with strong interpersonal and care-management skills, to join our friendly team.&lt;/p&gt;\n&lt;p&gt;Ideally the candidate would possess renal experience and/or the renal course. Those without a renal background can take advantage of our in house training in the form of unit competencies/ mentoring and the Renal Development Programme study days organised by our Renal Clinical Educator. We also support participation on the Renal Pathway course provided by the University of Brighton. The unit utilises information technology extensively and IT skills would be advantageous.&lt;/p&gt;\n&lt;p&gt;We are proud to be able to offer a variety of flexible working options and contracts. For further information please refer to the Flexible Working for Registered Nurses document which is attached to this advert.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Danilo San Diego&lt;/p&gt;\n&lt;p&gt;Job title Haemodialysis Unit Manager&lt;/p&gt;\n&lt;p&gt;Email address danilo.sandiego@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01273 696955 Ext. 67567&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Haemodialysis Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260447", "validThrough": "2020-11-29T23:59:59+0000"}