{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T09:01:13+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to increase the qualified physiotherapy provision in our secure services at Roseberry Park in Middlesborough.&lt;/p&gt;\n&lt;p&gt;You will be an autonomous qualified physiotherapist providing diagnosis, assessment, treatment planning and provision for adults with learning disabilities and or mental health problems who have complex physical and psychological needs and are admitted to our forensic in patient units. You will be a member of a multidisciplinary team working closely with other professions. There may be a requirement to undertake outreach work. You will work alongside the band 6 physiotherapist who will provide your clinical supervision.&lt;/p&gt;\n&lt;p&gt;You must have a recognised BSC or MSc in Physiotherapy and be HCPC registered.&lt;/p&gt;\n&lt;p&gt;Previous experience of working with people with complex physical and mental health/learning disabilities problems either personally, or as a student or after qualifying will be an advantage.&lt;/p&gt;\n&lt;p&gt;Successful candidates will benefit from being part of a group of 60 Physiotherapy staff working in TEWV. You will also have the support and guidance from Clinical Leads, Clinical Specialists and the Professional Head of Physiotherapy.&lt;/p&gt;\n&lt;p&gt;Additional attractive features of this post includes flexitime working, a robust clinical supervision scheme, an excellent training &amp; development programme, supportive professional support from the Clinical Lead Physiotherapist and Trust Physiotherapy Advisor. We are also committed to supporting external training events, CPD, research and audit interests, under our appraisal scheme.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Christiana Liddle, Professional Head of Physiotherapy&lt;/p&gt;\n&lt;p&gt;christiana.liddle@nhs.net&lt;/p&gt;\n&lt;p&gt;07827936463&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Roseberry Park: Ridgeway, Middlesborough", "postalCode": "DL2 2TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5436", "longitude": "-1.59116"}}, "title": "Physiotherapist - Secure Inpatient Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256985", "validThrough": "2020-11-15T23:59:59+0000"}