{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-03T13:45:39+0000", "description": "&lt;p&gt;&lt;strong&gt;PLEASE NOTE: PREVIOUS APPLICANTS NEED NOT REAPPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 3 Assistant Patient Pathway Coordinator (CAT 5 Trauma &amp; Orthopaedics)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term post for 12 months to cover maternity leave.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trauma and Orthopaedic Department is looking for a temporary full-time band 3 Assistant Patient Pathway Coordinator to cover Maternity leave for 12 months to start as soon as possible.&lt;/p&gt;\n&lt;p&gt;We are a large, friendly, busy department made up of 23 administrators who oversee all clerical duties for 23 Consultants and their clinical teams. This is a great opportunity to become a key part of a developing team supporting the consultants, providing first-class patient care in line with government treatment time targets.&lt;/p&gt;\n&lt;p&gt;We are looking for a team player with good communication and excellent customer service skills, with a positive attitude towards work. Trauma and Orthopaedics is a fast-paced department and this requires flexibility, ability to work under pressure and meet deadlines when they are set.&lt;/p&gt;\n&lt;p&gt;The role will involve supporting specific consultants within a small team; this will include managing outpatient clinics, waiting lists as well as other administrative tasks.&lt;/p&gt;\n&lt;p&gt;To be considered for this post you will need GCSE or an equivalent qualification in English and Maths and be computer literate.&lt;/p&gt;\n&lt;p&gt;We are looking for staff committed to ensuring the best possible service for our patients with a particular enthusiasm for teamwork. This is a fantastic opportunity to enhance your skills and experience in a non-clinical role where individual personal development is actively supported.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Louise Walters (Patient Pathway Manager) / Kelly Brown (Assistant Patient Pathway Manager) on 0118 322 8640 or louise.walters@royalberkshire.nhs.uk / kelly.brown@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Assistant Patient Pathway Coordinator (CAT 5 - T&amp;O) - F/T 12 Months", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254182", "validThrough": "2020-11-21T23:59:59+0000"}