{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46000", "minValue": "46000", "unitText": "YEAR", "value": "Up to £46,000"}}, "datePosted": "2020-10-27T09:01:41+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Break into prison healthcare!&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;Are you looking for the next step or a new challenge in your career? If so, then this role may be for you.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a flexible approach, working within a team that encourages new ideas and opinions on how to improve the service delivery and expand current services to introduce new ways of working.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;What will you be doing?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible in partnership with the Head of Healthcare for the effective day-to-day operational management of all clinical services across the prisons. As well as support the management of all service level agreements, ensuring performance-monitoring standards are adhered to and the highest standards of care are maintained. The post holder will deputise for the Head of Healthcare in their absence and support them across the range of their duties.&lt;/p&gt;\n&lt;p&gt;To support the Head of Healthcare who is the registered CQC Manager, you’ll be responsible for supporting and ensuring compliance with the essential standards of quality and safety.&lt;/p&gt;\n&lt;p&gt;Across our prisons In the Yorkshire region Practice Plus Group operate as an integrated team approach to peer support and standardisation of practice. The main aim as the healthcare provider within Health in Justice is to work in partnership with discipline staff and colleagues to enable the offering of high quality healthcare services to best support the residents that are equivalent to those delivered in the community&lt;br /&gt;As a member of the wider management team, you will be responsible for providing the day to day clinical and operational management of our diverse healthcare teams within National and Local Guidance.&lt;/p&gt;\n&lt;p&gt;Financial and governance responsibilities are a key aspect of the role with opportunities through regional peer support to contribute to the strategic development of service delivery across HMP Moorland, HMP Hatfield’s and The Lakes.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Salary and Benefits&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will also receive free DBS check, access to career development through management training courses and free mandatory training and revalidation support.&lt;/p&gt;\n&lt;p&gt;Access to a number of benefits including a company pension scheme, NHS discounts, 25 days’ annual leave plus 8 public bank holidays (pro-rata for part-time) plus other benefits including cycle to work scheme and other Practice Plus Group perks schemes.&lt;/p&gt;\n&lt;p&gt;This is a full-time, permanent role working 37.5 hours a week across both sites There may be some on-call responsibility with this role although this will be discussed at interview.&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN7 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5471", "longitude": "-.97144"}}, "title": "Deputy Head of Healthcare - HMP YOI Moorland &amp; Hatfield", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243773", "validThrough": "2020-11-27T23:59:59+0000"}