{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-16T16:31:17+0100", "description": "&lt;p&gt;Applications are invited to apply for the above post in the Maternity Department at the Oxford University Hospitals NHS Foundation Trust. The department is seeking a capable and motivated doctor who enjoys working in both a District General and tertiary referral service and wishes to effect change and improve care for patients within these services.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join the maternity service which provides general obstetric services to the local population – 7500 women per year are cared for within the Trust. There are also tertiary referral services in fetal and maternal medicine, supported by a Level 3 neonatal unit.&lt;/p&gt;\n&lt;p&gt;The post is required to support the tertiary referral services in fetal medicine. We require the appointee to have considerable experience of fetal medicine allowing ability to work at consultant level in a tertiary referral unit in fetal medicine or sub-specialty accreditation in Maternal Fetal Medicine. We also require the candidate to contribute to the overall development of the strategy for the service and a track record of service development will be an advantage.&lt;/p&gt;\n&lt;p&gt;This post is intended to be mainly based at the John Radcliffe Hospital in Oxford but there are also clinical sessions at partner Trust, Buckinghamshire Healthcare. On call will be Maternity only at the John Radcliffe Hospital.&lt;/p&gt;\n&lt;p&gt;Candidates are highly recommended to visit the departments in Oxford and Aylesbury.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCatherine GreenwoodJob titleClinical DirectorEmail addressjo.barrett@ouh.nhs.ukTelephone number01865 572698Additional contact information&lt;/p&gt;\n&lt;p&gt;Aparna Reddy, SDU lead for Obstetrics and Gynaecology at Bucks Health Care, direct dial 01296 316548, email aparna.reddy1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe and Stoke Mandeville Hospital, oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Consultant in Obstetrics &amp; Fetal Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231116", "validThrough": "2020-11-16T23:59:59+0000"}