{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15162", "minValue": "15162", "unitText": "YEAR", "value": "£9.02 an hours"}}, "datePosted": "2020-11-06T16:16:27+0000", "description": "&lt;p&gt;DMC Healthcare – Albion Place&lt;/p&gt;\n&lt;p&gt;Permanent, Part Time 30 hours a week&lt;/p&gt;\n&lt;p&gt;DMC Healthcare are looking to recruit an experienced, charismatic, and approachable administrator to support our Practice manager and Assistant Practice Manager at our GP Surgery based in Maidstone town centre. Our practice is modern, bright and welcoming with on-site staff parking, meeting rooms, air-conditioned offices and staff kitchen/dining area.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Do you have administration &amp; reception experience or working in a GP Surgery or clinical environment?&lt;/li&gt;\n&lt;li&gt;Can you ensure accurate bookings of appointments and handling patient queries?&lt;/li&gt;\n&lt;li&gt;Are you great communicator with excellent customer service?&lt;/li&gt;\n&lt;li&gt;Are you accurate at recording information and telephone manner?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If yes, then we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;DMC are a successful and trusted provider of NHS services across England and Scotland. We have grown rapidly in the past decade from a single Dulwich practice to a team of over 400 employees dedicated to giving patients the very best in care.&lt;/p&gt;\n&lt;p&gt;DMC Healthcare continue to see steady growth in the services we provide and we are looking for 2 Practice Administrator/Administrator answering patients queries via telephones and face to face to join our busy team at Albion Place practice in Maidstone, Kent.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit 2 member of staff, permanent/part time for 30 hours a week.&lt;/p&gt;\n&lt;p&gt;You will assist in the day to day running by providing Reception and administrative support to the clinical team. Tasks would include covering reception area, all general office administrative work, customer service face to face and through telephone.&lt;/p&gt;\n&lt;p&gt;As the administrator you will demonstrate the ability to multi-task, good time keeping, organisation, efficiency, professionalism and the ability to work both independently and as part of a team whilst supporting the delivery of practice policies and procedures.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key duties include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be the first point of contact for patients who are having difficulty&lt;/li&gt;\n&lt;li&gt;Deliver excellent customer service to patients&lt;/li&gt;\n&lt;li&gt;Arrange appointments either face to face or via the telephone&lt;/li&gt;\n&lt;li&gt;Monitor flow of patients in the waiting room ensuring the appointment system accurately reflects the arrival of patients&lt;/li&gt;\n&lt;li&gt;Update patients records and dealing with day to day patients related queries&lt;/li&gt;\n&lt;li&gt;Deliver back office administrative support for GP practices&lt;/li&gt;\n&lt;li&gt;Dealing sensitively with all enquires/information &amp; any general enquiry that may arise from time to time&lt;/li&gt;\n&lt;li&gt;The post holder should also be prepared to take part in training/educational workshops as and where required&lt;/li&gt;\n&lt;li&gt;Read coding the information into the practice clinical system,&lt;/li&gt;\n&lt;li&gt;Participation in practices quality goals and objectives&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role you will:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Communicate effectively with patients, carers and healthcare professionals&lt;/li&gt;\n&lt;li&gt;Respond appropriately to queries&lt;/li&gt;\n&lt;li&gt;Record data accurately with attention to detail&lt;/li&gt;\n&lt;li&gt;Comply and familiarise yourself with the Practice’s policies and procedures&lt;/li&gt;\n&lt;li&gt;Provide relevant information to patients, family/visitors/carers and colleagues&lt;/li&gt;\n&lt;li&gt;Become an expert in administrative field&lt;/li&gt;\n&lt;li&gt;Excellent communication skills, both written and verbal&lt;/li&gt;\n&lt;li&gt;Able to prioritise and work accurately under pressure with good attention to detail&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DMC Healthcare Group is a provider of Primary Care Services operating GP surgeries, walk-in centres and mobile medical units. We offer patients a full range of NHS primary and urgent care services. At DMC we believe in working together to deliver healthier outcomes for our patients and our own teams and strive to continuously ensure our patients are safe, cared for and receive the care they need when they need it.&lt;/p&gt;\n&lt;p&gt;If you are interested in our vacancy then we would love to hear from you. In return, you will enjoy a challenging and diverse career with DMC.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As part of our employment process, you will be required to complete the appropriate level DBS check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality and Diversity Statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The company supports the principle of Equality and Diversity in employment wholeheartedly and opposes all forms of unlawful or unfair discrimination on the grounds of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;This job advert may close as soon as sufficient suitable applications have been received. If interested please apply for this post as soon as possible&lt;/p&gt;\n&lt;p&gt;Your submitted application maybe imported into our preferred Third-party recruitment system. By applying for this post, you are agreeing to DMC Healthcare transferring the information within this application to its preferred applicant management system. If you are offered a job, information will also be transferred into the DMC Electronic Staff Records system.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone, Kent", "postalCode": "ME14 5DY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2742", "longitude": ".529529"}}, "title": "Practice Administrator - Albion Place", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260582", "validThrough": "2020-11-20T23:59:59+0000"}