{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 per annum/pro-rata"}}, "datePosted": "2020-10-29T11:01:10+0000", "description": "&lt;p&gt;The focus on infection prevention and control has never been greater than today and we are looking for a skilled Senior IPC Nurse to join our expanding team.&lt;/p&gt;\n&lt;p&gt;We want all members of our Oxford Health workforce family to have passion and ambition to be the very best, working in a supportive, respectful and caring environment.&lt;/p&gt;\n&lt;p&gt;This role is an exciting opportunity for a dynamic, dedicated and driven infection prevention nurse to join a specialist service that positively impacts on the experience of patients, visitors and carers by providing high standards of clinical practice and care.&lt;/p&gt;\n&lt;p&gt;At your core you must match our Trust’s determination to be outstanding; always looking at ways to improve patient care in our community and mental health settings across Oxfordshire, Buckinghamshire, Wiltshire and beyond.&lt;/p&gt;\n&lt;p&gt;We want you to be an IPC role model to your colleagues across the Trust by providing expert clinical advice, promotion of consistent and sustained improvements in standards of practice and care in IPC and you’ll be committed to reducing healthcare associated infections.&lt;/p&gt;\n&lt;p&gt;Naturally, you will be approachable, a committed team player and have excellent communication skills. You’ll need to own or have access to a car to get round the patch.&lt;/p&gt;\n&lt;p&gt;Our expanding IPC team is working to ensure that our service meets the demands of our patients and staff both now, during what is an unprecedented time, and in the months and years ahead.&lt;/p&gt;\n&lt;p&gt;If this role sounds a perfect fit for you and your career ambitions, please get in touch.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Helen Bosley Job title Nurse Consultant, IPC Email address helen.bosley@oxfordhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Oxford Health Centre, Oxford", "postalCode": "OX4 1XD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7473", "longitude": "-1.23249"}}, "title": "Senior Infection Prevention and Control Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248019", "validThrough": "2020-11-19T23:59:59+0000"}