{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 pa pro rata for part time staff"}}, "datePosted": "2020-10-26T10:16:56+0000", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a qualified radiographer to join our MRI unit at Sheffield Teaching Hospitals NHS Foundation Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a highly motivated Diagnostic Radiographer to join our existing MR team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are fortunate enough to utilise 6 MR scanners (Siemens &amp; Philips) on 3 hospital sites. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The range of MR examinations performed is extremely varied and includes Neuro, Cardiac, Vascular, MSK, GI, Oncology, Obstetrics and Renal. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We also have a commitment towards supporting and developing clinical trials.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants will have a DCR or BSc in Diagnostic Radiography and also have HPC registration. Applicants should have good communication skills, the ability to multi-task and work as part of our existing team.&lt;/strong&gt;&lt;strong&gt; MRI experience is desirable but not essential, as training can be provided to a suitable candidate.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The directorate is committed to training and staff development and we offer a variety of training opportunities. As an organisation we aim to recruit those who uphold our values that are embedded in our belief to be a premier provider of health care in the region.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The contract on offer is based with MR, rotational across all 3 sites within STH, 37.5 hours per week, over 3 days, including weekends and participation on the MR on call rota out of hours is also expected.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you have a flexible approach to working patterns, wish to train and or specialise in MR, and are willing to work in a busy and challenging environment, then this post is for you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to the nature of this role, successful candidates will be required to complete a CRB disclosure application if this hasn’t already been previously documented.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This vacancy is advertised on a fixed term contract basis for the maximum period of 2 years. Where there is potential, the secondment/fixed term contract may finish early, or in the first instance, the secondment/fixed term contract may be extended due to the internal/external secondment of the substantive post holder. The fixed term contract status of the post holder will be reviewed in accordance with the Trust&#39;s legal obligations regarding fixed term contracts and secondments in relation to the substantive post holder.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCheryl WaddleJob titleMRI ManagerEmail addressCheryl.Waddle@nhs.netTelephone number0114 2269760&lt;/p&gt;\n&lt;p&gt;As part of the recruitment process at application stage, Sheffield Teaching Hospitals will assess applicants’ individual values and behaviours to ensure that these behaviours align with our PROUD values: Patient First, Respectful, Ownership, Unity and Deliver.&lt;/p&gt;\n&lt;p&gt;Our values are what help to make us different and ‘a Brilliant Place to Work’. We expect all our employees to share our values and demonstrate them in every aspect of their role.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake an online values assessment at application stage and the results of this assessment will be used as part of the on-going selection process to assess your suitability for the post.&lt;/p&gt;\n&lt;p&gt;The deadline for completing the online assessment is midnight 24/11/2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The link to the assessment can be found below, the address can be copied and pasted into a search engine e.g. google:&lt;/p&gt;\n&lt;p&gt; login.talentqgroup.com/Login/SelfService/GHVRKHMJCD&lt;/p&gt;\n&lt;p&gt;If you have any queries, require any assistance to complete this assessment or have already completed it within the past 12 months, please contact the Trust Recruitment Team at &lt;strong&gt;sth.centralrecruitment@nhs.net&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Hallamshire Hospital, Sheffield", "postalCode": "S10 2JF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3785", "longitude": "-1.49346"}}, "title": "MRI Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241994", "validThrough": "2020-11-07T23:59:59+0000"}