{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-27T10:16:08+0000", "description": "&lt;p&gt;* This is a Fixed Term Contract / Secondment opportunity until 30th August 2021 **&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you interested in working in a busy and acute surgical environment?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have excellent leadership and communication skills?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to be part of an innovative, proactive and friendly team?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We currently have an opportunity for an innovative, resilient and adaptable experienced nurse to join our team on Easton Ward. You will need to be highly motivated, have great communication skills and evidence of supporting and mentoring staff. We are looking for nurses with a proven ability to lead in a surgical setting and who are keen to drive change and service improvement on the unit.&lt;/p&gt;\n&lt;p&gt;EAUS is a varied, fast-paced, dynamic Emergency Assessment Unit for Surgery. We have a high turnover of patients as we take our own direct emergency admissions from GPs, clinics and A&amp;E. We assess and admit patients from nine surgical specialities including general surgery, urology, ENT, orthopaedic trauma, plastics and are committed to providing the highest standard of care for our patients. EAUS is divided into two parts a Surgical Ambulatory Emergency Care (SAEC) and a main 21 bed inpatient area (Easton ward.)&lt;/p&gt;\n&lt;p&gt;The unit is continually evolving and as a team we are always looking for new initiatives to improve and enhance our patient’s experience. We are a friendly, cohesive team and pride ourselves on our excellent assessment skills, allowing us to initiate specialised individual treatment plans and providing initial front line emergency care. We are passionate about encouraging our staff to develop their clinical skills and knowledge and believe we provide an environment which facilitates professional development.&lt;/p&gt;\n&lt;p&gt;The post holder will not only need to be a clinical lead, but will also be required to undertake bleep holding responsibilities for accepting patients and for managing surgical beds out of hours.&lt;/p&gt;\n&lt;p&gt;Includes evening and weekend working.&lt;/p&gt;\n&lt;p&gt;** If you are considering applying for this post on a secondment basis, please discuss with your Line Manager prior to applying to ascertain whether this could be supported **&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Part time:&lt;/strong&gt; 18 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Open for applications:&lt;/strong&gt; 27th October 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Close for applications:&lt;/strong&gt; 8th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rebecca Fish - Easton EAUS Sister&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel:&lt;/strong&gt; 01603 286514&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email: &lt;/strong&gt;rebecca.fish@nnuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Norwich University Hospital, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Deputy Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243969", "validThrough": "2020-11-08T23:59:59+0000"}