{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-13T13:31:15+0100", "description": "&lt;p&gt;Huddersfield Pharmacy Specials (HPS) is a NHS hosted Specials manufacturing unit. Our mission is to provide high quality, affordable specials throughout the UK to both Primary and Secondary Care. At HPS we manufacture a wide range of products including dermatological, oral and topical liquids, infusion fluids and ampoules. We also provide a bespoke packaging and labelling service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The facility has a MHRA Manufacturer “Specials” Licence (MS), a Wholesale Distribution Authorisation (WDA(H)) and a Manufacturer Licence for Investigational Medicinal Products (Clinical Trials) (MIA(IMP)).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;HPS has recently been transformed into a semi-autonomous division reporting to the CHFT Board through its own Management Board.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Regulatory and Clinical Affairs Manager will be responsible for further establishing and running the Regulatory Affairs function within HPS. The post holder will also be accountable for the development and submission of marketing authorisations and will manage an ongoing portfolio of licences and opportunities. The role will also involve management of clinical trial projects.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ideal candidate will have previous experience of working in a regulatory affairs function within a pharmaceutical company and would have successfully prepared and submitted a number of marketing authorisations for medicinal products. He or she will be a natural leader, display sound project management skills, be self-motivated, a team player and be able to work well under pressure. The successful candidate will be able to demonstrate that they can bring something extra to a high performing organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post reports to the Managing Director of HPS and is a full time role. For further information about the role please contact Dr Burrinder Grewal, Managing Director of Huddersfield Pharmacy Specials on 01484 355385.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Please be advised that should you be shortlisted for the post you will be contacted by e-mail via NHS Jobs – therefore we advise that you check your e-mail account on a regular basis.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date:, 6th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Burrinder GrewalJob titleManaging DirectorEmail addressburrinder.grewal@cht.nhs.ukTelephone number01484 355230&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield Royal Infirmary, Huddersfield", "postalCode": "HD3 3ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6548", "longitude": "-1.82227"}}, "title": "Regulatory and Clinical Affairs Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224482", "validThrough": "2020-11-20T23:59:59+0000"}