{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-22T14:31:47+0100", "description": "&lt;p&gt;&lt;strong&gt;Epsom &amp; St Helier University Hospitals NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locum Consultant General Anaesthesia &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term 12 Months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Department of Anaesthetics at Epsom and St Helier Hospitals is a friendly and supportive one. We have ACSA Accreditation from the Royal College of Anaesthetists, and we are extremely proud of this achievement. We welcome innovation and will support change where it improves care to our patients.&lt;/p&gt;\n&lt;p&gt;The Epsom and St. Helier University Hospitals NHS Trust has two main sites. Most of the elective work is done at Epsom site which also has a PACU and Level 2 care unit for medical patients. We also have a labour ward at both sites with over 2000 deliveries at Epsom site and around 3500 at St Helier’s. We cover many surgical specialities: General surgery including major colorectal; ENT; Orthopaedic, including spines, shoulders and hands as sub-specialities; Urology including lap nephrectomies and PCNL, Obs and gynaecology; Paediatric general, urology, orthopaedic and ENT. Paediatric surgery occurs in the Queen Mary Children’s Hospital on the St Helier site. This has a Children’s Day Unit, with an operating theatre and a dental procedure room.&lt;/p&gt;\n&lt;p&gt;All the surgical emergencies and most of trauma (level 2) are done at St Helier. The St Helier site has a level 3 ITU covered by Intensivists.&lt;/p&gt;\n&lt;p&gt;The posts will be split between the sites and out of hours working will be decided in line with development plans for increased cross site working. The aim is to improve clinical effectiveness by utilising consultants where they will be most effective. There will be opportunities for development of sub-speciality interests in line with these goals.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Marilyn Bartimeus&lt;br /&gt;Job title Clinical Lead&lt;br /&gt;Email address Marilyn.bartimeus@nhs.net&lt;br /&gt;Telephone number 020 8296 2102&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epson and St Helier Hospitals, Carshalton", "postalCode": "SM5 1AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3801", "longitude": "-.183166"}}, "title": "Locum Consultant in General Anaesthesia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238925", "validThrough": "2020-11-12T23:59:59+0000"}