{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-06T12:31:36+0000", "description": "&lt;p&gt;&lt;span&gt;Manchester University NHS Foundation Trust (MFT) was created in October 2017 as the result of a successful merger between Central Manchester University Hospitals NHS Foundation Trust and the University Hospital of South Manchester NHS Foundation Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This merge has made us the largest NHS Trust in England with 23000 employees and an annual turnover of £1.8billion. This was a major move towards the strategic aim of creating a ‘Single Hospital Service’ for the local communities of Manchester and Trafford. With other patients travelling from further afield to benefit from our exceptional specialist services. We are enjoying a fascinating period of transformation that promises to enhance the life outcomes of the local and regional population. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are delighted to invite applicants for a Consultant Vascular Interventional Radiologist at the Manchester University NHS Foundation Trust (MFT). Applications are sought from candidates who will join the team to deliver a high quality interventional and diagnostic vascular service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In October 2020 inpatient vascular surgery at Wythenshawe Hospital moved to Manchester Royal Infirmary creating a single MFT vascular Hub covering 1.8m population.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Looking to the future, MFT is working towards providing comprehensive across-region vascular surgical and vascular IR services to the whole of Greater Manchester, comprising a population of 2.8m people, with the vascular Hub based at Manchester Royal Infirmary. To support this vision we aim to establish a minimum 16 vascular interventional radiology (VIR) consultant workforce to provide a 2-in-16 two tier on-call service across Greater Manchester.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The appointees will work alongside the 10 existing Vascular Interventional Radiologists: Dr Edward Lake (Clinical Director), Dr Yassir Al-Radhi, Dr Stephen Butterfield, Dr Sam Byott, Dr Rosemary Cadwallader, Dr Can Hazar, Dr Nirmal Kakani, Dr Ananth Krishnan, Dr Dare Seriki and Dr David Thompson.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer a full range of intervention for patients with vascular disease including standard and complex endovascular aneurysm repair and management of peripheral arterial disease including a complex below knee vascularisation service. We work closely and collaboratively with our 13 vascular surgical colleagues to deliver the best outcomes for patients. As well as vascular surgery, the MFT VIR team support many other services across the trust including major trauma, hepatobiliary surgery, hepatology, urology, paediatric intervention, renal and pancreatic transplant surgery, plastic surgery, cardiology and cardiothoracic surgery including ECMO and heart/lung transplantation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is an excellent group of experienced specialist IR radiographers and nurses to support the service both in hours and on-call. There is a strong track record of supporting advanced practice development and extended roles. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The central site has two Siemens angiography suites, a fixed arm Siemens non-vascular suite and two high quality Siemens Hybrid theatres. There is a 16 bedded Radiology Day Unit (RADU) to support day case procedures. The Wythenshawe site has two state of the art GE Discovery hybrid theatres one of which is currently used for Vascular Radiology. There is a 5-bed day unit with plans to develop this unit in the near future. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;VIR consultants support a comprehensive vascular imaging service as well as many specialist MDTs. Alongside vascular imaging there are individual specialist interests in cardiac, urology and hepatobiliary imaging. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The current VIR on-call service is a 1 in 10 on-call rota providing the normal range of out of hours VIR interventions for aortic rupture, acute peripheral ischemia and visceral haemorrhage across MFT. The service also covers a further tertiary Hospital (Salford Royal) for Major trauma outreach as part of the Greater Manchester Major Trauma Network. A minimum 2 in 16 VIR on-call rota covering the whole of Greater Manchester is envisaged for the future. On-call VIR work at the trust can be complex and mentoring and support to develop experience can be provided to any successful candidate requiring it.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful candidates will reasonably be expected to work across multiple sites in line with the Hub and Spoke model of VIR service delivery and alongside the existing consultants. New appointees will be encouraged to develop sub-specialist interests and be supported to pursue clinical leadership development. The service is forward thinking and highly supportive of introducing new technologies and interve&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford Road &amp; Wythenshawe Hospital, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Consultant Vascular Interventional Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259675", "validThrough": "2020-11-19T23:59:59+0000"}