{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 pa. Inclusive of HCAS (15%)"}}, "datePosted": "2020-10-30T16:00:44+0000", "description": "&lt;p&gt;Staff Nurse - HDU/Theatre Maternity - 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen and we are seeking an innovative band 5 nurse to join our High Dependency Unit/recovery and multidisciplinary team. We are passionate about providing high quality care to women, babies and their families and promoting normality within the Delivery Suite setting. Decision making will be evidenced based and holistic in meeting women’s individual needs. This role will incorporate working with the midwives in both Labour ward and Obstetric theatres.&lt;/p&gt;\n&lt;p&gt;Kingston Hospital’s projected birth rate this year is approximately 5200 and our unit is the second biggest single site service in the country. We have a popular alongside midwifery led unit which delivers approximately 20% of women each year and will soon be implementing an Aromatherapy service. The Picker survey rated Kingston the best maternity service within the London sector for the last 5 years. The CQC report 2017 rating was outstanding for the Trust Leadership was strong and well respected and there was a culture of learning and a desire to improve the service.&lt;/p&gt;\n&lt;p&gt;We regularly provide in-house multidisciplinary training programme (including PROMPT) and staff have the opportunity to attend external study days or enroll for academic modules at our local higher education institutes. We will also train you to scrub in theatres for maternity cases.&lt;/p&gt;\n&lt;p&gt;Recent innovations are the implementation of a continuity of carer team for high risk women, an enhanced recovery pathway for women having caesarean section and a growing home birth team which has over 3% of women choosing this model of care. &lt;br /&gt;&lt;br /&gt;If you are a passionate nurse with excellent communication skills and a drive to provide high quality care to women, please apply to join our multi professional maternity team. &lt;br /&gt;&lt;br /&gt;Please see Job description before making your application.&lt;br /&gt;&lt;br /&gt;Assessment and Interview Date: Interview Date to be confirmed&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gayle Oliver, Team Leader, on gayle.oliver@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maternity, Kingston Hospital NHS Foundation Trust, Kingston upon Thames", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Staff Nurse - HDU/Theatre Maternity", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250851", "validThrough": "2020-11-11T23:59:59+0000"}