{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 to £87,754 pa"}}, "datePosted": "2020-11-05T13:00:19+0000", "description": "&lt;h1&gt;&lt;span&gt;&lt;strong&gt;Associate Director of Nursing -&lt;/strong&gt;Leeds Teaching Hospitals&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leeds Teaching Hospitals NHS Trust is one of the largest NHS Trusts in the UK. Our vision is to be the best for specialist and integrated care. Our goals are to be the best for patient safety, quality and experience; to be a centre of excellence for specialist services, research, education and innovation; to offer seamless integrated care; to be financially sustainable and the best place to work. As an organisation rated Good by the Care Quality Commission our ambition is to achieve Outstanding. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are pleased to advertise the post of Associate Director of Nursing as a 12 month secondment, working closely with the Chief Nurse and team across the Corporate Nursing functions&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Associate Director of Nursing provides professional leadership to Nurses and Midwives across the Trust to support the delivery of safe, effective and compassionate care. They are a key member of the Executive Chief Nurse team and one of the key posts supporting delivery across the breadth of the Chief Nurse portfolio. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Associate Director of Nursing will support in the translation of emerging national policy into Trust policy, guidance and practice and the continued development and implementation of the Trust’s Nursing and Midwifery Strategy. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will support a team of Heads of Nursing and Service to ensure that the required national and Trust nursing and midwifery policies and clinical practice standards are in place and that the Corporate Nursing team support and enable their delivery within the CSU’s through working in partnership with the CSU Heads of Nursing. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Associate Director of Nursing will work with the Deputy Chief Nurse and the Directors of Nursing (Operations) and provide assurance that services are provided in line with our goals and by following the Leeds Way Values. The Associate Director of Nursing provides visible and accessible professional leadership across the Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates must have the ability to work strategically and at system level, to build credibility, inspire confidence and positively influence staff and stakeholders at all levels. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will contribute to The Leeds Way; a culture which is demonstrated by being patient centred, empowering staff, promoting personal accountability, is fair and collaborative and delivers continuous improvement via the Leeds Improvement Method.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for outstanding candidates with extensive experience of delivery in senior leadership roles who will be committed to delivering high quality patient care in The Leeds Way.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information and to become part of Leeds Teaching Hospitals Trust, please contact Lisa Grant, Chief Nurse: lisa.grant5@nhs.net and Helen Christodoulides Deputy Chief Nurse &lt;/span&gt;&lt;span&gt;Helen.christodoulides@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122916.jpg", "name": "Chief Nurse", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122916"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Associate Director of Nursing (XR11)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257746", "validThrough": "2020-11-12T23:59:59+0000"}