{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T16:16:46+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 5 RGN to join our friendly, dynamic and forward thinking team within Interventional Radiology which is looking to expand its services. The Interventional Radiology Suite performs elective day case and urgent in patient procedures such as vascular angioplasty, fistuloplasty, Hickman line insertion and biopsies, nephrostomies, biliary work and embolization which are then recovered in the adjacent day unit.&lt;/p&gt;\n&lt;p&gt;The Royal Wolverhampton NHS Trust is part of the Black Country Provider Partnership and the Interventional Radiology Suite is working alongside three other hospitals to provide a 7 day/ 24hr on call service for haemorrhage control and treatment of life threatening sepsis.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic individual who thrives on a fast paced environment, is caring, compassionate and committed to delivering high quality standards of care. You will be expected to work alongside experienced consultants’ as a second assistant within a theatre environment and participate in the co-ordination and implementation of pre, peri and post-operative care for acute and chronically ill inpatients attending Interventional Radiology.&lt;/p&gt;\n&lt;p&gt;The interested applicant will undertake or be willing to undertake specialist clinical practices ie scrub nurse, working in an environment that will involve ionising radiation and the wearing of a lead apron.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication skills and be expected to offer support to patients and the nurse in charge in their absence by reviewing staff rotas and skill mix.&lt;/p&gt;\n&lt;p&gt;The trust is committed to supporting personal and academic development for highly motivated nurses via nursing fellowship and relevant courses affiliated to local universities&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJayne MolinaJob titleSisterEmail addressjayne.molina@nhs.netTelephone number01902 307 999 ext 6346Additional contact information&lt;/p&gt;\n&lt;p&gt;Contact Sister Jayne Molina Radiology Department, New Cross Hospital on 01902 307999 ext 6344/46&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Cross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Staff Nurse - Radiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241280", "validThrough": "2020-11-08T23:59:59+0000"}