{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-27T11:16:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 – Waste &amp; Compliance Manager Advert:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join the Capital, Estates &amp; Facilities Department at Cardiff &amp; Vale University Health Board as a Waste &amp; Compliance Manager.&lt;/p&gt;\n&lt;p&gt;The Estates &amp; Operational Services Department currently have a position as a Waste &amp; Compliance Manager to work alongside and support the Estates Manager in the strategic and continual development of the Waste Department.&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced and enthusiastic waste and facilities individual to support the continual service provision of one of the largest Health Boards in Wales.&lt;/p&gt;\n&lt;p&gt;The department is going through an exciting time of Service Improvement to increase the support and enhance the patient experience ensuring the department is fit for the future.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit someone who will ensure that we will excel in providing a safe, organised and highly efficient service, a person who can be innovative in their thinking and have the ability to make decisions for themselves, someone who can develop and support the modernisation of the department ensuring we are fit for the future.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have to demonstrate experience and competency in a range of Operational and Waste Services and show their aptitude for effective planned and reactive support.&lt;/p&gt;\n&lt;p&gt;You will need to work in close partnership with your Capital, Estates and Facilities colleagues to ensure the smooth running of the service and Waste Operation, and you will be key to the success of the Waste Departments ongoing commitment.&lt;/p&gt;\n&lt;p&gt;There is a requirement to work across all sites in Wales’ largest Hospital and University Health Board.&lt;/p&gt;\n&lt;p&gt;You will be the front line staff for waste management related issues and will need to be able to support these along with the competing priorities, distractions and unpredictable work patterns caused by the operational nature of the role.&lt;/p&gt;\n&lt;p&gt;You will need to be flexible, calm under pressure and have excellent communication skills to effectively support and continue to complete work and manage the expectations of staff from all areas of the Health Board. Your success will show through the effectiveness of work undertaken and your primary focus will be to support the continual provision for the Hospital.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply&lt;/p&gt;\n&lt;p&gt;Excellent staff benefits including onsite day nursery and holiday play scheme, onsite staff club including indoor heated swimming pool, fully equipped gym, badminton and squash courts.&lt;/p&gt;\n&lt;p&gt;Cardiff is the vibrant Capital City of Wales where a good quality of life can be achieved, with affordable housing in the locality, good schools and excellent sporting and cultural events at venues such as the Principality Stadium, the Millennium Centre and many others.&lt;/p&gt;\n&lt;p&gt;The attractive Welsh coastline and Brecon Beacons National Park are also a convenient day trip away.&lt;/p&gt;\n&lt;p&gt;References will be required to cover a minimum of three years of previous employment and/or training.&lt;/p&gt;\n&lt;p&gt;In view of Border Immigration Agency regulations, all applicants must state their current immigration status including expiry dates.&lt;/p&gt;\n&lt;p&gt;A Disclosure Check will be required of the successful candidate.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 10th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gareth Simpson&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Estates Manager (North) -Estates Department&lt;/p&gt;\n&lt;p&gt;Capital, Estates &amp; Facilities&lt;/p&gt;\n&lt;p&gt;University Hospital of Wales&lt;/p&gt;\n&lt;p&gt;Tel: 02920 743966&lt;/p&gt;\n&lt;p&gt;Mob: 07967 588310&lt;/p&gt;\n&lt;p&gt;Internal: 43966&lt;/p&gt;\n&lt;p&gt;Email: gareth.simpson@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cardiff &amp; Vale University Health Board wide, Cardiff", "postalCode": "CF14 4XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5068", "longitude": "-3.18937"}}, "title": "Waste &amp; Compliance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244197", "validThrough": "2020-11-10T23:59:59+0000"}