{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24926", "minValue": "23521", "unitText": "YEAR", "value": "£23,521 - £24,926 pa inc plus Outer London HCAS"}}, "datePosted": "2020-11-03T13:30:55+0000", "description": "&lt;p&gt;We are currently looking to recruit a Clinical Support Work within the Child and Adolescent Mental Health Operational Directorate&lt;/p&gt;\n&lt;p&gt;We expect the nursing team to be at the centre of leading the unit and an integral part of the young people’s recovery. To achieve this, we need excellent Senior Healthcare Support Workers who are able to communicate and engage with young people in a variety of ways and able to contribute to a non-judgemental and supportive environment, with appropriate boundaries and limits. With this in mind we are looking for candidates with a range of past experiences and qualifications, but most importantly individuals that are resilient, robust and possess the desire and enthusiasm to work with young people experiencing acute mental illness.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to gain further clinical experience in a CAMHS setting and/or commence on a development pathway offered by the Trust, which can lead to further opportunities as a support worker. We are therefore looking for candidates who want to develop a career as a support worker within CAMHS and may have limited mental health experience within CAMHS (but other mental health experience), or those candidates who wish to gain further experience for a short period.&lt;/p&gt;\n&lt;p&gt;The post holder will be considered for the national Apprenticeships Scheme to complete a 12 month development programme on the job; in line with the Apprenticeships Standards (2017).&lt;/p&gt;\n&lt;p&gt;In order to deliver the high quality of care we believe our young people deserve, we have recruited a full nursing team with high patient/staff ratios and in addition a comprehensive multidisciplinary team. We engage with young people and their families and provide a wide range of interventions through a full and diverse daily programme .The nursing team is at the centre of leading the unit and are an integral part of the young people’s recovery. In order to deliver the high quality of care we believe our young people deserve, we are recruiting Senior Support Workers to work alongside Nurses and a multidisciplinary team which consists of Doctors, Clinical Psychologist, Systematic Family Therapist, Occupational Therapist and education staff, to engage with young people and their families and provide the range of interventions they need in a full and diverse daily programme.&lt;/p&gt;\n&lt;p&gt;The CAMHS Directorate are delighted to have opened a PICU for young people aged 12-18 in 2018, filling a much needed gap in service provision across South London. We provide an 8 bedded mixed sex unit for young people with an acute mental health illness who cannot be safely cared for on a general unit.&lt;/p&gt;\n&lt;p&gt;SLaM has the largest and most specialised CAMHS services in the country and is on the forefront of personalised support for young people and children. We want to recruit professionals who have a real understanding for the needs of the CAMHS group, who can bring innovation and change to our growing services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters is located at Denmark Hill less than 5 minutes from the train station (zone 2). We also provide services and operate across other locations, such as London boroughs of Croydon, Lambeth, Lewisham and Southwark; and substance misuse services for residents of Bexley, Lambeth, Greenwich and Wandsworth.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKathryn SamTelephone number0203 228 4219Additional contact information&lt;/p&gt;\n&lt;p&gt;Kathryn Sam - 0203 228 4219&lt;/p&gt;\n&lt;p&gt;Will Brackenbury - 0203 228 4637&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bethlem Royal Hospital, Beckenham", "postalCode": "BR3 3BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3809", "longitude": "-.029726"}}, "title": "Clinical Support Work", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254147", "validThrough": "2020-11-08T23:59:59+0000"}