{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-02T16:47:27+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;An exciting opportunity has arisen to the join the Continuing Healthcare team based in Middlesbrough for experienced General, Mental Health or Learning Disability nurses. We are looking to recruit nurses who have experience in Continuing Healthcare (CHC) to work with patients and families to support the assessment and review process for NHS Continuing Healthcare and Funded Nursing Care (FNC) as part of our response to the COVID-19 outbreak. Key responsibilities will be to assist in the implementation and delivery of the NHS National Framework for CHC and FNC. You will work alongside Local Authority partners and other professionals to undertake comprehensive assessments to determine eligibility for CHC and FNC. The role may also include supporting the wider CHC work within the team and you will work closely with other CHC nurses and administration staff who support these processes. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will develop a strong link with and colleagues from external organisations such as Adult Social Care, Nursing/Residential Care Homes, Domiciliary Care Providers, clinical services staff across the Primary Care Trust, Acute Trusts and other CCGs. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be expected to have excellent communication, organisational and assessment skills. Due to COVID-19, our service is not routinely undertaking face to face assessments and you should be able to work virtually and to undertake face to face assessments when necessary. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are motivated by working within and for an innovated and integrated health care provider, then this is the post for you&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Interviews for successful applicants will be held w/c 2&lt;/span&gt;&lt;span&gt;nd&lt;/span&gt;&lt;span&gt; November 2020, should you have any queries or require any further information please contact Kendra Lannon, Locality Manager on 01642 746543 or &lt;/span&gt;&lt;/span&gt;&lt;span&gt;kendra.lannon@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North of England Commissioning Support", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Middlesbrough", "postalCode": "TS2 1RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5857", "longitude": "-1.25212"}}, "title": "Nurse Asssessor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252931", "validThrough": "2020-11-09T23:59:59+0000"}