{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 Per Annum Pro Rata"}}, "datePosted": "2020-11-03T17:00:17+0000", "description": "&lt;p&gt;County Durham and Darlington NHS Foundation Trust is one of the largest integrated care providers in England, serving a population of around 600,000 people. We are a high performing organisation with a track record of success.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for experienced Advanced Clinical Practitioner band 8a to join our Emergency Departments in Darlington Memorial Hospital and University Hospital of North Durham. We require dynamic and enthusiastic ACP’s to lead on a transformational change in care delivery. Both departments are fast paced which sees a high turnaround of patients, providing comprehensive plans of care until discharge to transfer. This is a very exciting time as we have recently acquired substantial investment in the expansion of both Emergency Departments and the development of co-located Same Day Emergency Care (SDEC). As an ACP you will be able in a position to influence and affect emergency care as we continue to develop our innovative ways of working across both areas. The post holder will provide leadership in the delivery of care for people in their care, by acting as an autonomous practitioner. On a day to day they will be responsible for complex decision-making including the assessment, examination, investigation and planning the delivery of care to an undifferentiated ED patient. They will appear on the medical middle grade rota- complementing it but always on duty with either a middle grade or consultant. They will act in the best interests of people, putting them first and providing care that is person-centered, safe and compassionate. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking to build a substantial team to share the vision we have. The individuals must be experienced in the role of an ACP in emergency care. You will be a clinical role model and have the willingness to develop the team as well as your own professional growth. You will be strong, motivated and enthusiastic, with excellent leadership skills and the ability to problem solve effectively. The successful post holder should be an excellent communicator with all stakeholders and a must for this role is positivity and the ability to be proactive in this extremely fast paced environment. We would like you to be able to demonstrate an understanding of current issues in emergency care and be able to translate this in to quality care. You will be expected to develop the more junior ACP&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We value experience and skills learnt elsewhere and we will work with you to enable those skills, to be utilised and developed further. As an ACP you will assist in promoting change and developing this role. You will be supported by the Clinical Director in Emergency Medicine and the senior ED team in realising this vision. We would be happy to provide any further information.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;There is a degree of flexibility with working hours; further information is available from the department.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Please note this position requires a Disclosure Barring Service check (DBS) formerly CRB. &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington Memorial Hospital", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Acute Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254858", "validThrough": "2020-11-18T23:59:59+0000"}