{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "per annum"}}, "datePosted": "2020-10-12T09:46:31+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Community Paediatrician&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;10 PA&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work with a team of dynamic and experienced community paediatricians who provide a full range of community paediatric services, in an active and progressive department. The Community Paediatric team is based at Kaleidoscope, Lewisham Centre for Children &amp; Young People which provides a comprehensive range of co-located services for children and young people who have developmental needs, disabilities, significant additional mental health, social care or special educational needs.&lt;/p&gt;\n&lt;p&gt;We are committed to excellence in child and family centred care and professional development. We work closely with multiagency teams and acute paediatric colleagues in providing clinical care, quality improvement and teaching. Lewisham Community Children and Young People’s Services were rated as outstanding following CQC inspection in 2017.&lt;/p&gt;\n&lt;p&gt;The Trust welcomes candidates who wish to work flexibly or in a job share.&lt;/p&gt;\n&lt;p&gt;To apply for this post, you must demonstrate eligibility for full UK GMC registration and entry onto the GMC Specialist Register or equivalent.&lt;/p&gt;\n&lt;p&gt;Please complete the on-line application form ensuring that you upload a copy of your recent CV to support your application, including the names, addresses, telephone numbers and e-mail addresses of three referees (one of whom should be your current or most recent employer/clinical supervisor). If you are not on the specialist register please also ensure you enclose evidence/confirmation that you will be on the specialist register or have a CCT within 6 months of the interview date.&lt;/p&gt;\n&lt;p&gt;You can contact the Medical Personnel Department on 020 3149 6449&lt;/p&gt;\n&lt;p&gt;Interview Date: 17th December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Brindha Dhandapani, Clinical Director, Community Children and Young People Services, Email addressbrindha.dhandapani@nhs.net, Telephone number 07736807494&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kaleidoscope, Lewisham Children and Young People Centre, Lewisham", "postalCode": "SE6 4JF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.45", "longitude": "-.017486"}}, "title": "Consultant Community Paediatrician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221744", "validThrough": "2020-11-08T23:59:59+0000"}