{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. pro rata"}}, "datePosted": "2020-10-26T14:46:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Come Nurse with us…&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals NHS Foundation Trust is one of the largest teaching Trusts in the country. It comprises Addenbrooke’s Hospital and the Rosie Hospital. We provide accessible high-quality healthcare for the local people of Cambridge and regional and national specialist services. It’s a great place to nurse, work and live.&lt;br /&gt;&lt;br /&gt;You will work on a vibrant hospital campus with a friendly community feel; we have excellent facilities to practise your skills and abilities to support your career pathway and development. Our values of &lt;strong&gt;Together – Safe, Kind, Excellent&lt;/strong&gt; support the delivery of outstanding care. We have a fully electronic patient record system that is improving health-care quality; this is transforming services, improving patient safety and clinical outcomes.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We are looking for innovative Critical Care nurses to join our Critical Care Practice Development &amp; Education Team. You must have excellent clinical and communication skills.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;As a Practice Development Nurse you must be able to demonstrate a commitment to developing the service and staff, improving the patient experience and show evidence of clinical leadership. You will work across all Critical Care Units to facilitate education, training, research and professional development for all staff through formal and informal teaching.&lt;br /&gt;&lt;br /&gt;In return for your dedication and hard work, we offer excellent opportunities for all staff which will include local education, leadership and development programmes as well as courses at degree or masters level.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;This is an exciting opportunity for a person with vision, and a passion for patient centred care and development of nursing within this area.&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;Closing date: 8 November 2020&lt;br /&gt;&lt;br /&gt;Interviews are due to be held on 17 November 2020&lt;br /&gt;&lt;br /&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00 . This fee will be deducted from your second month’s salary.&lt;br /&gt;&lt;br /&gt;A welcome subsidy of £1000 is available to all Band 5 and Band 6 Nurses, Midwives, ODPs and Radiographers taking up substantive employment with the Trust.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Why choose Cambridge University Hospitals?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our values and reputation for outstanding care&lt;/li&gt;\n&lt;li&gt;Opportunities to experience a range of specialities&lt;/li&gt;\n&lt;li&gt;Career and development opportunities&lt;/li&gt;\n&lt;li&gt;Preceptorship and mentoring programmes delivered by a dedicated clinical education support team&lt;/li&gt;\n&lt;li&gt;Research experience and opportunities&lt;/li&gt;\n&lt;li&gt;£1000 Welcome Subsidy on commencement and up to a further £3000 loan to support your resettlement and contribute towards a deposit or first months’ rent subject to eligibility&lt;/li&gt;\n&lt;li&gt;Lovely location and quality of life&lt;/li&gt;\n&lt;li&gt;Excellent schools/colleges and transport links (road, rail and air)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Jo Beaumont&lt;br /&gt;Job title: PD Senior Sister&lt;br /&gt;Email address: joanna.beaumont@addenbrookes.nhs.uk&lt;br /&gt;Telephone number: 01223 217258&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division A, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Critical Care -Practice Development Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242945", "validThrough": "2020-11-08T23:59:59+0000"}