{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum"}}, "datePosted": "2020-10-23T12:01:21+0100", "description": "&lt;p&gt;&lt;strong&gt;Somerset NHS Foundation Trust - Musgrove Park Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialty Doctor / Trust Registrar in General Surgery Commencing in Upper GI and Bariatric Surgery.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a Trust Registrar/Specialty Doctor in Bariatric and Upper GI Surgery. A replacement post is required to support the Bariatric and Upper GI Surgery department on a 12 month fixed term contract. The post will be based at Musgrove Park Hospital, Taunton for elective surgery, outpatient work and on-call. The successful applicant will work at Middle Grade level and opportunities will be available to develop surgical skills and gain experience in benign UGI and bariatric surgery. The successful applicant will contribute to the Middle Grade General Surgical on-call rota (currently 1: non resident) which is supported by CT1/2 and F1 on-call tiers.&lt;/p&gt;\n&lt;p&gt;The Trust has an enthusiastic and expanding Upper GI and Bariatric team comprising 5 Consultants, 1 Post-CCT Fellow, 1 Specialist Registrar, 1Trust Registrar (this post), 2 ST1/2 and 3 F1 doctors and it is supported by the full range of support staff including UGI CNP, Bariatric nurse specialists, Bariatric dieticians and psychologists. The team works closely with Gastroenterology, Endoscopy and Endocrinology.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Somerset NHS Foundation Trust is the first NHS trust on the English mainland to provide community, mental health and acute hospital services. We work with health and social care partners in Somerset to ensure that we deliver outstanding services that meet the needs of our population.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Our trust was formed on 1 April 2020 when Somerset Partnership NHS Foundation Trust and Taunton and Somerset NHS Foundation Trust merged. We provide community and mental health services across the whole of Somerset and acute hospital services in the north, west and centre of the county and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In addition to this, you will get to experience life in the West Country. Nestled in the heart of Somerset as the County town, Taunton has recently been named as one of the new ‘Garden Towns’. It has a diverse range of shopping and restaurants, hosts a number of arts and food festivals and is home to the county cricket ground regularly hosting international fixtures, including the recent Cricket World Cup. If you like the outdoors, nearby you will find national hotspots for cycling from gentle meanders through the Levels to challenging routes in the Quantock Hills or choose from over 1000 climbing routes at Cheddar Gorge. Straddled between areas of outstanding natural beauty and the idyllic rolling hills of Exmoor, there is plenty to keep you occupied.&lt;/p&gt;\n&lt;p&gt;Somerset offers some of the best schools in the country. Ranging from Public institutions such as Millfield, Queen’s College, Taunton School, King’s College, Wellington School and Blundell’s just across the border in Devon, to award winning state schools such as the Richard Huish College which has been ranked in the top 10 of A-level providers nationally for the last eight years, through to secondary schools ranking in the top 5% nationally such as The Castle school.&lt;/p&gt;\n&lt;p&gt;With great educational opportunities, an abundance of open country side, cultural festivals and local traditions, we think there is nowhere better. Throw in a cost of living that will see you afford a higher quality of life, and significantly lower than the national average crime rate, we like to think we can offer you the best of both worlds, professionally, and personally.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contact Details/Interview Dates:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information please contact Mr Hamish Noble / Mr David Mahon / Mr Richard Welbourn / Mr Matthew Mason / Miss Hollyman (01823 342100) or email their secretary Rachel.Tough@somersetft.nhs.uk for more information about the post.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the application process for this role please contact Jordan Pollard, Medical Recruitment Consultant on 07765898212 or Jordan.Pollard@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Musgrove Park Hospital, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Specialty Doctor - General Surgery in Upper GI and Bariatric Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240427", "validThrough": "2020-11-22T23:59:59+0000"}