{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per annum / pro rata"}}, "datePosted": "2020-10-28T15:46:21+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic, confident, motivated and hard working registered nurse to join our Infection Prevention and Control Team. You should have significant experience at band 6 or above. You should have experience of managing and dealing with infection prevention and control issues, participating in audits and have experience of supporting change management. You must be able to work and adapt to the challenges presented within the friendly supportive team.&lt;/p&gt;\n&lt;p&gt;You will be expected to have the ability to work closely with other members of the Multi &lt;br /&gt;Disciplinary Team.&lt;/p&gt;\n&lt;p&gt;The role will involve teaching and training staff at all levels, support will be provided initially. The ability to make decisions, work well within a team, as well as being able to work independently is essential. The nurse will have excellent communication skills, be able to work flexibly and be committed to meeting deadlines and targets. You must display a passion for high quality patient focused care.&lt;/p&gt;\n&lt;p&gt;The postholder will be expected to work cross site which will include travelling to both The Royal Shrewsbury Hospital and The Princess Royal Hospital, Telford. The hours of work will be Monday to Friday 09.00 to 17.00.&lt;/p&gt;\n&lt;p&gt;Please refer to the Job Description and the Person Specification for further details of the role and the skills, qualifications and experience required.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJanette PritchardJob titleLead Nurse Infection Prevention and ControlEmail addressJanette.Pritchard2@nhs.netTelephone number01743 261000 ext 1134&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Princess Royal Hospital, Telford", "postalCode": "TF1 6TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7124", "longitude": "-2.51054"}}, "title": "Infection Prevention and Control Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247246", "validThrough": "2020-11-11T23:59:59+0000"}