{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51724", "minValue": "32896", "unitText": "YEAR", "value": "£32,896 - £51,724"}}, "datePosted": "2020-11-05T12:46:23+0000", "description": "&lt;p&gt;&lt;strong&gt;CARDIFF AND VALE UNIVERSITY UHB&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Research Fellow in Internal Medicine and Acute Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;(StR Higher Level)&lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of Clinical Fellows in the Directorate of Internal Medicine and is available from 3rd February 2021 until 3rd August 2021. The post will consist of 50% research/teaching and 50% clinical duties. Post holders will work in the University Hospital of Wales and University Hospital Llandough in Cardiff and may be of one or two years’ duration depending on applicants’ preference.&lt;/p&gt;\n&lt;p&gt;Candidates wishing to take time out of programme will find these posts very attractive. Post holders will benefit from a broad experience in General Internal Medicine and Acute Medicine in a teaching hospital environment, together with opportunities to develop tailored projects in:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Research&lt;/li&gt;\n&lt;li&gt;Teaching&lt;/li&gt;\n&lt;li&gt;Quality improvement&lt;/li&gt;\n&lt;li&gt;Leadership and Management&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Appointees will have 50% of their time devoted to one of these activities and 50% to clinical duties, participating in the out-of-hours medical rota.&lt;/p&gt;\n&lt;p&gt;Applications are encouraged from trainees in General Internal Medicine with sufficient clinical skills and experience making them capable of working at middle-grade level in an acute intaking environment.&lt;/p&gt;\n&lt;p&gt;Cardiff offers tremendous opportunities for those seeking an excellent work/life balance. The city, which can be crossed by bicycle in 30 minutes, is vibrant and dynamic and amply caters for those with an interest in music, theatre, and world class sport. Cardiff is accessible to the Brecon Beacons, pictured above, which can be reached in 45 minutes. Wonderful beaches on the Gower peninsula and world class mountain biking routes are equally accessible. These factors, together with affordable housing and good state schools are some of the reasons why Cardiff is one of the most attractive cities in the UK&lt;/p&gt;\n&lt;p&gt;There are no current plans to change junior doctors pay or conditions in Wales.&lt;/p&gt;\n&lt;p&gt;Cardiff and Vale University Health Board is a teaching Health Board with close links to Cardiff University - ranked 4&lt;span&gt;th&lt;/span&gt; in the UK for research output, with particular strengths in infection and immunity, and neuroscience. The new Cardiff University Brain Imaging Centre (CUBRIC) is one of only three UK centres equipped with a 7-Tesla MRI scanner. There has been a recent complete overhaul of the medical school curriculum, with an emphasis on small group teaching and self-directed learning which would offer appointees significant opportunities to develop an interest in teaching. The Health Board actively encourages innovation and those interested in quality improvement projects will be strongly supported. Applicants interested in pursuing an interest in clinical leadership and management will be offered academic development opportunities and close mentoring from senior clinical leaders within the organisation.&lt;/p&gt;\n&lt;p&gt;The Health Board has budgets to share between primary and secondary care and function as Integrated Health Boards across the Health System.&lt;/p&gt;\n&lt;p&gt;References will be required to cover a minimum of three years of previous employment and/or training&lt;/p&gt;\n&lt;p&gt;In view of Border Immigration Agency regulations, all applicants must state their current immigration status including expiry dates.&lt;/p&gt;\n&lt;p&gt;A Disclosure Check will be required of the successful candidate&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHemanth BolusaniJob titleClinical DirectorTelephone number02920 744698Additional contact information&lt;/p&gt;\n&lt;p&gt;Hemanth Bolusani, Clinical Director for Integrated Medicine- 02920 744698&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Medical - General Medicine UHW, Cardiff", "postalCode": "CF14 4XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5068", "longitude": "-3.18937"}}, "title": "FTSA Clinical Research Fellow - Acute and Internal Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257715", "validThrough": "2020-11-19T23:59:59+0000"}