{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 per annum"}}, "datePosted": "2020-10-30T14:16:27+0000", "description": "&lt;p&gt;We are looking for an enthusiastic, highly motivated and proactive Employee Relations Advisor with excellent communication skills, the ability to build strong working relationships who can work flexibly and independently. The post offers an exciting opportunity to use your people skills within our well established Employee Relations Team to really make a difference.&lt;/p&gt;\n&lt;p&gt;This role provides a fantastic opportunity to support our managers’ requirements to deliver perfect care. The postholder will be responsible for providing effective, proactive ER support and advice to management of services within the Trust.&lt;/p&gt;\n&lt;p&gt;Key responsibilities will include provision of first line advice on Agenda for Change Terms and Conditions and HR Policies and Procedures, together with supporting managers through a range of employee relations processes including attendance and performance management e.g. conduct and grievances; sickness absence management and change management.&lt;/p&gt;\n&lt;p&gt;In order to fulfil this ambitious role you will be CIPD qualified (Level 5 or equivalent) with the understanding of delivering a varied HR portfolio, in particular employee relations activity, ideally in a Unionised environment. A self-starter, with a keen values-driven commitment to the NHS, you will need to demonstrate an ability to work flexibly and deliver outcomes that meet the needs of the business. Confident in your ability to deal with people in all situations and negotiate and influence to reach agreement whist demonstrating empathy, you’ll also need to be comfortable working in a timely manner and meeting deadlines when managing an employee relations caseload.&lt;/p&gt;\n&lt;p&gt;This position will be trustwide covering all of United Lincolnshire Hospitals NHS Trusts sites and travel to other sites will be required. Our sites are based at Lincoln County Hospital, Pilgrim Hospital, Boston and Grantham &amp; District Hospital - some travel to Louth Hospital may be required.&lt;/p&gt;\n&lt;p&gt;If this opportunity excites you and you want to be part of a team who are committed to showing the difference excellent people management and development can make to front line care services, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSheila DonaldsonJob titleEmployee Relations ManagerEmail addresssheila.donaldson@ulh.nhs.ukTelephone number01522 707224&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln County Hospital, Greetwell Road, Lincoln, LN2 5QY, Lincoln", "postalCode": "LN2 5QY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2336", "longitude": "-.51965"}}, "title": "Employee Relations Adviser - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250507", "validThrough": "2020-11-15T23:59:59+0000"}