{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-11-02T11:43:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Service Manager (Band 8A)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;South Staffordshire &amp; Shropshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;37.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a highly motivated, dynamic individual to become part of our Eating Disorders Service. The successful candidate will have 24 hour responsibility for the management and clinical leadership of the Eating Disorder Service (EDS) Inpatient ward (Kinver) and Community Services (Staffordshire and Shropshire). You will be responsible for the safe management of day to day operations as well as ensuring continual development/innovation of the EDS and ensuring a high quality service for our patients and families/carers. Additionally, you will be part of the Leadership team for the West Midlands Eating Disorders Provider Collaborative.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is a really exciting time to become part of our Eating Disorders team. We are the Lead Provider for the West Midlands Eating Disorder Provider Collaborative in Partnership with the all of the NHS and Private Eating Disorders Providers. Provider Collaboratives enable devolvement of specialised commissioning to local areas, using clinically led models with the focus on support closer to home, improved models of care and pathways, local ownership, alternative local solutions, better use of overall resources, move to prevention and recovery models. Through the collaborative we have developed a strong clinical model focussed on achieving better outcomes for our patients. We have a centralised bed management process and single point of access. We have supported development of community provision and innovation where there have been gaps. Other successes have been the reduction of out of area placements and reduction of length of stay. The recruitment of a peer recovery worker and clinical co co-ordinator working to support where there are identified gaps in provision across the area. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is so much more to be achieved and if you are the person that can help us to innovate to ensure the best possible outcomes for our patients we want to hear from you&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Melanie Watson, Head of Operations/Provider Collaborative Lead, Telephone 01785 221479 or email &lt;/span&gt;&lt;span&gt;melanie.watson@mpft.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Closing Date for applications: &lt;/span&gt;&lt;span&gt;22&lt;/span&gt;&lt;span&gt;nd&lt;/span&gt;&lt;span&gt; November 2020&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interview date: &lt;/span&gt;&lt;span&gt;4&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; December2020&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stafford/Shropshire", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Service Manager Eating Disorders", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251858", "validThrough": "2020-11-22T23:59:59+0000"}