{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum, inc HCA"}}, "datePosted": "2020-10-26T14:47:07+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Emergency Department (ED) is one of the busiest in London, and sees approximately 135,000 patients per year including nearly 30,000 children and young people. As a Major Trauma Centre (MTC) for South East London and Kent, the ED receives patients from 2 ambulance services and 2 different air ambulance providers. It is one of the few centres in London to have its’ own designated Helipad. It is also a regional centre for Hyper Acute Stroke and primary angioplasty. Our Emergency Department now has a 10 bedded resuscitation area with a nursing ratio of 2:1. We provide care to patients from a diverse inner-city population and believe that the diversity of the local population is reflected in our staff in all grades and recruitment strategy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are committed to developing our nursing staff and we have strong links with King’s College London, London South Bank University and City University. We also have an ED dedicated Practice Development Team across the adult and children’s areas and we are able to offer the advanced assessment, HDU, ENP, BSc and Masters level postgraduate education. In addition we have a number of resuscitation courses on offer including; ALS, APLS, ATNC and variety of simulation based training courses such as Trauma Team Members and Trauma Team Leaders as well as our own in-house training.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We also offer access to Emergency Nurse Practitioner (ENP) and Advanced Clinical Practitioner (ACP) programmes. We already have an established Trauma Nurse Coordinator (TNC) team who are based in the ED who manage and plan care for trauma patients through their entire hospital stay. There is also the opportunity for staff to access our on-site Resuscitation Officers as well as the Trauma Nurse Coordinators, who offer on-going support in terms of professional growth and development. As an Academic Health Science Centre (AHSC) we are seeking to establish the ED as an academic and research department with the support of our critical care colleagues.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Why not become part of the team delivering excellent care?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are currently recruiting dedicated and enthusiastic nurses for the band 6 senior staff nurse role. We are looking for motivated, innovative nurses with strong clinical knowledge &amp; skills, excellent communication skills who are able to demonstrate suitability and experience for the position. You will need to be flexible, enthusiastic and passionate about emergency care and you need to be committed to improving service delivery.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To be considered for this role, you will be a registered nurse with demonstrable clinical expertise, relevant to the ED. You will also be in possession of an Emergency Nursing Course and Mentorship Course (or working towards these courses). The ATLS (observer) or ALS Provider Course would be desirable, recent acute experience in an acute setting is essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLaura BurnetJob titleSenior SisterEmail addresslaura.burnet@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;Clyve Davis-Turner - Matron: clyve.davis-turner1@nhs.net - 0203-299-2138&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Senior Staff Nurse (Emergency Department)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242976", "validThrough": "2020-11-09T23:59:59+0000"}