{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62289", "minValue": "48859", "unitText": "YEAR", "value": "£48,859 - £62,289 per annum"}}, "datePosted": "2020-10-13T15:31:25+0100", "description": "&lt;p&gt;Public Health England (PHE) is an executive agency of the Department of Health providing; strategic leadership, research, advice and support for Government, local authorities and the NHS in protecting and improving the nation’s health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HEALTH ECONOMICS AND MODELLING TEAM IN PHE (NON-COMMUNICABLE DISEASES - NCDS)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The health economics and modelling team is a multi-disciplinary team of around 18 people, comprising professional economists as part of the Government Economic Service, mathematical modellers, a statistician, epidemiologist and data scientist.&lt;/p&gt;\n&lt;p&gt;The primary purpose of the team is to help to make the case for investing in prevention and wider initiatives aimed at improving health and reducing health inequalities. This involves identifying the most cost-effective interventions and/or those that produce the greatest potential return on investment RoI). We draw upon existing models and develop these in order to forecast trends in NCDs and their related costs, and to estimate the impact of prevention policies on health and wider economic outcomes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;JOB SUMMARY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be part of the modelling team within PHE’s Health Economics and Modelling team and will lead on the development and management of the epidemiological components of the team’s non-communicable disease modelling work programme, including identifying and evaluating risk factor and disease evidence along with other defined duties attached to this post. The post holder should ensure the team uses appropriate data sources and methods in its analytical and modelling work. They should be familiar with both administrative data and survey data analysis, causal inference, epidemiological methods and evidence synthesis, and capable of explaining these to other analysts and people without analytical expertise. They should be confident in analysing and managing large datasets and should have some previous experience in public health, either through their training or previous employment.&lt;/p&gt;\n&lt;p&gt;The post holder will manage the team’s knowledge translation work programme, including managing a multi-year contract with an external provider. The post holder will play a key role in shaping the work and culture of the non-communicable disease modelling team and developing ideas for future projects. The post holder should be capable of working well independently, working in teams and leading project teams. They will have the opportunity to work in an Agile software development environment, currently being used within the modelling team.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for engaging with colleagues across PHE to support the team’s work, including epidemiologists, data scientists and policy professionals. The post holder will be responsible for developing and maintaining links with other epidemiologists within and outside PHE, to support their own professional development and to ensure the team is aware of developments in the field.&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Candidates may be asked to deliver a presentation or carry out a written test, followed by a panel interview. Additional information on the format of the day will be provided to those candidates who are successful, following the shortlisting stage.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Abbygail Jaccard Job title Head of Modelling&lt;/p&gt;\n&lt;p&gt;Email address abbygail.jaccard@phe.gov.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0798 0787 381&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;For further information or an informal discussion about this post, please contact&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Abbygail Jaccard on 0798 0787 381, or e-mail &lt;/span&gt;&lt;span&gt;&lt;span&gt;Abbygail.jaccard@phe.gov.uk&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington House, London, York, negotiable, London", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "Epidemiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224883", "validThrough": "2020-11-15T23:59:59+0000"}