{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21892", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 (rising to £21,892 on qualification)"}}, "datePosted": "2020-11-02T11:24:53+0000", "description": "&lt;h2&gt;&lt;span&gt;The role&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Salary: &lt;span&gt;£19,737 (rising to £21,892 on qualification)&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;Are you looking to start an exciting and rewarding new career as a Nursing Associate? &lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;Can you put people first and provide nursing care that is person-centred, safe and compassionate?&lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;em&gt;Have you ever wanted to experience what it’s like to live and work as a Nursing Associate, changing and improving the lives of people every day?&lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;We are searching for aspiring apprentices who would like to start a career within our mental health services. Our Nursing Associate Programme offers you the chance to achieve a professional qualification that forms part of the nursing family as a registered practitioner with the Nursing and Midwifery Council. This qualification also forms part of our career pathway to train to become a Registered Mental Health or Learning Disability Nurse, to enable you to build a career in one of the UK’s most progressive Trusts.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are offering this apprenticeship opportunity in partnership with Plymouth University. You will join us as a Trainee Nursing Associate and over two years will undertake the NMC approved Foundation Degree that leads to the professional qualification. You will be employed by the Trust, working in one of our in-patient Services across Devon. Alongside the weekly study day with the University which will be take place in Exeter, you will have dedicated time in your working week to achieve the required competencies of the role over the course of the Programme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will also need to be prepared to work hard and undertake study in your own time as you work towards becoming a qualified Nursing Associate. During this challenging Programme you will learn the fundamentals of exceptional care and develop your depth of knowledge around important aspects of both physical and mental health. In addition you will be taught many clinical skills which will be required when you become a registered Nursing Associate.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As well as learning about person-centred care, the power of recovery, and the difference that our teams make to every person we support, you will have experience of working in other clinical areas, as you undertake a variety of placements, during the Programme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an incredible opportunity to establish a new career in healthcare, and be supported to achieve the Nursing Associate qualification. The cost of the Foundation Degree Programme with Plymouth University will be met by the Trust and as an apprentice you will be earning whilst you learn.&lt;/span&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;About you&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;To be eligible for the Programme you’ll need to hold a minimum of a Level 3 qualification or equivalent and have English and Mathematics at GCSE grade C/4 or Functional or Key Skills at Level 2. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We have no preconceptions about the people we employ. You may be entering the workforce for the first time, or have had a career elsewhere. What matters to us is your passion, commitment and determination to succeed. We will assess this at interview.&lt;/p&gt;\n&lt;p&gt;Your attitude is crucial. At Devon Partnership NHS Trust we deliver person-centred care, we believe that with our help, people can improve their mental health, to recover independence and return to the community. We expect you to share our vision for mental health and learning disability care.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate an understanding of mental healthcare and the services that we provide. We expect you to understand the roles and responsibilities of a Nursing Associate in a mental health setting. The role is challenging, and you will need to use your initiative and perform under pressure – something we will explore at the interview.&lt;/p&gt;\n&lt;p&gt;You will need to be an effective communicator with the people you care for, their families and carers, as well as your colleagues and superiors.&lt;/p&gt;\n&lt;p&gt;We’re looking for apprentices who will help us to continue our life-changing work. If you think you can make a difference and have the drive and determination to become a Nursing Associate, then take the first step today.&lt;/p&gt;\n&lt;p&gt;Further information about the Nursing Associate role and to read real life stories from Nursing Associates across the country visit nursing-associates.hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Further details of the Plymouth University Programme can be found at plymouth.ac.uk/study/apprenticeships/higher-apprenticeship-fdsc-nursing-associate&lt;/p&gt;\n&lt;p&gt;You can find details of all our locations by visiting: dpt.nhs.uk/locations.&lt;/p&gt;\n&lt;h1&gt;Location&lt;/h1&gt;\n&lt;p&gt;This Programme is recruiting for Trainee Nursing Associates to work in our varied in-patient services across Devon and we will discuss where these opportunities are and what your preference might be as part of the interview process.&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;About us&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Join us at Devon Partnership NHS Trust and you’ll become part of an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/p&gt;\n&lt;p&gt;You’ll become part of a team that is compassionate and supportive. We’re genuinely committed to working together with the people who use our services, their families and carers. We involve them in everything that we say and do.&lt;/p&gt;\n&lt;p&gt;This is an exciting time for Devon Partnership NHS Trust as we continue to expand existing services and launch new mental health services across Devon.&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Our offer to you&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;27 days (minimum) annual leave&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Generous NHS pension scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Commitment to your career development&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Preceptorship schemes&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Wide range of leadership development opportunities&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trust-Wide- Across Devon", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "Nursing Associate (Apprenticeship)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251770", "validThrough": "2020-11-17T23:59:59+0000"}