{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-02T14:30:18+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Full and part time hours available&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We have an exciting opportunity for experienced Musculoskeletal Physiotherapists to join our Adult Physiotherapy outpatients’ service. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for Physiotherapists with a minimum of 2 years postgraduate experience working in an MSK setting who have significant knowledge and skill in the assessment and management of patients presenting with a wide range of MSK conditions. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a strong team player with excellent communication and health coaching skills. You will be involved in the delivery and development of pathways and will support the development of junior staff and students. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will embrace innovation and integrated working and will be committed to following best practice to ensure patient centered care. You will be actively involved in service development and will need to work on your own initiative as well as being responsible for the development of junior staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Anglian Community Enterprise has been awarded the Care Closer to Home contract by the North East Essex CCG and is committed to offering the people of North East Essex an integrated and seamless network of patient-centred services based closer to where they live and in their communities wherever possible. As a result you will need to be flexible and able to work at various sites across North East Essex in line with service requirements.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We offer a well-established supervision and appraisal structure and we have a firm commitment to CPD, evidence based practice, undergraduate and postgraduate education. You will have the opportunity to participate in the provision of regular in-service training.  You will be encouraged and supported to develop your clinical, teaching and managerial skills.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further &lt;span&gt;information please contact Alex Pacey on &lt;/span&gt;&lt;span&gt;alex.pacey@acecic.nhs.uk&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This post is classified as Regulated Activity and is exempt from the Rehabilitation of Offenders Act 1974 (Exceptions) Order 1975 (as amended in 2013). You must therefore disclose on your application form all convictions,    cautions, youth cautions and youth conditional cautions, which are not protected. Guidance and criteria on the filtering of cautions and convictions and what you must therefore disclose on your application form can be found on the Disclosure and Barring Service website. If you are offered the post we will need to obtain a satisfactory Disclosure and Barring Service (DBS) Check for you. You will also be expected to join the DBS update service and renew this annually, the cost of which will be reimbursed to you. You are advised to read the attached leaflet regarding the Disclosure and Barring Service.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Working for ACE puts you right at the heart that all North East Essex has to offer. If you are looking to re-locate to the area then we may be able to help with your moving costs. Further information can be found in the Relocation policy. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Colchester is Britain’s oldest recorded town and now one of its fastest growing with a range of recreational facilities to match. The jewel in the crown of its historic past is its Norman castle, built on Roman foundations. A wealth of new homes is complemented by an equally broad selection of character homes in the plethora of picture-postcards villages that surround the town. The likes of Sible Hedingham, Finchingfield and Dedham (the latter being the heart of Constable Country made famous by the artist John Constable) are much sought-after location. Within a stone’s throw of Colchester you have 60kms of beautiful coastline including Blue Flag beaches, the gentile charm of Frinton and the more bustling Clacton – one of the driest places to live in the UK!  In addition North Essex boasts several nationally acclaimed schools, including Colchester Royal Grammar School and Colchester County High School for Girls. London Stansted Airport is less than an hour’s drive away while all the attractions of London itself are within easy reach. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Anglian Community Enterprise (CIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125574"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester", "postalCode": "CO4 5HG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9184", "longitude": ".896236"}}, "title": "Senior Physiotherapist, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252426", "validThrough": "2020-11-15T23:59:59+0000"}