{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 p.a."}}, "datePosted": "2020-10-28T16:06:02+0000", "description": "&lt;p&gt;Worcestershire Health and Care NHS Trust is a complex, well-established and high performing organisation, operating from over 100 dispersed sites and employing circa 4,500 staff. We deliver a diverse range of services, across mental health, learning disability and community care to a population of 780,000. In addition to providing these services across Worcestershire, we have also recently taken over responsibility for mental health and learning disability services in Herefordshire. Our performance is reflected in our ‘Good’ Care Quality Commission rating and we are also a Global Digital Exemplar, transforming the way digital technology supports both service users and staff.&lt;/p&gt;\n&lt;p&gt;We are proud and committed to our Trust Values, which include:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;C&lt;/strong&gt;ourageous; &lt;strong&gt;A&lt;/strong&gt;mbitious; &lt;strong&gt;R&lt;/strong&gt;esponsive; &lt;strong&gt;E&lt;/strong&gt;mpowering; &lt;strong&gt;S&lt;/strong&gt;upportive.&lt;/p&gt;\n&lt;p&gt;As a leading local provider, we engage widely with our colleagues, patients, carers and local partners to deliver our system strategy. We are listening to their feedback and experiences to ensure that we develop innovative and sustainable services that provide excellent care to meet their needs and constantly strive to improve. We have many exciting service developments underway in conjunction with our partners and particularly our Primary Care Networks. We are also an early adopter for the Transformation of Community Mental Health Services and the Emotional Health and Wellbeing of Children and young people in Schools.&lt;/p&gt;\n&lt;p&gt;As an employer we value all our staff very highly and want to ensure we foster a culture of inclusion and belonging. We want to look after, recognise, engage and develop all of our teams across the Trust, ensuring that our organisation is a place where everyone has equal opportunities to thrive, and feel confident in speaking out without fear. This reflects our commitment to attract and retain a greater number of committed, compassionate people to join us, at a time when the NHS and those who work within it are more valued than ever.&lt;/p&gt;\n&lt;p&gt;There has never been a more exciting time to become part of the leadership of our Trust. As we all reflect on the past few months, we are determined not to lose some of the things we have achieved and changed for the better. As we anticipate demand for our services increasing, we have an opportunity to continue to think differently and innovatively about how we provide care and how we harness the enormous enthusiasm across the system to do this. As we look towards a future where care across health systems will be more integrated and delivered in increasingly collaborative ways, our local, regional and national partnerships and relationships are critical.&lt;/p&gt;\n&lt;p&gt;This is also a pivotal time when the opportunities to make a real difference for the future have never been greater. The COVID-19 pandemic has been a challenging time for the whole NHS. We have taken this opportunity to work together to think differently and adapt the way we are working to support the people we serve. We have achieved amazing things, including innovations in our use of technology, developing new guidelines and practices, training in new skills, adapting our pathways, changes in culture and many more.&lt;/p&gt;\n&lt;p&gt;It is in this context that we are appointing to the post of Deputy Director of Strategy and Partnerships. The postholder will lead on the Trust’s strategy, our planning processes and our established programme management approach which harnesses co-production and strong engagement to transform services.&lt;/p&gt;\n&lt;p&gt;You will work with colleagues in the Strategy and Partnerships Directorate, Corporate Departments and Service Delivery Units as well as with colleagues in the wider system to deliver against our vision and priorities. Although we are looking for a well-rounded individual with a broad skillset, we are particularly keen to engage with candidates with a strong track record of delivery through partnership and significant experience of influencing and transforming services in complex systems.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for someone able to operate at sub-Board level in a complex organisation, providing significant exposure to our work across the wider system. If you share our vision and values and are looking for a position which will provide an opportunity to play an important and influential role, both within our organisation and the wider health and care system, then we would welcome your interest and application. We would particularly encourage applications from those with protected characteristics and from under-represented groups, as we are committed to improving diversity within our organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Recruitment Timetable:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications close: Sunday, 29 November 2020&lt;/p&gt;\n&lt;p&gt;Shortlisting Interviews: w/c 7 December 2020&lt;/p&gt;\n&lt;p&gt;Final Interviews: w/c 11 January 2021&lt;/p&gt;\n&lt;p&gt;To discuss this post further, or to request a copy of the information pack, please contact our recruitment partner, Joe Joyce of The Finegreen Group on enquiries@finegreen.co.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120795.jpg", "name": "Worcestershire Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire", "postalCode": "WR5 1JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1917", "longitude": "-2.17905"}}, "title": "Deputy Director of Strategy and Partnerships", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247310", "validThrough": "2020-11-29T23:59:59+0000"}