{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53168", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 per annum exclusive of HCAS"}}, "datePosted": "2020-11-02T10:32:13+0000", "description": "&lt;p&gt;This role is responsible for leading HEE&#39;s news media function. The post holder&#39;s primary responsibility is to deliver a comprehensive, efficient and effective integrated news and social media communications service on behalf of the organisation.&lt;/p&gt;\n&lt;p&gt;They will manage the flow of communications between HEE and our news media audiences, fostering relationships with key journalists and stakeholders.&lt;/p&gt;\n&lt;p&gt;The post holder will ensure that consistent support and oversight is contributed across HEE&#39;s national and regional channels and will provide support to national and regional directors to ensure awareness and promotion of their work programmes.&lt;/p&gt;\n&lt;p&gt;Reporting to the head of external communications, they will manage a team of three and will work as part of an internal agency model, engaging with the wider communications team to help ensure consistent delivery of messages across multiple platforms and channels.&lt;/p&gt;\n&lt;p&gt;The head of media will be responsible for developing and implementing strategic communications plans to promote and publicise HEE&#39;s work and for ensuring systems are in place to monitor and evaluate delivery.&lt;/p&gt;\n&lt;p&gt;They will be a member of the external communications senior leadership team and will need to work closely with professional communications colleagues, forging relationships across HEE with directors, programme leads and programme managers.&lt;/p&gt;\n&lt;p&gt;The post holder will need to demonstrate a proven track record of successful delivery in a national news media post and wider communications work with highly developed influencing and negotiating skills.&lt;/p&gt;\n&lt;p&gt;Due to the current situation, this post will be home based but the contracted base will be your nearest HEE office.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants will commence at the bottom of Band 8b with a full-time starting salary of £53,168, with a pay step increase after 5 years’ service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For posts based in Inner London, the above salaries will include the additional supplement of 20% of basic salary, subject to a minimum payment of £4,473 per annum and a maximum payment of £6,890 per annum. This is offered in accordance with NHS Terms and Conditions and is based on office location.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Richard Green&lt;/p&gt;\n&lt;p&gt;Head of External Communications&lt;/p&gt;\n&lt;p&gt;richard.green@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;07557 204428&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National", "postalCode": "LS1 4PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7988", "longitude": "-1.55967"}}, "title": "Head of Media", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251599", "validThrough": "2020-11-16T23:59:59+0000"}