{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "Specialty Doctor Scale £40,037 - £74,661 + Fringe"}}, "datePosted": "2020-10-21T12:07:43+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Associate Specialist within Developmental Paediatrics, &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;(Up to 10 PA’s)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We currently have a substantive vacancy for Associate Specialist within our developmental paediatric service. Applications from existing Associate Specialist grades are also welcome. This is an exciting opportunity to join our existing strong team of paediatricians with a range of skills and interests who provide assessment, diagnosis and ongoing care to children and young people and families in Surrey. The Department offers a supportive and encouraging environment in which to develop as a professional with opportunities to develop in specialist fields. There is regular and structured peer review and supervision with clinical support available through team leads within each locality.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Research, study, audit and quality improvement is strongly advocated and SABP actively support audit and quality improvement.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome innovative and dynamic practice and the department hosts trainees from Kent, Surrey, Sussex Deanery (KSS). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have robust safeguarding pathways in place and are commissioned to provide full time support into the SARC team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As well as this we have a multi-disciplinary team of professionals including an admin support team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful post holder will undertake assessments and medical examinations of children and young people and provide reports to other professionals and parents /carers under the supervision of senior colleagues.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Whilst there is no out of hours on call commitment, the post-holder would be expected to partake in the daytime on call rota for safeguarding medical examinations. Appropriate training and support will be provided if required. Part time working will be considered.&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Posts are based across the county of Surrey which is recognised as having many areas of ‘outstanding’ beauty and known for its countryside. Surrey is well serviced by excellent rail and road network links, as well as being within close proximity of two of London’s main airports, Heathrow and Gatwick. There is easy access to London and the coast, Surrey also has a number of attractions for children and families. The county also has excellent schools within the area, making it the perfect place to live and work.&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more information regarding vacancies within the developmental paediatrics service, or to arrange an informal visit please contact: &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Lisa Wall, Lead Consultant Paediatrician.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Email: lisa.wall@nhs.net&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various", "postalCode": "KT21 1PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3198", "longitude": "-.302655"}}, "title": "Associate Specialist in Developmental Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236277", "validThrough": "2020-11-16T23:59:59+0000"}