{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T10:16:17+0000", "description": "&lt;p&gt;An opportunity has arisen in Blackpool for a highly motivated pharmacist with a genuine interest in mental health to join the Pharmacy Team. The post is based at The Harbour covering a range of Mental Health Wards including Psychiatric Intensive Care Units, Acute Admissions, Dementia and Advanced Care Wards. .&lt;/p&gt;\n&lt;p&gt;The main duties will include providing a patient focussed clinical pharmacy service in an inpatient setting. You will be expected to provide a high level of pharmaceutical care to patients as a part of the wider multi-disciplinary team, participate in consultant ward reviews, undertake clinical audit and be actively involved in the education and training of pre-registration pharmacists and other healthcare professions. You will also be involved in a ward based dispensing service.&lt;/p&gt;\n&lt;p&gt;Lancashire &amp; South Cumbria NHS Foundation Trust has fully implemented electronic prescribing and medicines administration systems across all inpatient settings.&lt;/p&gt;\n&lt;p&gt;As part of the North Lancashire Team you will be provided with the opportunity to contribute to the delivery of clinical pharmacy services to a variety of mental health in-patient wards and community teams. Working closely with clinical teams as part of a multi-disciplinary approach to addressing the care needs of patients and service users, you will also ensure safe and effective medicines management processes within the service. This will include compliance with Regulatory medicines management standards and implementation of medicines safety alerts.&lt;/p&gt;\n&lt;p&gt;The post will provide an opportunity for the following: -&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Pharmaceutical care planning and clinical review of prescriptions&lt;/li&gt;\n&lt;li&gt;Involvement in multi-disciplinary ward rounds&lt;/li&gt;\n&lt;li&gt;Provision of medicines information to service users and staff&lt;/li&gt;\n&lt;li&gt;Opportunity to experience pharmacy practice across in-patient services and community teams&lt;/li&gt;\n&lt;li&gt;Supporting development of robust medicines management processes&lt;/li&gt;\n&lt;li&gt;Actively working to deliver the Trust medicines optimisation strategy&lt;/li&gt;\n&lt;li&gt;Ensuring compliance to GPhC standards for dispensing.&lt;/li&gt;\n&lt;li&gt;Clinical audit&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The pharmacy team has a regular online training programme for the purposes of continuing professional development, and attendance at multidisciplinary training forums is also encouraged.&lt;/p&gt;\n&lt;p&gt;You will have current registration with the General Pharmaceutical Council and be up to date with your CPD.&lt;/p&gt;\n&lt;p&gt;Due to the location of various units, an ability and willingness to travel around Trust locations is required.&lt;/p&gt;\n&lt;p&gt;The Clinical Pharmacy service is embedded in the culture of the organisation and should you wish to join our team you will become one of a large team of Clinical Pharmacists, Clinical Medicines Management Technicians, Pharmacy Assistants, Medicines Management Nurses and Apprentices working across the Trust. There is no requirement to work Bank Holidays, weekends.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Mohammed Ahmad on 07507847641 or by e-mail &lt;/span&gt;Mohammed.Ahmad@lscft.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Harbour, Blackpool", "postalCode": "FY4 4FE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8004", "longitude": "-2.98918"}}, "title": "Specialist Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251536", "validThrough": "2020-11-16T23:59:59+0000"}