{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-02T11:11:16+0000", "description": "&lt;p&gt;We are looking for enthusiastic and motivated Registered Nurses committed to delivering excellent patient care to join our Integrated Network Teams in the South of Bristol.&lt;/p&gt;\n&lt;p&gt;Our Community Nursing teams in South Bristol are made up of dedicated and enthusiastic professionals who plan and deliver evidence based nursing care to housebound patients within defined localities. You will work both autonomously and collaboratively within these supportive teams which comprise of Advanced Clinical Practitioners, Community Nurse Team Leaders, Community Nurses, Assistant Practitioners, Nurse Associates , Healthcare Assistants and Administrators as well as with the wider healthcare community.&lt;/p&gt;\n&lt;p&gt;You will need excellent communication and clinical skills and have experience of working within a team; previous community experience is desirable but not essential. You will also be required to use electronic patient record systems, have good time management and be able to prioritise your work load effectively.&lt;/p&gt;\n&lt;p&gt;Our Community Nursing teams have implemented a zonal working and named nurse model across the 3 Bristol localities. This change ensures consistency of care for our patients and better understanding of caseloads and resilience for our community nursing teams.&lt;/p&gt;\n&lt;p&gt;You will be asked to carry out holistic assessments of service users and provide nursing support to them to maintain their independence in their own homes. Weekend and bank holiday working and some late shifts (no nights or out of hours) will be part of this role on a rostered basis.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work within a zone under the direction of a Team Leader and with clinical leadership support from them and from the Advanced Clinical Practitioner.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Bristol", "postalCode": "BS13 8QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4073", "longitude": "-2.62212"}}, "title": "Community Staff Nurse -Amelia Nutt", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251726", "validThrough": "2020-11-15T23:59:59+0000"}