{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-29T10:46:03+0000", "description": "&lt;p&gt;Dimensions Tool - Project Support Officer&lt;/p&gt;\n&lt;p&gt;12 month contract&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be involved with a dynamic project in Coventry and Warwickshire Partnership Trust. The role is supporting the development and roll-out of the Dimensions of Health and Wellbeing tool it will require working closely with our project manager and the wider Dimensions team. &lt;br /&gt;It will also include data input and administration tasks such collating information, keeping documents in order, using the Dimensions software to maintain the tool, creating reports and presentations, attending meetings, and producing and circulating minutes.&lt;br /&gt;The post-holder will also be attending community events and promoting the Dimensions tool. This will mean preparing for events, talking to the public and professionals about Dimensions, and signposting to community groups. The role also involves promoting the Dimensions tool within the Trust and working in collaboration with clinicians and other professionals.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This role will suit a person who is a creative thinker, familiar and confident with using social media, can work independently and show initiative, and is able to use information and data reports to answer questions posed by the team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The ideal candidate will be excited by an opportunity to influence positive change and be adaptable to a variety of tasks and situations. Good interpersonal skills and the ability to develop positive relationships quickly. Ability to use Microsoft packages to create and format material. Deliver work within a time-frame and according to a project plan.&lt;br /&gt;Desirable Candidates would have experience working in the community or voluntary sectors. Candidates who have lived experience of using services. Candidates who have worked in public health, education or care service&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dawn Nicholls - Project Manager&lt;/p&gt;\n&lt;p&gt;Dawn.Nicholls@covwarkpt.nhs.uk &amp; 024 76961226&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paybody, Coventry", "postalCode": "CV1 4FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.414", "longitude": "-1.50785"}}, "title": "Dimensions - Project Support Officer - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247954", "validThrough": "2020-11-08T23:59:59+0000"}