{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-27T16:42:37+0000", "description": "&lt;h1&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h1&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Are you an experienced CAMHS clinician looking for a new challenge and opportunity to join a service at a time of exciting change?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Can you work with children/ young people and their families /carers, presenting with complex needs, providing evidence-based intervention in the community?&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Would you like to experience life in one of the UK’s most beautiful areas, with exciting cities, charming countryside and magnificent coastlines?&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for &lt;strong&gt;Band 7 CAMHS Clinical Team Managers&lt;/strong&gt;, based in Exeter and Torquay who can bring their skills, experience and enthusiasm to lead and manage others, meeting the needs of children and young people with complex social, emotional and mental health needs.&lt;/p&gt;\n&lt;p&gt;You will provide line management and supervision, overseeing operational aspects of the service, as well as having the opportunity to retain a clinical caseload for up to 50% of your time. You will need experience in clinical practice, managing risk in the community, supervision and operational line management, including HR processes. To meet the needs of children and families in crisis, your work may include some evening/weekend working as well as contributing to the out-of-hours rota. Working with other agencies, as part of a MDT, your role will be key to supporting and meeting the needs of some of our most vulnerable children and young people.&lt;/p&gt;\n&lt;p&gt;Using evidence based practice and routine outcome measures, you will use a strength-based approach to work collaboratively with people, in line with CYP-IAPT key principles.&lt;/p&gt;\n&lt;p&gt;Interview date is to be confirmed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Children and Young People say…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“We would like the people who work for Child and Family Health Devon to be understanding, patient and respectful. They should be trustworthy and make us feel safe and comfortable. It is important that they use their skills and experience to listen carefully in a non-patronising and non-judgemental way. When staff are positive and friendly, they help to create an environment that is informal and without pressure”.&lt;/em&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We’re looking for an individual who is passionate about working with children/young people in a community CAMHS setting with the confidence to intervene to meet a range of mental health needs and a desire to work to continually improve what we do.&lt;/p&gt;\n&lt;p&gt;You will be an experienced and qualified CAMHS professional and can demonstrate compassionate leadership which is fundamental in being able to undertake this role. You will be able to work with colleagues in a multi-disciplinary team and develop relationships across agencies to meet the needs of children and families and have knowledge of child development and child protection procedures.&lt;/p&gt;\n&lt;p&gt;Managing staff will be a key component of the role with the ability to support others, oversee caseloads, and ensure the service responds in a timely way to urgent and routine, planned and unplanned need. You will be responsible for ensuring the service provides therapeutic intervention that is strengths-focused, evidence-based and tailored to meet the needs of the child/young person and their family/carer.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Employed by Devon Partnership NHS Trust, you will be part of Children and Family Health Devon, an Alliance that is unique and brings together six leading providers of adult and children’s community, acute and mental health services in Devon, along with key voluntary sector organisations and academic partners.&lt;/p&gt;\n&lt;p&gt;This Alliance has designed a system-wide service model to deliver integrated, coordinated support wrapped around the child, young person and family. It builds on our strong relationships across education, health, social care and voluntary sector services in Devon, and, most importantly, it has been developed and refined in partnership with children, young people and their families/carers.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Our offer to you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of working at Devon Partnership NHS Trust include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to career development&lt;/li&gt;\n&lt;li&gt;Wide range of leadership development opportunities&lt;/li&gt;\n&lt;li&gt;Up to &lt;strong&gt;41 days of paid leave &lt;/strong&gt;per year, depending on length of NHS service, includes bank holidays&lt;/li&gt;\n&lt;li&gt;Generous &lt;strong&gt;NHS pension scheme&lt;/strong&gt; with employer contributions of up to 14.5% of pensionable pay&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS pay &lt;/strong&gt;progression&lt;/li&gt;\n&lt;li&gt;Good &lt;strong&gt;maternity, paternity and adoption leave &lt;/strong&gt;over and above the statutory minimum requirements&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Sick pay&lt;/strong&gt; up to a maximum of six months full pay and six months half pay&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Childcare vouchers&lt;/strong&gt;– annual savings of up to £1,19&lt;/li&gt;\n&lt;li&gt;Commitment to &lt;strong&gt;flexible working&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;24/7 free &lt;strong&gt;confidential advice &lt;/strong&gt;and &lt;strong&gt;support service&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Refer a friend and both earn £500&lt;/strong&gt;- available for selected posts.&lt;em&gt; Terms and conditions apply.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;Freedom to speak up&lt;strong&gt; ‘Guardian Service’&lt;/strong&gt;, enabling you to safely discuss any concerns impacting on patient care&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Preceptorship schemes&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Exclusive&lt;strong&gt; health service discounts&lt;/strong&gt; for NHS staff&lt;/li&gt;\n&lt;li&gt;Stagecoach –&lt;strong&gt;bus transport discounts&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Salary sacrifice &lt;strong&gt;cycle scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Access to free&lt;strong&gt; recovery and wellbeing courses&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt;&lt;strong&gt;Living here&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Devon provides a unique, varied and beautiful environment. The coastal areas of North and South Devon provide excellent opportunities for water sports. The National Parks, Dartmoor and Exmoor, are havens for country lovers. Exeter is a thriving University city offering culture and city life. There are excellent rail, road and air connections, with a regional airport in Exeter.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter &amp; Torquay", "postalCode": "EX2 4NU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7185", "longitude": "-3.51449"}}, "title": "CAMHS Clinical Team Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245456", "validThrough": "2020-11-10T23:59:59+0000"}