{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42500", "minValue": "42500", "unitText": "YEAR", "value": "£42,500"}}, "datePosted": "2020-10-30T12:42:14+0000", "description": "&lt;h2&gt;&lt;strong&gt;Senior Healthcare Professional&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;1 year Fixed Term Contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cheshire Police&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£42,500 per annum - full time, rolling rota; 42 hours a week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Theprimary responsibility isto lead a team of HCPs providing assessments and care for detainees, victims and staff in Police Custody Suites and in the Force area. You will have management responsibilities for the Healthcare Professionals ensuring they are appraised and supervised.&lt;/p&gt;\n&lt;p&gt;To work as part of an integrated team with the Clinical Lead, Senior HCPs, HCPs and Contract Manager ensuring that services are delivered to the required standards, in accordance with the specific needs of the Force, and ensuring that local processes comply with national clinical governance standards.&lt;/p&gt;\n&lt;p&gt;Asa Senior HCP you must be flexible and committed, providing rota cover as required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role includes, but not limited to:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Conducting reviews and appraisals for your team of Healthcare Professionals as required.&lt;/li&gt;\n&lt;li&gt;Providing governance advice and support for team members in accordance with company policy&lt;/li&gt;\n&lt;li&gt;Organising rotas and ensure the service is provided at all times in accordance with contractual requirements whilst working as an operational Healthcare Professional as part of the normal 24/7 shift rota.&lt;/li&gt;\n&lt;li&gt;Providing advice, guidance and support to Custody Officers, investigating officers and individuals where required.&lt;/li&gt;\n&lt;li&gt;Developing and maintaining effective working practices with external healthcare providers, such as the ambulance services, mental health teams and drug and alcohol services.&lt;/li&gt;\n&lt;li&gt;Keeping accurate and complete records of the Healthcare Professional Team working hours, annual leave and sickness and ensure reporting requirements are achieved.&lt;/li&gt;\n&lt;li&gt;Managing Care + Custody local pharmacy procedures in liaison with the Clinical Lead.&lt;/li&gt;\n&lt;li&gt;Becoming a licentiate member of the FFLM and undertaking other role training and development as required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Qualifications&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Essential Criteria:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered General Nurse (or dual qualified RGN/RMN) / Paramedic with a minimum of5 years’ post-qualifying service&lt;/li&gt;\n&lt;li&gt;Custody/Forensic experience required&lt;/li&gt;\n&lt;li&gt;Full membership of the either NMC or HCPC&lt;/li&gt;\n&lt;li&gt;Unplanned Care experience&lt;/li&gt;\n&lt;li&gt;Ability to work autonomously and within a wider team&lt;/li&gt;\n&lt;li&gt;Strong decision making skills&lt;/li&gt;\n&lt;li&gt;Have been continuously resident in the UK for at least 3 years, with no more than 3 months spent overseas at any one time.&lt;/li&gt;\n&lt;li&gt;Must have Right to Work in the UK&lt;/li&gt;\n&lt;li&gt;A full UK driving license&lt;/li&gt;\n&lt;li&gt;Willingness to develop skill set with forensic training&lt;/li&gt;\n&lt;li&gt;Flexibility to move across sites as required&lt;/li&gt;\n&lt;li&gt;There is a requirementto undergo Licentiate exams, working at Masters Level (further information to be discussed at interview).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Additional Information&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;In return for your dedication and commitment we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;On-going professional development accredited by Teesside University&lt;/li&gt;\n&lt;li&gt;Forensic Licentiate for career progression&lt;/li&gt;\n&lt;li&gt;Structured career development in a people centered company&lt;/li&gt;\n&lt;li&gt;Fast track opportunities for exceptional team members&lt;/li&gt;\n&lt;li&gt;£250 Refer a Friend Scheme&lt;/li&gt;\n&lt;li&gt;A huge benefits package including pension schemes, private medical cover, share schemes and MiDeals discount scheme with over 3000 offers available from your favourite retailers, leisure and utilities companies.&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135422.jpg", "name": "Care and Custody", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135422"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cheshire", "postalCode": "CW7 2UA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1883", "longitude": "-2.5586"}}, "title": "Senior Healthcare Professional (Nurse of Paramedic)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250210", "validThrough": "2020-11-13T23:59:59+0000"}