{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-10-28T15:31:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Children’s Nurse - Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Children and Young People’s Complex Physical Health Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent - Full time/ part time/term time only&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for Children’s Nurses or Learning Disability Nurses to join our Complex Physical Health Service. Following a service wide redesign we have created several rotational posts that will involve placements in the Service’s Respite Team and Community Children’s Nursing Team. This will include working with children with continuing health care needs such as long term ventilation and in the Coventry’s Special schools. The role offers a valuable opportunity to be part of an experienced team, to develop your professional expertise and make a difference where it matters.&lt;/p&gt;\n&lt;p&gt;This post offers excellent opportunities to care for children with a wide range of physical / learning disabilities who have complex physical health needs in a variety of settings. We are looking for enthusiastic nurses with excellent organisational, personal and clinical skills. The post will also involve supervising and supporting carers. In return you can expect good professional development with a comprehensive in house training programme and the support of the senior management team, a clinical education team and clinical nurse specialists. The rotational nature of the post will give the successful candidates a wide range of experience in several community settings ideal for someone want to develop their career as a community children’s nurse.&lt;/p&gt;\n&lt;p&gt;This post is suited to candidates who have been involved in providing care for children and young people with complex care needs previously and want to broaden their experience in the community. We would also consider applications from newly qualified nurses who could demonstrate an interest and experience through their training of working with children with complex health needs in the community.&lt;/p&gt;\n&lt;p&gt;The children we support reflect the rich diversity of the multicultural society in Coventry. We would actively welcome applicants from a range of cultural and ethnic backgrounds whose skills and life experiences will enrich the services we provide.&lt;/p&gt;\n&lt;p&gt;The posts will involve shift working including nights and weekends. The service delivers provision 365 days a year.&lt;/p&gt;\n&lt;p&gt;Our recent CQC inspection rated our Children’s services as good overall and outstanding for care. Please visit the CQC website for further information.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Louise Bridges, Service Manager on 07500 120066 or Team Leader, Glenys Hopkins 07584 369665&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paybody Unit, Coventry", "postalCode": "CV1 4FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4181", "longitude": "-1.49965"}}, "title": "Community Children&#39;s Nurse - Band 5 full time/part time/ term time", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247189", "validThrough": "2020-11-15T23:59:59+0000"}