{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Band 5/6 dependent on experience"}}, "datePosted": "2020-10-13T14:37:13+0100", "description": "&lt;p&gt;&lt;strong&gt;Senior Staff Nurse | Surgical Ward | Band 5/6 dependent on experience | Yale - Wrexham | Full Time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Yale in Wrexham, North Wales have an opportunity for a Senior Staff Nurse to join their friendly and supportive team. This role provides the opportunity to develop and mentor newly qualified members of staff&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;***You may be eligible for a joining bonus of up to £1500 for this role***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Spire Yale Hospital is one of North Wales’ leading private hospitals and we take pride in delivering high-quality care. We offer fast access to consultations with specialists in a wide range of treatments, supported by advanced imaging and diagnostic technology.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Spire Yale Hospital is located in Wrexham and has additional consulting rooms on the North Wales coast at Abergele. Wrexham is only 12 miles from Chester and 30-50 minutes from Liverpool and Manchester. There are direct train links to London with a journey time of just over 2 hours. The Snowdonia National Park and the North Wales Coast are on our doorstep! We take pride in delivering high-quality care to patients across North Wales and the Borders&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be joining this high performing team of experienced nurses who constantly receive excellent patient satisfaction feedback.&lt;/li&gt;\n&lt;li&gt;Delivering excellent patient care to post-surgical patients.&lt;/li&gt;\n&lt;li&gt;Mentoring newly qualified staff and student nurses&lt;/li&gt;\n&lt;li&gt;Liaising and networking with other departments across the hospital&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be NMC registered - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Have a minimum of 2 years surgical nursing experience.&lt;/li&gt;\n&lt;li&gt;Compassionate and able to showcase excellent patient care&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/li&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals and 8 clinics across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Sarah Whittaker at Sarah.whittaker@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wrexham", "postalCode": "LL13 7YP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.049", "longitude": "-3.01411"}}, "title": "Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224731", "validThrough": "2020-12-02T23:59:59+0000"}