{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-06T12:36:32+0100", "description": "&lt;h1&gt;Great Western Hospitals NHS Foundation Trust&lt;/h1&gt;\n&lt;h2&gt;Locum Consultant in Respiratory Medicine&lt;/h2&gt;\n&lt;p&gt;The Respiratory Service at the Trust is looking to recruit a Locum Consultant in Respiratory Medicine to help with departmental expansion. This is a fixed term post for 12 months. This post presents an exciting opportunity to join a dynamic growing department practicing from a newly built, state of the art 480 bed hospital. You will join the existing 6 Consultants providing respiratory care to our population of 400,000.&lt;/p&gt;\n&lt;p&gt;The Respiratory department is an integral department within the Division of Unscheduled Care. In-patient care is provided on a 44 bedded Respiratory Unit incorporating Respiratory High Care units for COVID and low risk COVID patients. Outpatient services are delivered on the main Hospital site. In addition the Department also have a diagnostic and treatment Sleep Service, Lung Cancer Service, Pleural Service including provision for indwelling pleural catheters, Bronchoscopy &amp; EBUS service providing two lists per week, a Lung Physiology Service and CTD ILD clinic. We are a friendly team of consultants, respiratory specialist nurses, lung cancer nurse specialists, physiologists, medical secretaries and have excellent links with our community colleagues. We have an active research profile and are actively engaged in undergraduate and postgraduate education. Respiratory physicians at the Great Western Hospital form part of the acute on call rota admitting acutely unwell general medical patients through our Emergency Department and Medical Assessment Unit.&lt;/p&gt;\n&lt;p&gt;We are looking for post holders with a special interest in any of the following areas: respiratory inpatient care including delivery of respiratory support on our high care units, asthma, interstitial lung disease, lung cancer, pleural disease or sleep and domiciliary ventilation. Post holders will have the opportunity to discuss and develop their interest further once in post.&lt;/p&gt;\n&lt;p&gt;Successful applicants should hold MRCP (UK) or equivalent and it is desirable for candidates to be within 6 months of CCT or equivalent.&lt;/p&gt;\n&lt;p&gt;The Great Western Hospital NHS Foundation Trust is located in Swindon. The hospital has excellent travel links, located 5 minutes by car to junction 15 of the M4. The town is on the main rail link between Bristol and London, with travel time to London Paddington within one hour. There is also easy access to the many attractive surrounding villages within the Cotswolds.&lt;/p&gt;\n&lt;p&gt;For further information about this post please contact Dr Anthony Kerry, Respiratory lead on 01793 646146 (Secretary) or email anthony.kerry1@nhs.net&lt;/p&gt;\n&lt;p&gt;Closing date: 6th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120810.png", "name": "Great Western Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120810"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SN3 6BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5382", "longitude": "-1.72768"}}, "title": "Locum Consultant Respiratory Medicine (Fixed Term Contract 12 months)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214671", "validThrough": "2020-11-06T23:59:59+0000"}