{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa (based on full time hours)"}}, "datePosted": "2020-11-06T12:15:20+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Band 5 Rotation Full Time 37.5 hours per week.&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen to join an established Occupational Therapy (OT) rotation based in the South East of Hampshire. This rotation is suitable for both newly qualified professionals or band 5’s looking to further develop their specialist skills. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This permanent Band 5 post currently offers rotations in the following clinical specialisms -  &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Inpatient rehabilitation&lt;/strong&gt; supporting patients to reach their maximum rehabilitation potential, facilitating safe discharge and enabling patient flow through the service. Based at  Petersfield and Gosport War Memorial Hospitals&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Community Therapies&lt;/strong&gt; – working with adults in their own environment to promote function, safety and independence.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Rapid Therapy Team&lt;/strong&gt; - working across two sites in the South East of Hampshire - one in Havant and the other in Fareham and Gosport. This position is designed to contribute to avoiding hospital admission, facilitating discharge and enabling patients to remain within their own homes. This role involves intensive, short term rehabilitation.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The rotation provides the opportunity to gain experience working with a diverse and clinically complex caseload, whilst working closely as part of the wider Multi-Disciplinary team. Each rotation will be 6 months, covering the areas of Petersfield, Havant, Fareham and Gosport. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The supervisor in each clinical area will seek to allocate referrals to you within your competence levels, providing ongoing support throughout. Supervision will be provided on an informal and formal basis. Further sources of support are provided through rotation specific objectives, structured preceptorship program and a bi-monthly peer support meeting. Rotation specific In-service training is also provided, for example: managing challenging behavior in Dementia, 24 hour postural management, falls prevention and cognitive assessment. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a fantastic opportunity to develop a career in Occupational Therapy, highlighted in the experience of previous staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;“I have felt valued as a Band 5 and appreciated for what I could contribute to the team and rotation as a whole”&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;“All teams on the rotation have supported me in developing my clinical and managerial skills”&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will need a Degree or diploma in OT and HCPC registration. You should be organised and adaptable, with an enthusiasm to develop professionally. You will need to be a car driver and have access to a car for work. There may be an opportunity to start working as an Occupational Therapy Assistant prior to the start of the rotation this can be negotiated at interview.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Happy to talk flexible working&lt;/strong&gt;-&lt;strong&gt; all requests for flexible and part time working will be considered.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Follow us on Facebook and on Twitter:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;facebook.com/SouthernHealthNHS&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gosport War Memorial Hospital, Gosport", "postalCode": "PO12 3PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7931", "longitude": "-1.14807"}}, "title": "Occupational Therapist - Rotational Post", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259601", "validThrough": "2020-12-07T23:59:59+0000"}