{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42969", "minValue": "32478", "unitText": "YEAR", "value": "£32,478- £42,969 pa plus London weighting"}}, "datePosted": "2020-11-03T14:16:21+0000", "description": "&lt;p&gt;&lt;strong&gt;The National Hospital for Neurology &amp; Neurosurgery, Queen Square, London. &lt;/strong&gt;&lt;strong&gt;University College London NHS Foundation Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;JUNIOR CLINICAL FELLOW IN ADULT NEUROCRITICAL CARE MEDICINE&lt;/p&gt;\n&lt;p&gt;Applications are invited for junior Clinical Fellow posts in Neurocritical Care at The National Hospital for Neurology &amp; Neurosurgery, Queen Square, London, for a six or twelve month period. These posts will commence on 3rd February 2021.Interviews will take place on Thursday 26th November.&lt;/p&gt;\n&lt;p&gt;The post would be ideally suited to anyone wishing to experience intensive care medicine in a nurturing environment with a view to improving their curriculum vitae with the aim of applying for core training in intensive care medicine, emergency medicine, acute medicine or neurosurgery. We have an excellent record of helping clinical fellows get on to run-through national training programmes.&lt;/p&gt;\n&lt;p&gt;The National Hospital for Neurology and Neurosurgery provides neurological and neurosurgical services on a regional, national and international basis. The hospital has recently expanded intensive care capacity and now has two Intensive Care Units (9 &amp; 5 Level-3 beds) and two High Dependency Units (9 &amp; 4 Level-2 beds), providing care for neurology and neurosurgical patients, in one of the largest dedicated neurocritical care facilities in the UK. The post involves the management of critical care patients with both neurosurgical and neurological conditions. There is excellent senior support 24/7 for the unit with two daily ward rounds by ICU consultants and a dedicated anaesthetist to help with airway management and other out-of-hours intensive care issues. There may be opportunities to rotate to other intensive care units within the University College London NHS Foundation Trust hospitals. There are opportunities for audit, clinical research and quality improvement projects, as well as developing technical skills and competencies in Critical Care Medicine.&lt;/p&gt;\n&lt;p&gt;There is a weekly formal educational programme, consisting of consultant/senior delivered teaching twice a week, journal club and informal bedside teaching.&lt;/p&gt;\n&lt;p&gt;Applicants must hold full registration with the GMC and must have successfully completed foundation year 2 training &lt;strong&gt;in UK &lt;/strong&gt;NHS hospitals. Post-graduate examination qualifications are desirable, but not essential.&lt;/p&gt;\n&lt;p&gt;The successful applicant would participate in a full shift rota which is compliant, attracting a pay banding of 1A and London weighting.&lt;/p&gt;\n&lt;p&gt;This post is not recognised for training by the Postgraduate Dean, Faculty of Intensive Care Medicine or by the Royal College of Anaesthetists, although the unit itself is. This post is full-time and is covered by the Medical and Dental Staff Terms and Conditions of Service. Non-EEA national doctors are eligible to apply provided they fulfil the personal specifications i.e. &lt;strong&gt;have completed UK foundation training programmes&lt;/strong&gt;. If there are no UK citizens or EEA nationals, the post may be filled by a non-EEA national who will require a work permit, but must &lt;em&gt;already&lt;/em&gt; hold a pass in an English language exam and &lt;em&gt;already&lt;/em&gt; be registered with the General Medical Council with a licence to practise.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Dr Gordon Bird or Dr Manprit Waraich&lt;/p&gt;\n&lt;p&gt;Email: gordonbird@nhs.net or manprit.waraich1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Junior Clinical Fellow posts in Adult Neurocritical Care (FY3/ST1+ Le", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254288", "validThrough": "2020-11-10T23:59:59+0000"}