{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35602", "minValue": "31112", "unitText": "YEAR", "value": "£31,112 - £35,602 per annum"}}, "datePosted": "2020-11-05T14:47:00+0000", "description": "&lt;p&gt;ULHT’s maternity team is striving towards excellence and are looking for a passionate, resourceful and motivated midwife looking to join the leadership team and lead an amazing team of midwives.&lt;/p&gt;\n&lt;p&gt;ULHT provides intrapartum care for approximately 5,500 women and their families across two consultant led sites working together closely in order to provide safe effective care for women and their families. Our local community is multicultural with a diverse mix of health needs.&lt;/p&gt;\n&lt;p&gt;For this role, we are seeking an experienced, enthusiastic midwife with excellent communication &amp; organisational skills to lead and manage the Labour Ward at Pilgrim Hospital, Boston putting patients and safety as a priority. Some of the key duties are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide high quality midwifery care and continued responsibility for the management of the Labour Ward.&lt;/li&gt;\n&lt;li&gt;To provide direction and leadership to the midwifery team.&lt;/li&gt;\n&lt;li&gt;To implement and manage effective change management.&lt;/li&gt;\n&lt;li&gt;Establish and maintain effective professional networking relationships with the multi-professional team across ULHT.&lt;/li&gt;\n&lt;li&gt;Work closely with the whole maternity team to support the drive to achieve the Maternity Safety agenda.&lt;/li&gt;\n&lt;li&gt;To take operational responsibility for the effective utilisation of all appropriate resources.&lt;/li&gt;\n&lt;li&gt;To work closely with the whole of Maternity Services across both sites.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate must be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A midwifery clinical practitioner (NMC registered)&lt;/li&gt;\n&lt;li&gt;able to provide an excellent quality of care to patients and service users, both personally and through the team,&lt;/li&gt;\n&lt;li&gt;a visible and effective communicator, leader and role model, with an emphasis to ensure that women and users are involved in their care&lt;/li&gt;\n&lt;li&gt;able to give constructive feedback and see improvements made as a result&lt;/li&gt;\n&lt;li&gt;able to demonstrate compassionate leadership skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Working with the multidisciplinary team the successful candidate will support the team to deliver excellent care to women and their families on the Labour ward. Working together to ensure that all policies and arrangements are designed to ensure parents receive the best possible care.&lt;/p&gt;\n&lt;p&gt;This is currently a time of exciting changes for maternity provision within Lincolnshire as a local Maternity system (LMS) has been established by the CCG’s with the Lincolnshire Sustainability and Transformation Partnership. ULHT are embracing the opportunity for all women to have a personalised maternity care plan with continuity of carer with care delivery as close to home as possible via community hubs. The aim of this model of care is to improve the health of women and their families now and for future generations. Within Lincolnshire Continuity of Carer models for antenatal, intrapartum and postnatal care have also been launched.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information contact: &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Name: Georgina Gould&lt;/p&gt;\n&lt;p&gt;Job title: Midwifery Matron&lt;/p&gt;\n&lt;p&gt;Email address: georgina.gould@ulh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01205 445424&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pilgrim Hospital, Boston", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Labour Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258190", "validThrough": "2020-11-19T23:59:59+0000"}