{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum plus HCA where applica"}}, "datePosted": "2020-10-29T14:00:44+0000", "description": "&lt;p&gt;&lt;strong&gt;*** Please note that At-Risk candidates will be given priority consideration ***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We currently have an exciting opportunity for 2 Customer Resolution Senior Analysts to join our Customer Resolution Team based in Ashford, Kent.&lt;/p&gt;\n&lt;p&gt;The Customer Resolution Senior Analyst, is a customer facing role with responsibility for delivering IT support services via a multi-channel operation, including telephone, email, web and face to face. You will report to the Customer Resolution Team Lead.&lt;/p&gt;\n&lt;p&gt;The Customer Resolution Senior Analyst will be responsible for end-to-end management of a diverse range of incidents, service requests, problems and major incidents in addition to providing expert technical advice on a wide range of systems and technologies.&lt;/p&gt;\n&lt;p&gt;As such, we are looking for an individual who has proven their ability to diagnose, resolve, monitor and deliver against strict SLAs and KPIs within a busy Support Service environment. &lt;br /&gt;&lt;br /&gt;The Analyst will demonstrate commercial awareness and an innovative approach to service delivery in a rapidly changing environment. &lt;br /&gt;&lt;br /&gt;NEL aims to be the market leader in the local provision of high quality and responsive services to our customers enabling clinically led service improvement and increasing the value of their investment decisions. Through the provision of professional and customer focused commissioning support we will deliver value to customers through knowledge, expertise and innovation. The range of contracts services by NEL will cover all areas of commissioning support tailored to meet individual client requirements.&lt;/p&gt;\n&lt;p&gt;For further details on this job, please refer to the JD attached. Please ensure that you pay careful attention to the essentials and desirables of the person specification when completing your supporting statement.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSteven CamaraEmail addressstevencamara@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent House, Ashford", "postalCode": "TN23 1PP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1477", "longitude": ".875876"}}, "title": "Senior Customer Resolution Analyst - Kent x 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248616", "validThrough": "2020-11-12T23:59:59+0000"}