{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-10-21T16:30:59+0100", "description": "&lt;p&gt;We are a dynamic, busy inner-city Emergency Department with a yearly attendance of 110,000 patients, offering a wide range of clinical experience.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for enthusiastic, energetic, proactive and motivated individuals to join our friendly and dynamic team within our busy department, as we continue to develop patient led services and expand nursing roles that reflect the on-going changes in Emergency healthcare.&lt;/p&gt;\n&lt;p&gt;Our commitment to staff development is reflected in our supernumerary induction programme and mentorship package for all new staff, and a Band 5 competency programme. This is led by our dedicated A&amp;E Professional Development Team, and supported through our Team Structure.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Band 5 Essential requirements: ·&lt;/p&gt;\n&lt;p&gt;NHS acute experience 6 months or more.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Evidence of professional development in the last 12 months.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If this is appeals to you, why not apply today and join our amazing team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is a fantastic and inspiring opportunity, to be part of a large team within a new super hospital, where two Emergency Departments will come together into one large department.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Midland Metropolitan Hospital is being built in Smethwick and will be open in 2022. It will be the single acute hospital for Sandwell and West Birmingham, providing state of the art healthcare facilities for the population. The Midland Metropolitan will house the emergency department, maternity, acute inpatient wards and operating theatres. Sandwell Hospital remains the site for the Trust headquarters. As well as providing outpatient services, day case surgery and intermediate care beds, the Sandwell Treatment Centre will have a large Urgent Care Centre. The City Hospital site will provide outpatient care and day case surgery from the Birmingham Treatment Centre. Intermediate care beds will remain on the City Hospital site along with the Birmingham and Midland Eye Centre.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnnabel BottrillJob titleMatronEmail addressannabel.bottrill@nhs.netTelephone number0121 507 6036Additional contact information&lt;/p&gt;\n&lt;p&gt;Danielle Scott- Department Lead&lt;/p&gt;\n&lt;p&gt;0121 507 5374 (Monday-Friday)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Hospital, Birmingham", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Staff Nurse (RN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237295", "validThrough": "2020-11-10T23:59:59+0000"}