{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive"}}, "datePosted": "2020-10-29T13:46:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Clinical Trials Associate / Clinical Trials Rater&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NIHR UCLH Clinical Research Facility is a well-established Clinical Research Facility covering two sites; a comprehensive Cancer and Medical research facility on the Bloomsbury campus (BC) at 170 Tottenham Court Road, and the Leonard Wolfson Experimental Neurology Centre is a dedicated neuroscience experimental medicine facility at the National Hospital for Neurology and Neurosurgery (NHNN) at Queen Square (QS).&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a self-motivated and enthusiastic Clinical Trials Rater to work in the CRF and be responsible for administering neuropsychological tests and clinical, functional and psychiatric rating scales and measures for research participants across the portfolio of clinical research studies at the CRF.&lt;/p&gt;\n&lt;p&gt;The post holder will also have a key role in assisting the clinical trial coordination team at the CRF in processing amendments, assisting with trial set up/close out activities, management of the clinical trial data, ensuring timely data collection and query resolution, to ensure that study information is maintained on databases to accurately reflect CRF activity. The post holder is responsible for ensuring the regulatory aspects of clinical trials are maintained to Good Clinical Practice (GCP) standards.&lt;/p&gt;\n&lt;p&gt;The post holder will be based across both CRF sites according to the needs and requirements of the busy and dynamic study portfolio.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joshua Elflein joshua.elflein@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Clinical Trials Associate / Clinical Trials Rater", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248540", "validThrough": "2020-11-12T23:59:59+0000"}