{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 Per Annum"}}, "datePosted": "2020-11-02T11:32:21+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Consultant Clinical or Counselling Psychologist to lead the psychological staff working across the acute pathway in Leeds for working age adults. The psychological workforce in the acute pathway has expanded considerably in recent years. The service promotes multidisciplinary leadership and there are opportunities to influence and shape psychologically informed practice across the pathway in concert with other disciplines. Psychological professions staff are embedded in the various teams in the acute pathway and ensure care plans are psychologically informed, facilitate formulation meetings, contribute to safety huddles, offer consultation, and deliver training.&lt;/p&gt;\n&lt;p&gt;The clinical component of this post will be to work with the PICU ward and ward 4(Acute Male) at the Newsam centre.&lt;/p&gt;\n&lt;p&gt;The successful applicant of this post will line manage the psychological staff and be key in ensuring governance and staff development is in place, working closely with the clinical lead and service manager to develop and inform the direction of services.&lt;/p&gt;\n&lt;p&gt;We seek an individual with an appetite to learn and practice good governance who demonstrates an enthusiasm for working in the acute pathway for people with acute and complex needs. The post holder is supported by other 8c colleagues in the Trust including a professional lead. The consultants are in turn supported by the strategic lead for the psychological professions.&lt;/p&gt;\n&lt;p&gt;The Trust has well established links with the local D. Clin Psych course and access to a well-established Post Qualification Training programme. The Trust has won awards and is committed to research.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further discussion and information please contact Caroline Ispan on 07980970608 &lt;/strong&gt;&lt;strong&gt;caroline.ispan@nhs.net&lt;/strong&gt;&lt;strong&gt;. Or contact Maureen Cushley on &lt;/strong&gt;&lt;strong&gt;Maureen.cushley@nhs.net&lt;/strong&gt;&lt;strong&gt; or Rob Mcfarland on Robert.mcfarland1@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Becklin &amp; Newsam Centres, Leeds", "postalCode": "LS9 7BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8053", "longitude": "-1.52446"}}, "title": "Consultant Clinical, Counselling  Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251817", "validThrough": "2020-11-15T23:59:59+0000"}