{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-11-06T12:50:17+0000", "description": "&lt;p&gt;Are you looking for a career and not just ‘another job’? Perhaps one where you can make a real difference to patients? Do you enjoy getting out and about and relish the thought of meeting our patients and driving around our local villages, towns and cities to get them to their appointments safely and punctually?&lt;/p&gt;\n&lt;p&gt;If so, working as an Ambulance Care Assistant on our Patient Transport Service could be the perfect role for you.&lt;/p&gt;\n&lt;p&gt;We want to recruit people to join our team who live and breathe our key values of Caring, Teamwork, Professionalism and Innovation.&lt;/p&gt;\n&lt;p&gt;You will spend a lot of your time lifting, as some of our patients are not able to make their own way to our vehicles.&lt;/p&gt;\n&lt;p&gt;Please refer to the attached weight equivalence poster and our YouTube video to get an idea of what it feels like to carry a 12 stone manikin up and down stairs, walking both forwards and backwards.&lt;/p&gt;\n&lt;p&gt;This is a driving role in a long wheel-base vehicle with manual transmission. You will be fully trained in safe driving practices and must be able to demonstrate that you are an experienced and competent driver, ideally with good knowledge of the local area.&lt;/p&gt;\n&lt;p&gt;You will work a mixture of shift patterns some of which will be with a colleague and others where you will work aloneand you will have help and support from a number of experienced colleagues to help you get started in your role.&lt;/p&gt;\n&lt;p&gt;Although our patients attend non-emergency appointments, it’s important to remember that there will be a requirement to be flexible with shifts – you will work within a variety of start and finish times, covering 365 days year. This does mean that you will work at weekends and over bank holidays.&lt;/p&gt;\n&lt;p&gt;You must have experience of working in a customer or patient care role.&lt;/p&gt;\n&lt;p&gt;You need to show us that you are warm, welcoming and friendly and able to reassure the patients in your care.&lt;/p&gt;\n&lt;p&gt;You must hold a full manual B driving licence as a minimum, with no more than 3 penalty points&lt;/p&gt;\n&lt;p&gt;You must be able to commit to a three week, full time training programme based at our Newbury Education and Resource Centre.&lt;/p&gt;\n&lt;p&gt;In return, we will give you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;All the clinical skills you need to perform this role;&lt;/li&gt;\n&lt;li&gt;A competitive salary of £18,005.00 plus applicable unsocial hours payments under section 2;&lt;/li&gt;\n&lt;li&gt;Full-time hours;&lt;/li&gt;\n&lt;li&gt;Automatic enrolment to the NHS Pension Scheme;&lt;/li&gt;\n&lt;li&gt;Starting annual leave entitlement of 27 days plus bank holidays, rising to 33 days after 10 years’ service;&lt;/li&gt;\n&lt;li&gt;Lots of opportunities for career development;&lt;/li&gt;\n&lt;li&gt;Opportunities to apply for continuing professional development and other educational qualifications;&lt;/li&gt;\n&lt;li&gt;Occupational Health support along with an Employee Assistance Program.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122412.jpg", "name": "South Central Ambulance Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122412"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sussex - Location TBC", "postalCode": "BN23 6FA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7962", "longitude": ".31874"}}, "title": "BANK Ambulance Care Assistant - Sussex", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259757", "validThrough": "2020-11-15T23:59:59+0000"}