{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum, inc HCA"}}, "datePosted": "2020-11-03T14:16:58+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are recruiting a band 5 Staff Nurse for our Outpatients service, providing nursing support for the clinics. Although this position will be based at Beckenham Beacon, the successful applicant must be able to work across sites.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will demonstrate good clinical knowledge in order to provide the optimum quality of care to all patients attending the Outpatients Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be required to work unsupervised and support the multi-professional team in line with Nursing and Midwifery registration guidelines.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will provide clinical supervision of junior staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working in a unit that provides a positive working environment, ensuring that high standards of patient care are maintained and that the patient remains at the focus of all that we do.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful applicants will have good communication skills, have a good knowledge of clinical standards and a range of clinical skills including venepuncture, ECG recordings and observations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must be an excellent team player whilst being prepared to develop as an individual and support others to develop.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a full-time position working 37.5 hours per week.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAvril CoffeyJob titleOutpatient Team LeaderEmail addressavril.coffey@nhs.netTelephone number01689866692&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beckenham Beacon, Beckenham", "postalCode": "BR3 3QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4051", "longitude": "-.033175"}}, "title": "Staff Nurse - Outpatients Department - Beckenham Beacon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254314", "validThrough": "2020-11-17T23:59:59+0000"}