{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa"}}, "datePosted": "2020-11-05T09:15:57+0000", "description": "&lt;p&gt;The NHS is the biggest employer in Europe. It’s a world-renowned institution and an exciting place to work, full of challenges and opportunities.&lt;br /&gt;NHS Midlands and Lancashire Commissioning Support Unit is one of the biggest and best-performing commissioning support units in the country, with among the highest levels of staff and customer satisfaction. We work together as a team of over 1,600 expert staff based across the Midlands and North West to make a difference – for our customers, patients and communities.&lt;/p&gt;\n&lt;p&gt;Offering a full range of professional services to clinical commissioning groups (CCGs), hospital trusts, local authorities, integrated care systems (ICSs) and other public bodies across the country, our NHS values underpin everything we do.&lt;/p&gt;\n&lt;p&gt;Our highly skilled Business Intelligence team delivers services to thousands of users across multiple organisations and has staff based in Leyland near Preston, Stoke-on-Trent, Liverpool, Chester, Leicester and West Bromwich.&lt;/p&gt;\n&lt;p&gt;This post offers an exciting opportunity to join the Business Intelligence team at NHS Midlands &amp; Lancashire Commissioning Support Unit.&lt;/p&gt;\n&lt;p&gt;The post holder will oversee the development, deployment and on-going management of Business Intelligence systems including multiple SQL Server databases within the organisation’s Data Warehouse environment, and to take a leading role in the migration of the organisation’s data warehouse and Aristotle reporting system to new technologies &amp; platforms.&lt;/p&gt;\n&lt;p&gt;The post holder will play a key role in developing, maintaining and evolving the data warehouse and reporting service used by the Business Intelligence function, the organisation and its customers. The post-holder will co-lead on specification and development of datasets, processes and reports to enable Business Intelligence to deliver a first class, comprehensive and proactive service. The post holder will ensure the integrity of data across all datasets. The post holder will be responsible for maintaining high-availability over all BI systems, for ensuring that the SQL databases are running at maximum efficiency, and for contributing to assessments of technical infrastructure requirements to meet current and future load expectations.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work closely &amp; proactively with other senior/lead technical roles to identify, develop and implement architectural changes, security model(s), design templates and development standards.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndy BurnsJob titleBI Data Warehouse and Security ManagerEmail addressandrew.burns@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128334.png", "name": "Midlands and Lancashire Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128334"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jubilee House, Leyland, Preston", "postalCode": "PR26 6TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7076", "longitude": "-2.69456"}}, "title": "BI Data Systems Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257027", "validThrough": "2020-11-12T23:59:59+0000"}