{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pro rata per annum"}}, "datePosted": "2020-10-28T12:31:45+0000", "description": "&lt;p&gt;&lt;span&gt;We are looking for an experienced and enthusiastic Clinical Psychologist with experience in adult acute, adult forensic mental health or psychiatric intensive care inpatient services to provide specialist psychological input into Beckfield Ward based at Hopewood Park Hospital in Sunderland. Beckfield is the trust wide Psychiatric Intensive Care Unit (PICU) and has 14 beds providing assessment and treatment by a multi -disciplinary team. The service is for men and women over the age of 18 years detained under The Mental Health Act (1983) who are experiencing a relapse or crisis and require a period of intensive secure care until they can return to an open inpatient unit.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;The post holder will be an integral part of the ward multi-disciplinary and leadership teams and will carry out both direct and indirect work to assist individuals with complex presentations and contribute to the teams understanding, to enable the best possible plans to support them to be devised. A key part of the role will involve leading on embedding formulation and trauma informed care in this setting. As part of the wider psychology team the post holder will be responsible for coordinating the provision of training in psychological knowledge and skills to other disciplines and contributing to the delivery of this training along with other members of the psychology team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post involves providing expertise in applying specialist psychological assessment, including cognitive assessments, formulation and interventions with service users experiencing complex mental health problems, contributing to assessing and understanding complex risk, developing behaviour management plans and providing team supervision and training. The role may also involve evaluation, research and audit. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be part of a strong and supportive inpatient psychology team in the South Inpatients Clinical Business Unit with psychologists working into adult acute, adult rehabilitation, older adult mental health and learning disability inpatient settings. The post holder will be line managed and supported by a Consultant Clinical Psychologist with extensive experience in adult inpatient services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The team is part of a valued trust wide psychological service providing input into community based and specialist services across the lifespan. Psychological Services have a range of regular meetings and support activities to ensure professional governance and to promote evidence based and innovative psychologically informed care. There are also trust wide clinical networks in Adult Mental Health and Personality and Complex Trauma which are relevant to the service provided by the PICU and this role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting and challenging opportunity to support inpatient service development and to provide clinical leadership within a complex and challenging but rewarding multi-disciplinary setting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In preparing their application potential candidates are advised to consider the the additional information alongside the job description and person specification.&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;We are looking for someone to work 18.75 hours per week&lt;/strong&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Veronica Locatelli-Booth - Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Email: veronica.locatelli-booth@cntw.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hopewood Park Hospital, Sunderland", "postalCode": "SR2 0NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8615", "longitude": "-1.37568"}}, "title": "Principal Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246615", "validThrough": "2020-11-11T23:59:59+0000"}