{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T08:16:27+0000", "description": "&lt;p&gt;Hywel Dda University Health Board has an exciting opportunity for a motivated, enthusiastic and ambitious Neonatal Nurse to join our Special Care Baby Unit as a Junior Sister.&lt;br /&gt;&lt;br /&gt;Neonatal services in Hywel Dda University Health Board have changed. The unit in Carmarthen provides 1 stabilisation cot, 4 high dependency cots and 8 special care cots. Along side SCBU a new service is being developed- a 4 cot transitional care unit. A neonatal outreach service has also been developed. We are committed to staff development and service improvement. &lt;br /&gt;&lt;br /&gt;A Band 6 vacancy has arisen in the Unit at Glangwili Hospital. The unit currently provides short term intensive care, high dependency care and special care. We are committed to the provision of high quality evidence based practice to meet the needs of parents and babies incorporating family centred care. &lt;br /&gt;&lt;br /&gt;We are looking for an experienced, enthusiastic and self motivated neonatal nurse (RGN/RSCN/Child Branch) with post registration neonatal intensive care qualification) to join our friendly experienced team. You will have excellent clinical and communication skills. Previous Band 6 or management experience is desirable. The successful candidate will lead/coordinate shifts, be able to work well independently and within the team. They will also enjoy teaching and supporting junior staff as well as pre registration student nurses. This post involves a day/night rotation.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sandra Pegram&lt;/p&gt;\n&lt;p&gt;Ward Manager&lt;/p&gt;\n&lt;p&gt;sandra.pegram@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01267 227567&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthenshire", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Junior Sister / Charge Nurse Special Care Baby Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245708", "validThrough": "2020-11-12T23:59:59+0000"}