{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-21T18:00:31+0100", "description": "&lt;p&gt;The children&#39;s service aims to provide a high quality, effective, community orientated service where primary, secondary and acute care are combined through a focus on each child&#39;s needs. The service works closely with general practitioners and primary care teams to ensure that every child&#39;s normal development is promoted and that all have access to the Child Health Promotion Programme, including immunization. Community Health Services works collaboratively with the nursing services and professions allied to medicine to provide a range of secondary community based services.&lt;/p&gt;\n&lt;p&gt;There are close links with all surrounding hospital trusts with access to a full range of secondary and tertiary hospital children&#39;s services including those based at The Royal Hospital in Whitechapel and Great Ormond Street Hospital. Joint working with the Children’s Service department of Redbridge council and the voluntary sector is actively promoted. The team has a full multidisciplinary team (MDT) with good links with primary care, social services, education, CAMHS and the voluntary sector. The team is also presently undergoing integration with CAMHS services.&lt;/p&gt;\n&lt;p&gt;The following care pathways are being developed:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Epilepsy&lt;/li&gt;\n&lt;li&gt;Spasticity and motor disorder&lt;/li&gt;\n&lt;li&gt;ASD&lt;/li&gt;\n&lt;li&gt;ADHD&lt;/li&gt;\n&lt;li&gt;LD and syndromes&lt;/li&gt;\n&lt;li&gt;LAC and adoption and fostering&lt;/li&gt;\n&lt;li&gt;Safeguarding&lt;/li&gt;\n&lt;li&gt;SEN&lt;/li&gt;\n&lt;li&gt;Transition&lt;/li&gt;\n&lt;li&gt;Emotional difficulty&lt;/li&gt;\n&lt;li&gt;Conduct disorder&lt;/li&gt;\n&lt;li&gt;Psychosis The ASD and ADHD pathways will be joint pathways with CAMHS services. Scope exists for the successful candidate to be creative and to shape and develop services according to their interest, providing it is in line with the general requirements of the service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post is for 5 sessions substantive Consultant Paediatrician in Community Paediatrics based at The Grove CDC, Grove Road, Chadwell Heath, RM6 4XH. The post holder will work alongside 3 other substantive consultants, an associate specialist and two Specialty doctors (previously staff grade paediatricians) on the unit. There is a Named doctor for Safeguarding on the unit and a separate 0.5 wte consultant in the Designated Safeguarding role who sits in the local CCG and provides supervision for Safeguarding to the Named Doctor in Redbridge. All consultants form part of peer discussion groups in the Trust. There is also a provision for the Named doctors across all four boroughs in the Trust to meet, to develop working relationships and to obtain support from each other. In Redbridge, we also have a monthly safeguarding peer discussion learning group within the local Redbridge academics. The successful candidate will be accountable to the Borough Associate Medical Director.&lt;/p&gt;\n&lt;p&gt;The post attracts relevant Direct Clinical Care and supporting professional activities. Timetables offer a degree of flexibility in that the type of clinic activities is negotiable as allowed by service needs and based on the interests and skills of the successful applicant. The post offers excellent CPD and study leave arrangements as well as good research, quality improvement and service development opportunities. Applicants who want to work part time will also be considered.&lt;/p&gt;\n&lt;p&gt;The post requires candidates to have Full GMC Registration with License to Practice in the UK, MRCPCH/MRCP (or equivalent), CCT in Paediatrics or eligibility to apply to be on the UK Specialist Register in Paediatrics. A minimum of 2 years experience in community child health, experience in child protection examination and safeguarding is necessary. Training in child protection/safeguarding, Level 3 competencies in the Intercollegiate guidelines 2012: Knowledge, skills and competences for Looked After Children and Level 3 competencies in the intercollegiate guidelines for safeguarding 2014 are essential.&lt;/p&gt;\n&lt;p&gt;The post holder will support their peers and team leader and be an effective team member whilst working on their own initiative. They will supervise junior colleagues. They will have a commitment to collaborative working and actively supporting and liaising with other health and social professionals and agencies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Basit Hussain , Basit.Hussain@nelft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel 0300 300 1706 x 53554&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Grove CDC, Chadwell Heath", "postalCode": "RM6 4XH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.577", "longitude": ".121305"}}, "title": "CONSULTANT PAEDIATRICIAN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237477", "validThrough": "2020-11-22T23:59:59+0000"}