{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50000", "minValue": "44250", "unitText": "YEAR", "value": "44,250 - 50,000"}}, "datePosted": "2020-10-27T08:38:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Ward Manager -  Low Secure - &lt;/strong&gt;&lt;strong&gt;Spencer South&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Empower your career leading a team on the mental health frontline!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£44,250-£50,000 (depending on experience) + excellent benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you ready for your next career step or looking for a new challenge?  If you are passionate about patient care and involvement as well as looking for your next position in leadership and management that will also provide you with personal development opportunities, working within a strong and established leadership team, then this role is for you! You will either be a qualified nurse or hold a clinical professional qualification within a multi-disciplinary profession and will lead a team of nursing and MDT staff to ensure clinical excellence and outstanding care are delivered at all times. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will lead by example and inspire those around you to provide exceptional care and operational and clinical excellence on the ward. As part of the management team, you will work with colleagues and senior leaders to lead your team and achieve CQC outstanding.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A bit about us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are the UK’s largest mental health charity and a unique provider of specialist care in mental health and learning disability.&lt;/p&gt;\n&lt;p&gt;Our independence means we can always put patients’ interests at the heart of decision making, while re-investing surpluses in frontline services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;So what is the role?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our patients and your colleagues will expect you to live the St Andrew’s CARE values of Compassion, Accountability, Respect and Excellence every single day.&lt;/p&gt;\n&lt;p&gt;As a Ward Manager you will have managerial and operational responsibility for your ward and will ensure mechanisms are in place to support, develop and monitor all aspects of performance.  You will be key to ensuring the delivery of operational excellence and pivotal to the delivery of high levels of nursing and care by providing day-to-day support and operational leadership.  You will proactively monitor standards and lead innovative processes to improve quality and the operational management of your ward.&lt;/p&gt;\n&lt;p&gt;As a positive and strong leader you will set a clear and compelling vision for your team, you will be a visible presence who influences and supports consistently great teamwork and a positive culture.  You will lead by example and motivate your teams to provide exceptional levels of care to your patients.  As an enthusiastic and positive change agent, your dedication, professionalism and communication skills will inspire others to also go the extra mile and display high levels of performance in even the most challenging situations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where will I be working?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; Spencer South is a service that offers treatment to women with emotionally unstable personality disorders (EUPD) and an associated eating disorder.  The highly specialist care is delivered in a clinically appropriate environment. It offers a solution for women who bounce between mainstream personality disorders or eating disorder services who are unable to support the complex co-morbidities that the individual presents with. The rehabilitation-focussed service allows women to learn and develop skills (psychological and occupational) that will enable them to discharge to community services at the earliest stage.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s in it for me? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Many of our senior leadership team are former Ward Managers who have graduated through our development programmes, like them you will be able to hone your skills and expertise to become a recognised role model across our Charity.&lt;/p&gt;\n&lt;p&gt;You will be able to access our (Charity-wide) coaching and mentoring programmes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer an excellent package that includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent professional and career development and training opportunities&lt;/li&gt;\n&lt;li&gt;‘Transform’ our Leadership development program&lt;/li&gt;\n&lt;li&gt;Relocation allowance (eligibility criteria applies) – include???&lt;/li&gt;\n&lt;li&gt;Pension and life assurance&lt;/li&gt;\n&lt;li&gt;Sickness policy on par with the NHS&lt;/li&gt;\n&lt;li&gt;38 days annual leave, increasing further with service (including bank holidays)&lt;/li&gt;\n&lt;li&gt;Access to huge savings through retail discount and cashback schemes from St Andrew’s Reward Gateway, Blue Light Card and Health Service Discounts&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Healthcare cash plan&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;Paid DBS application&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Then we’d love you to apply here or email your interest to nurses@standrew.co.uk.&lt;/p&gt;\n&lt;p&gt; &lt;strong&gt;Closing Date - 10th November  &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NORTHAMPTON", "postalCode": "NN1 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2382", "longitude": "-.873687"}}, "title": "Ward Manager -  Low Secure - Spencer South", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243729", "validThrough": "2020-11-10T23:59:59+0000"}