{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26307", "minValue": "26307", "unitText": "YEAR", "value": "£15.65 per hour plus 10% annual leave"}}, "datePosted": "2020-10-21T11:19:51+0100", "description": "&lt;p&gt;A rare and exciting opportunityto appoint an enthusiastic and highly motivated band 5 Children’s Nurse has arisen within our integrated Community Children&#39;s Nursing (CCN) team in Southampton.&lt;/p&gt;\n&lt;p&gt;The CCN team works collaboratively with children, families and the wider multi-disciplinary team to ensure care is delivered as close to home as possible. We provide high quality and holistic, family centred care to children and young people with a nursing need across the Southampton area. These include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Acute and short-term conditions&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Long term conditions&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Disabilities, complex conditions, those requiring continuing care and neonates&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Life-limiting and life-threatening illness, including those requiring palliative and end of life care&lt;/p&gt;\n&lt;p&gt;As part of future plans for an integrated community children’s nursing team there will be the opportunity to rotate through the different community services and gain valuable experience in providing care to a variety of children and families with different conditions.&lt;/p&gt;\n&lt;p&gt;This opportunity will provide excellent experience of working with children and families in the community setting, as well as the chance to transfer acute skills and develop your ability to manage a caseload. This role will involve working within the CCN team, in partnership with the wider MDT to assess, implement and evaluate care for children across the age ranges (0-18).&lt;/p&gt;\n&lt;p&gt;If you have excellent communication and interpersonal skills, the ability to work as a team player, as well as the initiative to work autonomously, we would like to hear from you. You should have good organisational skills and evidence of continued professional development. A minimum of six months post qualification experience is essential and previous community nursing experience would be desirable, although not essential.&lt;/p&gt;\n&lt;p&gt;At Solent NHS Trust, we are committed to putting patients at the forefront of care and are always looking for dedicated professionals who share our HEART values and passion for delivering high quality care. As a valued member of Solent NHS Trust, we’ll offer you a competitive salary of £21,909 - £28,462 per annum (pro-rata), NHS pension, on-going training and development and good quality working conditions. Solent NHS Trust is a well-regarded and established provider of community services in Southampton. Join us and be part of a truly compassionate and caring team working to make a real difference within our trust.&lt;/p&gt;\n&lt;p&gt;If our Community Children’s Staff Nurse role appeals to you, and you have the qualities we are looking for, share our values and feel excited by the prospect of how we can complement your professional career then we would love to hear from you. We welcome you to contact us prior to interview to discuss this post further and to arrange a suitable time to come along for an informal visit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Bank Children&#39;s Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236101", "validThrough": "2020-11-30T23:59:59+0000"}