{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-06T09:59:58+0000", "description": "&lt;p&gt;&lt;span&gt;Gilwern Assessment Unit is looking for Nurses to expand their team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;GAU is currently undertaking the care of the elective day surgical patients and elective major surgery, and it is shaped in a male and female bay with 7 bed spaces each and 2 side rooms. We have also created a waiting area to accommodate our local anaesthetic patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In GAU, the candidate will receive the relevant training in taking care for the day surgical patients and the major surgical patients and we will provide full information regarding general and regional anaesthetic.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Part of the training provided in GAU will be focused on the aspects of the nurse –led discharge, successful pathway for the management of the major gynaecological patients, major colorectal, major urology and day surgical patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The learning aspect may be improved by attending a few free online training which can be beneficial for the general understanding of the patient selection, enhanced anaesthetic pathway and post-operative support and certainly for your personal revalidation. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will be required to be compliant to the ward workforce and be expected to complete all the mandatory trainings and the regular annual appraisal. Everyone who would expand their knowledge regarding elective surgical patients will receive the relevant up skilling program.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Nevertheless, extra training or conferences provided by external associations can be attended with previous discussion with the ward manager.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will also work with a wide MDT and might have the chance of working on the Day Surgery Unit when this will reopen; therefore we require staff who are interested in surgery, can enhance recovery and have the ability to work within a fast pace environment. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role includes diverse responsibilities which also include managing an elective surgical list, support for the workforce, taking charge of the ward by developing the relevant leadership and management skills when the senior leaders are not on duty, and participating and proactively performing data collection.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For the time being staff are required to work on rotational shifts (long days and nights), including weekends, however flexible working hours requests are taken in consideration especially considering the reopening of Day Surgery and the Surgical Admission Unit.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you feel you can make the difference and you believe you are the person we are looking for, please apply for the role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For any questions or further information, please contact Sister Giorgia Paparella – ext. 4250, &lt;/span&gt;&lt;span&gt;Giorgia.Paparella@wvt.nhs.uk&lt;/span&gt;&lt;span&gt;.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120745.gif", "name": "Wye Valley NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120745"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "Staff Nurse - GAU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259121", "validThrough": "2020-11-20T23:59:59+0000"}