{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17600", "minValue": "16700", "unitText": "YEAR", "value": "£16,700 to £17,600 Dependent on Experience"}}, "datePosted": "2020-10-29T11:25:35+0000", "description": "&lt;p&gt;Beacon Medical Services Group is an innovative community based service provider committed to providing a high standard of clinical care.&lt;/p&gt;\n&lt;p&gt;At Beacon Medical Services we are passionate about providing high quality patient centred care. We are currently recruiting highly motivated, dynamic forward thinking Healthcare Support Assistants to work within ourwell established Ultrasound Servicecovering Greater Manchester&lt;/p&gt;\n&lt;p&gt;You will be part of an experienced, diverse team of Healthcare Professionals that support the delivery of Healthcare.&lt;/p&gt;\n&lt;p&gt;The successful applicant will share our vision and is committed to our values and goals for the delivery of the best care to our patients. An innovative thinker who inspires the team whose focus is putting the patient first will be rewarded by working within an organisation who puts the needs of patients and the development of our staff at the core.&lt;/p&gt;\n&lt;p&gt;If you have all of these qualities and would like to work for an organisation that ensures excellence in patient care is achievable, then we would like to hear from you. For any informal enquiries please email claire.taker@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M22 4DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4063", "longitude": "-2.26229"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248105", "validThrough": "2020-11-23T23:59:59+0000"}