{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-30T17:01:24+0000", "description": "&lt;p&gt;The Radiotherapy Physics group at University Hospital Southampton NHS Foundation Trust (UHS) is looking for enthusiastic and experienced physicists to join our dedicated and friendly team.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;The Radiotherapy Department at UHS is equipped with five Elekta Versa HD linacs, 2 of which have Exactrac imaging and hexapod to support our linac based stereotactic service, 1 Elekta precise and an Elekta Agility at the Basingstoke site.&lt;/p&gt;\n&lt;p&gt;The department also supports IntraOperative radiotherapy services using a mobile electron accelerator (Mobetron) at Southampton and Intrabeam system for breast IORT at Winchester.&lt;/p&gt;\n&lt;p&gt;The department uses Pinnacle planning system and Mosaiq oncology management system. Elements planning system is currently being commissioned to deliver a planning solution for multiple mets.&lt;/p&gt;\n&lt;p&gt;We provide a comprehensive brachytherapy service including Gynae and prostate HDR and a prostate seed service. The department also has a superficial unit. Pre-treatment imaging is carried out on our 2 wide bore CT scanners.&lt;/p&gt;\n&lt;p&gt;The department is an accredited training department for Modernising Scientific Careers STP and HSST Programmes as well as IPEM training for Clinical technologists and route 2 for Clinical Scientists.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be encouraged to develop their radiotherapy skills, as well as attend scientific conferences and partake in research and development projects and continuing professional development.&lt;/p&gt;\n&lt;p&gt;Flexible Working arrangements including a mix of onsite and home working are supported.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;The successful candidate will work across our 2 sites (Southampton General Hospital and Basingstoke and North Hampshire Hospital), providing medical physics expert level support to the service.&lt;/p&gt;\n&lt;p&gt;Successful applicants, will work as a member of the integrated team in provision of the clinical service working with the QA, treatment planning, brachytherapy and scientific computing teams.&lt;/p&gt;\n&lt;p&gt;The department has many active development projects including progression of automated planning solutions, implementation of new dosimetry systems ( IQM gradient chamber and transit dosimetry using EpiGray), development of software solutions (scripting and coding) for independent plan checking, development of workflow solutions, with the aim of delivering accurate, efficient adaptive solutions. Alongside the clinical service support you will be expected to take a lead in project areas aligned with your areas of expertise and interest.&lt;/p&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;We are looking for someone who has the knowledge and expertise to lead and drive forward development projects whilst also contributing to clinical service support.&lt;/p&gt;\n&lt;p&gt;The position would be suitable for someone who has sufficient post registration experience in Radiotherapy Physics to be appointed as an MPE. If not yet on the MPE list applicants would be appointed at Band 7 but actively supported to achieve accreditation as a Medical Physics Expert before appointment at Band 8A. Successful applicants should expect to be ready within maximum 1 year to complete certification as an MPE. Applicants should outline relevant experience towards this certification in the application and this will be discussed at interview.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Tuesday, 24 November 2020.&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Claire BirchJob titleHead of Radiotherapy Physics Email address Claire.birch@uhs.nhs.uk Telephone number 02381206889 or 0708651691&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Principal Clinical Scientist (Radiotherapy Physics)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251023", "validThrough": "2020-11-13T23:59:59+0000"}