{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34000", "minValue": "34000", "unitText": "YEAR", "value": "Up to £34,000 per annum - DOE"}}, "datePosted": "2020-11-06T09:06:22+0000", "description": "&lt;h1&gt;Help make a difference...&lt;/h1&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt; &lt;br /&gt; We can offer training and development in our friendly and supportive teams as well as full-time, part-time and bank opportunities and a range of other employee benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Looking for something different…&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We&#39;re looking for a Primary Care Mental Health Practitioner to support our multi-disciplinary healthcare team at HMP Warren Hill. This means working inside the prison within healthcare and on the prison wings.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care at HMP Warren Hill, we’re looking for a Mental Health Practitioner to join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About the role...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will be the Primary Care mental health practitioner for the mental health team and will provide the triage and assessment for initial referrals and interventions to clients. You&#39;ll play a key role in providing a duty role for urgent referrals and support senior staff in development plans. You will hold your own caseload of patients and will contribute to the ACCT reviews and assessments when required.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;About you...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will either be a Registered Mental Health Nurse/ Social Worker/ Occupational Therapist, or hold membership with BABCP/BACP/ UKCP. A real passion for developing your clinical skills in an ever changing environment is essential.&lt;br /&gt; &lt;br /&gt; If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You’ll receive an annual salary of up to £34,000 - depending on experience; free DBS check, free uniform, free mandatory training, indemnity cover, CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt;As well as a number of benefits including a company pension scheme, 25 days annual leave plus 8 public bank holidays (pro-rata for part-time) plus other benefits including cycle to work scheme and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Next Steps&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role.&lt;br /&gt; &lt;br /&gt; The recruiter will submit your CV to the hiring manager and in turn, will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;br /&gt; &lt;br /&gt; For further information please contact us on the details provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Further job information...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;HMP Warren Hill is a category C adult male prison, located near the village of Hollesley in Suffolk (Hollesley, Woodbridge) - right near the coast and within 40 minutes&#39; drive of Ipswich.&lt;/p&gt;\n&lt;p&gt;This is a full time role, working 37.5 hours per week.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woodbridge", "postalCode": "IP12 3BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0335", "longitude": "1.45177"}}, "title": "Mental Health Practitioner - HMP Warren Hill", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258963", "validThrough": "2020-11-20T23:59:59+0000"}