{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-27T14:01:19+0000", "description": "&lt;p&gt;There has never been a more exciting time to work in the NHS with the recent release of the People Plan; supporting and managing our workforce is high on the national agenda.&lt;/p&gt;\n&lt;p&gt;Yeovil District Hospital is no exception. We are a people-focused employer, and strive to work closely with the values of the NHS at our heart. An ambitious and innovative organisation, we are looking for an equally ambitious individual to fill our HR Advisor vacancy.&lt;/p&gt;\n&lt;p&gt;You will work with a HR Business partner and supervise a HR Assistant as ambassadors for the Department and as such your communication, conciliation and liaison skills will be first-class.&lt;/p&gt;\n&lt;p&gt;With your own caseload to manage, you will work with managers, helping them to interpret policies and procedures, utilising your knowledge of employment law whilst taking a best practice approach. Your excellent customer service skills and application of our policies will ensure that you manage disciplinaries, grievance, sickness absence and capability, amongst others, with sensitivity, confidentiality and tact.&lt;/p&gt;\n&lt;p&gt;You&#39;ll need proven experience of working in a similar HR role providing advice, NHS experience is not essential. Ideally be CIPD qualified or working towards this but it&#39;s not essential. There is also potential scope to be supported to undertake CIPD level 7 study.&lt;/p&gt;\n&lt;p&gt;What is really important to us is that you are someone who naturally adopts a coaching style with managers to help navigate through a range of cases, encouraging managers to take ownership and supporting learning where required.&lt;/p&gt;\n&lt;p&gt;Some of the benefits of working at YDH include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working for a Trust voted 1st for Health and Well-being across the UK (NHS staff survey)&lt;/li&gt;\n&lt;li&gt;Full NHS terms and conditions including extensive holidays, Agenda for Change pay with enhancements&lt;/li&gt;\n&lt;li&gt;Discounts for local and national retailers&lt;/li&gt;\n&lt;li&gt;Dedicated well-being services for all employees&lt;/li&gt;\n&lt;li&gt;Flexible working where possible&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a full time position, 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For more information or an informal discussion about the post, please contact Katharine Raikes, Human Resources Business Partner on 01935 384586&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121892.jpg", "name": "Yeovil District Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121892"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Yeovil District Hospital, Yeovil", "postalCode": "BA21 4AT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9453", "longitude": "-2.63391"}}, "title": "HR Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244829", "validThrough": "2020-11-10T23:59:59+0000"}