{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7"}}, "datePosted": "2020-10-28T14:15:02+0000", "description": "&lt;p&gt;The Royal London Hospital for Integrated Medicine (RLHIM) is the largest public-sector provider of integrated medicine in Europe.The RLHIM offers an innovative, patient-centred service integrating the best of conventional interventions, self-care based approaches, and complementary treatments for a wide range of conditions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Requirements: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be a registered healthcare practitioner (registered nurse, OT, psychologist, Doctor etc.) with a post-graduate qualification in hypnosis&lt;/li&gt;\n&lt;li&gt;You will be able to offer 1 day per week&lt;/li&gt;\n&lt;li&gt;You will be able to demonstrate experience of providing therapy to patients with complex needs&lt;/li&gt;\n&lt;li&gt;Experience in working with patients with long-term physical health conditions&lt;/li&gt;\n&lt;li&gt;Experience of working within the National Health Service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Description:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting a locum Psychological Therapist for 1 day per week in our Psychological Therapies Department. You will work as part of a team providing an outpatient service, both groups and individual therapy, for our patients with Irritable Bowel Syndrome (IBS), and Temporomandibular Joint Disorder (TMD) with Nocturnal Bruxism. Please note that training will be provided in relation to working clinically with the latter population. You will bring your considerable skills and experience as a therapist, working flexibly and collaboratively with these patient groups.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This post is graded at Band 7, reflecting the need for an experienced, independent practitioner&lt;/li&gt;\n&lt;li&gt;You will be responsible for managing your own caseload&lt;/li&gt;\n&lt;li&gt;We will provide weekly in-house 1:1 supervision&lt;/li&gt;\n&lt;li&gt;You will be invited to join our monthly peer group meetings for all clinicians working in Psychological Therapies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank Psychological Therapist Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246917", "validThrough": "2020-11-27T23:59:59+0000"}