{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa, Based on Full Time Hours"}}, "datePosted": "2020-10-19T16:00:23+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title: &lt;/strong&gt;Family Nurse&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary band: &lt;/strong&gt;Band 7 £38,890 -£44,503&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full-time 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Moorgreen Hospital&lt;/p&gt;\n&lt;p&gt;Southern Health NHS Foundation Trust aims to deliver high quality, safe services to improve the health wellbeing and independence of the people we serve.&lt;/p&gt;\n&lt;p&gt;We are recruiting a highly motivated nurse to join the existing team delivering Family Nurse Partnership in Hampshire and based at Moorgreen Hospital, Hedge End.&lt;/p&gt;\n&lt;p&gt;FNP is a national evidence based programme that aims to improve the health and social outcomes for young expectant mothers and their babies from early pregnancy until their child is at least a year old. The programme must be delivered in accordance with the license which requires faithful replication of all its core model elements and a high regard for quality.&lt;/p&gt;\n&lt;p&gt;The role is responsible for delivering the FNP intensive, preventive home visiting programme to vulnerable, hard to reach young women who are expecting their first baby. Post holders will be required to develop high-level generalist and specialist skills to work within the clinical methods of the structured programme. Family nurses will be expected to develop therapeutic relationships with clients and work intensively within complex family situations to achieve the expected outcomes of the programme.&lt;/p&gt;\n&lt;p&gt;This is a demanding specialist role requiring high levels of professional skills and practice and the ability to work as part of a team.&lt;/p&gt;\n&lt;p&gt;If the successful candidate is not currently working as a family nurse they will need to attend a training course in January 2021 with further training courses to follow. Due to COVID 19 restrictions FNP training maybe delivered online and dates are yet to be confirmed.&lt;/p&gt;\n&lt;p&gt;We suggest that prospective applicants review the job description and person specification for the roles and in addition ask themselves:&lt;/p&gt;\n&lt;p&gt;Am I….?&lt;/p&gt;\n&lt;p&gt;• Passionate about making life better for the most disadvantaged children?&lt;/p&gt;\n&lt;p&gt;• Someone who sees strengths not deficits in people?&lt;/p&gt;\n&lt;p&gt;• Keen to have a go and try new things?&lt;/p&gt;\n&lt;p&gt;• Ready to follow or be part of a standardised programme?&lt;/p&gt;\n&lt;p&gt;• Someone who likes to keep learning and stretching themselves?&lt;/p&gt;\n&lt;p&gt;• Reflective?&lt;/p&gt;\n&lt;p&gt;• Tenacious, persistent and resilient?&lt;/p&gt;\n&lt;p&gt;• Self-aware, able to manage difficult conversations and situations?&lt;/p&gt;\n&lt;p&gt;• IT literate and able to appreciate the value of research and routine data collection?&lt;/p&gt;\n&lt;p&gt;• Able to learn in a variety of ways, including skills practice?&lt;/p&gt;\n&lt;p&gt;• Someone with a positive outlook who finds solution to problems?&lt;/p&gt;\n&lt;p&gt;• Prepared to take responsibility for intensive work with vulnerable young clients and families?&lt;/p&gt;\n&lt;p&gt;If you answer ‘yes’ to the above and would like further information then please contact:&lt;/p&gt;\n&lt;p&gt;Fiona Butt - FNP supervisor&lt;/p&gt;\n&lt;p&gt;Fiona.butt@southernhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;07721928872&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date for Applications: 6/11/20&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 20/11/20&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moorgreen Hospital", "postalCode": "SO30 3JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9278", "longitude": "-1.32524"}}, "title": "Family Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233031", "validThrough": "2020-11-06T23:59:59+0000"}