{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-28T14:28:48+0000", "description": "&lt;p&gt;Nuffield Health at St Bartholomew’s   - Cardiac Ward- Sister/Charge Nurse&lt;/p&gt;\n\n\n\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health is the UK’s largest healthcare charity.  Our family of 31 award winning hospitals, 12 fitness and wellbeing clubs, healthcare clinics and over 160 onsite workplace wellbeing services are united in our purpose to build a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In 2021, we’ll open the doors to Nuffield Health at St Bartholomew’s Hospital: The City of London’s only independent hospital, situated next to St Bartholomew’s NHS hospital, Nuffield Health at St Barts will be our flagship centre for cardiac services and will also provide a full range of surgical and medical services, including: orthopaedics, oncology, general surgery, gynaecology and urology surgery.&lt;/p&gt;\n&lt;p&gt;The new hospital will consist of:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;48 inpatient and day case bedrooms&lt;/li&gt;\n&lt;li&gt;28 consultation rooms&lt;/li&gt;\n&lt;li&gt;Three digital operating theatres&lt;/li&gt;\n&lt;li&gt;Cardiac catheterisation lab&lt;/li&gt;\n&lt;li&gt;Specialist intensive care beds&lt;/li&gt;\n&lt;li&gt;Oncology day unit&lt;/li&gt;\n&lt;li&gt;Endoscopy and minor ops theatre&lt;/li&gt;\n&lt;li&gt;Full diagnostic imaging suite including MRI, CT, ultrasound, mammography and general X-ray&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for an experienced Cardiac Nurse to join our brand new team in London.  Together with the Clinical Head of Department you will be operationally responsible for the day to day management and successful running of the 15 bed Cardiac Ward, you’ll enjoy the chance to make a real difference with Nuffield Health. We’ll expect you to actively contribute to service development, policies and strategies, and identify opportunities during the build phase and also prepare the hospital to open in 2021. Once the hospital is operational, you will support individuals and teams to deliver high quality, clinically effective patient care through assessment, planning, implementation and evaluation. Along the way, you&#39;ll build strong relationships with consultants, hospital senior leaders, a wide range of healthcare professionals and, of course, patients. Working collaboratively alongside the consultants, you’ll ensure patients benefit from the best possible treatment and care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will provide strong clinical leadership in the clinical area, leading and managing the clinical team and championing the delivery of the highest quality patient care: care that is patient-centred, evidence-based, brand-defining and innovative; delivered by a trained, motivated, and compassionate team; in line with organisational, regulatory and governance requirements. As the charge nurse/sister, you will support the implementation of local strategy, role-modelling and championing clinical excellence and deputising for the Clinical Head of Department in their absence.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Registered with the Nursing and Midwifery Council, your specialist training must include a Cardiac Care postgraduate qualification and a minimum of ILS, ideally ALS and CALS. You will have extensive experience of managing level 1 post Cardiac surgery and Cardiology procedure patients and ideally have a qualification in teaching and assessment, together with some mentoring experience. You’ve also got an impressive senior level knowledge and will have a minimum of 2 years’ senior experience working in a Cardiac ward setting.  You’ll be accountable for leading, motivating, educating and supervising the nursing and multidisciplinary team. Professional management is essential, as you’ll need to be equipped for business planning and development, audits and clinical governance, infection prevention, health and safety, and risk analysis.&lt;br /&gt;&lt;br /&gt;We want you to be the best you can be. So we promise to support you with training, career development and our unique health and wellbeing focused benefits package. This includes free membership of your local Nuffield Health Fitness and Wellbeing Club, an annual health assessment, as well as a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Ready to bring out the specialist in you?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Salary - £45,000 - £52,000 per annum&lt;/p&gt;\n&lt;p&gt;Closing date: 27/11/2020&lt;/p&gt;\n&lt;p&gt;Location: Nuffield Health at St Bartholomew’s&lt;/p&gt;\n&lt;p&gt;Full-time, 37.5 hours per week&lt;/p&gt;\n\n\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Bart&#39;s Hospital", "postalCode": "EC1A 7BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.517", "longitude": "-.100858"}}, "title": "Cardiac Ward- Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246973", "validThrough": "2020-11-27T23:59:59+0000"}