{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26729", "minValue": "23772", "unitText": "YEAR", "value": "£23,772 - £26,729 pro rata inc. High Cost Allowanc"}}, "datePosted": "2020-10-15T08:16:00+0100", "description": "&lt;p&gt;Clincial Lead for Physiotherapy&lt;/p&gt;\n&lt;p&gt;Band 8a (Job Share)&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an enthusiastic, dynamic and forward thinking Professional Lead for Physiotherapy with excellent clinical and management skills to join our therapy team at East Surrey Hospital in Redhill Surrey. We are looking for an experienced candidate who is interested in working within a multidisciplinary team who is motivated, likes a challenge and wishes to work in a busy friendly department.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a team of therapy leads providing a service to a busy acute trust. The Trust has invested in therapy and training and believes that its staff is their greatest asset.&lt;/p&gt;\n&lt;p&gt;You should be able to demonstrate highly effective communication skills and an ability to liaise with individuals at all levels of the organisation. This role requires operational management and strategic development of the whole team. Your ability to promote inter-professional working and uphold our philosophy of team work is critical. Multi-disciplinary working within the Trust is well-established and students are accepted on placement from several training schools&lt;br /&gt;&lt;br /&gt;You should also be able to work autonomously in undertaking and leading projects and tasks that are key to the development of the department and demonstrate strong organizational and leadership skills to compliment your advanced Physiotherapy knowledge and skills. You will have the opportunity to continue to provide a small clinical caseload to maintain your clinical skills.&lt;br /&gt;&lt;br /&gt;The Therapy team is a dynamic and forward thinking team of dedicated therapists who actively engage in teaching. Training and on-going continual professional development, with opportunities for further education and personal development with regular appraisal, personal learning objectives and supervision from the Therapy Service Manager will form part of your support and development in your role within the team and the wider hospital.&lt;/p&gt;\n&lt;p&gt;This is a part time role of 18.75 hours a week job sharing with the present lead. There is a possibility of the whole therapy service working over 7 days in the near future.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 13/11/20&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sally Dando Head of Therapies&lt;/p&gt;\n&lt;p&gt;sally.dando@nhs.net 01737 768511 x6124&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Surrey Hospital, Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Clinical Lead Physiotherapy -Job share - band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227366", "validThrough": "2020-11-08T23:59:59+0000"}