{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum pro rata"}}, "datePosted": "2020-10-23T13:16:21+0100", "description": "&lt;p&gt;Do you consider caring with compassion to be fundamental to your role?&lt;/p&gt;\n&lt;p&gt;Are you a Neonatal Nurse looking to develop in your career? Looking for a new career path in one of the most picturesque parts of the country? Then Morecambe Bay is just the place for you, offering the beautiful Lake District on your doorstep and within easy reaching distance of the City of Lancaster which offers excellent transport links to the main cities in the UK.&lt;/p&gt;\n&lt;p&gt;Our Trust is recruiting enthusiastic, highly motivated nurses and clinical support staff, to join our dynamic, dedicated, forward thinking professional team which serves a wide geographical area with rural and urban communities.&lt;/p&gt;\n&lt;p&gt;A rare opportunity has arisen in the Neonatal Service at Furness General Hospital and we are looking to recruit Band 6 Neonatal Nurses that have experience in the care of the preterm and sick infant and are qualified in specialty. The post will be primarily based at Furness General SCBU, however all posts are Cross Bay.&lt;/p&gt;\n&lt;p&gt;The Special Care Baby Unit is integrated into the brand new Maternity Unit, South Lakes Birth Centre. It is a Level 1 unit caring for babies born from 32 weeks gestation and has four special care cots plus a dedicated stabilisation facility for sick and preterm babies born at any gestation who are then transferred to a tertiary unit via a dedicated Network Neonatal Transport Team if required. There is also a two-bedded Transitional Care facility for those babies who do not require admission to the Special Care Baby Unit, however require additional support from the Neonatal Team, whilst preventing separation of the babies and their parents.&lt;/p&gt;\n&lt;p&gt;The Neonatal Unit at the Royal Lancaster Infirmary (RLI) is a level 2 unit, including 1 intensive care cot, 2 High Dependency cots and 7 Special Care cots.&lt;/p&gt;\n&lt;p&gt;You will be reliable, flexible, motivated, have excellent clinical skills, a commitment to on-going learning and development, a commitment to delivering high quality care, and be willing and open to embracing positive change and transformation in order to meet the demands of the community we serve.&lt;/p&gt;\n&lt;p&gt;Full and part time opportunities are available.&lt;/p&gt;\n&lt;p&gt;The Neonatal Team is supported by a dedicated Education Team and a comprehensive induction package is provided to all new staff. We are committed to supporting our employees with a variety of opportunities that allow you to develop personally and professionally, including the opportunity to rotate to other units. If you are looking for an opportunity to work with a team of professionals dedicated to placing the baby and family at the centre of everything we do, then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;University Hospitals of Morecambe Bay NHS Foundation Trust serves a population of 350,000 in an area covering 1,000 square miles in the North West of England. This includes Barrow-in-Furness, Kendal and the city of Lancaster, and a large rural area around the South Lakes and the Lune Valley.&lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period. This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Heather Wood-Matron for Children and Young People 07775560819&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Furness General Hospital, Barrow-in-Furness", "postalCode": "LA14 4LF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1364", "longitude": "-3.20788"}}, "title": "Clinical Leader - SCBU / Neonatal", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240677", "validThrough": "2020-11-08T23:59:59+0000"}