{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-27T10:15:56+0000", "description": "&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having a ‘Good’ rating overall, being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Mental Health Team in our latest CQC inspection, which found that: ‘Managers across Berkshire Healthcare promoted a positive culture that supported and valued staff, creating a sense of common purpose based on shared values.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, self-motivated and dynamic Pharmacist who wants to use their passion and competence in technology to make a difference to patient care. You will be part of our Electronic Prescribing and Medicines Administration (ePMA) project team supporting the roll out of ePMA across our Community Health Hospitals.&lt;/p&gt;\n&lt;p&gt;As an ePMA Project Pharmacist you will be involved in the configuration and strategic development of the system, ensuring maximum levels of safety and quality. You will report clinical risks and issues that could be generated by the transition from paper-based to electronic prescribing whilst working closely with the ePMA project implementation team. The post holder will also be involved in training and supporting pharmacy and clinical staff in using the system.&lt;/p&gt;\n&lt;p&gt;The successful candidate must be outgoing, enthusiastic and a quick learner who works well with others and has a keen interest and experience with working with IT systems and is adept at managing change in the NHS.&lt;/p&gt;\n&lt;p&gt;This is your chance to be at the forefront of digital innovation and through the implementation of ePMA have a direct positive impact on patients and the clinical teams using the system.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We would be delighted to welcome you to our friendly pharmacy was team, who will help you make your career reflect your ambitions. For further information, call either:&lt;br /&gt;Benny Tan, Lead Informatics Specialist Pharmacist on 07342 076 558 or email: benny.tan@berkshire.nhs.uk&lt;br /&gt;or&lt;br /&gt;Alastair Raynes, Pharmacy Operational Service Manager, on 07775 702 972 or email Alastair.raynes@berkshire.nhs.uk &lt;br /&gt;who’ll be delighted to answer any questions you may have.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to a car salary sacrifice scheme (available to all permanent staff over the age of 21), support with childcare and, as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt;NO AGENCIES TO CONTACT BERKSHIRE HEALTHCARE DIRECTLY PLEASE&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "ePMA Project Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243961", "validThrough": "2020-11-25T23:59:59+0000"}