{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Pro rata"}}, "datePosted": "2020-10-16T12:16:32+0100", "description": "&lt;p&gt;We are looking for an outstanding individual to join our current team of enthusiastic and forward thinking respiratory and acute physicians within the Medicine and Acute division at Wirral University Teaching Hospital.&lt;/p&gt;\n&lt;p&gt;Wirral University Teaching Hospitals serves a population of 400,000. It is one of the biggest and busiest acute NHS Trusts in the North West, employing more than 6,000 members of staff. It is located in the northwest, in close proximity to Liverpool and Chester.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work as part of a busy, dynamic chest team. The successful candidate would be encouraged to develop the effective links between respiratory medicine and acute medicine. The post will involve a commitment to respiratory inpatient care, sessions in acute medicine and respiratory outpatient care. Sessions will be provided for patient-related administration and supporting patient activities. Successful applicants will be encouraged to develop a sub-speciality interest that complements the existing team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;John Corless (Interim Associate Medical Director) john.corless@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arrowe Park Hospital, Upton, Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Consultant in Respiratory Medicine with specialist interest in acute", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230129", "validThrough": "2020-11-08T23:59:59+0000"}