{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36000", "minValue": "36000", "unitText": "YEAR", "value": "Up to £36,000 - depending on experience"}}, "datePosted": "2020-10-16T12:34:00+0100", "description": "&lt;p&gt;Beverley House is a 24-bedded rehabilitation hospital for women over the age of 18, situated in the heart of the community in Birmingham.&lt;/p&gt;\n&lt;p&gt;Patients admitted to Beverley House may be informal or detained under the Mental Health Act with a primary diagnosis of mental illness and personality disorder with complex needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen at Beverley House, for an enthusiatic individual to join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ideal candidate will have the following attributes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Clinical awareness to influence change and develop a vision.&lt;/p&gt;\n&lt;p&gt;The ability to develop a spirit of cooperation in working towards shared goals.&lt;/p&gt;\n&lt;p&gt;A willingness to encourage and promote innovation and imaginative problem solving.&lt;/p&gt;\n&lt;p&gt;The ability to proactively work toweards team decision making.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To be successful they will need to&lt;/p&gt;\n&lt;p&gt;Work alongside the ward manager to ensure compliance with audit requirements and lead implementation of recommendations.&lt;/p&gt;\n&lt;p&gt;Ensure compliance with legislative and professional standards.&lt;/p&gt;\n&lt;p&gt;Acts as clinical supervisor and ensures that all staff participate in clinical supervision.&lt;/p&gt;\n&lt;p&gt;Monitor, evaluate, and ensure effective use of resources within set budgets.&lt;/p&gt;\n&lt;p&gt;Operate effectively as a team member.&lt;/p&gt;\n&lt;p&gt;Promote effective decision making.&lt;/p&gt;\n&lt;p&gt;Act as mentor/preceptor and ensure the development of student nurses and other team members&lt;/p&gt;\n&lt;p&gt;Assess staff nurses within the competency development programme&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Key Competencies&lt;/p&gt;\n&lt;p&gt;Evaluate situations through information obtained from patients, their families and other relevant sources; and also the patients strengths, disabilities, risks and vulnerabilities.&lt;/p&gt;\n&lt;p&gt;Work closely with the service user to explore all of the above issues in such a way that they can increase understanding, insight and motivation and view self-management of risk as an essential part of the recovery process.&lt;/p&gt;\n&lt;p&gt;Work collaboratively with the service user to identify early signs of deterioration in mental state and behaviour; plus any potential triggers factors which may lead to risk behaviours recurring.&lt;/p&gt;\n&lt;p&gt;Supporting service users to develop skills to self-manage their medication through graduated self-medication programmes.&lt;/p&gt;\n&lt;p&gt;Support users to engage/re-engage with family and friends&lt;/p&gt;\n&lt;p&gt;Identifying service needs and using high level communication, negotiation and liaison with other stakeholders, including senior managers, commissioners, primary care, general adult, forensic and substance use services, prisons and probation services and other independent providers as appropriate to develop flexible, integrated and comprehensive services&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Skills&lt;/p&gt;\n&lt;p&gt;A relevant nursing qualification and registration&lt;/p&gt;\n&lt;p&gt;Excellent team working skills, a high level of self-motivation and a flexible approach - our units operate 24 hours 7 days a week, and our nursing staff work shift patterns including weekends, bank holidays and nights&lt;/p&gt;\n&lt;p&gt;A commitment to patient-centred care and to values-based and evidence-based practice&lt;/p&gt;\n&lt;p&gt;The drive to continually push your own personal learning and development&lt;/p&gt;\n&lt;p&gt;Be recovery focused.&lt;/p&gt;\n&lt;p&gt;Be conversant with CPA (Care Programme Approach).&lt;/p&gt;\n&lt;p&gt;Being able to effectively manage the ward resources of a shift/daily basis&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Benefits&lt;/p&gt;\n&lt;p&gt;Free meals&lt;/p&gt;\n&lt;p&gt;Free parking&lt;/p&gt;\n&lt;p&gt;Investment in CPD&lt;/p&gt;\n&lt;p&gt;Clinical supervision&lt;/p&gt;\n&lt;p&gt;Monthly staff appreciation days and much more.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BIRMINGHAM", "postalCode": "B17 8LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4753", "longitude": "-1.96082"}}, "title": "CHARGE NURSE - RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230217", "validThrough": "2020-11-27T23:59:59+0000"}