{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-21T08:15:53+0100", "description": "&lt;p&gt;Care Home Liaison (CHL) is a multidisciplinary team of nurses and occupational therapists. The team offers interventions, using a co-ordinated holistic approach that helps care staff develop strategies and build competence and confidence to support residents with mental health needs.&lt;/p&gt;\n&lt;p&gt;Each care home has a designated community mental health nurse / OT who works directly with the residents (as clinically appropriate). Referrals are made by our Older Adult CMHT.&lt;/p&gt;\n&lt;p&gt;The service is based at the Juniper Centre and operates: Monday to Friday from 9am to 5pm (Covering Birmingham and Solihull).&lt;/p&gt;\n&lt;p&gt;The aim of the service is to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Establish and foster improved working relationships with local partner organisations who have similar interests/functions in improving the quality of care homes (e.g. Birmingham City Council, CCG, BCHC).&lt;/li&gt;\n&lt;li&gt;Reduce the need for care homes to escalate care unnecessarily to A&amp;E, nursing home setting, acute inpatient facility or consider discharging clients prior to exhausting a coordinated strategy to stabilise and improve the case concerns for both clients and carers&lt;/li&gt;\n&lt;li&gt;Deliver well-being and recovery focussed interventions in the least restrictive care plan possible, in collaboration with the care home staff, clients families, Community Mental Health Teams and other contributors e.g. GP’s, district nurses, pharmacists&lt;/li&gt;\n&lt;li&gt;Support service users in their transition from home or other setting to a care home environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For Further information please contact: Charlotte Ward (Acting Team Manager - CERTs Community / Discharge &amp; CHL).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCharlotte WardJob titleActing Team Manager - CERTs Community / Discharge and CHL.Email addresscharlotte.ward10@nhs.netTelephone number0121 301 0955 / 07985882446.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CHL - Juniper Centre (Moseley Hall Hospital Site), Birmingham", "postalCode": "B13 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4459", "longitude": "-1.89289"}}, "title": "Band 6 CPN - Care Home Liaison - Juniper Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235525", "validThrough": "2020-11-15T23:59:59+0000"}