{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T11:46:56+0000", "description": "&lt;p&gt;Staff Nurse&lt;/p&gt;\n&lt;p&gt;Band 5&lt;/p&gt;\n&lt;p&gt;37.5 Hours per week&lt;/p&gt;\n&lt;p&gt;Permanent&lt;/p&gt;\n&lt;p&gt;Penn Hospital, Wolverhampton&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Black Country Healthcare NHS Foundation Trust provides specialist mental health, learning disability and community healthcare services for the population of the Black Country.&lt;/p&gt;\n&lt;p&gt;Across the whole of the region we provide:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Adult and older adult mental health services, including a male Psychiatric Intensive Care Unit.&lt;/li&gt;\n&lt;li&gt;Specialist learning disability services&lt;/li&gt;\n&lt;li&gt;CAMHS&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Black Country Healthcare NHS Foundation Trust was formed on 1 April 2020, after NHS England and NHS Improvement approved the merger of Black Country Partnership NHS Foundation Trust (covering Wolverhampton and Sandwell) and Dudley and Walsall Mental Health Partnership NHS Trust.&lt;/p&gt;\n&lt;p&gt;Combining resources, strategies and talented workforce enables us to deliver a wider variety of outstanding services that are based on best practice and are continually improving. We currently employ over 3,000 members of staff and just like the population we serve, we are made up of diverse cultures and backgrounds.&lt;/p&gt;\n&lt;p&gt;Whatever your background or education, working in a healthcare setting like ours is a demanding yet extremely rewarding experience. We offer exciting and rewarding career opportunities in a variety of fields, from nursing, psychiatry, counselling and pharmacy to admin and support roles such as IT, estates and facilities and human resources.&lt;/p&gt;\n&lt;p&gt;We take pride in supporting, developing and engaging with our workforce. Staff engagement, recognition and wellbeing are vital to the success of our organisation, and we strive to provide a setting in which our staff can showcase their skills, innovative solutions and dedication to healthcare. By becoming part of our growing organisation, we will invest in your career with a variety of professional training courses, development and progression opportunities to enable you to reach your potential. From apprenticeships and clinical placements to volunteering roles and agency work, there is something for everyone within our Trust, so take a look at our current vacancies and what we can offer you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to Covid-19 all interviews for the below will take place via Skype, Zoom or Jitsi. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for qualified Band 5 Registered &lt;strong&gt;Mental Health&lt;/strong&gt; or &lt;strong&gt;Learning Disability &lt;/strong&gt;Nurses to join us on our Inpatient Services Ward at Penn Hospital in Wolverhampton.&lt;/p&gt;\n&lt;p&gt;We can offer talented and caring individuals an opportunity to join us as these vacancies have arisen due to our nurses progressing to band 6 roles either within the Inpatient Service or Associated Services within our Trust, as staff development is a core value of ours. Therefore, this presents an exciting opportunity for either a newly qualified or experienced nurses to join us in an acute setting. You will be supported through our preceptorship if required, to nurture and support you in your development or the band 5 staff development programs; such as bite size teaching and we also encourage shadowing of other teams.&lt;/p&gt;\n&lt;p&gt;You will receive the following support:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Nominated preceptor and enrollment on our preceptorship study days for newly qualified staff.&lt;/li&gt;\n&lt;li&gt;Access preceptorship development program is open to all and includes networking, time to reflect, coaching, active learning through interactive presentations and project development.&lt;/li&gt;\n&lt;li&gt;Nurse development sessions which counts towards your revalidations, this program of diverse sessions are reviewed annually. At present it includes; weekly bitesize teaching covering topics such as record keeping, physical health, falls and medication. There are also roles for leads in areas such as infection prevention and control, physical health, safeguarding.&lt;/li&gt;\n&lt;li&gt;Training opportunities which ensure your core skills are maintained as well as bespoke learning opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;It’s a very exciting time for our Trust as we have joined partnership with our sister trust in order to become one. &lt;strong&gt;The Back Country Healthcare NHS foundation Trust&lt;/strong&gt; now covers the whole of the Black Country area enabling us to work in partnership to ensure the best possible services for those needing to access them.&lt;/p&gt;\n&lt;p&gt;There is a lot of investment in our growth as an organisation and part of this is ensuring we have one electronic system across all our services. The electronic package Rio is currently being built and over the coming months should be ready for the next phase of implementation into our services.&lt;/p&gt;\n&lt;p&gt;Currently we are assessed as “Good” by the Care Quality Commission this is an exciting time to join our dynamic and caring Trust as we progress. The Trust has also recently received sustained positive feedback from its staff in relation to its staff survey results. We value the importance of staff engagement in the development of our service.&lt;/p&gt;\n&lt;p&gt;The well-being of our staff is essential and we have a number of staff well-being initiatives that run within our trust and are reviewed and monitored by the trusts well-being lead.&lt;/p&gt;\n&lt;p&gt;There are currently vacancies on Brook (male) and Dale (female) Wards. Our aim is to promote recovery and ensure our service users are successfully discharged from hospital with appropriate support to prevent relapse or readmission to hospital. We provide a safe inpatient environment and work in partnership with our service users and various other agencies to help support them through their recovery journey eg housing, welfare rights, education and employment.&lt;/p&gt;\n&lt;p&gt;Also based at Penn Hospital, in addition to the inpatient services, are the Crisis/Home Treatment Team, the South Complex Care team, Occupational Therapists, Psychology, Pjhysiotherapy and Social Services. Together we work together in partnership as a multidisciplinary team to improve the care service users receive. All our acute inpati&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Penn Hospital, Wolverhampton", "postalCode": "WV4 5HN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5586", "longitude": "-2.15917"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242285", "validThrough": "2020-11-08T23:59:59+0000"}