{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42969", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £42,969 pa"}}, "datePosted": "2020-11-05T17:16:18+0000", "description": "&lt;p&gt;CLINICAL FELLOWS (JUNIOR GRADE) Tier 1 in Neonatal Medicine&lt;/p&gt;\n&lt;p&gt;Hours: 40 hours per week&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Neonatal Doctor to join our dynamic team at the Royal Bolton Hospital to help further develop our Neonatal services.&lt;/p&gt;\n&lt;p&gt;This post is available from September 2020 and is for a review at six months&lt;/p&gt;\n&lt;p&gt;The successful applicant would work at Junior Grade (Tier 1) level including contributing to the Junior Grade out-of-hours rota. This rota is currently a full-shift 10-person rota and banded at 1A.&lt;/p&gt;\n&lt;p&gt;There is excellent scope to develop and consolidate neonatal skills.&lt;/p&gt;\n&lt;p&gt;The Royal Bolton Hospital is a busy acute hospital with an excellent reputation for teaching and senior support. We have a new purpose-built Neonatal intensive Care Unit which provides a total of 38 cots, 9 of which are Intensive Care. A full range of intensive care services are offered including therapeutic hypothermia and inhaled Nitric Oxide therapy.&lt;/p&gt;\n&lt;p&gt;Bolton NHS Foundation Trust provide services across the north west side of the Greater Manchester area ranging from hospital services in Bolton to community services across Bolton and Salford. We are a progressive, expanding organisation with great ambition around improving quality, integrating pathways and delivering high levels of productivity. We have recently been given a CQC rating of Good. Over 5,700 people work for the Trust and many of them have been here a long time. People find they don’t need to go elsewhere to find a fulfilling career in healthcare.&lt;/p&gt;\n&lt;p&gt;The Family Division aims to deliver the highest standards of care for maternity, sexual health, gynaecology and a range of acute and community children’s services. The Division is a Centre of Excellence for Women’s and Children’s services and has a credible and enviable reputation. We deliver over 6,000 babies and carry around 1500 gynaecological procedures each year, making us a specialist provider of health services for women, babies and their families in the North West Sector of Manchester and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&#39;This role may be suitable for non-UK or non-EEA job applicants wishing to apply for Home Office Tier 2 sponsorship&#39;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that, from the 1st July 2009 the Trust will become a smoke free site, and therefore smoking will not be permitted anywhere within the grounds of the Trust.&lt;/p&gt;\n&lt;p&gt;This Trust is committed to safeguarding children, young people and vulnerable adults and requires all staff and volunteers to share this commitment.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be subject to appropriate disclosure by the Criminal Records Bureau.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Archana Mishra, Clinical Lead Neonatology. 01204 390199&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121713.png", "name": "Bolton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121713"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bolton NHS Foundation Trust, Bolton", "postalCode": "BL4 0JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.554", "longitude": "-2.42989"}}, "title": "Clinical Fellow (Junior Grade) Tier 1 in Neonatal Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258698", "validThrough": "2020-11-19T23:59:59+0000"}