{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T10:16:13+0000", "description": "&lt;p&gt;Ward 78 is a 32 bedded ward, specialising in Neurosurgery, Neurology, Trauma and Orthopedics, Complex Spines and Ear Nose and Throat. We offer acute and long term care for patients. We are one of four centers that offers Epilepsy Surgery (NORCESS) and work closely with Alder Hey to offer this complex surgery.&lt;/p&gt;\n&lt;p&gt;The successful candidate will support a team of registered and non-registered nurses and will work alongside the Ward Manager and Practice Educator with a particular focus on:&lt;/p&gt;\n&lt;p&gt;- Leadership and professional role modelling through complex communication, challenging practice as required and celebrating achievement as is it occurs.&lt;/p&gt;\n&lt;p&gt;- Supporting the Ward Manager to ensure quality, safety and patient experience.&lt;/p&gt;\n&lt;p&gt;You should be an experienced paediatric nurse with a minimum of three years experience at Band 5 or above, be a qualified mentor and be competent in the administration of IV medications. The role requires the successful candidate to demonstrate good leadership, organisational and problem solving skills. You will be committed to improving quality of care and the patient experience.&lt;/p&gt;\n&lt;p&gt;You’ll act as mentor to students and a preceptor to new staff. Playing an active role in continuous development in nursing practice and maintaining effective communication with the ward staff, the Ward Manager and throughout the Trust will be important too. You&#39;ll provide visible clinical leadership and professionalism as you help the Ward Manager to ensure the core values and beliefs of the ward, the directorate, the division and the Trust are delivered at all times.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be supported in the role by the Ward Manager and Matron. We will provide a comprehensive induction programme and you will be appraised annually with a view to developing knowledge and skills.&lt;/p&gt;\n&lt;p&gt;The role will allow you to develop varied clinical and interpersonal skills. We also offer extensive personal development opportunities through Corporate Organisational Training and Development and access to a band 6 Development Programme.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa StephensJob titleWard ManagerEmail addresslisa.stephens@mft.nhs.ukTelephone number016707811Additional contact information&lt;/p&gt;\n&lt;p&gt;Lisa Stephens, Ward Manager 0161 701 7811&lt;/p&gt;\n&lt;p&gt;Katie McCall, Modern Matron 0161 701 7488&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RMCH, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Band 6 Junior Sister - Paediatrics (Ward 78)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255338", "validThrough": "2020-11-10T23:59:59+0000"}