{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £44,503 £38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T15:31:30+0000", "description": "&lt;p&gt;We are looking to appoint a highly motivated, innovative and enthusiastic clinical pharmacist to join the St Helens &amp; Knowsley pharmacy team.&lt;/p&gt;\n&lt;p&gt;We can offer:&lt;br /&gt;&lt;br /&gt;A structured rotation through patient services in both medical and surgical directorates, medicines information and clinical specialist shadowing through specialists such as critical care and paediatrics:&lt;br /&gt;&lt;br /&gt;Comprehensive clinical pharmacy experience in a variety of specialities involving ward rotations&lt;br /&gt;&lt;br /&gt;Opportunity to undertake a none medical prescribing course &lt;br /&gt;&lt;br /&gt;Participation in consultant wards rounds&lt;br /&gt;&lt;br /&gt;Involvement in teaching undergraduates and other members of the multidisciplinary team&lt;br /&gt;&lt;br /&gt;Established peer support and team working&lt;br /&gt;&lt;br /&gt;The department operates a 7 day service to the medical care group and as part of this role you will be expected to participate in the rostered shift system which is currently 1 in 5. Participation in the late night working and pharmacy on call will also be required&lt;/p&gt;\n&lt;p&gt;Previous experience of working within Hospital setting is essential and you will either hold a clinical diploma qualification or be near completion of the course. You will be expected to be a team player with significant clinical experience, excellent interpersonal skills and attention to detail. You will be encouraged to develop and implement your own ideas within the role and help drive the pharmacy service forward under the guidance of the clinical service manager and principal clinical pharmacists.&lt;/p&gt;\n&lt;p&gt;The Trust occupies two new state-of-the-art PFI hospitals, with the new Whiston Hospital having opened in April 2010, as well as Newton Hospital which has recently been integrated into the Trust’s service.&lt;/p&gt;\n&lt;p&gt;Whiston Hospital is the main site within this large, high-performing acute Trust covering a large suburban area between Liverpool and Warrington, including St Helens, Prescot and Huyton. St. Helens hospital provides diagnostic and clinic based services along with rehabilitation services with Newton providing a rehabilitation service. We manage in the region of 850 beds across all sites, have accredited teaching hospital status, and provide for most major specialties.&lt;/p&gt;\n&lt;p&gt;The Pharmacy Department has over 100 staff operating across Whiston and St Helens Hospitals. We have established automated dispensing systems within the dispensaries at both sites. Both the Department and the Trust have a long-standing reputation for being a friendly and rewarding place to work. Our last Investors in People assessment recognised our Pharmacy as an outstandingly good department for staff support and development. A new e-prescribing facility has recently been launched.&lt;/p&gt;\n&lt;p&gt;St Helens &amp; Knowsley Teaching Hospitals NHS Trust is the BEST acute Trusts in England for the THIRD year running!&lt;/p&gt;\n&lt;p&gt;The Trust is currently the only acute Trust in Cheshire and Merseyside, and is one of few in the entire country, to achieve the title of OUTSTANDING, rated by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;We provide a full range of acute adult services to our local population of circa 350,000 and provide tertiary services across a much wider area in the North West, North Wales and Isle of Man. We are also a Major Trauma Unit and the Mersey Regional Burns Unit.&lt;/p&gt;\n&lt;p&gt;Our &#39;5 Star Patient Care&#39; strategy is at the heart of all that we do; supporting our vision to provide world class services for all our patients by getting it right for every patient, every time.&lt;/p&gt;\n&lt;p&gt;Our latest achievements include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute Trust of the Year – HSJ Awards November 2019&lt;/li&gt;\n&lt;li&gt;Trust rates Outstanding by the CQC – March 2019&lt;/li&gt;\n&lt;li&gt;Best in the NHS, Patient Led Assessment of the Care Environment 2017 and 2018&lt;/li&gt;\n&lt;li&gt;The Trust achieved top marks in the country for areas including; cleanliness, food, privacy and dignity, facilities for patients living with dementia and disabilities, conditions, appearance and maintenance of the hospital buildings.&lt;/li&gt;\n&lt;li&gt;Top 100 places to work in the NHS (NHS Employers and Health Service Journal)&lt;/li&gt;\n&lt;li&gt;Best acute Trust in England (NHS Staff Survey 2017,2018 and 2019)&lt;/li&gt;\n&lt;li&gt;Best Patient Experience in the NHS (CHKS Top Hospitals Awards 2015)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In the NHS Staff Survey 2019 the Trust scored the highest marks in the following areas;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Best place to receive treatment in the NHS (for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Top Acute Trust for treating its staff fairly with regards to career progression (for 3rd year running)&lt;/li&gt;\n&lt;li&gt;Quality of care (best score for 5th year running)&lt;/li&gt;\n&lt;li&gt;Staff engagement (best score for 4th year running)&lt;/li&gt;\n&lt;li&gt;Staff morale (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Bullying and harassment (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Safety culture (best score for 2nd year running)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our staff rated our Trust as the best place to work and receive treatment. The Trust has also been recognised, for the third year running, as being the top acute Trust in the entire country for staff engagement, staff motivation, and pride in the quality of care we provide to patients.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Andrew Lewis Principle Clinical Phramcist - Antimicrobials &lt;/p&gt;\n&lt;p&gt;Email address Andrew.Lewis@sthk.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 07766780204&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121089.jpg", "name": "St Helens and Knowsley Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121089"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whiston, Prescot", "postalCode": "L35 5DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4201", "longitude": "-2.78641"}}, "title": "Senior Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247193", "validThrough": "2020-11-13T23:59:59+0000"}