{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-29T15:00:40+0000", "description": "&lt;p&gt;This is an exciting opportunity to work within a &lt;strong&gt;Finance Business Partnering team&lt;/strong&gt;, which supports health care services provided by the &lt;strong&gt;Children and Women Clinical Board and the Specialist Services Clinical Board&lt;/strong&gt;. The successful candidate will help support services in a wide range of areas, such as, the Noah’s Ark Children’s Hospital for Wales, Women’s Services (including Maternity) and Children’s Community Services as well as offering the chance to be involved in a number of Specialist Tertiary Services including Cardiothoracics, Neurosciences, Nephrology and Transplant, Critical Care, Haematology, Immunology and Artificial Limb and Appliance Services.&lt;/p&gt;\n&lt;p&gt;Cardiff and Vale University Health Board has well established Finance Business Partnering teams, each led by an Assistant Director of Finance. This post offers a career development opportunity fulfilling a key role in contributing to this agenda, providing financial and business advice, whilst working with passionate and committed people. The Assistant Directorate Accountant (Training Post) will assist a team of 11 Accountants supporting Directorates and working with managers and clinicians to influence and develop integrated service, workforce and financial plans.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a training contract which offers “on the job” training plus substantial study support towards a CCAB qualification and offers automatic progression within the Finance department, in line with exam success and the completion of work based objectives.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Candidates considered for assessment centre will have work experience within a financial or administrative role, will have a degree or AAT qualification and will be eager to work towards becoming a CCAB qualified accountant. Candidates must possess excellent communication, organisational and IT skills and be committed to working flexibly in a team which delivers an excellent service to its stakeholders.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 15/11/2020&lt;/p&gt;\n&lt;p&gt;Estimated Assessment Centre/Interview date: Fri 27/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Craig Coggins&lt;/p&gt;\n&lt;p&gt;Tel: (029) 2183 6425&lt;/p&gt;\n&lt;p&gt;craig.coggins@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woodland House, Cardiff", "postalCode": "CF14 4HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5198", "longitude": "-3.19386"}}, "title": "Assistant Directorate Accountant (Training Contract)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248782", "validThrough": "2020-11-15T23:59:59+0000"}