{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-09T10:43:16+0100", "description": "&lt;p&gt;&lt;strong&gt;The Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Breast Imaging Department at North Cumbria Integrated Care NHS Foundation Trust is based across two sites at the Cumberland Infirmary Carlisle and West Cumberland Hospital at Whitehaven. It provides both breast screening and symptomatic imaging facilities, with a new dedicated breast unit relocated within the existing premises at West Cumberland Hospital in 2019.&lt;/p&gt;\n&lt;p&gt;Both breast imaging units are equipped with Hologic Mammography machines with tomosynthesis capability in addition to vacuum assisted biopsy systems. 3 Ultrasound machines are currently in place across both sites.&lt;/p&gt;\n&lt;p&gt;The unit has recently adopted the use of Radio Frequency Tag insertion by both ultrasound and x-ray guidance prior to surgery offering a more flexible service.&lt;/p&gt;\n&lt;p&gt;The breast unit is supported by a Consultant Breast Radiologist, Specialist Doctor and Consultant Radiographer in addition to Advanced Practitioners supporting the Radiology team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties of the post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will work together with the existing breast radiology team to develop and provide imaging services and support the increasing workload.&lt;/p&gt;\n&lt;p&gt;The post holder will contribute to the overall running of the breast department liaising closely with the radiology team and the breast Surgical team.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to work across both sites covering all aspects of breast imaging including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provision of radiology cover for the symptomatic One-stop clinics&lt;/li&gt;\n&lt;li&gt;Annual/ Family History image reporting&lt;/li&gt;\n&lt;li&gt;MRI reporting&lt;/li&gt;\n&lt;li&gt;RF tag insertions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If the post holder has experience of NHSBSP screening they would be encouraged to participate in the provision of this service including assessment and film reading.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to attend and present radiology opinion at the weekly symptomatic breast MDT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Breast Screening Activity &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Breast screening service is managed by The Newcastle upon Tyne Hospitals NHS Foundation Trust with an eligible population of 50,000 and 139 cancers diagnosed in 2018/19&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Breast Symptomatic Activity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The breast unit provides imaging support to One Stop Clinics with 2819 referrals across both sites in 2019/20&lt;/p&gt;\n&lt;p&gt;Closing date: 23rd November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cumberland Infirmary or West Cumberland Hospital", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Consultant Breast Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219789", "validThrough": "2020-11-23T23:59:59+0000"}