{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa based on full time hours"}}, "datePosted": "2020-11-03T10:45:19+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Hours- 30 per week&lt;/strong&gt;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Southern Health’s Child and Adolescent Mental Health Occupational Therapy Service is seeking a resilient, enthusiastic and compassionate practitioner to join its service at Austen House.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate must have excellent engagement and communication skills, a sense of fun and the ability to laugh at oneself, and a professional, organised and innovative approach to practice. The post holder must have initiative and be able to work proactively and autonomously, as well as under the direction of Occupational Therapy Practitioners.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Austen House is a low secure adolescent forensic service, providing residential care for up to 14 young people aged between 12 and 18. Set within Tatchbury Mount, Austen House is a purpose built hospital which provides a comprehensive assessment and treatment programme for young people experiencing severe mental health and/or emotional difficulties, who additionally pose a sustained risk of harm to themselves.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Alongside the Education team, and Psychological Therapists, the Occupational Therapy team has shared access to excellent facilities within a Learning and Therapy Suite. Facilities include a rehabilitation kitchen, in-house shop, fitness suite, music room, sensory room, and creative arts rooms as well as additional group rooms and outdoor spaces. Occupational Therapy provides a service between the hours of 8am and 8pm, Monday to Saturday, and therefore the successful candidate must be prepared to work some weekday evenings and weekends.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As the Vocational Lead within the Occupational Therapy team, you will work as a valued member of the multi-disciplinary team contributing to the assessment, rehabilitation and discharge preparation of young people, practicing within the Occupational Therapy (VdT) Model of Creative Ability.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Previous experience of vocational rehabilitation and/or careers advice and management is essential as you will develop and facilitate a flexible, person centred vocational programme within the hospital and in the community, enabling young people to engage in both paid and voluntary vocational opportunities, as well as pre-vocational skills sessions. An understanding of budgets and managing finances is desirable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will provide supervision and appraisal to young people in any vocational roles, support the development of Occupational Therapy Assistants (Band 3) and students in relation to vocation through training and informal supervision structures, support service-user involvement in the hospital, and contribute to the development of the Occupational Therapy service through a process of evaluation and review.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Regardless of your level of experience, you will have the opportunity to contribute to various local and Trust quality improvement projects, as well as to engage in the development of the Trust-wide Occupational Therapy service. There are also excellent opportunities for continuous professional development, research and marketing, specifically promoting the vocation project across CAMHS, and in external settings such as workplaces and conferences.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will receive a comprehensive induction and ongoing support/supervision from the Occupational Therapy Practitioners, as well as peer support and collaborative working with the Vocational Lead within Adult Forensic Services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Happy to Talk Flexible Working - all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Follow us on Facebook and on Twitter:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;@Southern_NHSFT&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO40 2TA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9316", "longitude": "-1.52542"}}, "title": "Occupational Therapist Vocational lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253511", "validThrough": "2020-11-17T23:59:59+0000"}