{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per annum"}}, "datePosted": "2020-11-03T14:01:34+0000", "description": "&lt;p&gt;Do you have a passion for TB nursing and the skills required to lead a growing and dynamic TB Nursing Team? If so this could be your opportunity to join and lead the TB Nursing Team at the Royal Wolverhampton NHS Trust.&lt;/p&gt;\n&lt;p&gt;You will join an existing team of TB Nurses, outreach worker and administrative staff to provide the TB Nursing service to the City of Wolverhampton, into South Staffordshire and Cannock, including the prison population within these areas (HMP Brinsford, Featherstone and Oakwood).&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate a sound knowledge base and possess the experience and skills required to manage a team and TB caseloads. The successful candidate will ideally be educated to degree level or equivalent. Proven management and leadership skills are essential. You will be the clinical expert and have the ability to support the Infection Prevention Nurse Manager in guiding strategy and effecting changes in nursing practice. It is essential that you have the ability to work collaboratively at all levels and across disciplines and agencies.&lt;/p&gt;\n&lt;p&gt;You will be highly motivated, conscientious and an organised nurse with the ability to be efficient in a busy clinical environment. You will need to have excellent communication skills and the ability to work well with colleagues, patients, children and young people, and those from diverse ethnic and cultural backgrounds. You must be able to work autonomously with minimum medical supervision ensuring the complex physical, psychological and social needs of individuals being investigated or treated for tuberculosis are met.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Informal enquiries and visits are welcomed and can be arranged by contacting Kim Corbett, Infection Prevention Nurse Manager (Ext 8755) or Neil Jarvis (Ext 5940/5692), New Cross Hospital, Wolverhampton.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNeil JarvisJob titleTB Lead NurseEmail addressneiljarvis@nhs.netTelephone number01902 695940Additional contact information&lt;/p&gt;\n&lt;p&gt;Kim Corbett&lt;/p&gt;\n&lt;p&gt;Infection prevention&lt;/p&gt;\n&lt;p&gt;01902 698755&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Wolverhampton Trust, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "TB Lead Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254248", "validThrough": "2020-11-17T23:59:59+0000"}