{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 (pro rata) pa inc. HCAS"}}, "datePosted": "2020-11-05T10:45:55+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a role as a Highly Specialist Physiotherapist working in respiratory medicine at Northwick Park Hospital. This is a fixed term contract for 12 months to cover maternity leave.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Northwick Park Hospital is a major acute general hospital. The Medical Band 7s manage medical HDU (including NIV), the medical wards, an Acute Assessment Unit, and A&amp;E. They also promote early supported discharge in all clinical areas.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Senior respiratory physiotherapists at the Trust are developed to gain extended scope skills of arterial blood gas sampling, chest x-ray requesting and tracheostomy changing and decannulation. There will also be opportunities for on-going clinical and managerial development with senior teaching and support for CPD and internal/external courses.&lt;/p&gt;\n&lt;p&gt;Summary of the role:&lt;/p&gt;\n&lt;p&gt;1. To work jointly with another Band 7 as the clinical lead for the respiratory physiotherapy service for the acute medicine and medical HDU at Northwick Park Hospital.&lt;/p&gt;\n&lt;p&gt;2. Be autonomously responsible for assessing and treating own clinical caseload and defining and implementing individualised programmes of care.&lt;/p&gt;\n&lt;p&gt;3. To work as a member of the multidisciplinary team (MDT), assessing and treating patients with respiratory problems and/or requiring physical rehabilitation, including complex cases, and maintain accurate and comprehensive patient records.&lt;/p&gt;\n&lt;p&gt;4. To work closely with the cross-site Clinical Specialists in leading the development of the Respiratory Physiotherapy Service at Northwick Park Hospital.&lt;/p&gt;\n&lt;p&gt;5. To be responsible for the development and appraisal of team members, including Band 5 &amp; 6s, non-qualified staff and Students, to ensure best practice and patient care. This will also include ensuring competency of staff to work on the on-call rota.&lt;/p&gt;\n&lt;p&gt;6. To regularly provide formal and informal, on-going training and education to physiotherapy staff, medics, other healthcare professions and students.&lt;/p&gt;\n&lt;p&gt;7. To engage in own continued professional development (CPD) and service development, in conjunction with the Clinical Specialist/Consultant as appropriate.&lt;/p&gt;\n&lt;p&gt;8. Lead on clinical audit and research within the Respiratory Physiotherapy Service...&lt;/p&gt;\n&lt;p&gt;9. .To participate in the weekend working rota (1 in 5 weekends), with time taken back in the following week.&lt;/p&gt;\n&lt;p&gt;10. To be the sole physiotherapist on duty in the emergency overnight on-call service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGemma KorffJob titlePrincipal Respiratory PhysiotherapistEmail addressgemma.korff@nhs.netTelephone number0208 8692231Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information or an informal visit please contact Gemma Korff, Principal Respiratory Physiotherapist, on 020 88692231 or gemma.korff@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NPH mainly, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Highly Specialist Respiratory Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257297", "validThrough": "2020-11-19T23:59:59+0000"}