{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-13T12:48:02+0100", "description": "&lt;p&gt;An experienced anaesthetics and recovery practitioner required.&lt;br /&gt;&lt;br /&gt;We value expertise at Nuffield Health. It’s our combination of expert knowledge, innovative thinking and passion for care that has enabled us to become Britain’s largest not for profit healthcare provider. It has also helped us to build a unique network delivering connected healthcare - from hospitals, to Fitness and Wellbeing Clubs, to specialist services including physiotherapy. Across our network, brilliant people benefit from our commitment to invest every penny in our services and people.&lt;br /&gt;&lt;br /&gt;We’re looking for an exceptional Theatre Nurse or Practitioner with drive, passion and high standards. You might join us from the NHS or a private setting. Either way, you’ll discover unrivalled scope to work autonomously, make full use of your skills and knowledge and add value. So you’ll work closely with leading consultants and other like-minded professionals, who will respect and value what you bring to the close-knit multidisciplinary team. You’ll enjoy opportunities to work on a varied caseload and deliver high quality care and experiences for patients, which is always clinically effective, evidence based and appropriate.&lt;br /&gt;&lt;br /&gt;As a registered Theatre Nurse or Operating Department Practitioner, you’ll have the qualifications and experience relevant to your registration, including NMC or HCPC. You’ll have post-registration experience, be an excellent communicator and team worker – flexible and motivated.&lt;/p&gt;\n&lt;p&gt;Ready to bring out the specialist in you?&lt;/p&gt;\n&lt;p&gt;Nuffield Health is all about people. As a not for profit organisation, everything we do is about looking after the individual. To support and encourage them to be as healthy as they can be. With a holistic approach to health and wellbeing we connect diagnosis and treatment, prevention and fitness across one, nationwide network. And to provide that groundbreaking service we bring together the most talented and dedicated professionals in one, valued community.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nuffield Health Cambridge Hospital, 4 Trumpington Road, Cambridge", "postalCode": "CB2 8AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1903", "longitude": ".124295"}}, "title": "Theatre Practitioner - Anaesthetics and Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224362", "validThrough": "2020-11-10T23:59:59+0000"}