{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001"}}, "datePosted": "2020-11-02T14:35:43+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Brighton &amp; Hove CCG is seeking an Assistant Head of Planned Care &amp; Cancer to work within the Brighton &amp; Hove and East Sussex team, part of the Operations Directorate within Sussex NHS Commissioners. While the role is based in the CCG offices in Hove, the team is working from home at present and this is expected to continue for the time being.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Planned Care &amp; Cancer team undertakes the whole of the commissioning cycle for elective care, working on a range of programmes aimed at transforming planned care and cancer services. We work in close collaboration with system partners as part of the Sussex Health and Care Partnership. While the role is principally focussed on the Brighton &amp; Hove and East Sussex programme of work, the team operates as part of a sussex-wide planned care matrix and the post-holder can expect significant involvement in the wider, pan-sussex programme. Planned Care &amp; Cancer is central to the recovery and restoration of services in the context of COVID-19 and you will be working in a fast-paced, demanding, challenging and exciting environment with excellent opportunities to further develop your skills and knowledge.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Assistant Head of Planned Care &amp; Cancer plays a key role within the team, supporting the Head in managing both the team and programme of work, including deputising for the Head and representing the CCG in system and regional fora. The role requires the successful applicant to demonstrate that they have the experience, aptitude and attitude to play a leadership role within the team, while also managing a busy, diverse portfolio of their own. You will need strong project and programme management skills backed up by effective interpersonal skills, be able to work well with clinical and managerial leads, patients and service users and be capable of leading the development and implementation of innovative planned care and cancer strategies. Equally, you will need to be fully conversant with national operational standards for planned and cancer care and have a good grasp of current national elective care policy, especially in relation to the COVID-19 related recovery and restoration agenda.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like an informal conversation about the role, please get in touch with Nikki Brooker by emailing &lt;/span&gt;&lt;span&gt;n.brooker@nhs.net&lt;/span&gt;&lt;span&gt; who will arrange for an informal chat via telephone with Kevin Wilcox, Head of Planned Care &amp; Cancer.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews are expected to take place during the week commencing 23rd November.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex NHS Commissioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hove", "postalCode": "BN12 6BT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8175", "longitude": "-.411487"}}, "title": "Assistant Head of Planned Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252462", "validThrough": "2020-11-15T23:59:59+0000"}