{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36500", "minValue": "34500", "unitText": "YEAR", "value": "£34,500 - £36,500"}}, "datePosted": "2020-10-27T11:44:27+0000", "description": "&lt;p&gt;&lt;strong&gt;About Research &amp; Innovation at St Andrew’s&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting time in the Research &amp; Innovation Centre at St Andrew’s. We have recently agreed to focus on five research strands, supported by ring-fenced clinical input – an amazing opportunity, not often possible on this scale within the independent healthcare sector.&lt;/p&gt;\n&lt;p&gt;We are looking for a researcher to join the team, who, in addition to having proven research independence, is passionate about delivering innovative and translational projects that are going to make a difference directly to our patients in secure care. Experience of working directly with clinicians and patients is desirable, and enthusiasm for improving care and treatments in a mental health setting is essential. If this sounds like you, please read on. (A job description is available upon request.)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder, who musthave a PhD,is required to engage independently with internal and external collaborators (clinical and academic) to develop cutting-edge research ideas and ensure the delivery of agreed outputs. This will include the translation of research findings into innovative clinical practices in addition to the publication of the findings in peer-reviewed journals.&lt;/p&gt;\n&lt;p&gt;The candidate will also have a key role in the development and supervision of PhD programmes, delivery of teaching to clinical students (research methods) and co-supervision of students to ensure that research activities are conducted at the highest standard and according to the principles of good clinical practice which will impact of the quality of care provided for our patients.&lt;/p&gt;\n&lt;p&gt;Our patients and your colleagues will expect you to live the St Andrew’s CARE values of Compassion, Accountability, Respect and Excellence every single day.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rewards&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer an excellent benefits package including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Pension&lt;/li&gt;\n&lt;li&gt;Sickness policy on par with the NHS&lt;/li&gt;\n&lt;li&gt;35 days annual leave, increasing to 41 after 10 years&#39; service&lt;/li&gt;\n&lt;li&gt;Life cover&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Healthcare cash plan&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;Paid DBS application&lt;/li&gt;\n&lt;li&gt;Access to free vocational qualifications&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 29 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Early application is strongly advised&lt;/strong&gt; as we are looking to recruit as soon as possible. Suitable applicants may be interviewed and an appointment made prior to the closing date.&lt;/p&gt;\n&lt;p&gt;A job description is available upon request – please email: research@standrew.co.uk. To find out more about this role, please contact Dr Kieran Breen (kbreen@standrew.co.uk)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton", "postalCode": "NN1 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2382", "longitude": "-.873687"}}, "title": "Research Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244269", "validThrough": "2020-11-29T23:59:59+0000"}