{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907-£30,615"}}, "datePosted": "2020-11-05T09:01:05+0000", "description": "&lt;p&gt;We currently have a vacancy for an outpatient urology nurse. We are looking for an individual who is enthusiastic and highly motivated to work within the Urology service. You will work within the outpatient team of nurses, supporting the nurse-led diagnostic interventions and treatments including flexible cystoscopies, prostate biopsies, fiducial marker insertion and investigations and specialist and general clinics.&lt;/p&gt;\n&lt;p&gt;You will be an integral part of our team. The main focus of the role will require you to work closely with the urology specialist nurses, uro-oncology nurses and urology doctors for both the cancer and benign pathways. You will be required to prepare patients for procedures, participate in assisting the clinicians undertaking the procedures and support in the everyday running of the outpatient environment.&lt;/p&gt;\n&lt;p&gt;You will be supported within your role but also expected to support the unqualified nursing staff to inspire the team within their own clinical roles and individual development. Training will be given to the successful candidate and there will be an opportunity to study a Postgraduate Certificate (PGCert) in Urology.&lt;/p&gt;\n&lt;p&gt;The urological service is an expanding and complex service, making this an exciting time to work within the outpatient environment. If you are keen to provide excellent patient centred and informed care and want to be involved in taking practice forward, we would love you to join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date-19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJan HarrisJob titleOutpatient ManagerEmail addressJan.Harris@ouh.nhs.ukTelephone number01865235691&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Urology Outpatients- Churchill Hospital, Oxford", "postalCode": "OX3 7LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256978", "validThrough": "2020-11-19T23:59:59+0000"}