{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-19T15:00:32+0100", "description": "&lt;p&gt;University Hospitals Birmingham NHS Foundation Trust aims to be at the leading edge of technology and digital adoption in the NHS, bringing novel care pathways and innovations to improve patient care and access.&lt;/p&gt;\n&lt;p&gt;The Digital Transformation team manages this ambitious programme of work, adopting the latest cutting edge technology and deployment of artificial intelligence into clinical practice to the programme introduction. The post-holder will play a pivotal role in supporting this agenda.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for a dynamic individual who will support the development of transformational projects across a number of services, with the aim that we will transform healthcare through the use of digital technology. We believe that it is the people who make the difference, therefore we are also looking for an individual who wishes to enhance and develop their skills with an ambition to progress within the team. &lt;br /&gt;The Transformation Support Officer will play a key role in interfacing with clinical teams and corporate functions to ensure projects are delivered and benefits are realised.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have strong communication, planning, reporting and overall administration skills. A drive to improve patient care is essential. This is a fast-paced environment where you will be immersed in diverse challenges that will stretch your skills and offer development to achieve your personal and professional goals in a supportive team environment. A collaborative style, a good sense of humour and a desire to build successful relationships is essential.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you have the relevant experience, are looking for a new challenge and are committed to improving patient care, please contact us for further details.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Farina Chaudhri, Programme Manager – 07880-021577&lt;br /&gt;Theresa Price, Implementation Lead – 07921-481619&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Transformation Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232796", "validThrough": "2020-11-08T23:59:59+0000"}