{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-21T14:37:58+0100", "description": "&lt;p&gt;Are you flexible, enthusiastic and committed to providing excellent patient care? If so we have an exciting opportunity for you! Due to additional funding we are looking for Band 6 Physiotherapists to join the Community Integrated Neurology and Stroke Service (CINSS).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;CINSS was established in 2016 as part of the Better Care Together Initiative and strives to provide specialist integrated care to patients in Leicester, Leicestershire and Rutland. The team continues to rapidly evolve and provides varied exciting opportunities to develop the service further, both clinically and organisationally.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a specialist multi-disciplinary team comprising of Physiotherapists, Occupational Therapists, Dieticians, a Neuropsychologist, a Rehabilitation Consultant and Generic Rehabilitation Technical Instructors.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post requires a dedicated autonomous Physiotherapist with sound clinical experience in Neurology and Stroke rehabilitation. Previous Community experience would also be advantageous. The successful candidate will be required to manage a complex caseload in a busy, developing environment. Excellent organisational, communication and team working skills are required for this position, along with the ability to support and train other members of the CINSS team.&lt;/p&gt;\n&lt;p&gt;If you are enthusiastic and self-motivated we look forward to hearing from you. This is a great opportunity to join a dynamic team and participate in the development and delivery of a new healthcare provision across Leicester, Leicestershire and Rutland.&lt;/p&gt;\n&lt;p&gt;The CINSS team hub is at Braunstone Health and Social Care Centre, with regional bases in Loughborough Hospital; Hinckley and Bosworth Community Hospital; St Lukes Hospital; and Melton Hospital.&lt;/p&gt;\n&lt;p&gt;You will work 37.5hrs per week (the service will also consider applications for part-time working hours). If you are shortlisted you will be invited to undertake an assessment/ interview on 18th November 2020.&lt;/p&gt;\n&lt;p&gt;For more information please contact Emma Fisher (Operational Lead) 07464532717 emma.fisher@leicspart.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicestershire - East", "postalCode": "LE16 7BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4872", "longitude": "-.931093"}}, "title": "Band 6 Physiotherapist-Leicestershire East", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236915", "validThrough": "2020-11-06T23:59:59+0000"}