{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907-£30,615 per annum pro ra"}}, "datePosted": "2020-11-03T20:00:22+0000", "description": "&lt;p&gt;Are you a Registered Nurse or third year nursing student? Are you seeking exciting new opportunities or a chance to enhance your professional development?&lt;/p&gt;\n&lt;p&gt;Do you strive to always deliver high quality patient care in a supportive environment?&lt;/p&gt;\n&lt;p&gt;If so this may be the opportunity for you!&lt;/p&gt;\n&lt;p&gt;We are currently recruiting across a large range of specialties, these include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Sub-acute medicine – Moseley Hall Hospital&lt;/li&gt;\n&lt;li&gt;End of life care – West Heath Hospital&lt;/li&gt;\n&lt;li&gt;Dementia – West Heath Hospital&lt;/li&gt;\n&lt;li&gt;Orthopaedic Rehabilitation – West Heath Hospital&lt;/li&gt;\n&lt;li&gt;Stroke Rehabilitation – Moseley Hall Hospital&lt;/li&gt;\n&lt;li&gt;Neurological Rehabilitation – Moseley Hall Hospital&lt;/li&gt;\n&lt;li&gt;Intermediate Care – Perry Tree Centre, Kingstanding and Anne Marie Howes, Sheldon&lt;/li&gt;\n&lt;li&gt;Enhanced Care Unit - Community Unit 27, Good Hope Hospital&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you think you have what it takes to positively contribute to our exciting future by being part of our amazing teams please come along and meet us on the open day.&lt;/p&gt;\n&lt;p&gt;If you join our any of our teams within the Inpatients services and as a welcome we will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Pay the NMC for your next professional registration fee&lt;/li&gt;\n&lt;li&gt;Pay for your Disclosure and Barring Service (DBS) certificate and DBS Update Service annual subscription whilst you are employed with the Trust.&lt;/li&gt;\n&lt;li&gt;Pay any Newly Qualified nurses as a Band 4 Transition Practitioner until you receive your professional registration.&lt;/li&gt;\n&lt;li&gt;Offer free onsite parking at most of our bases&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We have other benefits within the Trust which you can explore further with HR.&lt;/p&gt;\n&lt;p&gt;All our roles provide an exciting challenge, supported by a comprehensive training and development programme including a Preceptorship programme for newly qualified staff and mentorship for our new recruits. We can also offer the opportunity to be part of a rotational programme between several specialties to maximise and gain experience and develop your nursing skills; please view in the ‘documents’ section below.&lt;/p&gt;\n&lt;p&gt;Both full and part time opportunities are available to support 7 day working on both day and night shifts. There is also the chance to join our Trust Bank whereby you can work flexibly to meet your work / life balance.&lt;/p&gt;\n&lt;p&gt;The open day includes all of our recruitment process including interview, DBS and Occupational Health along with a drugs calculation test so you could be leaving the event with a conditional offer to join our team on the day!&lt;/p&gt;\n&lt;p&gt;Please note the interview will take place at 3 Priestley Wharf, Aston Science Park, Birmingham, B7 4BN - There is free parking available on the day&lt;/p&gt;\n&lt;p&gt;IMPORTANT&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Be Part of Our Team...&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;As part of the Trust’s on-going response to the management of COVID-19 secure workplaces, strict health and safety measures and infection prevention and control has been put into place. As with any healthcare setting that cares for patients, we are and remain committed to ensure that we adhere to nationally mandated infection prevention and control policies and practices, alongside the appropriate training to ensure we protect all our staff, visitors and patients and minimise/eliminate risk in line with NHS Health Governance standards. The Recruitment programmes we are undertaking are in accordance with these measures to ensure the safety of all candidates. We are committed to protecting our staff and services users from infection and encourage our staff to uptake their annual flu vaccination.&lt;/p&gt;\n&lt;p&gt;As a Trust, we offer and encourage staff to complete either a Black and Minority Ethnic (BME) risk assessments, regular COVID-19 risk assessments and/or working at home risk assessments to identify additional support measures or reasonable adjustments that may be required as appropriate. We encourage all staff to ensure they benefit from the various support measures which have been put into place which help us to support and protect our staff, visitors and patients to provide the Best Care in Healthy Communities.&lt;/p&gt;\n&lt;p&gt;These measures are within the provisions of Health and Safety and are in line with the Trust’s expectation that all staff will comply with the measures put in place and to ensure social distancing is adhered to&lt;/p&gt;\n&lt;p&gt;For further details / info&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "All, Birmingham - Various locations across the city", "postalCode": "B13 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4459", "longitude": "-1.89289"}}, "title": "Band 5 Inpatients Staff Nurse Interview day – December 2020", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255005", "validThrough": "2020-11-17T23:59:59+0000"}