{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Salary and Benefits Package"}}, "datePosted": "2020-10-23T12:16:27+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Forensic Psychiatrist -&lt;/strong&gt;&lt;strong&gt; Male&lt;/strong&gt;&lt;strong&gt; Medium Secure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Northampton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Competitive Salary and Benefits Package&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time or Part Time Considered &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Due to the incumbent post-holder retiring in 2021, we are looking to recruit a Consultant Psychiatrist to work with patients who require neurobehavioral rehabilitation in a forensic environment which is part of our Medium Secure Service&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;St Andrews&lt;/strong&gt; &lt;/p&gt;\n&lt;p&gt;St Andrew’s Healthcare is a charity with an excellent and well-deserved reputation as a provider of specialist mental healthcare. We transform the lives of people with the greatest mental health needs. Throughout our 180 year history we have helped some of society’s most vulnerable people and today we proudly continue to build world-class mental healthcare services. Our commitment to holistic care, safety, recovery and innovative therapies and treatment makes St Andrew’s the perfect place to take your career to a new level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role and Person&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working within our Medium Secure Service, you will be the Responsible Clinician for Rose Ward, our specialist medium secure brain injury unit for adult males. This is an opportunity to work within a national specialist service to support patients with complex psychopathology and provide bespoke care adapted for their individual needs.  This post is being advertised as a full time role however we would consider flexible or part time working arrangements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With the changes in the service giving more autonomy to staff to make decisions that will help improve patient outcomes, we are looking for people who have new ideas and who want a role where they have more autonomy to make decisions in the best interest of patient care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will lead a full MDT and help shape services further through strategic decision-making and improvement projects. You will also be able to undertake research projects as part of St Andrews commitment to innovation and world-class care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must have MRCPsych or equivalent and hold a CCT in Forensic Psychiatry, Old Age Psychiatry or General Adult Psychiatry&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our patients and your colleagues will expect you to live the St Andrew’s CARE values of Compassion, Accountability, Respect and Excellence every single day&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details please contact Dr Alex Hamilton – on 01604608678  (ahamilton@standrew.co.uk) or  our Internal Recruitment Consultant, James Farrelly on 01604 616624 (jcfarrelly@standrew.co.uk)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton", "postalCode": "NN1 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2382", "longitude": "-.873687"}}, "title": "Consultant Forensic Psychiatrist - Male Medium Secure", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240487", "validThrough": "2020-11-08T23:59:59+0000"}