{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6"}}, "datePosted": "2020-10-28T14:27:43+0000", "description": "&lt;p&gt;University College London Hospital are currently looking for Bank therapeutic Radiographers to join their team.&lt;/p&gt;\n&lt;p&gt;Radiotherapy services are delivered at UCLH across two departments. The photon department is situated in the basement of the Podium (P-2) at University College Hospital. UCLH has been designated as one of two national Proton Beam Therapy (PBT) centres for the UK. The PBT department is situated in the new phase 4 building. The post holder will undertake rotations between the photon and proton departments.&lt;/p&gt;\n&lt;p&gt;The main Duties and responsibilities of the successful post holder will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work independently, or closely with the Band 7 radiographer, to coordinate the efficient, accurate patient focused planning and delivery of ionising radiation following evidence based protocols.&lt;/li&gt;\n&lt;li&gt;To reflect upon current practice with the ultimate aim of refining and improving patient focused protocols.&lt;/li&gt;\n&lt;li&gt;Daily evaluation of the patient’s condition, drawing on expert knowledge and experience to intervene where necessary. This may include discussion with the wider multi-disciplinary team to devise an appropriate course of action.&lt;/li&gt;\n&lt;li&gt;Obtain further written informed consent prior to radiotherapy planning.&lt;/li&gt;\n&lt;li&gt;Develop relationships for up to eight weeks with patients, relatives and carers; offering advice and guidance to explain the management of radiotherapy side effects.&lt;/li&gt;\n&lt;li&gt;Assess the side effects daily, make appropriate referrals and arrange adequate follow up care.&lt;/li&gt;\n&lt;li&gt;Use effective communication skills to provide and receive highly confidential, sensitive and complicated patient information. The radiographer must seek and maintain patient cooperation and trust using expert skills to support and empower them through the care pathway.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Essential Skills:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BSc in therapeutic radiography or equivalent formal qualification.&lt;/li&gt;\n&lt;li&gt;HCPC Registration&lt;/li&gt;\n&lt;li&gt;18 months postgraduate experience with specialist training and knowledge.&lt;/li&gt;\n&lt;li&gt;6 Months NHS Experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank - Senior Therapeutic Radiographer Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246972", "validThrough": "2020-11-27T23:59:59+0000"}