{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33153", "minValue": "27824", "unitText": "YEAR", "value": "£27,824.00 - £33,153.00"}}, "datePosted": "2020-10-14T09:38:41+0100", "description": "&lt;p&gt;Providing quality, inspiring innovation and delivering value is what we set out to achieve at Priory Healthcare. Enabling our patients with mental health difficultiesto receive a truly integrated and holistic approach to their treatment, regardless of complexity or severity, thanks to the knowledge and expertise of our multidisciplinary clinical teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Pelham Woods is a 21 bed inpatient rehabilitation service which serves the needs of women who have complex mental health problems and a history of challenging behaviour.&lt;/p&gt;\n&lt;p&gt;Pelham Woods is set in picturesque grounds overlooking the Surrey Hills and has extensive facilities including onsite Gym, Purpose Built Bake off Kitchen as well as Occupational and Educational Facilities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role:&lt;/p&gt;\n&lt;p&gt;As a Registered Mental Health Nurse at Pelham Woods you will be working within a team that includes a range of professionals. You will assist and support staff in the management of the ward and will make an effective contribution to providing high quality care to our patients.&lt;/p&gt;\n&lt;p&gt;You will be supported to work within an identified career development pathway and be expected to complete an appropriate competency development portfolio. You will be supported with Peer Review, Clinical Supervision, Mentorship and Appraisal.&lt;/p&gt;\n&lt;p&gt;Our RMN role involves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing a high standard of care to people with mental illness and personality disorder&lt;/li&gt;\n&lt;li&gt;Developing therapeutic relationships to optimise patient engagement&lt;/li&gt;\n&lt;li&gt;Following all codes of conduct, standards and legislation, respecting the rights of others and promoting ethical practice&lt;/li&gt;\n&lt;li&gt;Contributing to patient assessments, compiling a plan of care alongside the individual, and monitoring patient progress&lt;/li&gt;\n&lt;li&gt;At a more senior level, you’ll also need to lead shifts as well as mentoring and supporting student nurses and other members of the team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To be successful in this role you will need to be committed to Personal Learning and Development, Evidence and Values Based Practice and Patient Centred Care. You will need to have excellent team working skills and be highly self-motivated with a flexible approach.&lt;/p&gt;\n&lt;p&gt;Qualifications:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RMN / RMNH&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Experience:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Pre-Registration - complete / Preceptorship&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Some of the benefits we offer Qualified Nurses are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Subsidised Professional Membership and Registration&lt;/li&gt;\n&lt;li&gt;Free car parking and Free onsite meals&lt;/li&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/li&gt;\n&lt;li&gt;Extra Service Annual leave awards&lt;/li&gt;\n&lt;li&gt;Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/li&gt;\n&lt;li&gt;A contributory pension scheme&lt;/li&gt;\n&lt;li&gt;An employee assistance programme&lt;/li&gt;\n&lt;li&gt;Free meals/refreshments when on duty&lt;/li&gt;\n&lt;li&gt;Free car parking&lt;/li&gt;\n&lt;li&gt;NMC Payment in full&lt;/li&gt;\n&lt;li&gt;Payment into the pension scheme&lt;/li&gt;\n&lt;li&gt;CPD top up&lt;/li&gt;\n&lt;li&gt;Donation to a charity of their choice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;Disclosure&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorking, Surrey", "postalCode": "RH4 2RA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2253", "longitude": "-.328962"}}, "title": "Registered Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225503", "validThrough": "2020-11-13T23:59:59+0000"}