{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a. pro rata"}}, "datePosted": "2020-10-23T14:16:06+0100", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for an enthusiastic Pharmacist to join our team of Clinical Rotational Pharmacists. The post will offer a range of exciting and unique clinical and professional development opportunities as you rotate within the pharmacy department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Development Opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Clinical Rotational Pharmacists participate in yearlong clinical rotations in a vast range of specialties, including, but not limited to:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Urgent and Emergency Medicine&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Neurology&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Solid Organ Transplant&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Surgical specialties including vascular surgery and gastroenterology&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Medical specialties including renal and respiratory medicine&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Oncology, including preparative services&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Infectious Diseases&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Paediatrics&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Intensive Care&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;As a Clinical Rotational Pharmacist you will be providing patient facing care to the area that you have been assigned, alongside your local Lead or Advanced Clinical Pharmacist. Working with your local pharmacy team and the wide multidisciplinary team you will have the opportunity to expand your specialty knowledge and service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Clinical Rotational Pharmacists are all trained to provide extended hours services to critical care and the emergency department. These services help to prompt the attainment of national medicines reconciliation standards and ensure follow up on the most unwell patients in the hospital, putting the patient at the heart of what we do. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Professional Development Opportunities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Clinical Rotational Pharmacists have the opportunity to develop skills in a range of other professional competencies where related to their clinical rotation, such as:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Supporting medication safety and risk management, alongside attending Clinical Governance meetings&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Supervising, teaching and mentoring pharmacy colleagues and other healthcare professional&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Aiding Lead or Advanced Clinical Pharmacists in the implementing the NICE guidance, medication formulary reviews and horizon scanning for new medicines&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Working collaboratively with local specialist teams and primary care to induce, review and update joint prescribing guideline&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Developing leadership skills by under taking the role of chief Clinical Rotational Pharmacist&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Optimising, maintaining and evolving the use of our EPMA system, EPIC in line with CUH holding the highest international quality standard for digitalised inpatient care (HIMSS EMRAM stage 7)&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Education and Training Opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The pharmacy department’s education and training team is keen to develop all eligible pharmacists in areas including:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Independent prescribing&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Supporting RPS Faculty portfolio development&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Participation in our well-established in house clinical pharmacy forum&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Opportunities to undertake further study e.g. MSc in either clinical, research or management qualifications&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Tutoring for pre-registration trainees or clinical pharmacy diploma students&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Important Details&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have job opportunities for Permanent and Fixed Term/Secondment posts. Please note that with regards to the Fixed Term/Secondment vacancies, internal applicants on permanent contracts can only apply for this post as a Secondment and must have the approval of your current line manager before applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In some cases alternative working hours will be considered, including shifted days and part time applicants.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy is Sunday 8th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are due to be held week commencing 16th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;/p&gt;\n&lt;p&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;/p&gt;\n&lt;p&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/p&gt;\n&lt;p&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further deta&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital - Division B, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Clinical Rotational Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240874", "validThrough": "2020-11-08T23:59:59+0000"}