{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "77126", "minValue": "41360", "unitText": "YEAR", "value": "£41,360 - £77,126 £41,360 - £77,126 / £32,896 - £5"}}, "datePosted": "2020-10-29T11:30:55+0000", "description": "&lt;p&gt;Location: Haverfordwest, Pembrokeshire&lt;/p&gt;\n&lt;p&gt;Specialty Doctor / Senior Clinical Fellow - Emergency Medicine&lt;/p&gt;\n&lt;p&gt;We are looking to appoint enthusiastic, focused and forward-thinking Specialty Doctors and Senior Clinical Fellows to join our highly supportive Emergency Department based in Withybush General Hospital.&lt;/p&gt;\n&lt;p&gt;Our flexible Specialty Doctor / Senior Clinical Fellow posts are within Emergency Medicine in a friendly semi-rural Emergency Department. Withybush General Hospital is a modern District General Hospital containing 195 inpatient beds, situated one mile from the centre of Haverfordwest.&lt;/p&gt;\n&lt;p&gt;The Emergency Department consists of four resuscitation bays, X-ray, plaster room and treatment rooms giving immediate access to primary medical and surgical assessment treatment and care. It provides care for the people of Pembrokeshire and adjacent parts of Carmarthenshire and Cardiganshire in an environment that permits sufficient time for rewarding interaction between staff and patients, yet also provides appropriate experience of high quality emergency medicine.&lt;/p&gt;\n&lt;p&gt;Hywel Dda University Health Board is one of seven acute Health Boards in Wales serving a population of 389,000 and right now we are building our future, setting the pace for care. The Health Board is committed to delivering high quality emergency care and sees the provision of consistent emergency care as a key strategic priority. You will enjoy excellent conditions of employment, whilst building your future in one of the best locations in the UK.&lt;/p&gt;\n&lt;p&gt;West Wales provides wonderful lifestyle opportunities. Pembrokeshire is a coastal county with beautiful coast line and the Preseli Mountains in the North of the County. There are opportunities to undertake many activities such as climbing and mountain biking as well as walking, surfing, fishing, sailing and hiking. Property prices are lower than many parts of the UK with excellent State and Independent Schools within the area. There are excellent road and rail connections to London and the larger cities. Wales has a low crime rate and is a safe and friendly place to live and work. Oversees applicants are encouraged to apply for these posts and although previous NHS experience is desirable it is not essential.&lt;/p&gt;\n&lt;p&gt;Additional benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full, structured induction into the NHS and the Department&lt;/li&gt;\n&lt;li&gt;Generous relocation package of up to £8,000&lt;/li&gt;\n&lt;li&gt;One month’s free hospital single accommodation on entry to the UK&lt;/li&gt;\n&lt;li&gt;NHS Discount / Staff Benefits Scheme&lt;/li&gt;\n&lt;li&gt;Pension – the NHS offers one of the UK’s best pension schemes&lt;/li&gt;\n&lt;li&gt;Employee Health &amp; Wellbeing Service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr N DrakeJob titleConsultant and Department Lead - Emergency MedicineEmail addressnicola.drake@wales.nhs.ukTelephone number01437 773448Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Nicola Drake, Consultant, Tel: 01437-764545 ext 3448&lt;/p&gt;\n&lt;p&gt;Mr Antony Mathew Tel: 01437 764545 ext 3448&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Withybush General Hospital, Haverfordwest", "postalCode": "SA61 2PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8127", "longitude": "-4.9651"}}, "title": "Specialty Doctor/Senior Clinical Fellow - Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248123", "validThrough": "2020-11-15T23:59:59+0000"}