{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 gross per annum"}}, "datePosted": "2020-10-20T12:38:37+0100", "description": "&lt;p&gt;&lt;strong&gt;Norfolk &amp; Suffolk NHS Foundation Trust&lt;br /&gt;Consultant Psychiatrist, Adult Inpatients, Northgate Ward, Bury St Edmunds, Suffolk (10 PA’s)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Norfolk and Suffolk NHS Foundation Trust provides child and adult mental health services, learning disability, wellbeing and eating disorder services across Norfolk and Suffolk.&lt;/p&gt;\n&lt;p&gt;We are committed to delivering quality driven mental health services. Every individual makes a valuable contribution. We are proud of our staff who have been commended by CQC for the care they provide.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to be a part of our expanding Crisis Pathway, with ambitions to provide the best quality care to all in need of crisis/acute care. As the Consultant, for one of our two adult inpatient admission wards, you will be providing excellent clinical leadership for acute care and contributing to the development of the wider Pathway. You will be working with a supportive MDT to deliver high quality care, inline with national standards, and making a valued contribution to the development and implementation of acute care pathways for those in need of hospital admission. If you are passionate about improving acute care, then come to work with us as we have much to offer including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Beautiful countryside with easy access to award winning coastal locations.&lt;/li&gt;\n&lt;li&gt;Excellent rail links to Cambridge and London&lt;/li&gt;\n&lt;li&gt;Affordable housing and reputable college and schools.&lt;/li&gt;\n&lt;li&gt;Relocation allowance / removal benefit&lt;/li&gt;\n&lt;li&gt;Protected time of 2.5 SPA per week (pro rata)&lt;/li&gt;\n&lt;li&gt;We have a strong education reputation and close ties with both the university of Cambridge and The University of East Anglia&lt;/li&gt;\n&lt;li&gt;Local teaching programme&lt;/li&gt;\n&lt;li&gt;Access and encouragement to partake in research and a well-established research network within the Trust&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants for the post should have or be eligible for a CCT and eligible onto the Specialist Register within six months of the interview date. Full GMC registration, approval under Section 12 of the Mental Health Act, eligibility for Approved Clinician status and appropriate adult psychiatry experience are required.&lt;/p&gt;\n&lt;p&gt;The Trust is working towards equal opportunities and welcomes applications irrespective of age, disability, ethnic origin, gender, sexuality or religious belief.&lt;/p&gt;\n&lt;p&gt;The Trust operates a no smoking policy.&lt;/p&gt;\n&lt;p&gt;Here at NSFT we pride ourselves on being a welcoming, talented, friendly and supportive team who like nothing better than sharing their experiences and learning from each other.&lt;/p&gt;\n&lt;p&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interview dates are to be confirmed, candidates may only be given a minimum of 3 days’ notice, please note this date is provisional and may be subject to change. You will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying. Interviews will be held remotely via Microsoft Teams.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMichelle PainterAdditional contact information&lt;/p&gt;\n&lt;p&gt;Michelle Painter, Clinical Director – 01284 719822/ michelle.painter@nsft.nhs.uk or Neil Brandon, Modern Matron – 01284 719700/ neil.brandon@nsft.nhs.uk Jan Falkowski - jan.falkowski@nsft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northgate Ward, Wedgwood House, Bury St Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Consultant in Adult Psychiatry with Relocation Allowance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234428", "validThrough": "2020-11-08T23:59:59+0000"}