{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 per annum"}}, "datePosted": "2020-11-05T12:16:13+0000", "description": "&lt;p&gt;Liverpool Clinical Laboratories (LCL) is the largest provider of pathology services in the Northwest.&lt;/p&gt;\n&lt;p&gt;Our vision is to pioneer new technologies and ways of working that better inform decisions about a person’s health, by providing greater accessibility to clinical diagnostic services. We employ over 600 staff across four locations, 24 hours a day and process in excess of 15 million tests each year.&lt;/p&gt;\n&lt;p&gt;Our mission is to be world leaders in research and innovation and we continually improve services for patients by investing in new insight and techniques.&lt;/p&gt;\n&lt;p&gt;The work we do is clinically led and cutting edge, making us a regional reference centre for many specialist investigations. As part of LCL you’ll be encouraged to share your skills, whatever your area of expertise, to help drive the organisation to success.&lt;/p&gt;\n&lt;p&gt;We’re looking for people who see opportunities, explore the potential and recognise that behind every sample is a real person. If you’re someone who inspires those around you and is a true ‘team player’, we want to hear from you. We offer excellent training and development opportunities for all disciplines and a chance to be part of our new state of the art laboratory, opening date to be confirmed. Whether you live in Liverpool already or are considering a move, there’s never been a better time to joins us at Liverpool Clinical Laboratories.&lt;/p&gt;\n&lt;p&gt;The Histopathology service at Liverpool Clinical Laboratories (LCL) is a UKAS accredited service and offers a wide range of both standard and specialist diagnostic techniques for local and regional service users.&lt;/p&gt;\n&lt;p&gt;Applications are invited for outstanding, patient centred candidates for a full-time substantive Laboratory Manager in Histopathology within LCL. The post holder will be part of the Cellular Pathology management and leadership team, taking a lead role in the management and development of the Histopathology service together with the Cellular Pathology Clinical Director and Service Manager.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic, influential and self-motivated HCPC registered Biomedical or Clinical Scientist who possesses excellent communication skills. The successful applicant should have considerable, recent experience of leadership and management within a histopathology laboratory and preferably hold a level 5/post-graduate qualification in management.&lt;/p&gt;\n&lt;p&gt;The successful candidate will play a key role in managing the technical services of the histopathology service as well as taking a lead role in liaising with Clinical Services in order to support the faster diagnosis standards. The post holder will directly supervise a team of Biomedical Scientists and technicians conducting a range of histopathological technical procedures. The post holder will have in-depth knowledge of the science behind those procedures in order to provide training, education and troubleshooting advice.&lt;/p&gt;\n&lt;p&gt;Liverpool is a friendly, vibrant city with a wide range of cultural activities and easy access to North Wales and the Lake District.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJames WingfieldJob titleCellular Pathology Service ManagerEmail addressjames.wingfield@liverpoolft.nhs.ukTelephone number0151 706 4410 Ext. 11081Additional contact information&lt;/p&gt;\n&lt;p&gt;Craig Evans&lt;/p&gt;\n&lt;p&gt;General Manager for LCL&lt;/p&gt;\n&lt;p&gt;craig.evans@liverpoolft.nhs.uk&lt;/p&gt;\n&lt;p&gt;0151 706 4233&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool Clinical Laboratories, Liverpool", "postalCode": "L7 8XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.96481"}}, "title": "Histology Laboratory Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257607", "validThrough": "2020-11-19T23:59:59+0000"}