{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13448", "minValue": "13448", "unitText": "YEAR", "value": "G8: £28,672 - £32,234"}}, "datePosted": "2020-11-03T07:53:38+0000", "description": "&lt;p&gt;Lincolnshire County Council (LCC) has an exciting opportunity for several Children and Young People&#39;s Nurses, working alongside the Senior Children and Young People&#39;s Nurse delivering health interventions to children aged 6 to 19 years.&lt;/p&gt;\n&lt;p&gt;The Children&#39;s Health Service 0-19, alongside others support the delivery of the Healthy Child Programme across Lincolnshire for children, Young People and their families (aged 0-19 years) and up to the age of 25 years for Young People with Special Educational Needs and/or disabilities (SEND).&lt;/p&gt;\n&lt;p&gt;The Children&#39;s and Young Peoples Nurses (CYPN), based across 4 teams in Lincolnshire, ensure that children, young people and families can access timely expert advice and intervention from a CYPN on specific health issues when needed.&lt;/p&gt;\n&lt;p&gt;The CYPN service work closely with other health services to support children with complex health needs and ensure these needs are met. Much of this work is around the Educational Health Care Plan, or supporting children with medical needs to access education. This complex health may also include sleep, or advice on certain diagnosable behavioral/developmental conditions.&lt;/p&gt;\n&lt;p&gt;As well as delivering awareness sessions to schools on anaphylaxis and asthma CYPN deliver a targeted healthy lifestyle programme called &quot;My Healthy Choices&quot; aimed at families looking at healthy diet, exercise and lifestyles.&lt;/p&gt;\n&lt;p&gt;To be considered for this post you will need to be a registered paediatric nurse(or a registered adult/mental health nurse with relevant paediactric experience)with a current NMC registration, post registration experience in children&#39;s health is also essential.&lt;/p&gt;\n&lt;p&gt;To be successful in this role, you will need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A good understanding of children&#39;s safeguarding.&lt;/li&gt;\n&lt;li&gt;Experience of supporting a learning environment, including supporting students&lt;/li&gt;\n&lt;li&gt;Excellent organisational and communication skills.&lt;/li&gt;\n&lt;li&gt;A good understanding of clinical governance and the CQC (Care Quality Commission) standards for community practice.&lt;/li&gt;\n&lt;li&gt;To be able to work in a changing environment and have the skills to support others in that situation.&lt;/li&gt;\n&lt;li&gt;To be committed to working collaboratively and in partnership with early help and social care colleagues to improve outcomes of children and young people.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As one of the largest county councils in the UK we lead the way in many of our service areas from Children&#39;s Services to Highways.Our environment is supportive and we are ambitious for both the people who work here and the residents of the county.&lt;/p&gt;\n&lt;p&gt;Steeped in history and brimming with life, Lincolnshire’s historic market towns, vibrant coastal tourism and areas of outstanding natural beauty make it the perfect place for your next career move. Working with us, you can enjoy a flexible working pattern, generous annual leave and pension scheme, and exciting learning and development opportunities.&lt;/p&gt;\n&lt;p&gt;We are offering a competitive salary of £28,672 - £32,234, along with a pension, a comprehensive benefits package including excellent discount schemes, cycle to work, civil service sports council membership and many areas for professional support and development.&lt;/p&gt;\n&lt;p&gt;Please note that location preference will be discussed at interview. For an informal discussion about this role, please contact Sam West on07741605946 or samantha.west@lincolnshire.gov.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lincolnshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129675"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lincoln", "postalCode": "LN2"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2814", "longitude": "-.484203"}}, "title": "Children &amp; Young Peoples Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253117", "validThrough": "2020-11-13T23:59:59+0000"}