{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "77126", "minValue": "41360", "unitText": "YEAR", "value": "£41,360 - £77,126  or £32,896 - £51,724 pa"}}, "datePosted": "2020-10-28T14:16:35+0000", "description": "&lt;p&gt;The salary is Specialty Doctor pay scales £41,360 - £77,126 or £32,896 - £51,724 pa (plus banding)&lt;br /&gt;&lt;br /&gt;We are currently looking for a motivated doctor with an interest in General Internal Medicine within our General Medicine Department.&lt;/p&gt;\n&lt;p&gt;This post will form part of team delivering General Internal Medicine and supporting the development of sub-speciality interest to the hospitals and community so designated with responsibility for the prevention, diagnosis and treatment of illness.&lt;/p&gt;\n&lt;p&gt;Applicants must possess full registration with the GMC and should have completed at least four years full time postgraduate training at least two of which will be in a specialty training programme in a relevant specialty or as a FTSTA in a relevant specialty, or the candidate should have equivalent experience and competencies. MRCP Level 2 is essential, Paces desirable (See person spec for more details) with evidence of prior NHS experience.&lt;br /&gt;&lt;br /&gt;This post is suitable for those who would like to develop their careers either as a Non Consultant Career Grade within Cardiology or who wish to consolidate their experience before moving on to other senior roles. The department of medicine has a consistent track record (with 70% pass rates) for supporting doctors post core medical training onto the middle grade rota and in supporting completion of MRCP exams and applications for NTN’s in chosen specialties. We have PACES examiners within our department and you will enjoy excellent working conditions including a new Clinical Skills Laboratory, and Postgraduate Medical Education Centre.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Angela Puffett, Consultant Physician, Medical Lead&lt;/p&gt;\n&lt;p&gt;Withybush General Hospital - 01437 773885&lt;/p&gt;\n&lt;p&gt;Dr Nikolaos Anatoliotakis, Consultant Physician, Cardiology&lt;/p&gt;\n&lt;p&gt;Withybush General Hospital - 01437 773403&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Withybush General Hospital, Haverfordwest", "postalCode": "SA61 2PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8127", "longitude": "-4.9651"}}, "title": "Specialty Doctor or Senior Clinical Fellow - General Medicine - Cardi", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246956", "validThrough": "2020-11-15T23:59:59+0000"}