{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-29T13:00:22+0000", "description": "&lt;p&gt;Do you want to make a real difference to the lives of people &amp; their families who experience mental health illness in the community?&lt;/p&gt;\n&lt;p&gt;Do you want to be part of a team that actively delivers innovative ways of supporting people to improve their mental health, wellbeing and support recovery?&lt;/p&gt;\n&lt;p&gt;If the answer is Yes, then read on:-&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently recruiting a Band 5 Community Mental Health Nurse to join our team in Skegness OACMHT. If you’re a registered mental health nurse with current NMC registration we want to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skegness Older Adult CMHT supports older adults with functional mental health problems over 65 years and provides specialist memory assessment and treatment for adults of all ages.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Acting as a Care Coordinator, you will provide high quality person centered care to patients, their families and carer&#39;s. You will hold a caseload and undertake mental health assessments, work collaborative with the patient to devise person centered care planning and manage risk.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be working within a friendly multi-disciplinary team including Community Mental Health Nurses, Occupational Therapist, Associate Practitioners, Psychiatrists, Admin staff &amp; Dementia Support Staff.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What We Offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are committed to supporting you becoming the best you can be.  We offer a comprehensive induction programme, excellent training and further development opportunities.  You will receive regular clinical and managerial supervision. &lt;/p&gt;\n&lt;p&gt;Flexible working and rotational home working to support social distancing is available. Although this is a full time post, part time can be considered.&lt;/p&gt;\n&lt;p&gt;LPFT are continually striving to expand and improve their staff benefits package, so in addition to all the great rewards you might expect from working for the NHS (generous pay, pension, leave, and NHS discounts), we also offer:&lt;/p&gt;\n&lt;p&gt;•Staff Wellbeing Service – supporting staff to improve and maintain their psychological and physical wellbeing.&lt;br /&gt; •A wide variety of exercise classes&lt;br /&gt; •Fast access to physiotherapy &lt;br /&gt; •Generous Relocation Package of up to £8K (where eligible)&lt;br /&gt; •Home Electronics salary sacrifice scheme&lt;br /&gt; •Transave – Saving and Loans Scheme&lt;br /&gt; •Car lease scheme open to all employees&lt;br /&gt; •Free staff parking across all 52 LPFT sites&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Want to talk about the role?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal visit or to discuss the role further, please contact Sarah Routledge, Team Coordinator on 07814774541 or email: sarahroutledge@nhs.net.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Holly Lodge, Skegness", "postalCode": "PE25 1DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1495", "longitude": ".345396"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248407", "validThrough": "2020-11-15T23:59:59+0000"}