{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 2"}}, "datePosted": "2020-10-09T13:40:45+0100", "description": "&lt;p&gt;&lt;strong&gt;Bank Care Support Worker - Band 2&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title: Care Support Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust: Stepping Hill Hospital,&lt;/strong&gt;Stockport&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates:&lt;/strong&gt;Band 2*&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Communications&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To communicate effectively with the multi-disciplinary team, under the supervision of a registered nurse.&lt;/li&gt;\n&lt;li&gt;To carry out ward clerical tasks, as required.&lt;/li&gt;\n&lt;li&gt;To carry out routine administrative/telephone related tasks.&lt;/li&gt;\n&lt;li&gt;To communicate effectively when giving/receiving verbal and written information.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Responsibility for Patient Care&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Under the supervision of a registered nurse to assist with patient care activities.\n&lt;ul&gt;\n&lt;li&gt;To maintain confidentiality of patient information.&lt;/li&gt;\n&lt;li&gt;To carry out any tasks required to maintain the safety, cleanliness and tidiness of the ward area.&lt;/li&gt;\n&lt;li&gt;To carry out duties as required, to meet all aspects of ward catering.&lt;/li&gt;\n&lt;li&gt;To carry out routine household management/maintenance activities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Planning and organising&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To organise and plan own day to day workload or activities in order to meet the demands of the job role.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Responsibilities for Physical and / or Financial Resources&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To actively contribute to the efficient management of ward resources, including ordering/monitoring of ward supplies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Responsibility for Policy and Service Development and Implementation&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To contribute actively to the improvement of quality service for patients.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Responsibilities for Human Resources and Leadership&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To support new or less experienced work colleagues to adapt to the workplace.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Responsibilities for Teaching and Training&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To participate in training and development activities that are relevant to the job role.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Physical Skills and Effort&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Use of physical effort to carry out the demands of the job role (e.g. pushing and pulling trolleys/ support to manoeuvre patients).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Special Circumstances&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The postholder will be required to work an internal rotation which includes evening, night and weekend shifts for which a flexible working premium will be paid.&lt;/li&gt;\n&lt;li&gt;The post is initially offered as a 12-month competency based training contract. Progression to a permanent Health Care Assistant 2 post will be subject to satisfactory completion of the relevant competencies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;General Duties&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hand Hygiene&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To assist the Trust in reducing healthcare acquired infections (HCAI’s) all staff should be familiar with all the Trust’s Infection Prevention policies which are appropriate to their role. You are required to attend mandatory training in Infection Prevention and be compliant with all measures known to be effective in reducing HCAI’s”&lt;/p&gt;\n&lt;p&gt;S&lt;strong&gt;afeguarding&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All employees have a duty and responsibility to protect and safeguard children and vulnerable adults. They must therefore be aware of child protection procedures and who to contact within the Trust for further help and guidance&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Data Protection &amp; Confidentiality&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To abide by all relevant Trust and Departmental policies including information governance, confidentiality and data protection. The postholder is reminded that any breach of the Trust’s information governance and security policies and procedures will result in disciplinary action.&lt;/p&gt;\n&lt;p&gt;Compliance with the Data Protection Act 1998 and Information Governance – the postholder is required to process all personal data relating to patients and staff, in both manual and electronic records, in accordance with the Data Protection Act 1998, ensuring the security and confidentiality of data at all times. They must not for their own benefit or gain, or to divulge to any persons, firm or other organisation whatsoever, any confidential information belonging to the Trust or relating to the Trust’s affairs or dealings which may come to their knowledge during employment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Health &amp; Safety&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Compliance with the Health and Safety at Work Act 1974- the postholder is required to fulfil a proactive role towards the management of risk in all of their actions. This entails the risk assessment of all situations, the taking of appropriate actions and reporting of all incidents, near misses and hazards, and a statutory duty of care for their own personal safety and that of others who may be affected by their acts or omissions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Harassment &amp; Bullying&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a member of staff you have a personal responsibility to ensure you do not discriminate, harass or bully or contribute to the discrimination, harassment or bullying of any colleague(s) or visitors or condone discrimination, harassment or bullying by others.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dignity &amp; Respect&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All employees have a duty to promote a harmonious working environment in which all persons are treated with dignity and respect, whilst fulfilling our legal obligations under equality legislation and associated codes of practice.&lt;/p&gt;\n&lt;p&gt;The Trust takes the right of the patient/service user to be treated with dignity and respect seriously. We will treat every patient/service user and carer as a valued individual, with respect for his/ her dignity and privacy. Our aim is to give each patient/service user the care we would want for our families and ourselves.&lt;/p&gt;\n&lt;p&gt;To undertake any other duties which is deemed appropriate to the band when requested by Senior Staff.&lt;/p&gt;\n&lt;p&gt;The above indicates the main duties of the post which may be reviewed in the light of experience and development within the service. Any review will be undertaken in conjunction with the postholder.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockport Foundation Trust", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Bank Care Support Worker - A1 COVID", "url": "https://www.jobs.nhs.uk/xi/vacancy/916220445", "validThrough": "2020-12-31T23:59:59+0000"}