{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "42969", "unitText": "YEAR", "value": "£42,969 - £51,069 pro rata, per annum"}}, "datePosted": "2020-10-26T10:47:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Fellows (ST6+) in Paediatric and Neonatal Intensive Care Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Start date: from March 2021&lt;/p&gt;\n&lt;p&gt;The paediatric critical care departments at Great Ormond Street Hospital, UK, invite applications for a training fellowship in paediatric intensive care medicine. Rotations can include time on the PICU, CICU, NICU, and the paediatric critical care transport service (CATS).&lt;/p&gt;\n&lt;p&gt;We are able offer bespoke paediatric critical care placements: this could be a 6-12 month PICU placement for a paediatric anaesthetist or paediatrician wishing to gain some PICM experience; or a two year + fellowship (including PICU, CICU and CATS) for those wishing to train as paediatric intensivists. In addition, we can offer time on the NICU for any applicant, or stand-alone 6-24 month NICU posts. Experienced PICM applicants approaching consultant level may wish to spend time on the ‘PICU senior tier’ – a pre-consultant leadership role with the opportunity to lead ward rounds and run the shop floor. Please direct queries about your training needs to andrew.jones@gosh.nhs.uk.&lt;/p&gt;\n&lt;p&gt;Our intensive care fellows are under the supervision of a team of consultants in each ICU area. All posts are accredited for training by the College of Intensive Care Medicine (CICM) of Australia and New Zealand. Paediatric critical care training at GOSH is designed to prepare you for a career in paediatric critical care medicine as an excellent clinician, leader and thinker. Each trainee will be allocated an educational supervisor who will provide guidance on quality improvement projects and completing publishable research.&lt;/p&gt;\n&lt;p&gt;Applicants for all roles should have completed a minimum of two years of training at the equivalent of specialist registrar level (four years post-graduation) in either paediatrics or anaesthesia, and have experience in a critical care field. This equates to at least six months experience in a level three neonatal unit for paediatricians or six months paediatric anaesthesia or adult ICU for anaesthetists. Adult intensivists with at least two years adult ICU experience are also eligible to apply. Where applicable, it is an essential requirement that applicants have completed and passed the IELTS or OET examination at the time of submitting an application, to the required pass-mark standard for GMC Registration.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In the written application applicants should be explicitly clear about their current IELTS or OET pass-mark, and the amount of time spent at registrar grade (or equivalent) on a level 3 NICU, a PICU, or an adult ICU. Anaesthetists should make clear their experience of paediatric anaesthesia at registrar level.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further general information please contact consultant Andrew Jones on andrew.jones@gosh.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Clinical Fellow in Paediatric and Neonatal Intensive Care Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242070", "validThrough": "2020-11-09T23:59:59+0000"}