{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21925", "minValue": "17633", "unitText": "YEAR", "value": "£17,633 - £21,925 Per Year"}}, "datePosted": "2020-10-29T10:19:31+0000", "description": "&lt;p&gt;1 x Part-time post - 30 hours per week – shift work&lt;br /&gt;6 Months - Fixed Term Contract&lt;br /&gt; &lt;/p&gt;\n&lt;p&gt;We are a Respite Care Team whose aims are to provide high quality support to adults with complex learning disabilities on a 1:1 basis, regardless of gender, race, religion or sexual orientation.&lt;br /&gt;&lt;br /&gt;We support individuals to achieve and meet their everyday living needs e.g. support with personal care, manual handling, administering medication, meal preparation and support etc . We provide clients with opportunities to develop independence, build positive relationships and be empowered to make informed choices, within a person-centred approach. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a member of the Respite service you will be part of a team who provide support to all the different individuals that accesses the service, therefore no one day is the same as the service user group can change on a daily basis. You will be working alongside other colleges as part of the shift, or on occasions on your own.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic &amp; innovative person to join our existing experienced &amp; skilled staff team. The successful candidate will have experience in working in care or support setting, they will treat our clients with dignity &amp; respect whilst meeting their individual care needs, including support with personal care.  &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In addition to the above, the successful candidate will have the ability to assess risk &amp; plan strategies to minimise &amp; manage these.  They will also be committed to working shift patterns on a rolling rota so you can plan your life outside of work, shifts include weekends and sleep-ins, a typical early shift may start at 7am during the week and 7.30am on Weekends and a late shift may start at 2pm with a 9pm finish or a 9.30pm finish if you are doing a sleep-in. You will be required to work two weekends in three.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be able to demonstrate&lt;/strong&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Good general education, to include good literacy skills&lt;/li&gt;\n&lt;li&gt;NVQ3/QCF Level 3 Diploma in Care and Promoting Independence or commitment to achieving this&lt;/li&gt;\n&lt;li&gt;A commitment to delivering Person Centred Support to a range of individuals&lt;/li&gt;\n&lt;li&gt;Able to relate to service users and meet their needs, with a sense of understanding, patience, respect and dignity&lt;/li&gt;\n&lt;li&gt;Ability to accurately maintain and review individual client files&lt;/li&gt;\n&lt;li&gt;Ability to undertake manual handling tasks&lt;/li&gt;\n&lt;li&gt;Ability to work effectively as part of a team as well as on own initiative (there may be occasions where lone working may be applicable)&lt;/li&gt;\n&lt;li&gt;Ability to communicate effectively both written and verbally&lt;/li&gt;\n&lt;li&gt;Ability to be self-motivating&lt;/li&gt;\n&lt;li&gt;Basic Microsoft IT skills, ability to read/check emails etc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Progression through the full salary range is dependent on attaining the relevant QCF qualification.  You will also demonstrate a commitment to anti oppressive practice along with a flexible attitude to travelling around and working in the local area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our offer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a supportive environment to grow and develop your career with the opportunity to put your ideas across. Innovation and ambition is strongly encouraged, and you’ll get a great feel for that, working in our friendly and collaborative environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A competitive salary alongside a range of benefits including;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Generous holiday entitlement - 24 days holiday each year plus bank holidays - rising to 32 days after 10 years&#39; service, with the option to buy additional leave&lt;/li&gt;\n&lt;li&gt;A wide range of flexible working opportunities&lt;/li&gt;\n&lt;li&gt;Local Government Pension Scheme (LGPS)&lt;/li&gt;\n&lt;li&gt;Life Assurance - three times your annual salary (for members of the LGPS)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion about the Support Worker post, please contact Rachel Jerrard on 07834 964 762 – rachel.jerrard@reading.gov.uk, Karen Rumbol on 07973 793 837 – karen.rumbol@reading.gov.uk or Dominic Ruskin on 07973 793 843 – dominic.ruskin@reading.gov.uk.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date: Sunday 8th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews: TBC&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that the closing date is given as a guide. We reserve the right to close this vacancy once a sufficient number of applications has been received. Therefore, it is strongly advised that you complete and return your application as soon as possible to avoid disappointment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Reading Borough Council is a Disability Confident Employer and is committed to the recruitment and continued employment of people with disabilities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "READING BOROUGH COUNCIL", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129521"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 2LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4528", "longitude": "-.973573"}}, "title": "Respite Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247880", "validThrough": "2020-11-08T23:59:59+0000"}