{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T11:46:06+0000", "description": "&lt;p&gt;Do you aspire to make a real positive contribution to nursing? Are you a registered nurse, with experience in Trauma or the Emergency Unit? Do you want an exciting and interesting job with great potential to progress to specialist or advanced roles?&lt;br /&gt;&lt;br /&gt;The Trauma Nurse Practitioner post is required to work alongside the Multi-disciplinary team, including Patient Access, and will be expected to work closely with the Emergency Unit, general Trauma wards in the University Hospital of Wales and the University Hospital Llandough, Cardiff. The post is fundamental to ensure the patient pathway for trauma patients, from admission to discharge is seamless. You will be working closely with the medical teams which involve Trauma consultants and respective teams.&lt;/p&gt;\n&lt;p&gt;The role requires flexibility to support Trauma patient flow, the use of available trauma beds to reduce length of stay and maximising the management of the resources available. This requires excellent clinical skills to be able to assess trauma patients in EU and on the wards to support the trauma teams. Good interpersonal skills and the ability to work with a variety of clinical and non-clinical teams are essential. The role will working closely with the Trauma and Orthopaedic Directorate Senior Management Team in achieving the UHB’s objectives , and on a day to day basis be flexible to meet the operational demands of Trauma activity.&lt;br /&gt;&lt;br /&gt;The post is to help manage the flow of patients in the trauma pathway. We are looking for innovative, forward thinking nurses who have a background in Trauma or the Emergency Unit. The role of the practitioner is dynamic and the post-holder will be proactive in conjunction with other Trauma Nurse Practitioner in pioneering and developing this role further in response to challenging healthcare needs and advances in practice.&lt;/p&gt;\n&lt;p&gt;We are looking for someone to work full time on a permanent basis but are also happy to consider a 1 year secondments into this post, but candidates will be expected to have discussed this with their line manager prior to applying.&lt;br /&gt;&lt;br /&gt;We welcome and encourage informal visits.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 16th November 2019&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Luton&lt;/p&gt;\n&lt;p&gt;Lead Nurse&lt;/p&gt;\n&lt;p&gt;Helen.Luton@wales.NHS.uk&lt;/p&gt;\n&lt;p&gt;02920716641&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Tracy Johnson Senior Nurse&lt;/p&gt;\n&lt;p&gt;Tel: 02920748044&lt;/p&gt;\n&lt;p&gt;Email: Tracy.Johnson2@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of Wales / University Hospital Llandough, Cardiff", "postalCode": "CF14 4XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5068", "longitude": "-3.18937"}}, "title": "Trauma Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251881", "validThrough": "2020-11-16T23:59:59+0000"}