{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-28T10:12:59+0000", "description": "&lt;p&gt;Are you a Learning Disability Nurse who looking for your next challenge?&lt;/p&gt;\n&lt;p&gt;Could you transfer your existing skills , knowledge and experience into an acute provider Trust?&lt;/p&gt;\n&lt;p&gt;We have a an exciting opportunities for an enthusiastic and motivated Learning Disabilities Nurses to join the Trust on a 12 month secondment as a Learning Disabilities and Autism Nurse Specialists and work with the Lead Nurse for Vulnerabilities to shape and transform acute hospital care and experience for patients with a Learning Disability, Autism, Delirium, Dementia and or known Mental Health Conditions. .&lt;/p&gt;\n&lt;p&gt;The role involves supporting people with learning disabilities and / or autism spectrum conditions attending the hospital, either as an inpatient or outpatient, to ensure that their holistic care needs are met.&lt;/p&gt;\n&lt;p&gt;The role is diverse; it requires the post holder to review and assess patients , liaise, support and teach staff members, carers and external partners when planning admissions, during the inpatient care through to discharge to ensure a positive patient have experience. In addition post holders will utilise information to develop a plan of action that reduces restrictive interventions and develop and deliver a range of range of guidance and training which use the least restrictive practice, provides alternative and preventative approaches and implements the NHS commissioned Restraint Reduction Training Standards (Restraint Reduction Network) which will provide assurance of compliance with regulatory CQC standards .&lt;/p&gt;\n&lt;p&gt;We welcome applicants who current NMC registration of RNLD with knowledge and experience of working with people with learning disabilities and complex needs who are seeking an opportunity to influence and shape acute hospital health care for patients with a Learning Disability/Autism.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to work Trust wide within adult services and supporting transition, acting as a role model and sharing expertise across multi-disciplinary teams. Therefore, the post holder will need excellent communication, organisational and interpersonal skills. The Trust has 4 main inpatient sites across Birmingham &amp; Solihull and post holders will be expected to travel between sites as part of their role.&lt;/p&gt;\n&lt;p&gt;In order to be shortlisted please ensure that you demonstrate the essential requirements of the person specification with a specific reference to knowledge , skills and experience .&lt;/p&gt;\n&lt;p&gt;A secondment arrangement would require employees to speak with their current line manager about being released for the 12 month duration&lt;/p&gt;\n&lt;p&gt;Closing date : 16th Novembe r2020 at Midnight , interview and selection dates will be confirmed following shortlisting but provisionally will be 26th November 2020 via Video due to current restrictions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an information discussion or further information please contact Ruth O’Leary – Lead Nurse Vulnerabilities 0791894563&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Learning Disability &amp; Autism Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245987", "validThrough": "2020-11-16T23:59:59+0000"}