{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "82096", "minValue": "82096", "unitText": "YEAR", "value": "£82,096"}}, "datePosted": "2020-10-07T14:46:07+0100", "description": "&lt;p&gt;THE ROYAL OLDHAM HOSPITAL&lt;br /&gt;LOCUM CONSULTANT ANAESTHETIST x 1 with an interest in Paediatric Anaesthesia&lt;br /&gt;&lt;br /&gt;The Anaesthetic and Surgical Division at Pennine Acute Hospitals Trust are&lt;br /&gt;looking to appoint a Locum Consultant Anaesthetist for 6 to 12 months to join our growing team at The Royal Oldham Hospital.&lt;/p&gt;\n&lt;p&gt;As the Healthier Together plans continue across Greater Manchester the Oldham Care Organisation (The Royal Oldham Hospital) is planned to play a crucial role and has been identified as a red/hub hospital for the area providing a specialist high acuity site for high risk elective and emergency general surgery across North East Manchester.&lt;/p&gt;\n&lt;p&gt;The innovative plans will see Oldham Royal benefit from around £25 million investment over the next 2 to 3 years to bring patient activity under the full scope of Healthier Together&lt;/p&gt;\n&lt;p&gt;In addition, the Oldham Care Organisation is increasing its paediatric surgical workload with a potential casemix age of 6 months and older. We are therefore looking to increase our paediatric anaesthetic expertise in order to cover this change.&lt;/p&gt;\n&lt;p&gt;Surgery currently includes Orthopaedics and Trauma, General Elective &amp; Emergency&lt;br /&gt;Surgery, Vascular Elective and Emergency Surgery, Colorectal Surgery, Cancer Surgery, Urology, Day Case Gynaecology, Elective and Emergency Maternity. The Royal Oldham is also one of the Healthier Together Hospitals.&lt;/p&gt;\n&lt;p&gt;There is a busy Obstetric Unit with over 5,000 deliveries per annum. The department at&lt;br /&gt;ROH has a strong reputation for teaching and has CT and ST trainees for Anaesthesia,&lt;br /&gt;ACCS and ICU. The Department has a strong learning structure with opportunities to be&lt;br /&gt;involved in the regular Simulation.&lt;br /&gt;The post offers a 10 PA contract primarily to cover theatre work during the week&lt;br /&gt;dependent on the requirements of the service at ROH. The post also includes on-call&lt;br /&gt;duties and pre-operative assessment clinic cover. While routine cover will be at the Oldham and Rochdale sites, there may be an expectation to occasionally work at other two sites within the Pennine Hospitals.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced and enthusiastic candidates who can demonstrate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Candidates must be on the specialist register for anaesthesia or have a reasonable&lt;br /&gt;expectation of achieving this within six months&lt;/li&gt;\n&lt;li&gt;Candidates must have advanced level training in paediatric anaesthesia&lt;/li&gt;\n&lt;li&gt;Candidates must be able to demonstrate an ability to deliver obstetric anaesthesia&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;• Expertise in ophthalmic regional anaesthesia is desirable&lt;br /&gt;• Current APLS and ALS certificates&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr A Brammar (Clinical Director) on 0161 627 8385 or email andrew.brammar@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr J Humphreys (Clinical Director) on 0161 627 8385 or email joanne.humphreys2@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;Dr Nick Tierney (Divisional Clinical Director) on 0161 778 3644 or email Nick.Tierney@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;Miss Rachel Scott (Senior Directorate Manager) on 0161 778 5121 or email rachel.scott@pat.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Oldham Hospital, Oldham", "postalCode": "OL1 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5533", "longitude": "-2.12183"}}, "title": "Locum Consultant Anaesthetist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216990", "validThrough": "2020-11-15T23:59:59+0000"}