{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum plus HCA where applica"}}, "datePosted": "2020-10-26T13:46:54+0000", "description": "&lt;p&gt;&lt;strong&gt;*** Please note that NEL staff At-Risk candidates will be given priority***&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;An exciting and unique opportunity has arisen for a highly motivated, GPhC registered Pharmacy Technician to work within the Clinical Services team of NEL.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will provide support to the Medicines Management and Optimisation Team in the delivery of local and regional pharmaceutical and prior approval services. This will involve working closely with various members of the multidisciplinary team in the provision of governance and assurance services for National Tariff excluded drugs, and evidence-based procedures. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This role will also involve supporting the oversight and management of Compliance and Assurance Officers in the delivery of the core service, alongside supporting other internal and external projects being delivered by the team.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This is an exciting opportunity to gain multifaceted exposure to healthcare services across London and the South East, which will provide insight to the strategic challenges facing the NHS as it adapts to deliver the NHS Long Term Plan. The post-holder will be supported in gaining the relevant skills and knowledge to develop greater understanding and effectiveness in this specialist discipline.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Excellent planning and organisation, communication and interpersonal skills are vital for the multidisciplinary and matrix working required for this role. We are looking for an individual with a good understanding of the current healthcare landscape who thrives on a broad range of tasks and challenges in order to support the NEL vision of delivering a high-quality and innovative service. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicola FoxJob titleSenior Pharmacy TechnicianEmail addressn.fox1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent House, Ashford", "postalCode": "EC2A 2DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.084148"}}, "title": "Commissioning and Contracting Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242749", "validThrough": "2020-11-09T23:59:59+0000"}