{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa"}}, "datePosted": "2020-10-22T13:49:45+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Diabetes and Endocrinology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of a Diabetes/Endocrine Consultant at the Rotherham NHS Foundation Trust (TRFT).&lt;/p&gt;\n&lt;p&gt;This post is for a Consultant Physician in Diabetes and Endocrinology, based at Rotherham General Hospital. This is a new post to meet the increased workload of the Department, which continues to expand. The post-holder will work alongside three existing Diabetes Consultants, Junior Doctors, Department Manager and the nursing team to complement, strengthen and help further develop the service.&lt;/p&gt;\n&lt;p&gt;Currently the service runs three general endocrinology clinics a week and a joint gynaecological/endocrine clinic every 2 weeks on average. The service has close links with Sheffield Teaching hospital and access to the weekly endocrine MDT run at Royal Hallamshire Hospital. We have a dedicated planned investigation unit for dynamic endocrine function test. The trust has access to the Radioiodine service run by Sheffield teaching hospital.&lt;/p&gt;\n&lt;p&gt;The department provides a broad range of sub specialities in Diabetes including insulin pump clinics (&gt; 100 patients), young people and transitional clinics, antenatal and preconception clinics, diabetes foot clinics in collaboration with Vascular Consultants from Sheffield Teaching hospitals and general diabetic clinics. DAFNE and DESMOND courses form an integral part of patients’ education.&lt;/p&gt;\n&lt;p&gt;The Rotherham NHS Foundation Trust is a busy modern hospital with an excellent standard of care. We have excellent transport links, being near to the M1 and M18 as well as Robin Hood and East Midlands international airports. The Hospital is located close to the Peak District National Park.&lt;/p&gt;\n&lt;p&gt;The appointee will possess full GMC registration, and will be on the Specialist Register or within 6 months of CCT at the time of interview. The post involves participation in a 1:16 on-call rota.&lt;/p&gt;\n&lt;p&gt;Prospective candidates are encouraged to visit the department. For further information or to arrange a visit please contact Operational &amp; Performance Manager: Emma Danks. emma.danks2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Consultant Physician with an interest in Diabetes/Endocrinology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238758", "validThrough": "2020-11-22T23:59:59+0000"}