{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a (pro rata)"}}, "datePosted": "2020-10-26T12:01:05+0000", "description": "&lt;p&gt;We are Manchester Local Care Organisation - an exciting, public sector organisation that is bringing together NHS community health services and social care services in the city. We’re driven by the aim of improving the health of local people in Manchester by working across organisational boundaries.&lt;/p&gt;\n&lt;p&gt;Our teams work as one in the neighbourhoods they serve – delivering and designing services in partnership with local people. We also provide key services that work across wider localities and city-wide. We believe that our pioneering approach will make a massive difference to the health of people in our city and we are looking for you to join our team and help us do this.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;An exciting opportunity has arisen for a band 6 district nursing sister to work within one of our four Integrated Neighbourhood Teams across North Manchester has arisen. You will be responsible for a nursing caseload, delivering nursing care to patients within their own homes and clinic settings. You will prioritise, assess, plan, evaluate and deliver all relevant aspects of nursing care to an agreed and expected high standard. Working as a key member of the multi-disciplinary team you will be able to make a difference and contribute to the processes that promote patient safety and quality of care in line with clinical governance frameworks and Trust Values.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal visit or telephone contact please contact&lt;/p&gt;\n&lt;p&gt;Cheryl Madeley&lt;/p&gt;\n&lt;p&gt;Community Matron&lt;/p&gt;\n&lt;p&gt;Mobile 07813544569&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Locations across the locality, Manchester North", "postalCode": "M8 5AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5146", "longitude": "-2.23289"}}, "title": "District Nursing Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242320", "validThrough": "2020-11-09T23:59:59+0000"}