{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa/ pro rata for part time staff"}}, "datePosted": "2020-10-29T13:46:11+0000", "description": "&lt;p&gt;We are looking for a suitable applicant to join our Estates Management Team that maintains and develops a substantial estate at one of the country’s foremost Teaching Foundation Trusts.&lt;/p&gt;\n&lt;p&gt;Duties will involve the undertaking of minor repairs and maintenance across this site, and assisting the craftsmen with major repairs. Duties will also include carrying out regular inspection of plant and equipment whilst ensuring irregularities are promptly reported.&lt;/p&gt;\n&lt;p&gt;Applicants must have relevant experience in a building services maintenance environment or a similar role and ideally have previously operated steam raising boiler plant although training will be given in this area for the successful candidate, as well as knowledge of basic health and safety, and moving and handling techniques. Applicants must also have good communication skills, be numerate and computer literate, have the ability to follow instructions, and work to conflicting priorities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Mick James Estates Manager (Engineering) &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Tel: 0114 2714067&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As part of the recruitment process at application stage, Sheffield Teaching Hospitals will assess applicants’ individual values and behaviours to ensure that these behaviours align with our PROUD values: Patient First, Respectful, Ownership, Unity and Deliver.&lt;/p&gt;\n&lt;p&gt;Our values are what help to make us different and ‘a Brilliant Place to Work’. We expect all our employees to share our values and demonstrate them in every aspect of their role.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake an online values assessment at application stage and the results of this assessment will be used as part of the on-going selection process to assess your suitability for the post.&lt;/p&gt;\n&lt;p&gt;The deadline for completing the online assessment is midnight 22/11/2020.&lt;/p&gt;\n&lt;p&gt;The link to the assessment can be found below, the address can be copied and pasted into a search engine e.g. google:&lt;/p&gt;\n&lt;p&gt;login.talentqgroup.com/Login/SelfService/PJKGZKTJYG&lt;/p&gt;\n&lt;p&gt;If you have any queries, require any assistance to complete this assessment or have already completed it within the past 12 months, please contact the Trust Recruitment Team at &lt;strong&gt;sth.centralrecruitment@nhs.net&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern General Hospital, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Maintenance Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248535", "validThrough": "2020-11-09T23:59:59+0000"}