{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-20T12:31:20+0100", "description": "&lt;p&gt;&lt;strong&gt;Urgent Care – Staff Nurse &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Emergency Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Emergency Department at Tameside General Hospital provides a 24-hour service. The Emergency Department currently sees nearly 95,000 new patients per year including Paediatrics. The Department is part of the Urgent Care family, which also includes Acute and Integrated Assessment Unit, Same Day Emergency Care and a co-located urgent treatment centre.&lt;/p&gt;\n&lt;p&gt;Why not use the International Year of the Nurse and Midwife and this new decade to make your next and best career move by joining us as a Staff Nurse.&lt;/p&gt;\n&lt;p&gt;As a Staff Nurse we commit to you having a personal development plan and access to mentorship. This is your chance to work in an inclusive forward thinking organisation focused on population health, patient and service user safety and experience.&lt;/p&gt;\n&lt;p&gt;Whatever you’re looking for in your next career move, you’ll find it all at Tameside and Glossop Integrated Care NHS Foundation Trust (ICFT). We currently provide both community and hospital based services and are implementing new models of integrated care working with partners. Our belief is ‘that Everyone Matters’. Our values are clear. We only want to attract applicants whose values and behaviours match ours and that demands respect for everyone; the motivation to learn; the ability to be a professional role model, inclusive, caring and compassionate; with a communication style which is accessible, open and honest.&lt;/p&gt;\n&lt;p&gt;We want talented people from all backgrounds to choose to join our diverse teams, and so we will support your work-life balance with flexible and agile working options.&lt;/p&gt;\n&lt;p&gt;In order to rise to this opportunity you will be passionate and committed to both patients and our people. We want you to drive excellent clinical standards of care, a culture of patient safety responsive to diverse patient need and continuous improvement.&lt;/p&gt;\n&lt;p&gt;You should be a Registered Nurse, with the enthusiasm and drive to help consistently improve the care we deliver to our patients. We are a caring workforce, with staff recognised as providing good and outstanding patient-centered care; you could be one of them. We are committed to recruiting the best people to work with us to achieve our vision of providing the best healthcare for our communities, leading and supporting our teams to move forward. If you think, you can help us to achieve this we would love to hear from you. In return, we commit to investing in our staff to ensure that we retain and develop the right people, with the right skills, who care about and take pride in, putting patients first.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be responsible for assessing, planning, implementing and evaluating caring for our patients in the Emergency Department supported by Senior Nurses. We offer excellent development including clinical skills, resuscitation skills, link nurse roles, and for newly qualified nurses, we have an outstanding preceptorship programme to ensure that you are well supported to get your career off to the best start and to enable you to achieve your potential.&lt;/p&gt;\n&lt;p&gt;We have a dedicated practice based educator who will support your development in line with RCN Competency Framework for Emergency Nursing.&lt;/p&gt;\n&lt;p&gt;Applications are particularly welcome from underrepresented groups including BAME and Disabled communities to support us in achieving our Trust ambition to diversify our workforce.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Daniel White – Emergency Department Matron - 922 6569 - daniel.White@tgh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Tameside and Glossop Integrated Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121286"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ashton-Under-Lyne", "postalCode": "OL6 9RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4919", "longitude": "-2.07155"}}, "title": "Staff Nurse - Accident and Emergency", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234397", "validThrough": "2020-12-31T23:59:59+0000"}