{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T15:16:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a registered Pharmacy Technician who enjoys supporting the development of others?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you passionate about Medicines Management and patient focused care?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for a new challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Then our exciting new post could be just what you are looking for!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a candidate with a positive and responsible attitude to work who can demonstrate good communication skills, team working, positivity and confidence in dealing with a changing work environment and processes and who is able to utilise their skills and experiences across all areas of the role.&lt;/p&gt;\n&lt;p&gt;Candidates should be an enthusiastic, motivated Pharmacy Technician to join us in delivering a high quality, patient focused pharmacy service with a passion for education and training.&lt;/p&gt;\n&lt;p&gt;This innovative post involves joining us as a member of our Pharmacy Education and Training team, working to support; the development of our Pre-Registration Pharmacy technicians and the delivery of pharmacy medicines management training.&lt;/p&gt;\n&lt;p&gt;The candidate will be required to work jointly within the Pharmacy Education and Training team and the Medicines Management teams. Key aspects of the role include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead on the development of a robust training programme for the Level 3 Pre-Registration Trainee Pharmacy Technicians&lt;/li&gt;\n&lt;li&gt;Assisting in training and induction of new members of staff.&lt;/li&gt;\n&lt;li&gt;Provide education and training to new and existing staff across medicines management team&lt;/li&gt;\n&lt;li&gt;Working at ward level providing a pharmacy service to include:&lt;/li&gt;\n&lt;li&gt;Assessment of Patient’s Own Drugs (PODs)&lt;/li&gt;\n&lt;li&gt;Medicines Reconciliation&lt;/li&gt;\n&lt;li&gt;Supply&lt;/li&gt;\n&lt;li&gt;Discharge&lt;/li&gt;\n&lt;li&gt;Counselling&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder will be a team player, passionate about supporting others in their development and keen to continue to improve quality standards within the department. This position offers the opportunity to learn new skills, develop existing ones and gain experience supervising staff and being part of a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity if you want to develop your professional practice in education, training and development, and join our friendly supportive team&lt;/p&gt;\n&lt;p&gt;If you are enthusiastic about pharmacy, able to work as part of a busy and dedicated team, enjoy both patient contact and education and training of others, we look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the directorate/Speciality/Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NUH is one of the UK’s largest and busiest acute teaching Trusts. You will join over 400 pharmacy staff at Queens Medical Centre and the Nottingham City Hospital.&lt;/p&gt;\n&lt;p&gt;The pharmacy department operates a 7 day shifted working model which will include weekends and Bank Holidays.&lt;/p&gt;\n&lt;p&gt;Applications made through NHS Jobs will be given equal consideration.&lt;/p&gt;\n&lt;p&gt;Please note that if you apply for a position with this Trust, you will be contacted via our candidate portal or via email. This includes invites for job interviews. We therefore recommend that you regularly check your candidate portal and email accounts.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGeorgina HirshJob titleChief Pharmacy Technician - Education &amp; TrainingEmail addressgeorgina.hirsh@nuh.nhs.ukTelephone number0115 969 1169 Ext 83435(QMC) or 56677(City)Additional contact information&lt;/p&gt;\n&lt;p&gt;Pamela Crawford, Chief Pharmacy Technician – Ward Service Manager, Telephone number: 0115 969 1169 Ext: 65780 (QMC), Email: pamela.crawford@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen&#39;s Medical Centre, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Lead Pharmacy Technician – Education &amp; Training", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254504", "validThrough": "2020-11-17T23:59:59+0000"}