{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-23T14:00:50+0100", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for an enthusiastic band 6 RMN or OT to contribute to the development of older adult mental health services. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post is suitable for registered nurses or OTs with at least 2 years experience working with older adults with mental health difficulties. You will need to have demonstrated skills and expertise in carrying out a variety of mental health needs assessments and be able to plan and execute interventions, both with individuals, their carers and groups. You will need to be clinically confident and competent in working with individuals in community settings and be able to work effectively in a multi-professional context. You should have collaborative and enthusiastic styles as well as have a passion and commitment to develop and promote service provisions for older adults with mental health and dementia related needs. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post requires that you are good communicator and are able to adopt a flexible, adaptable and proactive approach to your work. As well as providing specialist assessment and treatment within the CMHSOP you will be taking a lead role in memory clinic providing initial assessments, pre and post diagnostic support and treatment for people being diagnosed with dementia. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be benefiting from encouragement to continue to develop your own specialist skills, knowledge and competence through participation, reflection, supervision and training and your development will be guided using the trust’s appraisal process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Informal discussions or visits are encouraged. Please contact Brenda Allerton, Team Leader on&lt;/p&gt;\n&lt;p&gt;ballerton@nhs.net or call her on 01843 267071&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Elmstone Unit, Margate", "postalCode": "CT9 4BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3765", "longitude": "1.38665"}}, "title": "Community Mental Health Nurse/Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240831", "validThrough": "2020-11-08T23:59:59+0000"}