{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34728", "minValue": "32910", "unitText": "YEAR", "value": "£32,910 to £34,728 per annum"}}, "datePosted": "2020-10-28T10:24:53+0000", "description": "&lt;p&gt;&lt;strong&gt;Occupational Therapist (Level 2) &lt;/strong&gt;&lt;strong&gt;60050 SSAE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Attleborough&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£32,910 to £34,728 per annum (Scale J&lt;/strong&gt;&lt;strong&gt;)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37&lt;/strong&gt;&lt;strong&gt; hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent contract &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a qualified and registered experienced Occupational Therapist to work in the Southern locality team. Whilst currently predominantly working from home due to Covid-19, there are office bases at Dereham Hospital / County Hall / Attleborough.&lt;/p&gt;\n&lt;p&gt;It is an exciting time for Occupational Therapy in Adult Social Care, the focus of the Care Act on strengths-based assessments and the priority of preventing, reducing or delaying the need for formal care services places OTs at centre stage.  We have a county Principal Occupational Therapist who is driving forward developing and maximising the contribution of OTs in Norfolk Social Care.&lt;/p&gt;\n&lt;p&gt;We are seeking an Occupational Therapist to work innovatively with colleagues to improve service delivery. We are a supportive and friendly team, working with people with complex needs living with disability and/or long-term conditions in the community. We have established a good relationship with our Southern community therapy NHS colleagues and are in the process of developing a more integrated approach to triage of referrals for occupational therapy, with the aim of ensuring an improved experience for the person requiring occupational therapy input and removing duplication.&lt;/p&gt;\n&lt;p&gt;An understanding of how housing adaptations and equipment can help to maximise functional independence and experience in assessing moving and handling of people in a community setting is an advantage. Also, the ability to use skills in establishing a rapport with people and core OT skills to enhance the person&#39;s ability to engage in the occupations they want or need to.&lt;/p&gt;\n&lt;p&gt;We offer the opportunity to work and develop in an experienced team with regular supervision and opportunities for targeted professional development.&lt;/p&gt;\n&lt;p&gt;You will need excellent communication, record keeping and keyboard skills, along with experience of working with vulnerable people who require care and support. In addition, you should have a commitment to excellent customer service and an ability to manage a high turnover of work in an organised and efficient way.&lt;/p&gt;\n&lt;p&gt;You should be familiar with the Care Act 2014 and its impact on working as a Social Care Occupational Therapist together with other relevant legislation.&lt;/p&gt;\n&lt;p&gt;For an informal discussion regarding this vacancy, please contact Angela White, Team Manager, on 01603 224079 or Katie St John Clarke, Practice Consultant, on 01953 450774.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129523"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Attleborough", "postalCode": "NR17 2AH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5183", "longitude": "1.01791"}}, "title": "Occupational Therapist (Level 2)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246041", "validThrough": "2020-11-15T23:59:59+0000"}