{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-20T17:15:17+0100", "description": "&lt;p&gt;&lt;strong&gt;Pharmacists Required for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Integrated Urgent Care (IUC) - Clinical Assessment Service (CAS)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 and Band 8a (depending on qualifications and experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for IUC/CAS Pharmacists to join our Clinical Assessment Service to work as an expert resource for medicines, toxicology, medicines optimisation and pharmaceutical care aspects of the multidisciplinary team workload.&lt;/p&gt;\n&lt;p&gt;The CAS is a team of multidisciplinary clinicians including Pharmacists, Doctors, Advanced Practitioners – nurses and paramedics providing patient support through the 111 service. Pharmacists provide an expert resource for medicines, toxicology, medicines optimisation and pharmaceutical care aspects of the CAS workload.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake telephone assessment of patients regarding all aspects of care relating to pharmaceutical advice.&lt;/p&gt;\n&lt;p&gt;You will contribute to reductions in medicine-related GP and acute care referrals by supporting patients to get the best outcomes from their medicines through shared decision-making, education and reassurance; identifying and addressing medicines-related issues, undertaking minor ailments triage and providing self-care advice. Qualified independent prescribers would be expected to undertake electronic prescribing.&lt;/p&gt;\n&lt;p&gt;You will maintain high quality standards and governance and work to ensure the most appropriate patient journey.&lt;/p&gt;\n&lt;p&gt;You will work as a fully integrated member of the clinical multi-disciplinary IUC/CAS team, having access to other healthcare professionals, specialist medicines resources, service record systems, access to admin/office support and training/development opportunities and will undertake unsocial hours.&lt;/p&gt;\n&lt;p&gt;The role requires excellent organisation skills, leadership skills, a patient-centred approach, strong communication and influencing skills, along with resilience, and an ability to secure engagement from staff and service users.&lt;/p&gt;\n&lt;p&gt;If you would like any further information or an informal conversation regarding this position, please contact&lt;/p&gt;\n&lt;p&gt;Clare Bannister – Strategic Head of Operations clare.bannister@neas.nhs.uk Rosie England – Chief Pharmacist rosie.england@neas.nhs.uk&lt;/p&gt;\n&lt;p&gt;Also please refer to the full job description and person specification attached.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "North East Ambulance Service NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121056"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle upon Tyne", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Urgent Care Advanced Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235409", "validThrough": "2020-11-26T23:59:59+0000"}