{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16328", "minValue": "13283", "unitText": "YEAR", "value": "£13,283 to £16,328 p.a."}}, "datePosted": "2020-10-27T13:30:57+0000", "description": "&lt;p&gt;An opportunity has arisen in the Poole Community Learning Disabilities Team for a part time, 20 hours per week Band 5 Occupational Therapist to provide maternity cover.&lt;/p&gt;\n&lt;p&gt;The Poole Community Learning Disabilities Team is part of the Bournemouth, Christchurch and Poole LD service. This post will be based in Poole but may require flexibility across Bournemouth and Christchurch where required.&lt;/p&gt;\n&lt;p&gt;At present due to Covid 19 many of our staff are working based from home but are still required to complete Clinical visits with PPE.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic, forward thinking OT who can adapt to changing priorities and deliver high quality care.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have experience of working in partnership with people with learning disabilities, their families and carers and supporting them to live successfully in the community. You will be committed to improving outcomes for our service users and have excellent interpersonal and communication skills. In return we will offer excellent training opportunities that support your CPD requirements.&lt;/p&gt;\n&lt;p&gt;The Learning Disability Service in Dorset is staffed by passionate and dedicated people and we are looking for a like-minded OT who wants to join us. This is an exciting opportunity to practice within the challenging yet rewarding field of community learning disability healthcare.&lt;/p&gt;\n&lt;p&gt;Please can prospective candidates read the job description and personal specification carefully before applying for this position and make sure that you meet the requirements.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Car owner/driver essential, subject to the provisions of the Equality Act (2010)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;COMMITTED TO EQUALITY AND DIVERSITY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal enquiries and visits are encouraged.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Cas Stanley, Occupational Therapist at casstanley@nhs.net / 07917215243&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole", "postalCode": "BH17 8WG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7475", "longitude": "-1.96782"}}, "title": "Occupational Therapist, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244731", "validThrough": "2020-11-10T23:59:59+0000"}