{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa, based on full time hours"}}, "datePosted": "2020-10-27T14:15:30+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen to work at the Southern Health NHS Foundation Trust Recovery College. Established in 2013, the College now has approximately 2000 enrolled students and offers courses based on self-management and recovery for the adult mental health division. As the College grows and develops, the team requires additional administrative support to assist with the day to day running of the College.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post is 37.5 hours per week and it is based at the Recovery College at Thomas Lewis House. The working pattern for this post will be 09.00 to 17.00 Monday to Friday.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role of Administrator with the Recovery College will require the applicant to undertake a diverse range of administrative and clerical duties. The post holder will be a main point of contact for enquiries about the College, assist with the management of the enrolment and booking system as well as supporting the trainers by preparing their course materials. It is essential that applicants have experience of working in a busy office environment. Knowledge of academic /educational process would be an advantage and the ability to multi task with excellent attention to detail is essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like further information or an informal chat about the role please contact Pauline Lewis (Administration Manager) on 02382 310262.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that this advert may be closed before the deadline if a large number of applications are received.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Happy to Talk Flexible Working - all requests for flexible and part time working will be considered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Follow us on Facebook and on Twitter: &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;facebook.com/SouthernHealthNHS&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;@Southern_NHSFT&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO30 3JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9278", "longitude": "-1.32524"}}, "title": "Recovery College Administrative Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244904", "validThrough": "2020-11-10T23:59:59+0000"}