{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a."}}, "datePosted": "2020-11-04T12:01:27+0000", "description": "&lt;p&gt;The Dorset Paediatric Speech and Language Therapy Service is seeking an enthusiastic, forward thinking team player to join our friendly and supportive team of speech and language therapists in the beautiful County of Dorset, working for an Outstanding NHS Trust (CQC 2019).&lt;/p&gt;\n&lt;p&gt;We are looking for newly qualified therapists or a therapists with some experience who would like to build on their skills in community clinics and schools to replace a member of our team who is moving to pastures new. Bank contracts are also available for suitable candidates.&lt;/p&gt;\n&lt;p&gt;We offer the opportunity to develop your skills working with preschool, primary and secondary aged children. Our staff work with a varied paediatric client group which includes children and young people with Developmental Language Disorder, Dysfluency, Selective Mutism, Developmental Verbal Dyspraxia, Autism Spectrum Disorder, Complex Needs, Speech Disorder and Speech and Language delay.&lt;/p&gt;\n&lt;p&gt;We offer exceptional support with, team leads for management support, and a range of clinical lead specialists available for advice and guidance, as well as peer support groups and 1:1 clinical supervision. There are excellent opportunities to access formal and informal training. New initiatives are always welcome, and taken forward within the context of a Professional Development Group.&lt;/p&gt;\n&lt;p&gt;Nursing accommodation for staff relocating to the area is available at Poole Hospital.&lt;/p&gt;\n&lt;p&gt;Employment in these posts require an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 01 December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be advised that interviews will be conducted via video link.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Emma Draper, Bournemouth North and Central Cluster Lead at e.draper@nhs.net / 07786110281.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bournemouth", "postalCode": "BH1 4JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7293", "longitude": "-1.84147"}}, "title": "Paediatric Speech and Language Therapist, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255719", "validThrough": "2020-11-18T23:59:59+0000"}