{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40800", "minValue": "40800", "unitText": "YEAR", "value": "£40,800 ( nights +20%,Bank Holidays +50%)"}}, "datePosted": "2020-10-29T16:28:06+0000", "description": "&lt;p&gt;Are you?&lt;/p&gt;\n&lt;p&gt;A driven and dynamic Nurse?&lt;br /&gt;An experienced Charge Nurse or Deputy Ward Manager wanting to progress to the next level?&lt;br /&gt;Wanting to make a difference to someone’s life?&lt;br /&gt;Ready for a new challenge?&lt;br /&gt;Wanting to work with the best nurses in the UK?&lt;/p&gt;\n&lt;p&gt;If you’ve answered yes to the above then get in touch with our nurse Recruiter Adam O&#39;Shea today on 07834514945 and make the first step towards your exciting future with The Priory. &lt;strong&gt;About The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Priory Hospital Hayes Grove is looking for an enthusiastic and highly-motivated individual with proven clinical and managerial experience as a Ward Manager/ Deputy Ward Manager or Charge nurse, to motivate, inspire and lead the Keston unit team in achieving high standards and promoting patient safety.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for the line management and supervision of all the registered nurses and healthcare assistants. They must be a good and effective communicator and demonstrate problem solving skills with the ability to work under pressure to manage staff and deliver patient focused care.&lt;/p&gt;\n&lt;p&gt;The candidate must demonstrate knowledge and skills in caring for adults with an Autistic Spectrum Condition and enduring mental illness ensuring that both their mental and physical health needs are met. They must be able to ensure that the nursing and healthcare staff on the ward are providing care to the expected standards while ensuring a understanding a knowledge of all the relevant polices and regulations within this role.&lt;/p&gt;\n&lt;p&gt;Further to this the successful candidate will work closely with the Director of clinical services to ensure and demonstrate the delivery of a high standard of care in a safe, compassionate, responsive, effective and well led environment.&lt;/p&gt;\n&lt;p&gt;The Priory Hayes Grove offers a range of benefits including 25 days annual leave plus bank holidays pro rata, your Birthday as an extra days annual leave, online benefits and cashback rewards and subsidised meals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Hayes Grove:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Providing Quality, inspiring Innovation and delivering Value is what we set out to achieve at Priory Healthcare. Through the knowledge and expertise of our multidisciplinary clinical teams, we enable patients with mental health difficulties to receive a truly integrated and holistic approach to their treatment, regardless of complexity or severity.&lt;/p&gt;\n&lt;p&gt;The Priory Hospital Hayes Grove is an independent 46-bed psychiatric hospital for Working Age Adults (mixed), located in SE London in the quiet village of Hayes, Kent. We provide Inpatient, Daycare and Outpatients services for patients with a wide range of Mental Health challenges.&lt;/p&gt;\n&lt;p&gt;Our private ‘Lower Court’ ward specialises in caring for patients receiving treatment for General Psychiatric conditions, and supports patients on our 28-day Inpatient Addiction Treatment Programme (drug, alcohol and other addictions). We also have a specialist, 20-bed NHS England-funded Eating Disorder Unit and the 9-bedded Keston Unit, a specialist NHS-funded Asperger’s ward.&lt;/p&gt;\n&lt;p&gt;The Hospital is situated in a leafy, semi-rural setting, with excellent public transport links to central London, Croydon and surrounding areas in the London Borough of Bromley. Free car parking is available in the immediate vicinity of the hospital.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bromley, Kent", "postalCode": "BR2 7AS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3728", "longitude": ".013892"}}, "title": "Ward Manager, (Adult Autistic Spectrum Ward)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249074", "validThrough": "2020-11-12T23:59:59+0000"}