{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a inclusive of HCA"}}, "datePosted": "2020-10-27T10:31:23+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within Evelina London Children’s Hospital for an enthusiastic and dedicated Senior Sleep Physiologist.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced sleep physiologist with a Degree in Biology/Physiology/PTP/Healthcare Science or similar who is able to manually sleep stage, score and set up overnight in-patient polysomnography (ranging from respiratory to full 10:20 EEG) for all ages up to 16yrs. The successful candidate will be able to perform and score multiple sleep latency tests as well as participate in all out-patient cardiorespiratory, oximetry and actigraphy clinics including issuing, downloading and analysis. RPSGT or equivalent is desirable.&lt;/p&gt;\n&lt;p&gt;The Children&#39;s Sleep and Respiratory Centre is multidisciplinary. It comprises of a dedicated children’s respiratory assessment service and an internationally respected centre of excellence for the investigation and treatment of sleep disorders. We cater for infants and children of all ages and part of the Guys and St Thomas’ Lifespan Sleep Group.&lt;/p&gt;\n&lt;p&gt;We perform more than 3000 sleep studies per year including oximetry, capnography, actigraphy, cardiorespiratory and full polysomnography with multiple sleep latency testing, in our dedicated facilities or at the patients’ home, as appropriate. We have the ability to combine sleep studies with full EEG. Supporting the long term ventilation service has been a recent development and we have expanded our facilities next to their purpose built ward to accommodate our increasing demand and improve our patient’s experience.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Closing date: 8th November 2020 at Midnight&lt;br /&gt;Interviews will be held on Tuesday 17th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKiran van den EshofJob titleChief Sleep PhysiologistEmail addresskirandeep.vandeneshof@gstt.nhs.ukTelephone number02071883427&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Thomas&#39; Hospital, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Senior Clinical Physiologist (Sleep)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244013", "validThrough": "2020-11-08T23:59:59+0000"}