{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 per annum"}}, "datePosted": "2020-11-05T12:30:18+0000", "description": "&lt;p&gt;JOB TITLE: Highly Specialised Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;DEPARTMENT: Community Mental Health Team (CMHT)&lt;/p&gt;\n&lt;p&gt;LOCATION/BASE ADDRESS: Lead Psychologist for East Lincolnshire CMHTs. Base could be Louth or Skegness CMHT, depending upon preference&lt;/p&gt;\n&lt;p&gt;BAND AND SALARY: Band 8b&lt;/p&gt;\n&lt;p&gt;NUMBER OF HOURS: 1.0 wte (37.5 hours per week)&lt;/p&gt;\n&lt;p&gt;TEMP/PERM (END DATE IF FIXED TERM): Permanent contract&lt;/p&gt;\n&lt;p&gt;We are looking for a committed and dynamic Clinical Psychologist to provide the Lead Psychologist role for the psychological provision of the East Lincolnshire Community Mental Health Teams (Boston, Louth &amp; Skegness CMHTs). Clinical work could be based in either the Louth or Skegness CMHT, depending upon preference. The Trust is also open to remote and flexible working possibilities as part of this role.&lt;/p&gt;\n&lt;p&gt;The Community Mental Health Teams are located within the Adult Community Mental Health Division and our mission is to provide high quality psychological services to adults who live in Lincolnshire.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be working within the integrated community teams, providing services for individuals of working age and beyond, implementing evidence-based psychological interventions for clients with a range of difficulties.&lt;/p&gt;\n&lt;p&gt;The post will involve liaison with other professions within the mental health service, including Mental Health Nurses, Cognitive Behavioural Psychotherapists, Assistant and Trainee Clinical Psychologists, Support Workers and Peer Support Workers, therefore communication and team-working skills are essential. The post holder will be encouraged to contribute to service development, and there will be opportunities for provision of clinical supervision. There are good links with the Trent Clinical Psychology course and professional development is actively encouraged.&lt;/p&gt;\n&lt;p&gt;This post provides an ideal opportunity for an existing Band 8a who is ready to embark upon career progression and development. The current post provides an ideal opportunity to work in a leadership position within the Clinical Psychology and wider psychotherapy workforce.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Louth or Skegness Community Mental Health Teams", "postalCode": "LN11 0LF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3766", "longitude": "-.007557"}}, "title": "Highly Specialised Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257656", "validThrough": "2020-11-20T23:59:59+0000"}