{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T14:30:37+0000", "description": "&lt;p&gt;An opportunity has arisen for a Community Senior Practitioner (Registered Mental Health Nurse, Occupational Therapist, Social Worker) to join the West Integrated Community Mental Health Team in the Hambleton and Richmondshire Locality. The West ICMHT covers a large geographical area in Richmondshire and the Dales with the team based in Colburn.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit an enthusiastic, motivated and experienced clinician to deliver assessment, care co-ordination and treatment/intervention within an integrated multidisciplinary team. The successful candidates will be able to demonstrate strong assessment/clinical/therapeutic skills delivering care/treatment to individuals living with complex mental health needs over a variety of environments and across a large geographical area. Linked to the geography of the patch there would be an expectation that the successful applicant would have the ability to convey themselves to and from base to home visits.&lt;/p&gt;\n&lt;p&gt;The post holder will be joining post service transformation in Hambleton and Richmondshire where service delivery is working towards enhanced hours and a six day service. The post holder would be expected to demonstrate a flexible and adaptable approach and with the advent of COVID-19 to demonstrate the use of technology to support new ways of working. This is a fantastic opportunity for both individuals looking to gain experience at a Band 6 level, as well as those with existing experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joanne Fawcett on joanne.fawcett@nhs.net&lt;/p&gt;\n&lt;p&gt;Cayla Burnside on cayla.burnside@nhs.net&lt;/p&gt;\n&lt;p&gt;01748907030&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colburn Medical Centre, Colburn", "postalCode": "DL9 4GA"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3792", "longitude": "-1.68276"}}, "title": "Senior Community Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254344", "validThrough": "2020-12-06T23:59:59+0000"}