{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36000", "minValue": "32000", "unitText": "YEAR", "value": "£32,000 - £36,000 plus £5,000 Welcome Bonus"}}, "datePosted": "2020-10-14T10:21:15+0100", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt;Job Advert Location Description&lt;/p&gt;\n&lt;p&gt;Mildmay Oaks is a low secure and locked rehabilitation service for men with learning disability and autism spectrum disorder, and for women with learning disability.&lt;/p&gt;\n&lt;p&gt;We are 2 minutes from Winchfield Train Station and we offer a taxi service in the winter to and from the station.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job Advert Role Description&lt;/p&gt;\n&lt;p&gt;Main Duties:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Works as Senior Nurse in a Ward or equivalent area ensuring a safe and therapeutic environment for patients, their families and visitors.&lt;/li&gt;\n&lt;li&gt;Applies relevant policies and statutory requirements within the ward and hospital framework of governance and communicates requirements to the wider team.&lt;/li&gt;\n&lt;li&gt;Ensures that risk is assessed and managed across the immediate and wider working environment and that statutory requirements are met.&lt;/li&gt;\n&lt;li&gt;Respects and applies the requirements of equality and diversity, promoting and role modelling these across the team.&lt;/li&gt;\n&lt;li&gt;Identifies deficits in skill mix and safe staffing levels and acts to address these.&lt;/li&gt;\n&lt;li&gt;Supervises a defined group of team members and contributes to their overall CPD, mandatory training and appraisal process recognising the skills required across the team. This will also include addressing any performance issues that are below the expected standard.&lt;/li&gt;\n&lt;li&gt;Acts as a role model to promote a culture of learning development, inquiry and a team vision.&lt;/li&gt;\n&lt;li&gt;Implements, monitors and evaluates therapeutic interventions within an overall care programme, enabling people with mental health and or learning disability needs to develop coping strategies.&lt;/li&gt;\n&lt;li&gt;Actively supports and contributes to effective Multi Disciplinary Working&lt;/li&gt;\n&lt;li&gt;Engages in collaborative problem solving, supporting and encouraging clients to take ownership of issues, identify problems and to develop solutions to them based on their own needs and preferences.&lt;/li&gt;\n&lt;li&gt;Contributes to the process of collaboratively assessing and acting on risks of harm, danger and abuse.&lt;/li&gt;\n&lt;li&gt;Is named nurse for a small group of patients, acting as Associate nurse for colleagues when on duty, and is a regular shift leader.&lt;/li&gt;\n&lt;li&gt;Provides Clinical Supervision to a group of defined nursing staff&lt;/li&gt;\n&lt;li&gt;Undertakes Lead roles for the ward, as agreed with the Ward manager&lt;/li&gt;\n&lt;li&gt;Deputises for the Ward manager as required&lt;/li&gt;\n&lt;li&gt;Adheres to all National, Company and local standards, policies and procedures&lt;/li&gt;\n&lt;li&gt;To promote understanding of Clinical governance within the ward nursing team.&lt;/li&gt;\n&lt;li&gt;To promote understanding of and engagement in the principals of Recovery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits including:&lt;/p&gt;\n&lt;p&gt;• Competitive salary&lt;/p&gt;\n&lt;p&gt;• 25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/p&gt;\n&lt;p&gt;• Extra Service Annual leave awards&lt;/p&gt;\n&lt;p&gt;• Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/p&gt;\n&lt;p&gt;• A contributory pension scheme&lt;/p&gt;\n&lt;p&gt;• An employee assistance programme&lt;/p&gt;\n&lt;p&gt;• Free meals/refreshments when on duty&lt;/p&gt;\n&lt;p&gt;• Free car parking&lt;/p&gt;\n&lt;p&gt;• Sign on bonus&lt;/p&gt;\n&lt;p&gt;£1000 on joining&lt;/p&gt;\n&lt;p&gt;£1000 after 6m probation&lt;/p&gt;\n&lt;p&gt;£1000 after 1 year service&lt;/p&gt;\n&lt;p&gt;£1000 after 2 years’ service&lt;/p&gt;\n&lt;p&gt;£1000 after 3 years’ service&lt;/p&gt;\n&lt;p&gt;Total = £5000 over 3 years&lt;/p&gt;\n&lt;p&gt;• Relocation support (including payment for accommodation or moving costs), paid as a lump sum&lt;/p&gt;\n&lt;p&gt;• Moving less than 100 miles up to £2,000&lt;/p&gt;\n&lt;p&gt;• If more than 100 miles up to £4,000&lt;/p&gt;\n&lt;p&gt;• To be repaid if individual does not complete probation &amp; leaves&lt;/p&gt;\n&lt;p&gt;• Payment into the pension scheme&lt;/p&gt;\n&lt;p&gt;• CPD top up&lt;/p&gt;\n&lt;p&gt;• Donation to a charity of their choice&lt;/p&gt;\n&lt;p&gt;Division DBS info&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hook, Hampshire", "postalCode": "RG27 8BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2921", "longitude": "-.912542"}}, "title": "Deputy Ward Manager With £5,000 Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225695", "validThrough": "2020-11-13T23:59:59+0000"}