{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T11:46:28+0000", "description": "&lt;p&gt;The Radiology Department of Western Sussex Hospitals NHS Foundation Trust has an opportunity for a Band 6 Radiographer to join their friendly multidisciplinary team. This role is based at Worthing and Southlands Hospitals but there may be occasion for cross site working at St Richard’s Hospital, Chichester. Please note this is a full time permanent post.&lt;/p&gt;\n&lt;p&gt;Worthing Hospital, as part of Western Sussex Hospitals Foundation Trust, provides a full range of general acute hospital services including A&amp;E, maternity, outpatients, day surgery and intensive care. It is also home to the West Sussex Breast screening service. We have been rated “Outstanding” by the CQC. Last year the radiology departments of Western Sussex performed over 310,000 x-rays and scans. The Radiology department provides a variety of x-rays, interventional, cardiac and scanning examinations for GP’s outpatients, inpatients and accident and emergency.&lt;/p&gt;\n&lt;p&gt;Worthing Radiology department consists of five fully digital x-ray rooms, three fully digital portable x-ray units, one dental and two fluoroscopy rooms, including an interventional suite, and two CT scanners. There are two further digital x-ray rooms at Southlands Hospital. We provide theatre cover with our Image intensifiers for a wide range of procedures. We provide 24 hour imaging cover and so commitment to the out of hours rota is required.&lt;/p&gt;\n&lt;p&gt;We ask that you provide exceptional clinical and professional standards, consistently deliver the highest quality patient-focused care to our service users, and demonstrate evidence of ongoing CPD. A comprehensive training and induction programme will be offered.&lt;/p&gt;\n&lt;p&gt;Suitable experience of working within the NHS as well as a general background in a broad range of imaging, is essential for this role. We require all radiographers to have a positive attitude to team working and good organisational and communication skills.&lt;/p&gt;\n&lt;p&gt;Please note that all applicants for the post must hold a BSc in Diagnostic Radiography or the Diploma of the College of Radiographers or equivalent and have current HCPC registration.&lt;/p&gt;\n&lt;p&gt;Our departments are focused on providing an excellent level of service for our patients and a supportive environment for our staff. We are pleased to provide clinical placements for undergraduate radiographers and we are committed to their learning and development.&lt;/p&gt;\n&lt;p&gt;In common with many imaging departments we provide seven day services, therefore extended working days, weekends, on call duties and flexible working are requirements of the successful candidate.&lt;/p&gt;\n&lt;p&gt;Please feel free to contact us if you would like an informal visit. We look forward to meeting you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSam FisherJob titleSuperintendent RadiographerEmail addresssam.fisher3@nhs.netTelephone number01903285222 Ex 84820&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121075.png", "name": "Western Sussex Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worthing Hospital, Worthing", "postalCode": "BN11 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8167", "longitude": "-.364296"}}, "title": "Senior Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257511", "validThrough": "2020-11-19T23:59:59+0000"}