{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-07T13:00:22+0100", "description": "&lt;p&gt;Our CIS Transformation Officers work within the IM&amp;T Department supporting the use of our clinical system, SystmOne.&lt;/p&gt;\n&lt;p&gt;Are you well-organised and enthusiastic? Are you experienced in leading in various aspects of clinical system changes and enhancements? We could be looking for you.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work closely with team colleagues, system end users and stakeholders to establish requirements; carry out resultant system configuration changes and deliver confident classroom and virtual based training to consolidate the process.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be required to liaise with third party suppliers in developing/reviewing technical specifications and in conducting investigations into complex system related issues. We’d also like you to be innovative, forward thinking and committed to continuous improvement. You will report directly to the Clinical Information Systems Manager and work closely with key stakeholders in supporting the delivery of the Trust’s transformation programmes.&lt;/p&gt;\n&lt;p&gt;To be successful, it is essential for the candidate to be educated to degree level in a relevant discipline or have substantial experience in an IM&amp;T role with demonstrable previous small project and system change management experience; have a willingness to learn and develop further; to demonstrate first rate interpersonal/communication skills and possess the ability to interpret clinical service business requirements.&lt;/p&gt;\n&lt;p&gt;In addition, the post holder must have demonstrable experience in creating on-line training material using Captivate or similar Elearning packages, have produced lesson plans, user guides and other associated training materials. They must also have effective training delivery experience and enjoy presenting. The ability to present information to a range of audiences is essential.&lt;/p&gt;\n&lt;p&gt;The successful applicant will also have the ability to rise to new challenges, operate independently yet be an excellent team player; apply concentrated effort to complex tasks and deliver high quality work to tight deadlines. This is a challenging and rewarding role for someone who wants to make a difference to frontline clinical services.&lt;/p&gt;\n&lt;p&gt;The post is based within IM&amp;T in Barnsley but will be required to work across all of the Trust’s geographical areas.&lt;/p&gt;\n&lt;p&gt;For further information and an informal discussion please contact Louise Maden, Clinical Information Systems Manager on 07917 474 696 or Julie Hirst, Clinical Systems Transformation Manager on 0755 433 4743.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S70 3RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.547", "longitude": "-1.45462"}}, "title": "Clinical Information Systems Transformation Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216583", "validThrough": "2020-11-16T23:59:59+0000"}