{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Pro Rata, Per Annum"}}, "datePosted": "2020-10-21T16:16:39+0100", "description": "&lt;p&gt;Somerset NHS Foundation Trust are seeking to appoint a Consultant Neurologist to join our team, where you will work with four dynamic and forward thinking Neurologists in the county of Somerset. Epilepsy expertise would be preferred but any sub-specialty interest would be considered. The successful applicant will work as part of the Neurology team rotating between inpatient or outpatient based clinical duties. The job is based at Musgrove Park Hospital in Taunton but will also involve visiting Yeovil District Hospital on the east side of the County one day per week.&lt;/p&gt;\n&lt;p&gt;Specialty education meetings take place once a week at Southmead Hospital in Bristol (currently attended online) and the post will also involve commitments to undergraduate and postgraduate education.&lt;/p&gt;\n&lt;p&gt;Musgrove Park Hospital in Taunton is a successful, progressive and ambitious District General Hospital, the largest in Somerset providing acute and community services to 330,000 people living in Somerset. Musgrove Park Hospital is a Foundation Trust which employs 4,000 staff, has approximately 550 beds and in addition to usual District General Hospital services, there is also Vascular Surgery, Spinal Surgery, Paediatrics, ENT, Maxillofacial surgery and Ophthalmology on site.&lt;/p&gt;\n&lt;p&gt;Musgrove Park Academy is the focus of medical education in the Trust, and also houses a high fidelity simulator suite. Musgrove Park was recently assessed as good by the Care Quality Commission (CQC).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can we offer?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The freedom to develop a specialist area – we will support any specialist interest that is complimentary to the current service&lt;/li&gt;\n&lt;li&gt;Close links to Bristol Neurosciences Centre, including Neurosurgery Service&lt;/li&gt;\n&lt;li&gt;Weekly academic meetings take place at the Neurosciences Centre in Southmead Hospital, Bristol&lt;/li&gt;\n&lt;li&gt;We provide Neurology teaching at Musgrove Park to Bristol and Plymouth medical students&lt;/li&gt;\n&lt;li&gt;Local neurorehabilitation provided at the Somerset Neuro Rehab Centre&lt;/li&gt;\n&lt;li&gt;Separate Stroke thrombolysis service run independently of neurology department&lt;/li&gt;\n&lt;li&gt;Multiple Sclerosis treatment prescribing centre&lt;/li&gt;\n&lt;li&gt;UK leading neurology advice and guidance system, providing next day neurological advice to Somerset GPs&lt;/li&gt;\n&lt;li&gt;Potential for research opportunities and clinical trials.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;On Call&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is no on call requirement with this position; there is also no requirement to cover acute stroke service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All applicants must either be on the GMC specialist register or within 6 months of obtaining such at the time of interview.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Somerset NHS Foundation Trust is the first NHS trust on the English mainland to provide community, mental health and acute hospital services. We work with health and social care partners in Somerset to ensure that we deliver outstanding services that meet the needs of our population.&lt;/p&gt;\n&lt;p&gt;Our trust was formed on 1 April 2020 when Somerset Partnership NHS Foundation Trust and Taunton and Somerset NHS Foundation Trust merged. We provide community and mental health services across the whole of Somerset and acute hospital services in the north, west and centre of the county and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We also offer you the chance to experience life in the West Country, offering you the chance to live near some of the UK’s most desirable locations; from the beaches in North Devon and Cornwall, to the cosmopolitan centres of Bristol, Bath and Exeter, whilst also being less than 2 hours from London. The County town of Taunton has diverse shopping, restaurants, and regularly hosts international music and sporting fixtures. Somerset also offers some of the best schools in the country from Public Institutions such as Millfield, Queens College, Taunton School, Kings College, Wellington School and Blundell’s, to award winning state school such as the Richard Huish College.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please contact Dr Simon Shields, Consultant Neurologist and Clinical Service Lead on 01823 342 139 or Simon.Shields@somersetft.nhs.uk.&lt;/p&gt;\n&lt;p&gt;Please contact Lorna Brown, Neurology Service Manager on 01823 342660 or Lorna.Brown1@SomersetFT.nhs.uk&lt;/p&gt;\n&lt;p&gt;To discuss the application process please contact Jordan Pollard, Medical Recruitment Consultant on 07765898212 or jordan.pollard@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Consultant Neurologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237258", "validThrough": "2020-11-19T23:59:59+0000"}