{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-22T16:15:26+0100", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse – Cardiology (registered and newly qualified)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the UK’s leading heart and lung hospital, we are seeing an increased demand for our services. In cardiology, we are opening a new ward area and are looking for new nurses to join our team.&lt;/p&gt;\n&lt;p&gt;If you’re a newly qualified or experienced nurse with an interest in cardiology and a passion for delivering excellent, innovative care, now could be a great time to join us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why join Royal Papworth Hospital?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a cardiology nurse at Royal Papworth Hospital, you will be part of a friendly ward team who will support you as you settle into your new role. You’ll also have the support of our incredible education team who provide regular on-site training as well as opportunities to attend study days with our partners at Anglia Ruskin University.&lt;/p&gt;\n&lt;p&gt;You’ll never be bored: the dynamic nature of our work means you’ll be dealing with ever changing priorities. And you’ll be involved in truly innovative procedures - we regularly perform first-in-the UK or world-first procedures and are constantly look for new ways to improve patient care.&lt;/p&gt;\n&lt;p&gt;In addition to rewarding work and a friendly team, you’ll also be working in a great environment. Our new, purpose-built hospital is light, clean and spacious, and our cardiology wards have incredible views over the Cambridge Biomedical Campus.&lt;/p&gt;\n&lt;p&gt;Nurses appointed to this role will receive a £1,000 welcome payment.*&lt;/p&gt;\n&lt;p&gt;For information please contact:&lt;/p&gt;\n&lt;p&gt;Steven Thurston, Charge Nurse: Direct Line: 01223 638263 / mobile: 07775548250&lt;/p&gt;\n&lt;p&gt;Rebecca Thomas, Ward Sister: Direct Line 01223 638575 / mobile: 07775548254&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Regular shortlisting takes place and you will be contacted for a Skype interview if you are shortlisted for interview.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What our nurses say…..&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;“We are proud of the work we do caring for our patients through a multitude of invasive and non-invasive cardiac procedures and investigations”&lt;/li&gt;\n&lt;li&gt;“We are an incredible team and we are committed to giving our all to support the best patient outcome.”&lt;/li&gt;\n&lt;li&gt;“Cardiology is a stimulating and thrilling place to work.”&lt;/li&gt;\n&lt;li&gt;“We feel empowered because of the leadership and support we receive.”&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What our patients say…..&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;“During the operation all of the doctors and nurses assured me of the safe process which was completed as planned. Excellent 5 star job done.”&lt;/li&gt;\n&lt;li&gt;“The facilities at Royal Papworth are superb - a wonderful hospital. The staff - all staff, make Royal Papworth a top class experience.”&lt;/li&gt;\n&lt;li&gt;“Staff were friendly, welcoming, helpful and professional. I felt relaxed and at ease during my visit because of the superb way I was treated by all staff - a credit to Royal Papworth and the NHS.”&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;*The £1,000 welcome payment is applicable to those who commence on substantive contracts with a commitment to remain with the Trust for a minimum of 12 months (excludes bank contracts).&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121322.jpg", "name": "Royal Papworth Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121322"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Papworth Hospital, Papworth Road, Cambridge Biomedical Campus, Cambridge", "postalCode": "CB2 0AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1726", "longitude": ".136208"}}, "title": "Staff Nurse B5 -Cardiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239285", "validThrough": "2020-11-29T23:59:59+0000"}