{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive salary plus benefits"}}, "datePosted": "2020-11-03T09:54:40+0000", "description": "&lt;p&gt;BMI Healthcare is the UK’s largest provider of independent healthcare.  With a network of hospitals across the country, our aim is to attract the best nursing, theatre and allied healthcare professionals in addition to employing outstanding non-clinical and support staff who underpin everything we do.  Being part of the wider BMI Healthcare group also offers the prospect for great career progression with opportunities throughout the UK.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BMI Princess Margaret Hospital &lt;/strong&gt;is located in the Heart of Windsor and is one of the many jewels in our crown here at BMI Healthcare. The team are dynamic and passionate about what they do, putting patient care at the centre of everything.&lt;/p&gt;\n&lt;p&gt;Being a part of BMI means that you belong to a close knit network of 58 hospitals and clinics performing more complex surgery than any other private healthcare provider in the country. The senior management team across all hospitals work closely to support and encourage best practice across the business – so you’re never alone.&lt;/p&gt;\n&lt;p&gt;As an organisation we are continually growing and developing our staff, so it’s no surprise that due to an internal promotion we now have an amazing opportunity to be a key part of our strategic growth plans&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact Mary Parfrey on 01753 743302&lt;/strong&gt; for an informal chat or more information  or If you would like to apply for this opportunity, please complete our brief online application form and ensure to upload the most recent copy of CV.  We aim to respond to your application within 14 days of the closing date.  &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently recruiting for an experienced and committed Lead Theatre Practitioner to join our fantastic team of staff in our Operating Theatre department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will put patient care at the heart of everything they do.  As a qualified practitioner with NMC or HCPC registration you will use your skills and knowledge to work well within a team, adopting a flexible and collaborative approach at all times. Whether your background is in Scrub, Anaesthetics and/or Recovery you will be keen to learn and develop new skills to further grow your career. You must also have experience in orthopaedic surgery.&lt;/p&gt;\n&lt;p&gt;Please see attached Job Description for further detailed responsibilities &amp; accountabilities of this role&lt;/p&gt;\n&lt;p&gt;This is a FULL time post and there is a flexible shift pattern in place.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join the BMI Healthcare journey and become part of a team where people matter&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Employee benefits for contracted staff also include 25 days holiday + bank holidays, Pension scheme, Private health insurance, discounted gym membership and many more exclusive discounts and incentives via our “Perks at Work” scheme – we also have free parking at most of our hospitals.&lt;/p&gt;\n&lt;p&gt;We are also committed to providing ongoing training and development to our staff via our dedicated in-house BMI Academy which offers one of the most comprehensive packages of training courses available in the private sector.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Owing to the nature of this position, any offer of employment will be subject to a satisfactory Enhanced Disclosure Check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Safeguarding&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;BMI Healthcare is fully committed to safeguarding the welfare of all children and young people, and vulnerable adults by taking all reasonable steps to protect them from harm.  All staff will receive appropriate training and induction so that they understand their roles and responsibilities and are confident about carrying them out.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BMI Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Windsor", "postalCode": "SL4 3SJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4747", "longitude": "-.610351"}}, "title": "Lead Theatre Practitioner - Scrub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253336", "validThrough": "2020-12-06T23:59:59+0000"}