{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T14:46:38+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM UNTIL 31/03/2021 TO MEET THE NEEDS OF THE SERVICE.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;***Due to the urgency of this post, Welsh language translation is not currently included, however, will be available ASAP***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The 2020/21 winter vaccination programme will be the most important campaign in recent years. Betsi Cadwaladr University Health Board needs vaccinators, or those suitably qualified who can undertake vaccinator training, urgently to help deliver one of the most vital parts of our winter preparations and preparedness. Our innovative and dynamic Immunisation teams are dedicated to improving immunisation uptake and delivering the national Welsh Immunisation Programmes. This is an exciting opportunity to join a rapidly expanding service.&lt;/p&gt;\n&lt;p&gt;The role encompasses responsibility for clinical delivery of vaccinations and patient safety, specialist advice on immunisation issues, and the opportunity to develop skills in both independent and team working.&lt;/p&gt;\n&lt;p&gt;We welcome applicants who are trained vaccinators and can demonstrate a willingness to work flexibly across North Wales and cooperatively with colleagues both within their own team and the wider multidisciplinary teams across the whole region. You will need to be motivated, conscientious and committed to supporting us to maintain high vaccination coverage.&lt;/p&gt;\n&lt;p&gt;The post holder will be part of BCUHB Immunisation Team and will be expected to offer vaccination advice and deliver vaccinations to patients and staff. The post holder will support the safe delivery of vaccines and help increase local uptake of vaccinations and may be asked to Immunise is other settings i.e. during an outbreak or mass immunisation programme. The ability to travel is essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 22/11/2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sian Oliver&lt;/p&gt;\n&lt;p&gt;sian.oliver@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East/Central/West", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Immunisation Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258176", "validThrough": "2020-11-22T23:59:59+0000"}