{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-19T11:17:00+0100", "description": "&lt;p&gt;&lt;strong&gt;Speech and Language Therapist -Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1.00 WTE (full and part time opportunities)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rehabilitation Services -&lt;/strong&gt;&lt;strong&gt;Speech and Language Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“What &lt;em&gt;you&lt;/em&gt; do makes a difference, and &lt;em&gt;you&lt;/em&gt; have to decide what kind of difference &lt;em&gt;you&lt;/em&gt; want to make”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Speech and Language Therapists help some of the most vulnerable people in our communities to live more safely and independently. If you want to make a difference to the lives of adults with acquired communication and swallowing difficulties then read on.&lt;/p&gt;\n&lt;p&gt;We are delighted to be able to offer the opportunity for a motivated team player to join our Community Adult Speech and Language Therapy team based in the heart of Coventry, UK City of Culture 2021. The successful applicant will be visiting patients in a variety of community settings: patients’ homes, care homes and outpatient clinics. You will use existing skills and experience to work with patients, family and carers to collaboratively manage dysphagia and communication difficulties. You will have the opportunity to collaboratively run clinical peer supervision and support groups to share new evidence and best practice with other team members to ensure our patients always receive the best evidence based care.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to develop existing and new skills through Value Based Appraisal, one to one meetings, regular in-service training, clinical and managerial supervision with skilled and experienced colleagues. Being based within a multi professional therapy base, you will be able to work jointly with other Allied Health Professionals to deliver patient centered, goal focused care.&lt;/p&gt;\n&lt;p&gt;If &lt;em&gt;you&lt;/em&gt; are a compassionate, dedicated team player who works well with others and is motivated by meaningful, holistic rehabilitation which is centered around patient goals and &lt;em&gt;their&lt;/em&gt; life roles; then please get in touch and help us make a real difference.&lt;/p&gt;\n&lt;p&gt;If you would like to know more about this post or our team to see if you would like to be a part of our team please contact us for more information.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Car owner/driver essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;* This post is subject to a DBS Check.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Clare Mee, Head of Rehabilitation or Camille Cline-Cole, Team Lead for Adult Community SLT&lt;/p&gt;\n&lt;p&gt;Newfield House, Kingfield Road, Coventry, CV1 4NZ. Tel: 0300 2000 396&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newfield House, Coventry", "postalCode": "CV1 4NZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4217", "longitude": "-1.50984"}}, "title": "Speech and Language Therapist - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232020", "validThrough": "2020-11-15T23:59:59+0000"}