{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27941", "minValue": "25676", "unitText": "YEAR", "value": "£25,676 - £27,941 Per Annum Inclusive"}}, "datePosted": "2020-11-06T08:17:09+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Medical Recruitment Advisor to join our busy Medical Workforce Team. The Medical Workforce Team is a multi-functional team delivering service to all medical staff at BHRUT.&lt;br /&gt;&lt;br /&gt;As an effective communicator, you will provide an efficient administrative recruitment service, ensuring compliance with department procedures and safe recruitment processes. The post holder is responsible for the facilitation of the end to end recruitment process by providing advice and guidance to hiring managers and candidates on recruitment systems and undertaking the necessary pre-employment checks on all applicants recruited to the Trust. &lt;br /&gt;&lt;br /&gt;We are looking for a computer literate individual with experience of Microsoft Office Package and knowledge of Recruitment Management Systems, for example TRAC and NHS Jobs. Previous administrative work within the NHS would be desirable but not essential. &lt;br /&gt;&lt;br /&gt;You’ll embrace the challenge of working in a highly demanding environment where excellent customer service skills and attention to detail are paramount. A flexible working attitude is desired, along with the ability to work to ever changing demands and priorities. The workload is varied; therefore, you must be able to prioritise your work with minimal supervision, as well as working as part of a team.&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust will be subject to a 6 month probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;/p&gt;\n&lt;p&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Amanda Vickers, Recruitment Advisor, on 01708 435000 ext. 3861.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie BabalolaEmail addressdebbie.babalola@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;Debbie Babalola, email debbie.babalola@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lyon Road, Romford", "postalCode": "RM1 2BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5689", "longitude": ".188549"}}, "title": "Band 4 Medical Recruitment Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258892", "validThrough": "2020-11-20T23:59:59+0000"}