{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "38000", "unitText": "YEAR", "value": "£38,000 + Benefits"}}, "datePosted": "2020-10-30T11:23:22+0000", "description": "&lt;p&gt;Whether you are a Nurse looking for the next step in your career ora Deputy Ward Manager looking to make a a difference, join Farmfield Hospital in Charlwood as a Deputy Ward Manager.&lt;/p&gt;\n&lt;p&gt;Supporting the Ward Manager, you will become a crucial part of our outstanding multidisciplinary team as you assist and manage the day-to-day running of the wards. As a Deputy Ward Manager, you will have previous experience from the NHS or private care and will be adynamic individual with a flexible approach to help some of the most vulnerable people in society build a brighter future. Working alongside amultidisciplinaryteam, you will be responsible for guiding wards to delivergreat healthcare, organise shifts and manage the wards budget. It’s a career that you can take pride in while enjoying the satisfaction of helping people and seeing them improve. It’s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You’re Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Managing and training of junior and nurse staff.&lt;/li&gt;\n&lt;li&gt;Effective strategic resource management.&lt;/li&gt;\n&lt;li&gt;Supporting the implementation of local Clinical Governance Strategy.&lt;/li&gt;\n&lt;li&gt;Providing strong and robust leadership in the clinical environment using the core skills of facilitation, negotiation, conflict resolution, teaching and delegation.&lt;/li&gt;\n&lt;li&gt;Actively contributing to the Nursing Service Agreement, departmental Risk Matrix and action plan and monitoring their implementation&lt;/li&gt;\n&lt;li&gt;To participate and take on active lead in organisational clinical and nursing audit programmes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you will:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;RMN Qualification&lt;/li&gt;\n&lt;li&gt;Evidence based practice.&lt;/li&gt;\n&lt;li&gt;Leadership skills.&lt;/li&gt;\n&lt;li&gt;Management of people skills.&lt;/li&gt;\n&lt;li&gt;Autistic Spectrum Disorder &amp; Learning Disorder experience&lt;/li&gt;\n&lt;li&gt;Experience within a leadership/management capacity.&lt;/li&gt;\n&lt;li&gt;Experience of working in a CAMHS setting&lt;/li&gt;\n&lt;li&gt;Relevant sufficient post registration experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;FarmfieldDrive,Charlwood, Surrey,RH6 0BN&lt;/p&gt;\n&lt;p&gt;You will be working at Farmfield Hospital, which is a large purpose-built medium-secure service with good facilities. Working alongside a multidisciplinary team, you will provide care and support for adult men 18+ with a forensic background and enduring mental health illnesses such as personality disorder, substance misuse issues and behaviours that challenge.&lt;/p&gt;\n&lt;p&gt;Farmfield is located North West of Gatwick airport near the village of Hookwood, with good transport links by road, bus and train. It is easiest to reach the site by car.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £38,000 per annum depending on experience&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charlwood", "postalCode": "RH6 0BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1664", "longitude": "-.201944"}}, "title": "Deputy Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249926", "validThrough": "2020-12-31T23:59:59+0000"}