{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "Band 7 - £38,890 - £44,503"}}, "datePosted": "2020-10-21T11:01:16+0100", "description": "&lt;p&gt;&lt;strong&gt;Practitioner Psychologist (Full time, Band 7) Adult Mental Health Adur, Arun and Worthing (AAW) Group Treatment Programme, West Sussex &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Come and join us on the south coast. This is a great and exciting opportunity for a Clinical or Counselling Psychologist to join the well established, successful and popular Group Treatment Programme for AAW, which covers Shoreham (near Brighton), Worthing and Littlehampton. The main team base is in central Worthing, a few minutes&#39; walk to the shops and beach. The service offers evidence-based and &#39;trauma informed&#39; interventions for people who have complex mental health needs. Apart from being able to access therapeutic groups, service users have the opportunity to benefit from parallel 1:1 work supporting their recovery.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are hopeful that there will be additional resources to support the successful candidate in pursuing formal training in CBT for personality disorder that would directly benefit their professional development as well as the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Group Treatment service is highly regarded within mental health services, and by service users who have given feedback including “the team have been great, kind, easy to talk to and caring,” &quot;[they gave] total support (constant)&quot;, &quot;[were] willing to listen,” and &quot;they make me feel safe and are very supportive, friendly and kind.”&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are welcome from qualified psychologists and also from trainees in their final year of training.The successful candidate will join an established team of clinicians from a number of professional backgrounds including nursing, psychotherapy and occupational therapy. You will also work alongside, and with the support of, a dynamic group of psychologists working in other secondary mental health services in AAW. This post will provide the opportunity to have a very satisfying mixture of experience, having some involvement in group work, supporting clients through in 1:1 input, and supporting the team through offering supervision, formulation, training and other indirect interventions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We care about our staff and their wellbeing. You will receive regular clinical and professional supervision as well as a commitment to your own continuing professional development. Our Trust offers a wide range of CPD and you will have the opportunity to develop special interests and expertise in line with service and team objectives. Within our secondary mental health service, there are excellent opportunities to develop your service development and leadership skills in order to enhance your career progression.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Sussex Partnership NHS Foundation Trust provides mental health, learning disability and substance misuse services in and across Sussex. The Trust has teaching status and is developing into one of the country’s leading teaching mental health trusts. Working here offers continued training and development, variety, plus all the benefits of living in Sussex. Sussex is a beautiful county with good transport links, vibrant communities, rural areas, and tourist attractions, including the Coast and the South Downs. We welcome informal visits and or a phone conversation about the service and this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Patrick McGuinness, Consultant Clinical Psychologist and AAW Professional Lead for Psychology and Psychological Therapies on 0747 1031632 or Elisa Cioffi on 0300 304 0055&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Acre, Adur Arun And Worthing", "postalCode": "BN13 3EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8412", "longitude": "-.411136"}}, "title": "Team Clinical / Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236030", "validThrough": "2020-11-11T23:59:59+0000"}