{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 £82,096 to £110,683"}}, "datePosted": "2020-10-06T10:00:56+0100", "description": "&lt;p&gt;&lt;span&gt;The Queen Elizabeth Hospital King’s Lynn NHS Foundation Trust is a 488 bed hospital which offers a chance to live and work in a beautiful region with its own distinctive mix of urban, rural and coastal landscapes, all within easy reach of Norwich, Cambridge, London and the Midlands. We serve an expanding population of around 220,000, which, increases substantially during the summer through the popularity of the surrounding countryside and beaches for leisure and holidays. We are a welcoming and friendly hospital that is devoted to our vibrant diverse community. We know where we are going, and want inspirational, compassionate and caring individuals to join us.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To help us on our journey, we are looking for a highly motivated colleague to join the Oncology team at QEH. We are keen to appoint a substantive Consultant Clinical Oncologist to lead on Upper GI cancer and AOS . The appointee will also share lung cancer practice at QEH . You will work alongside 5 Consultant Oncology colleagues (2 Medical Oncologist and 3 Clinical Oncologists, supported by Oncology Specialist Nurses led by the Lead Cancer Matron.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will beexpected to maintain and enhance the multidisciplinary management of patients within these malignancies, to increase entry of patients into clinical trials and to expand the service as required to meet the needs of patients in this area. As with all cancer units and centres, we have seen a steady rise in the number of patients being referred for all of these malignancies and an increase in the use of multiple lines of chemotherapy in a radical and palliative setting, together with expansion of the use of monoclonal antibody therapies and immunotherapy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will join an enthusiastic and friendly Department of Oncology which is an integral part of the department of medicine within the QEH as well as having close links with the Cancer Centre through the Oncologists’ hub and spoke posts.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is essential that you hold an MBBS or equivalent certificate. You must also have full GMC registration, a licence to practise and either currently included on the Specialist Register or within 6 months of this at the time of appointment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicola AinsworthAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicola Ainsworth, Clinical Director of Oncology- via switchboard.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Queen Elizabeth Hospital King's Lynn NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120938"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Queen Elizabeth Hospital King&#39;s Lynn, King&#39;s Lynn", "postalCode": "PE30 4ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7568", "longitude": ".447015"}}, "title": "Consultant in Clinical Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214103", "validThrough": "2020-11-08T23:59:59+0000"}