{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "TBC"}}, "datePosted": "2020-10-27T14:03:02+0000", "description": "&lt;p&gt;We are a 17,500 patient inner City Practice looking for GPs who might like to join us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a main surgery with a branch surgery that most of us rotate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a friendly bunch (8 Partners and 5 Salaried GPs) with a wide range of outside interests from running (5ks to Marathons), through playing in bands, cycling, learning languages, to making quilts and fundraising for various issues close to our hearts&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At the core of this is an appreciation of the effect workload and home life can have on individuals and a shared aspiration to get this balance right.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A significant number of our patients live in deprived areas and are from a variety of backgrounds and cultures. We use language line regularly and allow extra time for those consultations. Honestly the work is busy and challenging but we have an amazing team who fully acknowledge this by regularly reviewing workload, being open to new ways of working and listening to feedback from any member of staff who would like to contribute.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Most of our Partners started here as salaried GPs and we hope to continue this tradition. Despite the challenges of General Practice we all still love working here many years later and a lot of this is based on our stable and long term exceptional team. WE ARE HAPPY TO WAIT FOR THE RIGHT CANDIDATES&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT DO WE HAVE TO OFFER?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· Newport has much to offer as a City itself – oven overlooked – but is also within reach of Cardiff, Bristol (no Toll charge!), Beaches, Mountains, Walks, Parks (recommend Park Run to start the weekend off just right) and diverse history and cultural offerings&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· Competitive and negotiable salaries – and we mean negotiable – salaries can vary according to what type of sessions you want to do, experience, previous employment and how much or little you want to be involved (we have space for all)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· The usual 6 weeks annual leave, 1 week of study leave apply and we have a meeting every Monday lunchtime (food provided) from which a new gem never fails to emerge! It’s how we all stay sane (debateable) and up to date and all contributions are welcome&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· Varying working patterns on negotiation. We try hard to accommodate days wanted, session start and finish times (child friendly/letting out the dog/cat friendly) and fairness is key.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· The aim of moving towards 15 minute appointments. We all set our own templates to accommodate individual styles of consultation (some power on through and some prefer regular breaks)&lt;/p&gt;\n&lt;p&gt;· There are no extras and NO HOME VISITS EVER – these are done in an allocated daily shift that you do not have to rota into&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· Our aim is that our Doctors leave on time! – this is encouraged and reviewed regularly. Some GPs like to have a home laptop and some run far from this! We can accommodate your viewpoint&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· Optional locum sessions can be undertaken&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WORKLOAD SOLUTIONS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;· Nurse triage&lt;/p&gt;\n&lt;p&gt;· Minor illness, chronic disease, ANP and treatment room nurses&lt;/p&gt;\n&lt;p&gt;· Prescribing pharmacists&lt;/p&gt;\n&lt;p&gt;· An allocated visiting Dr every day and you do not need to opt into this&lt;/p&gt;\n&lt;p&gt;· A Duty Doctor daily – this is fairly distributed and some do more because they just like the session (bizarre but true!) – again we try to look at session preference as far as possible within the confines of having to cover everything we have to cover&lt;/p&gt;\n&lt;p&gt;· A Mental Health Nurse who sees acute patients and follow ups&lt;/p&gt;\n&lt;p&gt;· Newly recruited a Learning Disabilities Nurse&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;OPTIONS FOR GPs GOING FORWARD&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Other interests are actively encouraged – we have a wide range that include:&lt;/p&gt;\n&lt;p&gt;· Teaching (close connections with Cardiff University) – Registrars/Medical Students&lt;/p&gt;\n&lt;p&gt;· Training (become a trainer!)&lt;/p&gt;\n&lt;p&gt;· Occupational Health&lt;/p&gt;\n&lt;p&gt;· Minor Ops (inject joints for a session!)&lt;/p&gt;\n&lt;p&gt;· Womens’ Health&lt;/p&gt;\n&lt;p&gt;· Diabetes&lt;/p&gt;\n&lt;p&gt;· Respiratory&lt;/p&gt;\n&lt;p&gt;· Mental Health&lt;/p&gt;\n&lt;p&gt;· Dermatology&lt;/p&gt;\n&lt;p&gt;· Group Consultations&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The list goes on! Chose an area and we will support your plans!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;OUR BUILDING and LINKS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;· Parking a plenty&lt;/p&gt;\n&lt;p&gt;· LMC links&lt;/p&gt;\n&lt;p&gt;· GPs working in the local Hospital&lt;/p&gt;\n&lt;p&gt;· Diabetic xpert courses and expert patient courses run on site&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Come and see for yourself – always willing to chat and discuss details!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132694.png", "name": "GP Practices - Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport", "postalCode": "NP20 2WQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5773", "longitude": "-2.99634"}}, "title": "General Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244867", "validThrough": "2021-01-04T23:59:59+0000"}