{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82738", "unitText": "YEAR", "value": "£82,738 to £110,683 plus £149 HCAS inc. pro rata"}}, "datePosted": "2020-10-01T16:17:02+0100", "description": "&lt;h1&gt;Consultant Neonatologist&lt;/h1&gt;\n&lt;p&gt;We are looking for an exceptional individual to join our team of eight neonatologists at St. Peter’s Hospital NICU in Surrey. We are well known for our non-invasive approach to ventilation in preterms and our delivery-room use of High Flow, but we are also recognised for our very high standard of Family Centred Care having been awarded the Bliss Baby Charter with a score of 99%.&lt;/p&gt;\n&lt;p&gt;In 2019 we admitted 427 babies with a further 223 babies admitted for Transitional Care. We admitted 143 babies &lt;1500g, with 52 babies under 27 weeks admitted as first admissions. 101 were under 32 weeks, and 117 over 37 weeks (ATAIN 3.2%). Our main intensive care activity is therefore caring for the extremely preterm infant, but we are fully able to offer all medical neonatal intensive care. We have a dedicated outreach team to facilitate early discharge, and we run a range of specialist neonatal clinics including cardiac and neurodevelopmental assessment. We also host the Surrey arm of the Kent, Surrey and Sussex Neonatal Transfer Service which transfers both sick new-borns and repatriates stable babies across the region 24 hours a day.&lt;/p&gt;\n&lt;p&gt;Our talented team of neonatal consultants work in a friendly, flexible and cohesive group. We offer a fantastic development and coaching programme for new consultants and we will support you with your professional development. We are enthusiastic, welcoming and proactive in supporting special interests. We have a strong commitment to QI and excellent participation in research. Our whole team are regular contributors to national and international meetings as well as network and national working groups from CRG, BAPM to NICE. We work closely with our colleagues in maternity including in the MatNeoQI programmes of work, and our clinical governance and safety work is high quality. Opportunities therefore exist for you to develop roles and responsibilities that facilitate the further development of our neonatal service.&lt;/p&gt;\n&lt;p&gt;As a result of a member of the team shifting to less than full time hours we now need to recruit another Consultant (initially 7.5 PAs, although there is scope to increase PAs) to join our permanent team, bringing the number the number of Consultants up to nine. We are supported by a team of 14 middle grade and junior doctors, five ANNPs and approximately 70 nursing staff, with excellent secretarial and receptionist support too.&lt;/p&gt;\n&lt;p&gt;St. Peter’s Hospital is based just outside Chertsey in Surrey and close to diverse attractions including theme parks, gardens, historical towns and the Thames. Surrey is a fantastic and family-centred location in which to live and work. There are excellent local schools, shopping, sporting activities, restaurants and bars, which all contribute to a high quality of life. Central London is easily accessible by train. The M25, M3 and M4 are also close by. Heathrow airport is 20 minutes and Gatwick Airport is 30 to 40 minutes by car.&lt;/p&gt;\n&lt;p&gt;The unit has an established and enthusiastic nursing team and this is presently being expanded and two tiers of junior doctors, consisting of mainly of specialty trainees, clinical fellows and associate specialists. There are full support services of pharmacy, social services, family support, dietetics, radiology, speech and language therapy and community neonatal outreach team and there is active provision of simulation on the unit.&lt;/p&gt;\n&lt;p&gt;So come and join our friendly and innovative Consultant team at St. Peter’s.&lt;/p&gt;\n&lt;p&gt;For further information, please contact Michael Hooker via email to michaelhooker@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Consultant in Neonatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916209291", "validThrough": "2020-11-15T23:59:59+0000"}