{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 Per An"}}, "datePosted": "2020-11-05T10:18:08+0000", "description": "&lt;p&gt;taff Nurse - C7&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for the appointment of a Band 5 Ward Staff Nurse position for Ward C7 at the Royal Blackburn Hospital. Ward C7 is a 22 bedded ward which cares for patients with Haematology, Rheumatology and General Medical conditions.&lt;/p&gt;\n&lt;p&gt;Patient welfare is at the heart of everything we do and it is expected that you will demonstrate passion in improving the patient experience for those patients who have to deal with life threatening conditions. In return we will provide and offer continuous support and development from our practice educator, enabling you to enhance your clinical and leadership skills. You will be expected to undertake mandatory training to develop your knowledge to deliver evidence based practice.&lt;/p&gt;\n&lt;p&gt;You will be supported by experienced role models who create a culture of continuous improvement. We welcome the involvement of all staff in helping to shape the future of the organisation. We aim to make a lasting positive difference to the quality of care people receive. If you are considering joining us, you will become part of a forward thinking, inspirational and innovative organisation who value and support their staff. At East Lancashire Hospitals NHS Trust our vision is to be widely recognised for providing safe, personal and effective care. We employ over 7,000 staff, many of whom are internationally renowned and have won awards for their work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dear Potential Applicant,&lt;/p&gt;\n&lt;p&gt;It is important you are made aware of the changes which East Lancashire Hospitals NHS Trust has implemented with regard to charging for the cost of undertaking Disclosure and Barring Scheme (DBS) Checks (previously known as Criminal Records Bureau or CRB) and how this may impact upon you.As this position is exempted from the Rehabilitation of Offenders Act 1974 and involves work that is identified as a regulated activity as defined in the Safeguarding Vulnerable Groups Act (2006), any offer of employment is provisional upon a satisfactory DBS check being obtained.&lt;/p&gt;\n&lt;p&gt;The cost of an Enhanced Disclosure will be £44.00, which includes a small handling fee.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In line with other NHS organisations in the North West Region, the Trust is now passing the charge for undertaking a DBS check on to candidates in the event they are successfully appointed into the post for which they have applied. Candidates can choose whether to pay this over 1-3 months as a deduction from the monthly salary. However, if you are applying for a post as a BANK worker, the payment must be made in full at the time of employment checks. By applying for this vacancy you are agreeing to this undertaking in the event you are successfully appointed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tracy Barnes - &lt;strong&gt;01254 733727 or Tracy.barnes@elht.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Blackburn Hospital, Haslingden Road, Blackburn BB2 3HH, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Staff Nurse C7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257215", "validThrough": "2020-11-19T23:59:59+0000"}