{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-19T12:31:12+0100", "description": "&lt;p&gt;Would you like to join a growing team and be part of transforming services for those who have a diagnosis of personality disorder and complex emotional needs?&lt;/p&gt;\n&lt;p&gt;As a result of the extra investment that is coming into Mental Health Services as part of the NHS Long Term Plan, we are excited to be able to expand and transform what we offer to this service user group and their families. We are in the process of recruiting a senior MDT that will shape and drive these changes. This investment will allow us to strengthen our teams across Nottinghamshire and Bassetlaw and forms the first part of a larger expansion across all elements of our developing stepped care integrated model.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting new role in Adult Mental Health that supports the transition of young people in CAMHS services into Adult Mental Health Services. The role will be part of a senior MDT providing direct clinical work, supervision, training and supporting service development. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be a visible point of contact to staff requiring guidance, expertise and support in the transition of a young person into adult services. You will require excellent clinical and leadership skills and demonstrate core values that place individuals at the heart of their care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be a qualified RMN with current NMC registration or equivalent with evidence of continued professional development. Experience and expertise in working with those with Personality Disorder is also required. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work as part of a senior team that will oversee the development of and support to Personality Disorder services in line with National guidance. You will be part of Adult Mental Health services and contribute to the implementation of the NHS LTP to improve outcomes for the local population. You will report to the Clinical Strategic Lead for Personality Disorder and join a strong senior team delivering this transformation.&lt;/p&gt;\n&lt;p&gt;If you would like to have an informal conversation, please contact: &lt;/p&gt;\n&lt;p&gt;Andrea Cockram, Nurse Consultant, Adult Mental Health.&lt;/p&gt;\n&lt;p&gt;Email: andrea.cockram@nottshc.nhs.uk / Telephone: 0115 9691300 ext. 12663&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG6 9DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9927", "longitude": "-1.19201"}}, "title": "Personality Disorder Transition Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232273", "validThrough": "2020-11-08T23:59:59+0000"}