{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-21T14:45:56+0100", "description": "&lt;p&gt;We are currently expanding our Theatre’s Department at Birmingham Children’s Hospital and are seeking Theatre Practitioners to join us.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;We welcome applications from Newly Qualified / Registered Nurses (Child / Adult) and Operating Department Practitioners (ODP).&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;As a leading tertiary paediatric centre, Birmingham Children’s Hospital performs a wide range of acute and specialised surgery including complex cardiac surgery, liver and renal transplantation, and as major trauma centre has a busy Emergency Department receiving patients who are transferred directly to our Theatres. If you are looking to expand your current scope of practice whilst working in a supportive team this could be the perfect opportunity for you.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Your training and professional development is important to us and we offer a broad range of opportunities to support your career pathway and have a dedicated Apprenticeship Team onsite. Within the Theatre’s Department we also offer a comprehensive and supportive rotation programme.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Staff health and wellbeing is important to us and we have various initiatives available. Within the Department we can also offer flexible working arrangements including full time and part time hours. Some of our other benefits include;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Contributory NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Access to a range of NHS staff discounts&lt;/li&gt;\n&lt;li&gt;Discounted travel passes / local NCP car parking&lt;/li&gt;\n&lt;li&gt;Competitive annual leave entitlement starting from 27 days per annum + bank holidays (based on full time hours), increasing with length of service)&lt;/li&gt;\n&lt;li&gt;Access to free and confidential wellbeing support and counselling&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;What happens next?&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Once you have submitted your application, we will be shortlisting weekly and if you are shortlisted for interview you will receive an invite via NHS Jobs with the details.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will take place via zoom invite – these can be arranged at your convenience.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;If you would like more information, please contact Sam Marriott, Tracey Littlehales or Lisa Stringer on 0121 333 6188.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B4 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4852", "longitude": "-1.89446"}}, "title": "Theatre Practitioner (Nurse or ODP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236937", "validThrough": "2020-11-19T23:59:59+0000"}