{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 per annum plus HCA"}}, "datePosted": "2020-11-05T12:46:34+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for surgical staff nurses to join ward 12 and ward 15 at Queen Elizabeth Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ward 12/Surgical Assessment Unit (SAU)&lt;/strong&gt; consist as two areas and is a 26 bedded surgical unit taking patients under the care of general surgery, colo-rectal, orthopaedic, gynaecology and Urology. SAU - surgical assessment unit. SAU accepts patient from A&amp;E and Urgent care requiring assessment and treatment or assessment and admission. Staff will rotate between the ward and SAU which staff rotates between. This gives staff an opportunity to gain experience in many surgical specialities including general surgery, colo-rectal, orthopaedic, gynaecology and Urology. You need to be able to work all shift patterns as the staff rotate between the ward and SAU. The shift patterns for SAU are: 08:00-20:30, 09:30-22:00 and the ward 07:00-19:30 and nights 19:00-07:30.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ward 15&lt;/strong&gt; is an acute surgical ward consisting of 39 beds in total, specialities include general surgery, colo-rectal, orthopaedic, gynaecology, vascular and breast surgery and Urology.&lt;/p&gt;\n&lt;p&gt;As a Staff Nurse, we will offer you excellent support in your new role with support from senior nursing management team, the Practice Development Nurse and peer to peer support with lots of learning and development opportunities. We will also offer you one of a kind surgical nursing course in affiliate with University of Greenwich and now a Trauma and Orthopaedic course which is also run in house. The nursing teams are committed to providing high quality, safety focused, and holistic care in a warm and friendly environment.&lt;/p&gt;\n&lt;p&gt;We also have the exciting opportunity for staff to come on our in house accredited Surgical course and now our Trauma and Orthopaedic course.&lt;/p&gt;\n&lt;p&gt;To be successful in the role, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be a Registered Nurse with current NMC registration&lt;/li&gt;\n&lt;li&gt;Ability to work flexibly across all shift patterns&lt;/li&gt;\n&lt;li&gt;Have a passion for delivering high quality patient care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise HoranJob titleMatronEmail addressLouise.Horan@nhs.netTelephone number0208 836 5939, 07900164580&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth Hospital, London", "postalCode": "SE18 4QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4791", "longitude": ".051174"}}, "title": "Surgical Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257723", "validThrough": "2020-11-15T23:59:59+0000"}