{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-11-05T15:46:02+0000", "description": "&lt;p&gt;We are seeking a Recruitment Administrator to join our team in Bedford on a one year fixed term contract. You will already have an outstanding track record in administration and customer service, providing you with the skills you&#39;ll need to conduct the duties required of you, to ensure each candidate and recruitment manager has a positive recruitment experience; enthusiasm and a friendly and helpful approach will be the key to your success. You must be well organised, have attention to detail and the ability to prioritise and use your initiative.&lt;/p&gt;\n&lt;p&gt;Ideally you will have worked in recruitment before and have a good understanding of the legislation and policies that govern recruitment, to ensure the organisation recruits safely and fairly with transparent processes. Experience of the Trac recruitment system would be an advantage, but is not essential.&lt;/p&gt;\n&lt;p&gt;You will become part of a supportive team, facilitating a wide range of Bank recruitment for EEAST. This is a busy role, but one that offers an excellent sense of achievement and the opportunity to develop a range of coordination and administration skills as well as an understanding of the Ambulance Trust and how they deliver great patient care. You will have the opportunity to learn from your colleagues and will be encouraged to rise to all challenges and opportunities available to you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Megan Graziano, Recruitment Coordinator&lt;/p&gt;\n&lt;p&gt;megan.graziano@eastamb.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120792.jpg", "name": "East of England  Ambulance Service Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120792"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedford", "postalCode": "MK41 0RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1524", "longitude": "-.416922"}}, "title": "Recruitment Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258402", "validThrough": "2020-11-08T23:59:59+0000"}