{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Unsocial Hours (if required) as"}}, "datePosted": "2020-10-23T11:02:12+0100", "description": "&lt;p&gt;&lt;strong&gt;Associate Clinical Educator (Band 5), Lincolnshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Directorate of Human Resources and Organisational Development. The Directorate is responsible for the implementation of clinical education within the Trust to support operational roles and the organisational workforce plan.&lt;/p&gt;\n&lt;p&gt;The &lt;strong&gt;Associate Clinical Educator (ACE)&lt;/strong&gt; role is important within the clinical education team and will directly assist in the delivery of ambulance related courses, including regulated courses leading to Ambulance Technician qualifications. The Associate Clinical Educator will have a regulated clinical qualification of at least Ambulance Technician and will hold a recognised teaching qualification, although Associates may also hold professional registration. The Associate will be required to hold or work towards achieving bother assessor and quality assurance qualifications in relation to education. The Associate Clinical Educator will take direction from a wider team of Senior/Clinical Educators, whilst also working independently in accordance with the job role and scope.&lt;/p&gt;\n&lt;p&gt;Alongside formal taught and assessed courses there will be a requirement for the Associate Clinical Educator to work alongside learners in practice, and therefore the educator must be a clinical role model, confident and contemporary in emergency ambulance practice. The role will also be required to support statutory mandatory clinical subjects.&lt;/p&gt;\n&lt;p&gt;Clinical education at EMAS embeds the Trusts core values and requires educators to be student centric and contribute to outstanding patient care by developing and supporting clinicians at each stage of their career/development. Increasingly the education teams are using active blended learning and developing technologies to support learning and assessment. As an &lt;strong&gt;Associate Clinical Educator&lt;/strong&gt;, you will need to embrace these new ways of working and be flexible and innovative in your educational approach. You will be expected to seek and respond to learner feedback to develop your role, expertise and learner experience.&lt;/p&gt;\n&lt;p&gt;The &lt;strong&gt;Associate Clinical Educator (ACE)&lt;/strong&gt; role will be based at the EMAS Bishops Court Education Centre, Lincoln. The role will require centre based working, as well as remote working via MS Teams and practice-based working, as required. The role is advertised as full-time. Although unsocial hours are not planned within the role, any occurrence would be subject to Section 2.&lt;/p&gt;\n&lt;p&gt;Potential applicants are encouraged to contact Nicky Fothergill@emas.nhs.uk (Head of Education) to discuss the role and opportunity further.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Nicky Fothergill/Trevor West/Hannah Coppack, Job title: Education Team - Lincolnshire, Email address: Nicky.Fothergill@emas.nhs.uk, Telephone number: 01522 889508,&lt;/p&gt;\n&lt;p&gt;Additional contact information: EMAS Recruitment Team, 0115 8845000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Midlands Ambulance Service NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121632"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Currently Bishops Education Centre (Lincoln), Lincoln", "postalCode": "LN2 4HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.238", "longitude": "-.507645"}}, "title": "Associate Clinical Educator (Lincolnshire)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240207", "validThrough": "2020-11-08T23:59:59+0000"}