{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa + Outer London HCAS pro rata"}}, "datePosted": "2020-10-29T13:01:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical/Counselling Psychologist Band 7 - Eating Disorders Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer:&lt;/strong&gt; Barnet, Enfield &amp; Haringey Mental Health NHS Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;Eating Disorders&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; St Ann’s Hospital, Haringey, London&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Posts: &lt;/strong&gt;1 x Band 7, Clinical/Counselling Psychologist, 15 hours (0.4 WTE) - Permanent Contract&lt;/p&gt;\n&lt;p&gt;Are you looking for a new challenge in a specialist area that gives you the opportunity to work holistically with patients covering both mental health and physical health?&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and talented Clinical/Counselling Psychologist to join our Eating Disorders Psychological Therapies team.&lt;br /&gt;&lt;br /&gt;The Eating Disorders Service at St Ann’s Hospital in Haringey provides comprehensive care for patients 18 years old and above with a primary diagnosis of an eating disorder. It is one of the largest units in the country providing services to a catchment area that includes North Central London, North East London and parts of Essex. The service provides intensive inpatient treatment on Iris ward which is located in a newly built state of the art mental health building, Blossom Court. Our 20 bedded unit features ensuite bedrooms, more daylight and views of nature to help reduce patient stress, anxiety and pain as well as a sensory room. The service also includes our outpatient services, community liaison services, and a day programme.&lt;/p&gt;\n&lt;p&gt;As a successful candidate, you will have the opportunity to work within a large and well established multidisciplinary Eating Disorders Service that consists of Psychiatry, Psychology, Community Liaison Nursing, Dieticians, Occupational Therapy, Family Therapy, Art Therapy, and Social Work.&lt;/p&gt;\n&lt;p&gt;The Psychological Therapies team is responsible for providing assessment and treatment across all areas of the service including inpatient, outpatient and the day program. The majority of the clinical work, both individual and group, uses a broadly cognitive behavioural framework, which is tailored to the presenting eating disorder and any co-morbid conditions.&lt;/p&gt;\n&lt;p&gt;We take pride in working together to maintain a supportive and friendly workplace where we can all deliver quality treatment for our patients as well as creating the welcoming atmosphere where we are happy to work.&lt;/p&gt;\n&lt;p&gt;Being part of the Psychological Therapies Team, you will attend the weekly Psychological Therapies meeting and receive weekly supervision from a Clinical/Counselling Psychologist to support your clinical work. You will also attend fortnightly CPD sessions arranged for the Psychological Therapies Team as well as a monthly Clinical Improvement Group where the whole service meets on a monthly basis and a monthly reflective practice group.&lt;/p&gt;\n&lt;p&gt;Interview date: Wednesday 18th November 2020&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Ayo Sodeke-Gregson&lt;/p&gt;\n&lt;p&gt;Job title: Psychological Therapies Lead&lt;/p&gt;\n&lt;p&gt;Email address: ayo.sodeke-gregson@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 020 8702 6240&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Haringey", "postalCode": "N15 3TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5807", "longitude": "-.092156"}}, "title": "Clinical/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248434", "validThrough": "2020-11-12T23:59:59+0000"}