{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 pa"}}, "datePosted": "2020-11-06T11:00:23+0000", "description": "&lt;h1&gt;&lt;strong&gt;Senior HR Business Partner (HRBP)&lt;br /&gt; Human Resources &amp; Organisational Development &lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;37.5 hours per week&lt;strong&gt;&lt;br /&gt; NHS Band: &lt;/strong&gt;8b&lt;strong&gt;&lt;br /&gt; Salary: &lt;/strong&gt;£53,168 to £62,001 pa&lt;strong&gt;&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an experienced HR and/or OD leader looking for a role that gives you opportunities to improve outcomes through influencing, problem solving, innovation, and, with the opportunity to work flexibly, could you shape the direction and performance of one of the largest NHS Trusts in the country?&lt;/p&gt;\n&lt;p&gt;If so, we are recruiting to an exciting opportunity as Senior HR Business Partner at Leeds Teaching Hospitals NHS Trust (LTHT), working in a collaborative, supportive, and inclusive team.&lt;/p&gt;\n&lt;p&gt;LTHT is a high performing Trust, currently rated ‘Good’ by the CQC, with strong results from our Staff Survey. Our ambition is to be CQC rated as ‘Outstanding’ and the best place to work; therefore our people are at the heart of everything we do. We are looking for an engaging individual who will take the lead on working with our services to deliver our ‘Personalised People Management’ commitment to our staff via our People Priorities and implementation of the NHS People Plan.&lt;/p&gt;\n&lt;p&gt;Reporting directly to the Director of HR and OD, you will be part of a team of four Senior HR Business Partners. Their primary purpose is to ensure the application of leading HR and OD practices in Clinical Service Units (CSUs) and corporate directorates in an organisation with over 18,000 staff. You will have significant exposure and impact with the opportunity to influence the Trust’s senior leaders.  You will work with scale and complexity, be able to demonstrate joint accountability, and drive the assurance process.&lt;/p&gt;\n&lt;p&gt;You will have a proven track record in senior HR and/or OD roles, leading change, delivering results, with experience of working in complex organisations and taking a person centered approach.  As a vital member of the team, you will embed new approaches that are inclusive and reflect the Trust’s “Leeds Way” values.  You will take a lead on all aspects of the people and culture agenda including strategic workforce planning and workforce development.&lt;/p&gt;\n&lt;p&gt;As a true business partner, the ability to establish professional credibility and influence at all levels within our organisation is essential, as is experience of coaching and motivating others. The ability to prioritise and organise a demanding workload is also required, along with being a practical and pragmatic problem solver who can find innovative solutions. You will be able to understand business need and use key HR metrics to identify risks and opportunities for HR and OD interventions to implement solutions, and utilise colleagues in wider functions to support improvements.&lt;/p&gt;\n&lt;p&gt;We celebrate diversity and we want to hear from individuals who can bring different approaches and experiences. If you can clearly evidence that you are able to embed excellent ‘Personalised People Management’ in partnership with our services and you want to make a positive contribution in us becoming the best place to work, this is the perfect opportunity for you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We’d be really keen to talk to you for an informal conversation. Please contact Tracey Riach, PA to the Director of HR and OD,           (&lt;/strong&gt;&lt;strong&gt;tracey.riach@nhs.net&lt;/strong&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;)&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;strong&gt;, who will be able to connect you with a member of our team. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date – Sunday 15th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virtual Assessment – Tuesday 8th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virtual Panel Interview – Thursday 10th December 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**This job advert will close as soon as a sufficient amount of applications have been received. Please apply for this job as soon as you can, if you are interested.**&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122692.jpg", "name": "Trust Executives", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122692"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Senior HR Business Partner (XN09)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259317", "validThrough": "2020-11-15T23:59:59+0000"}