{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-11-03T09:46:08+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic individual to undertake the role of a part time Band 3 Administration Support Officer based within the Integrated Network Hubs, Civic Centre in Swansea.&lt;/p&gt;\n&lt;p&gt;As a member of the administration team you will ensure a high quality reception and efficient administration service is provided to the service as a whole. You will have good written and verbal communication skills as the role entails liaising with members of the public, staff, GP Practices, Nurses and other agencies at all levels. You will be required to assist with the formatting of letters and take notes electronically at meetings, therefore a high level of administrative experience is required along with a keen eye for detail.&lt;/p&gt;\n&lt;p&gt;You should have recent or previous clerical and computer experience, good keyboard skills and be educated to GCSE or equivalent level. You will be required to undertake specific IT training for this role and will be provided with support with this. You should be able to work on your own initiative as well as being an active team player. You may be required to deputise for the Administration Manager in their absence and this will require people management skills.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;This is a part-time post, 30 hours per week.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Chris RamsellHub Administrator&lt;/p&gt;\n&lt;p&gt;christopher.ramsell@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01792 530790&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Central Hub, Civic Centre, Swansea", "postalCode": "SA1 3SN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6137", "longitude": "-3.94837"}}, "title": "Administrative Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253307", "validThrough": "2020-11-10T23:59:59+0000"}