{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-27T11:16:35+0000", "description": "&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having a ‘Outstanding’ rating overall, having being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Community Mental Health Team in our latest CQC inspection, which found that: ‘There was a clear vision, underpinned by a set of values that were well understood by staff across the trust.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are part of Berkshire Health Visiting service and have just received &lt;strong&gt;top clinical team of the year&lt;/strong&gt; in our annual staff awards.&lt;/p&gt;\n&lt;p&gt;If you regard yourself as an enthusiastic and dynamic qualified nurse then you may be suitable to join our forward thinking, vibrant health visiting team in Wokingham. Whether you are an experienced staff nurse ready for a new direction, newly qualified or about to qualify, we will ensure you receive individualised and effective support from both your health visiting line manager and colleagues within your team.&lt;/p&gt;\n&lt;p&gt;You will work within the Reading area to deliver core and targeted services to children aged 0-5 and their families. You will require excellent interpersonal skills, the ability to work in partnership with other teams and agencies, along with great communication skills and a passion for working with children and families.&lt;/p&gt;\n&lt;p&gt;A commitment to team working, flexibility and working with partners is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the general responsibilities include;. &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Participate in developing and implementing outcome focused care plans and evaluate care given, in partnership with clients.&lt;/li&gt;\n&lt;li&gt;Provide support to families using the Solihull approach model in behaviour management, parenting skills and delivering programmes of care to vulnerable families.&lt;/li&gt;\n&lt;li&gt;Develop and facilitate Health Visiting drop in clinics, health promotion activities and groups, work on the duty line.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Where the role will be based:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If successful your base will be either Whitley Health and Social Services Centre or Southcote Clinic in Reading, however your role will require you to visit homes and centres across Berkshire (mileage will be compensated).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Work base – Whitley Health and Social Services Centre or Southcote Clinic, Reading.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of joining our team/trust:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary ranging from &lt;strong&gt;£24,214 to £30,112 &lt;/strong&gt;per annum&lt;/li&gt;\n&lt;li&gt;We have been awarded an overall rating of ‘Good’ with the CQC&lt;/li&gt;\n&lt;li&gt;We have been awarded a rating of ‘Outstanding’ in the Well Led domain&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working&lt;/strong&gt; opportunities and a strong emphasis on &lt;strong&gt;work life balance&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;Annual leave – &lt;strong&gt;27 days for under 5 years NHS service&lt;/strong&gt;, 29 days after 5 years NHS service and 33 days after 10 years NHS service plus &lt;strong&gt;8 days bank holidays pro rata&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;Excellent &lt;strong&gt;learning and development opportunities&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Lease car&lt;/strong&gt; scheme&lt;/li&gt;\n&lt;li&gt;Generous maternity, paternity and adoption leave for eligible staff&lt;/li&gt;\n&lt;li&gt;Advanced IT enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent staff support and advice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The 2 “requirements” in order for you to be considered for this role;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You must be a &lt;strong&gt;Registered Nurse (or due to qualify) &lt;/strong&gt;active on the&lt;strong&gt; NMC register&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;You will hold a valid &lt;strong&gt;UK drivers license&lt;/strong&gt; with &lt;strong&gt;access to a vehicle&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Do you meet the requirements listed above? Are you searching to work somewhere that is unconditionally respectful to young people and their families, and values their staff as individuals and continuously strives to be the best service it can be? Complete the application form and come and join us at Berkshire Healthcare NHS Foundation Trust!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details about this role or questions in general about working for Berkshire Healthcare please contact Julie Williamson on 07818468458, julie.williamson@berkshire.nhs.uk or Haley Walsh on 07880541538, haley.walsh@berkshire.nhs.uk&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to a car salary sacrifice scheme (available to all permanent staff over the age of 21), support with childcare and, as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team,&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whitley Health &amp; Social Services Centre, Reading", "postalCode": "RG2 7PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4314", "longitude": "-.962633"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244195", "validThrough": "2020-11-08T23:59:59+0000"}