{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39957", "minValue": "39957", "unitText": "YEAR", "value": "£23.77"}}, "datePosted": "2020-10-08T11:12:58+0100", "description": "&lt;p&gt;&lt;strong&gt;**PLEASE NOTE THIS IS TO APPLY TO JOIN NHS PROFESSIONALS’ ALLIED HEALTH PROFESSIONALS BANK**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Highly Specialised Cardiac Physiologist - Band 7&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Pennine Acute Trust – Fairfield General&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt; Cardio – Respiratory&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates:  &lt;/strong&gt;Days: £23.77 Saturdays/Nights: £30.91 Sunday/Bank Hols: £38.00&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: 35867&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:         &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Live your life the way you want.…join the bank to choose where your feet land next.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community, in a Trust rated ‘Good’ in a recent CQC report, working in a location with all the benefits of country living with the convenience of big city life?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you! &lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for a Highly Specialised Cardiac Physiologist  available at The Pennine Acute Trust specifically providing specialised technical expertise in our complex Cardiac Rhythm Management device service encompassing Brady, Tachy &amp; CRT device implant and follow up with supporting the implementation of S-ICD &amp; His Bundle Pacing.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Independently acquiring and reporting results for a range of highly specialised procedures and forwarding the results to the appropriate referring practitioner when required and also highlighting any urgencies or concerns.&lt;/li&gt;\n&lt;li&gt;Duties will include greeting the patient, confirming identification and performing and producing factual reports for the appropriate investigations to a high standard.&lt;/li&gt;\n&lt;li&gt;Support the training and development of cardiac physiologist including cardiac physiology students in addition to various professionals that require supportive training as part of their extended roles.&lt;/li&gt;\n&lt;li&gt;To undertake &amp; assist administration support required in the organisation of the day to day running and planning of the service.&lt;/li&gt;\n&lt;li&gt;Maintain accurate written records, which reflect the care you have given.&lt;/li&gt;\n&lt;li&gt;Responsible for the general cleaning of equipment, before &amp; after use as per infection prevention policy. Maintenance of stock consumables and the repair of equipment.&lt;/li&gt;\n&lt;li&gt;Assist in implementing local strategies in line with activity targets and the requirements of the directorate.&lt;/li&gt;\n&lt;li&gt;Assist in monitoring and maintaining quality of service and participate in clinical audits.&lt;/li&gt;\n&lt;li&gt;Ensure that individual practice is up to date including mandatory and professional training or courses.&lt;/li&gt;\n&lt;li&gt;Intermediate Life Support&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be a dynamic active member of the cardiac rhythm management team supporting the delivery of a high quality, safe and compassionate service working closely with patients, multi-disciplinary teams and consultants. Support the training of junior staff and audit activity on a daily basis. To work in line with BHRS guidelines for device follow up service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Fairfield General Hospital has an enviable reputation, great supportive team with a family feel.  Based in the heart of the Hospitals main site, the post holder here will be pivotal in providing the best level of quality care to varying departments and their patients needs.&lt;/p&gt;\n&lt;p&gt;Excellent transport links mean with Bury Interchange as the nearest tram stop and a number of bus stop on the road of the hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;IBHRE Accreditation in devices/BHRS Certificate in devices&lt;/li&gt;\n&lt;li&gt;Ability to perform device check independently and lead follow up clinics&lt;/li&gt;\n&lt;li&gt;Knowledge of bradycardia pacemakers and complex devices including CRT-P’s. CRT-D’s&lt;/li&gt;\n&lt;li&gt;Previous specialised cardiac physiologist experience in a broad range of basic and advanced cardiac investigations&lt;/li&gt;\n&lt;li&gt;Ability to work autonomously in invasive cardiology and specialism&lt;/li&gt;\n&lt;li&gt;Considerable post graduate Experience&lt;/li&gt;\n&lt;li&gt;Working knowledge of various&lt;/li&gt;\n&lt;li&gt;IT systems&lt;/li&gt;\n&lt;li&gt;Able to work under pressure and without peer support&lt;/li&gt;\n&lt;li&gt;Able to organize own workload and that of other staff within specialised area&lt;/li&gt;\n&lt;li&gt;BSc Hons Degree-Clinical Physiology&lt;/li&gt;\n&lt;li&gt;Cardiology ASCST Parts 1&amp; 2&lt;/li&gt;\n&lt;li&gt;Current ILS Certificate&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03330 144 370&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with &lt;em&gt;Katie Phillip&lt;/em&gt;&lt;em&gt;s, Recruitment Consultant on 0333 014 4370 or Katie.Phillips&lt;/em&gt;&lt;em&gt;@nhsprofessionals.nhs.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Highly Specialised Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916217990", "validThrough": "2020-12-31T23:59:59+0000"}