{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £ 44,503"}}, "datePosted": "2020-11-02T11:07:03+0000", "description": "&lt;p&gt;&lt;span&gt;We have an opportunity for a Senior Physiotherapist (Team Leader) to work within our Regional Neurosciences unit working alongside a large team of experienced physiotherapists including Clinical Specialists. There is close working with Consultants and the wider Multidisciplinary team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Experience can be gained in many areas including Neurosurgery, Neurology, acute neuro rehabilitation and stroke. This is an ideal opportunity for someone who wishes to develop their clinical leadership skills and broaden their experience working within these specialty areas.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is a Major Trauma Centre and also has a Specialist Hyper Acute Rehabilitation Pathway (SHARP) for patients with complex needs. Stroke services include a Hyper acute /acute stroke unit (HASU / ASU) on the QEHB site. The successful candidate will join a team of Senior Physiotherapists (Team Leaders) who work together to support the hyper acute and acute phases of care for patients within these areas&lt;em&gt;.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful individual will take a lead role in the advanced assessment and treatment of a variety of complex patients and be proactive in developing and expanding clinical practice in this specialty area. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The individual will have managerial responsibility for a group of both qualified and unqualified staff and provide leadership to that team ensuring the provision of a high standard physiotherapy service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The individual must have significant post registration experience within this clinical area &lt;/span&gt;&lt;span&gt;including acute respiratory skills and have specialist knowledge and skills in the assessment and treatment of a wide range of neurological presentations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The physiotherapy service supports CPD and personal development for all staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Janet Hallam Clinical Lead Physiotherapist &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Janet.hallam@uhb.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;01213713414&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Senior Physiotherapist ( Team Leader) Neurosciences", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251714", "validThrough": "2020-11-16T23:59:59+0000"}