{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-11-03T11:46:23+0000", "description": "&lt;p&gt;Western Sussex Hospitals NHS Foundation Trust are looking to recruit qualified Surgical Care Practitioners or potential trainee Surgical Care Practitioners to work within the Surgical Division at Chichester hospital. The successful candidates will be exceptional, dedicated individuals with the drive and ambition to provide and maintain the highest standards of patient care.&lt;br /&gt;&lt;br /&gt;The Trust wishes to increase the existing SCP team which will be led by a committed Consultant Surgical Directorate. The Surgical Division is committed to developing, training and expanding the role of the SCP within the hospital, delivering excellent patient care and up to date practice, in an environment which encourages personal and professional development.&lt;br /&gt;&lt;br /&gt;Successful applicants must have the ability to work autonomously but also to work collaboratively as part of the multi-disciplinary team, influencing the development of the service. Alongside expert knowledge, clinical and assessment skills (including theatre skills and outpatient clinic experience) you will be expected to demonstrate an ability to communicate and influence at an advanced level.&lt;br /&gt;&lt;br /&gt;We are interested in hearing from qualified Surgical Care Practitioners or suitably qualified healthcare professionals with experience in General Surgery to train as a Surgical Care Practitioner. Trainee SCP&#39;s will be supported to complete the Royal College of Surgeons accredited MSc in Surgical Care Practice via Plymouth University. Trainee SCP&#39;s will be paid band 6 until Sept 2021 then on to a 2 year training contract band 7 annex 21,.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRichard JuniperJob titleLead Surgical Care PractitionerEmail addressrichard.juniper@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Richard Juniper – Lead Surgical Care Practitioner – richard.juniper@wsht.nhs.uk&lt;br /&gt;&lt;br /&gt;Miss Angela Skull - Clinical Director, Consultant Surgeon - angela.skull@wsht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121075.png", "name": "Western Sussex Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121075"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross site working, Chichester", "postalCode": "PO19 6SE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8436", "longitude": "-.768008"}}, "title": "Surgical Care Practitioner / Trainee Surgical Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253797", "validThrough": "2020-11-15T23:59:59+0000"}