{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-23T15:30:37+0100", "description": "&lt;p&gt;37.5 hours per week – permanent.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking a Band 5 HCPC registered Podiatrist to join our diverse team of staff, working across a variety of community, secondary care and domiciliary settings. Practice at band 5 includes extensive wound care management, the provision of care for a wide range of foot pathologies, patient education, peer and multi-professional working and routine MSK care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Podiatry Services at Livewell Southwest provides care on a needs basis in relation to strict access criteria. Access to medical imaging, independent prescribing and secondary care via specialist podiatrists has proved invaluable to our patients and is a key feature of flexibility and support for staff providing general community based care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The service provides integrated care across the commissioned area in both primary care and secondary care and as an organisation provides both physical and mental health services as well as adult social care, further integrating the role of Podiatry into a cohesive health and social care infrastructure.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A comprehensive IT infrastructure is available in all clinical locations and clinicians are supported by service and community based clerical teams who provide administration support.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Livewell Southwest provides a wide range of mandatory training for staff and the service supports its clinicians through in-house training and development opportunities as well as supporting identified learning.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Livewell Southwest values its staff and makes investment in their development a priority. Currently we offer the following development opportunities for staff:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A minimum of three days protected CPD for registered staff  &lt;/li&gt;\n&lt;li&gt;Development pathways for unregistered staff from apprentice to bands 2, 3 and 4 and for registered staff in bands 5, 6, 7 and 8&lt;/li&gt;\n&lt;li&gt;Leadership programmes&lt;/li&gt;\n&lt;li&gt;Coaching and mentoring&lt;/li&gt;\n&lt;li&gt;Medicines Management, leg Ulcer Management and Assessment Training&lt;/li&gt;\n&lt;li&gt;Access and funding for training including Care Certificate, Assistant Practitioners Course and Scholarship Into Nurse Training&lt;/li&gt;\n&lt;li&gt;Robust Preceptorship&lt;/li&gt;\n&lt;li&gt;An induction programme tailored to your needs&lt;/li&gt;\n&lt;li&gt;Relocation package may be considered for the right candidate for certain roles&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Rewards and benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Discounts available from retailers, UK hotels and main attractions – often up to 15% savings&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme and competitive Pension Scheme with Scottish Widows and/or Government Pension scheme (conditions apply)&lt;/li&gt;\n&lt;li&gt;Lease car scheme (available after satisfactory completion of probation/conditions apply)&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme (available after satisfactory completion of probation)&lt;/li&gt;\n&lt;li&gt;School holiday childcare subsidies&lt;/li&gt;\n&lt;li&gt;Multiple flexible working options&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Livewell Southwest can allow existing members of the NHS Pension Scheme to continue their membership when they join the organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All Livewell Southwest staff are expected to able and willing to work across a 7 day service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job share(s) considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal enquiries to:&lt;/strong&gt; Sarah Michael (Podiatry Team Supervisor Services Manager) or Helen Verle (Podiatry Team Supervisor), on 01752 434855 / sarahmichael@nhs.net or helen.verle@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127014.jpg", "name": "Livewell Southwest CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL4 8NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3754", "longitude": "-4.13119"}}, "title": "Podiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241106", "validThrough": "2020-11-09T23:59:59+0000"}