{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T17:15:47+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a motivated and dynamic individual to join the leadership team responsible for Head and Neck Specialties Clinical Service Unit. The role will be based at Manchester Royal Infirmary, predominently within the Manchester Head and Neck Centre.&lt;/p&gt;\n&lt;p&gt;The post will provide the successful applicant with the opportunity to gain experience in a wide variety of operational issues and performance targets due to the varied nature of the specialties, providing surgical and specialised services.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have experience of managing multi-disciplinary healthcare teams, excellent communication skills, meeting targets and deadlines and a strong aptitude for change. You will need excellent organisational skills to co-ordinate the delivery of a comprehensive, high quality service for our patients. You will manage information in relation to the patient pathways, ensuring targets, including 18 weeks, cancer and diagnostic targets are achieved and maintained, and work with the senior unit management team to support service development projects within the CSU.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlison KeyJob titleUnit Manager - Head and Neck SpecialtiesEmail addressAlison.Key@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Royal Infirmary, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Head and Neck Specialties - Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253009", "validThrough": "2020-11-12T23:59:59+0000"}