{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inclusive of HCAS"}}, "datePosted": "2020-10-27T12:31:35+0000", "description": "&lt;p&gt;&lt;strong&gt;Accommodation incentive applicable to this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Barnet Emergency Department is an exciting place to work. We are passionate about getting it right for patients and their families. We are looking for band 5 Adult Nurses who want to be part of a caring and compassionate team.&lt;/p&gt;\n&lt;p&gt;As well as treating acutely unwell adults, our department has an integrated Urgent Care Centre and Paediatric Emergency Department. The Urgent Care Centre within the Emergency Department has Emergency Nurse Practitioners s working with the GPs to deliver an efficient and responsive service for patients presenting with minor injuries and illness. Furthermore, we are a Trauma Unit receiving trauma patients from across Hertfordshire and North London.&lt;/p&gt;\n&lt;p&gt;We are a busy unit receiving up to 90 ambulances per day and over 120,000 patients per year. We pride ourselves on our high quality, safe and effective handover process being forward thinking in our approach for our patients.&lt;/p&gt;\n&lt;p&gt;In addition to this there is a consultant led care of the elderly team who assess older patients for appropriate admission or, with our team of therapists, organise enhanced social care support in the community.&lt;/p&gt;\n&lt;p&gt;Training and support for all staff is key to a happy team and safe patient care, this is why we have a training and development team dedicated to the development of our nurses. We are committed to developing and supporting a modern career framework for our nurses in the Emergency Department and you will be supported every step of your Emergency care career pathway by our senior nurses and Clinical Practice Education team. You will allocate one of the facilitators to support you along with a team leader and mentor. This will include;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Emergency care course- University Accredited&lt;/li&gt;\n&lt;li&gt;BLS / ILS/ ALS&lt;/li&gt;\n&lt;li&gt;ATLS&lt;/li&gt;\n&lt;li&gt;Development programmes for all bands with a preceptorship programme for newly qualified nurses.&lt;/li&gt;\n&lt;li&gt;Protected Supernumerary period.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We recognise the importance of progression and nurturing our own staff, so you will start in ED with a Supernumerary induction programme which is individualised to your professional needs supported by our dedicated team of Practice facilitators. We will help you develop your leadership skills with our in house development programme and support you to attend NHS Leadership Academy Courses and UCL Partners leadership development programmes.&lt;/p&gt;\n&lt;p&gt;If you are interested in working at Barnet ED but not sure if it is for you, we can provide you with opportunities for taster days to shadow some of the team.&lt;/p&gt;\n&lt;p&gt;Barnet Hospital is located in Barnet, a vibrant suburban London Borough with excellent schools, shops and restaurants and fantastic transport links to central London. As part of an exciting new initiative, the trust is offering financial support for those who need to relocate to take up particular roles at Barnet Hospital. The trust also has a dedicated accommodation team who can provide help and advice to new starters on private rental accommodation in the local area. Want to know more? Don&#39;t hesitate to get in touch, please contact our accommodation team (trevor.murtagh@nhs.net).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to social distancing and Covid 19 pressures you will be contacted if successful in shortlisting with further details regarding an interview. We will use Zoom and similar tools to conduct testing and interviews. Due to the challenging times we are experiencing you may be asked to go to different departments and work under difficult circumstances.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dean Heuer - Clinical Practice Educator - 0208216 5007: dean.heuer@nhs.net&lt;/p&gt;\n&lt;p&gt;Loraine Chowdry - Matron - 02082165012: loraine.chowdry@nhs.net&lt;/p&gt;\n&lt;p&gt;Patricia Davies - ED secretary: patricia.davies7@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet Hospital, Barnet", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Band 5 Staff Nurse - Barnet Emergency Department - Adults", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244503", "validThrough": "2020-11-25T23:59:59+0000"}