{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38693", "minValue": "38693", "unitText": "YEAR", "value": "£38,693 + out of hour enhancements"}}, "datePosted": "2020-10-26T03:31:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Emergency General Surgery (EGS) Junior Clinical Fellow (FY3/ST1-ST2)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Following the announcement of our new Emergency General Surgery Unit in Leeds, we are seeking to appoint 4 new full time junior clinical fellow posts. These posts combine emergency surgery on call exposure, elective activity in a base speciality and allotted time for pursuing secondary interests including academia, management/leadership and surgical education. Applicants with interests in general surgery including upper GI, colorectal and hepatobiliary surgery are welcomed. These 4 posts will contribute to the middle grade emergency general surgery rota in the new department which will be led by Professor Giles Toogood, Professor of Hepatobiliary and Emergency Surgery and Mr Andrew Smith, Consultant Surgeon and Lead Clinician.&lt;/p&gt;\n&lt;p&gt;The post will have two start points: the 1st of February 2021 and 1st August 2021.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The applicant is expected to have a major interest in a career in General Surgery. MRCS or equivalent is not essential but basic clinical skills (FY2 or equivalent) should be demonstrated. &lt;br /&gt; The successful applicant should be able to perform at the level expected of a Day 1 Core Surgical Trainee. &lt;br /&gt; Candidates must be fully registered with the General Medical Council.&lt;br /&gt;&lt;strong&gt;We welcome applications from candidates at FY3/ST1 level.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note if sufficient applications are received the post may close early.&lt;/p&gt;\n&lt;p&gt;For more information please contact the following:&lt;br /&gt;&lt;br /&gt;Mr Jim Tiernan, Consultant Colorectal Surgeon: j.tiernan@nhs.net&lt;/p&gt;\n&lt;p&gt;Mr Josh Burke, General Surgery Registrar &amp; Rota coordinator: joshburke@doctors.org.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122472.jpg", "name": "Abdominal Medicine and Surgery", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Emergency General Surgery (EGS) Junior Clinical Fellows", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241617", "validThrough": "2020-11-12T23:59:59+0000"}