{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa (pro rata)"}}, "datePosted": "2020-11-04T11:00:32+0000", "description": "&lt;p&gt;Are you looking for a new challenge?&lt;/p&gt;\n&lt;p&gt;Are you passionate about providing specialist input to respiratory patients in the community setting?&lt;/p&gt;\n&lt;p&gt;Are you looking for an opportunity to contribute to service development in a dynamic and forward thinking team?&lt;/p&gt;\n&lt;p&gt;Are looking for the opportunity to shape and develop the future of community respiratory services? &lt;br /&gt; &lt;br /&gt; We have full and part-time opportunities for physiotherapists with a respiratory background:&lt;/p&gt;\n&lt;p&gt;Part-time 30 hours per week &lt;br /&gt; &lt;br /&gt; The Leeds Community Respiratory Team is made up of specialist nurses, physiotherapists, occupational therapist and clinical support workers providing care and treatment for patients with COPD, supporting early discharge, chronic disease management, pulmonary rehabilitation and the home oxygen service. &lt;br /&gt; &lt;br /&gt; You will deliver pulmonary rehabilitation to patients with chronic lung diseases across Leeds, working closely with respiratory nurses to provide holistic assessment and treatment of patients in their own home, helping manage acutely unwell patients and chronic disease management patients. &lt;br /&gt; &lt;br /&gt; You will deliver therapy specific assessment and treatment, including interpretation of clinical signs and observations, breathing exercises, chest clearance techniques, positioning and home exercise programs for more limited patients. &lt;br /&gt; &lt;br /&gt; You will also have the opportunity to develop skills within the home oxygen service, playing a part in the ambulatory oxygen clinics run in the city. &lt;br /&gt; &lt;br /&gt; Full-time 37.5 hours &lt;br /&gt; &lt;br /&gt; The Respiratory Virtual Ward provides an enhanced package of healthcare to respiratory patients in their own homes for a time limited period. The aim of the service is to prevent hospital admissions and facilitate early supported discharge home. You will be part of a multi-disciplinary team comprising specialist nurses, physiotherapists and clinical support workers supporting patients through an acute episode by management of their symptoms and provision of an enhanced care package within their own home. &lt;br /&gt; &lt;br /&gt; You will provide holistic respiratory assessments and interventions alongside therapy specific assessment and treatment, including interpretation of clinical signs and observations, breathing exercises, chest clearance techniques and positioning. &lt;br /&gt; &lt;br /&gt; We are looking for passionate, dynamic and flexible individuals who are able to adapt to changing demands and workload. You will be a natural leader, enjoy working as part of a multi-disciplinary team and have an interest in service development. &lt;br /&gt; &lt;br /&gt; The respiratory service is a 7 day service and due to the nature of the role, it is essential that you are able to travel independently across the city and have access to a suitable vehicle for business purposes.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123893.jpg", "name": "(SP) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123893"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS7 4BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8115", "longitude": "-1.52622"}}, "title": "Respiratory Physiotherapist Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255488", "validThrough": "2020-11-19T23:59:59+0000"}