{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21027", "minValue": "17051", "unitText": "YEAR", "value": "£17051 - £21,027"}}, "datePosted": "2020-11-03T15:16:15+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Care Co-ordination Administrator&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5 hours (permanent role)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Band 3. £17051 - £21,027&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Compton Care main site&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date - 17/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The aim of the Care Co-ordination service is to provide advice and support for patients and their families/carers who are identified as in their last year of life. Care Co-ordinators will help patients navigate health and social care services and signpost to partner and voluntary organisations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A further aspect of this role is to develop effective and constructive relationships throughout the wider palliative care community within Wolverhampton/Staffordshire in order to facilitate a clear and consistent approach to palliative care provision.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Act as a single point of access for healthcare professionals and patients/families and carers. To sign post and provide information on services as required.&lt;/li&gt;\n&lt;li&gt;To speak on the telephone to patients, relatives, healthcare professionals, social workers and voluntary agencies acting in a professional manner at all times&lt;/li&gt;\n&lt;li&gt;To obtain and accurately document all necessary details from the referring healthcare professional, ensuring that all patient details and care requirements are entered on to the relevant database&lt;/li&gt;\n&lt;li&gt;Know limitations and escalate to senior team members as required&lt;/li&gt;\n&lt;li&gt;To be knowledgeable about services including voluntary that are available in Wolverhampton/Staffordshire and signpost people appropriately&lt;/li&gt;\n&lt;li&gt;To liaise with other areas of Compton Care and external partners for the purpose of developing effective and constructive relationships in order to promote and facilitate the successful coordination of palliative care services&lt;/li&gt;\n&lt;li&gt;To administer referrals for Palliative Care Services using a wide range of technical resources, including dedicated IT-based systems and applications&lt;/li&gt;\n&lt;li&gt;To competently use an electronic patient administration system to access and accurately record patient information.&lt;/li&gt;\n&lt;li&gt;To be able to triage referrals gathering the relevant information to assist the clinician with the clinical triage process&lt;/li&gt;\n&lt;li&gt;To support the continuous development of the service provided by the co-ordination team by actively participating in team meetings, identifying areas for improvement and contributing to discussions to address issues or develop the service&lt;/li&gt;\n&lt;li&gt;To advise agreed services regarding the death of a patient&lt;/li&gt;\n&lt;li&gt;To undertake admin-based duties on behalf of the clinical lead, in particular to enable the efficient provision of accurate data and governance reports&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/133534.jpg", "name": "Compton Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133534"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wolverhampton", "postalCode": "WV3 9DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5858", "longitude": "-2.17206"}}, "title": "Care Co-ordination Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254514", "validThrough": "2020-11-17T23:59:59+0000"}