{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "26000", "unitText": "YEAR", "value": "£26,000 to £30,000 pa"}}, "datePosted": "2020-11-04T15:52:58+0000", "description": "&lt;h1&gt;Medical Engineering Technician&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;JOIN US – HELP US DEVELOP TO ENSURE WE CAN PROVIDE WORLD CLASS SUPPORT SERVICES FOR OUR TEAMS AT BIRMINGHAM WOMEN’S AND CHILDREN’S NHS FOUNDATION TRUST.&lt;/p&gt;\n&lt;p&gt;BWC Management Services Ltd (also known as Vital Services) has been established for over two years and is a wholly owned subsidiary of Birmingham Women’s &amp; Children’s NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Trust provides services at Birmingham Children’s Hospital in the centre of the City, Birmingham Women’s Hospital located at Edgbaston close to the University of Birmingham and a range of mental health services including the inpatient unit, Parkview Clinic, in Moseley. The Trust prides itself in providing world class services including many that have a regional and national reach.&lt;/p&gt;\n&lt;p&gt;The company has circa 300 staff and an annual turnover of £26million; it also manages a capital programme on behalf of the Trust (£20million in 2019/20) and is implementing a fully managed medical equipment service.&lt;/p&gt;\n&lt;p&gt;In the role of a &lt;strong&gt;Medical Engineering Technician &lt;/strong&gt;we are looking for a range of individuals from those with current Medical Engineering experience through to those with suitable general technical experience who want to develop further in the field of Medical Engineering. We are also looking for suitable graduates to undertake training and development to become technicians of the future. You will need ambition and drive to deliver the services we provide for the benefit of patients, their carer’s and staff. An excellent remuneration package including pension will be offered depending on experience.&lt;/p&gt;\n&lt;p&gt;Consideration may be given to appointing candidates into a developmental role with an agreed developmental programme.&lt;/p&gt;\n&lt;p&gt;We will be undertaking the interview process for these posts in early March 2020.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to discuss this job with the Head of Department, please make contact with Medical Engineering on 0121 335 8206.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Vital Services - Birmingham Women's and Children's Management Services Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134935"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B4 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4852", "longitude": "-1.89446"}}, "title": "Medical Engineering Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256514", "validThrough": "2020-11-18T23:59:59+0000"}