{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20000", "minValue": "20000", "unitText": "YEAR", "value": "Up to £20,000pa DoE"}}, "datePosted": "2020-09-25T21:32:24+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you keen to work with young adults with Autism and Learning Disabilities, and make a difference to their lives every day?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We would love you to join our friendly and supportive team in the Adult with Autism residential services in the South region.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity where the successful applicant will work across 2 of our Cygnet Autism South Services based in the Southampton area. The Squirrels cares for up to 9 individuals with autism and behaviours that challenge whilst Devon Lodge cares for up to 12 individuals.&lt;/p&gt;\n&lt;p&gt;We are looking for a confident, enthusiastic and motivated person who is able to share our passions in making the world a better, more accessible place for our residents.&lt;/p&gt;\n&lt;p&gt;Both specialist residential services aim to provide a safe, comfortable and effective care environment for those in our care, promoting independence and community integration. Person-centred planning is at the heart of everything we do, based on the specific needs of the individuals in our care. Residents can build upon earlier learnt skills to achieve further independence, self-advocacy and confidence leading to better quality of life.&lt;/p&gt;\n&lt;p&gt;Join our supportive friendly team based in an area of outstanding beauty and make an application today.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;5 easy reasons why you should make an application today…&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;We care passionately about people in our services, and the staff supporting them&lt;/li&gt;\n&lt;li&gt;We support your development, offering you regular supervision and training opportunities and a support network of 50 Cygnet-employed SLTs&lt;/li&gt;\n&lt;li&gt;You will also be a valued member of our friendly and supportive multi-disciplinary team comprised of OTs, SLTs, Psychologists, Assistant Psychologists and a Consultant Psychiatrist serving the residential services. The team work in collaboration to deliver effective strategies to support the residents in our care.&lt;/li&gt;\n&lt;li&gt;A fixed caseload with scope to offer person-centred communication support&lt;/li&gt;\n&lt;li&gt;Beautiful location on the South Coast and New Forest National Park&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We welcome any queries or questions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post:&lt;/strong&gt; Specialist Speech and Language Therapist&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location(s):&lt;/strong&gt; Adults with Autism Residential services (South) - The Squirrels and Devon Lodge (Southampton)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible for:&lt;/strong&gt; The post holder will be responsible for the assessment and management of speech and language therapy-related needs of individuals in our care&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsible to&lt;/strong&gt;&lt;strong&gt;:&lt;/strong&gt; Director of Speech and Language Therapy&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 24 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role please contact Dominique St Clair Miller, Deputy Director of SLT (07885 476 384) , Carla Bartlett, Director of SLT (07803 248 026) or our in-house recruiter Hayleyvalentine@cygnethealth.co.uk.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What does the role involve?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Speech and Language Therapist (SLT), you will manage a caseload of clients to maximise their potential and enable them to enjoy the best possible quality of life via the delivery of an evidence-based SLT service.&lt;/p&gt;\n&lt;p&gt;You will promote effective functional communication, social skills development, collaborative working and a total communication environment.&lt;/p&gt;\n&lt;p&gt;You will assess communication needs, whilst implementing and developing the SLT programme according to client&#39;s diagnosis and identified needs. You will be involved in setting SMART targets and using appropriate outcome measures to evaluate the effectiveness of interventions.&lt;/p&gt;\n&lt;p&gt;This role involves working as part of an interdisciplinary team and you will also work closely alongside and provide support to a Band 5 Speech &amp; Language Therapist.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have...&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A degree / postgraduate diploma (or equivalent) in Speech and Language Therapy along withHCPC Registration&lt;/li&gt;\n&lt;li&gt;Membership of the RCSLT (Royal College of Speech and Language Therapists) or equivalent&lt;/li&gt;\n&lt;li&gt;Experience working with a client population who presents with a diagnosis ofAutism (ASD) / Learning Disability, along withcomplex needs andbehaviours that challenge&lt;/li&gt;\n&lt;li&gt;Experience in managing Dysphagia (desirable)&lt;/li&gt;\n&lt;li&gt;The ability to work autonomously and as part of an interdisciplinary team&lt;/li&gt;\n&lt;li&gt;Excellent communication / time management skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Why Cygnet?We&#39;ll offer you...&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary: £20,000 (based on 24hrs per week)&lt;/li&gt;\n&lt;li&gt;Company pension scheme&lt;/li&gt;\n&lt;li&gt;NHS and employee discount scheme&lt;/li&gt;\n&lt;li&gt;Free meals&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;Internal / external CPD and research opportunities&lt;/li&gt;\n&lt;li&gt;Expert clinical supervision from the Deputy Director of Speech &amp; Language Therapy and peer support&lt;/li&gt;\n&lt;li&gt;Opportunities for further training, broaden experience and enhance service development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; Contracted Hours:24 hours between Monday to Friday. We will consider applications from those seeking flexible working arrangements.&lt;br /&gt; &lt;br /&gt; The successful candidate will be required to undergo an enhanced DBS and reference check and an offer of employment will be subject to successful clearance.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;What next?&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; CygnetHealth Care have been providing a national network of high quality specialist services for over 30 years.&lt;/p&gt;\n&lt;p&gt;If you care about making a difference – we want to talk to you!&lt;/p&gt;\n&lt;p&gt;Click the link to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note - speculative recruitment calls need to go via our internal recruitment team. If speculative candidates are sent directly to a member of the clinical team, we will consider these candidates as our own&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "23A Grange Rd, Hedge End, Southampton", "postalCode": "SO30 2FL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9185", "longitude": "-1.29629"}}, "title": "Band 6 Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916201522", "validThrough": "2020-11-27T23:59:59+0000"}