{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T14:45:54+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced Learning Disability nurse to join the Adult Learning Disability Community Health Team in West Lancashire on a 10 month fixed term contract.&lt;/p&gt;\n&lt;p&gt;The Learning Disability Community Service strives to provide forward thinking high quality services, working in partnership with other agencies. In addition to working with people with learning disabilities and their families we have a strong commitment to health promotion through service development and training initiatives. We are committed to helping our staff develop and you will be part of an enthusiastic and experienced team.&lt;/p&gt;\n&lt;p&gt;We are looking for a registered nurse with an up to date knowledge of health policy for people with learning disabilities including a working knowledge of the Transforming Care agenda. Adaptability, good communication skills and self –motivation are essential as is the ability to support and supervise colleagues.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have proven skills in working with people who have complex health needs and challenging behaviour. An interest in one of the following areas would also be advantageous: Positive Behavioural Support, mental health, forensic issues, and acute/primary care liaison. You will also be able to demonstrate that your practice is evidence based and innovative.&lt;/p&gt;\n&lt;p&gt;A means of transport is essential and applicants must be willing to undergo an enhanced DBS check.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Maxine Rigby on 01695 684340 / 01772 777494&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ormskirk Hospital, Ormskirk", "postalCode": "L39 2JW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5645", "longitude": "-2.87161"}}, "title": "Community Learning Disabilies Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247036", "validThrough": "2020-11-11T23:59:59+0000"}