{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18171", "minValue": "18171", "unitText": "YEAR", "value": "£10.81 Per Hour"}}, "datePosted": "2020-10-30T11:53:48+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you highly organised and have co-ordination skills?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for someone to join one of the surgery teams to help ensure a smooth Patient process from start to finish.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The University Hospital Southampton NHS Foundation Trust provides services to 1.9 million people living in Southampton and south Hampshire, while also providing specialist services such as neurosciences, cardiac services, and children&#39;s intensive care to the wider area.&lt;/p&gt;\n&lt;p&gt;The Trust is made up of 6 locations with Southampton General Hospital being the largest, running specialist services, emergency, and critical care along with outpatient clinics, diagnostic and treatment work, surgery, research, education and training. This is a large and busy site.&lt;/p&gt;\n&lt;p&gt;The Trust is driven to provide world-class care for all and have a mission that “together we care, innovate and inspire”, does this sound like the place for you?&lt;/p&gt;\n&lt;p&gt;We have an ongoing placement available for a &lt;strong&gt;Patient Pathway Co-ordinator&lt;/strong&gt; within Surgury at Southampton General Hospital (Tremona Road, Southampton, SO16 6YD)&lt;/p&gt;\n&lt;p&gt;The role starts as soon as possible and is ongoing with no confirmed end date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt; &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;To start you will need to be able to provide a reference covering a 6-month period of employment in the last 3 years&lt;/em&gt;&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;The working hours are Monday to Friday, 8.00 - 16.00 totalling 37.5 hours a week.&lt;/p&gt;\n&lt;p&gt;This is a band 3 post and paying £10.81 an hour.&lt;/p&gt;\n&lt;p&gt;The main purpose of this role is to work within dedicated speciality clinical areas to facilitate the smooth running of the patient journey by ensuring that co-ordinated and streamlined administrative processes revolve around the patient and their individual needs. While also to provide cross-cover for other Patient Pathway Co-ordinators to ensure a consistent and effective administration service is maintained at all times.&lt;/p&gt;\n&lt;p&gt;Other duties include&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide all areas of administrative support to the team.&lt;/li&gt;\n&lt;li&gt;Implement all administrative processes along the patient pathway to ensure the patient’s journey is managed efficiently, smoothly and in accordance with targets and agreed timescales.&lt;/li&gt;\n&lt;li&gt;Utilise computerised tracking systems to locate case notes and investigation results.&lt;/li&gt;\n&lt;li&gt;Liaise with Private Patient Co-ordinators where appropriate to ensure a seamless patient journey.&lt;/li&gt;\n&lt;li&gt;Ensure patient information is maintained and updated on the appropriate patient information system.&lt;/li&gt;\n&lt;li&gt;Monitor work lists for Choose and Book to monitor Consultant workflow and escalate to Team Leaders if necessary.&lt;/li&gt;\n&lt;li&gt;Ensure referral grading outcomes are logged on the appropriate patient information system.&lt;/li&gt;\n&lt;li&gt;Provide patient administration service for regional clinics  - Setting up clinics in liaison with consultants, managing clinic capacity in liaison with consultants, requesting and tracking medical records.&lt;/li&gt;\n&lt;li&gt;Other general administrative duties&lt;/li&gt;\n&lt;li&gt;Provide P.A. duties for a number of Consultants within the clinical speciality area, including maintenance of diaries, appointments, co-ordination of leave, co-ordination of expense forms, correspondence derived from any educational / supervisory or research activity.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;They are looking for someone who&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Has strong administrative and organisation skills being able to work well under pressure&lt;/li&gt;\n&lt;li&gt;Has previously worked as a medical of patient services secretary linked to a clinical service or customer focused environment.&lt;/li&gt;\n&lt;li&gt;Is proficient in all aspects of Microsoft Office.&lt;/li&gt;\n&lt;li&gt;Has knowledge of medical terminology&lt;/li&gt;\n&lt;li&gt;Has excellent telephone/communication skills&lt;/li&gt;\n&lt;li&gt;Has proven ability to work to deadlines, prioritise and multi-task.&lt;/li&gt;\n&lt;li&gt;Has a high attention to detail at all times&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Do you have these skills?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IF YES … We look forward to hearing from you soon!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 6YD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.933", "longitude": "-1.4351"}}, "title": "Patient Pathway Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250041", "validThrough": "2020-11-13T23:59:59+0000"}