{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28577", "minValue": "28577", "unitText": "YEAR", "value": "£17 PH"}}, "datePosted": "2020-10-22T14:55:44+0100", "description": "&lt;p&gt;ur Physiotherapy team in Tunbridge Wellscurrently have an opportunity for aBank InpatientPhysiotherapist.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation, where we offer a number of flagship programmes, which our Physiotherapists support the delivery of; from our Joint Pain programme, Cystic Fibrosis programme and School SWAP these are designed to deliver excellent clinical care as well as benefit the local communities, using our state of the art facilities and expert knowledge colleagues.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As part of the team you will have clinical support available from your colleagues onsite, with leadership from the management team on site.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Role&lt;br /&gt;&lt;br /&gt;You will treat pot-op patient&#39;s on the ward, including orthopaedic and general surgery patients.&lt;br /&gt;&lt;br /&gt;You will work within a multidisciplinary team including nurses, AHPS and consultants in order to optimise the health and recovery of our patients.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Deliver high quality, effective clinical care.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Adhere to our values and beliefs at Nuffield Health, in which we encourage behaviour which is enterprising, passionate, independent and caring.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Deliver excellent clinical care that is evidence based, Safe, Effective, Caring, Well-led and responsive to our patient’s needs.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Ensure on-going monitoring of the standard of treatment provided&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be compliant with all professional, clinical and integrated governance standards and participate in clinical audit and other quality assurance processes&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;The Person&lt;br /&gt;&lt;br /&gt;To succeed as a Physiotherapist you will;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Have a BSc in Physiotherapy or equivalent, you’ll be registered with the Health and Care Professions Council.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Demonstrate evidence of further professional training and continual professional development, reflecting your desire to develop as a practitioner.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be a confident communicator with the ability to engage effectively with the general public and other healthcare professionals.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be able to demonstrate excellent manual therapy skills.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be a competent and confident IT user with strong organisation skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have the ability to prioritise and deal with your varied workload in an effective and timely manner.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Benefits&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Holiday in line with the Working Time Directive.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to our Pension Scheme.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Discounted gym membership at £15.00 a month that they need to set up directly with the club. Discount does not extend to partners and family members.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working on the bank means you are not contracted to a set number of hours per week but instead work on an ad-hoc basis to suit the needs of the business and your availability.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Salary - £17 Per Hour&lt;br /&gt;Location - Tunbridge Wells Hospital&lt;br /&gt;Contract Type- Bank&lt;br /&gt;Weekly Hours - Various Hours&lt;br /&gt;Closing date - 19/11/2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tunbridge Wells", "postalCode": "TN2 4UL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1315", "longitude": ".278081"}}, "title": "Bank Inpatient Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239018", "validThrough": "2020-11-19T23:59:59+0000"}