{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005  / £19,337"}}, "datePosted": "2020-11-03T16:46:18+0000", "description": "&lt;p&gt;We are recruiting Band 2 Health Care Assistants who demonstrate a kind and caring personality and a passion for looking after medically unwell patients at Dalgliesh Ward Melton Mowbray Community Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Part Time and Full Time posts are available&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Job Type: Permanent&lt;/p&gt;\n&lt;p&gt;Dalgliesh ward has recently been awarded with SILVER in their accreditation&lt;/p&gt;\n&lt;p&gt;Dalgliesh in-patient ward provide multidisciplinary support and care planning to patients with complex medical needs, rehabilitation and end of life care..&lt;/p&gt;\n&lt;p&gt;You will be part of a forward thinking team and need to demonstrate a commitment to ensuring our patients receive excellent individualised care while promoting independence.&lt;/p&gt;\n&lt;p&gt;The main role of the Health Care Assistant is to assist in the delivery of prescribed programmes of patient care with compassion and Integrity.&lt;/p&gt;\n&lt;p&gt;We are looking for Health Care Assistants to work on our ward and contribute to the care of our patients with kindness, care and empathy. We need HCAs with good communication skills, a passion for working on our wards and a clear understanding of the role of the HCAs within the team to support the care of our patients.&lt;/p&gt;\n&lt;p&gt;A willingness to engage in developing both yourself and the service is essential.&lt;/p&gt;\n&lt;p&gt;We actively encourage development and aim to provide a flexible workforce to meet service needs. This will include internal rotation to cover a 24hr 7-day service and the ability to work in other localities/departments.&lt;/p&gt;\n&lt;p&gt;If you want to make a difference to patients and their families, feel a sense of achievement in your job and that your work can make an impact on local people’s lives then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;You must be a good team player and have a compassionate and sensitive approach. Previous care experience in a hospital or care home though advantageous is not essential. A basic level of IT competence is required.&lt;/p&gt;\n&lt;p&gt;All candidates who meet the essential criteria will be asked to attend for a numeracy and literacy assessment.&lt;/p&gt;\n&lt;p&gt;References and Disclosure and Barring Service (DBS) will be requested for successful applicants.&lt;/p&gt;\n&lt;p&gt;If successful, you will be supported to complete an induction programme.You will be supported to complete the Care certificate&lt;/p&gt;\n&lt;p&gt;In addition we offer: free parking on all our sites.&lt;/p&gt;\n&lt;p&gt;For more information please contact: Lisa Farmer 07919396252&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dalgleish Ward - Melton Mowbray Leicestershire", "postalCode": "LE14 3QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8162", "longitude": "-.976463"}}, "title": "Band 2 Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254845", "validThrough": "2020-11-10T23:59:59+0000"}