{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19737", "minValue": "19737", "unitText": "YEAR", "value": "£19737"}}, "datePosted": "2020-10-29T12:16:11+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Ward Clerk / Receptionist to join the Specialist Surgery team. We cater for a variety of specialities including Plastic reconstructive surgery, ENT, Ophthalmology and Maxillofacial surgery. Our friendly department consists of a 30 bed mixed ward and a day surgery unit for elective and emergency surgeries and a GP referral unit.&lt;/p&gt;\n&lt;p&gt;The post holder will need to have administrator and have good communication skills. You will need to be organised, to have an ability to manage time effectively and to work well in a team environment. You will need to have experience with EPR and be prepared to undertake further training as required.&lt;/p&gt;\n&lt;p&gt;The role will involve meeting and greeting patients and their families coming to into Specialist Surgery In-Patient Ward, Day Surgery and GPRU and HAPI clinic, inputting patient details onto the patient administrative system, requesting and tracking patient notes, taking telephone calls, admitting and discharging patients on EPR.&lt;/p&gt;\n&lt;p&gt;The successful post holder will play a vital role in ensuring clerical and administrative support if maintained and upheld in the ward and clinics. The post holder is expected to have good interpersonal skills and communicate with the multi-disciplinary team. You will be working very closely with the nursing team in general and specifically, provide administrative support to the senior nurse team.&lt;/p&gt;\n&lt;p&gt;Previous experience would be advantageous, but full training on the hospital systems will be given.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to work in all areas and Early and Late shifts.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Specialist Surgery I/P Ward 169385, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Ward Clerk Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248290", "validThrough": "2020-11-08T23:59:59+0000"}