{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34629", "minValue": "27936", "unitText": "YEAR", "value": "£27,936 - £34,629 per annum inclusive of HCAS"}}, "datePosted": "2020-10-27T12:32:15+0000", "description": "&lt;p&gt;The Royal Free Trust, Barnet Hospital Critical Care team is looking to appoint Newly Qualified Nurses to join our critical care team. We are seeking to appoint motivated and dynamic Band 5 Registered Nurses who wish to pursue structured Band 5 to 6 critical care development programme, based on meeting required competencies.&lt;/p&gt;\n&lt;p&gt;The Barnet Intensive Care unit comprises of 23 beds, 9 level 3 and 14 level 2. The unit admits in excess of 1,000 patients per year. Specialties include general medical and surgical patients, patients requiring renal replacement therapies, spinal, plastic and complex lower GI.&lt;/p&gt;\n&lt;p&gt;You will begin your journey as a qualified nurse with a nine month placement on one of our acute surgical wards. This enables you to undertake a period of structured transition from a newly registered nurse through to a competent practitioner through the Preceptorship course.&lt;/p&gt;\n&lt;p&gt;You will be supported by a preceptor, to develop confidence as an autonomous professional, refine skills, values and behaviours and to continue on your journey of life-long learning.&lt;/p&gt;\n&lt;p&gt;When you start on ITU, in order to equip you with the correct knowledge, skills and attitude to become a competent and confident critical care Registered Nurse, we will provide you with:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supernumerary orientation programme between 4 and 6 weeks (depending on progression).&lt;/li&gt;\n&lt;li&gt;Access to the Unit based education team to support, guide and individualize your professional development.&lt;/li&gt;\n&lt;li&gt;Allocation into a team with a Band 7 leader. Your team will also consist of your mentor and co-mentor.&lt;/li&gt;\n&lt;li&gt;Attendance on an “Introduction to Intensive Care Course”. This course is run over six months, will give you 15, Level 6 Credits and is accredited to the University of Greenwich. After completion you will consolidate your practice in preparation for undertaking the nationally accredited Royal Free Postgraduate Intensive Care Course.&lt;/li&gt;\n&lt;li&gt;Experienced Band 5 Registered Nurses will be supported and allocated a place on the nationally recognized Royal Free Postgraduate Intensive Care Course which is accredited to the University of Greenwich. This is a 6 month course and on completion will give you 30, Level 6 Credits.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You may be placed in one of the following surgical wards:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;DAMSON WARD&lt;/strong&gt; – is a 24 bedded acute surgical ward which provides the opportunity to develop professionally in managing patients with colorectal diseases including the management of malignant diseases and other surgical conditions&lt;/p&gt;\n&lt;p&gt;The ward has a strong, well led, organised and established team which focus on opportunities for you to reflect on your continuing professional development, competencies and knowledge. The ward has a clinical practice educator in post to provide opportunities for you to develop new skills and knowledge whilst providing guidance and support for you to meet your aims and learning objectives&lt;/p&gt;\n&lt;p&gt;The team also has professional input from the multidisciplinary team on a daily basis including clinical nurse specialists for example; stoma management, wound management and pain management&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CEDAR WARD&lt;/strong&gt; – a 24 bedded ward with opportunity to nurse a variety of general surgical patients but specialise in ear, nose, throat &amp; maxilla-facial and are the dedicated ward for patients with surgical tracheostomies. Care is provided to a variety of surgical and orthopaedic patients, some with complex wounds, and you will have the opportunity to be involved in the assessment and management of these patients. Cedar ward has a clinical practice educator who will support with your development&lt;/p&gt;\n&lt;p&gt;The team has also professional input from the multidisciplinary team on a daily basis.&lt;/p&gt;\n&lt;p&gt;The ward has a happy and friendly team which is supported by strong leadership and are welcoming to both patients and staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BEECH WARD – &lt;/strong&gt;24 bedded trauma and orthopaedic ward with strong multi-disciplinary team work. Beech receives patients from the London trauma units and in particular spinal patients who require specialised care.&lt;/p&gt;\n&lt;p&gt;You will be supported by the committed ward clinical practice educator who will guide you through your experience on Beech ward and will prepare you for ITU&lt;/p&gt;\n&lt;p&gt;The nursing team work cohesively together and are led by a ‘caring hands on’ ward sister.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WILLOW WARD – &lt;/strong&gt;17 bedded surgical ward, which specialises in the care of patients with gynaecological problems. The ward is currently welcoming a new but experienced ward sister so this is a great opportunity to be part of the development of a new leadership team, who will equally support you during your time on Willow ward. The surgical clinical practice educators will help guide you and prepare you for ITU.&lt;/p&gt;\n&lt;p&gt;Willow ward is a welcoming team who support each other well.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General comment for all wards&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As you can see we are committed to developing and supporting a modern career frame work for our nurses in critical care and you will be supported every step of your critical care career pathway by our Clinical Practice education team and senior team.&lt;/p&gt;\n&lt;p&gt;This includes support from a committed matron team who job share, but who offer different learning experiences. We very much focus on staff wellbeing and our aim is for you to have the best experience available to you and look forward to you joining us for your 1st 9 months in the trust as newly qualified nurses&lt;/p&gt;\n&lt;p&gt;Please note that these vacancies may close prior to the advertised closing date, subject to the high number of applicants anticipated.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to social distancing and Covid 19 pressures you will be contacted if successful in shortlisting with further details regarding test (if required) and interview. We will use Microsoft Teams to conduct testing and interviews. Due to challenging times we are experiencin&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet Hospital, Barnet", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Band 5 Staff Nurse - ITU Newly Qualified", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244527", "validThrough": "2020-11-25T23:59:59+0000"}