{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-11-04T14:01:04+0000", "description": "&lt;p&gt;An exciting opportunity has arisen on the Regional Infectious Diseases Unit at North Manchester General Hospital, North Manchester Care Organisation for Band 5 Staff Nurses to join the team on J3/4. The ward can welcome and support Newly Qualified Nurses and return to practise nurses with a strong preceptorship programme and an experienced senior nurse team who are always on hand to provide teaching and support within the ward environment.&lt;/p&gt;\n&lt;p&gt;The ward can support urgent care, medical or surgical nurses who are keen for a change but are not looking to step away from a busy acute environment. The ward manages patients of all different specialities and welcomes the experience of others.&lt;/p&gt;\n&lt;p&gt;The ward can support community nurses who are looking for a change and a new challenge but are apprehensive about returning to a hospital environment.&lt;br /&gt;&lt;br /&gt;We are a 26 bedded mixed sex unit that comprises mainly of isolation rooms. Strict infection control measures are a priority for all our patients and you will be taught how to nurse patients in isolation as well as additional skills on how to manage potential high consequence infectious diseases as well as adhering to ward, hospital and national policies.&lt;br /&gt;&lt;br /&gt;The unit provides care for acutely unwell patients with infectious diseases and tropical infections. The unit also manages patients with newly diagnosed Blood borne Virus and patients living with long term conditions such as HIV. The unit looks after all patients who require management of infections from &#39;top to toe&#39; this could be complex brain infections such as encephalitis or meningitis or complex wound infections such as osteomyelitis of the foot (and everything in between)&lt;br /&gt;&lt;br /&gt;It is the recognised centre accepting referrals for Middle Eastern Respiratory Syndrome and returning travelers who may have Viral Haemorrhagic Fever including Ebola.&lt;br /&gt;&lt;br /&gt;The unit houses a higher acuity care facility. Staff Nurses applying for this position should expect to work in both areas. The unit will support staff in delivering high flow oxygen therapy, arterial line monitoring and cardiac monitoring. You will be supported in undertaking Immediate life support and additional clinical skills if you do not hold these qualifications.&lt;/p&gt;\n&lt;p&gt;The unit works closely with many other specialties and can provide the perfect opportunity to strengthen knowledge around safeguarding, tissue viability and infection prevention. As well as more ward specific specialities such as HIV, TB and hepatitis.&lt;/p&gt;\n&lt;p&gt;The unit was at the forefront of the covid preparation and management across greater Manchester.&lt;/p&gt;\n&lt;p&gt;The unit is currently heavily involved in a number of initiatives and collaborative to improve patient safety. This is an exciting opportunity for nurses who are passionate about patient experience and harm prevention to engage in the future development of the care we deliver.&lt;br /&gt;&lt;br /&gt;You will hold registration with NMC and demonstrate an interest in the specialty.&lt;/p&gt;\n&lt;p&gt;The senior nurse team recognises the importance of a healthy work life balance and therefore will consider applications for part time and full time applicants as well as those who may require specific regular out of hours working.&lt;/p&gt;\n&lt;p&gt;In line with the Trust&#39;s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, nationality, religion, marital status, social background or trade union membership.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Charlotte Murray&lt;br /&gt;Ward Manager&lt;br /&gt;charlotte.murray2@pat.nhs.uk&lt;br /&gt;0161 720 2540&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, North Manchester Care Organisation, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Staff Nurse - Infectious Diseases", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256127", "validThrough": "2020-11-18T23:59:59+0000"}