{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 to £35,207 per annum inc"}}, "datePosted": "2020-10-26T08:17:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Shape your story at Whipps Cross University Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The redevelopment of Whipps Cross is a once-in-a-lifetime opportunity to design a new hospital from scratch. It is also a unique chance to be at the forefront of national efforts to transform how healthcare is provided for local people, as set out in the NHS Long-Term Plan. Do you wish to be part of this journey with us?&lt;/p&gt;\n&lt;p&gt;First opening over a hundred years ago, our team at Whipps Cross have one of the busiest A&amp;E departments in the country with more than 152,000 patients attending each year. Other departments are just as busy with over 77,000 inpatient stays and 381,000 outpatient appointments.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Emergency Surgical (Sage) Ward in the recruitment of a highly motivated and dynamic band 5 nurse. The successful candidate must be an innovative, hardworking and enthusiastic adult nurse with a broad range of skills and experiences or you could be newly qualified nurse who wish to learn new skills with our newly established team. We are seeking to appoint a compassionate and caring nurse who will be able to work closely with the Sage Ward team to deliver outstanding care for the patients in East London &amp; beyond.&lt;/p&gt;\n&lt;p&gt;London is one of the most exciting places in the world to live and work. While you work in our hospital, you will meet people from all over the world and from all walks of life and you will never be bored. London has so much to offer you in your spare time, whatever your hobbies or interests, yet we are in the heart of east London and you will very much be part of your local community. This part of London is a fantastic place to live and work, with a bustling, community feel and beautiful green spaces.&lt;/p&gt;\n&lt;p&gt;For more information or to discuss in more detail please contact&lt;/p&gt;\n&lt;p&gt;Karen Williamson- Ward Manager (karen.williamson14@nhs.net).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For more information please on contact Matron Rahul Luka ( rahul.luka@nhs.net, 0208 539 5522 blp 2017) or Senior Nurse Ruth Green ( ruth.green6@:nhs.net, 0208 539 5522 blp 2725).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whipps Cross Hospital, London", "postalCode": "E11 1NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5788", "longitude": ".002666"}}, "title": "Surgical Rotation Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241718", "validThrough": "2020-11-09T23:59:59+0000"}