{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata"}}, "datePosted": "2020-10-27T09:31:35+0000", "description": "&lt;p&gt;Are you a skilled and enthusiastic Speech and Language Therapist with experience in stroke rehab, looking for a supported opportunity to develop your career in a new evolving service across across Blackpool, Fylde, Wyre &amp; North Lancashire?&lt;/p&gt;\n&lt;p&gt;With a variety of part time hours available to support work life balance, agile working to enable an innovative approach to your practice and the successful candidate being provided with support to access training to meet personal and service needs, this could be the ideal career opportunity for you.&lt;/p&gt;\n&lt;p&gt;This stroke early supported discharge role within the Integrated Stroke and Neurorehabilitation Service could be your stepping stone to pursue a job in the area and make a difference to clients and their families. This will provide you with the opportunity to support clients through rehabilitation to improve their independence, quality of life and avoid any unnecessary hospital stays, working with them in various settings within community including their own home, care homes, clinics etc.&lt;/p&gt;\n&lt;p&gt;On the Fylde Coast we are proud to be a leader in integrated working which will offer you the chance to work with other health and social care professionals within a highly skilled multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new opportunity and being involved at the start for a new evolving service this job opportunity is right for you. If you would like to understand more about the role please contact us or arrange a visit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa LittlerJob titleIntegrated Community Stroke &amp; Neurorehab Service ManagerEmail addresslisa.littler@nhs.netTelephone number01253 951686&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool, Fylde &amp; Wyre Community", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Senior Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243847", "validThrough": "2020-11-10T23:59:59+0000"}