{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-11-04T12:01:30+0000", "description": "&lt;p&gt;Principal Psychologist/Forensic Psychotherapist&lt;/p&gt;\n&lt;p&gt;This post offers a unique opportunity for an experienced practitioner psychologist/forensic psychotherapist with established leadership skills to be involved in the development, implementation and evaluation of a large and complex new Provision PIPE (Psychologically Informed Planned Environment) based at HMP Holme House in Stockton on Tees.&lt;/p&gt;\n&lt;p&gt;The post is located within a nationally commissioned partnership framework between the NHS and prison/probation services and requires highly developed communication and team work skills appropriate for a multi-agency partnership. Key relationships are with prison programme and operational staff, probation staff and NHS staff from mental health and personality disorder services as well as a well-established national PIPE network system. Core skills are in training, individual and group supervision and leadership in ensuring that the new unit provides and maintains an effective relational model and adheres to Enabling Environment principles to support emotional well-being, trauma-informed care and recovery. The Clinical Lead will join a staff team within the prison who have been recruited with these principles in mind and where they have been supported enthusiastically and consistently at all levels of the partner organisations in moving to the operational phase, despite the recent challenges created by the novel pandemic context.&lt;/p&gt;\n&lt;p&gt;If you see yourself as part of the leadership team bringing this eagerly anticipated development to fruition, please ask for further details.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Gail McGregor&lt;/p&gt;\n&lt;p&gt;Job title: Associate Psychological Services Director&lt;/p&gt;\n&lt;p&gt;Email address: gail.mcgregor@cntw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0191 246 7269&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Holme House, Stockton on Tees", "postalCode": "TS18 2QU"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5766", "longitude": "-1.29307"}}, "title": "Principal Clinical Psychologist/Principal Psychological Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255721", "validThrough": "2020-11-18T23:59:59+0000"}