{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa inc"}}, "datePosted": "2020-11-04T13:31:04+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Neonatal Practice Educator&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fast forward your Neonatal nursing career at Imperial. With five world-renowned hospitals, we are full of opportunity for nurses who are moving for progression to develop new skills.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated candidate interested to further self-develop to provide 12 months fixed term contract maternity cover as a Neonatal Practice Educator (Band 7) cross site.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Our neonatal service provides care to high risk, critically ill neonates as a Level 3 and Level 2 neonatal unit which is split over 2 sites with an overall capacity of 46 cots.&lt;br /&gt; You will need to work across the Imperial Neonatal service situated across St Mary’s and Hammersmith (QCCH) Hospital sites.&lt;/p&gt;\n&lt;p&gt;To develop strategies for education and training within the Neonatal Service.&lt;/p&gt;\n&lt;p&gt;To be an expert practitioner and change agent in neonatal nursing, promoting lifelong learning.&lt;/p&gt;\n&lt;p&gt;Work with Ward Managers and Matron’s, identify and support opportunities for learning in all clinical areas of the Imperial Neonatal Service.&lt;br /&gt; &lt;br /&gt; To be a role model for leadership, training, coaching and assessing staff development at all levels.&lt;/p&gt;\n&lt;p&gt;To support staff to deliver high quality effective care for patients thus improving the patients’ experience.&lt;br /&gt; &lt;br /&gt; Contribute to the development of programmes of education and training, whilst demonstrating awareness of cultural diversity in the workplace and the need to adapt training accordingly.&lt;br /&gt; &lt;br /&gt; Ensure all nursing practices in clinical areas are carried out in accordance with the NMC, Trust and local policiesontribute to developing clinical competencies programmes  for all staff in partnership with the Neonatal Service Education Team, Senior Sisters/Charge Nurses and ward staff.&lt;br /&gt; &lt;br /&gt; Have excellent communication skills and ability to train clinical and nonclinical staff.&lt;br /&gt; &lt;br /&gt; Be a member of the NWLODN attend and contribute to the meetings. Get involved in quality improvement and collaborate with leading neonatal teams.&lt;br /&gt; &lt;br /&gt; Work together as part of the Trust’s Children’s education team.&lt;br /&gt; &lt;br /&gt; • Members of the Neonatal and Paediatric education team&lt;br /&gt; • University link tutors&lt;br /&gt; • Senior Nurse, Children’s services&lt;br /&gt; • Deputy Divisional Director of Nursing, Children and safeguarding&lt;br /&gt; • Neonatal Matrons and senior nursing team&lt;br /&gt; • Paediatric Site Practitioner team&lt;br /&gt; • All members of the nursing team&lt;br /&gt; • Student nurses&lt;br /&gt; • Neonatal service Consultants&lt;br /&gt; • Members of the multi-professional teams&lt;br /&gt; • Patients, families and visitors&lt;/p&gt;\n&lt;p&gt;The Trust reserves the right to close this vacancy prior to the closing date should we receive 50 applications prior to the advertised closing date.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; We are committed to equal opportunities and improving the working lives of our staff and will consider applications to work flexibly, part-time or job share. Please talk to us at interview about the flexibility you may need.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 7 Neonatal Practice Educator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256030", "validThrough": "2020-11-18T23:59:59+0000"}