{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18005", "minValue": "18005", "unitText": "YEAR", "value": "Starting salary £18005 pro rata"}}, "datePosted": "2020-11-06T14:00:39+0000", "description": "&lt;p&gt;&lt;br /&gt;Based at Highbury Hospital, the Hotel Services Team aim to provide a high quality service that enhances the environment of care for our patients and visitors.&lt;/p&gt;\n&lt;p&gt;An excellent opportunity has arisen for enthusiastic and flexible individuals to undertake the role of Facilities Assistant working at Highbury Hospital. Predominantly you will be working as a domestic assistant within a small response team providing additional cleaning to ward areas, offices and general circulation areas although duties in other departments (catering, laundry, portering) within Hotel Services may also be necessary when required. Morning and afternoon shifts are available, 4 hours per day - 8am to 12 noon or 3pm to 7pm working on a rota Monday to Sunday.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There will be a requirement for you to work on areas where Covid-19 positive patients or staff may be or have been present. However we ensure Covid secure areas and practices are adhered to supplemented by appropriate and necessary PPE and full training.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We may request references prior to interview. Please ensure applicatoon form is completed in full to be considered for this position.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a wide range of benefits including competitive hourly rates with enhancements for weekend working and unsociable hours.&lt;/p&gt;\n&lt;p&gt;Facilities Services forms part of the Estates &amp; Facilities Directorate providing Domestic, Catering, Portering and Switchboard services across many sites in the region.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bulwell, Nottingham", "postalCode": "NG6 9DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9927", "longitude": "-1.19201"}}, "title": "Domestic Facilities Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260019", "validThrough": "2020-11-15T23:59:59+0000"}