{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pa + hcas"}}, "datePosted": "2020-10-20T13:45:47+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Are you looking for a new challenge within an amazing team?&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt;If so, come and join us as a Lead Clinical Scientist here in our dedicated Nuclear&lt;br /&gt;Medicine Team at the Mount Vernon Cancer Centre (MVCC), situated in a pleasant&lt;br /&gt;residential area on the borders of the Home Counties and only a short tube ride into&lt;br /&gt;Central London.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt;&lt;strong&gt;Who are we?&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt;We are a multi-professional team of clinical scientists, radiographers/clinical&lt;br /&gt;technologists, radiologists, trainee healthcare scientists, nuclear medicine assistants&lt;br /&gt;and an administrator. Whilst each role is very different, we all share one vision – we&lt;br /&gt;put our patients at the heart of the outstanding care we provide and we’re now&lt;br /&gt;looking for someone who shares our values and who can help develop the service&lt;br /&gt;even further.&lt;br /&gt;We provide a clinical service comprising diagnostic imaging, in-vitro studies and&lt;br /&gt;radionuclide therapies, including iodine-131 and radium-223. We have a dedicated&lt;br /&gt;two room annex within the Cancer Centre for therapy which is managed by Nuclear&lt;br /&gt;Medicine. The department operates a licensed radiopharmacy that provides&lt;br /&gt;radiopharmaceuticals daily to a number of other nuclear medicine departments. We&lt;br /&gt;are about to install a SPECT/CT imaging system and it is expected that this will be&lt;br /&gt;operational at the end of the year.&lt;br /&gt;In addition to involvement in the clinical nuclear medicine service, this role will lead a&lt;br /&gt;small team of clinical scientists who deliver radiation protection services and scientific&lt;br /&gt;support to East &amp; North Hertfordshire NHS Trust and other healthcare providers and&lt;br /&gt;academic organisations who use radioactive sources in North West London,&lt;br /&gt;Hertfordshire and Bedfordshire. We work closely with our clinical scientist colleagues&lt;br /&gt;from the Radiation Protection Department who provide radiation protection services&lt;br /&gt;and scientific support to diagnostic radiology departments. We also work closely with&lt;br /&gt;the Paul Strickland Scanner Centre which is situated on the same site.&lt;br /&gt;We hold accreditation for the National School of Healthcare Science as a training&lt;br /&gt;centre and are proud of the high standard of training of our healthcare scientists on&lt;br /&gt;a range of national and other accredited training programs and this role will lead on&lt;br /&gt;training within the department.&lt;br /&gt;It is an incredibly exciting time to join MVCC as we begin a transformation&lt;br /&gt;journey. University College London Hospitals NHS Foundation Trust (UCLH) have&lt;br /&gt;been selected by NHS England as the preferred future provider of MVCC services and&lt;br /&gt;we are currently working closely together to develop a future model of care and local&lt;br /&gt;location for the future provision of cancer services to the current population. This&lt;br /&gt;work is underpinned by patient, public and staff engagement to develop the best&lt;br /&gt;future for specialised cancer services in this locality. A due diligence process is&lt;br /&gt;currently underway with an expected transfer date to UCLH of Spring 2022.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;What are we looking for?&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt;An experienced Clinical Scientist, you’ll hold all the relevant and appropriate&lt;br /&gt;registrations and experience in this field. We are also looking for someone to be able&lt;br /&gt;to act as MPE in Nuclear Medicine and who holds accreditation as a Radiation&lt;br /&gt;Protection Advisor and Radioactive Waste Advisor, as well as have experience of&lt;br /&gt;working at this level. However, if you are intending to submit a portfolio for&lt;br /&gt;RPA/RWA accreditation in the next twelve months, we would also love to hear from&lt;br /&gt;you as we would be happy to consider a developmental role – we have a wealth of&lt;br /&gt;opportunities that would help you achieve this.&lt;br /&gt;Lastly, but just as important, we want someone who shares our Trust values and our&lt;br /&gt;passion in what we do!&lt;br /&gt;This may well be an ideal step up for someone who is working at band 8A level and&lt;br /&gt;we would provide you with all the relevant experience and training to progress into&lt;br /&gt;your new role.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;As well as being part of our amazing team, we can also offer you: Up to three&lt;br /&gt;month’s rent paid, plus support in helping you find suitable accommodation&lt;br /&gt;and settle in&lt;/li&gt;\n&lt;li&gt;A variety of working patterns to suit – we are happy to consider flexible&lt;br /&gt;arrangements that will enable you to carry out the role on a full time basis&lt;/li&gt;\n&lt;li&gt;A fantastic leadership and development pathway programme that provides a&lt;br /&gt;wide range of tailored opportunities for leaders and aspiring leaders at all&lt;br /&gt;stages of their career&lt;/li&gt;\n&lt;li&gt;A wealth of opportunities to gain experience and add to your portfolio due to&lt;br /&gt;the large number of healthcare and academic organisations who we support&lt;br /&gt;with RPA, RWA and MPE services&lt;/li&gt;\n&lt;li&gt;The chance to retain direct patient contact as part of the clinical nuclear&lt;br /&gt;medicine team, striking a great balance&lt;/li&gt;\n&lt;li&gt;An opportunity to register for the Higher Specialist Scientist Training (HSST)&lt;br /&gt;training program (subject to selection at national interview and a&lt;br /&gt;commissioned training post being available)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Want to know more?&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt;Let us tell you more about our exciting service and what we can offer you – we would&lt;br /&gt;welcome a chat over the phone or a visit to the department. Contact Dr Sue Douglas, &lt;br /&gt;Head of Nuclear Medicine by telephone on 020 3826 2269 or by email at&lt;br /&gt;suzannedouglas@nhs.net. We would love to hear from you.&lt;br /&gt;Mount Vernon Cancer Centre is a well-respected, non-surgical cancer centre based in&lt;br /&gt;Northwood in Middlesex – providing chemotherapy, radiotherapy and&lt;br /&gt;immunotherapy treatments to over 5,000 patients a year. It is currently run by East&lt;br /&gt;and North Hertfordshire&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Sue Douglas Head of Nuclear Medicine suzannedouglas@nhs.net 020 3826 2269&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mount Vernon Cancer Centre, Northwood", "postalCode": "HA6 2RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6149", "longitude": "-.445801"}}, "title": "Lead Clinical Scientist - Nuclear Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234605", "validThrough": "2020-11-08T23:59:59+0000"}