{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15482", "minValue": "15482", "unitText": "YEAR", "value": "£9.21/hour"}}, "datePosted": "2020-11-04T12:26:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Cleaners (Bank Hours)|£9.21 per hour|Multiple sites across the South East, including Portsmouth, Southampton., Whitstable, Oxford, &amp; Uckfield.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*Flexible Hours*&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have multiple exciting opportunities for Bank staff to join our dedicated FM services teams across the South East.&lt;/p&gt;\n&lt;p&gt;Our Bank staff are critical in ensuring that our sites are staffed during periods of unexpected and expected absence (e.g. sickness, training &amp; holidays), further enabling our NHS to provide effective and efficient patient care. This may include opportunities to work at short notice, meaning flexibility is key&lt;/p&gt;\n&lt;p&gt;You will be a dedicated worker who perhaps is unable to join us on a permanent basis but would like to be a part of NHS Property Services. You will work on a non-guaranteed hours contract, being called upon to provide cover to services in your local area and will be paid each month for the hours you have worked over the course of the previous month.&lt;/p&gt;\n&lt;p&gt;This position is ideal for someone looking for the opportunity to get back to work, additional income and/or flexible working hours.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your role will be involved in the maintenance of our sites, ensuring clean and safe environments for patient care. You may be asked to cover multiple sites, and some additional duties may be required.&lt;/p&gt;\n&lt;p&gt;We will provide full training and induction - there may also be an opportunity for you to progress into a permanent role here at NHS Property Services, location dependent.&lt;/p&gt;\n&lt;p&gt;If this sounds like you, apply now!&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please stipulate your location on your application.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;EQUAL OPPORTUNITIES&lt;/p&gt;\n&lt;p&gt;NHS Property Services is an equal opportunities employer and positively encourages applications from suitably qualified and eligible candidates regardless of sex, race, disability, age, sexual orientation, transgender status, religion or belief, marital status, or pregnancy and maternity.&lt;/p&gt;\n&lt;p&gt;Due to the high volume of applications we receive, we are unfortunately unable to respond to every applicant. Best of luck with your application.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127515.png", "name": "NHS Property Services Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127515"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South East", "postalCode": "PO4 8LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7971", "longitude": "-1.05012"}}, "title": "Cleaners (Bank Hours)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255820", "validThrough": "2020-11-18T23:59:59+0000"}