{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa (pro rata)"}}, "datePosted": "2020-10-19T17:31:47+0100", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Consultant in Palliative Medicine&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;TORBAY &amp; SOUTH DEVON NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join Torbay and South Devon NHS Foundation Trust (T&amp;SDNHSFT), as it became one of the first vertically integrated health and care organisations in the country in 2015. The acquisition of the community health and social care provider (Torbay and Southern Devon Health and Care NHS Trust) has allowed us to radically re-think and re-shape the way we deliver care, free from traditional organisational constraints. This post offers an opportunity to be part of designing and delivering innovative new services in Torbay and South Devon, including more integrated and streamlined care pathways for patients.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Torbay Hospital is a medium sized District General Hospital providing acute services to South Devon. We are situated about two miles from the centre of Torquay and virtually all facilities, including a Cancer Unit with two new linear accelerators, are concentrated on the one site.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are excellent opportunities for a variety of lifestyles and interests being close to both the Coast and Moorland. Torquay offers excellent state schools, with academic success at the highest levels for both A Levels and the international Baccalaureate.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Torbay’s Hospital Palliative Care Team requires a part time consultant (6PAs). This is a new post following the reduction in PAs of a substantive consultant. The appointee will be one of a team of four consultants, who together deliver a comprehensive inpatient and outpatient service through T&amp;SDNHSFT and Rowcroft Hospice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are active in both undergraduate and postgraduate medical education, with medical students from Exeter and Plymouth and trainees from the Peninsula Deanery joining our department throughout the academic year for clinical placements.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants are required to be on the GMCs Specialist Register with a license to practice or within six months of their expected date of receipt of a CCT at the time of interview.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion or to arrange a visit please contact Dr George Walker, Consultant in Palliative Medicine, Clinical Lead, 01803 210810 or &lt;/span&gt;&lt;span&gt;gwalker3@nhs.net&lt;/span&gt;&lt;span&gt; T&lt;/span&gt;&lt;span&gt;o apply, please visit &lt;/span&gt;&lt;span&gt;jobs.nhs.uk&lt;/span&gt;&lt;span&gt; using job reference 388-A-20-54545&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torquay", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Consultant In Palliative Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233344", "validThrough": "2020-12-06T23:59:59+0000"}