{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42481", "minValue": "36329", "unitText": "YEAR", "value": "£36,329 - £42,481 per annum pro rata"}}, "datePosted": "2020-11-05T12:16:43+0000", "description": "&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place.  Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition.  The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;Public Health England (PHE) is an executive agency of the Department of Health and Social Care providing; strategic leadership, research, advice and support for Government, local authorities and the NHS in protecting and improving the nation’s health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Purpose / Summary.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To support the delivery and development of improved performance across Public Health England and the NHS by promoting quality improvement and leading on specific health Emergency Preparedness, Resilience and Response exercise and training projects.&lt;/p&gt;\n&lt;p&gt;PHE’s Emergency Response Department is involved in preparing for and co-ordinating responses to potential healthcare emergencies, including possible acts of deliberate release. To improve preparedness we develop, deliver and assess training course and exercises to test health plans and procedures both within Public Health England and the NHS.&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced manager to fill a fixed term vacancy in the role of Exercise Manager (Emergency Preparedness) to lead projects developing, delivering and evaluating a range of health related emergency preparedness exercises and events; recent events in England, Europe and internationally have re-emphasised the importance of our preparedness work. This is a challenging and rewarding appointment as the successful candidate will lead on the development of a range of emergency response exercises during a period of considerable change within Public Health England, the NHS and with the UK’s international partners; including the formation of the new National Institute for Health Protection. You should be experienced in a senior administrative/management role and have been responsible for organising events for a large number of participants. You will have experience of supervising staff and external service providers as well as the management of concurrent projects. Ideally you will have been involved in developing and managing exercises and training events in the public sector, across government and other agencies.&lt;/p&gt;\n&lt;p&gt;You should be qualified to at least degree level or equivalent and have developed good communication skills and diplomacy; foreign language skills would be an advantage.&lt;/p&gt;\n&lt;p&gt;This post will require you to submit for security clearance and you should be willing to travel in the UK and overseas to arrange and attend events, which will require a flexible approach to working hours. You will also be in possession of a current passport and able to travel by air to international events.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be invited to attend an interview held remotely.&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see job description for competencies.&lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Porton Down, Salisbury", "postalCode": "SP4 0JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1325", "longitude": "-1.7031"}}, "title": "Exercise Manager (Emergency Preparedness)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257627", "validThrough": "2020-11-19T23:59:59+0000"}