{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-05T11:01:25+0000", "description": "&lt;p&gt;Applications are being sought for psychology graduates who have a 2:1 degree (from a course accredited by the British Psychological Society) and experience/interest in working with older adults.&lt;/p&gt;\n&lt;p&gt;The role will expect the successful applicant to work alongside both qualified and trainee clinical psychologists within a friendly and well-established older adult community mental health team. Some of the duties will include: supporting the development of formulations, assisting with care-planning, attending MDT’s, co-facilitating group work, and delivering a variety of evidenced based interventions. The role also provides opportunity for supporting clinical governance initiatives including reviewing and implementing outcome measures and a variety of audits.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate a high level of communication skills (written &amp; verbal) and be able to work in emotionally distressing situations. Additionally, you must possess the ability to use computers for word processing, presentations, databases, spreadsheets and email. It is a varied and interesting job role and you will receive the management, training and supervision you need to enable you to contribute fully to the work of the team and build your experience towards clinical training.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post will close early due to high numbers of applications so you are advised to apply promptly.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about the post please contact Dr. Suzanne Kennedy, Consultant Clinical Psychologist/Older Adult Locality Lead on 07866 156859 or Dr. Amy Newell, Senior Clinical Psychologist, Older Adult CMHT on 01772 401676&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charnley Fold, Preston", "postalCode": "PR5 6AW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7194", "longitude": "-2.63885"}}, "title": "Assistant Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257351", "validThrough": "2020-11-19T23:59:59+0000"}