{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-03T13:45:44+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;JOB SUMMARY: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Swansea Crisis Resolution and Home Treatment (CRHTT) Team is a multi-disciplinary, working in collaboration with the local Community Mental Health Teams and In-Patients Services. The team provides a seven day service to Mental Health Service users in the Swansea and Neath &amp; Port Talbot area.The Senior Nurse/Night Manager works within the CRHT Team and there are three main aspects to the role.&lt;/p&gt;\n&lt;p&gt;Providing specialist advice and assessment for the care of people affected by mental health problems, working with a high degree of autonomy with a specific focus on quality improvement and ensuring excellence. This role includes the provision of comprehensive telephone and face-to-face consultation services to patients and /or their carers/relatives using advanced clinical skills as part of the service delivery for unscheduled care.The post holder is responsible for assessing, planning, implementing and evaluating programs of care which will enhance and maintain the quality of life and independence of service user, their families and carers.&lt;/p&gt;\n&lt;p&gt;In the absence of the CRHT Team Manager the post holder will take responsibility for the day to day management of the multi-disciplinary team; its service provision and development. Night Shift Coordinator role working night shifts as part of the Cefn Coed 24 hour shift-coordinator rota. The night shift coordinator is responsible for the Cefn Coed hospital site. Provide direct involvement with clinical inpatient staff offering professional expertise and advice and supervising the night shift relief staff. In addition undertaking unscheduled assessments and providing a gate-keeping role as part of the CRHTT&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 17 November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Noel Cronin&lt;/em&gt;&lt;/strong&gt;&lt;br /&gt;Service Manager/Unsheduled Care (Swansea)&lt;br /&gt;Locality Management Centre, Cefn Coed Hospital, Swansea, SA2 0GH&lt;br /&gt;Telephone (01792) 561155, Ext 36494&lt;/p&gt;\n&lt;p&gt;E-mail: Noel.Cronin@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cefn Coed Hospital &amp; Orchard Centre, Swansea, Swansea", "postalCode": "SA2 0GH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6282", "longitude": "-3.98897"}}, "title": "Senior Nurse Night Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254186", "validThrough": "2020-11-17T23:59:59+0000"}