{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-20T09:58:45+0100", "description": "&lt;h1&gt;The role&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Staff Nurse (RN - Mental Health), RN (Adult), RN (Learning Disability)&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Are you looking for a new challenge, providing dynamic, high-quality inpatient care?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Can you put people first and provide nursing care that is person-centred, safe and compassionate?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Have you ever wanted to experience what it’s like to live and work in a coastal part of beautiful Devon?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We currently have a vacancy on Belvedere Ward at Franklyn Hospital in Exeter for a qualified nurse working 37.5 hours per week which includes night and weekend working. (Part time also considered)&lt;/p&gt;\n&lt;p&gt;Belvedere Ward is a 14 bed Dementia Assessment Unit, the role is fast paced and fulfilling but can also be challenging and unpredictable at times.&lt;/p&gt;\n&lt;p&gt;Join us and you will play a central role in a committed and dynamic team that has been rated as Outstanding by CQC.&lt;/p&gt;\n&lt;p&gt;This is an incredible opportunity to establish a career with Devon Partnership NHS Trust, one of the country’s most exciting and progressive mental health and learning disability trusts. You will be well supported and encouraged to develop your clinical competencies within a stimulating learning environment.You will become part of a multi-disciplinary team, using your skills and experience to help define and deliver a package of care to people on ward that helps them on their road to recovering a good quality of life.&lt;/p&gt;\n&lt;p&gt;This role is on a ward that operates on a 24/7 shift basis. You will qualify for unsocial enhancements in addition to your basic pay. The role is currently at Band 5, but there is potential for the opportunity of a promotion to Band 6 in the future.&lt;/p&gt;\n&lt;p&gt;We encourage you to learn, develop and grow. For newly qualified staff we have a well-established preceptorship programme which links into our wider multidisciplinary CPD programme. Those looking to gain further experience will be supported in maintaining professional links, through involvement in regular profession-specific CPD opportunities.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We welcome applications from all Nurses&lt;strong&gt;(RN - Mental Health), RN (Adult), RN (Learning Disability)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have no preconceptions about the people we employ. What matters to us is your passion, commitment and determination to succeed. We will assess this at interview.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication skills, a commitment to working flexibly and be happy to participate in the internal 24 hours, 7 day a week rota to meet the needs of people who use our services.&lt;/p&gt;\n&lt;p&gt;We expect you to be able to demonstrate how you have worked effectively in a multi-disciplinary team setting. You will need to demonstrate your commitment to personal development and how you have supported a team to succeed.&lt;/p&gt;\n&lt;p&gt;We welcome independent and critical thinkers. You will be encouraged and supported to use quality improvement methodology to help improve the services we offer. The Trust’s Quality Improvement Academy is on hand to provide access to expert advice and support in your work area that will help you to improve the work you do every day.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would encourage anyone interested in applying for this role to come and have a tour of Belvedere and Franklyn Hospital and to have a discussion with our ward manager Vicky Shorters for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Belvedere Ward is where we provide assessment, care and treatment for patients with an Organic Mental Illness (Dementia), based at Franklyn Hospital, Exeter.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our team at Belvedere includes a Consultant Psychiatrist, Ward Manager, Registered Mental Health and Registered General Nurses, Assistant Practitioners, Healthcare Assistants, Occupational Therapists, Occupational Therapy Assistants, Junior Doctors, Discharge Facilitator, Medical Secretaries, an Admin Team, Peer Support Workers, a House Keeping Team, and a Team of enthusiastic Volunteers. We have a strong work ethic and pride ourselves on delivering person-centred care. We treat everyone – staff, stakeholders, colleagues and the people we care for and their families – with respect and dignity.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Join us at Devon Partnership NHS Trust and you’ll become part of an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/p&gt;\n&lt;p&gt;You’ll become part of a team that is compassionate and supportive. We’re genuinely committed to working together with the people who use our services, their families and carers. We involve them in everything that we say and do.&lt;/p&gt;\n&lt;p&gt;This is an exciting time for Devon Partnership NHS Trust as we continue to expand existing services and launch new mental health services across Devon.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Our offer to you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;27 days (minimum) annual leave plus bank holidays&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Generous NHS pension scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Commitment to career development&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Preceptorship scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Wide range of leadership development opportunities&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 9HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7124", "longitude": "-3.54943"}}, "title": "Staff Nurse (RN - Mental Health), RN (Adult), RN (Learning Disability)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233684", "validThrough": "2020-11-10T23:59:59+0000"}