{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata for part-tim"}}, "datePosted": "2020-11-04T15:16:37+0000", "description": "&lt;p&gt;The Department of Psychological Medicine is a growing and developing psychiatric liaison service which offers a mental health liaison service to Nottingham University Hospitals (NUH) at the QMC and City Hospital campuses. The focus of our work includes urgent assessments in respect of self harm and mental health emergencies, advice and support to wards in respect of patients experiencing mental health problems and also work in areas such as medically unexplained symptoms. Clinical work includes urgent assessments, advice and support to clinical areas and follow up.&lt;/p&gt;\n&lt;p&gt;We proudly offer a thorough and robust induction package to this role and we ensure that all new starters are given enough training and time spent as a supernumerary staff member to ensure that they are comfortable in the role before they are expected to work autonomously. We provide an excellent system of supervision to ensure that practitioners are always supported in their decision making. As such, you do not need to have previous experience in liaison psychiatry to be able to apply for this job.&lt;/p&gt;\n&lt;p&gt;We have a strong focus on working together as a team and on patient and carer satisfaction and the strength of our clinical work is demonstrated by our having achieved Psychiatric Liaison Accreditation Network (PLAN) accreditation.&lt;/p&gt;\n&lt;p&gt;When fully established in this role, key areas of performance will include effective team working skills, effective written and spoken communication, being able to work under pressure to deliver compassionate and person centred care and be able to support the band 6 practitioners to carry out sound risk and mental health assessments.&lt;/p&gt;\n&lt;p&gt;Essential criteria include a professional qualification and registration (nurse or occupational therapist), appropriate mental health experience and a commitment to reflective practice and learning and development.&lt;/p&gt;\n&lt;p&gt;We are primarily seeking Full Time applicants, however part time applicants sill be considered.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Femi Ogundipe - Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: olufemi.ogundipe@nottshc.nhs.uk / Telephone number: 01159709292&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Mental Health Liaison Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256397", "validThrough": "2020-11-24T23:59:59+0000"}