{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615"}}, "datePosted": "2020-10-28T12:31:56+0000", "description": "&lt;p&gt;Are you looking for a new and exciting challenge? Would you like to develop a wide range of nursing skills in a community setting?&lt;/p&gt;\n&lt;p&gt;Due to internal promotions, Regis Central Primary Care Network (PCN) is excited to be offering full time or part time hours for Band 5 Registered Nurses (RN Adult). We are looking for dynamic, enthusiastic and motivated individuals to expand our workforce in a busy and well established community team. Regis Central PCN provides nursing services to an extensive area, and has the privilege of working with a diverse population both in coastal and rural settings. Our community nurses benefit from having continual opportunities to develop an excellent skillset and become autonomous practitioners whilst working as part of a team delivering high quality, holistic care to patients in their own homes.&lt;/p&gt;\n&lt;p&gt;PCNs are an innovative service development involving community nursing, integrating multidisciplinary professionals so health and social care can be delivered seamlessly to those who need it. This enables members of the nursing team to work closely alongside a variety of other professionals and specialists whilst developing a full range of clinical skills.&lt;/p&gt;\n&lt;p&gt;Successful applicants will have a recognised qualification in Adult Nursing, a driving licence and a car. Prior experience in a community setting is desirable, but a full induction and training will be provided.&lt;/p&gt;\n&lt;p&gt;In return we can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dedicated career pathways and great opportunities for continuing professional development&lt;/li&gt;\n&lt;li&gt;A supportive learning environment&lt;/li&gt;\n&lt;li&gt;Commitment to supporting your wellbeing&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;NHS discounts and salary sacrifice schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJolene Taylor-SmithJob titleTeam LeadEmail addressjolene.taylor-smith@nhs.netTelephone number07768 921535&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bognor Regis War Memorial Hospital, Bognor Regis", "postalCode": "PO22 9PP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7934", "longitude": "-.675398"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246622", "validThrough": "2020-11-08T23:59:59+0000"}