{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-27T14:29:59+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Substantive Consultant Post – Community Paediatric Medical Service - 6 Programmed Activities &lt;/span&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Children’s Services in Solent NHS Trust East provide community health services for children aged 0-19 years. Within this, the Community Paediatric Medical Service provides clinical services for children with neurodevelopmental needs and neurodisability, safeguarding services including child protection medicals and statutory health services for children who are looked after or who are undergoing the adoption process. In addition, the service provides named, designated and other doctor sessions for safeguarding, looked after children, public health, research and medical education. &lt;/p&gt;\n&lt;p&gt;The posts will primarily provide clinical care for children with neurodevelopmental concerns or complex neurodisability in Portsmouth City and SE Hants. They will contribute to the child protection daytime rota as well as the regional weekend and bank holiday rota for forensic child sexual abuse. Input to the out of hours rota will be optional for the locum appointment. A clinical lead role will be agreed with the successful candidate for the substantive post and will depend on candidate interests and the needs of the department.&lt;/p&gt;\n&lt;p&gt;For further information, please contact Clinical Lead for the service, Dr Catherine Tuffrey on 0300 123 6635 or by email: Catherine.tuffrey@solent.nhs&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Consultant Community Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244948", "validThrough": "2020-11-17T23:59:59+0000"}