{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-26T14:23:53+0000", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANT POST IN CRISIS RESOLUTION &amp; HOME TREATMENT TEAM&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having a ‘Good’ rating overall, being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Mental Health Team in our latest CQC inspection, which found that: ‘Managers across Berkshire Healthcare promoted a positive culture that supported and valued staff, creating a sense of common purpose based on shared values.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a vacancy for a Consultant Psychiatrist within a well-established Crisis Resolution and Home Treatment Team, based in Reading. This is a substantive post which has become available due to the retirement of the current post holder. The service operates on a Hub and Spoke model, and the West Hub is based at Prospect Park Reading. It covers the geographical areas of Reading, Wokingham and Newbury areas.&lt;/p&gt;\n&lt;p&gt;The CRHTT staff are multidisciplinary and include Mental Health Nurses, Social Workers, Occupational Therapists, Support Workers and Psychology sessional input.&lt;/p&gt;\n&lt;p&gt;Reading is an ethnically diverse population. Referrals to the service are received from a number of sources, including; CMHTs, GPs; self-referral; relatives; police and other Berkshire triage services.&lt;/p&gt;\n&lt;p&gt;There are daily team handovers, with the team using a teleconference facility. Mobile working with the provision of laptop/remote access to the electronic patient database and lone worker devices is in place for all staff working within the service.&lt;/p&gt;\n&lt;p&gt;During working hours, the team is responsible for the mental health needs of each patient open to the home treatment team. Medical advice outside working hours to the CRHTT service is provided by the on-call psychiatrists.&lt;/p&gt;\n&lt;p&gt;The post holder will deliver 5 sessions in Reading HTT/CRHTT and 3 sessions for the Crisis Hub. Although the sessions are mainly based Reading it is expected that the CRHTT West consultant will work flexibly across the West CRHTT localities of Reading, Newbury and Wokingham depending on the needs of the service.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to prioritise their workload flexibility between the needs of the patients open to the Reading HTT caseload, and those patients needing urgent assessment within the Crisis Hub.&lt;/p&gt;\n&lt;p&gt;The consultant will work alongside other staff to provide senior support and management of patients, which may include prescribing, as well as involvement in local MDT reviews and occasionally seeing complex patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call Helen Robson or email: helen.robson@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to a car salary sacrifice scheme (available to all permanent staff over the age of 21), support with childcare and, as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242881", "validThrough": "2020-11-22T23:59:59+0000"}