{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-04T14:18:57+0000", "description": "&lt;p&gt;&lt;strong&gt;Have you heard the news?&lt;/strong&gt;Our staffing establishment increased to support the number of High Dependency patients we care for within this acute respiratory ward environment. This is an exciting time for us to develop our services and increase our nursing workforce and you could be part of this excellent opportunity.&lt;/p&gt;\n&lt;p&gt;Ward 4 is a 28 bed, adult, acute, medical ward, caring for patients with a wide range of respiratory conditions such as; severe pneumonia, lung cancer, pulmonary embolism, pneumothorax, interstitial lung disease, pleural effusion, asthma and chronic obstructive pulmonary disease. We provide acute intervention and management of the patient in respiratory failure using Bi-level Non-Invasive Ventilation (NIV) and Nasal High Flow Oxygen therapy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A friendly, supportive mutli-professional team spirit, working closely with the integrated respiratory team, lung cancer MacMillan nurses, Palliative Care and Critical Care Outreach teams.&lt;/li&gt;\n&lt;li&gt;A structured induction programme with shadowing opportunities and on-going supervision and training with respiratory specific training days&lt;/li&gt;\n&lt;li&gt;funded training for courses such as Immediate Life Support (ILS) and access to continuing professional development (CPD) funding to help manage your own learning and growth.&lt;/li&gt;\n&lt;li&gt;Flexible working schemes&lt;/li&gt;\n&lt;li&gt;Plans to create a new 12 month Leadership apprenticeship to run alongside the Preceptorship Programme for Newly Qualified staff&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We welcome full time, part time and secondment applications &lt;/strong&gt;from those of you with a genuine interest in Respiratory Nursing. Although relevant post-registration experience would be preferred, don’t let this deter you. A caring, compassionate, patient-centred approach, with the drive and enthusiasm to deliver high standards of care to get it right first time, every time and are looking for a challenge, we will welcome you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week: full time and part time hours available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shift patterns: shifts will be either early (7:00-15:00), late (13:00-20:00), long day (7:00-20:00) or night shifts (19:30-7:30).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 19th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For details about the role and ward/informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Kate Johnson, Senior Sister Ward 4 on 01625 661004&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For queries regarding the application and or interview process, please contact the Recruitment Team either via email, ecn-tr.recruitment@nhs.net or telephone, 01625 656510&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We would like to inform you that if your application is successful, your interview will be held via SKYPE.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Victoria Road, Macclesfield, Cheshire, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Staff Nurse in Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256199", "validThrough": "2020-11-19T23:59:59+0000"}