{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13448", "minValue": "13448", "unitText": "YEAR", "value": "Band 7/8a DOE"}}, "datePosted": "2020-10-19T15:31:50+0100", "description": "&lt;p&gt;GPHP Ltd is supporting Epsom Primary Care Network in their search for a Musculoskeletal Advanced Physiotherapy Practitioner (APP) / First Contact Practitioner (FCP).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;JOB SUMMARY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Provide clinical expertise, acting as first-contact Musculoskeletal (MSK) practitioner and making decisions about the best course of action for patients&#39; care. This will involve seeing patients, without prior contact with their GP. Practitioners will use their clinical-reasoning skills to undertake an assessment of the presenting problem, interpret findings, develop working and differential diagnoses, and formulate, communicate and implement management plans that take account of individual’s needs, goals and wishes, local service availability and local and national guidelines and policies.&lt;/p&gt;\n&lt;p&gt;Request investigations to facilitate diagnosis and choice of treatment regime, understanding the information limitations derived from these and the relative sensitivity and specificity of particular tests diagnostic services such as x-rays and blood tests, and interpret and act on results to aid diagnosis and the management plans of patients.Enable individuals to make decisions about their care using the principles of shared decision making:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;helping them to identify the priorities and outcomes that are important to them&lt;/li&gt;\n&lt;li&gt;explaining in non-technical language all available options (including doing nothing)&lt;/li&gt;\n&lt;li&gt;exploring with them the risks, benefits and consequences of each available option&lt;/li&gt;\n&lt;li&gt;supporting them to make a decision on their preferred way forward.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Deliver programmes of supported patient self-management, in ways that facilitate behavioural change, optimise individuals&#39; physical activity, mobility, fulfilment of personal goals and independence relevant to their MSK condition and that minimise the need for pharmacological interventions.&lt;/p&gt;\n&lt;p&gt;Working flexibly across a variety of primary and secondary care sites in response to demands on the service&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom", "postalCode": "KT19 8AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3343", "longitude": "-.266388"}}, "title": "First Contact Physiotherapist (FCP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232945", "validThrough": "2020-11-27T23:59:59+0000"}