{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T10:17:02+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the Sycamore Ward team, this is a 14 bedded Dementia Assessment Unit based in St Woolos Hospital, Newport.&lt;/p&gt;\n&lt;p&gt;The ward accommodates Older people for Mental Health assessment and treatment.&lt;/p&gt;\n&lt;p&gt;Sycamore specialises in the assessment of confusion, diagnosis and care of dementia. Our goal is always to treat each person as an individual and support independence, maintain contact with loved ones and promote enjoyment in activities and the best quality of life possible.&lt;/p&gt;\n&lt;p&gt;Our goal is always to treat each person as an individual and support independence, maintain contact with loved ones and promote enjoyment in activities and the best quality of life possible.&lt;/p&gt;\n&lt;p&gt;The ward is homely and informal whilst remaining a safe clinical ward where dignity is maximised at all times. On Sycamore Ward there is a patients’ TV lounge, dining area and a separate visitors’ lounge. which are dementia friendly.&lt;/p&gt;\n&lt;p&gt;Activities on the ward are wide and varied and assist to structure the patient’s time but also enable the staff to assess the patient’s needs and functioning. The multi-disciplinary team formulate care together. The family/carer will be involved in planning discharge to meet the person’s needs.&lt;/p&gt;\n&lt;p&gt;The ward supports John&#39;s Campaign and has open visiting hours, and is an award winning unit - providing support to patients and staff&lt;/p&gt;\n&lt;p&gt;This post would enable applicants to access the Journey of Excellence (JoE) professional development programme aligned to the learning and development opportunities offered within the Health Board.&lt;/p&gt;\n&lt;p&gt;The management team are keen to enable development of staff and welcome conversations about advancing skills&lt;/p&gt;\n&lt;p&gt;Flexible working hours will be considered.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 17th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Elizabeth Harris, Ward Manager 01633 238277 or 07583093472&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Woolos Hospital, Newport", "postalCode": "NP20 4SZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5822", "longitude": "-3.0029"}}, "title": "Mental Health Staff Nurse: Sycamore Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253414", "validThrough": "2020-11-17T23:59:59+0000"}