{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-27T10:30:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title –&lt;/strong&gt;&lt;strong&gt;Senior Data Developer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Edward Jenner Court, Brockworth or Rikenel, Gloucester&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary –£31,365 to £37,890 per annum (Band 6)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A great opportunity has arisen within the Business Intelligence Service of Gloucestershire Health and Care NHS Foundation Trust for a Senior Data Developer to advance and maintain the data processes for our high-quality reports and dashboards.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role will have a specific focus on the administration of SQL Server and the loading of data and as such the ideal candidate will have a strong working knowledge of SQL administration and SQL Server Integration Services (SSIS).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you have an eye for detail, appreciate the role of data in health care and have the ability to translate technical concepts into non-technical language, this is the role for you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In this challenging role you will be required to take responsibility for the technical development of specific data sets and data sources, gain an expert working knowledge of the data extracts from the various systems the Trust uses. You will also assist with the implementation of Business Intelligence Reporting Tools and be required to line manage (an)other member(s) of the team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion and any enquires please contact Martin Rand, Data Warehouse Manager, on 01452 894770 or emailMartin.Rand@ghc.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL3 4AW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8471", "longitude": "-2.17646"}}, "title": "Senior Data Developer - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243998", "validThrough": "2020-11-19T23:59:59+0000"}