{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "65000", "minValue": "63000", "unitText": "YEAR", "value": "£63,000 - £65,000 pro rata"}}, "datePosted": "2020-11-02T16:43:10+0000", "description": "&lt;p&gt;Nurse Quality Lead&lt;/p&gt;\n&lt;p&gt;Home based – Travel will be essential primarily to Surgeries in Reading and Essex but wider travel may be required.&lt;/p&gt;\n&lt;p&gt;Are you a dedicated, motivated and driven Quality Nurse Leadbased in Essex?Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Nurse Quality Lead you will receive acompetitive salaryand you’ll benefit from:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS pension and 25 days’ holiday&lt;/li&gt;\n&lt;li&gt;Access to our Strive for Better networks, a national support and professional network made up of NHS professionals like you, giving you the chance to constantly develop industry-leading care and quality&lt;/li&gt;\n&lt;li&gt;Access to our free Employee Assistance Programme, a service providing expert advice, 24/7/365 online and by telephone covering a wide range of support options such as; counsellors, post trauma incident support, legal, debt and practical life management helplines&lt;/li&gt;\n&lt;li&gt;Virgin Tribe - this grants you access to premier offers and discounts on Virgin Products such as holidays&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;As a key member of the clinical leadership team you will work 24 hours per week over 3 weekdays. You will be home based but wider travel may be required from time to time to support other services and attend national meetings.&lt;/p&gt;\n&lt;p&gt;Reporting directly to the Head of Primary Care you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead the delivery of quality care, quality improvement and sharing best practice in all areas of clinical care.&lt;/li&gt;\n&lt;li&gt;Establish and communicate our vision, values and strategy across our surgeries nursing team.&lt;/li&gt;\n&lt;li&gt;Act as an ambassador for The Primary Care Business Unit to actively promote our vision, values and achievements to the wider health economy.&lt;/li&gt;\n&lt;li&gt;Develop the strategy for creating and sustaining a fit for purpose nursing workforce and encourage new and transformative ways of working in line with the forward view.&lt;/li&gt;\n&lt;li&gt;Be the clinical nursing voice and first point of contact, at a regional level, for all relevant external bodies. Work with NHS and other stakeholders to promote relationships and positively influence local agendas.&lt;/li&gt;\n&lt;li&gt;Ensure the nursing structure and level of competency within the services is fit to deliver the highest level of care to patients. This includes, but is not limited to, ensuring regular peer review and appraisal, and performance management when needed.&lt;/li&gt;\n&lt;li&gt;Support the Business Development Team where appropriate in the acquisition of new services and surgeries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Nurse Quality Lead you will be aRegistered General Nursewith experience of working in and leading complex and diverse teams. You will have a Successful track record of senior nursing leadership at nurse manager level within a primary healthcare environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Inspired&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;“Here at Virgin Care, colleague recognition is important to us and we know that across our services there are colleagues who deserve acknowledgment for their commitment for going above and beyond to ensure that their colleagues and service users feel the difference.”&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;If you’d like to discuss the role further, or request the full job description, please contact the careers team via email:&lt;span style=&quot;text-decoration: underline;&quot;&gt;careers@virgincare.co.uk&lt;/span&gt;. We can offer an informal discussion about the role to interested candidates for insight into life at Virgin Care!&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Braintree", "postalCode": "CM7 5SN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8901", "longitude": ".558087"}}, "title": "Quality Lead Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252905", "validThrough": "2020-11-16T23:59:59+0000"}