{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 per annum"}}, "datePosted": "2020-10-22T10:46:11+0100", "description": "&lt;p&gt;Specialty Doctor in Research and Development with Full Time 10PA’s although flexible working and job sharing would be considered&lt;/p&gt;\n&lt;p&gt;This is an opportunity to join an ambitious and forward-looking Research and Development Department as a Specialty Doctor based at Northampton General Hospital NHS Trust. We have one full time 10PA post available but are willing to consider flexible working and/or job share. This post will complement and augment the existing Research and Development services at NGH and is fully supported by our Research and Development specialist nurses.&lt;/p&gt;\n&lt;p&gt;The Research and Development Unit at Northampton General Hospital is a dynamic, active hub of research activity with an excellent national track record of recruiting patients into NIHR and commercial studies. It consists of a generic team of 25 highly-qualified and dedicated clinical and non-clinical staff delivering and supporting research activity across the Trust. The Unit has established links with support departments in pharmacy, medical physics, imaging and pathology, providing the infrastructure required for the timely and efficient set-up of clinical trials.&lt;/p&gt;\n&lt;p&gt;It is recognised that the development of partnerships with a range of NHS organisations will be essential to the future development of research providing, amongst other advantages, coordinated access to a wider cohort of patients. We are developing our collaborative work with Kettering General Hospital with the aim of increasing efficiencies in study set-up and delivery as well as sharing clinical systems such as Chemocare. Northampton General Hospital and Kettering General Hospital are aiming at a much closer working partnership in the future under the direction of a mutual Chief Executive Officer, Research and Development will become an integral part of a bid to attain trenching hospital status within the next 5 years. The Trust has also established links with the Northamptonshire Healthcare Foundation NHS Trust and the University of Northampton, building on the research strengths of these organisations, identifying synergies and opening new opportunities for innovative research. Our partnerships are not constrained to Northamptonshire; we work with University Hospitals of Leicester in a range of tertiary services and have a particularly close relationship in oncology.&lt;/p&gt;\n&lt;p&gt;Possession of MRCP or equivalent qualification e.g. MRCGP is desirable. Although not essential, ideally applicants should have experience in delivering clinical trials, there is however potential to gain experience whilst in services and the incumbent will be supported in this by the team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants are encouraged to arrange an informal visit to the R&amp;D Department before interview, please contact the Head of Research and Development, Michelle Spinks on 01604 545941 and/or Clinical Director of Research and Development Dr Fiona Gidden on 01604 545003.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton General Hospital NHS Trust, Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "Specialty Doctor in Research &amp; Development", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237991", "validThrough": "2020-11-18T23:59:59+0000"}