{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38694", "minValue": "38694", "unitText": "YEAR", "value": "£38,694 per annum"}}, "datePosted": "2020-10-27T11:30:34+0000", "description": "&lt;p&gt;The Wessex Kidney Centre would like to appoint a Trust Doctor (Core/SHO level) to support service provision. Within this large, tertiary referral, transplantation unit based at Queen Alexandra Hospital, Portsmouth, you will have responsibility for the care of Nephrology, Dialysis and Transplant inpatients, day cases and ward attendees as part of a team of junior doctors based in the Department.&lt;/p&gt;\n&lt;p&gt;The Wessex Kidney Centre continues to grow, providing expert care to 550 Haemodialysis (HD) patients, 85 Peritoneal Dialysis patients and 100 Home HD patients, plus a large population with advanced CKD. Preparation for renal replacement therapy (RRT) is overseen by a well-established Low Clearance team. Utilisation of Home therapies is increasing and Peritoneal dialysis remains the focus of our initial RRT therapies. We have 85 patients currently within that programme and offer a full service with specialist nurses visiting those patients in their homes for routine and emergency appointments. Haemodialysis forms the bulk of our RRT work, with 550 patients within the programme of which there is a growing Home Haemodialysis population, one of the largest cohorts in the UK. .&lt;/p&gt;\n&lt;p&gt;We undertake approximately 80 acute transplants per year and care for over 800 prevalent transplant patients. We also have the largest altruistic donation programme in the country.&lt;/p&gt;\n&lt;p&gt;All of these services are provided by a team of dedicated nephrologists, transplant surgeons, 2 interventional nephrologists, an interventional radiology team and dedicated nurse specialists within each clinical sub-group. This vibrant, dynamic team of consultants and nurses supervise a body of junior doctors at registrar and junior level. This post will provide you with invaluable experience in managing nephrology, dialysis and transplant patients, useful for your future career, whatever the specialty and we hope will stimulate an interest in Nephrology in the long-term.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Closing Date 24/11/2020&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Trust Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244228", "validThrough": "2020-11-24T23:59:59+0000"}