{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T12:46:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Discharge to Assess Team &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;– Specialist Occupational Therapist Band 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting a Specialist Occupational Therapist to provide therapy-based assessment and treatment.&lt;/p&gt;\n&lt;p&gt;This is a fixed term contract to end of March 2021.&lt;/p&gt;\n&lt;p&gt;The team will work to deliver a Discharge to Assess service. This is a new service to residents within the Morecambe Bay and South Lakes locality. The Team is currently based at the Royal Lancaster Infirmary. The service provides assessment and rehabilitation for patients on discharge to provide assessment within the person’s home rather than in hospital as part of a Discharge to Assess service.&lt;/p&gt;\n&lt;p&gt;You will join a dedicated and motivated team of Occupational Therapists, Physiotherapists, Rehabilitation technical instructors to assess, treat and also to support and identify discharge requirements, making referrals on to Health and Social care community services.&lt;/p&gt;\n&lt;p&gt;All assessment will be within the patient’s home at point of discharge from hospital.&lt;/p&gt;\n&lt;p&gt;The Therapy Team will deliver a 7 day service.&lt;/p&gt;\n&lt;p&gt;You will have broad previous experience within an acute inpatient, admission avoidance or community-based rehabilitation services.&lt;/p&gt;\n&lt;p&gt;You will have knowledge and experience in the assessment, treatment and goal planning with patients presenting with varied physical conditions and will be motivated to join us in improving our patients’ experiences and outcomes.&lt;/p&gt;\n&lt;p&gt;Requirements:-&lt;/p&gt;\n&lt;p&gt;A Diploma or Degree in Occupational Therapy approved by the Royal College of Occupational Therapists&lt;/p&gt;\n&lt;p&gt;Registration with HCPC as an Occupational Therapist&lt;/p&gt;\n&lt;p&gt;The ability to travel to a variety of venues throughout the community to deliver patient assessments within an identified locality and to attend meetings&lt;/p&gt;\n&lt;p&gt;In addition to a comprehensive induction package we offer Team support, staff supervision and in-service training opportunities&lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;University Hospitals of Morecambe Bay NHS Foundation Trust (UHMBT) covers a large geographic area which encompasses the Furness peninsula, the city of Lancaster and the Southern Lake District. It provides a comprehensive range of acute and support hospital services to a population of 350,000 based around Morecambe Bay. UHMBT is one of the largest employers in the area, with approximately 6,000 staff working across five sites.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can the geographic location of UHMB offer you…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Lake District, also known as The Lakes or Lakeland, is a mountainous region in North West England. It is famous for its lakes, forests, mountains and fells. The Lake District is home to a great variety of wildlife. The lakes and mountains combine to form impressive scenery, so if you are a hiker, mountain biker, fell walker or just enjoy being in the great outdoors then this is the place for you. You won’t just reap the professional rewards working for UHMBT. Based on the edge of the Lake District, we really do have it all - sensational views, educational opportunities for all ages, affordable housing, and easy access by road and rail to Manchester, Liverpool and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dedicated to Better Care Together&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The University Hospitals of Morecambe Bay Foundation Trust wants to provide sustainable high quality medical services that fit with the Better Care Together integrated model of care – high quality specialist hospital services wrapping around community based teams to deliver responsive specialist expertise within both acute hospital and community settings and helping to keep people well and to manage their long term conditions closer to home. Plans have been approved to make some bold transformational steps to start to make the changes needed to deliver this vision.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMary DriverAdditional contact information&lt;/p&gt;\n&lt;p&gt;Mary Driver, Therapy Team Manager, Royal Lancaster Infirmary.&lt;/p&gt;\n&lt;p&gt;Telephone: 07970 037095&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lancaster, Lancaster", "postalCode": "LA1 4RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0429", "longitude": "-2.79902"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248379", "validThrough": "2020-11-12T23:59:59+0000"}