{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29526", "minValue": "24325", "unitText": "YEAR", "value": "£24,325-£29,526 pro-rata for pt plus R&amp;R bonus"}}, "datePosted": "2020-11-02T12:16:22+0000", "description": "&lt;p&gt;Registered Nurse - IPU – Duchess of Kent Hospice&lt;br /&gt;&lt;br /&gt;Competitive salary, enhancements, continuation of your NHS pension. Plus R&amp;R bonus scheme.&lt;br /&gt;&lt;br /&gt;Are you looking for a new challenge and the opportunity to make a real difference within your community?&lt;br /&gt;&lt;br /&gt;We&#39;d love you to join us at our Sue Ryder Duchess of Kent, CQC Outstanding Hospice and join our well-established team.&lt;br /&gt;&lt;br /&gt;We are seeking compassionate and dedicated Registered Nurses who are looking to make a difference.&lt;br /&gt;&lt;br /&gt;About the Role:&lt;br /&gt;&lt;br /&gt;We have full time vacancies up to 37.5 hours per week and this can be discussed at interview.&lt;br /&gt;&lt;br /&gt;We can offer you long days to complement a work life balance.&lt;br /&gt;&lt;br /&gt;We are very pleased to be able to accept applications to join us at this time.&lt;br /&gt;&lt;br /&gt;Our In-Patient Unit establishment works on an excellent Staff to patient ratio.&lt;br /&gt;&lt;br /&gt;The successful applicants will play an active role within our team. It&#39;s all about giving our patients the best possible quality of life. The support we offer is tailored to meet individuals&#39; medical, social, spiritual and emotional needs.&lt;br /&gt;&lt;br /&gt;About you:&lt;br /&gt;&lt;br /&gt;Ideally you will be an NMC registered nurse, with post-registration experience in palliative end of life care&lt;br /&gt;&lt;br /&gt;You will need to be able to demonstrate the ability to work well within a team, use initiative and have excellent communication skills.&lt;br /&gt;&lt;br /&gt;You will also:&lt;br /&gt;&lt;br /&gt;- Assess, plan, implement and evaluate individualised care using evidence-based guidelines&lt;br /&gt;- Maintain high standards of care delivery by working collaboratively within regulatory body standards and the Sue Ryder Quality Governance Policy&lt;br /&gt;- Provide support, leadership appraisal and supervision to team members as appropriate&lt;br /&gt;- Act as an ambassador of Sue Ryder to service users and their relatives, colleagues and members of the public&lt;br /&gt;&lt;br /&gt;About Us:&lt;br /&gt;&lt;br /&gt;Duchess of Kent is a Sue Ryder Hospice based in Reading .We provides expert palliative and end of life care, in a beautiful setting, for thousands of local people each year. We are part of a large charity but have a close relationship within the local community and offer a large range of specialist services to support patients, their families and friends.&lt;br /&gt;&lt;br /&gt;Competitive Benefits:&lt;br /&gt;• £24,325-£29,526 pro-rata for part time, per annum (depending upon experience).&lt;/p&gt;\n&lt;p&gt;• Retention bonus of £1,200 pro-rata, per annum.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Enhancements:&lt;br /&gt;&lt;br /&gt;o 8.00 pm to 6.00 am (nights) 30%&lt;br /&gt;o Friday midnight to Sunday midnight (weekends) 45%&lt;br /&gt;o Public Holidays 24 hours midnight to midnight 60%&lt;br /&gt;&lt;br /&gt;•Company pension scheme&lt;br /&gt;•25 days holiday - rising to 30 with length of service plus bank holidays&lt;br /&gt;•Enhanced maternity and paternity pay&lt;br /&gt;•Enhanced sick pay&lt;br /&gt;•Continuation of NHS pension (T&amp;Cs apply)&lt;br /&gt;•NHS holiday honoured (Up to a maximum of 30 days, T&amp;Cs apply)&lt;br /&gt;•Corporate discount with hundreds of retailers and services&lt;br /&gt;•Staff discount of 15% on new goods online at shop.sueryder.org&lt;br /&gt;•Season ticket loan&lt;br /&gt;•Cash referral bonus scheme of up to £500&lt;br /&gt;•Cycle to work scheme&lt;br /&gt;• Free parking, tea and coffee and subsidised meals&lt;br /&gt;• Wellbeing centre and free will writing service&lt;br /&gt;• Development opportunities for all through our structured development framework&lt;br /&gt;&lt;br /&gt;Sue Ryder supports people through the most difficult times of their lives. Whether that’s a terminal illness, the loss of a loved one or a neurological condition – we’re there when it matters. Our doctors, nurses and carers give people the compassion and expert care they need to help them live the best life they possibly can.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4475", "longitude": "-1.00172"}}, "title": "Registered Nurse - In-Patient Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252014", "validThrough": "2020-11-30T23:59:59+0000"}