{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T08:17:16+0000", "description": "&lt;p&gt;Are you interested in developing your nursing skills and have a desire to care for critically ill patients? The Critical Care Unit (ICU/HDU) can provide you with a comprehensive induction programme to help you develop these skills. You must have some recent acute ward experience post registration. Previous experience in Critical Care is not necessary. We have 31 beds currently and have plans to increase to 55 beds when our brand new Unit opens in a few years’ time.&lt;/p&gt;\n&lt;p&gt;We will offer you five weeks supernumerary time when you join us. The Critical Care foundation programme will include five full in house study days. We will provide study days with a variety of topics including ventilation, cardiac, neuro and a full simulation day to name a few. You will also be allocated to one of our practice educators to support you.&lt;/p&gt;\n&lt;p&gt;Brighton and Sussex University Hospitals are one of the leading acute Trusts on the South Coast. The Royal Sussex County in Brighton is located just a few minutes from the sea and close to our lively town centre! The Unit is within easy access to the seaside, countryside and a frequent train service to London and Gatwick airport. We are the Major Trauma Centre and Teaching Hospital for our area.&lt;/p&gt;\n&lt;p&gt;We are privileged to be able to care for a wide variety of patients which include: cardiac, neurosurgery, general medical/surgical, max fax, renal, and poly trauma patients amongst others and are looking for kind, caring and compassionate nurses to help us give these patients the best care possible and be part of our friendly and supportive team.&lt;/p&gt;\n&lt;p&gt;We are proud to be able to offer a variety of flexible working options and contracts. For further information please refer to the Flexible Working for Registered Nurses document which is attached to this advert.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Lucy Pitt&lt;/p&gt;\n&lt;p&gt;Job title Matron&lt;/p&gt;\n&lt;p&gt;Email address lucy.pitt4@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone numbe r01273 696955 ext. 64273&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Critical Care Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241720", "validThrough": "2020-11-08T23:59:59+0000"}