{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-06T09:31:06+0000", "description": "&lt;p&gt;The UHNM MRI department has seven scanners across its two sites with a fabulous growing team of 35+ radiographers and 20+ Imaging Department Assistants, supported by a dedicated MR physicist team.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on the breadth of our clinical workload and expertise, delivering a full range of MRI examinations; from advanced Neuro techniques through body and pelvic imaging, to the largest Cardiac MR Service in our region as well as the mainstays of Neuro and Msk imaging, breast MRI and vascular work.&lt;/p&gt;\n&lt;p&gt;We are one of the first Trusts in the UK to scan both conditional and Non- conditional cardiac devices and have become a large centre for this type of patient to receive our exemplary care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;UHNM is one of the largest Trusts in the country, with a vision to become a world class centre of clinical and academic achievement, with a team who are ‘Proud to Care’.&lt;/p&gt;\n&lt;p&gt;The organisation is working hard to embed its core values and in particular its drive for compassionate leadership so that, even in today’s NHS, you will find yourself supported, resourced and developed.&lt;/p&gt;\n&lt;p&gt;We are committed to being a place of work where anyone would be happy and fulfilled.&lt;/p&gt;\n&lt;p&gt;We have an excellent record of high quality in house MRI radiographer training however we are open minded in our outlook and encourage new blood to join our team to further improve our MRI service.&lt;/p&gt;\n&lt;p&gt;We operate a 7 day a week service, extended hours 7am-9pm rotating across two sites, and include an on call rota. There is a 7am &quot;early bird&quot; service operating in the main department next to our Accident &amp; Emergency department to facilitate the swift care of emergency cases.&lt;/p&gt;\n&lt;p&gt;The department is equipped with 2 Siemens Vida 3T scanners and 1 Siemens 1.5T Sola installed last year (2019) and 3 Siemens Aeras and 1 Siemens Skyra (oldest being only 4 years old)&lt;/p&gt;\n&lt;p&gt;If you are looking for an opportunity to work in our busy MRI department bringing your existing high level of skill and strong work ethic we are looking for trainees to join our MRI team. The UHNM MRI department will give you exposure to the broadest range of exams and candidates are strongly encouraged to arrange a visit? We always make visitors welcome and we want to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;At UHNM we can offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A clear training package and mentorship, resulting in MRI competency&lt;/li&gt;\n&lt;li&gt;Experience in a wide range of MRI techniques, supported by dedicated Radiologists&lt;/li&gt;\n&lt;li&gt;Involvement in the scanning of research patients with opportunities to apply for funding support for your own projects&lt;/li&gt;\n&lt;li&gt;Support from a great team of friendly staff, including a good social life outside of work&lt;/li&gt;\n&lt;li&gt;Good flexible working conditions promoting positive work life balance&lt;/li&gt;\n&lt;li&gt;A good selection of local affordable housing with lovely surrounding countryside within easy access&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;We expect:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Existing good level of radiographic skill with some demonstrable MRI Knowledge&lt;/li&gt;\n&lt;li&gt;An honest strong work ethic , commitment to our patients, flexibility and professionalism&lt;/li&gt;\n&lt;li&gt;A desire to deliver high quality imaging, demonstrating good clinical understanding and a sound awareness of governance processes&lt;/li&gt;\n&lt;li&gt;Demonstrated ability in your existing role to manage workload , remaining calm and organised even on the busiest day&lt;/li&gt;\n&lt;li&gt;Competency and sign off of the majority of departmental clinical examinations within 6 months which will require the trainee to be consistently proactive.&lt;/li&gt;\n&lt;li&gt;A full commitment to our on-call service following training and mentorship&lt;/li&gt;\n&lt;li&gt;Strong team spirit traits and mentoring of junior staff&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Bruce Jarvest&lt;/p&gt;\n&lt;p&gt;MRI Superintendent&lt;/p&gt;\n&lt;p&gt;Bruce.Jarvest@uhnm.nhs.ukTelephone number01782 675878Additional contact information&lt;/p&gt;\n&lt;p&gt;Amanda Raeis-Mohammad MRI Team Leader, via 01782 671915&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of the North Midlands, Stoke-on-Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "MRI Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259027", "validThrough": "2020-11-15T23:59:59+0000"}