{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18827", "minValue": "18827", "unitText": "YEAR", "value": "£11.20 Per Hour"}}, "datePosted": "2020-11-03T10:48:13+0000", "description": "&lt;p&gt;Job Title: Administration Officer&lt;/p&gt;\n&lt;p&gt;Trust: Wrightington Wigan &amp; Leigh NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;Location: Royal Albert Edward Infirmary, Wigan Lane, Wigan, WN1 2NN&lt;/p&gt;\n&lt;p&gt;Shift pattern: Monday – Friday 8.00am – 16.00pm&lt;/p&gt;\n&lt;p&gt;Duration: 2/3 months&lt;/p&gt;\n&lt;p&gt;Pay Rate per hour: £11.20&lt;/p&gt;\n&lt;p&gt;The Role:&lt;/p&gt;\n&lt;p&gt;The Wrightington, Wigan and Leigh NHS Foundation Trust is a major acute trust dedicated to providing the best possible healthcare for the local population of Wigan of over 300,000. They operate from five hospital sites and invest around £220m each year. WWL specialise in orthopaedic service that runs research and offers training to overseas healthcare providers. They are committed to designing services around the needs of patients and providing care as close to their homes as possible.&lt;/p&gt;\n&lt;p&gt;As a team they have recently been awarded the prestigious ‘Provider of The Year’ Award by the Health Service Journal, (HSJ) along with a further award for our pioneering Staff Engagement Strategy ‘The WWL Way’. Would you like to be part of a Trust that value, recognise and celebrate their staff?&lt;/p&gt;\n&lt;p&gt;If yes, Wrightington, Wigan and Leigh NHS Foundation Trust is the place for you.&lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for an Administration Officer available at our Wrightington Wigan &amp; Leigh NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General responsibilities&lt;/strong&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Organising meetings and minute taking usually via M S Teams.&lt;/li&gt;\n&lt;li&gt;Dealing with telephone calls and transferring to relevant member of staff&lt;/li&gt;\n&lt;li&gt;Co-ordinating diaries for the Infection Control Team&lt;/li&gt;\n&lt;li&gt;Co-ordinating various audits – entering onto spreadsheets and databases and reporting on&lt;/li&gt;\n&lt;li&gt;Helping out team with any admin requests which vary from day to day&lt;/li&gt;\n&lt;li&gt;Keeping CDT/MSSA and MRSA spreadsheets up to date&lt;/li&gt;\n&lt;li&gt;Updating on Call rota and sending out to Switchboard and Team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades, and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS. We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wigan", "postalCode": "WN1 2NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5576", "longitude": "-2.62953"}}, "title": "Administration Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253559", "validThrough": "2020-11-20T23:59:59+0000"}