{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-15T11:45:18+0100", "description": "&lt;p&gt;&lt;span&gt;County Durham and Darlington NHS Foundation Trust is one of the largest integrated care providers in England, serving a population of around 600,000 people. We are a high performing organisation with a track record of success. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Our Cellular Pathology department has 3 vacancies for Consultant Histopathologists &lt;strong&gt;but will also consider applications from Specialty Doctor grades (please review job description in additional information).&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The appointee would share the work of the department with the current substantive Consultant Cellular Pathologists, and would be expected to work closely with other Consultants within the Trust, promoting and maintaining the high quality of these services. The appointee will be based at the laboratory of the University Hospital of North Durham (UHND) where the Department concentrates provision of the service but supports other sites within the Trust, particularly Darlington Memorial Hospital. The post is for general histopathology and cytopathology although developing a special interest to complement the team would be encouraged. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;It is envisaged that it will be increasingly difficult to accommodate all future advances in specialist treatments and interventions at each of our main hospital sites and the Trust is actively engaged with neighbouring organisations in developing local Sustainability and Transformation Plans. Taking this into account it is proposed that whilst a successful candidate will spend most of their programmed activities at University Hospital it may be that, as services reconfigure, the role would involve programmed activities at other hospitals possibly across the region. CDDFT are also committed to the development of Advanced BMS Practitioner roles, successful candidates will participate in supporting this training programme. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Whole-time – 10 programmed activities split into 8.5 DCC, and 1.5 SPA. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The basic contract is for 10 programmed activities. There will need to be a discussion with the post holder regarding the final job plan arrangements, prior to commencement of the appointment. The department had previously used the Warwick system and has been recently transitioning to the RCPath points system. If the post holder elects to undertake a part-time contract they will be required to devote substantially the whole of the professional time to the duties of the post.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post is subject to change in relation to site working and may be impacted upon by future service transformation i.e. NHSI ICS.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You must be fully registered with a GMC licence to practise. If you wish to work part time you will still be considered for the post with an adjusted Job Plan to be developed.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In accordance with good practice guidelines from the Criminal Records Bureau, the successful candidates will be required to submit an enhanced application for disclosure.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Further details of the department and duties can be found within the job description and person specification.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Please note this position requires a Disclosure Barring Service check.&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Durham", "postalCode": "DH1 5TW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.7889", "longitude": "-1.59294"}}, "title": "Consultant Histopathologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227990", "validThrough": "2020-12-15T23:59:59+0000"}