{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa inc. HCA (pro rata)"}}, "datePosted": "2020-11-04T15:31:23+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This specialist role is ideally suited to a physiotherapist who has experience of working in colorectal cancer care. The post holder will work as part of a dedicated highly-specialist complex colorectal cancer multidisciplinary team which offers a tertiary service to individuals with locally-advanced pelvic cancers. We are looking for candidates who, through the key skills of leadership, innovation and clinical expertise, can help facilitate and deliver care which is patient-centered, safe and effective. The post holder will assist collecting, collating and analysing data to help evaluate the success of this innovative rehabilitation project.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A summary of the role is as follows:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· To work as a member of the Complex Cancer multidisciplinary team (MDT), attending the ward and wider MDTs, and attending the complex colorectal cancer clinics.&lt;/p&gt;\n&lt;p&gt;· To assess and treat patients requiring physical rehabilitation both before and after complex colorectal cancer surgery, and maintaining accurate and comprehensive patient records as per protocol for the Macmillan Rehabilitation project.&lt;/p&gt;\n&lt;p&gt;· As an autonomous practitioner, to assess and treat own caseload and provide a highly specialist physiotherapy service to complex colorectal cancer patients. This includes pre-op assessment and delivering a programme of physical activity and pre-operative education (pre-rehabilitation), post op rehabilitation management and post discharge follow-ups.&lt;/p&gt;\n&lt;p&gt;· To work closely with the complex colorectal cancer services physiotherapy assistant, the Surgical Band 7’s and the Clinical Specialist to deliver the complex colorectal physiotherapy service.&lt;/p&gt;\n&lt;p&gt;· To work closely with the cross-site Clinical Specialist and Respiratory/ critical care/ surgery Physiotherapists in leading the development of the Complex Colorectal Cancer Physiotherapy Service.&lt;/p&gt;\n&lt;p&gt;· To support the development of the Macmillan Therapy Assistant Practitioner and be responsible for their work within the Macmillan project.&lt;/p&gt;\n&lt;p&gt;· To assist in the development of wider Respiratory team members including Band 5 &amp; 6s, non-qualified staff and Students. This will also include ensuring competency of staff to work on the on-call rota.&lt;/p&gt;\n&lt;p&gt;· To regularly provide formal and informal, on-going training and education to physiotherapy staff, medics, other healthcare professions and students.&lt;/p&gt;\n&lt;p&gt;· To engage in own continued professional development (CPD) and service development, in conjunction with the Clinical Specialist.&lt;/p&gt;\n&lt;p&gt;· To assist with analysing, auditing and publishing data collected as part of this project and be willing to undertake associated research.&lt;/p&gt;\n&lt;p&gt;· To participate in the weekend working rota, covering clinical areas including ICU, medical HDU and the surgical and medical wards.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;UNIT DETAILS&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced and dynamic physiotherapist to join the Complex Colorectal Cancer team at St. Mark’s Hospital, Northwick Park and Central Middlesex Hospitals in North West London, in a 1 year Macmillan funded post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St. Mark’s Hospital is a specialist hospital treating colorectal and intestinal disorders established in 1835. St Mark’s has a strong history of specialised patient care attracting patients from around the country and overseas. Its patient base is both secondary and tertiary providing a good mix of patients with common and rare disorders. The essence of the Hospital has been a blend of clinical work, research and teaching. The Hospital has developed clinical departments in surgery, gastroenterology, endoscopy, physiology, and nutrition.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Complex Colorectal Cancer team is a multidisciplinary team led by Mr Ian Jenkins and Mr Anthony Antoniou, Consultant Colorectal Surgeons. Both specialise in advanced pelvic cancer surgery and have pioneered new surgical techniques for patients who have either locally advanced primary rectal cancer i.e. those which extend beyond the TME or pelvic recurrence of a rectal cancer. Surgical techniques including High and distal sacrectomy, pelvic side wall excision and total pelvic exenterations requiring SGAP/ IGAP reconstructions (Superior/Inferior Gluteal Artery Perforator flaps).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick park hospital, Harrow", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Specialist Macmillan Physiotherapist in Complex Colorectal Cancer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256458", "validThrough": "2020-11-18T23:59:59+0000"}