{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-28T10:16:38+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST WAS PREVIOUSLY ADVERTISED AS 050-NMR457-0520-RW-B&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Recruiting now – Registered Nurses for our Emergency department (ED) in Glan Clwyd Hospital –Beautiful North Wales&lt;/p&gt;\n&lt;p&gt;Come and join us – and be a part of a brand new exciting hospital development, which is creating the ideal environment for staff and our patients, improving the health of the population we serve&lt;/p&gt;\n&lt;p&gt;Whether you are newly qualified or you have been in nursing for years or even thinking of coming back to Nursing , a move to us here in North Wales will provide opportunities to either learn on the job or develop your skills further.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join our dynamic team within our Emergency Quadrant Wards in our hospital. We are a friendly team and always thrive to deliver a compassionate high quality standard of care. Our top priority is the safety of our patients and their best possible care, and being part of a close-knit, hardworking and supportive team will help you settle in with us.&lt;/p&gt;\n&lt;p&gt;Our Emergency Quadrant (EQ) houses a combination of assessment areas and short stay beds that will enable us to manage our emergency pathways effectively. The EQ combining, the Emergency Department, Surgical and Acute Medical patients, including a Rapid Assessment Unit for direct GP referrals.&lt;/p&gt;\n&lt;p&gt;Opportunities to rotate into all areas as you progress – to widen your skills and knowledge and also make a difference to the quality of care, patient safety and experience in a busy and friendly environment&lt;/p&gt;\n&lt;p&gt;You will be part of an upbeat dynamic team bringing energy and a strong focus on multidisciplinary teamwork in supporting our patients&lt;/p&gt;\n&lt;p&gt;You will receive a specialty specific induction programme that is supported by a competency framework for you to complete with Practice Development Nurse support; and opportunities to further develop your nursing career through courses including Mentorship in Practice, intravenous additives, venepuncture and cannulation, recording and interpretation of ECG’s. Within the ED, you may also undertake Paediatric Intermediate Life Support and Advance Trauma Life Support training.&lt;/p&gt;\n&lt;p&gt;In addition, pathways exist to develop into Emergency Nurse Practitioner and Advanced Nurse Practitioner roles within the EQ.&lt;/p&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working to suit you and your family, such as full time, annualised hours, part time, term time, to enable you to achieve a great work-life balance. Let us discuss!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Support to progress your nursing career in a place that allows you to reach your goals inside work and out&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;A chance to be recognised for great work through our staff achievement awards&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Continued professional development opportunities through our in house practice development programme and external academic courses within universities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;High quality, modern services in rapidly developing wards and units&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Career progression Opportunities (our main hospitals are Training hospitals)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Opportunity to rotate between two specialities to help you change direction whenever you want to&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent opportunities for career progression and a clear route to advanced practice to through post -graduation qualifications&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Other benefits for you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free On-site parking available&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Bus park &amp; ride&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Eye Care Vouchers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Work Place Pension&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive Learning &amp; Development Package using our strong Links to local Universities &amp; colleges for courses&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Free DBS check,&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Flu vaccination&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Hepatitis B vaccination&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Occupational Health Support network&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Discounts i.e. Restaurants, retail, package holidays&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Free admission to Social Clubs – such as Betsi Runners (Clubs)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Uniform&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Support networks, including trade unions, carers, chaplaincy, counselling service, NHS retirement fellowship , rainbow LGBT&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you wish to continue to live in England and travel to North Wales, then Glan Clwyd Hospital is in commutable distance and parking is free within our hospital site.&lt;/p&gt;\n&lt;p&gt;We can provide financial support to help you relocate to North Wales along with flexible working options to enable you to achieve a great work-life balance.&lt;/p&gt;\n&lt;p&gt;Finding extra fulfilment away from work is important too and with stunning surroundings, affordable housing, great schools and a true sense of community wherever you go, North Wales is the perfect place to start or continue your career. If you have the passion, vision and ability to make a difference and help move our services forward, we want to hear from you today!&lt;/p&gt;\n&lt;p&gt;To apply please apply on line&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 11/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Luke Macdonald&lt;br /&gt;Nurse Recruitment Manager&lt;br /&gt;01745 448788 Ext 7606&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glan Clwyd Hospital, Bodelwyddan, North Wales", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Registered Nurse - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246020", "validThrough": "2020-11-11T23:59:59+0000"}