{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rota"}}, "datePosted": "2020-10-27T14:15:57+0000", "description": "&lt;p&gt;Specialist CBT Therapist – Adult Psychological Services&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen in North Staffordshire Combined Healthcare Trust, for a CBT Therapist to work alongside a multi-disciplinary team of Psychologists, Psychotherapists, Nurses, Occupational Therapists, Support Workers and Psychiatrists in a well-established secondary adult mental health community team.&lt;/p&gt;\n&lt;p&gt;Our Trust is on an incredible journey of innovation and we’d like you to be part of it. To excel you will be an enthusiastic, caring and compassionate registered professional who is looking to work within a Trust that is ambitious to perform well and has been told by the Care Quality Commission that it is the fastest improving Mental Health Trust in the Country. If you can bring experience of using CBT for complex mental health problems, including the delivery of effective CBT assessments, formulations and interventions, we want to meet you and discuss the possibility of you joining this great Team.&lt;/p&gt;\n&lt;p&gt;Our vision is ‘To be Outstanding in all we do and how we do it.’ Our team prides themselves on compassion, team work and resilience.&lt;/p&gt;\n&lt;p&gt;The Directorate will offer a full induction package. Training and competencies within the specialties and on-going support and professional development will be tailored to meet your individual needs. Support to develop in all areas of the role will be given and there are good opportunities for ongoing CPD and supervision within the service.&lt;/p&gt;\n&lt;p&gt;We are keen to discuss our service with you, if you would like to discuss the post further prior to making an application please call Dr Lynsey Drury (Principal Clinical Psychologist) – details below. Otherwise please submit your application and we guarantee an interview for all CBT qualified practitioners with relevant mental health experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Lynsey DruryJob titlePrincipal Clinical PsychologistEmail addressLynsey.Drury@combined.nhs.ukTelephone number0300790 0237Additional contact information&lt;/p&gt;\n&lt;p&gt;Simon Wilson&lt;/p&gt;\n&lt;p&gt;SimonJ.Wilson@combined.nhs.uk&lt;/p&gt;\n&lt;p&gt;07834115889&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120881.jpg", "name": "North Staffordshire Combined Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120881"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lyme Brook Centre, Stoke-on-Trent", "postalCode": "ST5 7TL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0387", "longitude": "-2.239"}}, "title": "Cognitive Behavioural Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244916", "validThrough": "2020-11-10T23:59:59+0000"}