{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-02T11:46:14+0000", "description": "&lt;p&gt;Maidstone Community Mental Health Team is currently looking to recruit a Mental Health Practitioner Duty Worker (Band 6) from one of the following professional backgrounds; Registered Mental Health Nurse or Occupational Therapist to join the community mental health team. &lt;br /&gt;&lt;br /&gt;The main purpose of this role is to provide advice to known service users, to provide advice to new service users or other professionals when they are seeking help and to carry out urgent assessments.&lt;br /&gt;&lt;br /&gt;The Duty Worker is not expected to carry a caseload of clients.&lt;br /&gt;&lt;br /&gt;Our services work through an assessment and recovery approach with people accessing secondary level mental health services for severe and enduring mental illness. We provide comprehensive multi-disciplinary services and work closely with long term specialist mental health teams (e.g. Early intervention, Crisis and home treatment team) tertiary service providers, primary care, local statutory and non statutory agencies, service users and carers.&lt;br /&gt;&lt;br /&gt;We are currently looking for a Duty Worker (band 6) with post qualifying community or urgent care experience and evidence of continuing professional development. It is desirable for the successful applicant to have had experience of working in a Community based setting.&lt;br /&gt;&lt;br /&gt;You will have a strong sense of initiative, excellent team working ability and be an excellent communicator. You will be able to demonstrate knowledge of high level nursing interventions &amp; community assessment skills. Qualifications or a willingness to undertake training relevant to the post is expected.&lt;br /&gt;&lt;br /&gt;This post offers an excellent opportunity to work in an interesting and developing service environment. You will have considerable opportunities for training and professional development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Isobel Rigge, Operational Team Manager&lt;/p&gt;\n&lt;p&gt;Email: Isobel.rigge@nhs.net, Telephone: 01622 766900&lt;/p&gt;\n&lt;p&gt;Indie Randhawa, Operational Team Manager&lt;/p&gt;\n&lt;p&gt;Email: i.randhawa@nhs.net, Telephone: 01622 766900&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Albion Place/Highlands House, Maidstone/Tunbridge Wells (West Kent)", "postalCode": "ME14 5TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2745", "longitude": ".52983"}}, "title": "Mental Health Practitioner - Duty Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251887", "validThrough": "2020-11-16T23:59:59+0000"}