{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa inc 15% HACS"}}, "datePosted": "2020-11-03T09:16:37+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Specialist Occupational Therapy Post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Come and Join our Integrated Children’s Therapies Team at Ham Clinic&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Richmond Occupational Therapy Department are looking for a motivated, dynamic therapist to join the Children’s Therapy Team. You will join an established team of Occupational Therapists working in an integrated service with Physiotherapy and Speech and Language Therapy.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with experience and a specific interest in treating children with complex neurological conditions to help develop this area of the service.&lt;/p&gt;\n&lt;p&gt;This post provides the ideal opportunity to continue to develop your clinical skills as well as being closely involved in reviewing and enhancing the service we deliver to children and families.&lt;/p&gt;\n&lt;p&gt;In addition to providing clinical input the successful candidate will work closely with the other Band 7’s within the team to supervise junior staff, co-ordinate and deliver in house and external training and drive forward service development supported by the service manager.&lt;/p&gt;\n&lt;p&gt;The post holder will carry a varied caseload including children from 0 – 19 with complex neuro-developmental disorders, developmental co-ordination disorders, autistic spectrum disorder and other genetic conditions. Children are seen in a range of settings including mainstream schools, early year’s settings, and clinics as well as the home environment.&lt;/p&gt;\n&lt;p&gt;Please contact the department if you would like to discuss the post in more detail.&lt;/p&gt;\n&lt;p&gt;For further information, please contact Jo Fargher Team Lead for Occupational Therapy on joannafargher@nhs.net&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joanna Fargher&lt;/p&gt;\n&lt;p&gt;Occupational Therapy Team Lead&lt;/p&gt;\n&lt;p&gt;joannafargher@nhs.net&lt;/p&gt;\n&lt;p&gt;0208 8918190&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122296.jpg", "name": "Hounslow and Richmond Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122296"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ham Clinic, Richmond", "postalCode": "TW107NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4381", "longitude": "-.313858"}}, "title": "Specialist Paediatric Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253254", "validThrough": "2020-11-29T23:59:59+0000"}