{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-10-20T12:01:16+0100", "description": "&lt;p&gt;Coventry Health Visiting Service is seeking a qualified Nursery Nurse to join our amazing Family, Health and Lifestyle Service in a 30 hours per week position.&lt;/p&gt;\n&lt;p&gt;If you are a qualified Nursery Nurse and would like to join a progressive, forward thinking and innovative 0-19 team of Public Health Nursing then we would love to hear from you. This post will be based in Coventry, the City of Culture 2021.&lt;/p&gt;\n&lt;p&gt;The Community Nursery Nurse supports families with their child’s development by working with them in the home setting and in groups, carrying out the 10 month and 27 month development check. Nursery Nurses work closely with the Health Visitor in clinics and support with the whole family assessment, as well as supporting parents with behaviour management, toilet training, sleep management and targeted episodes of care as directed by the Health Visitor.&lt;/p&gt;\n&lt;p&gt;The 0-19 Service works very closely with partner agencies, such as the Coventry Family Hubs, to enrich the lives of children and their families in Coventry.&lt;/p&gt;\n&lt;p&gt;You need to have a passion for working with children, a comprehensive understanding of safeguarding children and young people and a thorough knowledge of the Healthy Child Programme (0-5) and wider public health agenda.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to be able to demonstrate the qualities in the person specification and be committed to their on-going professional development to ensure quality in the delivery of care is maintained.&lt;/p&gt;\n&lt;p&gt;It is essential that applicants can meet the travel requirements of the post.&lt;/p&gt;\n&lt;p&gt;Full Agenda for Change Terms and Conditions apply.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca MaddenJob titleTeam LeaderEmail addressRebecca.Madden@swft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Pauline Lyons Clinical Lead on: 07500 952 188&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Coventry Health Visiting F65396, COVENTRY", "postalCode": "CV1 4FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4181", "longitude": "-1.49965"}}, "title": "Community Nursery Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234290", "validThrough": "2020-11-09T23:59:59+0000"}