{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-11-04T10:31:47+0000", "description": "&lt;p&gt;&lt;span&gt;Manchester Health and Care Commissioning (MHCC) is looking for bold, innovative, enthusiastic and creative nurses to join the Nursing Team, to plan, roll-out and evaluate, an ambitious programme of competency-based Infection Prevention and Control (IPC) training to all non-NHS environments providing care to people in the community across Manchester. This will include care and nursing homes, supported accommodation, homes for people with learning disabilities, mental health, Dementia and other complex needs, and homecare providers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will help to establish the programme, provide the training, and work closely with other clinicians in the Nursing Team, MHCC Health Protection Team, MHCC commissioners, Manchester independent sector leaders, Manchester Local Care Organisations, community nursing teams, and other neighbourhood and community teams to in-reach into the range of establishments, whether face-to-face (adhering to current local restrictions) or “virtually” and help to embed IPC as a core element of business for all community non-NHS providers, as well as problem solve, provide support, advice and guidance.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will be an experienced registered nurse, having worked in a clinical environment, you will have had extensive experience of applying Public Health England guidance related to COVID as well as Infection Prevention and Control measures, you will have had experience of delivering complex training to multidisciplinary teams, and implementing audit and improvement plans. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will receive opportunities for personal development, have contact with other MHCC nurses representing the full spectrum of clinical backgrounds, receive excellent clinical supervision and have a significant role in the MHCC Nurse Forum. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This is initially a fixed term appointment for 18 months, and secondment arrangements will be considered. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you wish to discuss this post further please email Carolina Ciliento, MHCC Head of Nursing, on &lt;/span&gt;&lt;span&gt;carolina.ciliento@nhs.net&lt;/span&gt;&lt;span&gt; to arrange a time for a call.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you require the application in an alternative format please contact Hrtransactions.manchester@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;MHCC is committed to creating and sustaining a fully inclusive workforce culture. We support flexible working and will consider applications on a part-time or job share basis. We welcome applicants from all backgrounds and communities, and we particularly welcome applicants who are currently under represented in our workforce.  This includes but is not limited to Black, Asian and Minority Ethnic (BAME) candidates and disabled candidates.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128384.jpg", "name": "NHS Manchester CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128384"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Parkway Business Centre, Princess Road, Manchester", "postalCode": "M14 7LU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4471", "longitude": "-2.2453"}}, "title": "IPC Nurse Trainer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255392", "validThrough": "2020-11-18T23:59:59+0000"}