{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a. pro rata"}}, "datePosted": "2020-10-29T17:01:25+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;br /&gt;&lt;/strong&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;We are seeking an Advanced Occupational Therapist to join our vibrant Occupational Therapy department. We are looking for a motivated Band 7 Occupational Therapist with creative ideas to lead the team and continue to develop the service. This is an exciting opportunity to be part of a multidisciplinary team, working closely to best manage complex patients and manage a safe discharge from hospital. &lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;If you are experienced at working in acute care with complex patients, knowledgeable about community services, committed to improving patient care, skilled in staff development, practice evidence based therapy and working at MSc level then this is the job for you.&lt;br /&gt;&lt;br /&gt;You will be responsible for the delivery of excellent care by the Occupational Therapy team as well as carrying your own caseload. You will also be actively involved within a large Occupational Therapy department, including active participation in teaching, service and staff development and management. This post requires some weekend / Bank Holiday and out of hours working, when required.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Please note:- Internal applicants on permanent contracts can only apply for this post as a secondment and must have the approval of your current line manager before applying.&lt;br /&gt;&lt;br /&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;br /&gt;&lt;br /&gt;The closing date is 22 November 2020.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Benefits to you&lt;br /&gt;&lt;/strong&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;br /&gt;&lt;br /&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;br /&gt;&lt;br /&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;br /&gt;&lt;br /&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sara Levy or Louise Bonner on 01223 217244 or via email to occupational@addenbrookes.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division B, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Advanced Occupational Therapy Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249186", "validThrough": "2020-11-22T23:59:59+0000"}