{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103806", "minValue": "79957", "unitText": "YEAR", "value": "£79,957 - £103,806"}}, "datePosted": "2020-10-29T12:31:11+0000", "description": "&lt;p&gt;Applications are invited for the post of Consultant Oral &amp; Maxillofacial Surgeon based at Morriston Hospital, Swansea.&lt;/p&gt;\n&lt;p&gt;This substantive position replaces a retired colleague and is an exciting opportunity for an enthusiastic candidate to join a well-established, progressive multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a team of 6 Consultants responsible for the provision of Oral and Maxillofacial services to Swansea Bay UHB and Hywel Dda UHB. The post will involve general maxillofacial surgery and surgical dermatology with the successful candidate expected to link into Dermatological services in Hywel Dda.&lt;/p&gt;\n&lt;p&gt;The post will provide the basis for a hub and spoke regional service from Morriston Hospital, Swansea to hospitals in West Wales. The Maxillofacial Unit based at Morriston Hospital, which includes the specialties of Orthodontic and Restorative Dentistry, has a close working relationship with West Wales providing an integrated maxillofacial service to this region.&lt;/p&gt;\n&lt;p&gt;The Oral and Maxillofacial Unit is one of the busiest in the United Kingdom serving a population of 1.25 million. A wide range of Oral and Maxillofacial services are carried out including head and neck surgery, paediatric oral and maxillofacial surgery, facial deformity surgery, maxillofacial trauma, salivary gland surgery and cutaneous malignancy. &lt;strong&gt;The successful candidate will be encouraged and supported to develop their subspecialty and multidisciplinary interests.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is a commitment in the post for undergraduate and postgraduate teaching providing support for Swansea Medical School and the postgraduate department within the Health Board.&lt;/p&gt;\n&lt;p&gt;Applicants must have full GMC and GDC registration with a license to practice and must be eligible for inclusion in the GMC specialist register and hold a certificate in completion of training (CCT) or be within six months of accreditation at the time of interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Steven Key&lt;/p&gt;\n&lt;p&gt;Clinical Lead - OMFS&lt;/p&gt;\n&lt;p&gt;steven.key@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01792 618898&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Morriston Hospital, Swansesa", "postalCode": "SA6 6NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6847", "longitude": "-3.93527"}}, "title": "Consultant in Oral and Maxillofacial Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248323", "validThrough": "2020-11-19T23:59:59+0000"}