{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-04T11:31:07+0000", "description": "&lt;p&gt;Care to join us?&lt;/p&gt;\n&lt;p&gt;The Oxford University Hospitals NHS Foundation Trust (OUHFT) is currently looking for Medicines Management Technicians (MMT) with good communication skills and an enthusiastic outlook to support its friendly and dynamic team. This is an exciting opportunity for the successful candidates to make a difference to a wide variety of patients across different clinical specialties on the different hospital sites.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is suitable for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- qualified MMTs looking for a new challenge or change of location&lt;/p&gt;\n&lt;p&gt;- newly qualified and registered pharmacy technicians&lt;/p&gt;\n&lt;p&gt;- community pharmacy technicians looking for a career change&lt;/p&gt;\n&lt;p&gt;You will be a key member of a range of teams across the department and the hospital, supporting busy wards and clinical areas. The MMT post allows the successful candidate to develop their clinical knowledge of a range of patient and drug groups, giving ample opportunity for continuing professional development. Opportunities to gain leadership and project management skills will be available to the right candidates.&lt;/p&gt;\n&lt;p&gt;Opportunities are available in the following specialties*:&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;Upper and Lower GI Surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;Surgical Emergency Unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;Trauma&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;Gastroenterology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;Ambulatory services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;(*this list is subject to change)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must be qualified pharmacy technicians registered with the GPhC. You will need to demonstrate a high level of professionalism and a commitment to Continuing Professional Development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Key duties include:-&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;· Completion of accredited checking pharmacy technician (ACPT) qualification (if not already held)&lt;/p&gt;\n&lt;p&gt;· Undertake accreditation for medicines reconciliation, assessing patients own drugs and supply of non-stock items for one stop-dispensing; assisting with TTO supplies&lt;/p&gt;\n&lt;p&gt;· Working as part of the pharmacy team to provide near patient medicines management services to wards, including ward-based dispensing and patient counselling&lt;/p&gt;\n&lt;p&gt;· Liaising with care providers outside the hospital e.g. GPs and community pharmacies&lt;/p&gt;\n&lt;p&gt;· Ward controlled drug checks and returns&lt;/p&gt;\n&lt;p&gt;· Conducting audits, reports and medicine usage reviews&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Full on-the-job training will be provided, with a view to developing into the Band 5 role following appropriate accreditation(s). Candidates who do not hold valid ACT and MMT accreditations will be placed on the Band 4 pay scale until minimum accreditations have been completed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The OUHFT offers flexible working hours, including condensed hours and job share opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Trust:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The four hospital sites (John Radcliffe, Churchill, Nuffield Orthopaedic Centre and the Horton General) provide an exceptionally high standard of clinical care to our patients. As well as being a renowned Cancer centre, we are also famous for our expertise in areas such as transplant and neurosciences. As a teaching Trust, we are dedicated to the education of our staff. We are keen to develop our leaders, whatever their role, and strive to promote our 6 Trust values; learning, respect, delivery, excellence, compassion, and improvement. Central to the Trust&#39;s &lt;strong&gt;vision&lt;/strong&gt; are its staff. We aim to recruit, train and retain the best people to enact its values and achieve our vision.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Oxford:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our beautiful “City of Dreaming Spires” is full of culture and history. From the city centre, where you’ll find the Bodleian Library and Pitt Rivers Museum, to the eclectic restaurants and buzzing bars of Cowley Road; there really is something for everyone. Visitors and Oxonians alike enjoy punting down the river, stopping off at waterside pubs and cafes. Alongside the University of Oxford, the new Westgate shopping centre boasts a plethora of shops, entertainment, and rooftop dining. Just a short walk away, the Covered Market offers a more traditional shopping experience.&lt;/p&gt;\n&lt;p&gt;Travel just a short distance outside of the city and you will find the Cotswolds, Blenheim Palace, and the Botanic Gardens. Oxford is famous for its country walks and characterful village pubs.&lt;/p&gt;\n&lt;p&gt;Further afield, London is easily accessible by road or rail. There are excellent links to the London airports, with coaches available regularly day and night.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Living in Oxford:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Oxford has a reputation for being an expensive place to live. However, there has never been more choice of accommodation: shared houses; studio flats; Monday to Friday rentals; inner city; rural village. You will find a vast array of living options on Rightmove, Gumtree and DailyInfo, as well as other popular sites.&lt;/p&gt;\n&lt;p&gt;The OUHFT offers housing to individual key workers and their families. A2Dominion can be contacted for further information about on-site accommodation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note: this advert may close earlier than the date stated if a sufficient number of applicants is reached.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 1st December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatie McDonaldAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Katie McDonald: &lt;/strong&gt;&lt;strong&gt;Katie.McDonald@ouh.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Churchill, John Radcliffe and Nuffield Orthopaedic Centre, Oxford", "postalCode": "OX3 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Medicines Management Technician- various specialities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255611", "validThrough": "2020-12-01T23:59:59+0000"}