{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 PER ANNUM PRO RATA"}}, "datePosted": "2020-11-05T16:16:07+0000", "description": "&lt;p&gt;&lt;strong&gt;This vacancy is for Internal Applicants to UHMBT only &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen in Morecambe Bay for an Audit Administrator to join the Medicine Care Group within University Hospitals of Morecambe Bay NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The successful applicant will focus specifically on the Medical Audit work including SSNAP/TARN and General Audits. Other aspects of the role will include working closely with the clinical teams, responsibility for the data collection and analysis and also the input of data onto National Databases. A good clinical knowledge, experience of working with Audit and collection and input of data would be preferable for this post, and excellent organisational, I.T and interpersonal skills. Induction, supervision and support will be provided for the successful candidate.&lt;/p&gt;\n&lt;p&gt;Clinical Audit is a multi-disciplinary activity that enables healthcare professionals to review patient care and identify opportunities for improvement in a wide variety of clinical conditions. It is also used to influence change and improvement within systems of care, or to confirm that current practice meets the expected level of performance.&lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6-month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNeil SmithJob titleDeputy Associate Director of OperationsEmail addressNeil.Smith@mbht.nhs.ukTelephone number07896600894&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Furness General Hospital, Barrow", "postalCode": "LA14 4LF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1364", "longitude": "-3.20788"}}, "title": "Clinical Audit and Effectiveness Facilitator - Internal Only", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258512", "validThrough": "2020-11-12T23:59:59+0000"}