{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa pro rata"}}, "datePosted": "2020-10-29T12:15:50+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Health Visitor vacancy in Bromley Borough&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 6 -£31,365 - £37,890+ HCAS £4,704 -£4,822 Pro Rata Per Annum&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to work for an organisation that is progressive, innovative and provides quality care for families in Bromley? To find out what its like to work for Bromley Healthcare please view our videos on YouTube, search for Bromley healthcare and you will get a flavour of Bromley healthcare.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently looking for Health Visitors to join our dynamic and friendly teams who are patient focused and thrive on providing quality care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a health visitor with the Bromley 0 to 19 service you will have opportunities to work with families offering face to face contacts for all 5 key contacts and be involved directly to improve services for families.&lt;/p&gt;\n&lt;p&gt;Bromley Healthcare is one of the first Social Enterprise’s working successfully with the NHS and has been established since 2011. The benefits of this approach are high productivity, greater innovation, better care and greater job satisfaction for the professionals and support staff working in the organisation. This results in driving improvement in services for our families.&lt;/p&gt;\n&lt;p&gt;As a health visitor working in Bromley you will provide quality face to face contacts for families for all key contacts, work in a diverse borough following the Healthy Child Programme. Health Visitors have regular management, safeguarding, clinical and restorative supervision and support throughout your career and a chance to develop and grow with Bromley Healthcare. Our health visitors work in teams which are dynamic, supportive, friendly and well established. We work closely with GP’s, Children Centres and Local Authority Commissioners. There is a commitment of strong visible leadership at all levels. Health Visitors have access to mobile working with lap tops and smart phones. Professional progression is encouraged with a programme of training throughout the year which is clinically led and complimented by Bromley Children&#39;s Safeguarding Partnership training .&lt;/p&gt;\n&lt;p&gt;The Bromley health visiting service is divided into 3 localities; Beckenham and Penge, Central Bromley and Orpington based in Community Vision Children&#39;s Centre, Phoenix Children&#39;s Resource Centre and Blenheim Children&#39;s Centre, respectively. There are six Children and Family Centres in the borough and the main hospital is the Princess Royal University Hospital.&lt;/p&gt;\n&lt;p&gt;Working for Bromley 0to19 you will work closely with the 5 to 19 public health nursing service and Family Nurse Partnership to make a difference by bringing your skills and expertise to the families who live in Bromley. It’s rewarding, challenging and exciting work and your skills can make a difference.&lt;/p&gt;\n&lt;p&gt;If you would like to work for Bromley as a health visitor, have a look at the Job description and key essential and desirable skills required for the post – if you meet the criteria please apply or call us for further information.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAderonke SalauJob titleOperational Lead OrpingtonEmail addressaderonke.salau@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125834.jpg", "name": "Bromley Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various sites: Phoenix Children&#39;s Resource Centre; Blenheim and Community Vision Children&#39;s Centres, Bromley", "postalCode": "BR2 9JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3956", "longitude": ".024854"}}, "title": "Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248274", "validThrough": "2020-11-12T23:59:59+0000"}