{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-11-04T13:01:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Commissioning/Brokerage Manager at Jubilee House – Secondment/Fixed term until 31/03/2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Individual Patient Activity &lt;/strong&gt;&lt;strong&gt;Commissioning&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Main role and duties:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for the above position within the commissioning remit in Individual Patient Activity reporting to the Senior Contract/Brokerage Manager and Head of Commissioning.&lt;/p&gt;\n&lt;p&gt;The post holder will assist the Senior Commissioning Manager in the oversight and operational management of commissioning and data flows for the IPA services including the negotiation, agreement and brokerage of Continuing Health Care, Mental Health, LD agendas and Individual Patient Activity contracts and packages of care. The role will include but not be limited to the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist the Senior manager to achieve economies of scale by commissioning over a wider footprint and providing data led intelligence to the “At Scale” commissioning programme of work.&lt;/li&gt;\n&lt;li&gt;Using quality data to ensure interdependencies with other MLCSU functions to facilitate market development and procurement of essential services which achieve improved quality and best value for areas of responsibility.&lt;/li&gt;\n&lt;li&gt;Form robust links with contracts and assist the Senior Manager to ensure provider lists are current and up to date.&lt;/li&gt;\n&lt;li&gt;Working with CHC, Complex Case Co-ordinators to ensure the negotiation and agreement of appropriate packages of care/placements to meet individual patient needs with providers of care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Performance and monitoring of contracted placements and working with contracting support regarding any necessary remedial action.&lt;/li&gt;\n&lt;li&gt;Ensuring all data held regarding patient placements is accurate through data quality management across all Individual Patient Activity packages and reporting on activity.&lt;/li&gt;\n&lt;li&gt;Presenting cases of a highly complex, contentious and sensitive commissioning issues and funding to the Commissioning Decision Groups as delegated by the Senior Manager.&lt;/li&gt;\n&lt;li&gt;Prepare intelligence led data reports for Commissioning Decision Groups panels requested by the Senior Manager&lt;/li&gt;\n&lt;li&gt;Ensure accurate agendas and minutes for all Complex Case Discussion Groups are in place and Chair as requested.&lt;/li&gt;\n&lt;li&gt;Working with the Senior Manager in the development of clear service specifications for service developments within areas of responsibility, based on desired outcomes.&lt;/li&gt;\n&lt;li&gt;Working with other stakeholders, carers/patients to develop agree and support service delivery.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Essentials to carry out role:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;The Ideal candidate must be educated to degree level or equivalent gained through specific relevant experience and able to demonstrate excellent IT skills. This is a data led post and therefore there is a requirement for having a data proficient candidate.&lt;/li&gt;\n&lt;li&gt;Experience of high-level negotiation is essential to this role as is managing multiple providers through a relationship management role. Contract monitoring and commissioning is pertinent to this role as is a robust knowledge of all aspects of excel and word. Ability to work to tight time frames and be able to work as part of a well-established senior team but also to be able to work autonomously where required.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBarry GlasspellJob titleSenior Contracts and Brokerage ManagerEmail addressbarry.glasspell@nhs.netTelephone number: 07881 353836Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Barry Glasspell&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Contracts and Brokerage Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Midlands and Lancashire CSU &lt;/strong&gt;&lt;br /&gt;Tel: 01772 214255 Mobile: 07881 353836&lt;br /&gt;Email:barry.glasspell@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128334.png", "name": "Midlands and Lancashire Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128334"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jubilee House, Leyland", "postalCode": "PR26 6TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7076", "longitude": "-2.69456"}}, "title": "Commissioning/Brokerage Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255953", "validThrough": "2020-11-11T23:59:59+0000"}