{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T17:16:10+0000", "description": "&lt;p&gt;The South West Regional Operations Centre (ROC) is now being established to manage the expected support required to coordinate the delivery of services to our patients and to support local healthcare professionals and Systems in delivering required services, during what may be a challenging period. The ROC will be responsible for communicating CoVid-19, Winter and EU Exit Transition requirements to Providers, Commissioners and other organizations that support healthcare delivery in the SW Region; assuring local preparations; responding to operational enquiries for CoVid-19, Winter and EU Exit Transition; coordinating the operational response within the SW Region and meeting national reporting requirements for CoVid-19, Winter and EU Exit Transition.&lt;/p&gt;\n&lt;p&gt;The centre will provide an exciting and dynamic environment where learning, continuous improvement, growth and development will be fully supported and encouraged. We are looking for energetic and committed team members to bring their skill set and experience to the role and support in the delivery of this vital function.&lt;/p&gt;\n&lt;p&gt;As the ROC Inbox Manager, the post holder will work as part of a dynamic team in delivering an effective service supporting local organisations across the Region to maintain a high level of preparedness and delivery for CoVid-19, Winter and EU Exit Transition. The post holder will be responsible for ensuring the smooth management of ROC Inboxes including;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monitoring, managing and developing In Box processes&lt;/li&gt;\n&lt;li&gt;Allocating and prioritising workload across In Box team.&lt;/li&gt;\n&lt;li&gt;Ensuring emails are appropriately reviewed, actioned and archived.&lt;/li&gt;\n&lt;li&gt;Ensuring priority emails are flagged to the appropriate staff within the ROC&lt;/li&gt;\n&lt;li&gt;Ensuring Out of Office is actioned in line with operational hours&lt;/li&gt;\n&lt;li&gt;Ensuring effective handovers between shifts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The ROC Loggist will generally work a 12-hour shift pattern (0800 – 2000) and support the ROC function 7 days a week (37.5 hour working week), including Saturday and Sunday working. Shifts may be split. Weekend working requirements will be undertaken on a rota basis, unless volunteers are found to regularly work at the weekend. Part-time and flexible working are welcomed. Additionally, there may be a requirement for the successful candidate to provide cross-cover for other members of the ROC, including flexing working hours in line with ROC core operating hours and undertaking other tasks and activities as specified by the ROC Manager.&lt;/p&gt;\n&lt;p&gt;While the primary location for the South West ROC is in South West House, Taunton, following a period of induction, the successful candidate will generally work remotely, using MS Teams, following current NHS workforce guidance.&lt;/p&gt;\n&lt;p&gt;When the ROC is able to return to an office base environment, the successful candidate’s location may include South West House, Jenner House, Chippenham or Peninsula House in Saltash.&lt;/p&gt;\n&lt;p&gt;The reason for the fixed term contract is because this a short-term time limited project.&lt;/p&gt;\n&lt;p&gt;Interviews for this post will take place virtually on Microsoft Teams.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Nina Barnard&lt;/p&gt;\n&lt;p&gt;Job title:  Workforce Manager&lt;/p&gt;\n&lt;p&gt;Email address: n.barnard1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton, Chippenham or Saltash", "postalCode": "TA1 2PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0152", "longitude": "-3.06776"}}, "title": "Regional Operations Centre Loggist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254914", "validThrough": "2020-11-17T23:59:59+0000"}