{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-03T13:45:41+0000", "description": "&lt;p&gt;Opportunities exist for a Diagnostic Consultant Neuroradiologist to join our regional Neurosciences centre at University Hospitals Coventry and Warwickshire NHS Trust.&lt;/p&gt;\n&lt;p&gt;University Hospitals Coventry and Warwickshire (UHCW) is a large teaching hospital. The Trust has accreditation as a Major Trauma Centre and designation as a Tertiary Vascular Centre and has well-established links with Warwick Medical School. It is one of the largest and busiest NHS teaching trusts in the country housed in a modern specially designed PFI facility (which ensures a guaranteed equipment replacement programme) caring for over a million people from across Coventry, Warwickshire and beyond. This Trust is one of the largest providers of healthcare in the area with a complement of over 1200 beds for a local population of 390,000 and a regional population of 1.5 million.&lt;/p&gt;\n&lt;p&gt;The excellent facilities provided at the University Hospital are complemented by attractive rural living in the Warwickshire countryside or in pleasant towns including Leamington Spa, Warwick, Kenilworth and Stratford-upon-Avon. The region is exceptionally well connected, located in central England; the local motorway network gives ready access to major centres in London, Birmingham and Oxford with fast connections also to the South West, North and North West. Rail services are quick with easy commuting times to London and Birmingham whilst airports in the Midlands and London are all readily accessible. There is a good selection of local state and independent schools throughout Warwickshire.&lt;/p&gt;\n&lt;p&gt;The Adult Diagnostic Neuroradiology department is staffed by 4 Consultant Neuroradiologists of which two cover Paediatric Neuroradiology. UHCW also has a Neuro Interventional Radiologist&lt;/p&gt;\n&lt;p&gt;The Trust would like to invite applications from prospective candidates that can contribute to an exciting programme of expansion of its team and its equipment. The expansion programme includes a state of the art CT, PET-CT and hybrid Interventional theatre.&lt;/p&gt;\n&lt;p&gt;The post will be primarily based at the University Hospital site.&lt;/p&gt;\n&lt;p&gt;The post will involve 10 programmed activities of imaging support (8.5 DPAs plus an indicative 1.5 SPAs) and will predominantly provide a comprehensive diagnostic Neuroradiology service and will provide support for the existing Neuroradiologists. The successful candidate will be expected to participate in a neuro-radiology on call Rota with 1:11 frequency.&lt;/p&gt;\n&lt;p&gt;Any potential candidate that is unable to work full-time for personal reasons will be eligible to be considered for the post. On appointment the job plan will be agreed with the Clinical Lead.&lt;/p&gt;\n&lt;p&gt;Applicants should hold or be eligible for CCT within 6 months of interview.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Informal clinical enquiries and requests to visit are welcome and arrangements should be made to Dr Manpreet Dhillon Clinical Lead via:&lt;/p&gt;\n&lt;p&gt;Margaret Evans, Personal Assistant; &lt;strong&gt;Margaret.evans@uhcw.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Opportunities will then be offered to meet colleagues and also the Head of Operations Imaging, Mr David White.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Manpreet DhillonJob titleConsultant RadiologistEmail addressmanpreet.dhillon2@uhcw.nhs.ukTelephone number02476 967082&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHCW, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Consultant Neuro-Diagnostic Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254184", "validThrough": "2020-11-24T23:59:59+0000"}