{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 pa pro rata"}}, "datePosted": "2020-11-04T14:30:50+0000", "description": "&lt;p&gt;Critical care is currently seeking applications to join our motivated, friendly and supportive teams. We’re looking for nurses who’d like to work in critical care and offer you a unique opportunity to work in specialised intensive care units, gaining a wide range of clinical expertise, as well as professional growth for your career development.&lt;/p&gt;\n&lt;p&gt;Please note that this vacancy is for experienced nurses – if you’re a newly qualified nurse you should apply through our dedicated newly qualified adult or child nurse adverts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR CARE GROUP&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The critical care units at University Hospital Southampton NHS Foundation Trust (UHS) are renowned for our local and national contribution to critical care, as well as for consistently delivering high standards of clinical care. We’re very proud of our developments and our service has expanded enabling us to actively recruit.&lt;/p&gt;\n&lt;p&gt;UHS is one of only two places in the south of England to offer adults and children full onsite major trauma care provision. We’re a designated major trauma centre and has general and specialist critical care areas which were awarded ‘outstanding’ for leadership in our recent CQC inspection.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TEAMS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;GENERAL INTENSIVE CARE UNIT&lt;/p&gt;\n&lt;p&gt;Currently a 25 bedded facility with plans for a brand new expanded unit to be built over the next two years. This will provide a 32 bed unit caring for patients with diverse and complex needs following a variety of injuries. Caring for predominantly unplanned admissions as well as some elective cases, GICU was recently awarded exemplar status by our Trust accreditation scheme.&lt;/p&gt;\n&lt;p&gt;SURGICAL HIGH DEPENDENCY UNIT&lt;/p&gt;\n&lt;p&gt;An elective unit, caring for patients immediately post operatively after a variety of specialist surgery including hepato-biliary pancreatic, colo-rectal, upper GI, vascular and more. SHDU has recently expanded to 10 beds and we pride ourselves in providing exceptional standards of nursing care.&lt;/p&gt;\n&lt;p&gt;NEUROSCIENCES INTENSIVE CARE&lt;/p&gt;\n&lt;p&gt;A 13-bedded unit offering an integrated specialist regional service for neurosurgical and neurological patients admitted as either emergencies or elective patients for a population of over three million. As a specialist unit situated within the Wessex Neurological Centre (a centre of excellence in the treatment of neurological disorders), we admit patients with a range of neurological and neurosurgical conditions, including multi trauma patients, as Southampton is designated as a regional major trauma centre.&lt;/p&gt;\n&lt;p&gt;CARDIAC INTENSIVE CARE UNIT&lt;/p&gt;\n&lt;p&gt;A 15-bedded unit caring for cardiac patients from across the region and nationally who require post-operative care following elective cardiac surgery, emergency surgical and cardiology admissions, complex multi organ support and adult congenital patients. We’re one of the largest cardiac centres in the country and are renowned for our local and national contribution to critical care and for consistently delivering high standards of clinical care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The critical care education team provides structured support to all staff and run development programmes that are well established. The formal education package follows a structured career pathway which includes induction training, and an in-house Foundation to Critical Care Nursing programme and Leadership programme.&lt;/p&gt;\n&lt;p&gt;All staff follow a nationally recognised competency package. There are opportunities to apply for the Principles in ICU course and High Dependency Course modules at both degree and masters level.&lt;/p&gt;\n&lt;p&gt;You’ll have the opportunity to actively participate in critical care issues at Trust, national and at an international level. With this varied and complex case mix, a commitment to developing our roles in a visionary manner makes this an excellent opportunity to gain a rewarding career within critical care.&lt;/p&gt;\n&lt;p&gt;There are multiple opportunities to rotate around the care group for personal development. As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible environment in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working where the needs of the service allow and you’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Rated ‘Good’ by the CQC, UHS is one of England&#39;s largest acute teaching trusts. In the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\nFor further details / informal visits contact:\nLisa Attrill\nRecruitment Coordinator\nlisa.attrill@uhs.nhs.uk\n02381 204 488", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Staff nurse - Critical care (Neurosciences ICU, General ICU, Cardiac", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256224", "validThrough": "2021-02-04T23:59:59+0000"}