{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42010", "minValue": "34961", "unitText": "YEAR", "value": "£34,961 - £42,010 per annum, HCA Inc, pro rata par"}}, "datePosted": "2020-10-07T14:31:41+0100", "description": "&lt;p&gt;Specialist Children and Young People’s Service (SCYPS).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Junior sister, Band 6 -Community Children’s Nursing Service – Caring for&lt;br /&gt;children with life limiting conditions and continuing care needs within the&lt;br /&gt;community setting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You need to be a RN (child) or RSCN, holding current NMC registration to be&lt;br /&gt;considered for this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking to recruit an enthusiastic nurse to work directly with a&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;caseload of children with life limiting conditions and continuing care&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;needs in the community setting as part of our band 6 nursing team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role provides opportunity to work along side the Continuing Care Nurse&lt;br /&gt;Specialist, gaining experience in setting up and supporting continuing care&lt;br /&gt;packages in the community for children with varying needs, including long&lt;br /&gt;term ventilation, non-invasive ventilation, naso-pharyngeal and oropharyngeal&lt;br /&gt;suction and tracheostomy care. It also involves working alongside&lt;br /&gt;the Diana Team lead supporting children with life limiting conditions who&lt;br /&gt;require responsive and routine visits within the community to manage their&lt;br /&gt;care and symptoms along their health journey. Previous community&lt;br /&gt;experience is not essential but you are required to have skills in clinical&lt;br /&gt;assessment, individual needs assessment and care planning, alongside the&lt;br /&gt;ability to work as part of a multidisciplinary, multi agency team. Good&lt;br /&gt;communication skills are a must alongside a flexible and forward thinking&lt;br /&gt;attitude. Please refer to the personal specification for more detail and refer to&lt;br /&gt;this within your application. This role will be supported directly by the senior&lt;br /&gt;nursing team leads for Continuing Care and Diana palliative care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for an innovative staff member who is interested in quality&lt;br /&gt;improvement and new ways of working. We support agile working with the&lt;br /&gt;use of laptops, smart phones and business parking permits for car drivers&lt;br /&gt;within the work setting. Areas for current service development include&lt;br /&gt;advance care planning and implementing hospital protocols supporting&lt;br /&gt;children with continuing care packages in hospital settings.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Newham is culturally the most diverse of all London boroughs, with people&lt;br /&gt;from a rich variety of ethnic, religious, and linguistic backgrounds. We have&lt;br /&gt;the third fastest growing population in England with 40% of the community&lt;br /&gt;being 0-24 years old and children and young people’s health services are at&lt;br /&gt;the centre of local developments.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We believe in providing compassionate care to children and families, in order&lt;br /&gt;to do this we need to foster a culture of compassionate working relationships&lt;br /&gt;and leadership within the service. We are committed to staff support,&lt;br /&gt;supervision and training. You will be supported to undertake further training to&lt;br /&gt;enable career progression within the service and have access to peer support and psychology consultation from the psychology team within the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit, please do not hesitate to contact Rebecca Daniels (Community Children’s Matron), Carmela Scott (Diana Team lead) or Danielle Taylor (Continuing Care Nurse Specialist)&lt;br /&gt;either by phone on 0203 738 7063 or on the emails below.&lt;br /&gt;Rebeccadaniels@nhs.net&lt;br /&gt;Carmela.scott1@nhs.net&lt;br /&gt;Danielle.lawson2@nhs.net&lt;br /&gt;.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CS Comm Child Nurse Team, Newham", "postalCode": "E1 8DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5135", "longitude": "-.072681"}}, "title": "Junior sister - Community Children&#39;s Nursing Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216927", "validThrough": "2020-11-08T23:59:59+0000"}