{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "77126", "minValue": "41360", "unitText": "YEAR", "value": "£41,360-£77,126 / £32,896 - £51,724 pa"}}, "datePosted": "2020-10-29T10:15:47+0000", "description": "&lt;p&gt;Specialty Doctor / Senior Clinical Fellow - Acute General Medicine&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Permanent&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Area: Carmarthenshire&lt;/p&gt;\n&lt;p&gt;Salary: £40,233 - £75,025 / £32,000 - £50,315 per annum&lt;/p&gt;\n&lt;p&gt;Applicants are invited to apply for a Specialty Doctor / Senior Clinical Fellow post in General Medicine based in Glangwili General Hospital, Carmarthen. You will be part of the medical on-call team and you will be supported and encouraged to develop a specialist interest in an area in medicine such as Care of the Elderly, Stroke, Orthogeriatrics, Gastroenterology, Respiratory, Cardiology and Rehabilitation.&lt;/p&gt;\n&lt;p&gt;These posts will join colleagues in a dynamic general medicine service within the Health Board in delivering and supporting the Welsh Government’s vision for NHS Wales. In addition to the established team we are also committed to continue expanding this team with more junior doctors.&lt;/p&gt;\n&lt;p&gt;This is an ideal opportunity for those wishing to enter a specialty training programme but need some more time/experience, those working towards MRCP/CESR (you will be supported to complete these) or those who have decided to enter a non-training post.&lt;br /&gt;Doctors wishing to apply for this post must have full registration with the General Medical Council and shall have completed at least four years’ full-time postgraduate training (or its equivalent gained on a part-time or flexible basis) at least one year of which will be in a specialty training programme in a relevant specialty or as a fixed term specialty trainee in a relevant specialty; or shall have equivalent experience and competencies.&lt;/p&gt;\n&lt;p&gt;The Postgraduate Department in Glangwili General Hospital has a fully developed programme of guest lectures and lunchtime meetings, including special interest groups and co-ordinated intra-practice activities and career counselling. The library offers a wide ranging book collection, with interlibrary lending network, excellent IT facilities, audio-visual and conferencing equipment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Glangwili Hospital is a busy regional hospital providing all general services for West Wales (General Surgery, Trauma and Orthopaedics included). The acute medical intake is mainly unselected and the post holder would be expected to equally share emergency medical admissions with general medical colleagues from all disciplines (Geriatrics, Cardiology, Endocrinology, Gastroenterology, Respiratory). Renal and Neurology support are regional services provided by Swansea hospitals. The hospital includes a large ACCU / HDU facility run by Consultant Intensive Care staff who work closely with medical colleagues.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Hywel Dda University Health Board has close working relationships with both Swansea University and Cardiff University. Many of our consultants are affiliated Lecturers, Senior Lecturers and Associate Professors and we are delighted that out respiratory physician colleague, Prof Keir Lewis, has been recently appointed as the Chair of Respiratory Medicine. It is envisaged that this appointment will significantly increase the already very active research portfolio within the Health Board.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;West Wales provides a wonderful lifestyle opportunity, each of our major sites in Hywel Dda are in coastal areas with beautiful beaches and spectacular mountains within easy reach. Exciting leisure pursuits such as surfing, mountain biking, fishing, sailing, hiking and walking are all available in this locality famous for its outstanding natural beauty. Reasonable property prices and excellent state schools contribute to low living costs and a high quality of life. There are also good road and rail connections to Cardiff, the North and London.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Eiry Edmunds, Consultant and Hospital Medical Director 01267 235151&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Specialty Doctor / Senior Clinical Fellow in Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247866", "validThrough": "2020-11-15T23:59:59+0000"}