{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive hourly rate"}}, "datePosted": "2020-10-06T15:59:22+0100", "description": "&lt;p&gt;The Chantry is a Sue Ryder specialist neurological care centre based in Ipswich, caring for people aged 18 and over who have life-changing conditions affecting the brain and nervous system. We are here for people with degenerative conditions which get worse over time – such as motor neurone disease, multiple sclerosis and Parkinson’s – as well as those with acquired conditions resulting from a brain or spinal injury or stroke.&lt;/p&gt;\n&lt;p&gt;We want to hear from care assistants with sound clinical skills who are looking for flexible/bank work opportunities. Everyone that joins our talent bank is chosen because they’re highly professional, passionate and dedicated to providing incredible care to our residents.&lt;/p&gt;\n&lt;p&gt;Responsibilities:&lt;/p&gt;\n&lt;p&gt;• To promote choice in the delivery of care and support. Reviewing and making suggestions to enhance the individuals’ experience. &lt;br /&gt;• To ensure accurate reporting and documentation.&lt;br /&gt;• To participate in care planning implementation and review.&lt;br /&gt;• To promote the values, build morale and encourage others to perform to high standards&lt;/p&gt;\n&lt;p&gt;The great benefit about being on the talent bank is the flexibility it provides for both you and the Charity. You have control work to fit in with your lifestyle. You must be flexible with excellent people skills and be a team over when you want to player. Successful applicants will ideally have recent experience in the delivery of care in a similar environment and have or be willing to gain an NVQ 2 in health and social care.&lt;/p&gt;\n&lt;p&gt;Benefits:&lt;br /&gt;• Free onsite parking &lt;br /&gt;• Subsidised meals &lt;br /&gt;• NHS Pension continuation / Private pension matched at either 3% or 5% / Auto enrolment pension scheme &lt;br /&gt;• 24 hour employee assistance line for free advice on work, family and personal life &lt;br /&gt;• PeoplePerks - discounts with hundreds of retailers and services that can amount to an average annual saving of £350&lt;/p&gt;\n&lt;p&gt;The Chantry is set in a beautiful grade 2 listed building in Chantry Park, Ipswich. There are several Local busses that stop within walking distance of The Chantry.&lt;/p&gt;\n&lt;p&gt;At Sue Ryder not only do we treat more conditions than any other UK charity in our hospices, neurological care centres and out in the community; we also campaign to improve the lives of people living with them.&lt;/p&gt;\n&lt;p&gt;In the event that we receive a significant number of applications, we may choose to close this role ahead of the closing date published.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ipswich", "postalCode": "IP2 0BP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0541", "longitude": "1.11742"}}, "title": "Care Assistants - Bank", "url": "https://www.jobs.nhs.uk/xi/vacancy/916215334", "validThrough": "2020-12-21T23:59:59+0000"}