{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £36,681 per annum pro rata incl HCAS"}}, "datePosted": "2020-11-04T11:30:19+0000", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Paediatric Sister &lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Are you an experienced and motivated Band 5 or Band 6 Paediatric Nurse who is motivated to expand your skills and knowledge? Are you passionate about providing the best care to children and their families?  If so, we may have just the job for you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen within our Paediatric department for a 1 year fixed term Band 6 Sister. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Band 6 sister to join our team. If you are already a band 6 or if you wish to progress from a Band 5 to a band 6, we will support you working through a series of competencies/objectives. You will be supported by our senior nursing team, to develop your clinical and managerial skills. &lt;/p&gt;\n&lt;p&gt;The successful applicant will already have 2 years general paediatric experience and be taking charge of a similar unit in your current/previous role. ITU/HDU experience would be beneficial.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ward Overview&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are the only general paediatric ward within a district general hospital. We provide care to children of all ages with a wide variety of medical and surgical problems (ENT, Maxillo-facial, Ophthalmology, General surgery, and Orthopaedics).&lt;/p&gt;\n&lt;p&gt; We have designated level 2 Paediatric Oncology Shared Care Unit (POSCU) providing shared care oncology and we are the designated teenage and young adult unit for Surrey.  In addition, the ward has a busy rapid assessment unit. (PAU). We work closely with the paediatric A&amp;E department, SCBU and children’s out patient department.&lt;/p&gt;\n&lt;p&gt;We are planning to develop 2 formal high dependency beds, although already provide high dependency care when needed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to visit the ward informally to meet the team and see how we can support your learning and development, please contact Senal Soyer, Matron Paediatrics – 01483 571122 s.soyer@nhs.net &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Paediatric Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255596", "validThrough": "2020-11-18T23:59:59+0000"}