{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 inc 5% Fringe HCAS"}}, "datePosted": "2020-09-25T15:52:01+0100", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for an Occupational Therapist within East Surrey Community Team for People with Learning Disabilities at Surrey and Border Partnership NHS Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role is a Band 6 Occupational Therapist in East Surrey, 2 days (15hrs) per week, until mid-September 2021, to start as soon as possible.&lt;/p&gt;\n&lt;p&gt;We are a friendly and dynamic Occupational Therapy team and Occupational Therapy is a valued member of our wider MDT. We serve the health needs for adults with Learning Disabilities in East Surrey.&lt;/p&gt;\n&lt;p&gt;Our team bases are in Epsom and Redhill, though we are currently also working flexibly from home to a degree due to the current pandemic. The candidate must have a full and valid driving licence due to the community element of the role and the large geographical area that the East Surrey Community Team cover.&lt;/p&gt;\n&lt;p&gt;The Occupational Therapy team comprises a Band 7, 6, 5 and an Occupational Therapist apprentice. This post is a short-term addition.&lt;/p&gt;\n&lt;p&gt;This would suit an existing band 6 occupational therapist who would like to gain experience in working with people with learning disabilities or an experienced Band 5 looking for a challenge and experience at Band 6 level.&lt;/p&gt;\n&lt;p&gt;The ideal candidate would be passionate about working with people with learning disabilities, have a grounded knowledge of occupational therapy, and be a self-directed motivated team player.&lt;/p&gt;\n&lt;p&gt;In practice we use the Model of Human Occupation to guide all our occupational therapy assessments and interventions.&lt;/p&gt;\n&lt;p&gt;The occupational therapy leadership team is committed to an extensive, co-ordinated CPD programme including supervision, care group and trust wide trainings, core competence training.&lt;/p&gt;\n&lt;p&gt;Staff are valued for their expertise in occupationally focussed interventions, and work as a core part of the multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;If you would like further information please contact Lindsey.mosley@sabp.nhs.uk 01737 288800&lt;/p&gt;\n&lt;p&gt;We look forward to your application form!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom", "postalCode": "KT19 8PH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.337", "longitude": "-.298015"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916201220", "validThrough": "2020-11-08T23:59:59+0000"}