{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inc HCA"}}, "datePosted": "2020-10-26T17:01:20+0000", "description": "&lt;p&gt;Occupational Therapist (Band 6) Rotation&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an Occupational Therapist to join our community Band 6 rotation at East London NHS Foundation Trust. This is a perfect post for OTs hoping to consolidate their Band 6 and clinical skills but equally we have an excellent reputation for developing experienced Band 5 OTs.&lt;/p&gt;\n&lt;p&gt;The rotation lasting 9 months will include:&lt;/p&gt;\n&lt;p&gt;Community Rapid Response and Intermediate Care Team at Mile End Hospital&lt;br /&gt;Community Health Team at Mile End Hospital&lt;br /&gt;Wheelchair Service at Mile End Hospital&lt;br /&gt;Reablement at John Onslow House, Bow&lt;br /&gt;Local Authority Social Services at Albert Jacob House, Bethnal Green&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for an Occupational Therapist with experience working with patients across the care pathway and a variety of clinical areas. Individuals should have strong clinical skills and teaching skills as well as ability to manage a defined caseload of complex cases independently, providing comprehensive occupational therapy assessment and intervention, evidencing problem solving and clinical reasoning skills in line with evidence-based practice.&lt;br /&gt;The successful candidate will display a strong commitment to patient centred care and be innovative, creative and dynamic. &lt;br /&gt;&lt;br /&gt;The post holder will gain experience assessing and developing treatment programs for a broad range of conditions across various settings in the community. We are committed to provision of high quality patient centred care combined with clinical excellence and involvement in clinical research.&lt;/p&gt;\n&lt;p&gt;You will be supported in developing your OT skills and encouraged in your professional development from a large and supportive MDT therapy team. We value commitment to professional development, training and high quality clinical supervision for all our staff.&lt;/p&gt;\n&lt;p&gt;The service has a strong and well established training and education programme, along with robust personal development review programme to support staff with their learning and development. All the OTs will be expected to participate in joint clinical sessions with their peers.&lt;/p&gt;\n&lt;p&gt;The service operates a seven day service, covering core hours between 8am and 6pm. Actual working hours are specific to each team, e.g. there is an 11am to 7pm shift in the Rapid Response Team. You will need to be a versatile, adaptable team player who is prepared to work across a 7 day rota.&lt;/p&gt;\n&lt;p&gt;Potential candidates should have current HPC registration and ideally be a current member of COT and specialist interest group, along with evidence of post-graduate study. You must have experience working within the NHS across a number of clinical areas, and at least 18 months post-graduation.&lt;/p&gt;\n&lt;p&gt;Please be aware that we reserve the right to close this position early if we experience high demand therefore early application is advised.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "AADS Team | Third Floor | Beaumont House | Mile End Hospital | E1 4DG, LONDON", "postalCode": "E1 8DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5135", "longitude": "-.072681"}}, "title": "Rotational Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243530", "validThrough": "2020-11-08T23:59:59+0000"}