{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 pa inc. HCAS"}}, "datePosted": "2020-10-27T17:30:47+0000", "description": "&lt;p&gt;We are looking for exceptional Band 5 community nurses to join us in our Central London community nursing service in West London which covers Kensington &amp; Chelsea and North West Westminster.&lt;br /&gt;&lt;br /&gt;If you are a passionate, motivated team player and want to excel in delivering exceptional holistic healthcare to a diverse patient group alongside a range of community experts and team leads, we want to hear from you.&lt;br /&gt;&lt;br /&gt;Previous experience of community nursing is a benefit but not essential as we offer a structured training development programme with formal support, provided. If you choose to join us here, many of your new colleagues will have joined us from acute services and found community nursing to be the exciting and challenging next step in their nursing career that they were looking for.&lt;br /&gt;&lt;br /&gt;As a community nurse, you will be directly involved in facilitating and shaping self-care for patients with long term conditions and health promotion requirements in order to help keep them as well as possible in their own homes. Additionally, you will participate in innovative projects that enhance a patient’s life, as well as contributing to continuous improvement management activities within the organisation which look to directly improve the services we offer.&lt;br /&gt;&lt;br /&gt;We are committed in offering you a rewarding and fun team environment with clinical supervision and support, a variety of career development opportunities and access to learning and development ensuring your continuous professional enhancement, clinical leadership support and alongside this the chance to work in the unique and energetic areas of Central London.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North West Westminster District Nursing, London", "postalCode": "W10 4LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5306", "longitude": "-.207616"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245585", "validThrough": "2020-11-10T23:59:59+0000"}