{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "112845", "minValue": "84258", "unitText": "YEAR", "value": "£84,258 - £112,845 per annum, inc London Weighting"}}, "datePosted": "2020-10-26T15:01:42+0000", "description": "&lt;p&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/p&gt;\n&lt;p&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/p&gt;\n&lt;p&gt;Applications are invited for a full-time substantive Glaucoma Consultant at King’s College Hospital based at Orpington Hospital. Applicants must have recognised higher training and expertise in glaucoma.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;King’s ophthalmology services are centred at King’s College Hospital, Denmark Hill, Queen Mary’s Hospital, Sidcup and Orpington Hospital, Orpington. Services also are provided at University Hospital of Lewisham. The ophthalmology services are staffed by 29 Consultant Ophthalmologists (13 based at King’s, 16 at South sites (QMS and Orpington)) covering all subspecialty interests. There is support from a range of non-Consultant medical staff and a full complement of orthoptists, optometrists, ophthalmic photographers, technicians, specialist nurses and administrative staff. The outpatient departments are very well equipped and there are dedicated eye theatres at Queen Marys Hospital, Princess Royal University Hospital and.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for a suitably trained individual to join a service that is undergoing exciting developments. The successful applicant will be part of a team of 6 Consultants who specialise in all aspects of glaucoma and work across the 5 King’s sites. The main remit of the post is to provide and develop comprehensive, excellent and innovative glaucoma services for King’s at its Orpington Hospital site. There will be a commitment to developing virtual services and a particular role in developing community based glaucoma services. The post holder will contribute to the strategic development of glaucoma services across all King’s sites in collaboration with colleagues. There will be opportunity for research, with the hospital being a member of an Academic Health Sciences Centre.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Orpington Hospital is situated on the edge of the green belt with easy access to central London, the Kent countryside and the Chanel ports. There is a good selection of housing in rural and suburban locations and an excellent choice of state and private schools.&lt;/p&gt;\n&lt;p&gt;Applicants should be on the General Medical Council’s Specialist Register or have the appropriate CCT. Candidates can also apply if they are within six months of their CCT at the date of the interview but are required to have sat and passed their exit exam or equivalent. Applications from those unable to work full time will also be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr Mani ThiagarajanJob titleConsultant Clinical Lead, Ophthalmology at OrpingtonEmail addressmanickam.thiagarajan@nhs.netTelephone number01689865684&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Orpington Hospital, Orpington", "postalCode": "BR6 9JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3625", "longitude": ".095177"}}, "title": "Glaucoma Consultant, Ophthalmology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243038", "validThrough": "2020-11-20T23:59:59+0000"}