{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-11-02T03:45:51+0000", "description": "&lt;p&gt;The Clinical Commissioning Group lies within the boundaries of the East Riding of Yorkshire covering 1000 square miles of rural, urban and coastal geography and is responsible for the commissioning of healthcare services for the majority, but not all, of the East Riding of Yorkshire population (the Pocklington population are the responsibility of the Vale of York CCG).  As such we work closely with our neighbouring CCGs to promote consistency of commissioning with our major provider organisations and with East Riding of Yorkshire Council to ensure that we are jointly commissioning and transforming services to improve the overall health and wellbeing of our population.&lt;/p&gt;\n&lt;p&gt;The CCG consists of 29 GP Practices who have come together to jointly commission services for their patient populations.&lt;/p&gt;\n&lt;p&gt;We aim to use Clinical Commissioning to drive the transformation of local services to better meet the needs of our resident population. This will be achieved whilst continuing to work within the national operational guidance which underpin the wider aspirations, and delivery, of the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Vision and Values &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The CCG, along with the Health and Wellbeing Board, remains focused upon its vision to provide ‘&lt;strong&gt;Better care, more locally, within budget through transformation’ &lt;/strong&gt;with the underlying premise that &lt;strong&gt;‘Everyone needs to do something different’ &lt;/strong&gt;to improve health and healthcare, including patients, carers, clinicians, wider public, healthcare professionals and social care professionals.&lt;/p&gt;\n&lt;p&gt;This vision is supported by our organisational values of &lt;strong&gt;effective partnership working, ensuring everyone counts, providing quality services, effective leadership and integrity, &lt;/strong&gt;ensuring we&lt;strong&gt;  involve &lt;/strong&gt;and continue to&lt;strong&gt; improve &lt;/strong&gt;in the way we behave as an organisation to achieve our vision.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen in East Riding of Yorkshire CCG to join the CCG’s Quality Team as the Quality &amp; Patient Safety Lead. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you passionate about quality of patient care? Are you motivated to ensuring commissioned providers continuously improve to deliver high quality, safe care? Are you someone who has a sound understanding of quality, patient safety and clinical effectiveness? If yes, then East Riding of Yorkshire Clinical Commissioning Group has an exciting opportunity for a Quality &amp; Patient Safety Lead.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role of Quality &amp; Patient Safety Lead is a vital part of the NHS East Riding of Yorkshire Clinical Commissioning Group and someone with a clear understanding of the delivery of safe and effective care across a wide range of providers is required. We are looking for an individual who is passionate about high quality care and able to take a lead role for ensuring and promoting the safety and quality of a range of commissioned services. The post holder will be a valued member of both the CCG and the Quality Team&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post is an exciting opportunity to join the CCG at a time of real positive change. We are looking for a leader who inspires staff through their actions, their knowledge and their professionalism at all times and in return we offer the opportunity for you to make a real difference to the quality of patient care across East Riding of Yorkshire. You will be an excellent communicator, flexible and adaptable and have good analytical and report writing skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is full time and will be reporting to the Head of Quality &amp; Integrated Governance. To be successful, you will be able to demonstrate a track record of relevant experience and achievement alongside a commitment to deliver value-based quality care. It is essential that you have a clear understanding of health service infrastructure, the national quality agenda, current workforce challenges and a strong commitment to relationship management with partner agencies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion please contact Nicki Sparling, Assistant Director of Quality &amp; Improvement / Deputy Lead Nurse on 07923232613 or &lt;/span&gt;&lt;span&gt;Nicki.sparling@nhs.net&lt;/span&gt;&lt;span&gt; or  Philippa Boynton, Head of Quality &amp; Integrated Governance on 07860847137 or &lt;/span&gt;&lt;span&gt;philippa.boynton@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS East Riding of Yorkshire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128381"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Willerby", "postalCode": "HU10 6DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7631", "longitude": "-.453549"}}, "title": "Quality and Patient Safety Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251216", "validThrough": "2020-11-19T23:59:59+0000"}