{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "47000", "minValue": "45000", "unitText": "YEAR", "value": "£45,000 - £47,000"}}, "datePosted": "2020-11-02T16:23:35+0000", "description": "&lt;h1&gt;Director of Clinical Services&lt;/h1&gt;\n&lt;p&gt;Reference&lt;/p&gt;\n&lt;p&gt;PRI40137&lt;/p&gt;\n&lt;p&gt;Location&lt;/p&gt;\n&lt;p&gt;Lickey Hills, Warren Lane, Lickey, Birmingham, B45 8ER&lt;/p&gt;\n&lt;p&gt;Priory Group Division&lt;/p&gt;\n&lt;p&gt;Healthcare&lt;/p&gt;\n&lt;p&gt;Vacancy Type&lt;/p&gt;\n&lt;p&gt;Permanent - Full Time&lt;/p&gt;\n&lt;p&gt;Salary&lt;/p&gt;\n&lt;p&gt;£45,000 - £47,000 depending on experience&lt;/p&gt;\n&lt;p&gt;Hours&lt;/p&gt;\n&lt;p&gt;37.5 hrs p/wk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Ready for the recognition &lt;em&gt;and rewards you deserve?&lt;/em&gt;&lt;/em&gt;We don’t just talk about putting employees first. We know that Priory wouldn’t exist without their combined energy, expertise and effort. So we invest heavily in training, provide first-class support, promote collaborative teamwork and give everyone on our team the opportunities and resources to achieve their full potential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A driven and dynamic Nurse?&lt;br /&gt; An experienced manager looking to take the next step in your career in healthcare?&lt;br /&gt; Wanting to make a difference to someone’s life?&lt;br /&gt; Ready for a new challenge?&lt;br /&gt; Wanting to work with the best nurses in the UK? If you’ve answered yes to the above then get in touch with our nurse Recruiter Adam O&#39;Shea today on 07834514945. &lt;strong&gt;About the role :&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role :&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Nurse or Health professional to take on the highly exciting role of Director of Clinical Services within our new 34 bedded hospital based in Lickey Hills.&lt;/p&gt;\n&lt;p&gt;The role will providesignificant line management responsibility for our outstanding teams, who in turn deliver exceptional clinical work within our PICU, Acute and Private services.&lt;/p&gt;\n&lt;p&gt;Extensive clinical and management experience is required, including coaching outstanding performance, effective supervision of line managers, succession planning, and managing any areas of underperformance.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have finely tuned decision making skills, delivering excellent results in a highly time sensitive environment.&lt;/p&gt;\n&lt;p&gt;Effective organisational capability, with skill at managing tight deadlines are a must.&lt;/p&gt;\n&lt;p&gt;Excellent interpersonal and communication skills with large teams of Managers.&lt;/p&gt;\n&lt;p&gt;Enthusiastic and motivated with a strong “can do” attitude that replicates your own desire to succeed.&lt;/p&gt;\n&lt;p&gt;A role model to other staff and patients- providing advice and support to promote good practice.&lt;/p&gt;\n&lt;p&gt;Ensuring good, strong and effective governance, and acting as a clinical lead and strong deputy for the Hospital Director in their absence. You must be competent in supporting the Hospital Director in planning for internal and external inspections, whilst keeping the Hospital safe at all times.&lt;/p&gt;\n&lt;p&gt;You will be competent in relationship building, and able to develop stong interpersonal relationships with key referrers and stakeholders.&lt;/p&gt;\n&lt;p&gt;You will encourage team members to expand, develop their own competencies and effective succession planning.&lt;/p&gt;\n&lt;p&gt;There will need to be a strong ability to work under pressure, which essential and this includes time sensitive decisions&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About our service:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Priory Healthcare will be opening a new hospital set in the beautiful surroundings of Lickey Hills, to the south of Birmingham, in late October 2020. The hospital will provide services for both NHS and private patients, with a range of mental health conditions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The service will comprise of 3 wards: a 10-bed adult Psychiatric Intensive Care Unit (for adult men), a 12 bed adult Acute ward and a 12 bed Private Acute ward. The service will take a multi-disciplinary approach to delivering personalised treatment programmes to our in-patients as well as offering a Private Outpatient service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will have the opportunity to play a leading role in starting up this new service, leading a new staff team and extending Priory’s established reputation for delivering the highest standards of care to a new site and broadening Priory’s provision of services in the Birmingham area, alongside it’s well established services at Woodbourne Priory Hospital and the Birmingham Wellbeing Centre.&lt;/p&gt;\n&lt;p&gt;#LI-AO1&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the UK’s leading providers of behavioural care and specialist support services to adults and young people, Priory Group promise a challenging and fulfilling career with the support of a world class organisation willing to invest in your development.&lt;/p&gt;\n&lt;p&gt;Across our network of hospitals, residential care homes, education facilities and supported living services, we are making a real and lasting difference to the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland.We are an equal opportunities employer.Priory Group will cover the cost of a DBS check.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lickey, Birmingham", "postalCode": "B45 8ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3769", "longitude": "-2.00628"}}, "title": "Director of Clinical Services / Modern Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252829", "validThrough": "2020-11-30T23:59:59+0000"}