{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 per annum inclusive of HCAS"}}, "datePosted": "2020-11-04T10:46:24+0000", "description": "&lt;p&gt;The Frimley Integrated Care System is transforming their services for people with Neurological conditions. There is significant investment into these services to support the implementation of the new model. The successful candidate will have the vision to develop the MS role, the integrated pathways and deliver high quality assessment and intervention. Their input will be key to promote self-management of people and support the MDT with a ‘make every contact count’ approach. This new model focuses on a co-ordinated approach to working with people and supporting them to optimally manage their condition. It will involve bringing specialist nurses, AHPs and psychologists working across several organisations together to work as an integrated team.&lt;/p&gt;\n&lt;p&gt;The Neurology Team at Frimley Health NHS Foundation Trust have a long-established commitment in delivering excellence in care to people with multiple sclerosis. An exciting opportunity has arisen for an MS Specialist Nurse or Practitioner (Occupational Therapist or Physiotherapist) to assist in the development and future growth of local services on our Wexham Park site. Although based at Wexham Park, the post holder will be part of the wider MS service which covers all 3 sites to include Wexham Heatherwood and Frimley Park. Part of this role will also be community based covering the Wexham side of the patch.&lt;/p&gt;\n&lt;p&gt;The post holder will be supported by the existing the Consultant Neurologists, MS nursing team and our community MS nursing colleagues based in Heatherwood and Farnham Hospital.&lt;/p&gt;\n&lt;p&gt;Both acute hospital sites (Wexham and Frimley) prescribe the full range of disease modifying therapies (DMT) which we have been offering for many years. MS therapeutics is undergoing significant growth and we are looking to develop our service offering infusion treatments to MS patients at Wexham Park as well as further enhancing our MS clinical care on the Frimley site.&lt;/p&gt;\n&lt;p&gt;Multidisciplinary team (MDT) working is an essential part of this role and building relationships with our community colleagues and those from other NHS Trusts is vital to the development of this new service working within the neurology integrated care service.&lt;/p&gt;\n&lt;p&gt;This is an exciting role for an enthusiastic and forward-thinking individual who has a passion for delivering innovative and first class care.&lt;/p&gt;\n&lt;p&gt;You will need to be working as a MS nurse, occupational therapist or physiotherapist within the neurological field or have some experience of delivering care for people with MS and be an individual who is passionate about patient care. You need to be driven and prepared to ensure the delivery of high quality care at all times. Experience of working jointly with neuropsychology to support people to manage cognitive impairment associated with their neurological disorder would be desirable.&lt;/p&gt;\n&lt;p&gt;You will need to be able to influence people across primary care, community, social care and acute sectors to ensure that people with neurological conditions have responsive, co-ordinated services that are delivered locally.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you are interested in applying for this post you are encouraged to contact Judith Wilton, Lead MS Clinical Nurse Specialist on 07500 129 097 or Clare Nickols, Lead Neurology Team Manager 07966 381841 for an informal discussion. judith.wilton@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Slough", "postalCode": "SL2 4HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5331", "longitude": "-.575106"}}, "title": "Multiple Sclerosis Specialist Nurse or Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255445", "validThrough": "2020-11-12T23:59:59+0000"}