{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-27T16:15:39+0000", "description": "&lt;p&gt;Senior Paediatric Major Trauma Rehab Coordinator&lt;/p&gt;\n&lt;p&gt;Band 7&lt;/p&gt;\n&lt;p&gt;37.5 hours (we would consider applicants who wish to work fewer hours)&lt;/p&gt;\n&lt;p&gt;Alder Hey Children’s Hospital (AHCH) is a designated Major Trauma Centre for the North West Region in partnership with The Royal Manchester Children’s Hospital. An exciting opportunity has arisen for an experienced candidate with a trauma background to join the Major Trauma Service.&lt;/p&gt;\n&lt;p&gt;Children and young people who sustain major trauma injuries require highly skilled and co-ordinated care from the scene of the accident through to acute care, expert acute rehabilitation and ongoing holistic community rehabilitation.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join an excellent, forward thinking team who are strongly committed to evidence based practice, patient focused service improvement and continuing personal and professional development.&lt;/p&gt;\n&lt;p&gt;The role will encompass the full set of responsibilities as set out in the accompanying job description but in summary the key responsibilities are:&lt;/p&gt;\n&lt;p&gt;1. Establish effective multi-professional communication networks and strategies within the Major Trauma Centre and externally with multi agencies across health, education and social care.&lt;/p&gt;\n&lt;p&gt;2. Review the planning, workload allocation, delivery and evaluation of rehabilitation programmes for major trauma patients.&lt;/p&gt;\n&lt;p&gt;3. Appreciate the changing levels of medical and therapy care and support required by children and young people during the rehabilitation process and ensuring a coordinated and flexible needs-led approach between professional disciplines with regards to timing, intensity and duration of treatment.&lt;/p&gt;\n&lt;p&gt;4. Ensure effective and seamless communication throughout the patient’s journey including paediatric emergency department, wards, theatres and critical care staff, to support the admission and planning of care.&lt;/p&gt;\n&lt;p&gt;5. Participate in the 7-day working roster to ensure equality in service provision to all major trauma patients with robust handover between shifts.&lt;/p&gt;\n&lt;p&gt;6. Participate actively in Major Trauma related committee meetings.&lt;/p&gt;\n&lt;p&gt;7. Attend and contribute directly to the weekly individual specialty meetings, Trauma Hospital Overarching (HOT) meeting and Trauma Rehabilitation MDT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Matthew.upton@alderhey.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120727.jpg", "name": "Alder Hey Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120727"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L12 2AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4213", "longitude": "-2.8978"}}, "title": "Senior Paediatric Major Trauma Rehabilitation Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245370", "validThrough": "2020-11-10T23:59:59+0000"}