{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-14T11:47:04+0100", "description": "&lt;p&gt;&lt;span&gt;The Abdominal Aortic Aneurysm (AAA) Screening Programme is looking to recruit an enthusiastic individual to join our dedicated screening team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As an administrator, you will use your existing knowledge and training to provide a full and comprehensive administrative service for the AAA Screening multi-disciplinary team and assist the programme manager with the operational delivery of the programme.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Being highly motivated and organised you will be able to work unsupervised to meet established deadlines and deputise, with support, in the absence of the programme manager. The opportunity to lead on projects to address health inequalities and improve service delivery is available for the right candidate.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;GCSE’s in grade c or above in Maths and English (or equivalent), good written and verbal communication skills, an ability to communicate well with the general public and develop good working relationships with colleagues of all disciplines and grades within and outside the organisation are essential to the role. Accuracy and attention to detail, a good concentration span and the ability to work under pressure are vital.  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role involves the use of multiple hospital computer databases and applications for sending AAA appointment and results letters, booking clinics, viewing patient history, dealing with queries and compiling and analysing data. You will also develop and maintain spreadsheets for tracking own work and patient pathways so a high level of computer literacy is required. You will train new/junior staff in your area of expertise and will use your initiative to identify areas of development and improvement within your role and the wider screening programme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant will be based at Worcester Royal Hospital and will work Monday to Friday 8am until 4pm (37.5 hours per week). However, the applicant may be required, on occasion, to support the AAA screening team by working outside of these hours, travelling to different sites across Herefordshire and Worcestershire and transporting heavy portable ultrasound equipment to clinic. A full driving licence, access to a car and business insurance will be required. Worcester Royal Hospital provides a free park and ride service for staff and an occasional parking permit is available at a subsidised cost.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a small, friendly team of 5 who work together and celebrate together. We pride ourselves on delivering a safe and effective, lifesaving screening programme to men aged 65 years and over. We listen, we learn, we lead and we support each other. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to join our AAA team in the beautiful counties of Herefordshire and Worcestershire then please read the job description and person specification and apply online. &lt;strong&gt;Informal enquiries please contact Rachel Mitchell, AAA Screening Programme Manager on 01905 733830 or Rachel.mitchell9@nhs.net&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire Royal Hospital", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "AAA Screening Programme Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226069", "validThrough": "2020-11-11T23:59:59+0000"}