{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per anum"}}, "datePosted": "2020-10-23T10:31:53+0100", "description": "&lt;p&gt;Exciting opportunity to join the Allergy Service based at Wythenshawe Hospital, Manchester.&lt;/p&gt;\n&lt;p&gt;The Manchester University NHS Foundation Trust Allergy Centre was set up by Professor Adnan Custovic and Professor Angela Simpson in January 2004. Dr Susana Marinho was recruited to the allergy team in 2009 and the service became fronted by a dedicated full-time NHS Consultant Allergist. The service has since expanded considerably, has recruited in the last two years, 2 full time Consultants in Allergy.&lt;/p&gt;\n&lt;p&gt;The Allergy Centre at Wythenshawe Hospital has moved into purposefully refurbished facilities in a self-contained unit in 2017, which have significantly increased the ability of the service to deliver both clinical and research services.&lt;/p&gt;\n&lt;p&gt;The Allergy Centre provides comprehensive allergy care for adults, offering a holistic approach to the diagnosis and management of the full spectrum of allergic disorders. It also has close links with the Paediatrics Service, providing the same range of comprehensive allergy care to children. We perform diagnostic skin, &lt;em&gt;in-vitro&lt;/em&gt; and challenge tests (to foods, drugs, bee/wasp venoms, latex); offer desensitisation (allergen specific immunotherapy) for bee and wasp venom allergy, inhalant allergy (rhinoconjunctivitis) to allergens such as pollen, mites, cat, etc., and offer desensitisation to drugs (e.g. aspirin); desensitisation to foods is a service currently being developed. The centre has several weekly outpatient clinic sessions, sessions for allergen specific immunotherapy, drug allergy investigation service and day case challenge sessions.&lt;/p&gt;\n&lt;p&gt;The Allergy Centre is an integrated clinical and research unit with an active research programme, ensuring that patients have access to the latest advances in the diagnosis and treatment of allergic diseases.&lt;/p&gt;\n&lt;p&gt;If this sounds exciting to you please come and join our expanding team to support our vision of continuing to provide excellent clinical services, as well as supporting the active research portfolio of Allergy.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSusana MarinhoJob titleConsultant AllergistEmail addresssusana.marinho@mft.nhs.ukTelephone number0191 291 4055&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Hospital, Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Locum Consultant Allergy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240062", "validThrough": "2020-11-08T23:59:59+0000"}