{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 PA inc. HCAS"}}, "datePosted": "2020-11-05T17:45:23+0000", "description": "&lt;p&gt;Hi! My name is Karen and I am the Locality Manager for the Hertsmere Integrated Community Team. I have worked for community services for many years, and I know what a difference we make to our patients. I am exceptionally proud of the work that my team does every single day, visiting people in their own homes to support them when they are at their most vulnerable. I am recruiting new nurses to the team, and would love to hear from you. This role is ideal for a newly qualified nurse, someone returning to practice after a break, someone new to community work, or someone with plenty of community experience but who just fancies a change of scene.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you join us you can expect a solid induction where we will be helping you settle into the team and find your feet. You will be part of a committed and hard-working team who really look out for each other. You will have the opportunity to influence the development of the service, as we work towards new community pathways focussed on providing more care away from hospital. And you will be regularly told by your patients and their families how much they value your care and professionalism.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Community nursing provides a diverse range of clinical tasks to patients in their own homes and in residential care homes. This includes wound care, catheter care, bowel management, end of life care, medication administration including insulin and IV Antibiotics, leg ulcer care, the list goes on. If you have a special interest in one of these fields we would want to support your learning and development so that you can become our champion for that patient group. The service operates every day between 8am and 10pm and as such we are able to accommodate a whole range of working patterns and shift times. I am happy to discuss your availability and preferences.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;One of my colleagues in the Hertsmere team is Jenny. She has been a community nurse for nine years and is one of our Band 7 DN Team Leads. It has been really good to see her development over the years. While working in the community, Jenny has completed the Specialist Practitioner in District Nursing qualification, and she is currently studying for the nurse prescribing qualification. She says:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“&lt;/em&gt;&lt;em&gt;Community employers really value their staff and take the time to grow them. This is reflected in the values of our academy at CLCH, and there are many career pathways you can follow in the community, including specialist nursing, complex case management and operational management of a team. I have worked in Hertsmere since April 2019, and it is a welcoming, friendly place to work where the team nurture and support each other. There is a culture of continuous improvement and the drive to deliver the best possible care to patients among all staff. Community Nursing is a growing sector, expected to care for increasingly complex patients, which can be challenging. But the rewards of Community Nursing are unique - you are an autonomous practitioner who is invited into the innermost aspects of people&#39;s lives to see them through some of their most challenging times. I see my role as a privilege and it has afforded me opportunities that I would not have had elsewhere. I would encourage anyone to apply to work with us - no day is the same, you will be well supported by strong managers and a positive, friendly, close knit team to grow and progress.”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are based at Potters Bar Community Hospital, just off the M25 at Junction 24.&lt;/p&gt;\n&lt;p&gt;Do get in touch if you would like to find out more about me and the team.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Herts Planned Care Nursing  - Hertsmere, Hertfordshire", "postalCode": "HP2 7YU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7648", "longitude": "-.430964"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258739", "validThrough": "2020-11-19T23:59:59+0000"}