{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-04T11:16:05+0000", "description": "&lt;p&gt;Following our exciting announcement of a multi-million pound government investment to develop the Northern Lincolnshire and Goole NHS Foundation Trust estate, we now require a Capital Project Manager with extensive experience of the built environment, to be part of the Capital Project Team.&lt;/p&gt;\n&lt;p&gt;As Capital Project Manager you will take ownership of and successfully deliver allocated capital, maintenance and infrastructure projects which will involve supporting business case preparation, engaging with supply chains, managing internal and external resources and liaising with external design teams and internal clinical stakeholders. You will also be responsible for ensuring compliance with all relevant legislation, technical standards and regulations (including HTM, HBN, Building Regulations. and CDM regulations).&lt;/p&gt;\n&lt;p&gt;Drawing on your experience of managing capital schemes and working with and reviewing construction drawings and specifications, you will be responsible for the planning and scheduling of works, monitoring and reporting on progress, and providing technical advice / support to all staff within the Estates and Facilities Directorate including providing problem-solving solutions and decision-making in relation to complex projects.&lt;/p&gt;\n&lt;p&gt;Candidates must have demonstrable knowledge of project management with a track record of delivering successful major projects. It would be advantageous to have carried out healthcare projects following NHS guidelines and relevant legislation, and be conversant with modern construction and contract methods and requirements.&lt;/p&gt;\n&lt;p&gt;If you are highly motivated and are looking for a rewarding career move where you can put your project management skills to use in a forward thinking team then we want to hear from you!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Chris Conroy, Senior Project Manager&lt;/p&gt;\n&lt;p&gt;chris.conroy@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grimsby", "postalCode": "DN33 2BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5449", "longitude": "-.096217"}}, "title": "Capital Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255563", "validThrough": "2020-11-18T23:59:59+0000"}