{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T14:31:10+0000", "description": "&lt;p&gt;Are you a data analyst who has worked in public health or a related area? Would you like to join an innovative team exploring new ways to produce and communicate meaningful information about the health of Wales to our varied stakeholders? Would you like to contribute to Public Health Wales’ response to the Covid-19 pandemic through the provision of analysis and insight?&lt;/p&gt;\n&lt;p&gt;Here in the Public Health Wales Observatory Analytical Team we are proud of our reputation for combining analytical skills with an in-depth understanding of public health. We can offer you a great place to work with training and development opportunities, flexible working and a supportive, friendly and inclusive environment.&lt;/p&gt;\n&lt;p&gt;The &lt;strong&gt;Public Health Wales Observatory&lt;/strong&gt; is part of the Public Health Wales NHS Trust, with staff skilled in public health data analysis, evidence finding and knowledge management. The Observatory assists local and national partners by providing meaningful information to address public health issues, improve health and health services, and reduce health inequalities.&lt;/p&gt;\n&lt;p&gt;The work of the Observatory Analytical Team is interesting and varied. Working with other team members you will be responsible for helping to provide a local public health intelligence service to one of the Health Boards in Wales. You will also have a key role in leading and contributing to all-Wales health intelligence products.&lt;/p&gt;\n&lt;p&gt;The base for this post is our Preswylfa office in Mold, Flintshire which is easily accessible from Chester, Liverpool and the North West of England. However, due to the Covid-19 pandemic, all analysts within the Observatory are currently being asked to work from home. Consequently, interviews for this post will be held remotely via Microsoft Teams.&lt;/p&gt;\n&lt;p&gt;For further details or to arrange an informal discussion please contact Mari Jones, Advanced Public Health Intelligence Analyst (mariann.jones2@wales.nhs.uk).&lt;/p&gt;\n&lt;p&gt;Please note that this post may close early if in receipt of a large number of applications. If you are interested in this post and wish to be considered, we advise you to complete and submit your application as soon as possible.&lt;/p&gt;\n&lt;p&gt;Closing date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;Interview date: 7th December 2020 (via Microsoft Teams)&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMari JonesJob titleAdvanced Public Health Intelligence AnalystEmail addressmariann.jones2@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124752.jpg", "name": "Public Health Wales NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124752"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preswylfa, Mold", "postalCode": "CH7 1PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1637", "longitude": "-3.15051"}}, "title": "Public Health Intelligence Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246989", "validThrough": "2020-11-08T23:59:59+0000"}