{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa, pro rata"}}, "datePosted": "2020-11-04T11:46:03+0000", "description": "&lt;p&gt;This is an exciting opportunity for a committed individuals to join the children&#39;s Speech and Language Therapy service working across Derby City and Southern Derbyshire , as part of Derbyshire Community Health Services. Based in Derby City and Swadlincote.&lt;/p&gt;\n&lt;p&gt;We are a large and dynamic Speech and Language Therapy service of around 100 staff working across all service areas in Derbyshire. As a member of our team you will be working in a service with a well established reputation for delivering a patient centred approach.&lt;/p&gt;\n&lt;p&gt;The post (22.5 hours per week) will provide support to children with speech, language and communication needs who also use Alternative and Augmented Communication (AAc). The post holders will be delivering programmes of intervention to children in early years settings, schools, patient homes and through telehealth.&lt;/p&gt;\n&lt;p&gt;You will be supervised by SLTs, with support from a Team Leader as well as peer support from colleagues at Band 5, 6 and 7.&lt;/p&gt;\n&lt;p&gt;If you can demonstrate good communication skills, have the ability to deliver competent, evidence based clinical care we want to hear from you.&lt;/p&gt;\n&lt;p&gt;As a clinical employee it will be your responsibility to ensure that your behaviour and values reflect those set out in the DCHS Way.&lt;/p&gt;\n&lt;p&gt;Previous experience of working with children is needed and in addition:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Part time post of 22.5 hours, this can be worked flexibly (in terms of daily hours and days worked) and will be decided with the successful candidate&lt;/li&gt;\n&lt;li&gt;Experience of working with children who have speech, language and communication needs is essential&lt;/li&gt;\n&lt;li&gt;Experience of low tech AAc and an awareness of IT and/or Hi tech AAc is essential&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jenny Fainberg&lt;/p&gt;\n&lt;p&gt;Speech and Language therapy team leader&lt;/p&gt;\n&lt;p&gt;jennyfainberg@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07824 857666&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Lisa Salton, 07500 605506&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124692.jpg", "name": "Derbyshire Community Health Services NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124692"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Derby and derbyshire, Derby", "postalCode": "DE24 8NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8935", "longitude": "-1.44406"}}, "title": "Children&#39;s Speech and Language Practitioner AAC", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255662", "validThrough": "2020-11-18T23:59:59+0000"}