{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "36000", "unitText": "YEAR", "value": "£36,000 - £38,000 With £5,000 Welcome Bonus"}}, "datePosted": "2020-10-14T11:46:15+0100", "description": "&lt;p&gt;We are recruiting for enthusiastic and highly skilled individuals to join a new inpatient hospital team for Adults with Eating Disorders in High Wycombe .&lt;/p&gt;\n&lt;p&gt;We offer a warm and nurturing environment where people receive intensive treatment for eating disorders including severe and enduring anorexia nervosa. There are also a number of places for patients with complex needs. We work together to achieve the best possible outcomes and quality of life for everyone in our care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Together we will reflect on, explore and understand the patient’s needs, helping them to develop the skills to build a new positive outlook, confidence and skills for a positive future. We will work through the process of creating a personal identity outside of their eating disorder as well as helping to build social networks within the community.&lt;/p&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits including:&lt;/p&gt;\n&lt;p&gt;Competitive salary&lt;br /&gt; 25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;br /&gt; Extra Service Annual leave awards&lt;br /&gt; Career development – progress across the Staff Nurse grading is via a distinct career path&lt;br /&gt; A contributory pension scheme&lt;br /&gt; An employee assistance programme&lt;br /&gt; Highly subsidised meals&lt;br /&gt; Free car parking&lt;br /&gt; NMC Payment in full&lt;br /&gt; Sign on bonus - £5000 Welcome to Priory&lt;br /&gt; Either a sign on bonus or an e-voucher code for the Priory Benefits portal to be redeemed on various items including discounted shopping, red letter days, gym membership etc&lt;br /&gt; Relocation support (including payment for accommodation or moving costs), paid as a lump sum&lt;/p&gt;\n&lt;p&gt;Moving less than 100 miles up to £2,000&lt;br /&gt; If more than 100 miles up to £4,000&lt;br /&gt; To be repaid if individual does not complete probation &amp; leaves&lt;/p&gt;\n&lt;p&gt;Payment into the pension scheme&lt;br /&gt; CPD top up&lt;br /&gt; Donation to a charity of their choice&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "High Wycombe", "postalCode": "HP12 4QF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6135", "longitude": "-.792469"}}, "title": "Deputy Ward Manager With £5,000 Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226047", "validThrough": "2020-11-13T23:59:59+0000"}