{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 to £32,146 PA inc HCAS"}}, "datePosted": "2020-11-05T14:01:15+0000", "description": "&lt;p&gt;Central London Community Healthcare NHS Trust became responsible for delivering West Hertfordshire Community Adult Services from October 2019?&lt;/p&gt;\n&lt;p&gt;It is an exciting time to join the team in West Herts and we are seeking enthusiastic and skilled colleagues to join us as we build on existing models of care and introduce new ways of working. Our transformation plans over the next 12 months will include further integration with primary care, planned and unplanned care models and a greater emphasis on population health. We are expanding the existing workforce by recruiting to the current service portfolio and to the new teams.&lt;/p&gt;\n&lt;p&gt;Would you like to be at the forefront of delivering new models of care through transformation that meets the needs of the population?&lt;br /&gt;&lt;br /&gt;Would you like to work with a Senior Management Team who will support and develop you?&lt;br /&gt;&lt;br /&gt;If you can answer yes to the above then we may just have the job for you!&lt;/p&gt;\n&lt;p&gt;We are looking for nurses who are passionate about delivering high quality and efficient adult community services, giving the best care to patients in our Inpatient Unit based in Potters Bar Community Hospital.&lt;/p&gt;\n&lt;p&gt;Our vision is to ensure that our patients are provided with an excellent experience and an excellent standard of care. We are a caring, dedicated and progressive, multi-disciplinary team whose focus is to support patients to regain function, confidence, self-respect and much more.&lt;/p&gt;\n&lt;p&gt;You will need to display excellent communication skills and offer care in a kind and compassionate manner. You will be dynamic, innovative and hardworking and have excellent written and verbal communication skills. We can offer you the opportunity to develop your nursing and management skills as well as supporting you to develop your leadership style and skills that will support you throughout your career.&lt;/p&gt;\n&lt;p&gt;You can also look forward to an award-winning training and development, excellent benefits including assistance with transport, child care, parking and comprehensive pension and health care schemes&lt;/p&gt;\n&lt;p&gt;We strongly encourage applications from all sections of the community including: disabled people, those from black and minority ethnic backgrounds and lesbian, gay, bisexual and transgender people.&lt;/p&gt;\n&lt;p&gt;If you are ready to join our team then we are waiting to receive your application!&lt;/p&gt;\n&lt;p&gt;These are full time position of 37.5 hours a week.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Herts Potters Bar Unit, Hertfordshire", "postalCode": "EN6 2RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6872", "longitude": "-.177495"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258020", "validThrough": "2020-11-19T23:59:59+0000"}