{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-03T10:31:30+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within the IT Operations team for a motivated and enthusiastic IT Technician to join the team of staff in the maintaining the IT estate, providing first, second and third line support to all Trust users of IT.&lt;/p&gt;\n&lt;p&gt;The post holder will work as part of the Trust’s IT Technical Support Team to maintain and repair the Trust’s IT desktop and server equipment, associated hardware &amp; software. This will include; IT Service Desk calls in relation to faults, SMS remote software, Microsoft applications, clinical applications, all types of peripherals, and involvement in Server Operations support.&lt;/p&gt;\n&lt;p&gt;The successful applicant should have a flexible approach to their duties, the ability to work as part of a team and have sufficient confidence and skills to work independently. Proven skills and knowledge of various IT systems, software and applications including, Active Directory, Microsoft windows operating systems Microsoft Office, Microsoft SCCM, comprehensive working knowledge of PC, Laptop &amp; hardware configuration is essential.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be educated to Degree level or an equivalent professional qualification in a computer related discipline or extensive work experience in similar role, excellent problem solving and communication skills are essential, must have proven IT desktop experience in a corporate IT environment, be confident dealing with internal and external suppliers and be willing to be part of an out of hour’s rota.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to travel cross-site as required to support all community sites – a full car driving licence is essential to this role.&lt;/p&gt;\n&lt;p&gt;For further detailed information about the role or the person specification, please refer to the Job Description.&lt;/p&gt;\n&lt;p&gt;Please ensure that you clearly demonstrate how you fulfill the criteria for the role on your application form.&lt;/p&gt;\n&lt;p&gt;*Please note that the IT Operations Department is currently going though a departmental review which means that this position could change as part of that review.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sam Sedgman, IT Specialist Technical Engineer&lt;/p&gt;\n&lt;p&gt;samsedgman@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Rebecca Fawcett, IT Specialist Technical Engineer&lt;/p&gt;\n&lt;p&gt;rebecca.fawcett@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grimsby", "postalCode": "DN333BA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5335", "longitude": "-.106053"}}, "title": "IT Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253466", "validThrough": "2020-11-17T23:59:59+0000"}