{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata"}}, "datePosted": "2020-10-26T15:19:08+0000", "description": "&lt;p&gt;We have an exciting and new opportunity for a Band 6 Rheumatology and Pain Nurse to join the team at Defence Medical Rehabilitation Centre, Stanford Hall, Loughborough.&lt;/p&gt;\n&lt;p&gt;The position is part time offering 30 hours per week. Your working hours will be 08:00 - 16:00 four days a week.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be one of our Senior Clinical Nurses within the rehabilitation team and will be expected to carry out advanced nursing within this area of practice.&lt;/p&gt;\n&lt;p&gt;You will have responsibility for managing the practice within your professional accountability for assessment of care needs and you will provide a range of clinical and management services for patients with rheumatology related needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties of the role include but are not limited to:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working unsupervised providing appropriate standards of nursing care.&lt;/li&gt;\n&lt;li&gt;Managing and carrying out specialist care programmes directly to patients to meet their nursing care needs in accordance with evidence-based practice.&lt;/li&gt;\n&lt;li&gt;Responsibility for training, developing and supervising other team members and being involved in the recruitment of staff.&lt;/li&gt;\n&lt;li&gt;Developing specialist/complex plans to meet the health needs of patients including diagnostic tests; treatment plans, health promotion and prevention.&lt;/li&gt;\n&lt;li&gt;Monitoring and evaluating the rheumatology service within the DMRC, maintaining consistency of professional standards through audit and clinical governance and the application of risk management systems.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate must hold the following:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered nurse with live registration with NMC&lt;/li&gt;\n&lt;li&gt;Professional knowledge acquired through degree/diploma supplemented by specialist level training, experience, post registration qualification in Rheumatology&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;It is desirable for the successful candidate to be IT competent and hold a Standards to support Learning and Assessment in Practice (SLAiP) or Mentorship Qualification.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following Technical Skills &amp; Behaviours.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Core – NHSC5 – Quality&lt;/li&gt;\n&lt;li&gt;NHS Core – NHSC2 – Personal &amp; People Development&lt;/li&gt;\n&lt;li&gt;Changing and Improving&lt;/li&gt;\n&lt;li&gt;Leadership&lt;/li&gt;\n&lt;li&gt;Working Together&lt;/li&gt;\n&lt;li&gt;Communicating and Influencing&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel, but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it in PDF format using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Defence Medical Rehabilitation Centre, Stanford Hall, Stanford on Soar, Loughborough, LE12 5BL", "postalCode": "LE12 5BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7931", "longitude": "-1.25541"}}, "title": "Band 6 Rheumatology and Pain Nurse (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243119", "validThrough": "2020-11-25T23:59:59+0000"}