{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-10-29T15:16:20+0000", "description": "&lt;p&gt;Experienced Dialysis Assistants required to work the Altrincham Dialysis Unit.&lt;br /&gt;&lt;br /&gt;At Manchester University NHS Foundation Trust, our Dialysis Assistants take great pride in the essential work they do. That’s because we’re not just helping patients, we’re going the extra mile for them – day in, day out. But more than that, our team’s commitment to work with empathy, consideration and dignity means that we’re among the best – and most compassionate – in our field. This translates to a work environment that’s bright and friendly, fast paced and innovative.&lt;br /&gt;&lt;br /&gt;Right now, we’re looking for dedicated, efficient but above all; hugely caring and aspiring Dialysis Assistants to join our teams. The Dialysis Assistants are at the heart of each unit and as such you will form a vital part of the team at the forefront of delivering haemodialysis treatment to our patients. You will do this by communicating effectively and with compassion and assisting them with their personal needs and mobility, supporting with eating and drinking and recording observations. &lt;br /&gt;&lt;br /&gt;You will &lt;span&gt;&lt;strong&gt;need&lt;/strong&gt;&lt;/span&gt; to have:&lt;/p&gt;\n&lt;p&gt;• An NVQ or apprenticeship Level 2 in Adult Health Care&lt;/p&gt;\n&lt;p&gt;• Excellent communication and listening skills&lt;br /&gt;• A friendly, open, empathetic and compassionate communication style&lt;br /&gt;• A strong ability to engage with patients, visitors and colleagues&lt;br /&gt;• The ability to work well in a team&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be required to complete a dialysis training competency package which, when competent will enable you to support the patient by being involved in initiating, monitoring and completing dialysis treatment. We will support all successful candidates to complete the Haemodialysis Foundation Competencies whilst being paid as a Band 2 Trainee Dialysis Assistant and once these are achieved (which may take up to 6 months) you will then be paid as a Band 3 Dialysis Assistant. &lt;br /&gt;&lt;br /&gt;In return for all your hard work we can offer you a great opportunity to care for a cross section of some of Greater Manchester’s most complex patients, supporting their various needs and developing your skills and experience in abundance. In essence, we want to offer you the chance of working with our fantastic dialysis team to leave work each day with the satisfaction in knowing you’ve done a great job in delivering an outstanding patient experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJane RedshawJob titleWard ManagerEmail addressjane.redshaw@mft.nhs.ukTelephone number0161 413 7767Additional contact information&lt;/p&gt;\n&lt;p&gt;Emily Raybould - Matron - Emily.Raybould@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Altrincham Renal Dialysis Unit, Manchester", "postalCode": "WA14 2RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3849", "longitude": "-2.35154"}}, "title": "Trainee/Dialysis Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248837", "validThrough": "2020-11-12T23:59:59+0000"}