{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T19:00:21+0000", "description": "&lt;p&gt;We are looking for an ambitious, dynamic, motivated and enthusiastic Band 6 Occupational Therapist to join our team in Shefford, Mid Bedfordshire. This friendly proactive team delivers responsive high quality therapy to patients in their own homes, residential homes or within the rehabilitation beds. We are passionate about patient centered care, support our therapists to lead and deliver excellent and compassionate therapy and value our clinical teams as the real heart of the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Trust is known for offering excellent training, personal development programmes, supportive coaching and competency frameworks; all to support enhanced skills and career development which meet the goals and aspirations of the individual. If you would like a career which brings a new challenge every day, gives you the opportunity to test your ability to think quickly, solve problems, assess and treat patients, then the Rehabilitation and Enablement Team could be the team for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Experience in the field of adult therapy services is desirable but a willingness to learn and contribute is more important. The Therapy Team operates between 08.00 to 21.00 hours and successful candidates will work either an early or late shifts including weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Access to a car in order to carry out service duties is essential.&lt;/p&gt;\n&lt;p&gt;Position: Full time, although part time hours will be considered at a minimum of 22.5 hours.&lt;/p&gt;\n&lt;p&gt;Location: Shefford&lt;/p&gt;\n&lt;p&gt;For further information, or if you would like to arrange a visit prior to interview, please contact: Ellie Gillett on 07580835754&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BEDFORD", "postalCode": "SG17 5FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0346", "longitude": "-.326277"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251104", "validThrough": "2020-11-22T23:59:59+0000"}