{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "Band 6 (£31,365-£37,890)"}}, "datePosted": "2020-11-03T14:45:35+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you looking for a new challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We currently have the following exciting opportunity for an Assistant HR Business Partner within Viaduct Care. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Details for the post as follows:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Band: Band 6&lt;/li&gt;\n&lt;li&gt;Hours: Full-Time 37.5 hours per week (Mon – Fri)&lt;/li&gt;\n&lt;li&gt;Tenure: 12 Month Fixed-Term Contract&lt;/li&gt;\n&lt;li&gt;Base: Kingsgate House, Stockport / Home-Working&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Viaduct Care is the GP Federation and is a partnership of all GP practices across Stockport.&lt;/strong&gt; The federation was formed to empower local GPs to provide the best possible care for patients whilst tackling some of the challenges faced by General Practice by helping doctors and other healthcare professionals work together, share resources and expertise.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our vision is to be consistently recognised for enabling the delivery of high quality patient centred healthcare, which is innovative, equitable, efficient, effective and contributing to a healthy population in Stockport.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently looking for an Assistant HR Business Partner to join our team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As Assistant HR Business Partner, you will support the delivery of a comprehensive Human Resources and Organisational Development function, providing a high level, proactive and professional expert HR&amp;OD advisory service, including:-&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Advise on HR policies and procedure including the provision of expert advice and guidance on aspects of employment law ensuring legal compliance and best practice&lt;/li&gt;\n&lt;li&gt;Interpretation and application of terms and conditions.&lt;/li&gt;\n&lt;li&gt;Coaching and enabling managers to understand their duties and to make informed decisions on HR issues.&lt;/li&gt;\n&lt;li&gt;Supporting the development and delivery of education, training and development activities and plans for staff and managers across the organisation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Working with the Head of HR&amp;OD you will lead on a number of projects across the organisation whilst working in partnership with managers to deliver and implement people solutions, service redesign, organisational development, performance, development and education and training initiatives.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As Assistant HR Business Partner, you will hold generalist HR expertise, with a strong interest in organisational development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion, please contact via.viaductcarehr@nhs.net and a member of the team will contact you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The closing date for application will be Tuesday 17th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Viaduct Care CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockport", "postalCode": "SK4 1LW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4125", "longitude": "-2.16596"}}, "title": "Assistant HR Business Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254380", "validThrough": "2020-11-17T23:59:59+0000"}