{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £21,142 p.a."}}, "datePosted": "2020-10-23T12:06:15+0100", "description": "&lt;p&gt;An exciting opportunity has arisen within the Mental Health Community Teams for a Team Administrator. This role will be based at St Mary’s Community Health Campus. The A2i (Assessment to Intervention) Team are the front door to the Adult Mental Health Services.&lt;/p&gt;\n&lt;p&gt;Solent’s NHS Trust vision is to provide great care be a great place to work and deliver great value for money and this role supports the teams with providing a comprehensive, efficient and effective Administration role to the team, focusing on clinical and patient orientated support. The successful candidate will work closely with the Administrator for the Crisis Teams, covering when appropriate.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to have excellent administration experience to produce quality reports, assessments, presentations, and spread sheets, supporting health roster input and ensuring quality standards are met.&lt;/p&gt;\n&lt;p&gt;The post holder will have excellent communication and interpersonal skills and will need to be well organised, flexible and have the ability to work well under pressure, with excellent time management. Experience in a similar role would be an advantage although a full training package will be provided.&lt;/p&gt;\n&lt;p&gt;All shortlisted candidates will be asked to complete an Excel test. Please ensure your correct email address is included on your application.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have either completed a Level 3 diploma in Business Administration (previously known as NVQ) or be willing to complete the apprenticeship to gain this qualification. If the candidate does not have the qualification, they will start the position as a band 2 agenda for change and once agreed competencies have been met they will develop on to band 3.&lt;/p&gt;\n&lt;p&gt;If you are interested and would like to talk to someone about the post please call Joanne Medway, Admin Supervisor on 0300 123 3921 or email joanne.medway@solent.nhs.uk.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Please note that should this post attract sufficient interest; we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;/span&gt;&lt;strong&gt; If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;&lt;span&gt; Interviews will take place on 17/11/20 (subject to change)you will be contacted within 1 week of the advert closing; therefore you should check your emails regularly including junk mail folders.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO3 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8004", "longitude": "-1.06359"}}, "title": "Team Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240446", "validThrough": "2020-11-06T23:59:59+0000"}