{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-11-03T08:30:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Plain film Millennium Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;30 Hrs per week Mon – Fri 1pm-7pm.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;St Helens and Knowsley Teaching Hospitals is a busy acute trust situated 8 miles from Liverpool city centre, which is committed to delivering the highest quality patient care. It consists of two hospital sites – Whiston and St Helens Hospitals and three community based departments, including the Millennium Centre in St Helens town centre.&lt;/p&gt;\n&lt;p&gt;The Radiology Department at St Helens and Knowsley performed over 310,000 examinations last year, providing a high quality imaging service using the latest technology.&lt;/p&gt;\n&lt;p&gt;We are a family friendly department looking for a highly motivated and enthusiastic radiographer to join the team. This post will be based at the Millennium Centre, providing services to the minor injuries department and GP patients. The equipment is a GE Proteus room combined with a GE flashpad DR detector.&lt;/p&gt;\n&lt;p&gt;Candidates must be able to demonstrate previous experience in plain film, including Accident and Emergency imaging. The hours of work will be 1.00pm -7.00 pm Monday-Friday. The role will also include some weekend and bank holiday commitment on a rota providing cover 9am-5pm.&lt;/p&gt;\n&lt;p&gt;The department is extremely proactive and continually aims to improve its service to patients. Radiographers are actively encouraged to take part in clinical governance, audit, training and clinical professional development. The Trust has successfully achieved QSI accreditation. We provide opportunities to develop in all areas of radiography and currently have radiographers undertaking post graduate study in radiographic reporting, CT, MR and Nuclear medicine.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;This vacancy may close early if a significant amount of applicants have applied&lt;/strong&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;St Helens &amp; Knowsley Teaching Hospitals NHS Trust is the BEST acute Trusts in England for the THIRD year running!&lt;/p&gt;\n&lt;p&gt;The Trust is currently the only acute Trust in Cheshire and Merseyside, and is one of few in the entire country, to achieve the title of OUTSTANDING, rated by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;We provide a full range of acute adult services to our local population of circa 350,000 and provide tertiary services across a much wider area in the North West, North Wales and Isle of Man. We are also a Major Trauma Unit and the Mersey Regional Burns Unit.&lt;/p&gt;\n&lt;p&gt;Our &#39;5 Star Patient Care&#39; strategy is at the heart of all that we do; supporting our vision to provide world class services for all our patients by getting it right for every patient, every time.&lt;/p&gt;\n&lt;p&gt;Our latest achievements include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute Trust of the Year – HSJ Awards November 2019&lt;/li&gt;\n&lt;li&gt;Trust rates Outstanding by the CQC – March 2019&lt;/li&gt;\n&lt;li&gt;Best in the NHS, Patient Led Assessment of the Care Environment 2017 and 2018&lt;/li&gt;\n&lt;li&gt;The Trust achieved top marks in the country for areas including; cleanliness, food, privacy and dignity, facilities for patients living with dementia and disabilities, conditions, appearance and maintenance of the hospital buildings.&lt;/li&gt;\n&lt;li&gt;Top 100 places to work in the NHS (NHS Employers and Health Service Journal)&lt;/li&gt;\n&lt;li&gt;Best acute Trust in England (NHS Staff Survey 2017,2018 and 2019)&lt;/li&gt;\n&lt;li&gt;Best Patient Experience in the NHS (CHKS Top Hospitals Awards 2015)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In the NHS Staff Survey 2019 the Trust scored the highest marks in the following areas;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Best place to receive treatment in the NHS (for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Top Acute Trust for treating its staff fairly with regards to career progression (for 3rd year running)&lt;/li&gt;\n&lt;li&gt;Quality of care (best score for 5th year running)&lt;/li&gt;\n&lt;li&gt;Staff engagement (best score for 4th year running)&lt;/li&gt;\n&lt;li&gt;Staff morale (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Bullying and harassment (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Safety culture (best score for 2nd year running)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our staff rated our Trust as the best place to work and receive treatment. The Trust has also been recognised, for the third year running, as being the top acute Trust in the entire country for staff engagement, staff motivation, and pride in the quality of care we provide to patients.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Fiona Heyes Clinical Professional Manager –Plain film services&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Tel: 0151 430 1929&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Sue Haunch Clinical Professional Manager – Interventional and fluoroscopy services&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Tel: 0151 430 1929&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121089.jpg", "name": "St Helens and Knowsley Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121089"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whiston", "postalCode": "L35 5DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4201", "longitude": "-2.78641"}}, "title": "Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253157", "validThrough": "2020-11-06T23:59:59+0000"}