{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£31,365 PA"}}, "datePosted": "2020-10-14T13:01:50+0100", "description": "&lt;p&gt;&lt;span&gt;Band 5 Medicines Management Technician – Stroke Services &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Salary £24,907 to £30,615 pa&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be involved with practice research and development of pharmacy services in Stroke.&lt;/p&gt;\n&lt;p&gt;You will be a pharmacy technician with experience working on acute or elderly medical wards. You will have excellent communication skills for effective patient counselling about their medicines.&lt;/p&gt;\n&lt;p&gt;This is a new post and you will work with a Practice Research Pharmacist supporting the existing pharmacy service to the Stroke unit and assisting the pharmacist on a project;&lt;/p&gt;\n&lt;p&gt;&quot;Pharmacist led management of anticoagulation post stroke – Impact of pharmacist intervention on DOAC initiation and patient adherence to DOAC therapy post discharge from secondary care.&quot;&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and committed colleagues to join our dynamic Stroke team to help develop and deliver a first class stroke service in Bournemouth and Poole.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting time for us following the Dorset Clinical Services Review. The Royal Bournemouth Hospital will develop into the major emergency hospital and Poole Hospital will become the major planned hospital for Dorset. The two Trusts have merged from 1&lt;/span&gt;&lt;span&gt;st &lt;/span&gt;&lt;span&gt;October 2020 to become the University Hospitals Dorset NHS Foundation Trust. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Stroke is at the forefront of these changes with the Stroke Services at The Royal Bournemouth Hospital and Poole Hospital coming together with an East Dorset Hyper-acute Stroke Unit being established at The Royal Bournemouth Hospital in September 2020. This presents an exciting opportunity for the post-holder to be directly involved in this significant transformation and the chance to help shape and develop innovative services and pathways for stroke and TIA.&lt;/p&gt;\n&lt;p&gt;The Stroke service will include hyper-acute care, provision of 24/7 stroke thrombolysis, regional 7-day TIA service, stroke rehabilitation, stroke early supported discharge, stroke outpatient/follow-up clinics and stroke research.&lt;/p&gt;\n&lt;p&gt;If you would like to find out more detail about our Stroke Services search&lt;em&gt; &#39;Future of our stroke services in Dorset&lt;/em&gt;&#39; on YouTube to find out more.&lt;/p&gt;\n&lt;p&gt;The pharmacy services are well regarded in the Trusts and recognised as a key element to any clinical development. The Pharmacy team is forward thinking; we embrace change and are constantly looking for ways to improve the service. We understand the importance of good team working and have strong links with other professions. The patient is at the centre of all that we do and our strategy is to provide a pharmacy service that has medicines optimisation at its heart. EPMA (Electronic Prescribing and Medicines Administration) has been implemented at Poole Hospital and will follow soon at the Royal Bournemouth Hospital improving the way that we work.&lt;/p&gt;\n&lt;p&gt;What does the role involve?&lt;/p&gt;\n&lt;p&gt; You will be additional to current service&lt;/p&gt;\n&lt;p&gt; Day split into 2 parts&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;o &lt;/span&gt;&lt;span&gt;Ward based &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;o &lt;/span&gt;&lt;span&gt;Research based &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;span&gt;Baseline data collection pre – enhanced service &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;span&gt;Assist B8 in day to day running of project (setting up appointments, DOAC counselling any other aspects of project management) &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;span&gt;Assist in write up &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;span&gt;Write business case for tech role &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;span&gt;Future practice based projects &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please search for our Pharmacy video on Youtube to learn more about us;&lt;/p&gt;\n&lt;p&gt;Pharmacy recruitment RBCH January 2020&lt;/p&gt;\n&lt;p&gt;Why join us?&lt;/p&gt;\n&lt;p&gt;Our staff say; &quot;We have a very friendly, welcoming and supportive workforce that helps each other even when we are up against it&quot;, &quot;The job is rewarding. I know my work makes a difference to patient care&quot; and &quot;Feel a sense of community – like everyone is looking out for you&quot;.&lt;/p&gt;\n&lt;p&gt;The Health &amp; Wellbeing of staff is high on the Trust’s agenda and there is plenty of support. The NHS provides a good pension and annual leave and bank holiday allowance.&lt;/p&gt;\n&lt;p&gt;Dorset is a superb area to live. We have access to beautiful areas such as the New Forest and the Purbecks as well as our miles of golden beaches. Bournemouth has two universities and is a vibrant town with plenty of options for entertainment. Transport links are excellent with Bournemouth airport, ferry terminals at Poole and direct train access to London.&lt;/p&gt;\n&lt;p&gt;You may be eligible for relocation costs should you be required to relocate. This will assist with relocation expenses if you live more than 40 miles from the Trust and are already a resident in the UK. Please ask for further details at interview.&lt;/p&gt;\n&lt;p&gt;Applicants must be registered as a Pharmacy Technician with the General Pharmaceutical Council.&lt;/p&gt;\n&lt;p&gt;Full-time (37.5 hours per week).&lt;/p&gt;\n&lt;p&gt;This role requires one late finish per&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Bournemouth Hospital, Bournemouth", "postalCode": "BH7 7DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7475", "longitude": "-1.8205"}}, "title": "Medicine Management Technician- Stroke Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226378", "validThrough": "2020-11-08T23:59:59+0000"}