{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pa"}}, "datePosted": "2020-10-29T15:16:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Looking for a new challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have plenty of challenges and opportunities for you to make a real difference and deliver excellent people services for our workforce of 7,000. As a busy acute Trust operating from three main sites, we deliver services for around 750,000 people in Peterborough, Stamford and Huntingdon.&lt;/p&gt;\n&lt;p&gt;You will be an experienced HR Business Partner ideally with some OD experience. You will work closely with a team of HR Business Partners and HR Advisors as well as the wider team across the whole spectrum of people services. Your knowledge of employment law and ability to problem solve and find practical solutions will be an asset to the team. Working with multiple trade unions against the back drop of national terms and conditions, you will bring a strong experience of managing and navigating complex employee relations issues.&lt;/p&gt;\n&lt;p&gt;As an HR Business Partner you will be providing HR support to our senior operational management teams at divisional level on the forward planning of workforce and organisational development as well as embedding good people practice and helping to raise managerial capability.&lt;/p&gt;\n&lt;p&gt;Ideally, but not necessarily you will have some senior public sector and/or NHS experience behind you and be passionate about innovation, change and transformation as well as excellence. With a CIPD qualification you will be a team player as well as being able to inspire others and challenge poor behaviour.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PREVIOUS APPLICANTS NEED NOT APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal conversation please contact: Fiona Tullie, Human Resources Business Partner on 01733 677871 or by email fiona.tullie@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121323.jpg", "name": "North West Anglia NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121323"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough City Hospital, Peterborough", "postalCode": "PE3 9GZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5848", "longitude": "-.278479"}}, "title": "HR Business Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248840", "validThrough": "2020-11-08T23:59:59+0000"}