{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-02T16:16:47+0000", "description": "&lt;p&gt;Bolton NHS Foundation Trust provide services across the north west side of the Greater Manchester area ranging from hospital services in Bolton to community services across Bolton, Salford, Ashton, Leigh and Wigan. We are a progressive, expanding organisation with great ambition around improving quality, integrating pathways and delivering high levels of productivity. We have recently been given a CQC rating of Good. Over 5,700 people work for the Trust and many of them have been here a long time. People find they don’t need to go elsewhere to find a fulfilling career in healthcare. The Trust offer a range of flexible working patterns to enable our staff to balance their work and personal life.&lt;/p&gt;\n&lt;p&gt;The Family Division aims to deliver the highest standards of care for maternity, sexual health, gynaecology and a range of acute and community children’s services. The Division is a Centre of Excellence for Women’s and Children’s services and has a credible and enviable reputation. We deliver over 6,000 babies and carry around 1500 gynaecological procedures each year, making us a specialist provider of health services for women, babies and their families in the North West Sector of Manchester and beyond.&lt;/p&gt;\n&lt;p&gt;Are you a passionate and caring Health Visitor who is committed to providing a high quality service to improve outcomes for children living in Bolton? We have an exciting opportunity for a motivated and enthusiastic Specialist Community Public Health Nurse - Health Visitor to join the new Bolton Children&#39;s Integrated Health and Wellbeing Service (0-19/25).&lt;br /&gt;&lt;br /&gt;As a Specialist Community Public Health Nurse you will have excellent communication skills and a broad experience of working in the community with children and their wider family. We are seeking a solution focused team player who will support the delivery of the universal offer in a 0-19 integrated neighbourhood team. You will manage a universal plus and partnership plus caseload, working collaboratively with other agencies to ensure protection and the best health outcomes for children and families in Bolton. &lt;br /&gt;&lt;br /&gt;The posts will provide an exciting challenge to the successful applicants as it involves working with a diverse range of community with varying levels of need. Specialist Community Public Health Nurses in Bolton deliver an evidence based service using a wide range of assessment and intervention tools as well as providing excellent support alongside a wider multi-disciplinary 0-19 service.&lt;/p&gt;\n&lt;p&gt;In March 2020 we launched our electronic patient record which has enhanced integrated working and offers flexibility with service delivery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants within the last 6 months need not apply.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulie SephtonJob title0-19 Public Health Nursing Team LeaderEmail addressJulie.sephton@boltonft.nhs.ukTelephone number01204 335138Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121713.png", "name": "Bolton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121713"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community, Bolton", "postalCode": "BL4 0JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.554", "longitude": "-2.42989"}}, "title": "Specialist Public Health Nurse (Health Visitor)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252805", "validThrough": "2020-11-16T23:59:59+0000"}