{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15482", "minValue": "15482", "unitText": "YEAR", "value": "£9.21 Per hour"}}, "datePosted": "2020-11-05T14:18:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a Domestic Cleaner&lt;/strong&gt;&lt;strong&gt;andlooking for Temp Work?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Oxford University Hospitals (OUH) is a world-renowned centre of clinical excellence and one of the largest NHS teaching trusts in the UK.They became a Foundation Trust on 1 October 2015 and believe that this will enable them to work more effectively in partnership with their patients and their local community to provide high quality healthcare.&lt;/p&gt;\n&lt;p&gt;They provide a wide range of clinical services, specialist services (including cardiac, cancer, musculoskeletal and neurological rehabilitation) medical education, training, and research.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Who work as a team to provide a high-level service? If yes, Oxford University Hospitals NHS Foundation Trust is the place for you.&lt;/p&gt;\n&lt;p&gt;We have a&lt;strong&gt;Full-time&lt;/strong&gt;placement opportunity available for a&lt;strong&gt;Domestic Cleaner&lt;/strong&gt;available at the Horton Hospital, Oxford Road, Banbury, Oxon OX16 9AL.&lt;/p&gt;\n&lt;p&gt;This roles duties &amp; responsibilities include: -&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide a clean and safe environment for patients, visitors, and colleagues&lt;/li&gt;\n&lt;li&gt;Keeping the ward clean and tidy and reporting any faults&lt;/li&gt;\n&lt;li&gt;Ensuring all equipment used is fully maintained, cleaned, and stored appropriately&lt;/li&gt;\n&lt;li&gt;To use resources efficiently and effectively for each cleaning task.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The key skills and knowledge they are looking for: -&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Cleaning experience (desirable, not essential)&lt;/li&gt;\n&lt;li&gt;Knowledge of COSHH (desirable, not essential)&lt;/li&gt;\n&lt;li&gt;Knowledge of colour coding system (desirable, not essential)&lt;/li&gt;\n&lt;li&gt;Both written and verbal communication skills&lt;/li&gt;\n&lt;li&gt;Ability to follow instructions and procedures&lt;/li&gt;\n&lt;li&gt;Pay attention to detail&lt;/li&gt;\n&lt;li&gt;Work as part of a team&lt;/li&gt;\n&lt;li&gt;Take responsibility for their own work&lt;/li&gt;\n&lt;li&gt;Be able to work unsupervised&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Shift Pattern is Monday-Friday 7am-3pm&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension sch&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades, and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to hearing from you soon.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that you will be contacted via e-mail throughout the recruitment process, so please check your e-mails regularly.&lt;br /&gt; &lt;br /&gt; We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;br /&gt; &lt;br /&gt; Successful applicants will be contacted after the closing date.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX16"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0624", "longitude": "-1.33915"}}, "title": "Domestic Cleaner Weekdays 7am-3pm", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258096", "validThrough": "2020-11-19T23:59:59+0000"}