{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inc"}}, "datePosted": "2020-10-14T10:01:27+0100", "description": "&lt;p&gt;&lt;span&gt;Paediatric Respiratory Physiologist - Children’s Respiratory and Sleep Service &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Bart’s Health NHS Trust&lt;/p&gt;\n&lt;p&gt;Band 5 (1 post available)&lt;/p&gt;\n&lt;p&gt;An exciting new position is available for an enthusiastic Respiratory Physiologist at the Children’s Lung Function and Sleep Service (Royal London Children’s Hospital). Our service engages in both clinical and research activity as we have close links with Queen Mary University of London. We provide secondary and tertiary paediatric respiratory services to the Hospitals of Barts Health NHS Trust.&lt;/p&gt;\n&lt;p&gt;We are part of the paediatric respiratory service which employs a multidisciplinary approach in the treatment of childhood respiratory disorders. The post holder should have excellent communication skills to work as part of a larger multi-disciplinary team (doctors, CNS’s, ward nurses, dieticians, physiotherapists, psychologists and scientists). The successful candidate will have proven experience of sleep and lung function in children, be able to work independently, participate in the running and expansion of the service and contribute to on-going research projects.&lt;/p&gt;\n&lt;p&gt;Our service provides full respiratory function testing, skin prick testing and inpatient and home sleep studies. We also have children established on NIV (CPAP/BiPAP) and some who are fully ventilated (via tracheostomy etc.).&lt;/p&gt;\n&lt;p&gt;As part of your role within a large, vibrant MDT you will attend meetings, seminars and videos conferences to develop your understanding of childhood respiratory and sleep physiology. You will be supported to attend conferences especially if presenting current research and to courses to further develop skills in sleep and lung function.&lt;/p&gt;\n&lt;p&gt;Please arrange an informal visit. Please contact us for further information.&lt;/p&gt;\n&lt;p&gt;Rasheda Choudhury&lt;/p&gt;\n&lt;p&gt;Lead Paediatric Respiratory Physiologist&lt;/p&gt;\n&lt;p&gt;Children’s Respiratory and Sleep Physiology Team (CREST)&lt;/p&gt;\n&lt;p&gt;Rasheda.Choudhury1@nhs.net&lt;/p&gt;\n&lt;p&gt;0203 594 1512/ 0203 594 6441&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal London Hospital, London", "postalCode": "E1 1FR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.059802"}}, "title": "Paediatric Respiratory Physiologist – Children’s Respiratory and Sleep", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225587", "validThrough": "2020-11-15T23:59:59+0000"}