{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 per annum pro rata incl HCAS"}}, "datePosted": "2020-11-03T11:15:30+0000", "description": "&lt;h1&gt;&lt;strong&gt;HIGHLY SPECIALIST OCCUPATIONAL THERAPIST&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Band 7 Orthopaedics/frailty - &lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;Full time - 37.5 hours - Permanent &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking to specialise in Ortho-geriatric and Frailty rehab? Are you an experienced band 6 looking for a promotion? Or an established band 7 wanting to join a vibrant and dynamic team? A new and exciting opportunity has arisen for an enthusiastic and motivated Occupational Therapist to join our dedicated department. We are passionate about patient centred care, support our clinicians to lead and deliver excellent and compassionate services, and value our clinical teams as the real heart of the NHS.&lt;/p&gt;\n&lt;p&gt;This position is for a Highly Specialist Occupational Therapist within our well-established Trauma and Orthopaedic team, working with patients who have an orthopaedic injury and/or frailty. The team covers all aspects of care for patients with a variety of co-morbidities, social and environmental challenges. The Occupational Therapist will support individuals to achieve their goals in self-care, productivity and leisure through assessment on the ward and onward referral to the Discharge to Assess team. The service is based across two sites, allowing the successful candidate to experience the fast pace of elective and trauma surgery in the acute hospital and the intense and comprehensive assessment, treatment and discharge provision at our community site in Milford.&lt;/p&gt;\n&lt;p&gt;The service works across two areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Orthopaedics&lt;/strong&gt; – within this area you will utilise your orthopaedics skills to provide rapid assessment, treatment and discharge with both elective and trauma patients. The team also provide support to fracture clinic with bracing both upper and lower limb, which we are happy to teach the successful candidate if these skills if not part of your repertoire.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Ortho/frailty rehab&lt;/strong&gt; – based at Milford community hospital this unit supports patients with both orthopaedic and frailty diagnoses. You will use your skills in complex manual handling, assessment and discharge planning, sharing your expertise of large equipment provision with junior staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a band 7 Highly Specialist Occupational Therapist you will work within a highly respected Occupational Therapy team comprising of three support workers, three junior OTs, one rotational specialist OT, and one highly specialist Occupational Therapists under the lead of an experienced Team Lead OT. The team work closely with the wider Multi-Disciplinary Team and have an excellent, well respected working relationship with Consultants, Nurses, Physios, Social Care Team and Case Managers. Our team are always looking to enhance their service in line with national guidance to provide an enhanced service to our local population.&lt;/p&gt;\n&lt;p&gt; As a Highly Specialist Occupational Therapist, you will be supported by your Team Lead to develop your knowledge and skills within orthopaedics and frailty.&lt;/p&gt;\n&lt;p&gt;Working as a valued member of the wider Multi-Disciplinary Team your role will include assessment and treatment of patients, prevention and treatment of de-conditioning, facilitation of timely and effective patient discharge, and on-going referrals to other agencies. You will also take on the responsibility of supervising band 5s and 6s. As the opportunity arises, you will be expected to take on the supervision and education of Occupational Therapy Students on placement. We pride ourselves on being a forward thinking department and it is expected that you will be integral to our department and team service development.&lt;/p&gt;\n&lt;p&gt;Our services cover 7 days per week and the post holder will be expected to work regular weekends and bank holidays. Our team offers the opportunity to ensure your work life balance is maintained by either working a routine week of five days, or completing your weekly hours over four longer days instead (e.g. 8am – 6pm 4 days per week + weekend rota). Use of own car for business use is essential.&lt;/p&gt;\n&lt;p&gt;As a department we are a friendly bunch of therapists who all work together to provide a dynamic and pro-active service to our patients. We have a range of experience and specialisms ranging from Assistants to Highly Specialist Occupational Therapists providing clinical support, and formal and informal training, and the department benefits from being managed by an Occupational Therapist who provides a strong professional lead. We have a strong commitment to clinical supervision and Continuing Professional Development; you will be regularly supervised by your team lead and attend the band 7 Occupational Therapy support groups. You will engage in service development and encouraged to put forward suggestions as to how we can enhance and grow the services we offer. We have a well-structured In-Service Training Programme which the successful applicant will be able to learn from as well as the opportunity to lead sessions with support from your team. We benefit from a well-stocked Gym which can be used by staff either before or after working times.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We offer&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Opportunities for professional &amp; personal development&lt;/li&gt;\n&lt;li&gt;In-service training &amp; post graduate education&lt;/li&gt;\n&lt;li&gt;Clinical Supervision&lt;/li&gt;\n&lt;li&gt;Flexible Working&lt;/li&gt;\n&lt;li&gt;Multidisciplinary working&lt;/li&gt;\n&lt;li&gt;Welcoming department&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Essential requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute NHS experience with a keen interest in Orthopaedics and frailty&lt;/li&gt;\n&lt;li&gt;Current HCPC registration&lt;/li&gt;\n&lt;li&gt;Own car for business use&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Royal Surrey Foundation Trust is a District General Hospital and regional cancer centre with links to a range of related services providing excellent opportunities for multidisciplinary working.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information, or for an informal visit/chat please contact: Keri Thompson – Orthopaedic OT Team lead, Suzanne Ward (Head Occupational Therapist) or Isla Pavey (Deputy Head Occupational Therapist) on 01483 571122 ext 4766. Email: suzanneward@nhs.net  or isla.pavey@nhs.net or  keri.thompson1@nhs.net  &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Occupational Therapist Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253654", "validThrough": "2020-11-17T23:59:59+0000"}