{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-06T15:46:06+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Chest Radiologist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Homerton Hospital is an acute modern hospital housed in an award-winning development serving the population of Hackney. It has good transport links via the overground to Stratford (10 mins links to Jubilee and Central lines), Highbury and Islington (8 mins links to Victoria line) and Stratford International (high speed links to Kent). The area surrounding the hospital has undergone immense change over the last few years with substantial public and private investment which has succeeded in making it an incredibly popular place to reside due to its burgeoning café society, great local parks and vastly improved schools. Hackney is a diverse area to work in and the consultant body reflects this with both UK trained and many non UK trained radiologists working in the department.&lt;/p&gt;\n&lt;p&gt;This post is being advertised as a replacement post for a retiring consultant with an interest in chest and general radiology imaging. You would be joining an established team of 12 consultants to contribute to the reporting of CT, MR, x-rays and acquisition and reporting of ultrasound. Part or full-time applications will be considered. The successful candidate would need to be competent in US/CT guided drainages, in particular lung biopsies, and would be expected to participate in the regional Chest MDT which is held at St Bartholomew Hospital where all the North East London Cancer network cases are discussed.&lt;/p&gt;\n&lt;p&gt;A second area of subspecialist interest, in particular MSK or head and neck imaging, would be desirable but is not essential.&lt;/p&gt;\n&lt;p&gt;The successful applicant would be expected to participate in the on call rota (1 in 13). Overnight (8pm to 8am) CT reporting is outsourced.&lt;/p&gt;\n&lt;p&gt;The department has 2 MR scanners, 1.5 Tesla MR scanner (GE MR450) and 3 Tesla MRI (GE750W) and a CT Toshiba Aquilon Prime. A new 2nd CT Toshiba Aquilion one is due to be installed In September 2020. In the main department the ultrasound machines are GE E8 or E9 scanners. All plain imaging acquisition is DR. The screening room is a Siemens Artis Zee.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must have, or be within 6 months of completing CCST or have an equivalent radiology qualification with GMC registration. This post is for 11 PA&#39;s, although a 10 PA contract can be negotiated. Part time applications would be considered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Informal discussions around the proposed job plan and visits are welcomed.&lt;/p&gt;\n&lt;p&gt;To arrange this please contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Emma Goldstraw - Consultant Radiologist and Interim Clinical Lead &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email:&lt;/strong&gt; e.goldstraw@nhs.net | &lt;strong&gt;Telephone:&lt;/strong&gt; 020 8510 5585 or&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Susan Rowe - Consultant Radiologist and Associate Medical Director&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email&lt;/strong&gt;: susan.rowe9@nhs.net |&lt;strong&gt;Telephone:&lt;/strong&gt; 0208 510 7524&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Homerton University Hospital NHS Foundation Trust, London", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Consultant Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916215301", "validThrough": "2020-11-09T23:59:59+0000"}