{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-23T14:16:15+0100", "description": "&lt;p&gt;Park House at North Manchester General Hospital is a dynamic Adult Mental Health In-Service user Unit, which provides high-quality care for the residents of Manchester.&lt;/p&gt;\n&lt;p&gt;We have a group of wards based within the service, including Female and Male Acute Wards, a Psychiatric Intensive Care Unit (PICU) and a Mixed Assessment Unit (SAFIRE- which stands for Swift Assessment for the Immediate Resolution of Emergencies). Each ward offers an engaging and rewarding environment, with an emphasis on multi-disciplinary team working and Safe Wards. Our focus is to provide outstanding care, consistently and enthusiastically.&lt;/p&gt;\n&lt;p&gt;Park House currently has exciting opportunities across the unit available for 2 experienced and passionate Band 6 Charge Nurses. This is the post for you if you are looking to develop your leadership skills and enhance your clinical experience, within a fast paced in-patient service.&lt;/p&gt;\n&lt;p&gt;As a Charge Nurse you will be responsible for developing and leading a team of qualified and unqualified staff in delivering outstanding care. You will also have responsibility in participating in the delivery of the Safe Wards initiative and promoting Safe Wards strategies across the unit. Working closely with the Ward Manager and the Senior Leadership Team you will have the opportunity to make a real and positive impact to the lives of our service users and their loved ones. You will be encouraged and supported to develop initiatives to further enhance the service user and staff experience. This includes contributing to supporting your team to develop professionally within their roles and providing supervision.&lt;/p&gt;\n&lt;p&gt;Your management team will ensure that you are provided with regular supervision, guidance and support to develop your knowledge and skills in terms of leadership, as well as working within a dynamic team where development is both encouraged and promoted. There is further training and development available through GMMH, including access to the Recovery Academy and Continuing Professional Development options.&lt;/p&gt;\n&lt;p&gt;Over the next few years, the Park House environment will go through a radical and exciting time of development and physical improvement. As one of our Charge Nurse’s, you will be a vital part of this process and your ideas and feedback will be fundamental in ensuring our therapeutic environment.&lt;/p&gt;\n&lt;p&gt;Please note that you are required to work a 24 hour rotation of day and night shifts and you may be required to work throughout other GMMH services as required. This ensures round-the-clock leadership on our wards and smooth running of our services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnya GilbertJob titleActing Ward ManagerEmail addressanya.gilbert@gmmh.nhs.ukTelephone number0161 271 0310Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details , please contact:&lt;/p&gt;\n&lt;p&gt;Anya Gilbert&lt;/p&gt;\n&lt;p&gt;anya.gilbert@gmmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Park House, North Manchester General Hospital, Crumpsall, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240880", "validThrough": "2020-11-06T23:59:59+0000"}