{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inc HCAS"}}, "datePosted": "2020-10-29T11:17:45+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a caring, compassionate nurse who is committed to providing the best service possible for young people?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;CNWL provides an immunisation service for children across Hillingdon, Brent, Ealing, Camden, Kensington and Chelsea, Westminster and Hammersmith and Fulham. The service is primarily delivered through a school based model, offering all school aged vaccinations. Community clinics are also offered.&lt;/p&gt;\n&lt;p&gt;We are looking for a band 5 registered nurse with an interest in working with children. Nurses with enthusiasm, energy and a passion for delivering the best care possible and have some knowledge of the childhood immunisation schedule. You will work as part of a team to organise, plan, deliver and evaluate vaccination programmes and be expected to attend immunisation sessions at school and clinics. The role involves regular early starts. The role includes working across the Inner London boroughs of Camden, Westminster, Kensington and Chelsea and Hammersmith and Fulham. Travel may be required to the schools direct each day. In disease outbreaks there may be a requirement to work across any of the boroughs. &lt;br /&gt;&lt;br /&gt;The immunisation team work closely with other services and key stakeholders such as (but not exclusive to); school nursing teams, child health department, GPs, Public Health England and NHS England commissioners.&lt;br /&gt;&lt;br /&gt;In return for your commitment we will make sure you receive the support and development you need to prepare yourself for future challenges. We provide good supervision and a first class learning experience in all aspects of community immunisation. We also make it easy for you to access continuing professional development according to the needs of the Service. CNWL is recognised locally, nationally and internationally for providing high quality, innovative healthcare. We aim to employ only the best people, and our experts are frequently called upon to contribute to national health strategy and policy, and many models of our care have been adapted for use in other countries.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePatricia StephensJob titleImmunisation Service LeadEmail addresspatriciastephens@nhs.netTelephone number0203 317 5074&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peckwater, Kentish Town, London", "postalCode": "NW5 2TX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5505", "longitude": "-.13809"}}, "title": "Immunisation Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248081", "validThrough": "2020-11-12T23:59:59+0000"}