{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53168", "minValue": "53168", "unitText": "YEAR", "value": "From £53,168 per annum, pro rata"}}, "datePosted": "2020-10-29T15:16:25+0000", "description": "&lt;p&gt;Our Young Peoples Secure Health and Wellbeing Service is looking to recruit a highly motivated, experienced Clinical Psychologist to join the team.&lt;/p&gt;\n&lt;p&gt;This post provides you with the opportunity to be part of an evolving Health and Wellbeing Team within AWP Young Peoples Secure Services. The Health and Wellbeing Team work alongside care and education staff within Swanwick Lodge Secure Children’s Home to maximise and tailor the support to both staff and young people.&lt;/p&gt;\n&lt;p&gt;Swanwick Lodge is a dynamic environment and you will be involved in continuing to lead on the implementation of a developmentally and trauma informed mental-health service model. This is based on the Secure Stairs framework across Young Peoples Secure Services in AWP and will including contact with the Secure Stairs National Clinical Implementation Team and NHS England Commissioners of services, to help ensure service delivery and fidelity to the model of care. The implementation of Secure Stairs represents a new way of working, with associated culture change and opportunities for closer working between teams both locally and nationally that such a change provides.&lt;/p&gt;\n&lt;p&gt;The primary aim of Swanwick Lodge is to provide welfare placement for those young people aged 10 – 17 years old who are detained under Section 25 of the Children’s Act 1989. Swanwick Lodge is a secure facility that provides a safe and child centred environment in which children and young people can begin to address the issues that have led to their loss of liberty. We aim to consider all aspects of the child’s well-being including physical, mental, emotional, health and substance misuse. AWP and Hanham health work in partnership to provide both mental health and primary care service at Swanwick Lodge.&lt;/p&gt;\n&lt;p&gt;This exciting and challenging post provides you with the opportunity to be involved in the ongoing development of a new model of service provision for Psychology and Health and Well Being services, within Young Peoples Secure Homes. The role will include leading on aspects of implementation in developing a more trauma informed culture across the Secure Children’s home and providing supervision for more junior colleagues, including an 8A Psychologist.&lt;/p&gt;\n&lt;p&gt;The Psychology service is part of the AWP Health and Well-being team working with the Home staff team. The team has also a Team Manager, two Mental Health Practitioners, two Recovery Workers, a Physical Health nurse, Psychiatry input and administration support. You would be expected to work as part of the MDT, and to work across staff teams, to meet the needs of the young people; this includes taking a lead role on consultation around young people and supporting more junior colleagues to engage in direct clinical work. You will require specialist knowledge and applied understanding of an evidence based treatment for trauma and have experience working clinically with young people and their families.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would welcome visits prior to the interview.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Kirsty Harrison - Clinical Psychologist - 07734 974 609 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Angela Balch - Team Manager- 07712544628 angela.balch@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO31 7HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8828", "longitude": "-1.28242"}}, "title": "Band 8b Clinical Psychologist - Southampton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248841", "validThrough": "2020-11-15T23:59:59+0000"}