{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa plus HCAS pro rata"}}, "datePosted": "2020-11-02T15:46:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Highly Specialist Clinical Psychologist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;South West London and St George&#39;s Mental Health NHS Trust has a rich history, well-established community links and an international reputation. We provide a full range of local mental health services to the Kingston, Merton, Richmond, Sutton and Wandsworth London boroughs, as well as specialist forensic mental health services, including high secure services, at Springfield Hospital.&lt;/p&gt;\n&lt;p&gt;We take pride in providing specialist care to our service users where our Trust values; being consistent, compassionate, collaborative, respectful and open is at the heart of everything we do. When you join us, you’ll be part of something special – an innovative and rapidly growing organisation that is helping to redefine the Mental Health, education and social care landscape in the UK.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Sutton and Merton Community Mental Health Learning Disability Team provides support to clients living in the boroughs of Sutton &amp; Merton with a confirmed diagnosis of Learning Disability with underlying Mental Health needs/ challenging behaviour and complex needs&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will need to be passionate about improving the quality of care and support we deliver to people with Learning disabilities and Mental Health Needs.You must be interested in working with external partners to develop supportive networks and have energy drive and enthusiasm for working with complex case load ,delivering assessments which require clear communication across all agencies.You will be responsible for providing a specialist psychology service to adults with learning disabilities including those with mental health problems and challenging behaviour.You will work independently as an autonomous practitioner with full responsibility for highly complex clinical work and be accountable for all clinical decisions&lt;/p&gt;\n&lt;p&gt;This post is for the Merton part of the service&lt;/p&gt;\n&lt;p&gt;All clients that live in the Borough of Merton will be seen at the Wilson Hospital in Mitcham .&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The team is based at the Jubilee Health Centre East Building 1 ,6 Stanley Park Road Wallington Surrey SM6 0EX&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;we support a range of flexible options, such as: part-time working, job sharing, term-time working, compressed hours and working from home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Subsidised car parking&lt;/strong&gt; - You can park at any of our sites at a reduced rate of £20/month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Eye examinations&lt;/li&gt;\n&lt;li&gt;Looking after your health&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Car lease scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;li&gt;Free gym membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGerry WrafterJob titleTeam ManagerEmail addressGerry.Wrafter@swlstg.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jubilee Health Centre, Wallington", "postalCode": "SM6 0EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3574", "longitude": "-.150294"}}, "title": "Highly Specialist Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252707", "validThrough": "2020-11-16T23:59:59+0000"}