{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-27T13:00:28+0000", "description": "&lt;p&gt;The South West Yorkshire Partnership NHS Foundation Trust (SWYPFT) provides community, mental health and learning disability services to the people of Barnsley, Calderdale, Kirklees and Wakefield. The Trust also provides some medium secure (forensic) services to the whole of Yorkshire and the Humber.&lt;/p&gt;\n&lt;p&gt;The Trusts Procurement department is able to offer an exciting opportunity for an enthusiastic, motivated and experienced Senior Contract Manager to form part of the department’s management team and contribute to the provision of effective contract management and performance services and to assist with the delivery of the Trusts cost improvement programme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Reporting to the Head of Procurement you will be an integral member of a small management team providing and managing a professional purchasing service to the Trust, contributing to the development and achievement of the Trusts procurement strategy and work plan. The post holder will support the Head of Procurement on procurement issues and lead on key projects. As a Senior Contracts Manager you will work closely with the Trusts Business Delivery Units and Quality Academy to ensure that the robust governance, performance management, delivery and quality assurance of the procurement department are maintained. You will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;look to develop, identify procurement opportunities and efficiencies from the Trusts recently implemented Oracle general ledger and procurement system.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;lead on tender projects where it is considered appropriate by the Head of Procurement.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;look to work collaboratively (where feasible) on purchasing opportunities with other local NHS Trusts including those within our Integrated Care System (ICS).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;have the autonomy to let contracts tendered for on behalf of the Trust having ensured that the internal approval protocols have been complied with and fully adhered to.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;ensure that the service is sensitive, responsive and flexible to the changing needs of the Trust balanced against the need to remain cost effective, the main task being to provide a strong and effective professional management focus leading to the achievement of agreed targets, efficiencies and added value initiatives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;present the procurement function as a progressive, proactive, responsive and innovative concern in order to generate and drive uptake of negotiated contracts. Working closely with stakeholders to influence choice, prioritise change and deliver savings, process improvement and product standardisation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;manage assessment and Personal Development of staff including setting objectives and personal goals for subordinate staff, identifying appropriate training arising from Personal Appraisals and Personal Development Plans and ensuring that mandatory staff training is kept up to date.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;act as a first point of contact for all specialist Procurement queries from subordinate staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Promote the benefits of effective procurement by influencing managers and clinicians to embrace the innovative alternatives to contribute towards the overall strategic aim of improving quality of care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;be required to adopt an agile working approach to the activities undertaken within the role. This will mean that you will not be expected to be work from one designated location within the Trust and will therefore be required to operate from multiple sites as deemed suitable/appropriate by the Head of Procurement.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;will be required to deputise on behalf of the Head of Procurement at formal meetings up to and including Trust Board level as and when the need arises.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post is seen as a development role with the aim to progress further within the procurement department. The previous post holder was successful in achieving promotion within the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Chartered Institute of Purchasing and Supply qualified, a degree or substantial experience working in Procurement in a supervisory capacity&lt;/li&gt;\n&lt;li&gt;A full knowledge and understanding of the terms and conditions of contract&lt;/li&gt;\n&lt;li&gt;A full understanding of European Legislation associated with competitive tendering and contract awards.&lt;/li&gt;\n&lt;li&gt;Demonstrable knowledge of Procurement, Customer Care and Supply Chain Management&lt;/li&gt;\n&lt;li&gt;Experience of working under pressure to strict deadlines and prioritising workload&lt;/li&gt;\n&lt;li&gt;Demonstrable IM&amp;T Skills including Purchase Order systems, Microsoft Office solutions and Electronic Tendering packages&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further information about this post please contact Tony Cooper, Head of Procurement on telephone number 07917 206334 or by email at tony.cooper@swyt.nhs.uk .&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 3SP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6988", "longitude": "-1.49218"}}, "title": "Senior Contracts Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244628", "validThrough": "2020-11-17T23:59:59+0000"}