{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 per annum (including HCA)"}}, "datePosted": "2020-10-15T13:31:32+0100", "description": "&lt;h1&gt;Fundraising Officer - band 5&lt;/h1&gt;\n&lt;p&gt;Help us go further for hospital patients, local communities and NHS staff in Surrey and Sussex.&lt;/p&gt;\n&lt;p&gt;SASH Charity is the charity for Surrey and Sussex Healthcare NHS Trust (SASH), raising funds to help patients and staff at East Surrey Hospital, Crawley and Horsham hospitals, and across the wider area served by SASH NHS Trust.&lt;/p&gt;\n&lt;p&gt;We are a small but ambitious charity, which seeks to be at the cutting edge of similar sized organisations nationally, so we can deliver real impact here in Surrey and Sussex at this unprecedented time and in years to come.&lt;/p&gt;\n&lt;p&gt;The NHS Trust which we support was recently rated as outstanding by the Care Quality Commission, ranking it among the very best in the country, and we are building a charity to match this. Something our local community and hospital staff can be proud of.&lt;/p&gt;\n&lt;p&gt;The Fundraising Officer will be a key appointment for our future development, and will work as part of a small charity team to deliver high quality, professional fundraising and donor stewardship across a range of channels.&lt;/p&gt;\n&lt;p&gt;This will include researching and writing applications to charitable trusts and foundations, developing and managing new and existing corporate relationships, managing relationships with individual donors and community groups and playing an important role in communicating about the charity to a range of audiences, online and offline. As part of a small charity team, the role is varied and requires an organised and self-motivated individual with broad fundraising and communications skills.&lt;/p&gt;\n&lt;p&gt;The role would suit either an experienced fundraiser with proven skills in the areas above, or someone with demonstrable transferable skills from another sector.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with excellent written and in person communication skills, and a clear thinking, self-motivated and organised approach.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to play a valuable role in helping the NHS go above and beyond for patients and staff, at this unprecedented time, while being a key part of an ambitious and fast moving charity.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Andrew Bickerdike&lt;/p&gt;\n&lt;p&gt;Fundraising Manager&lt;/p&gt;\n&lt;p&gt;andrew.bickerdike@nhs.net&lt;/p&gt;\n&lt;p&gt;07966235171&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Fundraising Officer - band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228408", "validThrough": "2020-11-09T23:59:59+0000"}