{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-11-06T14:31:03+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What We Do&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Directorate works primarily on the John Radcliffe and Churchill Hospital sites in Oxford and the Horton Hospital in Banbury. The Directorate provides expert care a range of conditions and is recognised for its integration with research. The Gastroenterology, Endoscopy and SUWON Theatres Directorate covers several core services which are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Gastroenterology and Hepatology - including a Gastroenterology and Hepatology ward (John Radcliffe), daycase units (John Radcliffe and Horton) and outpatient activity delivered across all sites. The daycase unit at the Horton also support daycase surgical activity.&lt;/li&gt;\n&lt;li&gt;Endoscopy – we have eight endoscopy rooms (six at the John Radcliffe and two at the Horton Hospital.&lt;/li&gt;\n&lt;li&gt;SUWON Theatres – based over three sites the Directorate manages 19 operating theatres supporting a range of specialities including cancer and transplant services.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will the role of Deputy Operational Manager do?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible to leading and delivering success across a number of key programmes within the Directorate. These programmes will be vital in ensuring the Directorate can deliver its primary objectives and targets over the coming years and will encompass a wide range of topics, including productivity and efficiency, quality, workforce and clinical effectiveness. The DOSM will have specific responsibility for delivery of the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Creation and maintenance of an activity dashboard for the directorate&lt;/li&gt;\n&lt;li&gt;Management of performance against key national access targets&lt;/li&gt;\n&lt;li&gt;Leading on recruitment and management of Junior Doctors&lt;/li&gt;\n&lt;li&gt;Business cases development&lt;/li&gt;\n&lt;li&gt;Deputising for the OSM&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All NHS organisations are operating under extreme pressures and this role will help to facilitate long term change not only within OUH, but also the wider health economy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How We Can Help You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Oxford University Hospitals NHS Foundation Trust prides itself on its investment in staff both in terms of developing career and life skills but also its commitment to staff health and well-being. We offer fantastic support and opportunities for our staff including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An environment that fosters continuous development of the individual and the team&lt;/li&gt;\n&lt;li&gt;Access to development courses&lt;/li&gt;\n&lt;li&gt;Joining a large supportive team with a wealth of change experience&lt;/li&gt;\n&lt;li&gt;Exposure to projects across one of the largest NHS teaching hospitals in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who We Are Looking For&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In order to deliver the transformation and leadership required, we are looking to appoint a passionate, enthusiastic, motivated and dynamic individual with the following qualities and experience:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Well-honed performance management skills&lt;/li&gt;\n&lt;li&gt;Ability to deliver standards and meet deadlines&lt;/li&gt;\n&lt;li&gt;A full range of IT skills&lt;/li&gt;\n&lt;li&gt;Experience in writing business cases and reports&lt;/li&gt;\n&lt;li&gt;Resilience and ability work in a pressurised environment&lt;/li&gt;\n&lt;li&gt;Understanding and appreciation of clinical pathways&lt;/li&gt;\n&lt;li&gt;Ability to engage and lead teams through change&lt;/li&gt;\n&lt;li&gt;Ability to act as an expert negotiator&lt;/li&gt;\n&lt;li&gt;Ability to build excellent working relationships&lt;/li&gt;\n&lt;li&gt;Highly organised&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will be required to demonstrate the Trust&#39;s values, the responsibilities of the job description and person specification. Please detail in your application how you have proven experience of working on change or service improvement projects.&lt;/p&gt;\n&lt;p&gt;If you believe you meet the criteria of the person specification and would like to join Gastroenterology, Endoscopy and SUWON Theatres Directorate at Oxford University Hospitals, we would be keen to receive your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date: 22nd-November-2020&lt;/p&gt;\n&lt;p&gt;Planned Interview Date: TBC&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJessica SlaterJob titleOperational Service ManagerEmail addressjessica.slater@ouh.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Jessica Slater - Operational Service Manager (Jessica.Slater@ouh.nhs.uk)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Churchill/JR/Horton, Oxford", "postalCode": "OX3 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Deputy Operational Service Manager Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260130", "validThrough": "2020-11-22T23:59:59+0000"}