{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T12:17:31+0000", "description": "&lt;p&gt;TEWV were successfully awarded a new Mental Health contact for the NE prisons in 2020. Additional funding has been provided to expand the service at HMP Durham and we are therefore looking for enthusiastic and skilled nurses to join our growing team.&lt;/p&gt;\n&lt;p&gt;You will be required to be; innovative, flexible and able to engage clients with complex needs. Strong team working principles are essential and you will network with a variety of people as well as work in partnership with a range of different agencies both internal and external to the prison.&lt;/p&gt;\n&lt;p&gt;This is an opportunity for experienced clinicians to join a busy team working in a rewarding environment where you will get to practice a full range of psychiatric nursing interventions. You will be required to have strong skills in the management of a caseload, coordinate and plan care for those with complex needs and work autonomously making decisions based on comprehensive mental health and risk assessment.&lt;/p&gt;\n&lt;p&gt;HMP Durham is a reception prison serving the courts of the East and West of northern England. The prison houses adult male remand prisoners throughout trial and into the early stages of sentencing.&lt;/p&gt;\n&lt;p&gt;We require the post holders to be committed to equal opportunities and non-discriminatory practices and reflect the trust values.&lt;/p&gt;\n&lt;p&gt;Applicants must ensure that prior to applying they have agreement from their current line manager that they can be released on a secondment basis.&lt;/p&gt;\n&lt;p&gt;A visit to the prison or an informal discussion about the post is encouraged.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Phil Flanagan, Team Manager&lt;/p&gt;\n&lt;p&gt;0191 332 3597&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Durham, Durham", "postalCode": "DH1 3HU"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.7734", "longitude": "-1.56696"}}, "title": "Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246559", "validThrough": "2020-11-11T23:59:59+0000"}