{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 per annum inc"}}, "datePosted": "2020-10-21T08:15:57+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Norbury Ward&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen on Norbury Ward a twelve bedded Forensic Medium Secure Psychiatric Intensive Care Ward (MSU PICU) in River House. Norbury Ward specialises in the assessment and comprehensive treatment of people with a broad spectrum of acute and enduring mental health needs. We provide care and treatment to inpatients that are experiencing the most acute phase of a mental illness. Our aim is to manage and reduce the risks associated with acute episodes of mental illness through evidence-based assessment and treatment, and psychosocial interventions for individuals and their families.&lt;/p&gt;\n&lt;p&gt;We are looking for highly skilled and enthusiastic Band 5 nurses to work within our multi professional team. You will be part of a caring and compassionate team that is committed to supporting patients through their recovery journey. This is an exciting role and one that gives you the opportunity to work in a purpose built, modern and progressive forensic service and to develop your therapeutic relationships with patients.&lt;/p&gt;\n&lt;p&gt;You will need to be passionate about mental health and supporting forensic patients It is important for you to be committed to working within a multi professional team, as well as possessing excellent communication, risk assessment and care planning skills. An excellent communicator, you’ll be able to build good relationships with patients their families as well as other stakeholders.&lt;/p&gt;\n&lt;p&gt;We are looking for ambitious staff with the desire for self-development. We offer regular clinical and managerial supervision as well as promoting continuous professional development to provide you with opportunities to progress and ensure that best practice is embedded in clinical provision. We support our staff through a well-structured Trust Induction, Mandatory Training, monthly professional and clinical supervisions, staff appraisals, robust Preceptorship Programme, support for continual professional development activities, weekly Reflective Practice, staff meetings, psychosocial meetings and team events such as team away days. We also offer a number of clinical and professional development opportunities.&lt;/p&gt;\n&lt;p&gt;We especially encourage newly Qualified (or about to qualify) to apply. As a newly qualified Registered Nurse, you’ll have sound post-qualification experience working in a well-established Forensic PICU . You will be exposed to all you need to learn about the fundamentals of Psychiatric Nursing including thorough assessment of mental health needs, a clear understanding of positive risk management, along with a working knowledge of clinical diagnosis and the legal context of mental health care provision in a forensic setting.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the Location and Unit&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Based on Bethlem Royal Hospital in Beckenham, London, River House is 89 bedded purpose built Medium Secure Unit for patients who need care and treatment in a secure environment. The unit as state of the art building is designed to provide comprehensive and specialised care to people with broad spectrum of acute and enduring mental health needs. These 93 beds form part of the full 120 forensic estate, including a Low Secure Unit and Open Rehab.&lt;/p&gt;\n&lt;p&gt;Our Forensic Offender Health pathway provides care and treatment for individuals experiencing mental health issues and having offending history. We aim to ensure that by providing on-going assessment, treatment, support and risk management, assessment resulting in diversion at the earliest opportunity from the criminal justice system and preventing recidivism&lt;/p&gt;\n&lt;p&gt;Our inpatient secure service supports people who, as a consequence of their mental health needs, have had contact with the legal system and require a safe and secure environment that enables them to receive a wide range of treatments, therapies and care to assist in their recovery. We primarily serve patients in Lambeth, Southwark and Croydon. The patient, at the centre, is supported holistically by a truly multi-professional clinical team who work collaboratively with the patient, their carers, friends and family and other partner organisations.&lt;/p&gt;\n&lt;p&gt;Our aim is to improve mental health, protecting the public and reducing re-offending. As such we strive to promote recovery and rehabilitation, enable the reduction of risks posed and ultimately enable the individual to leave the secure environment for one less restrictive. Whilst someone needs support from our inpatient services we provide a caring and safe environment within a secure clinical setting that promotes the rights of each person to be fully involved in their care and treatment and to receive the highest standards of care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If successful at shortlisting stage you will be contacted regarding the next stage. &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;**Please note that if you do not state the month and year that you have completed your Nursing qualification you will not be invited to the assessment.**&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Ward Name &amp; Location: Norbury, River House, Bethlem Royal Hospital, Beckenham&lt;br /&gt;Patient Age Range: From 18 years&lt;br /&gt;Patient Gender: Male Only&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and sup&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bethlem Royal Hospital, Beckenham, London", "postalCode": "BR3 3BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3809", "longitude": "-.029726"}}, "title": "RMN or RNLD (NHS), Medium Secure PICU (Norbury Ward)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235528", "validThrough": "2020-11-07T23:59:59+0000"}