{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "(£) 31,365 - 37,890 Per Annum Pro Rata"}}, "datePosted": "2020-10-05T12:43:37+0100", "description": "&lt;p&gt;This is an exciting opportunity to appoint a Governance Support Nurse who is enthusiastic and self-motivated. The Support Nurse will be joining a dedicated and dynamic team whose aim is to drive quality improvements and enhance safety across the Coastal integrated Service Unit (ISU) based at Torbay Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will work closely with the Clinical Governance Co-ordinator, Associate Director of Nursing and Professional Practice within the Coastal ISU and the Patient Safety Team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You must be able to build effective working relationships and support the promotion of a culture that upholds quality and safety to ensure that the clinical quality governance and risk management agenda is proactively managed and consistently delivered&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; The successful candidate will have excellent communication, and this position will &lt;span&gt;&lt;span&gt;offer the opportunity to develop skills in incident investigation using root cause analysis. You will liaise frequently with area leads to support the management of local incidents and provide specialist advice on a range of diverse issues that arise on a daily basis to Trust employees at all levels. You will be required to analyse and compare complex facts or situations, and interpret findings to support continuous improvement.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a part time permanent position working 15 hours per week at Band 6&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;For further information regarding the primary duties and responsibilities, please see the combined job description and person specification.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torquay, Torbay Hospital", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Clinical Governance Support Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212744", "validThrough": "2020-11-15T23:59:59+0000"}