{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-11-04T09:46:34+0000", "description": "&lt;p&gt;&lt;strong&gt;Improvement Lead NHS England and NHS Improvement South West&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking for an exciting new challenge?&lt;/p&gt;\n&lt;p&gt;The Improvement Lead post is a new role designed to support the Head of Improvement Capability for the South West region.&lt;/p&gt;\n&lt;p&gt;We are ambitious, this role is integral to ensuring we deliver our own goals and also to shape how we work with organisations across the South West Region.&lt;/p&gt;\n&lt;p&gt;This opportunity comes at a unique time. We have valuable learning to take forward into how we work for the future in addition to our previous knowledge skills and expertise.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be a highly experienced improvement coach and practitioner. They will demonstrate significant experience and success in designing, supporting and delivering measurable and sustainable improvement&lt;/p&gt;\n&lt;p&gt;The role will be both demanding and highly rewarding, it will require:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to Improvement coaching and staff development&lt;/li&gt;\n&lt;li&gt;Passion for improving quality of care and the experience patients and their families have of our services.&lt;/li&gt;\n&lt;li&gt;Commitment to making improvement skills accessible and relevant to everyday activity.&lt;/li&gt;\n&lt;li&gt;Experience of working at a senior level to identify improvement priorities, develop improvement plans and work collaboratively to deliver improved care for patients&lt;/li&gt;\n&lt;li&gt;Experience of working a senior level to coach, train and facilitate improvement&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you have the experience detailed in the job description and person specification, we would be delighted to receive your application&lt;/p&gt;\n&lt;p&gt;The role is based in the South West Region, based from any one of our regional offices. On lifting of current travel restrictions there will be a requirement to travel across the SW region, with occasional national travel.&lt;/p&gt;\n&lt;p&gt;For further information please contact Ann Hill, Head of Improvement Capability (ann.hill3@nhs.net)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnn HillJob titleHead of Improvement CapabilityEmail addressann.hill3@nhs.netTelephone number07526 179203&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Any South West Base, Bristol/Taunton/Chippenham/Gloucester/Saltash", "postalCode": "TA1 2PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0141", "longitude": "-3.0681"}}, "title": "Improvement Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255245", "validThrough": "2020-11-11T23:59:59+0000"}