{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata per annum"}}, "datePosted": "2020-10-29T16:31:02+0000", "description": "&lt;p&gt;Nurse Specialist - Urology (Band 7) Prostate Cancer &lt;br /&gt;________________________________________&lt;br /&gt;An exciting opportunity has arisen for a dynamic, motivated and innovative Band 7 Nurse Specialist to join our prostate cancer team based at Freeman Hospital Newcastle.&lt;br /&gt;Freeman Hospital is a Urological Cancer Centre providing diagnostics as well as state of the art treatments including robotic prostatectomy, brachytherapy and radiotherapy. This is a very busy unit and you will play a key role in ensuring we meet NHS Cancer waiting time targets whilst maintaining the patient experience and supporting them and their families through all stages of their cancer pathway.&lt;br /&gt;The successful candidate will work as part of the Prostate cancer team and will play a vital role in supporting the delivery of high quality patient centered care at the same time as ensuring we meet both local and national agendas surrounding prostate cancer care.&lt;br /&gt;Whilst knowledge of the care required for patients with prostate cancer would be advantageous we will be happy to consider applications from candidates who have significant , broader relevant oncology experience &lt;br /&gt;We are particularly looking for applicants who have a desire to join our team in leading on and giving superb care now and have the drive and enthusiasm to help shape care for our patients of the future. In addition to supporting the care of patients with prostate cancer a key component of this role is supporting the care of patients undergoing investigation of haematuria. The successful applicant will be responsible for reviewing the current pathway , make recommendations for improvement and implement changes in practice &lt;br /&gt;The successful applicant must be a Registered Nurse with extensive post registration experience within the specialist area of practice , and be educated to Degree level plus have specialist qualifications/experience within specialist area. If you are reliable, hardworking, flexible and self-motivated and can demonstrate excellent communication skills, then this position could well be for you.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Part time 32 Hours/week&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 01 Freeman Hospital", "postalCode": "NE7 7DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0028", "longitude": "-1.59341"}}, "title": "Urology Oncology Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249103", "validThrough": "2020-11-15T23:59:59+0000"}