{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T14:35:43+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an Urgent Care Officer to provide project and business support within the Urgent Care Commissioning team to achieve the East Sussex Health and Social Care Plan and Integrated Urgent Care Programme in Brighton and Hove and East Sussex.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated individual, who has proven administration and organisational skills, ideally gained in the NHS or other public sector organisation. The successful applicant will play an integral role in the Urgent Care team and work closely with CCG colleagues and a range of partner organisations, including local authorities and providers, to support the commissioning of high quality and cost-effective Urgent Care services across the health system.&lt;/p&gt;\n&lt;p&gt;The post holder will have excellent IT skills with a sound knowledge and understanding of all Microsoft applications. By providing a range of project support functions, the Urgent Care Officer will be involved in the planning and implementation of new models of care, which aim to deliver improved outcomes for our local population.&lt;/p&gt;\n&lt;p&gt;The post-holder will be required to work within the strategic and operational framework set by the local Executive Managing Director, alongside colleagues within the Operations Directorate, to assist in the delivery of objectives.&lt;/p&gt;\n&lt;p&gt;For an informal chat about the post please contact Kate Naylor, Urgent Care Manager on 07917 837362 / kate.naylor@nhs.net&lt;/p&gt;\n&lt;p&gt;Closing date: Wednesday 18th November 2020&lt;/p&gt;\n&lt;p&gt;Interview date: Thursday 26th November 2020&lt;/p&gt;\n&lt;p&gt;We reserve the right to close applications early if a high number of applications are received before the closing date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex NHS Commissioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton", "postalCode": "BN12 6BT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8175", "longitude": "-.411487"}}, "title": "Urgent Care Officer, Urgent Care Commissioning", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256250", "validThrough": "2020-11-18T23:59:59+0000"}