{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Pro Rata Per Annum"}}, "datePosted": "2020-11-06T13:16:35+0000", "description": "&lt;p&gt;An excellent opportunity for a Staff Nurse who is committed to high quality care for children, young people and their families. The Division operates a rotational policy, when necessary, across both sites in order to meet service and development needs.&lt;/p&gt;\n&lt;p&gt;The Children&#39;s Ward is an inpatient ward with 18 beds and 2 high dependency beds. Caring for medical, ENT, surgical, and orthopaedic patients.&lt;/p&gt;\n&lt;p&gt;Our Trust is a first-wave foundation trust, being one of just ten Trusts in the country awarded Foundation Trust status in 2004. We serve a population of over 410,000 people in the areas covered by Bassetlaw District Council and Doncaster Metropolitan Borough Council, as well as from parts of North Derbyshire, Barnsley, Rotherham, and north-west Lincolnshire.&lt;/p&gt;\n&lt;p&gt;Working as part of a team of Medical Staff, Nurses, Play Leaders, Healthcare Assistants and Housekeepers, you will be responsible for providing the highest standard of evidenced based patient care.&lt;/p&gt;\n&lt;p&gt;Based within Children’s Services where our main services are at Doncaster Royal Infirmary and Bassetlaw Hospitals. The Division is progressive and innovative, continually striving to improve services for children, young people and their families.&lt;/p&gt;\n&lt;p&gt;It is essential that you are registered as RSCN / RNC.&lt;/p&gt;\n&lt;p&gt;There are opportunities to undertake a range of professional and personal development activities.&lt;/p&gt;\n&lt;p&gt;We are perfectly positioned, with the major regional centres, Nottingham, Leeds and Sheffield on our doorstep and the Robin Hood International Airport is in close proximity to the Trust. There is access to delightful countryside in North Nottinghamshire, Derbyshire and Yorkshire. There are excellent leisure facilities and low cost housing.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are a newly qualified Staff Nurse please apply via our Trust Wide advert where you will have the opportunity to specify your area of choice / interest, please email dbth.recruitment@nhs.net for further details.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Sam Fawkes - Senior Sister, samantha.fawkes1@nhs.net, 01302 642778&lt;/p&gt;\n&lt;p&gt;Matt Timms - Matron for Children&#39;s, matthewtimms@nhs.net, tel: 01302 642201.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN2 5LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5308", "longitude": "-1.10926"}}, "title": "Staff Nurse within Children&#39;s Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259856", "validThrough": "2020-11-15T23:59:59+0000"}