{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inc. HCAS"}}, "datePosted": "2020-10-27T18:00:32+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Analyst&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;18 months Fixed-Term due to funding&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a passionate, values-driven Analyst to support Imperial College Health Partners in delivering complex change by bringing a breadth of economic, statistical, and analytical skills. You will also bring energy and empathy to bear in the development, execution, and management of the data analysis within projects.&lt;/p&gt;\n&lt;p&gt;Imperial College Health Partners (ICHP) is seeking candidates with a passion for population health and data analytics to join our growing Information Directorate.&lt;/p&gt;\n&lt;p&gt;ICHP is a partnership organisation bringing together NHS providers of healthcare services, clinical commissioning groups and leading universities across North West London. We have been designated by NHS England as the Academic Health Science Network (AHSN) for North West London, and we are one of 15 AHSNs across England which make up The AHSN Network.&lt;/p&gt;\n&lt;p&gt;At ICHP we believe that innovation can be a powerful trigger to create new ways of working. &lt;br /&gt;Through working with world leading hospitals, community providers, commissioners and universities, we match health challenges with new innovations. This helps our partners provide the best possible health and care outcomes for North West London’s 2.3 million residents.&lt;/p&gt;\n&lt;p&gt;Our strategic priorities are to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Innovate and collaborate for a healthier population making a real measurable impact; and&lt;/li&gt;\n&lt;li&gt;Diversify our customer base in order to broaden our income sources and work where we can have the largest impact.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our organisation has a range of talents and experiences, bringing knowledge, skills and experience to the way we connect with our stakeholders.&lt;/p&gt;\n&lt;p&gt;At a time where collaboration and innovation are crucial to help meet some of healthcare’s most pressing challenges, there has never been a better time to join us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Analyst will support ICHP’s delivery of complex change by bringing a breadth of economic, statistical, and analytical skills. You will also bring energy and empathy to bear in the development, execution, and management of the data analysis within projects.&lt;/p&gt;\n&lt;p&gt;The role primarily focuses on the quantitative analysis required to help a stakeholder’s characterise the issues they face, the options they have, or to evaluate the impact of changes made. This requires the postholder to understand why analysis is being undertaken, how the outputs are intended to be used, as well as helping to define how we should undertake the particular method of analysis.&lt;/p&gt;\n&lt;p&gt;The role also interfaces with others who play key roles in helping to design projects and products for stakeholders and clients – including those with expertise in innovation &amp; design, safety &amp; quality improvement, transformation support, data infrastructure development, and data analysis (including extraction, processing, and visualisation).&lt;/p&gt;\n&lt;p&gt;The successful candidate will actively participate in the development and culture of ICHP as an organisation, sharing responsibility for making ICHP a great place to work.&lt;/p&gt;\n&lt;p&gt;Analysts are part of a development pool of analysts within ICHP, with the intention to support skills development through both structured learning and ‘on the job’ practical application of skills and practices.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key responsibilities include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Helping to develop specific analysis, methods, and/or tools that can be used for the purpose of population health improvement.&lt;/li&gt;\n&lt;li&gt;Working with clients and stakeholders from operational, clinical, and commercial backgrounds to understand and define the question we are trying to answer.&lt;/li&gt;\n&lt;li&gt;Working with complex and senior clients, stakeholder, and colleagues to develop logic models for analysis, and to produce and document data specifications that form the basis of the analysis to be undertaken.&lt;/li&gt;\n&lt;li&gt;Interrogating highly complex healthcare data sets to become an expert on the data in question, using robust and advanced methods that are robust and proportionate to the task and the project size.&lt;/li&gt;\n&lt;li&gt;Working with other colleagues within a project team to derive meaningful insight from analysis to help clients and stakeholders to understand what actions to take as a consequence of the analysis that has been undertaken.&lt;/li&gt;\n&lt;li&gt;Sharing with colleagues within ICHP relevant information about your work so that it is visible to people working on other related areas.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held in the week commencing 23 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Amanda Lucas, Associate Director of Partnerships &amp; Data Infrastructure&lt;/p&gt;\n&lt;p&gt;Amanda.Lucas@imperialcollegehealthpartners.com&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Imperial College Health Partners, London", "postalCode": "NW1 2FB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5265", "longitude": "-.13467"}}, "title": "Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245604", "validThrough": "2020-11-10T23:59:59+0000"}